{"sections":[{"title":"Book Reviews Generalized Quantifiers: Linguistic and Logical Approaches","paragraphs":["lack of an index. An even greater deficit is the absence of a comprehensive bibliography. One could receive the false impression that the book is a first work by the group (it builds directly on Harris 1982, 1988), or that they are the only group working in sublanguage (cf. the collections by Kittredge and Lehrberger (1982) and Grishman and Kittredge (1986). The absence of references to related work in theoretical or computational linguistics makes the book much less accessible to readers unfamiliar with the sublanguage approach. This is truly unfortunate since there are many fruitful correspondences.","In summary, the book offers a clear description of a much-needed methodology for knowledge acquisition, and a concise, formulaic representation for science information. It is highly recommended to anyone developing text-processing applications in restricted semantic domains. REFERENCES","Grishman, R. and Kittredge, R. (eds.) 1986 Analyzing language in restricted domains: Sublanguage description and processing. Erlbaum Associates, HiUsdale, New Jersey.","Grishman, R.; Hirschman, L. and Nhan, N. 1986 Discovery procedures for sublanguage selection patterns: Initial experiments. Computational linguistics 12(3): 205-215.","Harris, Z. 1982 A grammar of English on mathematical principles. Wiley-Interscience, New York.","Harris, Z. 1988 Language and information. Columbia University Press, New York.","Hirschman, L.; Grishman, R.; and Sager, N. 1975 Grammaticallybased automatic word class formation. Information processing and management 11: 39-57.","Hirschman, L.; Grishman, R.; and Sager, N. 1976 From text to structured information: Automatic processing of medical reports. AFIPS conference proceedings 45, AFIPS Press, Montvale, N J: 267-275.","Johnson, S. 1987 An analyzer for the information content of sentences. Ph.D. dissertation, New York University.","Kittredge, R. and Lehrberger, J. (eds.) 1982 Sublanguage-- Studies of language in restricted semantic domains. De Gruyter, New York.","Sager, N. 1975 Computerized discovery of semantic word classes in scientific fields. Directions in artificial intelligence: Natural language processing. Courant Computer Science Report 7, Courant Institute of Mathematical Sciences, New York University: 27--48.","Sager, N. 1978 Natural language formatting: The automatic conversion of texts to a structured data base. In: M. Yovits (ed.), Advances in computers 17, Academic Press, New York: 89-162.","Sager, N. 1986 Sublanguage: Linguistic phenomenon, computational tool. In: Grishman and Kittredge 1986: 1-18.","Sager, N.; Friedman, C.; and Lyman, M. 1987 Medical language processing--Computer management of narrative data. Addison-Wesley, Reading, MA.","Steedman, M. 1989 Combinators and grammars. In: Oehrle, R.; Bach, E.; Wheeler, D. (eds.), Categorial grammar and natural language structures. Reidel, Dordrecht: 417--442. Stephen Johnson is an associate research scientist in the Center for Medical Informatics at Columbia University, conducting research in active databases and natural language processing for medical applications. He holds a doctorate in computer science from New York University, where he was a member of the Linguistic String Project. His dissertation presented an implementation of a parsing algorithm based on Operator Grammar. Johnson's address is: Center for Medical Informati.cs, 161 Fort Washington Ave., AP-1310, New York, NY 10032. E-mail: adjohnson@cuhsda.bitnet GENERALIZED QUANTIFIERS: LINGUISTIC AND LOGICAL APPROACHES Peter Giirdenfors (ed.) (Department of Philosophy, Lund University) Dordrecht: D. Reidel, 1987, vii + 307 pp. (Studies in linguistics and philosophy 31) ISBN 1-55608-017-4, $74.00, £59.00, Dfl 158.- (hb) Revierved by Kenneth Ray Trent University This collection of 10 papers incorporates proceedings of the 1985 Lund conference on generalized quantifiers (GQ). Research on GQ was brought into natural language analysis in 1981 by Barwise and Cooper in their \"Generalized quantifiers and natural language\". The aim was to elevate model-theoretic analysis of NL phenomena from a sterile exercise in formalization to a valuable stimulus in development of linguistic theory. Following Montague's PTQ, generalized quantifiers were treated not as the determiner expressions in a noun phrase (NP), but rather as the entire NP construction. An NP determiner functions to select a family of sets from the head noun's extension as the denotation for the NP. Interpretation of the noun denotation as a restriction upon the domain of quantification then allows for uniform semantics for NPs, encompassing non-logical determiners, (e.g., most, a few), along with the traditional logical determiners such as every and some.","The articles in this volume pick up on this theme by extending the GQ analysis to many of the syntactically varied forms of NP constructions. At least four distinct approaches to semantic interpretation are considered, showing the interest in exploring alternatives to the possible worlds interpretations of Montague.","Jon Barwise and Robin Cooper each have contributions that incorporate interpretive structures from situation semantics in building an alternative to Montague's model-lLheoretic interpretations. Situation semantics offers a more intuitive and simplified domain of individuals, properties, and facts for model-theoretic construction than the intensional domain of functions across possible worlds. Because the focus is on logical investigations into the semantic properties of GQs, however, computational issues concerning implementation of the proposed semantic models are not explored. Accordingly the volume is directed to those with well-developed research interests in formal methods, focusing on modeling a variety of NP phenomena. Other themes explored within these fine-grained treatments of quan-192 Computational Linguistics, Volume 15, Number 3, September 1989 Book Reviews Generalized Quantifiers: Linguistic and Logical Approaches tificational phenomena include the empirical adequacy of GQ for such NP constructions as plurals and mass terms, and the integration of GQ theory with logics for intensional contexts and discourse analysis. In each case the task is to find a logic that captures the structures we use in language, rather than offer a reductionistic analysis.","Barwise, in his contribution \"Noun phrases, GQ, and anaphora\", introduces the conception of a dynamic model for variable assignment (a model for a speaker's production of utterances with anaphora). On this new, \"better\" formal semantics, semantic values take the form of constraints upon the input and output variable assignments that are part of a sentence's denotation. The notion of constraint captures the idea that language users must interpret variable assignments on the basis of incomplete or partial information. Combining the representation of constraints as partial variable assignments with Barwise's dynamic interpretations, we get a picture of the gradual build-up of pronominal antecedents. When two sentences are combined to form a discourse, the output assignment for the first is matched with the input assignment for the second. Thus, the co-indexing of NPs is mediated by the set-theoretic composition of input and output assignments. Barwise extends GQ theory to handle the puzzles of singular reference and restricted NPs in \"donkey\" sentences (\"Every man who owns a donkey beats it\") and related phenomena that were not resolved in the original GQ paper. In fact the dependent/antecedent relation his model develops applies to such non-pronominal relations as reference via other and a singular NP in simple comparatives (e.g., \"John is taller than every other logician.\") (Recent work on the Candide system reported by Pollack and Pereira (1988) implements a theoretically similar approach to non-compositional in-teractions of semantic interpretation with pragmatic context in determination of NP reference.)","Rooth's paper picks up on this theme and develops the case for a systematic isomorphism between Kamp's discourse representation semantics (1981), in which a separate, intermediate level of discourse structure is introduced, and an interpretive model of Heim's (1982) \"file-change semantics\", similar to Barwise's dynamic model. In both accounts, indefinite NPs are treated as introducing free variables, not quantifiers as in the GQ analysis. Rooth's comparison finds that the theory of \"indefinites as variables\" is not in fact essential to the empirical success of Kamp's and Heim's analysis of anaphora and conversational implicature.","Model-theoretic semantics has traditionally been conducted without regard to the computational complexity of the denotational assignments. The Montague tradition builds up interpretations of expressions in accordance with rules for compositionality that ignore the computational complexity of the language. Van Benthem's methodological premise for his \"Towards a computational semantics\" is that basic terms in natural language should correspond to procedurally simple interpretations. Van Benthem uses the hierarchy of automata as his benchmark for complexity, and seeks out those natural language constructions whose semantic interpretations require jumps in the hierarchy. Quantitiers are characterized by the automata that control acceptance of strings describing the algebraic properties of a domain of discourse. First-order quantifiers emerge as those that may be \"computed\" by acyclic finite state machines; the knowledge of domain cardinality required for interpretation of GQ-like most and several leads to the introduction of memory via push-down automata. Full Turing-machine functionality is required for some attempts to represent classificatory properties as comparative quantifiers (e.g., interpreting the attribute tall as taller than most).","Van Benthem contemplates the extension of this compositional semantics to modal operators (beginning with negation), and in an extended appendix considers the prospects for relating semantic complexity to a realistic account of learnability and mental processing.","Each paper in this anthology is valuable for extending the published theoretical results by some of the leading researchers in the field. The treatments are penetrating, both in the formal understanding of noun phrases in their multifarious forms, and the illumination of recent alternative domains for the model-theoretic structures that capture a wide range of the expressive power of natural language. REFERENCES","Barwise, Jon and Cooper, Robin 1981 Generalized quantifiers and Natural language. Linguistics and philosophy 4: 159-219.","Heim, I. 1982 The semantics of definite and indefinite noun phrases. Doctoral dissertation, University of Massachusetts.","Kamp, Hans 1981 A theory of truth and semantic representation. In Formal methods in the study of language, Groenendijk, J., Janssen, T., and Stokhof, M. (eds.) Mathematical Centre, Amsterdam.","Pollack, Martha and Pereira, Fernando 1988 An integrated framework for semantic and pragmatic interpretation. Proceedings of the 26th Annual Meeting of the Association for Computational Linguistics, Buffalo. Kenneth Ray is an assistant professor with the Computer Studies Programme at Trent University. He received his Ph.D. in philosophy from the University of Cincinnati in 1986 and his M.Sc. in computer science from Wright State University in 1987. Current research interests include the analysis of heuristics for quantificational scoping in natural language. His address is: Computer Studies Programme, Trent University, Peterborough Ontario, Canada K9L 1P2. E-mail: rayk@ trentu.ca. Computational Linguistics, Volume 15, Number 3, September 1989 193"]}]}