{"sections":[{"title":"ABSTRACTS OF CURRENT LITERATURE","paragraphs":["Selected Dissertation Abstracts","Compiled by: Susanne M. Humphrey","National Library of Medicine","Bethesda, MD 208!)4 Bob Krovetz University of Massachusetts Amherst, MA 0100.2 The following are citations selected by title and abstract as being related to computational linguistics or knowledge representation, resulting from a computer search, using the BRS Information Technologies retrieval service, of the Dissertation Abstracts International (DAI) database produced by University Microfilms International.","Included are the UM order number and year-month of entry into the database; author; university, degree, and, if available, number of pages; title; DAI subject category chosen by the author of the dissertation; and abstract. References are sorted first by DAI subject category and second by author. Citations denoted by an MAI reference do not yet have abstracts in the database and refer to abstracts in the published Masters Abstracts International.","Unless otherwise specified, paper or microform copies of dissertations may be ordered from University Microfilms International, Dissertation Copies, Post Office Box 1764, Ann Arbor, MI 48106; telephone for U.S. (except Michigan, Hawaii, Alaska): 1-800-521-3042, for Canada: 1-800-268-6090. Price lists and other ordering and shipping information are in the introduction to the published DAI. An alternate source for copies is sometimes provided at the end of the abstract.","The dissertation titles and abstracts contained here are published with permission of University Microfilms International, publishers of Dissertation Abstracts International (copyright 1987,1986,1985) by University Microfilms International, and may not be reproduced without their prior permission. Imprecise Reasoning in Intelligent Decision Support Systems DAI V47(12), SecA, pp4439 Basu, Amit The University of Rochester Ph.D. 1986, 180 pages Business Administration, Management University Microfilms International ADG87-08218 In this thesis, a formal methodology to support reasoning with imprecise knowledge in computer-based decision support systems is developed. Many important decision problems are highly unstructured, and cannot be solved adequately using preset algorithms. Much of the complexity of such problems lies in the reasoning needed to determine how to solve individual problem instances. Existing decision support systems do not provide much reasoning support, largely due to the difficulty of representing and manipulating the fragmented and imprecise knowledge that is generally available. The methodology developed in this dissertation provides a basis for the design of Intelligent Decision Support Systems (IDSS) in which heuristic problem solving methods can be used to support reasoning as well as data retrieval and numerical computation.","The dissertation consists of three parts. First, a logic based framework for reasoning is developed. The basic constructs of First Order Logic (FOL) are supplemented with constructs and mechanisms for automatic model manipulation, resulting in a powerful framework for IDSS development. Next, the need to distinguish between two different sources of imprecision, namely fuzziness and uncertainty is established, and methods for formally representing and mechanically manipulating fuzzy and/ or uncertain knowledge within the logic framework are developed. Finally, the strengths of the imprecise reasoning methodology are demonstrated by implementing a prototype IDSS to support imprecise reasoning and examining the prototype's performance on sample problems. i Computational Linguistics, Volume 15, Number 1, March 1989 60 Abstracts of Current Literature Explanation Generation From Algebraic Specification Through Hyperresolution and Demodulation: Automated Heuristic Assistance DAI V48(02), SecB, pp493 Christensen, Margaret H. Temple University Ph.D. 1987, 276 pages (Volumes I and II) Computer Science University Microfilms International ADG87-11310 Reasoning With Incomplete Information: Investigations of Non-Monotonic Reasoning DAI V48(01), SecB, pp185 Etherington, David William The University of British Columbia (Canada) Ph.D. 1986 Computer Science This item is not available from University Microfilms International ADG05-60031","This research shows how IDSS can be developed for unstructured problems even when the available knowledge is imprecise, and also demonstrates the versatility of such a system. For instance, the imprecision measures provide useful bases for comparing alternative solutions, even solutions that are \"close misses\"; evaluation of solutions is also possible for each subproblem. Information about imprecision can be used not only to interpret solutions, but also to control the problem solving process itself. Furthermore, the generation of useful results is often possible even if some of the available information is highly imprecise, sometimes even if some information is missing. Such features can be very useful in supporting unstructured decision making, yet cannot readily be supported by a system limited to precise reasoning. AHA delivers semantic help to users of interactive systems. It possesses the following six capabilities: (1) it can report the user's current state; (2) it can list all of the commands which are legal in the user's current state; (3) it can explain the meaning of a given command; (4) it can explain how the user got to the current state; (5) it can explain the consequences of the issuance of hypothetical commands from the current state; (6) it can tell the user how to get to a goal state, and if requested, explain why this will do the job. Knowledge about the software is represented through algebraic specification and question answering is handled by a resolution-based theorem prover with demodulation for the treatment of equality. A demonstration version is implemented for a subset of DEC command language. Intelligent behavior relies heavily on the ability to reason in the absence of complete information. Until recently, there has been little work done on developing a formal understanding of how such reasoning can be performed. We focus on two aspects of this problem: default or prototypical reasoning, and closed-world or circumscriptive reasoning.","After surveying the work in the field, we concentrate on Reiter's default logic and the various circumscriptive formalisms developed by McCarthy and others. Taking a largely semantic approach, we develop and/or extend model-theoretic semantics for the formalisms in question. These and other tools are then used to chart the capabilities, limitations, and interrelationships of the various approaches.","It is argued that the formal systems considered, while interesting in their own rights, have an important role as specification/evaluation tools vis-a-vis explicitly computational approaches. An application of these principles is given in the formalization of inheritance networks in the presence of exceptions, using default logic. Computational Linguistics, Volume 15, Number 1, March 1989 61 Abstracts of Current Literature Natural Language Dialogue in an Integrated Computational Model DAI V48(01), SecB, pp186 Frederking, Robert Eric Carnegie-Mellon University Ph.D. 1986, 173 pages Computer Science University Microfilms International ADG87-09383 Knowledge Retrieval As Specialized Inference DAI V47(12), SecB, pp4957 Frisch, Alan Mark The University of Rochester Ph.D. 1986, 127 pages Computer Science University Microfilms International ADG87-08227 62 Natural language dialogue is a continuous, unified phenomenon. Speakers use their conversational context to simplify individual utterances through a number of linguistic devices, including ellipsis and definite references. Yet most computational systems for using natural language treat individual utterances as separate entities, and have distinctly separate processes for handling ellipsis, definite references, and other dialogue phenomena.","The computational system presented here, Psli3, uses the uniform framework of a production system architecture to carry out natural language understanding and generation in a well-integrated way. This is demonstrated primarily using intersentential ellipsis resolution, in addition to examples of definite reference resolution and interactive error correction. The system's conversational context arises naturally as the result of the persistence of the internal representations of previous utterances in working memory. Natural language input is interpreted within this framework using a modification of the syntactic technique of chart parsing, extended to include semantics, and adapted to the production system architecture. It provides a graceful way of handling ambiguity within this architecture, and allows separate knowledge sources to interact smoothly across different utterances in a highly integrated fashion.","The design of this system demonstrates how flexible and natural user interactions can be carried out using a system with a naturally flexible control structure. A processing-based taxonomy for ellipsis resolution that we developed is used to analyze our coverage of intersentential ellipsis. The semantic chart parser is further extended to allow several closely related sentences to be treated in a single chart. This allows the relationship between the sentences to be used in a simple way to select between competing alternative interpretations, and provides a natural means of resolving complex elliptical utterances.","We describe this system in detail, and include a number of extensive examples of the system's processing during user interactions. Artificial intelligence reasoning systems commonly contain a large corpus of declarative knowledge, called a knowledge base (KB), and provide facilities with which the system's components can retrieve this knowledge. This thesis sets out to study the very nature of retrieval. Formal specifications that capture certain informal intuitions about retrieval are developed, studied, and implemented by retrieval algorithms.","Consistent with the necessity for fast retrieval is the guiding intuition that a retriever is, at least in simple cases, a pattern matcher, though in more complex cases it may perform selected inferences such as property inheritance.","Seemingly at odds with this intuition, this thesis views the entire process of retrieval as a form of inference and hence the KB as a representation, not merely a data structure. A retriever makes a limited attempt to prove that a queried sentence is a logical consequence of the KB. When constrained by the no-chaining restriction, inference becomes indistinguishable from pattern-matching. Imagining the KB divided into quanta, a retriever that respects this restriction cannot combine two quanta in order to derive a third. Computational Linguistics, Volume 15, Number 1, March 1989 Abstracts of Current Literature Feature Structures: A Logical Theory With Application to Language Analysis DAI V48(02), SecB, pp495 Kasper, Robert T. The University of Michigan Ph.D. 1987, 150 pages Computer Science University Microfilms International ADG87-12145","The techniques of model theory are adapted to build nonprocedural specifications of retrievability relations, which determine what sentences are retrievable from the KB's. Modeltheoretic specifications are presented for four retrievers, each extending the capabilities of the previous one. Each is accompanied by a rigorous investigation into its properties, and a presentation of an efficient, terminating algorithm that probably meets the specification.","The first retriever, which operates on a propositional language, handles only yes/no queries, the second also handles wh-queries, and the third allows quantifiers in the KB and the query. Each is shown to be, in some sense, the strongest retriever that meets the no-chaining restriction.","The third retriever forms an excellent basis for integrating a specialized set of inferences that chain in a controllable manner. This is achieved by incorporating taxonomic inference, such as inheritance, to form the fourth retriever, an idealized version of the retriever incorporated in the ARGOT natural language dialogue system. It is characterized by its ability to infer all consequences of its taxonomic knowledge without otherwise chaining. Feature structures are used for the representation of linguistic information in several grammar formalisms for natural language processing. These structures are a type of directed graph, in which arcs are labeled by names of features, and nodes correspond to values of features.","As a step in constructing a parser for a large Systemic Functional Grammar of English, a general mapping is described from systemic descriptions to the type of feature structures used in Functional Unification Grammar. Experiments carried out with a trial version of the parser revealed that existing methods of unification could not effectively handle descriptions containing a large amount of disjunction. Subtle difficulties were also discovered in defining a precise interpretation for some kinds of disjunctive feature descriptions.","In order to clarify the interpretation of feature descriptions, a new sort of logic is developed. The formulas of this logic can be precisely interpreted as descriptions of sets of feature structures. A complete calculus of equivalences is defined for these formulas, providing a sound basis for the simplification of feature descriptions. The consistency problem for formulas of the logic is shown to be NP-complete, with disjunction as the dominant source of complexity. This result indicates that any complete unification algorithm for disjunctive descriptions will probably require exponential time in the worst-case. However, an algorithm has been designed with a much better average performance, by factoring formulas according to laws of equivalence and using a method of successive approximation. This algorithm has been implemented and tested as part of the experimental parser for Systemic Functional Grammar with favorable results. The implementation also extends the PATR-II grammar formalism, by providing an effective way to use disjunction in the statement of a grammar. The methods presented are generally applicable to any computational system which uses feature structures, as well as to the description of large grammars for natural language analysis. Computational Linguistics, Volume 15, Number 1, March 1989 63"]}]}