{"sections":[{"title":"O ¢q Computational Linguistics Volume 15, Number 2 June 1989 TABLE OF CONTENTS","paragraphs":["A Pragmatics-Based Approach to Ellipsis Resolution ................... 75 Sandra Carberry Parsing with a Small Dictionary for Applications such as Text to Speech .......... 97 Douglas D. O'Shaughnessy"]},{"title":"Technical Correspondence","paragraphs":["Cross-Vowel Phonotactic Constraints ......................... 109 Stuart Davis On the Logic of Category Definitions ......................... 111 Marcus Kracht"]},{"title":"Book Reviews","paragraphs":["The Case for Lexicase: An Outline of Lexicase Grammatical Theory ............ 114"]},{"title":"Reviewed by","paragraphs":["Norman Fraser Computers and Languages: Theory and Practice .................... 115"]},{"title":"Reviewed by","paragraphs":["Richard S. Rosenberg Remnants of Meaning ................................ 116"]},{"title":"Reviewed by","paragraphs":["Morena Danicli Machine Translation Today: The State of the Art ..................... 117"]},{"title":"Reviewed by","paragraphs":["John Hutchins Advances in Natural Language Generation: An Interdisplinary Perspective ......... 120"]},{"title":"Reviewed by","paragraphs":["Marie Meeter Natural Language Parsing Systems .......................... 122"]},{"title":"Reviewed by","paragraphs":["Petr Sgall Philosophy, Language and Artificial Intelligence: Resources for Processing Natural Language. 124"]},{"title":"Reviewed by","paragraphs":["Peter Ludlow Systemic Text Generation as Problem Solving ...................... 126"]},{"title":"Reviewed by","paragraphs":["Eduard Hovy Briefly Noted .................................... 127 Books Received ................................... 128 Abstracts of Current Literature ............................ 13t)"]},{"title":"Published Quarterly by the MIT Press for the Association for Computational Linguistics Computational Linguistics ISSN 0362-613X Formerly the American Journal of Computational Linguistics","paragraphs":["Published four times a year by the MIT Press for the Association for Computathmal Linguistics. Editor Managing Editor Book Review Editor The FINITE STRING Editor Editorial Board Members 1987-89: 1988--90: 1989-92: James F. Allen Computer Science Department University of Rochester Rochester, NY 14627, USA (+ I 716) 275-5288; INTERNET:acl@cs.rochester.edu Donald E. Walker Bellcore, MRE 2A379 445 South Street, Box 1910 Morristown, NJ 67960-1910, USA (+ 1 201) 829-4312 ; INTERNET:walker@flash.bellcore.com Graeme Hirst Department of Computer Science University of Toronto Toronto, CANADA M5S IA4 (+ 1 416) 978-8747'; INTERNET:gh@ai.toronto.edu Ralph M. Weischedei BBN Systems & Technologies Corporation I0 Moulton Street Cambridge, MA 02238, USA (+ I 617) 491-1850; INTERNET:weischedel@bbn.com Branimir Boguraev, University of Cambridge Lynette Hirshman, Unisys Kimmo Koskenniemi, University of Helsinki C. Raymond Perrault, SRI International Geoff Pullum, University of California, Santa Cruz William J. Rapaport, SUNY Buffalo William Rounds, University of Michigan Bonnie Lynn Webber, University of Pennsylvania Eugene Charniak, Brown University Erhard Hinrichs, University of Illinois Bente Maegaard, University of Copenhagen Carl Pollard, Carnegie-Mellon University Hozumi Tanaka, Tokyo Institute of Technology Robert Wilensky, University of California at Berkeley Robert J. P. lngria, BBN Systems & Technologies Corporation Christopher S. Mellish, University of Edinburgh Jeffrey Pelletier, University of Alberta Martha Pollack, SR! International Patti Jo Price, SRI International Masaru Tomita, Carnegie-Mellon University Mary McGee Wood, University of Manchester Copyright © 1989 by the Association for Computational Linguistics. The code and copyright notice appearing at the bottom of the first page of an article in this journal indicate the copyright owner's consent that a single copy of the article may be made for personal use. Any copier must pay for copying beyond that permitted, by Sections 107 and 108 of the U.S. Copyright Law. The per-copy fee for each article is $3.00 and is to be paid through the Copyright Clearance Center, Inc., 27 Congress Street, Salem, MA 01970. This consent does not apply to other kinds of copying, such as copying for general distribution, for advertising and promotional purposes, for creating new collective works, or for resale. Such permission requests and other permission inquiries should be addressed to the Managing Editor at the address given above. Individual Subscriptions to Computational Linguistics are available only with membership in the Association for Computational Linguistics (ACL). Annual Membership Dues are as follows: personal, $25.00; full-time student with current ID, $15.00, joint for couples with one subscription, $30.00. A membership application together with an order form for i)ack issues and conference proceedings is included at the end of this issue. Send membership applications and address changes to Dr. Donald E. Walker (ACL) Bellcore, MRE 2A379, 445 South Street, Box 1910, Morristown, NJ 07960-1910, USA. Institutional Subscriptions are $60.00. Outside the U.S. and Canada, add $9.01) surface mail or $17.00 airmail postage. They should be ordered through the MIT Press. Send institutional subscription orders and address changes to MIT Press Journals, 55 Hayward Street, Cambridge, Massachusetts 02142-1399 USA. Institutions should order back issues and proceedings from the ACL at the address above. Computational Linguistics is abstracted and/or indexed in the following publications: Annual Review of Science and Technology, Computing Reviews, Knowledge Engineering Review, Language and Language Behavior Abstracts, Linguistics Abstracts, Linguistic Bibliography, and Science Abstracts (INSPEC Section C). Beginning with Volume 14, Computational Linguistics is available on microfilm through University Microfilms International, 300 North 7eeb Road, Ann Arbor, MI 48106."]}]}