{"sections":[{"title":"","paragraphs":["Book Reviews Books Received This book is devoted to mathematical four~dations of categorial grammar, and to its linguistic and philosophical applications. There are two survey papers on the history of the discipline and current trends, and 17 research papers, twelve of which are new and five of which are reprints of 'classics.' PROPERTIES, TYPES, AND MEANING. VOLUME h FOUNDATIONAL ISSUES, AND VOLUME II: SEMANTIC ISSUES Gennaro Chierchia, Barbara H. Partee, and Raymond Turner (eds.) (Cornell University; University of Massachusetts; and","University of Essex) Dordrecht: Kluwer Academic Publishers, 1989, Vol I: viii + 258 pp., Vol II: viii + 307 pp. (Studies in linguistics and philosophy 38 and 39) Vol I: ISBN 1-55608-067-0, Dfl 135.00, $69.00, £39.00 (hb); Vol II: ISBN 1-55608-069-7, Dfl 145.00, $77.00, £42.00 (hb) Contents of volume I: Algebraic semantics for intensional logics, by Peter Aczel; Motivating ramified type theory, by Richmond Thomason; Two issues in the foundations of semantic theory, by Raymond Turner; Self-reference, attitudes, and paradox, by Nicholas Asher and Hans Kamp; On properties and property theory, by Michael Jubien; Fine-grained type-free intensionality, by George Bealer; Semantic typechange and syntactic recognition, by Johan van Benthem.","Contents of volume H: Type-shifting rules and the semantics of interrogatives, by Jeroen Groenendijk and Martin Stockhof; On the semantic content of the notion of \"thematic role,\" by David Dowty; Structured meanings, thematic roles, and control, by Gennaro Chierchia; On the semantic composition of English generic sentences, by Gregory Carlson; Generically speaking or using discourse representation theory to interpret generics, by Lenhart Schubert and Francis Jeffry Pelletier; Realism and definiteness, by Henk Zeevat. LANGUAGE PROCESSING IN SOCIAL CONTEXT Rainer Dietrich and Carl F. Graumann (eds.) (University of Heidelberg) Amsterdam: North-Holland, 1989, ix + 302 pp. (North-Holland linguistic series 54) ISBN 0-444-87144-6, Dfl 225.00, $109.75 (hb) This book presents an interdisciplinary analysis of social, cognitive, situational, and contextual aspects of language and language processing by first and second language speakers. Linguists and psychologists formulate theoretical models and empirical analyses of the influence of such factors as on various levels of language processing. These relate specifically to syntactic and semantic parsing, lexical selection, and text production. The issue of \"hearer orientation\" in language use lies at the forefront of interest in this anthology, and is tackled from such different fields as linguistics, text linguistics, formal semantics, social psychology, psychology of language, artificial intelligence, and second language acquisition.","--From the publisher's announcement The contents of the volume are: Language processing in social context: An interdisciplinary view, by Rainer Dietrich and Carl F. Graumann; Grammatical construction theory and the familiar dichotomies, by Charles J. Fillmore; Referential movement in descriptive and narrative discourse, by Christiane von Stutterheim and Wolfgang Klein; The theoretical description of speaker-hearer hypotheses, by Klaus Mudersbach; Perspective setting and taking in verbal interaction, by Carl F. Graumann; Collaborating on contributions to conversations, by Herbert H. Clark and Edward F. Schaefer; Inference in language understanding: What, when, why, and how, by Alan Garnham; Requests in different contexts, by Theo Herrmann and Peter Winterhoff-Spurk; The representation of knowledge and the use of knowledge in discourse comprehension, by Walter Kintsch; The three phases (faces?) of second-language research, by Barry McLaughlin; Communicating with few words: An empirical account of the second language speaker's lexicon, by Rainer Dietrich; Language learning in social context: The view from research in second language learning, by Lily Wong Fillmore. BOOKS RECEIVED Books listed below that are marked with a t will be reviewed in a future issue.","Readers who wish to review books for the journal should write, outlining their qualifications, to the book review editor, Graeme Hirst, Department of Computer Science, University of Toronto, Toronto, Canada M5S 1A4. Obviously, we cannot promise the availability of books in anyone's exact area of interest.","Authors and publishers who wish their books to be considered fi~r review in Computational Linguistics should send a copy to the book review editor at the address above. All books received will be listed, but not all can be reviewed.","Proceedings, First International Conference on Principles of Knowledge Representation and Reasoning (KR '89), Toronto, May 1989 edited by Ronald J. Brachman, Hector J. Levesque, and Raymond Reiter (AT&T Bell Labs and University of Toronto) San Mateo, CA: Morgan Kaufmann Publishers, 1989, ix + 520 pp. ISBN 1-55860-032-9 (sb)","Readings in cognitive science: A perspective from psychology and artificial intelligence edited by Allan Collins and Edward E. Smith (BBN Systems & Technologies Corporation and University of Michigan) San Marco, CA: Morgan Kaufmann Publishers, 1988, ix + 661 pp. ISBN 0-55860-013-2 (sb)","tNaive semantics for natural language understanding by Kathleen Dahlgren (IBM Los Angeles Scientific Center) Boston: Kluwer Academic Publishers, 1988, x + 258 pp. (The Kluwer international series in engineering and computer science; Natural language processing and machine translation) ISBN 0-89838-287-4, $52.50 (hb)","tRelalional models of the lexicon: Representing knowledge in semantic networks edited by Martha Walton Evens (Illinois Institute of Technology) Cambridge, England: Cambridge University Press, 1988, ix + 300 pp. (Studies in natural language processing) ISBN 0-521-36300-4, $34.50 [20% discount to ACL membeI's] (hb)","English-Japanese, Japanese-English dictionary of computer and data-processing terms by Gene Ferber Cambridge, MA: The MIT Press, 1989, 470 pp. ISBN 0-262-06114-7, $75.00 (hb)","Knowledge in flux: Modeling the dynamics of epistemic states by Peter Gfirdenfors (Lund University) Cambridge, MA: The MIT Press, 1988, xi + 262 pp. ISBN 0-262-07109-6, $27.50 (hb) 212 Computational Linguistics, Volume 15, Number 3, September 1989 Book Reviews Books Received","tStudies in computer-aided lexicology edited by Martin Gellerstare (Department of Computational Linguistics, University of G6teborg) Stockholm: Almqvist & Wiksell International, 1988, 375 pp. (Data linguistica 18) ISSN 0347-948X, ISBN 91-22-01258-3, SEK 287.00 (hb)","Resolving semantic ambiguity edited by David S. Gorfein (Adelphi University) New York: Springer-Verlag, 1989, xii + 337 pp. (Cognitive science series) ISBN 0-387-96906-3 and 3-540-96906-3 (sb)","Essentials of functional grammar: A structure-neutral theory of movement, control, and anaphora by George M. Horn (University of Newcastle, NSW, Australia) Berlin: Mouton de Gruyter, 1988, x + 404 pp. (Trends in linguistics, studies and monographs 38) ISBN 3-11-011286-8 and 0-899-25348-2, DM 154.- (hb)","Logic-based knowledge representation edited by Peter Jackson, Han Reichgelt, and Frank van Harmelen (McDonnell-Douglas Research, University of Nottingham, and University of Edinburgh) Cambridge, MA: The MIT Press, 1989, xv + 255 pp. (MIT Press series in logic programming) ISBN 0-262-10038-X, $35.00 (hb)","tAttribute-value logic and the theory of grammar by Mark Johnson (Brown University) Stanford, CA: Center for the Study of Language and Information, 1988, xi + 162 pp. (CSLI lecture notes 16) ISBN 0-937073-37-7, $37.50 (hb); ISBN 0-937073-36-9, $15.95 (sb) (Distributed by the University of Chicago Press)","Sparse distributed memory by Pentti Kanerva (NASA Ames Research Center) Cambridge, MA: The MIT Press, 1989, xxii + 155 pp. ISBN 0-262-11132-2, $24.95 (hb)","tSpeaking: From intention to articulation by Willem J.M. Levelt (Max-Planck-Institut ftir Psycholinguistik) Cambridge, MA: The MIT Press, 1989, xvii + 566 pp. (ACL-MIT Press series in natural-language processing) ISBN 0-262-12137-9, $39.95 (hb) [20% discount to ACL members]","Symbolic communication: Signifying calls and the police response by Peter K. Manning (Michigan State University) Cambridge, MA: The MIT Press, 1989, xvii + 309 pp. (The MIT Press series on organization studies) ISBN 0-262-13234-6, $35.00 (hb)","Categorial investigations: Logical and linguistic aspects of the Lambek calculus by Michael Moortgat Dordrecht: Foils Publications, 1988, xiii + 285 pp. (Groningen-Amsterdam studies in semantics 9) ISBN 90-6765-387-X (sb)","tMachine translation: How far can it go? by Makoto Nagao (Kyoto University) Oxford: Oxford University Press, 1989, xii + 150 pp. ISBN 0-19-853739-5 (hb)","Charles Carpenter Fries: His 'oral approach' for teaching and learning foreign languages edited by William E. Norris and Jeris E. Strain (Georgetown University and Sofia University) Washington, DC: Georgetown University Press, 1989, vii + 69 pp. ISBN 0-87840-277-2, $7.95 (sb)","tLanguage technology [journal], issues 1-12 edited by Louis Rossetto Amsterdam: Language Technology BV, Bimonthly ISSN 0921-2787, $40/year personal, $70/year institutional, Air mail $10/year extra","Parallel logic programming techniques by Stephen Taylor (California Institute of Technology) Englewood Cliffs, NJ: Prentice Hall, 1989, xiv + 205 pp. ISBN 0-13-648767-X (hb)","Artificial intelligence: A handbook of professionalism by Blay Whitby Chichester, England: Ellis Horwood, 1988, 194 pp. (Ellis Horwood series in artificial intelligence foundations and concepts) ISBN 0-7458-0350-4 and 0-470-21103-2 (hb) Computational Linguistics, Volume 15, Number 3, September 1989 213"]}]}