{"sections":[{"title":"A Semanc Suy on Yam Onology n Traonal Songs Yn-Sheng Ta D. Vcora Rau Meng-Chen Yang Providc Uivrity, Providc Uivrity, Providc Uivrity, Tawan y Tawan y Tawan wrap2@msn.com hrau@pu.eu.w mcyang2@pu.eu.w Absrac","paragraphs":["Th purpo of thi tudy wa to provid a xampl of how to build a Yami otology from traditioal og by mployig Protégé, a op-ourc tool for ditig ad maagig otologi dvlopd by Staford Uivrity. Followig Cocptual Bldig Thory (Faucoir ad Turr, 1998), w foud that Yami popl u th cocptual mtaphor of “fihig” i traditioal og wh praiig th hot’ diligc i a crmoy clbratig th compltio of a workhou. Th proc of buildig otologi i xplord ad illutratd. Th propod cotructio of a otology for Yami traditioal og ca rv a a fudamtal tmplat, uig th corpu availabl oli from th Yami documtatio wbit (http://yamiprojct.c.pu.du.tw/yami) to build otologi for othr domai."]},{"title":"1 Inroucon","paragraphs":["Yami i a dagrd Autroia laguag, pok o Orchid Ilad (Layu), 46 kilomtr outhat of th mai ilad of Taiwa. For th purpo of laguag documtatio ad prrvatio, a o-li Yami dictioary1","ha b dvlopd to facilitat laguag larig. Although ach lxical try cotai baic maig of word (i both Eglih ad Chi), prouciatio, ad root ad affix, o iformatio o lxical matic, uch a yoym, hypoym, or mtaphor i availabl. If iformatio o lxical rlatiohip could b icorporatd ito th Yami dictioary, thi oli tool would b v mor uful for Yami laguag larr.","I th prt tudy, w focud o th mtaphor i Yami lyric. Kight (2005) coidr that, from a Yami ativ pakr’ poit of viw,","1 Availabl from th followig IP addr: http://yamiprojct.c.pu.du.tw/lar/arch.php “Raod” (traditioal og) play a importat rol i cultur bcau thy ubum fatur uch a archaim, mtaphor, pu ad polit cotradictio. I additio, Yami traditoal og rflct Yami valu, uch a lov ad hoorig hard work (.g. fihig or farm work), ad cultural vt, uch a compltio of hard work ad pcial ftival. Thu, w would lik to build a otology uig Yami traditioal og, adaptig th taxoomi i WordNt ad SUMO, which ca rv a a poit of dpartur for furthr mappig of othr Yami otologi. I thi papr, w will rport our prlimiary rult, givig o xampl at thi arly tag of th rarch projct o cotructig Yami otology, ld by th cod ad third author."]},{"title":"2 Leraure Revew 2.1 Concepual Meaphor Theory","paragraphs":["Th origial Cocptual Mtaphor Thory wa propod by Lakoff ad Joho (1980). Thy idtify mtaphor a a trafr btw th ourc domai ad th targt domai. Thi ha bcom kow a th “two-domai thory” of mtaphor. 2.2 Concepual Blenng Theory","Cocptual Bldig Thory (Faucoir ad Turr, 1998; 2002) i a framwork for itrprtig cogitiv liguitic phoma uch a aalogy, mtaphor, tc. Accordig to Cocptual Bldig Thory, th iput tructur, gric tructur, ad bld tructur i th twork ar mental ace. I Figur 1, th fram tructur rcruitd to th mtal pac i rprtd a a rctagl ithr outid or icoically iid th circl. Fgure 1. Concepual Blenng Theory The 6th Workshop on Asian Languae Resources, 2008 81 2.3 Proégé","I thi tudy, w ar buildig a Yami otology bad o traditioal og uig Protégé2",", which ot oly provid a rich t of baic kowldgmodlig tructur ad a way to tr data, but ca alo b cutomizd to crat w domai i kowldg modl.","A dmotratd i prviou tudi (.g., Dodd, 2005; Li 2006), Protégé ha b uccfully applid to cotructio of otology i pcific domai. Thrfor, th prt tudy ud Protégé to cotruct a otology of Yami traditioal og."]},{"title":"3. Mehoology 3.1 Daa Collecon","paragraphs":["Th mai data rourc cam from Dog’ moograph (1994) “n Praie of Taro,” which cotai a total of 250 og. Thi tudy i bad o o og which cotai may fihig mtaphor. Sv mtaphorical tok wr xtractd from thi og. 3.2 Daa Analyss","Firt of all, th qutio of th u of mtaphor i Yami wa aalyzd by Lakoff & Joho’ Cocptual Mtaphor Thory (1980) ad Faucoir ad Turr’ Cocptual Bldig Thory (1998). Scodly, two taxoomic tor wr idtifid uig WordNet (Fllbaum, 1999) ad Yami Text with Reference Grammar and Dictionary (Rau & Dog, 2006). Bad o th taxoomic tor, Yami word wr claifid ito “Vrb” ad “Nou”."]},{"title":"4. Resuls an Dscusson 4.1 Concepual Blenng","paragraphs":["I th followig dicuio, w bgi with a aalyi of a traditioal Yami og clbratig th compltio of a workhou with a harvt of taro. It motly prai th hot’ achivmt ad hard work. Aftr praiig th hot’ achivmt, th gut tak all th hot’ taro ad covr th roof of th workhou with thm. Fially, th gut ig og with th hot i tur.","Th lyric i illutratd a follow: 1 oya raa mnangy iap rarakh","thi alrady rachd_th_harbor gradfathr old","2 Protégé i a fr, op ourc otology ditor ad kowldg-ba framwork. Th IP addr of Protégé i: http://protg.taford.du/. “Now, the old man reached the harbor.” 2 ji a miatokod Jcamongan ta NEG alrady rachd PLN bcau “He didn’t addle to Jicamongan.” 3 kalagarawan am paneneneban o ... figrlig_plac TOP hallow_a NOM ... “He moved in the hallow ea where only fingerling fih live.” 4 to a raa avavang ia ta AUX 3.S.GEN alrady row a boat thr bcau “He could only row hi boat there” 5 ji a raa voaz o kakao NEG 3.S.GEN alrady row NOM paddl “Becaue he had already lot trength to row.”","Sv mtaphorical tok rlatd to “fihig” wr dtctd from th lyric. Thy ar markd i bold ca. I Li 1, minangyid “rachd th harbor” wa idtifid a mtaphorical bcau although it litrally dcrib goig back hom aftr fiihig o’ fihig, it itdd maig i “to rt ad hold a crmoy clbratig th compltio of a workhou.” Uig th Cocptual Mtaphor Thory (1980), w compard th cogitiv activiti i th lyric ad th mtal pac (Tabl 1). Th titi, quality, ad fuctio i th domai of fihig wr aalyzd. Table 1. Reache he harbor vs. Holng a ceremony celebrang he compleon of a workhouse","Tabl 1 how that Yami popl prfr to u “fihig” a a mtaphor for th itdd maig of buildig a hou or farmig. W furthr mployd th Cocptual Bldig Thory (1998) to itrprt th “harbor” xampl ( Figur 2). The 6th Workshop on Asian Languae Resources, 2008 82 Fgure 2. “Reache he harbor” vs. “Holng a ceremony celebrang he compleon of a workhouse”","Th cocpt of “rachd th harbor” i catgorizd ito Iput pac I, ad “holdig a crmoy clbratig th compltio of a workhou” i catgorizd ito Iput pac II. Both Iput hav crtai imilariti a wll a ditict fatur. From Iput Spac I, “fihrma,” “boat,” “fih,” “harbor,” ad “to har hi achivmt ad hoor with hi frid ad rlativ” ar rpctivly mappd ito “hot/buildr,” “w workhou,” “taro,” “yard,” ad “to har hi achivmt ad hoor with hi frid ad rlativ,” i Iput Spac II. Th Iput might har om cro-mappig proprti, which ca b litd i th Gric pac. Th tructur from th two iput mtal pac i projctd ito th Bld pac. Etially, which lmt from Iput pac II hould b lctd ad projctd oto th bld pac ar dtrmid by th cott of th lyric. Thu, i th bld pac, all lmt rmai parat from thir corrpodig coutrpart, but th rlatio amog th fatur i Iput pac I dtrmi th rlatio btw corrpodig coutrpart. That i to ay, th ruig tructur i th bld pac partially projctd from Iput pac I dtrmi th xitig rlatio amog th lmt i th bld. I Iput pac I, a “fihrma” d a “boat” to fih i th oca, o th rlatio btw “fihrma” ad “boat” i a kid of “arig a livig.” I additio, what a “fihrma” work for i “fih.” Aftr th fihrma fiih hi work, h ha to go back to th harbor. Such rlatio alo oprat amog tho lmt projctd from Iput pac II. A a rult, “th hot of th compltio crmoy of a workhou” i th “fihrma” of th “workhou crmoy;” th rlatio btw “th hot” ad th “workhou crmoy” i that of “fiihig a timcoumig job.” Additioally, “taro” i th yard ar compard with “fih” at th harbor, which await to b “hard with frid ad rlativ.” 4.2 Taxonomy","Yami vrb ubum dyamic vrb ad tativ vrb (Rau ad Dog, 2006). Bad o th otio from WordNet, w furthr dividd vrb ito Bodily Fuctio ad Car Vrb, Chag Vrb, Commuicatio Vrb, Comptitio Vrb, Coumptio Vrb, Cotact Vrb, Cogitio Vrb, Cratio Vrb, Motio Vrb, Emotio or Pych Vrb, Stativ Vrb, Prcptio Vrb, Poio Vrb, Social Itractio Vrb, ad Wathr Vrb. Sic Yami do ot po a ditictiv adjctiv word cla, both dcriptiv ad rlatioal adjctiv ar i thi tudy claifid udr tativ vrb i WordNet. Dcriptiv adjctiv ubum atoymy, gradatio, markd, polymy ad lctioal prfrc, rfrc-modifyig adjctiv, color adjctiv, quatifir, ad participial adjctiv. Rlatioal adjctiv iclud two domai, “prtaiig” or “rlatig to” (Fllbaum 1999: 63). Th codig of adjctiv i thi fil i diffrt from that of dcriptiv adjctiv. Rathr tha big part of a clutr, ach yt i trd idividually, o that th itrfac will prt th adjctiv with it rlatd ou ad iformatio about th of th ou.","For th apct of Yami Nou, w catgorizd th ou ito 10 baic ou catgori followig WordNet (Fllbaum, 1999: 30), icludig tity, abtractio, pycho-fatur, atural phoma, activity, vt, group, locatio, poio, ad tat. 4.3 Example from he Yam Lyrc","Th followig xampl illutrat how w xtractd th mtaphorical word of “fihig” from th lyric ad clafid thm ito thir domai. Firtly, minangyid “rachd th harbor,” avavangi “row, ail omthig” ad voaz “row omthig,” wr claifid a Motio Vrb. Scodly, Jicamongan “a plac am of dp watr,” kalagarawan “a plac whr figrlig fih wim” ad aneneneban “hallow plac,” wr catgorizd udr th mai ctio Locatio ad The 6th Workshop on Asian Languae Resources, 2008 83 th ub-ctio Sa. Fially, kakaod “ paddl” wa claifid i th mai ctio Etity ad th ub-ctio Artifact, a how i Figur 3 ad Figur 4. Fgure 3. An example of four Yam nouns n he onology of Yam lyrcs Fgure 4. An example of hree Yam verbs n he onology of Yam lyrcs 4.4 Mappng meaphorcal wors To claify Yami mtaphor, w mad lik (quivalt cla) btw th litral maig ad th mtaphorical maig uig Protégé. Sic Iput pac I uually work a th ourc domai ad Iput pac II a th targt domai, w foud that, at lat i thi ca, thi i a o-idd twork of mtaphor mappig. W thu mployd th proprty “mappig” to dfi th rlatiohip btw “rachd th harbor” ad “to hold a w workhou clbratio.” Morovr, i ordr to t up th rtrictio for archig word, w addd th proprty “haCocptOf”. W th amd th cla xprio of “rachd th harbor” with th followig rtrictio:","has_conct_ofsom3","(harborand4","fishand","fishrmanandboatandshar)","Similarly, w alo providd th phra “to hold a w workhou clbratio” with th followig rtrictio:","has_conct_ofsom(hostandbuildrand workhousandsharandtaroandyard)","Fially, for th ak of corrctly likig 3 Thi rfr to th xittial quatifir () i OWL ytax, which ca b rad a at lat o, or ome. 4 A itrctio cla i dcribd by combiig two or mor cla uig th AND oprator ( ). maig of ach word, th otology buildr ca chck th otology with th DL Qury Tab i Protégé.","I ummary, th coctio btw th two itm minangyid, “rachd th harbor” ad “to hold a w workhou clbratio,” how i hadow i Figur 4, i olly bad o th tructur of th iput, ic ach of thm ar from a diffrt domai of vrb. Thi tructur i i harmoy with Yami cutom ad cotxtual tructur."]},{"title":"5 Concluson","paragraphs":["Thi papr ha providd a xampl of how to cotruct a otology of Yami uig traditioal og. W hop thi approach will rv a a fudamtal tmplat for furthr mappig with mor txt to produc othr Yami otologi.",""]},{"title":"References","paragraphs":["Dodd, D. 2005. Qualitative geoatial roceing, ontology and atial metahor. prtd at th GML ad Go-Spatial Wb Srvic.","Dog, M. N. 1995. n Praie of Taro. Dao-Xiag Publihr.","Faucoir, G. & Turr,M. 1998. Cocptual Itgratio Ntwork. Cognitive Science, 22 (2), 133-187.","Fllbaum,C. 1999. WordNet:an Electronic Lexical Databae. Cambridg,Ma.: MIT Pr.","Kight, P., & Lu Y. H.. 2005. Muic heritage of the oral tradition by meykaryag of the Tao tribe. Papr prtd at th 2005 Itratioal Forum of Ethomuicology i Taiwa: Itrprtatio ad Evolutioof Muical Soud. Taipi: Soochow Uivrity.","Lakoff, G. & Joho, M. 1980. Metahor We Live By. Chicago: Uivrity of Chicago Pr.","Li, J.H. 2006. Uing formal concet analyi to contruct the comuter viru characteritic domain ontology. MA thi, Natioal Yuli Uivrity of Scic & Tchology, Taiwa.","Rau, D.Victoria & Dog, M. N. 2006 Yami Text with Reference Grammar and Vocabulary. Laguag ad Liguitic, Acadmia Siica, Taipi, Moograph A-10. The 6th Workshop on Asian Languae Resources, 2008 84"]}]}