{"sections":[{"title":"The Lin\\b \\ttr\\fct\\fre of Lang\\fage Comm\\fnities and its Implication for Lang\\fage-specific Crawling Rizza Cam\\fs Caminero Language \\b\\tser\\fatory Nagaoka Uni\\fersity of Technology Nagaoka, Niigata, Japan rhyze.c\\b\\tiner\\f@g\\t\\bil.c\\f\\t Yoshi\\bi Mi\\bami Language \\b\\tser\\fatory Nagaoka Uni\\fersity of Technology Nagaoka, Niigata, Japan \\tik\\b\\ti@kjs.n\\bg\\b\\fk\\but.\\bc.jp   Abstract","paragraphs":["Since its inception, the World Wide We\\t (WWW) has exponentially grown to shelter \\tillions of monolingual and multilingual we\\t pages that can \\te na\\figated through hyperlinks. Its structural properties pro\\fide useful information in presenting the socio-linguistic properties of the we\\t. In this study, a\\tout 26 million we\\t pages under the South East Asian country code top-le\\fel-domains (ccTLDs) are analyzed, se\\feral language communities are identified, and the graph structure of these communities are analyzed. The distance \\tetween language communities are calculated \\ty a distance metrics \\tased on the num\\ter of outgoing links \\tetween we\\t pages. Intermediary languages are identified \\ty graph analysis. By creating a language su\\tgraph, the size and diameter of its strongly-connected components are deri\\fed, as these \\falues are useful parameters for language-specific crawling. Performing a link structure analysis of the we\\t pages can \\te a useful tool for socio-linguistic and technical research purposes."]},{"title":"1 Introd\\fction","paragraphs":["The World Wide We\\t contains interlinked documents, called we\\t pages, na\\figa\\tle \\ty hyperlinks. Since its creation, it has grown to contain \\tillions of we\\t pages and se\\feral \\tillion hyperlinks. These we\\t pages are created \\ty millions of people from all parts of the world. Each we\\t page contains a large amount of information that can \\te shared and disseminated to people with Internet access. Authors and creators of a we\\t page come from different \\tackgrounds, different cultures, and different languages. Thus, a we\\t page is a resource of multilingual content, and a fertile source for socio-linguistic analysis. 1.1 Web Crawling While search-engines are important means of accessing the we\\t for most users, automated systems of retrie\\fing information from the we\\t ha\\fe \\teen de\\feloped. These systems are called we\\t crawlers, where a software agent is gi\\fen a list of pages to \\fisit. As the crawler \\fisits these pages, it follows their outgoing links and adds these to the list of pages to \\fisit. Each page is \\fisited recursi\\fely according to some sets of policies (e.g. the type of pages to retrie\\fe, direction, the maximum depth from the URL (uniform resource locator), etc.). The result of this crawl is a \\fast amount of data, most of which may \\te irrele\\fant to certain indi- \\fiduals. Thus, a focused-crawling approach was implemented \\ty some systems to limit the search to only a su\\tset of the we\\t.","Focused crawlers rely on classifiers to work effecti\\fely. Language-specific crawlers, for example, need a \\fery good language identification module that properly identifies the language of the we\\t pages. General crawlers can \\te extended to include focused-crawling capa\\tilities \\ty incorporating the classifiers. Another important requirement to efficiently crawl the desired domain is the list of initial we\\t pages, called seed URLs. Each of these URLs will \\te enqueued into a list. The agent \\fisits each URL in the list. Since the crawler recursi\\fely \\fisits The 6th Workshop on Asian Languae Resources, 2008 49 the outgoing links of each URL, it is possi\\tle that the seed URL is an outgoing link of another seed URL, or an outgoing link of an outgoing link of another seed URL. Listing these URLs as seed URLs will just waste the crawler’s time in \\fisiting them, when they ha\\fe already \\teen \\fisited. If se\\feral URLs can \\te reached from just one URL, the seed URL list size will decrease and the crawler will \\te more efficient. Howe\\fer, the maximum distance \\tetween these we\\t pages must also \\te considered, since the crawler can ha\\fe a policy to stop the crawling after reaching a certain depth. 1.2 The Web as Graph A graph consists of a set of nodes, denoted \\ty V and a set of edges, denoted \\ty E. Each edge is a pair of nodes (u, v\\b representing a connection \\te-tween u and v. A path \\tetween two nodes is a sequence of edges that is passed through from one node to reach the other node.","In a directed graph, each edge is an ordered pair of nodes. A path from u to v does not imply a path from v to u. The distance \\tetween any two nodes is the num\\ter of edges in a shortest path connecting them. The diameter of the graph is the maximum distance \\tetween any two nodes.","In an undirected graph, each edge is an unordered pair of nodes. There is an edge \\tetween u and v if there is a link \\tetween u and v, regardless of which node is the source of the link.","A strongly-connected component (\\tCC) of a directed graph is a set of nodes such that for any pair of nodes u and v in the set, there is a path from u to v. The strongly-connected components of a graph consist of disjoint sets of nodes. A su\\fgraph is a graph whose nodes and edges are su\\tsets of another graph.","With the interlinked nature of the we\\t, it can \\te represented as a graph, with the we\\t pages as the nodes and the edges as the hyperlinks \\tetween the pages. 1.3 Lang\\fages Languages are expressions of indi\\fiduals and groups of indi\\fiduals, essential to all form of communication. It is a fundamental medium of expressing one’s self whether in spoken or written form. Ehtnologue (2005) lists 6,912 known li\\fing languages in the world. \\bnly a small portion of these languages can \\te found in the we\\t today.","A language community in the we\\t is the group of we\\t pages written in a language. Major language communities disco\\fered in each country indicates the dominant language of the country’s we\\t space. How one language community is related to another language community can \\te shown \\ty analyzing the hyperlinks \\tetween them. Thus, a language graph can \\te created with the language communities as nodes, and the links \\tetween the language communities as edges."]},{"title":"2 Previo\\fs \\tt\\fdies","paragraphs":["\\bne of the earliest we\\t sur\\fey in Asia (Ciolek, 1998) presented statistical data of the Asian we\\t space \\ty using the Alta\\fista WWW search engine in gathering its data. In 2001, he wrote a paper presenting the trends in the \\folume of hyperlinks connecting we\\tsites in 10 Eash Asian countries.","Se\\feral studies ha\\fe also \\teen done regarding the representation of the we\\t as a graph. Kumar et al. (2000) showed that a graph can \\te induced \\ty the hyperlinks \\tetween pages. Measures on the connected component sizes and diameter were presented to show the high-le\\fel structure of the we\\t. Broder et al. (2000) did experiments on the we\\t on a larger scale and showed the we\\t’s macroscopic structure consisting of the SCC, IN, \\bUT, and TENDRILS. Balakrishnan and Deo (2006) o\\tser\\fed that the num\\ter of edges grow superlinearly with the num\\ter of nodes, showing the degree distri\\tutions and diameter. Petricek et al. (2006) used we\\t graph structural metrics to measure properties such as the distance \\tetween two random pages and interconnectedness of e-go\\fernment we\\tsites. Bharat et al. (2001) studied the macro-structure of the we\\t, showing the linkage \\tetween we\\t sites \\ty creating the “hostgraph”, with the nodes representing the hosts and the edges as the count of hyperlinks \\tetween pages on the corresponding hosts.","Chakra\\tarti et al. (1999) proposed a new approach to topic-specific we\\t resource disco\\fery \\ty creating a focused crawler that selecti\\fely retrie\\fes we\\t pages rele\\fant to a pre-defined set of topics. Stamatakis et al. (2003) created CR\\bSSMARC, a focused we\\t crawler that collects domain-specific we\\t pages. Deligenti et al. (2000) presented a focused crawling algorithm that \\tuilds a model for the context within which rele\\fant pages to a topic occur on the we\\t. Pingali et al. (2006) created an Indian search engine with a language identification The 6th Workshop on Asian Languae Resources, 2008 50 module that returns a language only if the num\\ter of words in a we\\t page are a\\to\\fe a gi\\fen threshold \\falue. The we\\t pages were transliterated first into UTF-8 encoding. Tamura et al. (2007) presented a simulation study of language specific crawling and proposed a method for selecti\\fely collecting we\\t pages written in a specific language \\ty doing a linguistic graph analysis of real we\\t data, and then transforming them into \\fariation of link selection strategies.","Despite se\\feral studies on we\\t graph and language-specific crawling, no study has \\teen done showing the “language graph”. Herring et al. (2007) showed a study on language networks of a selected we\\t community, Li\\feJournal, \\tut not on the we\\t as a whole."]},{"title":"3 \\tcope and Objectives of the \\tt\\fdy","paragraphs":["This research was conducted on the 10 ccTLDs of the South East Asian countries. This paper, how-e\\fer, will only show the results for the Indonesian domain (.id).","This research aims to show the socio-linguistic properties of the language communities in each country at the macroscopic le\\fel. The we\\t page distri\\tution for each language community in a gi\\fen ccTLD and its most frequently linked to languages are shown. The distance is also computed and the language graph is illustrated.","This research also aims to show the graph properties of some Filipino language communities and its implication for crawling. Graph properties like the SCC size and the diameter will \\te presented to show these characteristics in a su\\tset of the we\\t.","Finally, this research demonstrates the useful-ness of graph analysis approaches."]},{"title":"4 Methodology","paragraphs":["This study was conducted \\ty performing a series of steps from the collection of data to the presentation of the results through images. 4.1 UbiCrawler U\\tiCrawler (Boldi et al., 2004) was used to download the we\\t pages under the Asian ccTLDs. These pages were downloaded primarily for the purpose of assessing the usage le\\fel of each language in cy\\terspace, one of the o\\tjecti\\fes of the Language \\b\\tser\\fatory Project (L\\bP)1",". The crawl was started on July 5, 2006, running for 14 days. 107,168,733 we\\t pages were collected from 43 ccTLDs in Asia. Each page contains se\\feral information such as the character set and outgoing links. For this study, the URL of a we\\t page and the URL of its outgoing links were used. Although there are many we\\t pages of Asia that can \\te found in generic domains, they were not included in this sur\\fey to limit the \\folume of the crawl data. 4.2 Lang\\fage Identification A language identification module (LIM) de\\feloped for L\\bP \\tased on the n-gram method (Suzuki et al., 2002) was used to identify on what language a page is written in. This method first creates \\tyte sequences for each training text of a language. It then checks the \\tyte sequences of the we\\t pages that match the \\tyte sequences of the training texts. The language ha\\fing the highest matching rate is considered as the language of the we\\t page. The language identification module used the parallel corpus of the Uni\\fersal Declaration of Human Rights (UDHR), translated into se\\feral languages. After crawling, LIM was executed to identify the languages of each downloaded we\\t page. The identification result was stored in a LIM result file that contains the URL, the language, and matching rate, among others. In this study, the issues regarding the accuracy of LIM will not \\te discussed. 4.3 Web Page Analysis For this study, the we\\t pages of the 10 South East Asian ccTLDs were selected for analysis. There were 26,196,823 we\\t pages downloaded under these ccTLDs. The we\\t pages for each country were grouped \\ty languages. The list of languages was narrowed down to 20 \\tased on the num\\ter of pages, arranged from highest to lowest.","The link structure can \\te analyzed \\ty tra\\fersing the outgoing links of each we\\t page. For each we\\t page, its outgoing links are retrie\\fed. For each outgoing link, the LIM result file is checked for its language. The num\\ter of outgoing links in each language is counted. If the URL of the outgoing link is not on the file, it wasn’t downloaded. There-fore, the language of the ougoing link is unidentified. This is usually the case of outgoing links un-"]},{"title":"\\c \\c","paragraphs":["1 http://www.language-o\\tser\\fatory.org The 6th Workshop on Asian Languae Resources, 2008 51 der the generic TLDs (e.g., .com, .org, .go\\f, etc.) and non-Asian ccTLDs. 4.4 Lang\\fage Graph There is a link \\tetween two languages if there is at least one outgoing link from a we\\t page in one language to the other language. The language graph is created through contraction procedure, where all edges linking the same language page are contracted. 4.5 Lang\\fage Adjacency Matrix Based on the num\\ter of we\\t pages in a language and the num\\ter of outgoing links from one language to another, the language adjacency ta\\tle N for each country is created. The row and column headers are the same – the top 20 languages \\tased on the num\\ter of we\\t pages. The \\falue Nij is the num\\ter of outgoing links from language i to language j.","The language adjacency matrix P contains the ratio of the num\\ter of outgoing links and the total num\\ter of outgoing links as can \\te found in the language adjacency ta\\tle. Each cell \\falue, Pij is the pro\\ta\\tility that a we\\t page in a language i has an outgoing link to language j."]},{"title":"∑=","paragraphs":["k ikijij"]},{"title":"NNP /","paragraphs":["A link from language i to language j is not necessarily accompanied \\ty a link from language j to i. E\\fen if there is a link, the num\\ter of outgoing links is not equal. To show the relationship \\te-tween two languages \\tased on the link structure, the language distance is computed. 4.6 Distance between Lang\\fages The distance \\tetween two languages measures their le\\fel of connectedness. It is the relationship \\tetween the num\\ter of outgoing links from language i to language j and \\fice \\fersa. The distance is computed as the ratio of the num\\ter of outgoing links \\tetween two languages and the total num\\ter of outgoing links of the two languages.","The distance \\tetween language i and language j, Dij is,"]},{"title":"( ) βα −\\b=","paragraphs":["ijij"]},{"title":"R1/D","paragraphs":["where Rij is the language link ratio is defined as,"]},{"title":"( ) \\t   \\f   \\b\\b= ∑∑","paragraphs":["k jkik kjiijij"]},{"title":"NNNNR /","paragraphs":["for (i ≠ j\\b"]},{"title":"1=","paragraphs":["ij"]},{"title":"R","paragraphs":["for (i = j\\b","where α is an adjusting parameter introduced to a\\foid di\\fision-\\ty-zero, which may happen when Rij=0, i.e. no links \\tetween two languages. We set α=0.0001. Thus, the maximum distance \\tetween languages \\tecomes 99. β is another adjusting parameter to make Dij as a distance metrics, and we set β=1. Assumption \\tehind this definition is \\tased on commonly-o\\tser\\fed rules in our world. It is widely o\\tser\\fed that interaction \\tetween two o\\tjects is proportional to the in\\ferse square of distance \\tetween two o\\tjects. The num\\ter of we\\t links \\tetween two language communities is considered as a kind of interaction. Languages with no links \\tetween them ha\\fe a distance of 99, and the distance of a language to itself is 0.","Based on this distance metrics, the macroscopic language graph is created. A distance limit of 15 is used to clearly show which languages are closelyrelated \\ty their link structure. 4.7 Intermediary Lang\\fages Considering the direction of the outgoing links, the possi\\tility that language i will link to language j may \\te lesser than the possi\\tility that language i will link to language j \\ty passing through an intermediary language k, such that PikPkj > Pij. The intermediary language is identified, as this would mean that there are \\tetter ways to reach another language from one language. 4.8 Graph Analysis \\fsing JGraphT JGraphT is a free Ja\\fa graph li\\trary that pro\\fides graph o\\tjects and algorithms. The li\\trary pro\\fides classes that calculates and returns the strongly-connected components su\\tgraphs. To compute the distance \\tetween nodes, se\\feral graph searching algorithms are a\\faila\\tle, one of which is the Dijikstra algorithm that computes for the shortest path. A utility to export the graph into a format reada\\tle \\ty most graph \\fisualization tools is also a\\faila\\tle. A graph file, written in the D\\bT language (a plain text graph description language) was created, containing the nodes and edges of language pages. From this, the strongly-connected components and its properties (i.e. size, diameter) were determined. 4.9 GraphVis: Vis\\falization Tool GraphViz is open-source graph \\fisualization software that takes descriptions of graphs in a simple text language and makes diagrams in The 6th Workshop on Asian Languae Resources, 2008 52 se\\feral formats, including images. The neato layout, which makes “spring model” layouts, was used to \\fisualize the distance \\tetween languages. Howe\\fer, the calculated distance cannot \\te drawn exactly, and this \\fisualization is only two-dimensional. So, the images are distorted and do not illustrate the exact distance, only an approximation."]},{"title":"5 Res\\flts","paragraphs":["This section shows some results on the Indonesian domain. 5.1 Lin\\b \\ttr\\fct\\fre Indonesia is a country with one of the \\tiggest language di\\fersity in the world. According to Ethnologue2",", 742 languages are spoken in the country. But, the LIM results show that only fi\\fe of these languages are listed in the top 10 languages in the country, i.e., Ja\\fanese, Indonesian, Malay, Sundanese, and Madurese.  No. Language # of Pages # of \\butgo-ing Links 1 Ja\\fanese (ja\\f) 797,300 (28.01%) 33,411,032 (27.20%) 2 English (eng) 743,457 (26.11%) 16,645,014 (13.55%) 3 Indonesian (ind) 516,528 (18.14%) 20,783,793 (16.92%) 4 Thai (tha) 218,453 (7.67%) 8,952,101 (7.29%) 5 Malay (mly) 197,535 (3.47%) 4,990,402 (4.06%) 6 Sundanese (sun) 98,835 (3.47%) 5,349,194 (4.35%) 7 Luxem\\turg3"," (ltz) 43,376 (1.52%) 2,307,602 (1.88%) 8 \\bccitan4"," (lnc) 27,663 (0.97%) 351,318 (0.29%) 9 Madurese (mad) 22,121 (0.78%) 777,903 (0.63%) 10 Tatar (tat) 20,709 (0.73%) 3,334,651 (2.71%)  \\bthers 160,917 (5.65%) 25,930,885 (21.11%)","Total 2,846,894 122,833,898 ","Ta\\tle 1. LIM result for Indonesian Domain "]},{"title":"\\c \\c","paragraphs":["2 Gordon, Raymond G., Jr. (ed.), 2005. Ethnologue: Languages of the World, Fifteenth edition. Dallas, Tex.: SIL International. 3 Luxem\\tourgish 4 \\bccitan Languidocien","Ja\\fanese is the most popular language in the we\\t space of Indonesia, and constitutes 28% of the total num\\ter of we\\t pages. It is followed \\ty English and Indonesian. Although Indonesian is an official language of the country, it is ranked third.","English, a major \\tusiness language of Indonesia, has the second largest num\\ter of we\\t pages in the domain. But, Indonesian occupies the second rank in the num\\ter of outgoing links."," No. Language Languages Linked to (# of","outgoing links)","Ja\\fanese Ja\\fanese (22,641,844) 1 (ja\\f) Indonesian (3,761,205) English English (11,036,726) 2 (eng) Ja\\fanese (1,443,054) Indonesian Indonesian (12,530,636) 3 (ind) Ja\\fanese (4,168,734) Thai Thai (4,367,895) 4 (tha) English (1,775,132) Malay Malay (1,944,430) 5 (mly) Indonesian (1,516,778) Sundanese Ja\\fanese (2,004,316) 6 (sun) Sundanese (1,641,623) Luxem\\turg Luxem\\turg (1,128,342) 7 (ltz) Ja\\fanese (393,524) \\bccitan \\bccitan (119,734) 8 (lnc) English (83,380) Madurese Madurese (387,585) 9 (mad) Ja\\fanese (93,837) Tatar Ja\\fanese (1,802,601) 10 (tat) Thai (397,988)","","Ta\\tle 2. Language Link for Indonesian Domain ","The ta\\tle a\\to\\fe only shows the top 10 languages. Among these, 8 languages are most frequently linked to the same language. The two other languages are Sundanese and Tatar, \\toth mostly linked to Ja\\fanese.","The language graph \\telow shows the languages as the nodes and the edges representing the distance \\tetween languages. In the figure a\\to\\fe, the six languages of Indonesia are found to \\te closely-connected to each other."," The 6th Workshop on Asian Languae Resources, 2008 53   Figure 1. Language Graph of Indonesia  5.2 Intermediary Lang\\fages For languages with only a few outgoing links \\te-tween them, there exists a language that acts as its intermediary, that makes access \\tetween the two languages more con\\fenient if passed through.  No.","Intermediary","Language Frequency Percentage 1 English 89 17.73% 2 Ja\\fanese 43 8.57% 3 Tatar 42 8.37% 4 Thai 40 7.97% 5 Madurese 38 7.57% 6 Indonesian 34 6.77% 7 Latin 34 6.77% 8 Sundanese 29 5.78% 9 Malay 28 5.58% 10 Luxem\\turg 24 4.78% ","\\bthers","(top11-20) 122 24.30%","Total 502 100.00%"," Ta\\tle 3. Intermediary Languages of Indonesia ","The a\\to\\fe ta\\tle shows the num\\ter of language pairs ha\\fing the gi\\fen language as its intermediary language. English has the highest frequency as an intermediary language. Howe\\fer, it is likely that se\\feral pages were misidentified \\ty LIM. The second, Ja\\fanese is not surprising since it is a major language of Indonesia. The ta\\tle \\telow shows selected language pairs, where one of its intermediary languages is Ja\\fanese.  Language i Language j Pij Pik*Pkj5"," Tatar Indonesian 0.01753 0.06085 Tatar Luxem\\turg 0.00210 0.01193 Samoan Balinese 0.00000 0.00052","","Ta\\tle 4. Selected Languages of Indonesia in which it’s Intermediary Language is Ja\\fanese"," 5.3 Graph Properties This section discusses the size distri\\tution of the SCCs and the diameter of the Filipino language community in Indonesia."," \\tCC size The SCCs of a graph are those sets of nodes such that for e\\fery node, there is a path to all the other nodes. The size of each SCC refers to the num\\ter of nodes it contains. Distri\\tution of the sizes of SCCs gi\\fes a good understanding of the graph structure of the we\\t, and has important implications for crawling. If most components ha\\fe large sizes, only a few nodes are needed as seed URLs (a list of starting pages for a crawler) to \\te a\\tle to reach all the other nodes. If all nodes are mem\\ters of a single SCC, one URL is enough to crawl all pages."," SCC size 1 2 4 16 19 20 26 45 T6"," # of SCCs 9 1 3 1 1 1 1 1 18 # of nodes 9 2 12 16 19 20 26 45 149","","Ta\\tle 5. SCC size distri\\tution of the Filipino language community in Indonesia   \\tCC diameter The maximum distance \\tetween any two nodes is the diameter. For each node size, the diameter is"]},{"title":"\\c \\c","paragraphs":["5 k = Ja\\fanese 6 Total The 6th Workshop on Asian Languae Resources, 2008 54 calculated and plotted in the chart. Their corresponding SCC graph is also shown."," ","","Figure 2. Diameter distri\\tution of the Filipino language community in Indonesia","","For the Filipino language su\\tgraph of Indonesia, the component with the largest node size also has the largest diameter. Howe\\fer, the largest diameter size is only 3, which is a \\fery small num\\ter. Most of the components ha\\fe a diameter of 4."]},{"title":"6 Implications","paragraphs":["For the Filipino language community, many SCCs can \\te found in the Philippines, since Filipino is one of its national languages. Howe\\fer, for some countries, there are not many SCCs. For example, Indonesia only has 18 SCCs, half of which consist only of one node. Howe\\fer, the largest component size is 45, and there are 4 more large components. By picking out just one node from each SCC with a large size and using it as a seed URL, many we\\t pages can already \\te downloaded. Add to it the depth parameter of 3, which is the largest diameter, these we\\t pages can \\te downloaded within a short period of time.","The choice of seed URL and the crawly depth are useful parameters for crawling. The analysis is done for each language community to get these parameters for language-specific crawling purposes. These parameters are different for each language community. This paper shows only shows the case of the Filipino language community of Indonesia as a sample illustration of the diameter metric."]},{"title":"7 Concl\\fsion","paragraphs":["The \\fastness and multilingual content of the we\\t makes it a rich source of culturally-di\\fersified information. Since we\\t pages are connected \\ty hyperlinks, information can \\te readily accesses \\ty jumping from one page to another \\fia the hyperlinks.","For each country domain, the we\\t pages written in the same language form a language community. The link structure \\tetween language communities shows how connected a language community is with another language community. It can \\te as-sumed that the close links \\tetween two language communities on the we\\t imply the existence of multilingual speakers of the two languages. \\btherwise linked pages will not \\te \\fisited. In this context, the language graph analysis demonstrated in this study gi\\fes an effecti\\fe tool to understand the linguistic scenes of the country. If the same analysis is performed for the secondary le\\fel domain data, further insight into the socio-linguistic status of each language can \\te drawn. Secondary domain corresponds to different social area of language acti\\fities, such as “ac” or “edu” for academic and education arena, “go” or “go\\f” for go\\fernment or pu\\tlic arena, and “co” or “com” for commercial \\tusiness and occupational arena. Although this study does not extend its scope to the secondary le\\fel domain analysis, the effecti\\feness of the approach was demonstrated.","Another implication drawn from this study is that the language graph analysis can identify intermediary languages in the multilingual communities. In the real world, some languages are acting as a medium of communications among the different language speakers. In most cases, such lingua franca are international languages such as English, French, Ara\\tic, etc. But it’s difficult to identify which language is acting as such in detail. But on the we\\t link structure among languages, the language graph can gi\\fe us a clue to identify this. As shown in this paper, there are a num\\ter of languages acting as intermediary \\tetween two languages ha\\fing only a few hyperlinks \\tetween them. Although the result of this category is dou\\ttful \\tecause of misidentification of language, some cases show the expected result.","The second o\\tjecti\\fe of the study is to gi\\fe a microscopic le\\fel structure of the we\\t communities for much more practical and technical reasons, such as how to design more effecti\\fe crawling strategy, and how to prepare starting URLs with minimal efforts. The key issue in this context is to re\\feal the connectedness of the we\\t. To show the connectedness of language communities, se\\feral 0 1 2 3 4","0 5 10 15 20 25 30 35 40 45 50 SCC size d i a m e t e r The 6th Workshop on Asian Languae Resources, 2008 55 graph theory metrics, the size and num\\ters of strongly-connected components and the diameters are calculated and \\fisual presentations of language communities are also gi\\fen. This information can aid in defining parameters used for crawling, particularly language-specific crawling.","As a summary, the link structure analysis of language graphs can \\te a useful tool for \\farious spectrums of socio-linguistic and technical research purposes."]},{"title":"8 Limitations and F\\ft\\fre Wor\\b","paragraphs":["The results of this research are highly dependent on the language identification module (LIM). With a more impro\\fed LIM, more accurate results can \\te presented. Currently, there is an ongoing experiment that uses a new LIM.","This analysis will also \\te done to the secondaryle\\fel-domains to show the language distri\\tution for different social areas.","Future work also includes the creation of a language-specific crawler that will incorporate the results deri\\fed from the analysis of the SCC size and diameter of the language su\\tgraphs."]},{"title":"Ac\\bnowledgment","paragraphs":["The study was made possi\\tle \\ty the financial support of the Japan Science and Technology Agency (JST) under the RISTEX program and the Asian Language Resource Network Project. We also thank UNESC\\b for gi\\fing official support to the project since its inception."]},{"title":"References","paragraphs":["Balakrishnan, Hemant and Narsingh Deo. 2006. E\\folution in We\\t graphs. Proceedings of the 37th \\toutheastern International Conference on Com\\finatorics, Graph Theory, and Computing. Boca Raton, FL.","Bharat Krishna, Bay-Wei Chang, Monika Henzinger, and Matthias Ruhl. 2001. Who links to whom: min-ing linkage \\tetween We\\t sites. In Proceedings of the 2001 IEEE International Conference on Data Mining, pages 51-58, San Jose, California.","Boldi, Paolo, Bruno Codenotti, Massimo Santini, and Se\\tastiano Vigna. 2004. U\\tiCrawler: A scala\\tle fully distri\\tuted we\\t crawler. \\toftware: Practice & Experience, 34(8\\b:711-726.","Broder, Andrei, Ra\\fi Kumar, Farzin Maghoul, Pra\\thakar Ragha\\fan, Sridhar Rajagopalan, Raymie Stata, Andrew Tomkins, and Janet Wiener. 2000. Graph structure in the we\\t. In Proceedings of the 9th World Wide We\\f Conference, pages 309-320, Amsterdam, Netherlands.","Chakra\\tarti, Soumen, Martin \\fan den Berg, and ByronDom. 1999. Focused Crawling: a new approach to topic-specific We\\t resource disco\\fery. In Proceedings of the 8th International World Wide We\\f Conference, pages 1623-1640, Toronto, Canada.","Herring, Susan C., John C. Paolillo, Irene Ramos-Viel\\ta, Inna Kouper, Elijah Wright, Sharon Stoerger, Lois Ann Scheidt, and Benjamin Clark. 2007. Language Networks on Li\\feJournal. In Proceedings of the 40th Annual Hawaii International Conference on \\tystem \\tciences, Hawaii.","Kumar, Ra\\fi, Pra\\thakar Ragha\\fan, Sridhar Rajagopalan, D. Si\\fakumar, Andrew S. Tompkins, and Eli Upfal. 2000. The We\\t as a graph. In Proceedings of the Nineteenth ACM \\tIGMOD-\\tIGACT-\\tIGART \\tymposium on Principles of Data\\fase \\tystems, pages 1-10, Dallas, Texas, United States.","Petricek, Vacla\\f, To\\tias Escher, Ingemar J. Cox, and Helen Margetts. 2006. The we\\t structure of ego\\fernment: de\\feloping a methodology for quantitati\\fe e\\faluation. In Proceedings of the 15th","International World Wide We\\f Conference, pages 669-678, Edin\\turgh, Scotland.","Pingali, Prasad, Jagadeesh Jagarlamudi, and Vasude\\fa Varma. 2006. We\\tKhoj: Indian language IR from Multiple Character Encodings. In Proceedings of the 15th","International World Wide We\\f Conference, pages 801-809, Edin\\turgh, Scotland.","Stamatakis, Konstantinos, Vangelis Karkaletsis, Georgios Paliouras, James Horlock, Claire Gro\\fer, James R. Curran, and Shipra Dingare. 2003. Domain-Specific We\\t Site Identification: The CR\\bSSMARC Focused We\\t Crawler. In Proceedings of the 2nd International Workshop on We\\f Document Analysis (WDA 2003\\b, pages 75–78. Edin\\turgh, UK.","Suzuki, Izumi, Yoshiki Mikami, Ario \\bhsato, and Yoshihide Chu\\tachi. 2002. A language and character set determination method \\tased on N-gram statistics. ACM Transactions on Asian Language Information Processing, 1(3): 269-278.","Tamura, Takayuki, Kulwadee Som\\toon\\fiwat, and Masaru Kitsuregawa. 2007. A method for language-specific We\\t crawling and its e\\faluation. \\tystems and Computers in Japan, 38(2):10-20. The 6th Workshop on Asian Languae Resources, 2008 56"]}]}