{"sections":[{"title":"","paragraphs":["Proceedings of the IJCNLP-08 Workshop on NLP for Less Privileged Languages, pages 13–18, Hyderabad, India, January 2008. c⃝2008 Asian Federation of Natural Language Processing"]},{"title":"KUI: an ubiquitous tool for collective intelligence development Thatsanee Charoenporn, Virach Sornlertlamvanich and Kergrit Robkop Thai Computational Linguistics Laboratory NICT Asia Research Center, Thailand","paragraphs":["{virach,thatsanee,kergrit}@tcllab.org"]},{"title":"Hitoshi Isahara National Institute for Communications Technology (NICT), Japan ishara@nict.go.jp   Abstract","paragraphs":["Collective intelligence is the capability for a group of people to collaborate in order to achieve goals in a complex context than its individual member. This common concept increases topic of interest in many sciences including computer science where computers are bring about as group support elements. This paper presents a new platform, called Knowledge Unifying Initiator (KUI) for knowledge development which enables connection and collaboration among individual intelligence in order to accomplish a complex mission. KUI is a platform to unify the various thoughts following the process of thinking, i.e., initiating the topic of interest, collecting the opinions to the selected topics, localizing the opinions through the translation or customization and posting for public hearing to conceptualize the knowledge. The process of thinking is done under the selectional preference simulated by voting mechanism in case that many alternatives occur. By measuring the history of participation of each member, KUI adaptively manages the reliability of each member’s opinion and vote according to the estimated ExpertScore."]},{"title":"1 Introduction","paragraphs":["The Internet is a must for forming an online community in the present day. Many tools have been developed to support such an online community work. For instance, SourceForge.net (http://www. sourceforge.net) facilitates project based Open Source software development. Open Source software developers deploy SourceForge.net to an-nounce their initiation, to call for participation, to distribute their works and to receive feedbacks. SourceForge.net is said to be the largest Open Source software development community. Wiki.org (http://www.wiki.org) facilitates a database for creating and editing Web page content. It keeps the history of the online editing works which allows multiple authoring. Wiki is especially derived for several online collaborative works such as wikipedia, wikitionary, wikibooks, etc. In addi-tion, PhpWiki is one of the derived works of wiki as a handy software tool for managing the organizational documentation. This collaborative working environment has changed our working style to a more efficient manner. In the same time, the flood of information under the open collaborative works is now challenging us for an efficient management system. The disorder of the information causes difficulties in the requirement of the systematic maintenance for retrieval, extraction, or even summarization from the stored information. To understand the intention of an article (or a solution), we not only rely on the trace or the history of editing, but we also constantly recall the background of our decision in producing the article (or the solution).","Why don't we organize the information in the development process beforehand rather than limit-ing our capability in making use of the unstructured information? Google (http://www. google.com) successfully responds our needs in looking for documents from the WWW. However, the results from the search can simply over a million sites and just some tens out of which are 13 viewed for the search. This most powerful search-ing tool does not digest the information to meet final our requirement. It only thoroughly shows the results of the related document.","Back to the principle of collective intelligent (Smith, 1994; Johnson et al., 1998; Levy, 1997) in which “two minds are better than one”, mountains of knowledge are contributed by this internet community. But the most intelligence is the intelligence of knowledge connections in which new technologies can take part in helping individuals to think and develop their concept collectively.","We proposed and developed KUI (Knowledge Unifying Initiator) (KUI, 2006; Sornlertlamvanich, 2006) to be a Knowledge User Interface (KUI) for online collaborative work to help community to think and to develop things together. KUI is a platform to unify the various thoughts following the process of thinking, i.e., initiating the topic of interest, collecting the opinions to the selected topics, localizing the opinions through the translation or customization and finally posting for public hearing to conceptualize the knowledge. The process of thinking is done under the selectional preference simulated by voting mechanism in case that many alternatives occur."]},{"title":"2 Collaborative tool for managing collective intelligence","paragraphs":["We developed KUI (Knowledge Unifying Initiator) for being a knowledge development supporting tool of a web community. Actually, KUI is a platform to unify various thoughts created by following process of thinking, i.e., (1) new task, to allow a participant to initiate a task, (2) opinion, to allow a participant to post his own opinion, (3) localiza-tion, to allow a participant to bring in a new knowledge into the community by translation, and (4) public-hearing, to allow a participant to post a draft of concept for conceptualizing the knowledge. The process of thinking is done under the selectional preference simulated by voting mechanism in case that many alternatives occur.","In this section, we describe the concept behind KUI, the knowledge development process, and the features in KUI. 2.1 What is KUI? KUI or Knowledge Unifying Initiator is a GUI for knowledge engineering, in other words Knowledge User Interface (KUI). It provides a web interface accessible for pre-registered members only for the accountability reason. An online registration is of-fered to manage the account by profiling the login participant in making contribution to the community. A contributor can comfortably move around in the virtual space from desk to desk to participate in a particular task. A login member will be as-signed to a desk when a participation task is defined. Members can then participate in the chat group of the same desk. A desk functions as a meeting place for collaborative work that needs some discussion through the chat function, or allow a contributor to work individually by using the message slot to record each own opinion. The working space can be expanded by closing the un-necessary frames so that the contributor can concentrate on a particular task. All working topics can also be statistically viewed through the provided tabs. These tabs help contributors to understand KUI in the aspects of the current status of contribution and the available tasks. A web community can be formed to create a domain specific knowledge efficiently through the features provided by KUI. These KUI features fulfill the process of human thought to record the knowledge.","In addition, KUI also provides a KUI look up function for viewing the composed knowledge. It is equipped with a powerful search and statistical browse in many aspects. Moreover, the chat log is provided to learn about the intention of the knowledge composers. We frequently want to know about the background of the solution for better understanding or to remind us about the decision, but we cannot find one. To avoid the repetition of a mistake, we systematically provide the chat log to keep the trace of discussion or the comments to show the intention of knowledge composers. 2.2 Knowledge Development in KUI Adopting the concept of Open Source software development, we will be possibly able to develop a framework for domain specific knowledge development under the web community environment. Sharing and collaboration are the considerable features of the framework. The knowledge will be finally shared among the communities by receiving the consensus from the participants in each step. To facilitate the knowledge development, the process is deliberated into four steps (Sornlertlamvanich, 2006). 14 New Task A new task (Topic of interest) can be posted to draw intention from participants. The only selected tasks by a major vote will then be proceed for further discussion in the requested type of task i.e., Opinion Poll, Localization or Public-Hearing.    Figure 1. Process of knowledge development  Opinion Poll The selected task is posted to call for opinions from the participants in this step. Opinion poll is conducted to get the population of each opinion. The result of the opinion poll provides the variety of opinions that reflects the current thought of the communities together with the consensus to the opinions.  Localization Translation is a straightforward implementation of the localization. Collaborative translation helps producing the knowledge in multiple languages in the most efficient way. Multi-lingual texts are generated in this type of task.  Public-Hearing The result of discussion will be revised and confirmed by gathering the opinions to develop the final draft of the proposal. Suggestions for revision are ranked according to the vote. The author may consider the weight of suggestion to make decision on the final revision.","The developed knowledge is started from posting 'New Task', participants express their supports by casting a vote. Upon a threshold the 'New Task' is selected for conducting a poll on 'Opinion', or introducing to the community by 'Localization', or posting a draft for 'Public-Hearing' to gather feedbacks from the community. The transition from 'Opinion' to either 'Localization' or 'Public-Hearing' occurs when the 'Opinion' has a concrete view for implementation. The discussion in 'Localization' and 'Public-Hearing' is however interchangeable due to purpose of implementation whether to adopt the knowledge to the local community or to get feedbacks from the community.","The knowledge creating is managed in 4 different categories corresponding to the stage of knowledge. Each individual in the community casts a vote to rank the appropriateness of solutions at each category. The community can then form the community knowledge under the 'Selectional Preference' background. Topic of Interest Localization Opinion","Public Hearing 2.3 Features in KUI"]},{"title":"These KUI features fulfill the process of human thought to record the knowledge.  Poll-based Opinion or Public-Hearing","paragraphs":["A contributor may choose to work individually by posting an opinion e.g. localization, suggestion etc., or join a discussion desk to conduct 'Public-Hearing' with others on the selected topic. The discussion can be conducted via the provided 'Chat' frame before concluding an opinion. Any opinions or suggestions are committed to voting. Opinions can be different but majority votes will cast the belief of the community. These features naturally realize the online collaborative works to create the knowledge.  Individual or Group Work Thought may be formed individually or though a concentrated discussion. KUI facilitates a window for submitting an opinion and another window for submitting a chat message. Each suggestion can be cast through the 'Opinion' window marked with a degree of its confidence. By working individually, comments to a suggestion can be posted to mark its background to make it more understanding. On the other hand, when working as a group, discussions among the group participants will be recorded. The discussion can be resumed at any points to avoid the iterating words.  Record of Intention The intention of each opinion can be reminded by the recorded comments or the trace of discussions. Frequently, we have to discuss again and again on the result that we have already agreed. Misinterpre-15 tation of the previous decision is also frequently faced when we do not record the background of decision. Record of intention is therefore necessary in the process of knowledge creation. The knowledge interpretation also refers to the record of intention to obtain a better understanding.  Selectional Preference Opinions can be differed from person to person depending on the aspects of the problem. It is not always necessary to say what is right or what is wrong. Each opinion should be treated as a result of intelligent activity. However, the majority accepted opinions are preferred at the moment. Experiences could tell the preference via vote casting. The dynamically vote ranking will tell the selectional preference of the community at each moment"]},{"title":"3 KUI for Collective Intelligent Development","paragraphs":["Related to the principle of KUI and its features, KUI provide many collaborative tools or applica-tion as followings.  Translating Translating is a type of text for language expert group contribution. Since the existing knowledge in one language is invaluable to other language communities. Translating such knowledge will help bridging the different language communities. It will also bring the individual to an unlimited information space beyond the language barrier. Contribution in term and phrase translation is to create a multi-lingual terminology and an aligned multi-lingual corpus.","KUI-Translating Room facilitates an individual to view either the current translation tasks in the task list or the discussion forum of each translating task. Online lookup is also provided to consult a term translation.","Individual participated in KUI-Translating can cast a vote for a new task, a vote for multiple tasks is allowed, select a topic to participate in the discussion forum, translate the existing terms into your own language, chat with your friends to find the best translation, cast a vote to your favorite translation, invite assistants to your own initiated private task, and propose a new task for community voting as well. Polling Opinion Poll is conducted for getting the population of each opinion. The result of the opinion poll shows the variety of opinions that reflects the current thought of the communities together with the consensus to the opinions.","Similar to KUI-Translating, an individual can view the current polling task in the task list as well as the discussion forum of each polling task via KUI-Polling. And current result of polling can be view via online lookup function.  Public-Hearing Public Hearing is a way to make a complete document from the draft. The result from discussion will be received and confirmed by gathering the opinions to reflect in the final document. Voting of the opinion will help the author to select the appropriate opinion of the community.","An individual can view the current public hearing tasks in the task list as well as the discussion forum of each public hearing task via KUI-Polling. And current result of polling can be view via online lookup function.   Figure 2. KUI-Translating page  Writing Writing your document online will keep your document in access anywhere and anytime. Individual does not have to carry all the documents with him/her. Only online, one can work on it. Sharing the editing online will also support the collaborative work. 16","With KUI-Writing, individual can create or import a new document, edit the existing document, chat with friends about the document, and save or export the document.","","Correspondent to other collaborative tools, all of KUI-application provides function to cast a vote for either a new task or multiple tasks. Individual can select a topic to participate or post new topic, chat with others, invite assistants to his/her own initiated task, and so on.","","The majority vote will select the best solution for the collaborative task."]},{"title":"4 ExpertScore","paragraphs":["KUI heavily depends on members’ voting score to produce a reliable result. Therefore, we introduce an adjustable voting score to realize a selforganizing system. Each member is initially provided a default value of voting score equals to one. The voting score is increased according to ExpertScore which is estimated by the value of Expertise, Contribution, and Continuity of the participation history of each member. Expertise is a composite score of the accuracy of opinion and vote, as shown in Equation 1. Contribution is a composite score of the ratio of opinion and vote posting comparing to the total, as shown in Equation 2. Continuity is a regressive function based on the assumption that the absence of participation of a member will gradually decrease its ExpertScore to one after a year (365 days) of the absence, as shown in Equation 3.  )3( 365 1 )2( )( )( )( )( )1( )( )( )( )( 4","⋅⎟ ⎠⎞ ⎜ ⎝⎛ −= += += ΛΛΛΛΛΛΛΛΛΛΛΛΛΛΛ Λ ΛΛ D Continuity TotalVotecount Votecount onTotalOpinicount Opinioncount onContributi VotecountBestVotecount Opinioncount nBestOpiniocount Expertise ργ βα   Where,"]},{"title":"1=+++ ργβα","paragraphs":["D is number of recent absent date"," As a result, the ExpertScore can be estimated by Equation 4.  ⎪⎪ ⎭ ⎪⎪ ⎬ ⎫ ⎪⎪ ⎩ ⎪⎪ ⎨ ⎧ ++ + × ⎟⎟ ⎠ ⎞ ⎜⎜ ⎝ ⎛ ⎟ ⎠⎞ ⎜ ⎝⎛ −= )( )( )( )( )( )( )( )( 365 1 4 TotalVotecount Votecount onTotalOpinicount Opinioncount VotecountBestVotecount Opinioncount nBestOpiniocount D eExpertScor ργ βα  .........(4)  The value of ExperScore is ranged between 1 to 365 according to the accuracy and the rate of contribution of each member. This means that reliable members are rewarded better score for each vote. However, the expertise of the member is decreased according to the continuity of the participation. By means of the ExpertScore, we can rank the opinions precisely and yield reliable results, especially for the results produced by an online community.   Figure 3. KUI-Polling page"]},{"title":"5 Application Show Case KUI for Collaborative Translation Task","paragraphs":["In this collaborative text translation, individual participants of different mother language work online as a virtual group by using KUI. There are several translation task required the collaborative translation such as Asian WordNet (originally from WordNet (Miller, 1995; http://wordnet. princeton.edu/), Medical Translation, OSS Glossary and so on. And some are ready for individual use for example NICT’s Japanese – English News Articles Alignment, Open Office Glossary, Swadesh List, Technical Term Dictionary.","The volunteer participants are to translate the English text into their native languages, by using KUI. They act as a virtual group and participate in the translation via this web interface. With different backgrounds and degrees of translation abilities, they, therefore, can discuss or exchange their opinion while translating each utterance. The 17 communication is not only for getting to know each other, but also for better understanding of the utterance before translation. Figure 4 shows the participation work flow.   Figure 4. Participant work flow    Figure 5. Lookup page of Asian WordNet  "]},{"title":"6 Conclusion","paragraphs":["We proposed an efficient online collaborative framework in producing and maintaining knowledge according to the principle of collective intelligent. KUI was designed to support an open web community by introducing a voting system and a mechanism to realize the function of selectional preference. It was efficiently introduced to encourage the communication among individuals from different background. KUI was also proved to support the collaborative work in producing many kinds of tasks. The translated text, an example, will be voluntarily maintained by the online participants under the selectional preference based on the voting function. Correspondent to collective intelligent collaborative tool, KUI enables to connect and collaborate among individual intelligence in order to accomplish a complex mission. Of course, “two minds are better than one”. "]},{"title":"Acknowledgment ","paragraphs":["Thanks to KUI community for the invaluable contribution to this project."]},{"title":"References","paragraphs":["http://www.google.com http://www.sourceforge.net http://www.wiki.org  N. Johnson, S. Rasmussen, C. Joslyn, L. Rocha, S.","Smith and M. Kantor. Symbiotic Intelligence:","Self-organizing Knowledge on Distributed Net-","works Driven by Human Interaction, Int. Con-","ference on Artificial Life, Boston. 1998.  KUI. http://www.tcllab.org/kui/ (2006)  Levy. Collective Intelligence: Mankind’s Emerg-","ing World in Cyberspace, New York, 1997.  G. A. Miller. WordNet: A Lexical Databases for English. Communications of the ACM, 39-41, November, 1995","","J.B. Smith. Collective Intelligence in Computer-Based Collaboration. Erlbaum, New York, 1994.","V. Sornlertlamvanich. KUI: The OSS-Styled Knowledge Development System. Handbook of The 7th AOSS Symposium, Kuala Lumpur, Malaysia, 2006.  WordNet. http://wordnet.princeton.edu/ 18"]}]}