{"sections":[{"title":"The FINITE STRING Newsletter Announcements","paragraphs":["Alan Bundy Department of Artificial Intelligence University of Edinburgh Hope Park Square Edinburgh, EH8 9NW, SCOTLAND"]},{"title":"(44-31) 667-1011 ext 6507","paragraphs":["Enquiries about program demonstrations and exhibits","should be sent to the local arrangements chairmen: Graham Wrightson, Joerg Siekmann, and Peter Raulefs Institut fur Informatik 1 Universitat Karlsruhe Postfach 6380 D-7500 Karlsruhe 1, WEST GERMANY"]},{"title":"(49- 721) 608-3975","paragraphs":["General enquiries should be directed to the General","Chairman: Saul Amarel Computer Science Department Hill Center/Busch Campus Rutgers University New Brunswick, New Jersey 08903, USA"]},{"title":"(1-201) 932-3546","paragraphs":["Information about special inexpensive travel arrange-","ments can be obtained from: Kandeler Reisebtiro GmbH HauptstraBe 55, P.O. Box 1267 D-6744 Kandel, GERMANY"]},{"title":"(07275) 2018 or 2019 Announcements ACL Book Series","paragraphs":["A new book series has been announced by the Cambridge University Press. It is entitled"]},{"title":"Studies in Natural Language Processing,","paragraphs":["and has Aravind K. Joshi as the General Editor.","The Association for Computational Linguistics is sponsoring this series of monographs, texts, and collections of papers on scientific and scholarly topics which represent the range of professional activity of concern to its membership. Methods of investigation include the algorithmic, mathematical, and heuristic methods of formal linguistics and artificial intelligence, and the experimental methods of cognitive psychology and psycholinguistics.","It is anticipated that books to appear in the series will be of three general types: research monographs, textbooks, and collections of papers. Research monographs, aimed at the professional reader, will be detailed reports of significant research projects or literature reviews of a size beyond the compass of a journal article. Appropriately revised doctoral dissertations of particularly high quality may be considered for inclusion in the series in this category.","Courses in computational linguistics are becoming increasingly common in departments of linguistics and computer science, and there are so far few, if any, suitable textbooks. Students must rely largely on scattered journal articles and instructors' lectures. Proposals for texts by authors of established reputations in the field will be entertained. A text might be in the nature of a general survey, or might concentrate on one of the major subareas of research.","The third category of books will be collections of papers. These will in no case be proceedings of general meetings or otherwise heterogeneous collections. Rather, each will be a thematically coherent set of research reports bearing on a single, well-defined topic of current significance, assembled under strong direction and control by an editor or editors who will be responsible for the quality of all the contents, and who will provide a unifying introduction. Such a collection might result from a symposium on a particular topic, to 'which the participants submit written papers. Or chapters on various aspects of important problems in a particular area may be especially commissioned by a volume editor. Collections of already-published papers, in cases where the subject is a major and significant one, the papers represent definitive treatments of particular approaches to it, and the papers are in scattered and perhaps not readily available sources, may occasionally be considered.","The Editorial Board for the series consists of: Jonathan Allen,"]},{"title":"M.I.T.,","paragraphs":["Jaime Carbonell,"]},{"title":"Carnegie-Mellon University,","paragraphs":["Eugene Charniak,"]},{"title":"Brown University,","paragraphs":["Paul Chapin,"]},{"title":"N.S.F.,","paragraphs":["Phil Cohen,"]},{"title":"Fairchild, Inc.,","paragraphs":["Martha Evens,"]},{"title":"Illinois Institute of Technology,","paragraphs":["Joyce Friedman,"]},{"title":"University of Michigan,","paragraphs":["Maurice Gross,"]},{"title":"University of Paris,","paragraphs":["Barbara Grosz,"]},{"title":"SRI International,","paragraphs":["George Heidorn,"]},{"title":"IBM Research,","paragraphs":["Ronald Kaplan,"]},{"title":"Xerox Palo Alto Research Center,","paragraphs":["Hans Karlgran,"]},{"title":"KVAL, Sweden,","paragraphs":["Lauri Karttunen,"]},{"title":"University of Texas, Austin,","paragraphs":["Martin Kay,"]},{"title":"Xerox Palo Alto Research Center,","paragraphs":["Jan Lansbergen,"]},{"title":"Phillips Research Laboratories, Eindhoven,","paragraphs":["Wendy Lehnert,"]},{"title":"University of Massachusetts, Amherst,","paragraphs":["William Mann,"]},{"title":"USC/Information Sciences Institute,","paragraphs":["Mitch Marcus,"]},{"title":"Bell Laboratories,","paragraphs":["Makoto Nagao,"]},{"title":"Kyoto University,","paragraphs":["St~mley Petrick,"]},{"title":"IBM Research,","paragraphs":["Ray Perrault,"]},{"title":"University of Toronto,","paragraphs":["Ellen Prince,"]},{"title":"University of Pennsylvania,","paragraphs":["Chris Riesbeck,"]},{"title":"Yale University,","paragraphs":["Jane Robinson,"]},{"title":"SRI International,","paragraphs":["Naomi Sager,"]},{"title":"New York University,","paragraphs":["Peter Sgall,"]},{"title":"Charles University, Prague,","paragraphs":["Candy Sidner,"]},{"title":"Bolt Beranek and Newman,","paragraphs":["Norman Sondheimer,"]},{"title":"USC/Information Sciences Institute,","paragraphs":["Fred Thompson,"]},{"title":"California Institute of Technology,","paragraphs":["Walter von Hahn,"]},{"title":"University of Hamburg,","paragraphs":["Donald Walker,"]},{"title":"SRI International","paragraphs":["Bonnie Webber,"]},{"title":"University of Pennsylvania, 88 American Journal of Computational Linguistics, Volume 8, Number 2, April-June 1982 The FINITE STRING Newsletter Announcements","paragraphs":["Ralph Weischedel, University of Delaware, Yorick Wilks, University of Essex, Terry Winograd, Stanford University, and William Woods, Bolt Beranek and New-man.","Address inquiries to the Series Editor: Aravind K. Joshi Dept. of Computer and Information Science Moore School of Electrical Engineering D2 University of Pennsylvania Philadelphia, Pennsylvania 19104 (215) 243-8540 or to: or to: Dr. Susan Milmoe Cambridge University Press 32 East 57 Street New York, New York 10022 (212) MU 8-8885 Ms. Penny Carter Publishing Division Cambridge University Press The Edinburgh Building Shaftesbury Road Cambridge CB2 2RU, ENGLAND 0223-312393 ACL International Fund","At the Executive Committee meeting in Toronto on June 19, 1982, we decided to establish a special fund, the ACL International Fund, for the following purposes; To make ACL memberships available to our colleagues who have special difficulties in paying dues; for example, in cases where their national currencies cannot be freely used in international transactions.","• To make ACL publications available under the same circumstances.","• And, possibly, to provide supplementary funds for travel to colleagues whose participation in certain meetings is especially warranted. However, such disbursements would be relatively small and infrequent.","Any contributions you make to this fund are fully tax deductible. Furthermore, you may request that your contribution be used to provide memberships or publications for particular colleagues or for colleagues in a specified country or research group. The Executive Committee, which is responsible for allocating the funds, will honor your requests as far as possible. Please consider giving something to the fund, so that the ACL can benefit from the widest possible participation of our colleagues in the discipline we all share.","Checks should be made payable to the ACL Inter-","national Fund and sent to: Donald E. Walker ACL Secretary-Treasurer SRI International, EJ278 Menlo Park, California 94025 Conferences","The Second Biennial Conference on Linguistic Humor, sponsored by the Western Humor and Irony Membership (WHIM), will be held at the Phoenix Hilton Hotel from March 31 to April 2, 1983. The theme of the conference is \"Far-fetched Metaphors: The Humor of Linguistic Deviance.\" For further information contact:","Don L.F. Nilsen","English Department","Arizona State University","Tempe, Arizona 85287","The Association for Literary and Linguistic","Computing will hold its 1983 Meeting in San Francis-","co, California, April 6-8, 1983. [See AJCL 7:4, pg.","264.] For further information contact: James Joyce ITS 2000 Center Street, Suite 1036 Berkeley, California 94704 (415) 621-6415","A Conference on Artificial Intelligence will be held April 26-27, 1983, at Oakland University in Rochester, Michigan. This conference will be hosted by the Center for Robotics and Advanced Automation at Oakland University, in cooperation with the U.S. Army Materiel Systems Analysis Activity and the U.S. Army Tank-Automotive Command, and will include both contributed and invited papers. For information about a session on natural language, contact:","Joan Bachenko","Code 7590","Naval Research Laboratory","Washington, D.C. 20003 The 1983 National Conference on Artificial","Intelligence sponsored by the American Association for","Artificial Intelligence (AAAI), will be held August","22-26, 1983, at the Washington Hilton Hotel in Wash-","ington, D.C. (This is a change from earlier announced","plans.) For additional information contact:","Louis F. Robinson","American Assoc. for A.I.","445 Burgess Drive","Menlo Park, California 94025","(415) 328-3123 American Journal of Computational Linguistics, . Volume 8, Number 2, April-June 1982 89"]}]}