{"sections":[{"title":"","paragraphs":[",t"]},{"title":"AmerieaH Jogrnal of Oo puta¢ionaH Linguistics Volume 8, Number2 April-June 1982","paragraphs":["Applied Computational Linguistics in Perspective:","Proceedings of the Workshop","Carroll Johnson and Joan Bachenko Natural-Language Interface. Text Generation. Concept Extraction. Machine Translation. Sublanguages. Gary G. Hendrix William Mann ...... Christine Montgomery ..... Martin Kay ...... Richard Kittredge"]},{"title":"The FINITE STRING Newsletter","paragraphs":["European Chapter Formed Constitution of the new European Chapter of ACL Call for Papers -","European Meeting First meeting to be held at Pisa in September, 1983 Call for Papers - 1983 ACL Meeting Annual meeting to be held at MIT in June Call for Papers - IJCAI-83 Eighth meeting to be held at Karlsruhe in August Announcements Book series, International fund, Conferences Abstracts of Current Literature Twenty-six abstracts of recent publications"]},{"title":"Microfiche (AJCL Mf. 92)","paragraphs":["55,83 56 62 70 74 79"]},{"title":"85 86 87 87 88 90 ?ub~ished Quarterly by the Association for Computational Linguistics AJCL","paragraphs":["The American Journal of Computational Linguistics (ISSN 0362-613X) is published quarterly by the Association for Computational Linguistics. Co-Editors Pro Tern. Fred J. Damerau, Stanley R. Petrick IBM Thomas J. Watson Research Center P.O. Box 218 Yorktown Heights, New York 10598 (914) 945-2175 Managing Editor Donald E. Walker SRI International 333 Ravenswood Avenue Menlo Park, California 94025 (415) 859-3071 Associate Editor Michael C. McCord (914) 945-1405 FINITE STRING Editor George E. Heidorn (914) 945-2776 Production Editor Cay Dietrich IBM Thomas J. Watson Research Center P.O. Box 218 Yorktown Heights, New York 10598 Editorial Board 1980-1982: Ronald J. Brachman, Fairchild Research Jerry R. Hobbs, SRI International Remko Scha, Philips Research Laboratories Stuart C, Shapiro, State Univ. of N. Y. at Buffalo Candace L. Sidner, Bolt Beranek and Newman 1981-1983: Philip R. Cohen, Oregon State University Barbara J. Grosz, SRI International Karen Sparck Jones, University of Cambridge Jonathan Slocum, Siemens Ralph M. Weischedel, University of Delaware 1982-1984: Jaime G. Carbonell, Carnegie-Mellon University Daniel L. Chester, University of Delaware Martha W. Evens, Illinois Institute of Technology Ronald M. Kaplan, Xerox Palo Alto Research Center S. Jerrold Kaplan, Teknowledge Inc. Copyright © 1982 by the Association for Computational Linguistics. The code and copyright notice appearing at the bottom of the first page of an article in this journal indicate the copyright owner's consent that copies of the article may be made for personal or internal use, or for the personal or internal use of specific clients. This consent is given on condition that the copier pay for copying beyond that permitted by Sections 107 and 108 of the U.S. Copyright Law. The per-copy fee for each article appears after the dollar sign and is to be paid through the Copyright Clearance Center, Inc. This consent does not apply to other kinds of copying, such as copying for general distribution, for advertising and promotional purposes, for creating new collective works, and for resale. Such permission requests and other permission inquiries should be addressed to the Managing Editor at the address given above."]},{"title":"ACL","paragraphs":["The Association for Computational Linguistics is an in-ternational professional society with membership open to any person or institution whose professional goals relate to computational linguistics. President JaneJ. Robinson (1982) SRI International 333 Ravenswood Avenue Menlo Park, California 94025 (415) 859-4573 Vice President C. Raymond Perrault (1982) Computer Science Department University of Toronto Toronto, Ontario, Canada M5S 1A7 (416) 978-8747; 284-3360 Secretary-Treasurer Donald E. Walker SRI International 333 Ravenswood Avenue Menlo Park, California 94025 (415) 859-3071 Executive Committee Wendy G. Lehnert (1980-82) Yale University William C. Mann (1981-83) USC /Information Sciences Institute Lauri Karttunen (1982-84) University of Texas Nominating Committee Ronald M. Kaplan (1980-82) Xerox Palo Alto Research Center Bonnie Lynn Webber (1981-83) University of Pennsylvania Norman K. Sondheimer (1982-84) USC / Information Sciences Institute Affiliations: The ACL is a constituent member of the American Federation of Information Processing Societies, and is also associated with the International Committee on Computational Linguistics. Subscriptions to the AJCL are available only through membership in the ACE Each subscription includes both hardcopy and microfiche versions of the Journal. Annual membership dues are $15 for individuals and $30 for institutions. Joint memberships for couples are available for $20, but provide only one subscription. Postage: The AJCL is normally mailed bulk-rate. First class mailing is available in North America for an additional annual charge of $6. Air-printed mailing is available overseas for an additional annual charge of $12. Back issues of the AJCL may be ordered at annual rates of $15 for individuals and $30 for institutions. The first five volumes (1974-1978) are available only on microfiche; Volumes 6 and 7 (1980 and 1981) are available in both hardcopy and microfiche form; first class mailing is an additional $6, and air-printed mailing is an additional $12. The AJCL was not published during 1979. Payments for dues or back issues should be sent to the ACL Secretary-Treasurer at the address given above. Checks should be made out to the Association for Computational Linguistics (or to ACL) and should be payable in U.S. dollars. There is an additional $2 charge for bank processing costs for checks that are not drawn on U.S. banks. Address changes should be sent to the ACL Secretary-Treasurer at the address given above."]},{"title":"A Note from the Editor:","paragraphs":["The technical contents of this issue consist of the proceedings of a workshop that was held at Stanford University just prior to the ACL Annual Meeting of June 29 - July 1, 1981. An explanation of how the workshop came about and who is responsible for it is included in the Introduction by Carroll Johnson and Joan Bachenko. The five areas surveyed in the Proceedings provide a good overview of the state of the art of a major portion of Computational Linguistics, and these surveys should be of interest to readers just entering the field as well as to those who have long been active. The references, in particular, should prove of considerable value. We regret that it has taken this long after the workshop to assemble this collection of papers, but the large number of people involved made it inevitable that some would not find it possible to meet the schedule which was set up for an earlier date of publication.","The workshop itself gave the individual panels time for extended discussion, and culminated in the panel chairmen giving oral presentations of their panelists' observations and findings. Panel chairmen were, in general, careful to distinguish between their conclusions and those of their panelists, because there was considerable difference of opinion on such matters as the attainments of existing systems and the prognosis for future ones.","Following the workshop, panel chairmen were required to write up a summary of their panels' deliberations and to submit the resulting summaries to panel members for comment and suggestions. Hence, the five panel chairmen, Gary Hendrix (Natural Language Interfaces), William Mann (Text Generation), Christine Montgomery (Concept Extraction), Martin Kay (Machine Translation), and Richard Kittredge (Sublanguages) should be acknowledged as authors of the papers in this issue. Panelists' contributions consisted of discussion at the workshop and careful review of their panel chairmen's drafts. After a period of rewriting, manuscripts were forwarded for review to the Navy Research Laboratory, where further editorial review was exercised.","As this issue goes to press, we have in hand, machine-readable versions of the three papers which will comprise the next issue. They should be printed in final form by us and ready for duplication and binding by the time you read this. Hence, this issue will be followed by one more under our editorial by-line before James Allen takes over. We are in the process of cleaning up our files on pending papers and transferring them to the new editor, and new contributions should be sent directly to him.","We would like to take this opportunity to acknowledge the contributions of our Production Editor, Cay Dietrich, in transforming raw, machine-readable text with either no formatting commands or (more typically) formatting commands for a different formatter than the one we are using. Cay has done a really outstanding job because she not only is an expert in the use of our computer photocomposition system but also has an understanding of the technical contents of the papers in question that allows her to produce a typography and layout that is a credit to the ACL. She has agreed to stay on as Production Editor, and we are all fortunate for the really large effort she has made on our behalf. Cay's last issue was deficient in only one respect: she failed to include reference to her own contribution as Production Editor in the listing of AJCL officers. We rectify that omission with this note."]},{"title":"F. J. Damerau and S. R. Petrick, Editors Pro Tern.","paragraphs":[]}]}