{"sections":[{"title":": FSMNLP'98 i m n m m m m m m m m mm m m m m m U m Proceedings of the International Workshop on Finite State Methods in Natural Language Processing Edited by Lauri Karttunen Kemal Oflazer June 30- July 1, 1998 Bilkent University Ankara, Turkey m m m m m m t mm m m m m m m m m m m m m mm m m","paragraphs":["n"]},{"title":"l I i i g i i i","paragraphs":["in"]},{"title":"I i i I R m i i S i i","paragraphs":["in ,,n"]},{"title":"FSMNLP'98 Proceedings of the International Workshop on Finite State Methods in Natural Language Processing Edited by Lauri Karttunen Kemal Oflazer June 30- July 1, 1998 Bilkent University Ankara, Turkey","paragraphs":["Published by Bilkent University. ISBN 975-7679-34-8 Copyright (~) 1998 by Bilkent University All rights reserved. No part of this publication may be reproduced, stored in a retrieval system or transmitted in any form or by any means, electronic, mechanical, photocopying, recording or otherwise for commercial purposes, without the written permission of the Publisher, Bilkent University Faculty of Engineering, TR-06533 Bilkent, Ankara, Turkey. No responsibility is assumed by the Publisher for any injury and/or damage to persons or property as a matter of products liability, negligence or otherwise, or from any use or operation of any methods products, instructions or ideas contained in the material herein. Printed and bound by Meteksan A. $., Ankara, Turkey. May 1998."]},{"title":"FSMNLP'98 INTERNATIONAL WORKSHOP ON FINITE STATE METHODS. IN NATURAL LANGUAGE PROCESSING June 30-July 1, 1998 Bilkent University Ankara, Turkey","paragraphs":["Supported By","EACL - European Chapter of the Association for Computational Linguistics","TUBITAK-Turkish Scientific and Technical Research Council","NATO Science for Stability Programme TU-LANGUAGE Project"]},{"title":"PROGRAMME AND ORGANIZING COMMITTEE","paragraphs":["CO-CHAIRS Lauri Karttunen Xerox Research Center Europe Kemal Oflazer Bilkent University Kenneth R. Beesley Eva Ejerhed Ronald M. Kaplan George Kiraz Kimmo Koskenniemi Cl,ludio L. Lucchesi Mark-Jan Nederhof Emmanuel Roche Gertjan Van Noord Xerox Research Center Europe Umea University Xerox PARC Bell Laboratories University of Helsinki University of Campinas DFKI Teragram Corp. University of Groningen Eric Brill Jerry Hobbs Martin Kay AndrOs Kornai Tomasz Kowaltowski Mehryar Mohri Richard Sproat Yves Schab~s Atro Voutilainen Johns Hopkins University SRI International Xerox PARC Bolt Beranek Newman University of Campinas AT&T Labs Research Bell Laboratories Teragram Corp. University of Helsinki III"]},{"title":"PREFACE","paragraphs":["Recent years has seen a substantial increase in the use of finite state techniques in many aspects of natural language processing as mature tools for building large scale finite-state systems from various research laboratories and universities become available. This trend was by no means foreseen as late.as ten years ago given the well-known demonstration by Noam Chomsky in 1957 that finite-state methods are inherently incapable of representing the full richness of constructions in a natural language. Nevertheless, it is evident now that there are many subsets of natural langugage that are adequately covered by finite-state means and that there are many other areas where finite-state approximations of more powerful formalisms are of great practical benefit. The discovery that systems of phonological rewrite rules and optimality contraints are within the finite-state domain has made an important theoretical leap forward. We expect that similar discoveries are yet to be made in other areas of linguistics. FSMNLP'98, International Workshop on Finite State Methods in Natural Language Processing was conceived, with support and motivation from EACL, as a forum to bring together recent contributions in all aspects of the theory and applications of finite state machinery in language processing. As you may have already observed by reviewing the workshop programme and bY looking at the papers to be presented, the mix of the contributions is international and shows wide-spread interest in this technology. They range over a variety of topics of great interest to the NLP community. We thank members of the Programme Committee who, with their prompt and dedicated reviews of the submissions, enabled us to select the contributions for these proceedings. We thank Bilkent University for providing the facilities and contributing to the logistics of the workshop. We also thank the NATO Science for Stability Programme (Phase III) which let us use funds from the TU-LANGUAGE Project, and TBITAK, the Turkish Scientific and Technical Research Council, for additional financial support. Last but not least, we thank Professor Biilent Ozgii§, Dean of the Faculty of Art, Design and Architecture, for his help in designing the cover and in the production of the proceedings. We hope you enjoy the workshop. Lauri Karttunen and Kemal Oflazer V"]},{"title":"i ni t i nn i","paragraphs":["in na"]},{"title":"I [] i i I","paragraphs":["in"]},{"title":"TUESDAY, • 9:45 - 10:00 • 10:00 - 11:00 • 11:00 - 11:30 • 11:30 - 12:00 • 12:00 - 12:30 • 12:30 - 14:00 • 14:00 - 14:30 * 14:30 - 15:00 • 15:00 - 15:30 WORKSHOP PROGRAMME and TABLE OF CONTENTS June 30, 1998 Page No.","paragraphs":["Opening Remarks PLENARY TALK: The Proper Treatment of Optimality in Computational Phonology ...................................................................... (1) Lauri Karttunen Xerox Research Centre Europe, France BREAK Context-free Parsing Through Regular Approximation .................. (13) Mark-Jan Nederhof DFKI, Germany Does Tagging Help Parsing? A Case Study on Finite State Parsing .... (25) Atro Voutilalnen University of Helsinki, Finland LUNCH Robust Parsing Using a Hidden Markov Model ........................... (37) Wide It. Hogenhout Canon Research Centre Europe,United Kingdom Yuji Matsumoto Nara Institute of Technology, Japan Incremental Construction of Minimal Acycllc Finite State Automata and Transducers ................................................................... (48) Jan Daciuk University of Gdansk, Poland Bruce W. Watson Ribbit Software, Canada and","University of Pretoria, South Africa Richard E. Watson Ribbit Software, Canada Treatment of e-MOves in Subset Construction ............................. (57) Gertjan van Noord University of Groningen, The Netherlands • 15:30 - 16:00 BREAK • 16:00 - 16:30 • 16:30 - 1T:00 Learning Finite State Models for Language Understanding .............. (69) David Pic6 Polytechnic University of V~lencia Enrique Vidal Spain A Multilingual Natural Language Interface to Regular Expressions .... (79) Aarne Ranta Xerox Research Centre Europe, l~rance VII WEDNESDAY, July 1, 1998 • 10:00 - 10:30 • 10:30 - 11:00 • 11:00 - 11:30 * 11:30 - 12:00 Implementing Voting Constraints with Finite State Transducers ....... (91) Ke_ma] Oflazer Bilkent University, Turkey GSkhan T~r Feature Structures, Unification and Finite State Transducers .......... (101) R~mi Zajac New Mexico State University, USA Using Genericity to Create Customizable Finite State Tools ........... (110) Sandro Pedrazzini University of Ba~el and Marcus Hoffman IDSIA Switzerland ConstrRinlng Separated Morphotactic Dependencies in Finite State Grammars ...................................................... .................... (118) Kenneth R. Beesley XRCE, France"]},{"title":"i","paragraphs":["n"]},{"title":"i i","paragraphs":["n"]},{"title":"m i i i i n i i","paragraphs":[]}]}
