{"sections":[{"title":"Temporal Discourse Markers and the Flow of Events","paragraphs":["Frank Schilder","Computer Science Department","University of Hamburg Vogt-K~511n-Str. 30 D-22527 Hamburg","Germany","schilder@informatik, uni-hamburg, de."]},{"title":"1 Introduction","paragraphs":[" Temporal discourse markers such as"]},{"title":"after, before","paragraphs":["or"]},{"title":"while","paragraphs":["are commonly described as triggers for discourse relations expressing a temporal relation (Mann and Thompson, 1987; Knott, 1996). However, only little research has been done regarding the interaction of such discourse markers with the context within a multi-sentence discourse.","Lascarides & Oberlander (1993), for instance, note that sentences containing temporal connectives expressing the same temporal structure may not describe a coherent discourse in certain contexts. Along these lines a similar theory was developed by de Swart (1994) wrt. temporal adverbials and also applied to temporal clauses. She points out that the topic/focus structure has to be taken into account, especially when"]},{"title":"apreposed","paragraphs":["syntactic structure as in (1) is read:","(1) John had always been rather shy. But after he met H61%ne, his behavior changed quickly. He was very self-assured now. According to her proposal, the"]},{"title":"after-clause","paragraphs":["only adds further temporal information to the event structure of the discourse, since it is in the topic position of the sentence providing 'old' information. A sentence with a so-called"]},{"title":"postponed after-clause","paragraphs":["as in (2), on the other hand, requires a connection to the preceding context via a rhetorical relation (i.e."]},{"title":"background):","paragraphs":["(2) Ty and John were good friends, and they often went to the movies together. But John's behavior changed quickly after he met H%l~ne. Ty said she bewitched him.","Previous work seems do indicate that the syntactic variations of"]},{"title":"after-clauses","paragraphs":["play an important rule for the organisation of discourse. The purpose of this paper is to shed some light on the usage of the German translation of"]},{"title":"after","paragraphs":["(i.e."]},{"title":"nachdem).","paragraphs":["First, an analysis is undertaken with respect to this tempora! connective in a German corpus. Differences regarding the syntactic variations as compared to English are pointed out. Secondly, the question is raised what kind of rhetorical relation is expressed by this discourse marker and how this discourse marker interacts with the preceding discourse.","One important outcome of these investigations is that the discourse marker"]},{"title":"nachdem","paragraphs":["does not only indicate a rhetorical relation (i.e."]},{"title":"narration).","paragraphs":["I will suggest that the"]},{"title":"nachdem-clause","paragraphs":["serves a crucial function regarding discourse organisati0n. Generally speaking, the temporal information conveyed by this clause provides the clue to return to a previously mentioned thread in the discourse. This function of a temporal clause is not discussed by Lascarides & Oberlander or by de Swart.","The remaining part of the paper is organised as follows: Section 2 contains the corpora analysis regarding syntactic variations.Section 3 provides a closer look at the data from a semantic angle. Example sequences are analysed regarding their discourse structure. The last section summarises the results and concludes."]},{"title":"2 Nachdem","paragraphs":["in written text 2.1"]},{"title":"Corpora German","paragraphs":["The online corpora maintained by the"]},{"title":"InstitutfiJir deutsche Sprache","paragraphs":["(IDS) in Mannheim were used to collect the German data. I The corpus chosen for this study (i.e. Mannheimer Korpus t) contains novels as well as newspaper articles. After a selection process, 80 sentences were analysed in more detail. English A first investigation of the British National Corpus (BNC) 2 was carried out to compare to the observation obtained for German. Two simple searches for the English discourse marker"]},{"title":"after","paragraphs":["were initiated. Spoken language data were excluded from the list of samples to be considered. The number of example sentences left was 30. 2.1.1 Analysis The selected sentences (N=80; N=30) were read and analysed regarding the following criteria: Syntax Five different structures were distinguished:"]},{"title":"postponed The","paragraphs":["main clause occurs before the complement clause (e.g."]},{"title":"Seidler selbst machte auf, nachdem ich geklingelt hatte.","paragraphs":["[BT, p. 396] or"]},{"title":"he was removed from office (...) after he had openly burned his certificate of membership (...)","paragraphs":["[B2W 694]). tThe URL for the COSMAS-system is ht~p://www, ids-","mannheim, de/ldv/cosmas/,~intro, html. 2The URL for this corpus is ht tp : / / in fo. ox. ac. uk/bnc/."]},{"title":"/58","paragraphs":["topicalised A temporal adverbial or a clause describing a salient situation is topicalised (e.g. Schon am Abend jenes ersten Tages. nachdem ich den Sonnenuntergang gefilmt hatte, spielten wir Pingpong [HF, p.89]). noun-first A Noun (or Noun Phrase) is followed by the complement clause and the verb phrase. This construction, however, can only be found within another complement clause (e.g ..... wo die Gitarrensanger, nachdera sie vor den Touristen-Restaurants gebettelt haben, ihre Pizza essen und Chianti per Glas trinken; [HF, p. 150]). verb-first The complement clause interjects the main clause between the verb and the objects or complements (e.g. Matzerath war im Laden und dekorierte, nachdera er das Geschirr vom Mittagessen abgewaschen hatte, das Schaufenster. [BT, 245]). preposed The complement clause succeeds the main clause (e.g. Nachdem er in diesem Ort die Grundschule hinter sich gebracht hatte, ging er zuru'ck in die Groflstadt zu seinem Vater (...) [DBA, p. 172] or After I made the cut l folded back the turf(... ) [AOR 2942]). Aspeetual Classes The main and complement clauses were categorised according to the four aspectual classes by Vendler (1967): State to love, to know, to cost"]},{"title":"Activity","paragraphs":["to run, to walk, to laugh Accomplishment to destroy, to create Achievement to notice, to win The classification of a situation regarding theses classes was tested using linguistic tests (e.g. John was happy for 3 hours vs. *John was happy in 3 hours). 2.2 Statistical results Most naturally one would expect that the syntactic surface reflects the actual ordering between the two situations such as in (3): (3) After Peter had left, he went to the cinema.","Lever (1989, p. 380), for instance, claims exactly this by saying that information to be expressed should be arranged according to the \"natural ordering of its content.\" But the corpus investigation did not confirm this claim. Instead, a variation of different syntactic structures were found. Surprisingly enough, although the preposed structure was the most common one, it was definitely not as dominating as one would expect. This structure was found in only 33.75% of the studied cases.","The verb-first structure, where the complement clause is inserted immediately after the verb of the main clause, occurred almost as often as the preposed structure (i.e. 32.5 %). And even the postponed construction was found in 21.25% of the cases investigated. The topicalised structure was found in 11.25% of the sentences (s. Figure 1).","Assuming that the verb denotes the situation, we find in more than fifty percent of the cases a syntactic variation that does not reflect the natural order of the described situations (i.e. the postponed and verb-first structure represent 53.75% of all cases).","The next section investigates in more detail how the syntactical structure correlates with the aspectual classes of the complement clause. v ~b- fTst : 31.2~ : 21.2~ Figure 1: The syntactical variants in German 2.3 Comparison with after 2.3.1 Differences in number The assumption that the preposed structure would occur most often in the corpus was not confirmed. In fact, an even higher distribution of the reverse syntactic structure was found compared to German, namely 60% (s. Figure 2).","Cases of the verb-first and noun-first structure did not occur at all in the English corpus which is not surprising, since these syntactic structures are not grammatical in English. toOie..,al'is~: 6.6\"~ Figure 2: The syntactical variants in English 2.3.2 Differences in structure At first sight the high number of the postponed syntactic structure would seem to be unexpected, although a high number of cases were found for the German data. However, bear in mind that more than half of the sentence in German were postponed or verb-first structures 59 (i.e. 53.75%) which are constellations not reflecting the actual ordering of the described situations. 3 2.4 Intermediate results The corpora analysis showed that a variety of syntactic structures can be found in written text. The data disproved Levelt's claim that information should be expressed according to a natural order.","A brief investigation of an English corpus showed similar results regarding the syntactic variation. Differences between the languages could be explained by the different word order regarding temporal adverbials.","The next section focuses on the discourse structure and what kind of effects can be observed between the nachdem-clause and the preceding discourse."]},{"title":"3 Nachdem in written discourse","paragraphs":["The following section gives a brief overview of how temporal connectives such as after are treated in discourse grammars. With de Swart's approach in mind, the preceding context of a nachdem-clause in the 80 sentences of the German corpus investigation were studied wrt. the criteria concerning the aspectual classes. First of all, the aspectual class of the immediately preceding sentence was determined. Inspired by these data the discourse structure for several example discourse sequences is presented and discussed.","In section 3.3 the outcome of these investigations is used to gain a better view of how the discourse structure was constructed with the help of temporal discourse markers.","I argue that a nachdem-clause is used to provide directions through the discourse structure. The temporal information expressed can be seen as a reference back in time and discourse structure. These clues have to be given from the writer so that the reader will not lose the thread of the story. 3.1 Temporal connectives De Swart proposes an analysis of temporal adverbials and temporal clauses within Segmented DRT (SDRT) (Asher, 1993). As mentioned in the introduction, a difference in discourse structure can be observed for the two discourses ((1)=(5a), (2)=(5b)):","(5) a. John had always been rather shy. But after he met H~l~ne, his behavior changed quickly. He was very self-assured now.","3Furthermore. an analysis of a German sentence according to the to~uology approach to word order yields the following","Vorfeld link¢ Kl. Mittelfeld rechte Kl. schema: Peter u'ank heute zwei Bier. Temporal adverbials can be most often found in the Mittelfeld according to this analysis. In English, however, temporal information is normally presented at the end of a sentence. (4) Peter drank two beers today. Hence I will consider nachdem occurring in this construction as a tern-poral adverbial and not as a discourse marker.","b. Ty and John were good friends, and they often went to the movies together. But John's behavior changed quickly after he met Hrl~ne. Ty said she bewitched him.","The discourse in (5a) contains a preposed temporal clause that according to de Swart's account only adds further temporal information to the existing event structure. No further rhetorical information is supposedly derived.","The main clause in (5b), she argues on the other hand, is connected with the preceding discourse via the rhetorical relation background.","One question comes to mind after reading this explanation for the two discourses: why does de Swart not use the discourse marker bur in (5a) to derive the rhetorical relation contrast? Note that the discourse marker but is actually required to establish a coherent discourse. It is also necessary to derive this rhetorical relation, because otherwise the temporal relation between John's shyness and his change of behavior cannot be derived. Bear in mind that temporal relations a.re by-products of rhetorical relations within the SDRT framework.","Lascarides & Oberlander (t994) propose an account that takes more into account the interaction between world knowledge and the underlying rhetorical relations. However, they do not consider the effect different syntactic variants may have, but provide a sound formal explanation for the example sentences discussed above. Their starting-point is a discourse that contains a state as the first sentence fo!~owed by a sentence containing a after- (or before-) clause. A similar example discourse they discuss is presented in the following: (6) Mary was cross with John,","a. She was pacified after John gave her the tickets for the concert.","b. ?John gave her the tickets for the concert before she was pacified.","They show how the after-clause in (6a) interacts with the state described in (6). A rhetorical relation is derived between the situations described by these two clauses (i.e. Background). In addition, a Result relation between the after-clause and the main clause in (6a) can be established due to our world knowledge.","The contrast between (6a) and (6b) is explained by Lascarides & Oberlander as follows. They point out that temporal connectives are presuppositional. The situation described by the temporal clause is assumed to have occurred for the entire sentence to have a truth-value (cf. (Heinam~iki, 1972)). If this is not the case, the situation has to be accommodated into the reader's current discourse model. But this can't be satisfactorily done for the situation described by the before-clause in (6b).","The example discourses discussed show that several factors have to be considered. Rhetorical relations holding between the situation described by the after-sentence"]},{"title":"60","paragraphs":["and the situations described by the preceding context have to be derived.","In order to get a better understanding of what kind of relations between an after-clause and the context can be derived, I examined in more detail what context such a clause is normally embedded in in the following section. 3.2 The preceding context The data extracted for the corpus investigation in section 2.2 were analysed a second time. The preceding sentence was classified according to its aspectual class. Interestingly enough, a high number of homogeneous aspectual classes were found (i.e. 65%). Consider (7): 4","(7) (a) Peter schol~ seinen dreizehnten Spatz an diesem Nachmittag. (b) Er war sehr zufrieden mit seiner Ausbeute. (c) Nachdem er den dreizehnten zu den anderen Spatzen gelegt hatte, (d) ginger nach Hause. (Peter shot his thirteenth sparrow at this afternoon. He was quite happy with this result. After he had laid the thirteenth beside the other sparrows, he went home.)","This example sequence shows that the situation described by the after-.clause (i.e.(Tc)) refers back to a situation mentioned in (7a). This example also shows that nachdem does not only add temporal relation to the event structure. The previous discourse structure has to be taken into account as well. 3.3 Discourse structure and discourse guidance I agree with de Swart's observation that apreposed structure triggers a break in the narration. But the connection has to be made wrt. the discourse structure derived to that point. Only adding a temporal constraint is not enough to cover the meaning and function of a nachdem-sentence.","I suggest that nachdem's function in a written discourse is to connect discourse segments. The difference in the syntactic position can explain how this connection is to be made. A preposed structure triggers a search in the discourse structure for a position where the situation described by the main clause is to be connected to. A postponed structure, on the other hand, adds temporal information to the main clause situation and incorporates it with the discourse structure derived before-hand. But bear in mind that a rhetorical relation has to be established between the main clause and the preceding context.","Consider a slightly altered version of (7):","(8) Peter schol3 seinen dreizehnten Spatz an diesem Nachmittag. (b) Er war sehr zufneden mit seiner Ausbeute. (d) ?Er ging nach Hause, (c) nachdem er den dreizehnten zu den anderen Spatzen gelegt hatte.","The main clause can be connected to the shooting via narration. But, the nachdem-sentence cannot initiate a search for a connecting situation then, since the \"~This is a modified discourse found in [BT, p. 448]. narration relation has closed off this discourse segment. Hence the discourse structure has to be reorganised and (8c) is inserted in the already generated structure. 4 Conclusions I have shown how a corpus analysis ofnachdem can shed some light on the usage of the temporal connective nachdem in real text. The claim by Levelt that information is expressed according to a natural order was disproved by the data presented.","Moreover, I have discussed the different discourse functions of nachdem wrt. the postponed and preposed structure. It was shown that de Swart's account of temporal clauses was not sufficient to explain the data discussed. Lascarides & Oberlander's theory, on the other hand, is limited to a specific construction shown in (6). Discourse phenomena such as returning to an earlier thread in the discourse are not covered by their approach.","Ongoing research is being carried out with the focus on the reading time of the two different syntactic variants. Psychological experiments will provide more evidence that there is a difference between the variations. A Work of Fiction [AC] Ansichten eines Clowns ('The Clown') by Heinrich BSII, [BT] Die Blechtrommel ('The Tin Drum') by Gtinter Grass, [HF] Homo Faber ('Homo Faber') by Max Frisch","References","Nicholas Asher. 1993. Reference to abstract Objects in Discourse, volume 50 of Studies in Linguistics and Philosophy. Kluwer Academic Publishers, Dordrecht.","Henri6tte de Swart. 1994. Time adverbials in sentence and discourse. In Peter Bosch and Rob vander Sandt, editors, Focus and Natural Language Processing, volume 2, pages 415-424. IBM Deutschland Informationssysteme GmbH.","Orvokki Heintimtiki. 1972. \"before\". In Papers from the Eighth Regional Meeting of the Chicago Linguistics Society, pages 139-151, Chicago, Illinois, USA.","Alistair Knott. 1996. A Data-Driven Methodology for Motivating a Set of Coherence Relations. Ph.d. the-sis, Department of Artificial Intelligence, University of Edinburgh.","Alex Lascarides and Jon Oberlander. 1994. Temporal connectives in a discourse context. In Proc. of the 7 th EACL, pages 260-268, Dublin, Ireland. Association for Computational Linguistics.","W.J.M. Levelt. 1989. Speaking: From Intention to Articulation. MIT Press, Cambridge, Mass.","William Mann and Sandra Thompson. 1987. Rhetorical structure theory: A theory of text organisation. Technical Report ISI]RS-87-190, USC/ISI, June.","Zeno Vendler, 1967. Linguistics in Philosophy, chapter 4, pages 97-121. Cornell University Press, Ithaca NY. 61"]}]}
