{"sections":[{"title":"COUNGoACL '98 36th Annual Meeting of the Association for Computational Linguistics and 17th International Conference on Computational Linguistics Proceedings of the Conference Volume I August 10-14, 1998 Universit~ de Montreal Montreal, Quebec, Canada","paragraphs":["© 1998 Universit~ de Montr4al. Current ACL members may order copies of this and other ACL-related proceedings from: Association for Computational Lingustics (ACL) 75 Paterson Street, Suite 9 New Brunswick, NJ 08901 USA Tel: +1-732-342-9100 Fax: +1-732-873-0014 rasmusse©cs, rutgers, edu All other orders (from libraries, institutions and other individuals) should be addressed to: Morgan Kaufmann Publishers 340 Pine Street, 6th Floor San Francisco, CA 94104 USA Tel: +1-650-392-2665, ext. 231 Fax: +1-650-982-2665 mkp©mkp, com Imprim~ au Canada Printed in Canada"]},{"title":"COLING-ACL'98 Sponsors The Organizing Committee of COLING-ACL'98 wishes to thank the following sponsors for their generous support: Our institutional sponsors • Universit~ de Montreal","paragraphs":["-"]},{"title":"Vice-rectorat k la recherche et k la planification • Universit~ de Montreal- Facult~ des arts et des sciences • Government of Canada - Department of Industry • Government of Canada- Social Sciences and Humanities Research Council Our patrons Our corporate sponsors Lucent Technologies Bell Labs Innovations Our supporters • AT&T Research • Druide Informatique • General Electric • Lexis-Nexis • Machina Sapiens Preface: President of the ICCL","paragraphs":["The volume attests to the great and growing vigor of our field by its size, the quality of the papers that it contains, and the tireless devotion of the people who put it together. The first International Conference on Computational Linguistics (it was not dubbed \"Coling\" for another four years) had no proceedings and neither did the earliest meetings of what was then the Association for Machine Translation and Computational Linguistics. In the approximately thirty-five intervening years, we have taken on the full panoply of academic respectability with departments and chairs in major universities, international conferences whose proceedings instantly become indispensible works of reference, workshops, special interest groups, tutorials and so forth. To you who have helped bring us where we are and show every intention of carrying us on to greater heights, I say thank you, and congratulations!","This meeting is the second Coling to be held in Canada, the first having been in 1976, and it is also the second combined International Conference on Computational Linguistics and Annual Meeting of the Association for Computational Linguistics, the first having been in Stanford, California, in 1984. The people who were fortunate enough to attend one or both of those meetings generally look back on them with fondness, and the people that contributed to their organization, with pride. This meeting will eclipse them both, thanks to the devoted efforts of countless people, but most notably Pierre Isabelle and Christian Boitet, and thanks to you, the writers, readers, reviewers, and presenters without whom it would not exist. Martin Kay"]},{"title":"Preface: President of the ACL","paragraphs":["This volume may come as a surprise to regular participants of the annual ACL conferences. It is certainly more substantial in its weight and, hopefully, in its contents as well. While the former is chiefly the result of the extremely difficult and time-consuming efforts of the Program Committee, headed by Christian Boitet and Pete Whitelock, the latter derives from the participants themselves. The scientific level of any conference is determined not only by the value of the papers presented and included in the Proceedings, but also--and perhaps more importantly--by the liveliness and substantiveness of the discussions, in the lecture rooms and the corridors, the cafes and the restaurants...","Be that as it may, I feel confident that most participants will agree that it has been profitable for us to join forces once again (as we did in Stanford in 1984) and to hold a joint meeting of ACL and Coling. This belief is probably not shared at this time by the co-chairs of the PC, and perhaps even less by the conference organizer, Pierre Isabelle, whose life had been enormously complicated over the past year by the job of bringing so many computational linguists together in one place. I would like to express my deepest admiration and gratitude for all the work they have done in organizing this conference. I am convinced that after the fatigue wears off, even they will share with us the feeling of satisfaction and pleasure at having been part of a stimulating, fruitful and friendly meeting. Eva Haji~ov£ ii"]},{"title":"Preface: Chair of the Organizing Committee","paragraphs":["At the time of this writing, the Proceedings are just about to go to press. It is a thrilling moment for our Organizing Committee. All that work of ours was like setting the table for a grand meal. Now we can see that the food has been taken care of, and that it will be extremely abundant and diverse enough to please almost everyone's palate.","Since the inception of the COLING-ACL'98 project more than four years ago, the road has been long and full of surprises. As a case in point, it is interesting to note that while it was understood from the start that COLING-ACL'98 would be staged at the Universit~ de Montreal, we had no idea then that our laboratory would (for independent reasons) become part of that university in the summer of 1997. Naturally, this particular development turned out to facilitate the project in many respects. More often, however, it was rather some unexpected complication that would pop up along the way. Each time, we would be led to wonder what kind of temporary madness had driven us to solicit the dubious privilege of doing all this organizational work.","Now that we can see the Proceedings and the complete scientific programme, we feel that our efforts are in fact being generously rewarded. I am glad we did take up the challenge to organize COLING-ACL'98 and I would like to thank the ICCL and the ACL for granting us their confidence.","However, if either one of these organizations (or worse the two of them together) should ever ask you to organize such a joint conference, my advice is that you should seriously think twice before accepting... You certainly cannot do it alone. One thing you should ask yourself is whether you will be able to get all the help you will need. Without a competent and truly dedicated team you don't stand a chance! Pray that you will be as lucky as I was: for it was truly a privilege to be able to work with such a resourceful and pleasant group as the people listed below. Lyne Da Sylva Francis Fauteux Richard Kittredge Guy Lapalme Marie-Claude L'Homme Elliott Macklovitch Alain Polgu~re Graham Russell Michel Simard Alain Th~riault Machina Sapiens Informatique et recherche op~rationnelle, Universit~ de Montreal Linguistique et traduction, Universit~ de Montreal Informatique et recherche op~rationnelle, Universit~ de Montreal Linguistique et traduction, Universit~ de Montreal RALI, Universit~ de Montreal Linguistique et traduction, Universit~ de Montreal RALI, Universit~ de Montreal RALI, Universit~ de Montreal Linguistique et traduction, Universit~ de Montreal Pierre Isabelle 29 June 1998 Ill"]},{"title":"Preface: Programme Committee Co-Chairs","paragraphs":["Shortly after COLING'94, when it was decided to accept the proposal to hold COLING'98 in Montreal, Pierre Isabelle suggested to join it with ACL'98. ICCL and ACL agreed very soon and preparations began. It would be the second such joint event, the first having taken place 14 years ago, also in North America, at Stanford.","Since 1984, the NLP community has grown considerably, and a very large participation was expected. Also, the structure of COLINGs and ACL conferences had evolved differently, so that no existing model could be reused. To cut a long story short, it was finally agreed to: (1) set up a programme committee with an ICCL Chair (Christian Boitet, Grenoble) and an ACL Co-chair (Pete Whitelock, Oxford), (2) organize the event in 3 parts, tutorials, conference, and workshops, as in the last ACL/EACL'97 in Madrid, and (3) to assign the main responsibility of the conference part to Grenoble and that of the tutorials and workshops to Oxford.","The answers to the call for tutorial proposals were quite numerous and led to 11 interesting pre-conference tutorials.","The answer to the call for workshops proposal was also very successful, so that we had to extend from 1 to 2 days (Aug. 15 and 16) to accommodate one 2-day workshop and 10 1-day workshops: Very Large Corpora, Content Visualization and Intermedia Representations, Discourse Relations and Discourse Markers, Computational Terminology, Processing of Dependency-based Grammars, Computation of Phonological Constraints, Computational Treatment of Nominals, Translingual Information Management, Usage of WordNet in Natural Language Processing Systems, Computational Approaches to Semitic Languages, and Partially Automated Techniques for Transcribing Naturally Occurring, Continuous Speech.","As far as the conference is concerned, the e-mail submission process led to 640 announcements of submissions. We received 550 full papers, which were reviewed by about 320 reviewers organized in 17 subcommittees. Each paper was evaluated by 3 reviewers and sometimes also by the Subcommittee Chair or one of the Program Chairs. The advice of reviewers was synthesized by the Subcommittee Chairs, with the final evaluation and decision in the hands of the Programme Chairs. We read about 30% of the total submissions in order to resolve borderline cases and ensure consistency between subcommittees. We maintained a distinction between regular papers and project notes, reflecting the completeness of the work described. By restricting project notes in length, we were able to accept a much higher number of papers within the overall constraints of volume size. In the end, 137 regular papers and 96 project notes (33 with demos) were selected. Two regular papers later proposed also separate demos. No criteria other than scientific ones were applied. In particular, we did not try to reach any a priori fixed quotas for topics. Our community must be very grateful to all who participated in the review process and invested so much of their time and energy, in particular the subcommittee Chairs.","We also decided to invite 2 eminent researchers, David Sankoff from UdM and Changning Huang from Tsinghua University, to present papers on their on-going research, one at the border between NLP and mathematics, and the other in a very active part of NLP. Two interesting panels were also proposed by Antonio Zampolli and Nicoletta Calzolari.","Some remarks can be made at this point on the heterogeneity of papers relative to proposed topics, the state of our community relative to modern technology, and the blind review aspect of the selection process.","The 17 subcommittees were determined by ICCL and ACL in a fairly classical way, the detailed layout being intended to encourage evenly distributed submissions. Each submission had to indicate one or two topics, in order. It then came quite as a surprise to see that the repartition by first topics was extremely uneven, going from 9 to 107! To assign papers to subcommittees, the PC then iv considered the second topics. Even then, only 70% of papers could be assigned to a subcommittee corresponding to one of their two selected topics. The PC had to take the titles and abstracts into consideration in making final assignments, some of which were in line with the topics and some not quite so. The PC therefore asked reviewers to evaluate papers with the whole set of topics in mind, rather than only those listed for their subcommittee. Subcommittee Chairs frequently asked new reviewers to join their subcommittee to evaluate papers outside of their initial domain, and the final result was quite satisfactory. However, a review process of this size is very complex, and the decision to accept or reject papers with contradicting evaluations is a difficult matter. Also, the subjective impression of overall quality of papers by subcommittee Chairs varied considerably. Nevertheless, the overall quality was felt to be quite high, and, with more space available in the programme, the PC would have liked to accept about 80 more papers. (These were actually put in a waiting list; however, almost no accepted paper was retracted).","On the technological aspect: for the first time in the history of COLINGs, it was decided to use e-mail intensively. That was not possible before, as COLING has always been very international and some countries did not have easy access to e-mall, although ACL has used it for a long time now. The same is actually still true of access to the Web. About 90% of those submitting papers understood the guidelines given in the call for papers and sent a correct and complete identification page in plain ASCII as required. The story of the submission proper is different. Paper versions were required, to avoid innumerable problems with formats, fonts, etc., and this was OK. But authors were also invited, again for the first time in the history of COLINGs and the nth time in that of ACLs, to send the same content as postscript or pdffiles for backup purposes in case of postal problems during the review process. This led to an enormous workload and much disappointment for the PC, because (1) only 306 out of the 550 final papers were sent as files; (2) only 162 managed to produce correct files, and for 50% of those, only after sending 2 or 3 incorrect versions; (3) about 75% of authors (including some reviewers and subcommittee chairs) did not follow the guidelines and sent files containing the author names and affiliations, or produced files with bad names such as coling.ps or ac198.ps or Smith.ps instead of"]},{"title":"[#]idnumber.ps,","paragraphs":["or did not include the proper fonts, or included files in messages rather than attaching them. A further remark is that the vast majority of file-related problems came from North America, then Europe, and far behind Asia. In other words, our Asian colleagues did far better than all others, although they have many more problems linked with their writing systems.","Following the example of COLING-96 and ACL'97, the review process was blind. From the Programme Chairs' point of view, this innovation is questionable. First, it led to some of the problems mentioned above. Second, it seems often to miss the point, because authors don't succeed in hiding who they are: even people not knowledgeable in the field can almost always recognize the authors in a matter of seconds by looking at the reference list or scanning the paper for names of systems or formalisms. On the other hand, some papers for which authors were not evident got rejected or almost rejected (if the PC saved them) by reviewers who criticized the lack of reference to or comparison with previous work by the same authors!","In the future, it might prove interesting to abandon the idea of preparing a detailed partition into subcommittees a priori, and to use e-mall for building very quickly a series of subcommittees corresponding as tightly as possible to the submissions received. We also hope that the web will soon be available to all researchers in NLP in all countries, so that it can be used throughout the submission and reviewing process. Finally, we would like ICCL and ACL to study whether blind reviewing should be more strictly enforced, or dropped.","To conclude, we would like to say that this conference, with associated tutorials and workshops, promises to be at least as interesting as the previous ones, and to thank not only the members of the Programme Committee and all reviewers, but also all authors without whom the whole V"]},{"title":"exercise would have no point, and the Organizing Committee who helped the PC in many ways right from the start. Last but not least, to all participants: please don't forget that, although the written aspect of the conference is very important, direct communication and intense discussion are essential. New ideas often emerge only in such contexts. A third of the time allotted to each presentation should be used for discussions, and all the time between presentations, i.e. exactly 50% of our time in the University of Montreal! Christian Boitet and Pete Whitelock 19 June 1998 Programme Committee and Reviewers by Subject Area Morphology and phonology: Lauri Karttunen (chair), Evan Antworth, Susan Armstrong, Kenneth R. Beesley, Steven Bird, Igor Boguslavsky, Key-Sun Choi, Mark EUison, Dafydd Gibbon, Jan Haji~, Julia Hirschberg, Yang Huizhong, Arvi Hurskainen, George Kiraz, Kimmo Koskenniemi, Mark Liberman, Kazunori Muraki, Kemal Oflazer, Richard Sproat, Bruce Tesar, Dan Tufts. Syntax and parsing: Aravind Joshi (chair), Anne Abeill~, Steve Abney, Srinivas Bangalore, Tilman Becker, John Carroll, David Carter, Mike Collins, Christy Doran, Christophe Fouquer~, Karin Harbusch, Seth Kulick, Mark Liberman, Mark-Jan Nederhof, Steve Pulman, Owen Rainbow, Adwait Ratnaparkhi, Anoop Sarkar, Giorgio Satta, Mark Steedman, Yuka Tateisi, K. Vijayshanker, David Weir. Semantics, pragmatics, cognition: Eva Haji~ov~ (chair), Nicholas Asher, Peter Bosch, Robin Cooper, Robert Dale, Mary Dalrymple, Elisabet Engdahl, Walther von Hahn, Erhard Hinrichs, Wolfgang Hoeppner, Satoru Ikehara, Ferenc Kiefer, Sadao Kurohashi, Wolfgang Menzel, Elena Paducheva, Jarmila Panevov~, Ellen F. Prince, Donia Scott, Petr Sgall, Paul Smolensky, Bonnie Webber. Discourse and Dialogue: Yorick Wilks (chair), Jens Allwood, Douglas E. Appelt, Gene Ball, Afzal Ballim, Sandra Carberry, Giinther GSrz, Nancy Green, Susan Hailer, Koiti Hasida, Graeme Hirst, Eduard Hovy, Kristiina Jokinen, Ami Kronfeld, Mark T. Maybury, Kathy McCoy, Tony McEnery, Johanna D. Moore, Naoyuki Okada, Nicholas Ostler, C~cile Paris, Massimo Poesio, Stephen Pulman, Allan Ramsay, Ehud Reiter, David Sadek, Akira Shimazu, David R. Traum, Wolfgang Wahlster, Nigel Ward, Janyce Wiebe, Sandra Williams, Ingrid Zukerman. Corpus processing and empirical methods: Dekai Wu (chair), Susan Armstrong, Eric Brill, Claire Cardie, Eugene Charniak, Hsin-Hsi Chen, Key-Sun Choi, Ido Dagan, Pascale Fung, Kok-Wee Gan, Vasileios Hatzivassiloglou, Kim Teng Lua, Ray Mooney, Eric Ristad, Harold Somers, Ralph Weischedel, Paul Wu, David Yarowsky. Lexical resources and computational lexicography: Nicoletta Calzolari (chair), Amedeo Cappelli, John Carroll, Gregory Grefenstette, Eduard Hovy, Nancy Ide, Kimmo Koskenniemi, Bente Maegaard, Simonetta Montemagni, Antoine Ogonowski, Martha Palmer, Maria Teresa Pazienza, Vito Pirrelli, James Pustejovsky, Philip Resnik. Computational paradigms (symbolic, stochastic, neural, hybrid): Hozumi Tanaka (chair), John Carroll, Keh-Jiann Chen, Young S. Hail, Hideki Hirakawa, Hidoshi Iida, Asanee Kawtrakul, Surapant Meknavin, Masaaki Nagata, Akitoshi Okumura, Keh-Yih Su, Takenobu Tokunaga. Languages, tools and environments for lingware development: R~mi Zajac (chair), Jan Amtrup, Steve Beale, Hamish Cunningham, Alex Franz, Robert Gaizauskas, Udo Hahn, Doug Jones, Koiti Hasida, Hans-Ulrich Krieger, Yuji Matsumoto, Jun-Ichi Nakamura, Giinter Neumann, Kemal Oflazer, Hiroshi Sano, JSrg Schutze, Tomek Strzalkowski, Leo Wanner. vi Form checking (spelling, terminology, grammar, style): Steve Richardson (chair), Arendse Bernth, Lisa Braden-Harder, Jill Burstein, Simon Corston, Deborah Coughlin, William Dolan, George Heidorn, Karen Jensen, Michael Jones, Claudia Leacock, Michael C. McCord, Joseph Pentheroudakis, Yael Ravin, LeeAnn Schwartz, Frdddrique Segond, Lucy Vanderwende, Rick Wojcik. Summarization, abstraction, generation: Winf~ied Lenders (chair), Stephan Busemann, Tong Loong Cheong, Key-Sun Choi, Gnther Grz, Karin Harbusch, Roland Hausser, Eduard Hovy, Chu-Ren Huang, Tibor Kiss, Gerhard Knorz, Rainer Kuhlen, Inderjeet Mani, Dietmar RSsner, Karen Sparck-Jones, Manfred Stede, Harald Trost. Text and speech machine translation and translation aids: Jun-lchi Tsujii (chair), Sophia Ananiadou, Naoya Arakawa, Paul Bennett, Bill Black, Hans-Ulrich Block, Key-Sun Choi, Dominique Estival, Robert Frederking, Zhao-Ming Gao, Young S. Han, Chu-Ren Huang, Dosam Hwang, Hitoshi Iida, Hitoshi Isahara, Alon Lavie, Lori Levin, Jong-Hyeok Lee, Kim-Teng Lua, Yuji Matsumoto, Teruko Mitamura, Masaki Murata, Yoshiki Niwa, Eric Nyberg, Jaeduk Park, Hae-Chang Rim, Jungyun Seo, Harold Somers, Koichi Takeda, Hideki Tanaka, Kiyotaka Uchimoto, Takehito Utsuro, Eric M. Visser, Jin Yang, Akio Yokoo, Zaharin Yusoff, Min Zhang. Multimodal NLP (speech and dialogue processing, integration of speech, text, gestures): Alex Waibel (chair), Lars Ahrenberg, E. Andre, Veronique Auberge, Gerard Bailly, Meera Blattner, Elizabeth O. Bratt, Jean Caelen, NoeUe Carbonell, David N. Chin, Phil Cohen, John Dowding, Laurel Fais, Sakaoki Furui, Marsal Gavalda, Michael Johnston, Hasida Koiti, Akira Kurematsu, John Lafferty, Henry Lieberman, Jean-Francois Mari, Vibhu O. Mittal, Douglas B. Moran, Katashi Nagao, Sharon L. Oviatt, Thomas Polzin, Takenobu Takenaga, Ye-Yi Wang, Monika Woszczyna, Jie Yang. Text and speech information retrieval and categorization, electronic libraries: Sergei Nirenburg (chair), Jamie CaUan, Tomek Strzalkowski, Jim Cowie, Mark Davis, Susan Dumais, Ted Dunning, David Evans, Roger Evans, Fredric C. Gey, Gregory Grefenstette, Alexa McCray, Douglas W. Oard, Boyan Onyshkevych, Jan Pedersen, Ellen Riloff, Scott Waterman. Large R & D cooperative projects: Antonio Zampolli (chair), Antonietta Alonge, Sophia Ananiadou, Nuria Bel, Paul Buitelaar, Amedeo CappeUi, Maria Gavrilidou, Steven Kranwer, Simonetta Montemagni, Antoine Ogonowski, Fabio Pianesi, Patrick Saint-Dizier, Antonio Sanfilippo. Validation and testing programmes: Joseph Mariani (chair), Christophe d'Alessandro, Niels Ole Bernsen, Frederic Bimbot, Lou Boves, Jean Caelen, Nick Campbell, Jean-Pierre Chanod, Lin L. Chase, Khalid Choukri, Renato De Mori, Donna Harman, Lynette Hirschman, Christophe Jouis, Candace Kamm, Steven Krauwer, Lori Lamel, Philippe Langlais, Guy Lapalme, Bente Maegaard, Widad Elhad Mustafa, Klaus Netter, Patrick Paroubek, Louis C.W. Pols, Martin Rajman, Paul Sabatier, Laurent Schmitt, Jan P. H. van Santen, Jean Vdronis, Rdmi Zajac. Small Scale Innovative Research Projects: Helmut Schnelle (chair), Peter Bosch, Daniel Flickinger, Simon Garrod, Christopher Habel, Megumi Kameyama, Marc Moens, Manfred Pinkal, Ronan G. Reilly, Remko Scha, Petr Sgall. Others (contributions not falling in above categories): Eric Wehrli (chair), Marc Dymetman, Michael Hess, David Johnson, Andras Kornai, Paola Merlo, Jean-Yves Morin, Martin Rajman, Anne Reboul, Frdddrique Segond, Pierre Zweigenbaum. Additional reviewers: Kudo Ikuo, Alain Lecomte, Christian Rdtord, Noriyoshi Uratani. vii Preface: Student Session Co-Chairs","paragraphs":["The proceedings of COLING-ACL'98 wouldn't be complete without the extended abstracts of the students presenting their work in four special student sessions. Unlike the regular papers presented in the main session, students were encouraged to present work in progress that includes great ideas for future research.","We received 46 submissions from 12 countries. After thorough consideration, we accepted 12 of the submitted papers (or 26%). Each submission was reviewed by at least two student reviewers and two non-student reviewers.","We want to thank the 43 members of the program committee for being precise and fair in their assesments and for making our lives easier by returning all reviews on time.","The student members of the COLING-ACL 1998 Student Session Program Committee were Houssem Assadi,"]},{"title":"EDF-DER, _b~rance;","paragraphs":["Amit Bagga,"]},{"title":"Duke University, USA;","paragraphs":["Sarah Boyd,"]},{"title":"MRI, Macquarie University, Australia;","paragraphs":["Joyce Chai,"]},{"title":"Duke University, USA;","paragraphs":["Bart de Boer,"]},{"title":"Vrije Universiteit Brussel, Belgium;","paragraphs":["Christy Doran,"]},{"title":"University of Pennsylvania, USA;","paragraphs":["Mark Dras,"]},{"title":"MRI, Macquarie University, Australia;","paragraphs":["Philip Edmonds,"]},{"title":"University o] Toronto, Canada;","paragraphs":["Daqing He,"]},{"title":"University of Edinburgh, Scotland, UK;","paragraphs":["Pamela Jordan,"]},{"title":"University of Pittsburgh, USA;","paragraphs":["Esther Klabbers,"]},{"title":"Technical University Eindhoven, The Netherlands;","paragraphs":["Nobo Komagata,"]},{"title":"University of Pennsylvania, USA;","paragraphs":["Daniel Loehr,"]},{"title":"The MITRE Corporation, USA;","paragraphs":["Nuno Marques,"]},{"title":"Universidade Nova de Lisboa, Portugal;","paragraphs":["Maite Taboada,"]},{"title":"Universidad Complutense de Madrid, Spain;","paragraphs":["Mariet Theune,"]},{"title":"IPO, The Netherlands;","paragraphs":["Laura Tomokiyo,"]},{"title":"Carnegie Mellon University, USA;","paragraphs":["Meltem Turhan,"]},{"title":"Middle East Technical University, Turkey;","paragraphs":["Jakub Zavrel,"]},{"title":"Tilburg University, The Netherlands.","paragraphs":["The following were the non-student members of the committee: Ion Androutsopoulos,"]},{"title":"NCSR \"Demokritos\", Athens, Greece;","paragraphs":["Maria Aretoulaki,"]},{"title":"University of Erlangen, Germany;","paragraphs":["Kim Binsted,"]},{"title":"Sony, Japan;","paragraphs":["Ido Dagan,"]},{"title":"Bar-Nan University, Israel;","paragraphs":["Barbara Di Eugenio,"]},{"title":"University of Pittsburgh, USA;","paragraphs":["Mark Ellison,"]},{"title":"University of Edinburgh, Scotland;","paragraphs":["Dominique Estival,"]},{"title":"University of Melbourne, Australia;","paragraphs":["Eva Hajicova,"]},{"title":"Charles University, Czech Republic;","paragraphs":["Steve Green,"]},{"title":"MRI, Macquarie University, Australia;","paragraphs":["Dekang Lin,"]},{"title":"University of Manitoba, Canada;","paragraphs":["Karen Lochbaum,"]},{"title":"US WEST Advanced Technologies, USA;","paragraphs":["Mehryar Mohri,"]},{"title":"AT~T Labs - Research, USA;","paragraphs":["Cecile Paris,"]},{"title":"CSIRO, Australia;","paragraphs":["Scott Prevost,"]},{"title":"FX Palo Alto Laboratory, Inc, USA;","paragraphs":["Ehud Reiter,"]},{"title":"University of Aberdeen, Scotland;","paragraphs":["Ellen Riloff,"]},{"title":"University of Utah, USA;","paragraphs":["Eric Siegel,"]},{"title":"Columbia University, USA;","paragraphs":["Harold Somers,"]},{"title":"UMIST, Manchester, UK;","paragraphs":["Bangalore Srinivas,"]},{"title":"AT~T Labs - Research, USA;","paragraphs":["Evelyne Tzoukermann,"]},{"title":"Bell Labs, USA;","paragraphs":["Renata Vieira,"]},{"title":"University of Edinburgh, Scotland;","paragraphs":["Marilyn Walker,"]},{"title":"AT~T Labs - Research, USA;","paragraphs":["David Weir,"]},{"title":"University o/ Sussex, UK;","paragraphs":["Dekai Wu,"]},{"title":"Hong Kong University of Science and Technology, Hong Kong.","paragraphs":["We want to thank last year's organizers: Pamela Jordan,"]},{"title":"University of Pittsburgh, USA","paragraphs":["and Johan Bos,"]},{"title":"University o:f the Saarland","paragraphs":["for their help and for providing us with a large volume of supporting materials that made it possible to handle the organization of this year's Student Session. Finally, we want to thank the organizers of the main conference from ICCL and the ACL Executive Committee, more specifically Pierre Isabelle, Christian Boitet, Pete Whitelock, and Kathy McCoy. Student Session Co-Chairs: Maria Milosavljevic,"]},{"title":"CSIRO, Australia","paragraphs":["Dragomir R. Radev,"]},{"title":"Columbia University, USA VIII Table of Contents","paragraphs":["COLING-ACL'98 Sponsors .............................................. i Preface: President of the ICCL ........................................... ii Preface: President of the ACL ............................................ ii Preface: Chair of the Organizing Committee .................................. iii Preface: Programme Committee Co-Chairs ................................... iv Programme Committee and Reviewers by Subject Area .......................... vi Preface: Student Session Co-Chairs ........................................ viii Table of Contents ........................ ............................. ix Author Index ........................................................ xxi"]},{"title":"Invited Papers","paragraphs":["Zhao Jun and Huang Changning A Quasi-Dependency Model ]or the Structural Analysis of Chinese BaseNPs ......... 1 David Sankoff The Production of Code-Mixed Discourse .................................. 8 ~'"]},{"title":"Regular Papers and Project Notes","paragraphs":["Eneko Agirre, Koldo Gojenola, Kepa Sarasola and Afro Voutilainen Towards a Single Proposal in Spelling Correction ............................ 22 ,:: Lars Ahrenberg, Mikael Andersson and Magnus Merkel A Simple Hybrid Aligner for Generating Lexical Correspondences in Parallel Texts .... 29 Mohammad Akbar and Jean Caelen Parole et traduction automatique: le module de reconnaissance RAPHAEL .......... 36 ~: Hiyan Alshawi, Srinivas Bangalore and Shona Douglas Automatic Acquisition of Hierarchical Transduction Models for Machine Translation . . . 41 ';: Pascal Amsili and Corinne Rossari","Tense and Connective Constraints on the Expression o.f Causality ................ 48 ~\" Jan W. Amtrup and Volker Weber","Time Mapping with Hypergraphs ........................................ 55 Chinatsu Aone, Mary Ellen Okurowski and James Gorlinsky","Trainable, Scalable Summarization Using Robust NLP and Machine Learning ........ 62 Shlomo Argamon, Ido Dagan and Yuval Krymolowski 4(: A Memory-Based Approach to Learning Shallow Natural Language Patterns ......... 67 \" Saliha Azzam, Kevin Humphreys and Robert Gaizauskas Evaluating a Focus-Based Approach to Anaphora Resolution .................... 74 - Amit Bagga and Breck Baldwin Entity-Based Cross-Document Coreferencing Using the Vector Space Model .......... 79 5 i: Collin F. Baker, Charles J. Fillmore and John B. Lowe","The Berkeley l~rameNet Project ......................................... 86 ~ Petra Barg and Markus Walther Processing Unknown Words in HPSG .................................... 91 \" Ken Barker and Stan Szpakowicz Semi-Automatic Recognition of Noun Modifier Relationships .................... 96 ~ : Caroline Barri~re Redundancy: Helping Semantic Disambiguation ............................. 103 ??: ix","Tilman Becker, Wolfgang Finkler, Anne Kilger and Peter Poller An E~cient Kernel for Multilingual Generation in Speech-to-Speech Dialogue Translation 110","Kenneth R. Beesley Consonant Spreading in Arabic Stems .................................... 117 :","Philippe Blache Parsing Ambiguous Structures using Controlled Disjunctions and Unary Quasi-Trees... 124","Ezra Black, Andrew Finch and Hideki Kashioka Trigger-Pair Predictors in Parsing and Tagging ............................. 131","Rens Bod Spoken Dialogue Interpretation with the DOP Model .......................... 138 ,","Rens Bod and Ronald Kaplan A Probabilistic Corpus-Driven Model for Lexical-Functional Analysis .............. 145 ;'","Francis Bond, Daniela Kurz and Satoshi Shirai Anchoring Floating Quantifiers in Japanese-to-English Machine Translation ......... 152","Johan Bos, C.J. Rupp, Bianka Buschbeck-Wolf and Michael Dorna Managing Information at Linguistic Interfaces .............................. 160 r","Cem Bozsahin Deriving the Predicate-Argument Structure for a Free Word Order Language ......... 167","Norbert BrSker Separating Surface Order and Syntactic Relations in a Dependency Grammar ........ 174","Ant6nio Branco The Logical Structure of Binding ........................................ 181/:~","Eric Brill, Radu Florian, John C. Henderson and Lidia Mangu Beyond N-Grams: Can Linguistic Sophistication Improve Language Modeling ~. ....... 186","Eric Brill and Jun Wu Classifier Combination for Improved Lexical Disambiguation .................... 191","Caroline Brun Terminology Finite-state Preprocessing for Computational LFG .................. 196","John D. Burger, David Palmer and Lynette Hirschman Named Entity Scoring for Speech Input ................................... 201","Jill Burstein, Karen Kukich, Susanne Wolff, Chi Lu, Martin Chodorow, Lisa Braden-Harder and Mary Dee Harris Automated Scoring Using A Hybrid Feature Identification Technique .............. 206 '/","Marie-H~l~ne Candito Building Parallel LTAG for lmrench and Italian .............................. 211 :\"","Claire Cardie and David Pierce Error-Driven Pruning of Treebank Grammars for Base Noun Phrase Identification .... 218","Ciprian Chelba and Frederick Jelinek Exploiting Syntactic Structure for Language Modeling ......................... 225 /':","Hsin-Hsi Chen, Sheng-Jie Huang, Yung-Wei Ding and Shih-Chung Tsai Proper Name Translation in Cross-Language Information Retrieval ............... 232","Jen Nan Chen and Jason S. Chang A Concept-based Adaptive Approach to Word Sense Disambiguation ............... 237","Keh-Jiann Chen, Wen Tsuei and Lee-Feng Chien PAT-Trees with the Deletion Function as the Learning Device for Linguistic Patterns . . 244","Roger Evans and David Weir A Structure-sharing Parser for Lexicalized Grammars ......................... 372","N. Ezeiza, I. Alegria, J.M. Arriola, R. Urizar and I. Aduriz Combining Stochastic and Rule-Based Methods for Disambiguation in Agglutinative Languages ........................................................... 379","Antonio Ferrgmdez, Manuel Palomar and Lidia Moreno Anaphor Resolution In Unrestricted Texts With Partial Parsing .................. 385","Olivier Ferret, Brigitte Grau and Nicolas Masson Thematic Segmentation of Texts: Two Methods for Two Kind of Texts ............. 392","Sharon Flank A Layered Approach to NLP-Based Information Retrieval ...................... 397","Dayne Freitag Toward General-Purpose Learning for Information Extraction ................... 404","Takeshi Fuchi and Shinichiro Takagi Japanese Morphological Analyzer using Word Co-occurrence--JTAG .............. 409","Pascale Fung and Lo Yuen Yee An Ill Approach for Translating New Words from Nonparallel, Comparable Texts ..... 414","Osamu Furuse, Setsuo Yamada and Kazuhide Yamamoto Splitting Long or Ill-formed Input for Robust Spoken-language Translation .......... 421","Susanne Gahl Automatic Extraction of Subcorpora based on Subcategorization Frames from a Part-of-Speech Tagged Corpus ................................................ 428","BjSrn Gamb~ck and Johan Bos Semantic-Head Based Resolution of Scopal Ambiguities ........................ 433","Bilel Gargouri, Abdelmajid Ben Hamadou and Mohamed Jmaiel Vers l'utilisation des m4thodes formelles pour le d4veloppement de linguiciels ........ 438","l~ric Gaussier Flow Network Models for Word Alignment and Terminology Extraction from Bilingual Corpora .......................................................... 444","Marsal Gavaldh and Alex Waibel Growing Semantic Grammars .......................................... 451","Jin Guo One Tokenization per Source ........................................... 457","Vineet Gupta and John Lamping Efficient Linear Logic Meaning Assembly .................................. 464","Pius ten Hacken and Stephan Bopp Separable Verbs in a Reusable Morphological Dictionary for German .............. 471","Udo Hahn and Klemens Schnattinger A Text Understander that Learns ........................................ 476","Jan Haji~ and Barbora Hladk~ Tagging Inflective Languages: Prediction of Morphological Categories for a Rich Structured Tagset ........................................................... 483","Hans van Halteren, Jakub Zavrel and Walter Daelemans Improving Data Driven Wordclass Tagging by System Combination ............... 491","Thierry Hamon, Adeline Nazarenko and C4cile Gros A Step towards the Detection of Semantic Variants of Terms in Technical Documents . . 498","Masahiko Haruno, Satoshi Shirai and Yoshifumi Ooyama Using Decision Trees to Construct a Practical Parser ......................... 505 xii","Sung-Kwon Choi, Han-Min Jung, Chul-Min Sire, Taewan Kim, Dong-In Park, Jun-Sik Park and Key-Sun Choi Hybrid Approaches to Improvement of Translation Quality in Web-based English-Korean Machine Translation ................................................. 251 ~;J","Jennifer Chu-Carroll and Bob Carpenter Dialogue Management in Vector-Based Call Routing .......................... 256 -~-J","Nigel Collier, Hideki Hirakawa and Akira Kumano Machine Translation vs. Dictionary Term Translation --a Comparison for English-Japanese News Article Alignment .............................................. 263 \",","Nigel Collier, Kenji Ono and Hideki Hirakawa An Experiment in Hybrid Dictionary and Statistical Sentence Alignment ........... 268/","Michael A. Covington Alignment of Multiple Languages for Historical Comparison ..................... 275 ' ~","Dan Cristea, Nancy Ide and Laurent P~omary Veins Theory: A Model of Global Discourse Cohesion and Coherence .............. 281 ~ ,~","Alessandro Cucchiarelli, Danilo Luzi and Paola Velardi Automatic Semantic Tagging of Unknown Proper Names ....................... 286 •","Hoa Trang Dang, Karin Kipper, Martha Palmer and Joseph Rosenzweig Investigating Regular Sense Extensions based on Intersective Levin Classes .......... 293 .","Sabine Deligne and Yoshinori Sagisaka Learning a Syntagmatic and Paradigmatic Structure from Language Data with a Bi-Multigram Model ........................................................... 300., •","Sylvain Delisle, Sylvaln L~tourneau and Stan Matwin Experiments with Learning Parsing Heuristics .............................. 307 .'","Ludmila Dimitrova, Tomaz Erjavec, Nancy Ide, Heiki Jaan Kaalep, Vladimir Petkevic and Dan Tufts Multext-East: Parallel and Comparable Corpora and Lexicons for Six Central and Eastern European Languages ................................................. 315","Luca Dini, Vittorio Di Tomaso and Fr~d~rique Segond Error Driven Word Sense Disambiguation ................................. 320","Barbara Di Eugenio, Pamela W. Jordan, Johanna D. Moore and Richmond H. Thomason An Empirical Investigation of Proposals in Collaborative Dialogues ................ 325","Hai Doan-Nguyen Accumulation of Lezical Sets: Acquisition of Dictionary Resources and Production of New Lexical Sets ....................................................... 330","Shinichi Doi, Shin-ichiro Kamei and Kiyoshi Yamabana A Text Input Front-end Processor as an Information Access Platform .............. 336 ~","Michael Dorna, Anette Frank, Josef van Genabith and Martin C. Emele Syntactic and Semantic Transfer with F-Structures ........................... 341","Marc Dymetman Group Theory and Linguistic Processing ................................... 348","Markus Egg, Joachim Niehren, Peter Ruhrberg and Feiyu Xu Constraints over Lambda-Structures in Semantic Underspecification ............... 353 /","Mohammad Ali Elmi and Martha Evens Spelling Correction using Context ....................................... 360","Martin C. Emele and Michael Dorna Ambiguity Preserving Machine Translation using Packed Representations ........... 365 xi","Satoshi Kaki, Eiichiro Sumita and Hitoshi Iida A Method for Correcting Errors in Speech Recognition using the Statistical Features of Character Co-occurrence .............................................. 653","Hideki Kashioka, Yasuhiro Kawata, Yumiko Kinjo, Andrew Finch and Ezra W. Black Use of Mutual Information Based Character Clusters in Dictionary-less Morphological Analysis of Japanese ................................................ 658","Robert T. Kasper, Mike Calcagno and Paul C. Davis Know When to Hold 'Era: Shu.O~ing Deterministically in a Parser for Nonconcatenative Grammars ........................................................ 663","Genichiro Kikui Term-list Translation using Mono-lingual Word Co-occurrence Vectors ............. 670","Byeongchang Kim, WonI1 Lee, Geunbae Lee and Jong-Hyeok Lee Unlimited Vocabulary Grapheme to Phoneme Conversion for Korean TTS .......... 675","Judith L. Klavans and Min-Yen Kan The Role of Verbs in Document Analysis .................................. 680","Tang Enya Kong and Mosleh Hmoud A1-Adhaileh A Flexible Example-Based Parser Based on the SSTC ......................... 687","Yasuo Koyama, Masako Yasutake, Kenji Yoshimura and Kosho Shudo Large Scale Collocation Data and Their Application to Japanese Word Processor Technology ............................................................. 694","Alexander Krotov, Mark Hepple, Robert Gaizauskas and Yorick Wilks Compacting the Penn Treebank Grammar .................................. 699","Irene Langkilde and Kevin Knight Generation that Exploits Corpus-Based Statistical Knowledge .................... 704","Philippe Langlais, Michel Simard and Jean V@ronis Methods and Practical Issues in Evaluating Alignment Techniques ................ 711","Benoit Lavoie and Owen Rambow A Framework for Customizable Generation of Hypertext Presentations ............. 718","Seungmi Lee and Key-Sun Choi Automatic Acquisition of Language Model based on Head-Dependent Relation between Words 723","Yves Lepage Solving analogies on words: an algorithm .................................. 728","Gina-Anne Levow Characterizing and Recognizing Spoken Corrections in Human-Computer Dialogue ..... 736","Wolfgang Lezius, Reinhard Rapp and Manfred Wettler A b3ceely Available Morphological Analyzer, Disambiguator and Context Sensitive Lemmatizer for German ................................................... 743","Hang Li and Naoki Abe Word Clustering and Disambiguation Based on Co-occurrence Data ............... 749","Hui-Feng Li, Jong-Hyeok Lee and Geunbae Lee Identifying Syntactic Role of Antecedent in Korean Relative Clause using Corpus and Thesaurus Information .................................................. 756","Li Li, Deborah A. Dahl, Lewis M. Norton, Marcia C. Linebarger and Dongdong Chen A Test Environment for Natural Language Understanding Systems ................ 763","Dekang Lin Automatic Retrieval and Clustering of Similar Words ......................... 768 xiv","Terrence Harvey and Sandra Carberry Integrating Text Plans for Conciseness and Coherence ......................... 512","Julia E. Heine Definiteness Predictions for Japanese Noun Phrases .......................... 519","Johannes Heinecke, Jiirgen Kunze, Wolfgang Menzel and Ingo SchrSder Eliminative Parsing with Graded Constraints ............................... 526","James Henderson and Peter Lane A Connectionist Architecture for Learning to Parse .......................... 531","Mark Hepple Memoisation for Glue Language Deduction and Categorial Parsing ............... 538","Derrick Higgins Parsing Parallel Grammatical Representations .............................. 545","Janet Hitzeman and Massimo Poesio Long Distance Pronominalisation and Global Focus ........................... 550","Rebecca Hwa An Empirical Evaluation of Probabilistic Lexicalized Tree Insertion Grammars ....... 557","Fidelia Ibekwe-SanJuan Terminological Variation, a Means of Identifying Research Topics from Texts ........ 564","Takahiro Ikeda, Akitoshi Okumura and Kazunori Muraki Information Classification and Navigation based on 5WIH of the Target Information... 571","Michael Ingleby and Wiebke Brockhaus A Concurrent Approach to the Automatic Extraction of Subsegmental Primes and Phonological Constituents from Speech ........................................ 578","Masato Ishizaki and Tsuneaki Kato Exploring the Characteristics of Multi-party Dialogues ......................... 583","Arne JSnsson and Lena StrSmb~ck Robust Interaction through Partial Interpretation and Dialogue Management ......... 590","Christian Jacquemin Improving Automatic Indexing through Concept Combination and Term Enrichment . . . 595","Donghong Ji, Junping Gong and Changning Huang Combining a Chinese Thesaurus with a Chinese Dictionary ..................... 600","Hongyan Jing and Kathleen McKeown Combining Multiple, Large-Scale Resources in a Reusable Lexicon for Natural Language Generation ....................................................... 607","Amanda C. Jobbins and Lindsay J. Evett Text Segmentation Using Reiteration and Collocation ......................... 614","Mark Johnson Finite-state Approximation of Constraint-based Grammars using Left-corner Grammar T~'ansforms ....................................................... 619","Michael Johnston Unification-based Multimodal Parsing ..................................... 624","Kristiina Jokinen, Hideki Tanaka and Akio Yokoo Context Management with Topics for Spoken Dialogue Systems .................. 631","Kyo Kageura A Statistical Analysis of Morphemes in Japanese Terminology ................... 638","Sylvain Kahane, Alexis Nasr and Owen Rambow Pseudo-Projectivity: A Polynomially Parsable Non-Projective Dependency Grammar . . . 646 °o° XIU","Nikolaj Lindberg and Martin Eineborg Learning Constraint Grammar-style Disambiguation Rules using Inductive Logic Programming ............................................................ 775","Diane J. Litman, Shimei Pan and Marilyn A. Walker Evaluating Response Strategies in a Web-Based Spoken Dialogue Agent ............ 780","Vincenzo Lombardo and Leonardo Lesmo Formal Aspects and Parsing Issues of Dependency Theory ...................... 787","Susann LuperFoy, Dan Loehr, David Duff, Keith Miller, Florence Reeder and Lisa Harper An Architecture for Dialogue Management, Context Tracking, and Pragmatic Adaptation in Spoken Dialogue Systems ........................................... 794","Qing Ma and Hitoshi Isahara A Multi-Neuro Tagger Using Variable Lengths of Contezts ...................... 802","Takaki Makino, Minoru Yoshida, Kentaro Torisawa and Jun'ichi Tsujii LiLFeS ~ Towards a Practical HPSG Parser ............................... 807","Raquel Martinez, Joseba Abaitua and Arantza Casillas Bitext Correspondences through Rich Mark-up .............................. 812","Mark T. Maybury Discourse Cues for Broadcast News Segmentation ............................ 819","David R. McGee, Phil R. Cohen and Sharon Oviatt Confirmation in Multimodal Systems ..................................... 823","Angus McIntyre Babel: A Testbed for Research in Origins of Language ......................... 830","Surapant Meknavin, Boonserm Kijsirikul, Ananlada Chotimongkol and Cholwich Nuttee Combining 23~igram and Winnow in Thai OCR Error Correction ................. 836","Adam Meyers, Roman Yangarber, Ralph Grishman, Catherine Macleod and Antonio Moreno-Sandoval Deriving Transfer Rules from Dominance-Preserving Alignments ................. 843","Andrei Mikheev Feature Lattices for Maximum Entropy Modelling ............................ 848","Hideki Mima, Hitoshi Iida and Osamu Furuse Simultaneous Interpretation Utilizing Ezample-based Incremental Transfer .......... 855","Kyongho Min and William H. Wilson Integrated Control of Chart Items for Error Repair ........................... 862","Ruslan Mitkov Robust Pronoun Resolution with Limited Knowledge .......................... 869","Yutaka Mitsuishi, Kentaro Torisawa and Jun'ichi Tsujii HPSG-Style Underspecified Japanese Grammar with Wide Coverage ............... 876","Hajime Mochizuki, Takeo Honda and Manabu Okumura Tezt Segmentation with Multiple Surface Linguistic Cues ....................... 881","Chadia Moghrabi Using Language Resources in an Intelligent Tutoring System for b'~ench ............ 886","Mehryar Mohri and Fernando C.N. Pereira Dynamic Compilation of Weighted Contezt-b'~ee Grammars ..................... 891","Shinsuke Mori and Makoto Nagao A Stochastic Language Model using Dependency and its Improvement by Word Clustering 898","Pascal Mouret and Monique Rolbert Dealing with Distinguishing Descriptions in a Guided Composition System .......... 905 XV","Masaki Murata and Makoto Nagao An Estimate of Referent of Noun Phrases in Japanese Sentences ................. 912","Katashi Nagao and K6iti Hasida Automatic Text Summarization Based on the Global Document Annotation .......... 917","Masaaki Nagata Japanese OCR Error Correction using Character Shape Similarity and Statistical Language Model ........................................................... 922","Hiroshi Nakagawa, Tatsunori Mori, Nobuyuki Omori and fun Okamura Hypertext Authoring for Linking Relevant Segments of Related Instruction Manuals .... 929","Mikio Nakano and Akira Shimazu Translating a Unification Grammar with Disjunctions into Logical Constraints ....... 934","Christine H. Nakatani Constituent-based Accent Prediction ...................................... 939","Mark-Jan Nederhof An Alternative LR Algorithm for TAGs ................................... 946","Mark-Jan Nederhof, Anoop Sarkar and Giorgio Satta Prefix Probabilities from Stochastic Tree Adjoining Grammars ................... 953","S. Niet~en, S. Vogel, H. Ney and C. Tillmann A DP based Search Algorithm for Statistical Machine Translation ................ 960","Takashi Ninomiya, Kentaro Torisawa and Jun'ichi Tsujii An Efficient Parallel Substrate for Typed Feature Structures on Shared Memory Parallel Machines ......................................................... 968","Sergei Nirenburg and Victor Raskin Universal Grammar and Lexis for Quick Ramp-Up of MT Systems ................ 975","Lewis M. Norton, Deborah A. Dahl, Li Li and Katherine P. Beals Integration of Large-Scale Linguistic Resources in a Natural Language Understanding System ............................................................. 980","Franz Josef Och and Hans Weber Improving Statistical Natural Language Translation with Categories and Rules ....... 985","Akira Oishi and Yuji Matsumoto Recognition of the Coherence Relation between Te-linked Clauses ................. 990","Lluis Padr6 and Lluis Marquez On the Evaluation and Comparison of Taggers: the Effect of Noise in Testing Corpora . 997","Shimei Pan and Kathleen McKeown Learning Intonation Rules for Concept to Speech Generation .................... 1003","Ivandr6 Paraboni and Vera Lficia Strube de Lima Possessive Pronominal Anaphor Resolution in Portuguese Written Texts . . ......... 1010","Junsik Park, Jung-Goo Kang, Wook Hur and Key-Sun Choi Machine Aided Error-Correction Environment for Korean Morphological Analysis and Part-of-Speech Tagging ................................................... 1015","David Pautler and Alex Quilici A Computational Model of Social Perlocutions .............................. 1020","Gerald Penn Parametric Types for Typed Attribute-Value Logic ............................ 1027","Vladimir Pericliev and Radl E. Vald6s-Pfrez A Procedure for Multi-Class Discrimination and some Linguistic Applications ........ 1034","Hannes Pirker, Georg Niklfeld, Johannes Matiasek and Harald Trost Prom Information Structure to Intonation: A Phonological Interface for Concept-to-Speech 1041 : xvi","Andrei Popescu-Belis, Isabelle Robba and G6rard Sabah Reference Resolution beyond Coreference: a Conceptual -bnrame and its Application .... 1046","Richard Power and Donia Scott Multilingual Authoring using Feedback Texts ................................ 1053","Victor Poznanski, Pete Whitelock, Jan IJdens and Steffan Corley Practical Glossing by Prioritised Tiling ................................... 1060","G~bor PrSsz6ky An Intelligent Multi-Dictionary Environment ............................... 1067","Dragomir R. Radev Learning Correlations between Linguistic Indicators and Semantic Constraints: Reuse of Context-Dependent Descriptions of Entities ................................ 1072","Adwait Ratnaparkhi Statistical Models for Unsupervised Prepositional Phrase Attachment .............. 1079","Tim Read and Elena Barcena JaBot: A Multilingual Java-Based Intelligent Agent for Web Sites . . . ............. 1086","Chris Reed and Derek Long Generating the Structure of Argument .................................... 1091","Stephen D. Richardson, William B. Dolan and Lucy Vanderwende MindNet: Acquiring and Structuring Semantic Information from Text ............. 1098","German Rigau, Horacio Rodrlguez and Eneko Agirre Building Accurate Semantic Taxonomies from Monolingual MRDs ................ 1103","Brian Roark and Eugene Charniak Noun-Phrase Co-occurrence Statistics for Semi-Automatic Semantic Lexicon Construction 1110","James Rogers A Descriptive Characterization of Tree-Adjoining Languages .................... 1117","Douglas Roland and Daniel Jurafsky How Verb Subcategorization b'kequencies are Affected by Corpus Choice ............ 1122","Carolyn Penstein Ros6 and Lori S. Levin An Interactive Domain Independent Approach to Robust Dialogue Interpretation ...... 1129","Dan Roth and Dmitry Zelenko Part of Speech Tagging Using a Network of Linear Separators ................... 1136","Patrick Saint-Dizier A Generative Lexicon Perspective for Adjectival Modification .................... 1143","Ken Samuel, Sandra Carberry and K. Vijay-Shanker Dialogue Act Tagging with Transformation-Based Learning ..................... 1150","Antonio Sanfilippo Ranking Text Units According to Textual Saliency, Connectivity and Topic Aptness .... 1157","Anoop Sarkar Conditions on Consistency of Probabilistic Tree Adjoining Grammars .............. 1164","Kengo Sato and Masakazu Nakanishi Maximum Entropy Model Learning of the Translation Rules ..................... 1171","Giorgio Satta and William Schuler Restrictions on Tree Adjoining Languages ................................. 1176","Michael Schiehlen Learning Tense Translation from Bilingual Corpora ........................... 1183","Frank Schilder An Underspecified Segmented Discourse Representation Theory (USDRT) ........... 1188 xvii","Paul Schmid, Marius Groenendijk, Peter Phelan, Henrik Schulz, Sibylle Rieder, Axel Theofilidis, Thierry Declerck and Andrew Bredenkamp Natural Language Access to Software Applications ............................ 1193","David Schneider and Kathleen F. McCoy Recognizing Syntactic Errors in the Writing of Second Language Learners ........... 1198","Mark Seligman, Christian Boitet and Boubaker Meddeb-Hamrouni Transforming Lattices into Non-deterministic Automata with Optional Null Arcs ...... 1205","Jean Senellart Locating Noun Phrases with Finite State Transducers ......................... 1212","James Shaw Segregatory Coordination and Ellipsis in Text Generation ...................... 1220","Harold L. Somers Similarity Metrics for Aligning Children's Articulation Data .................... 1227","Josep M. Sopena, Agusti LLoberas and Joan L. Moliner A Connectionist Approach to Prepositional Phrase Attachment .for Real World Texts . . . 1233","Manfred Stede and Carla Umbach DiMLex: A Lexicon of Discourse Markers .for Text Generation and Understanding .... 1238","Luc Steels and Fr@d@ric Kaplan Spontaneous Lexicon Change ........................................... 1243","Michael Strube Never Look Back: An Alternative to Centering .............................. 1251","Tomek Strzalkowski, Jin Wang and Bowden Wise Summarization-based Query Expansion in Information Retrieval ................. 1258","Maosong Sun, Dayang Shen and Benjamin K. Tsou Chinese Word Segmentation without Using Lexicon and Hand-crafted Training Data . . . 1265","Yoshimi Suzuki, Fumiyo Fukumoto and Yoshihiro Sekiguchi Keyword Extraction using Term-Domain Interdependence .for Dictation of Radio News 1272","GSkhan Tiir and Kemal Oflazer Tagging English by Path Voting Constraints ................................ 1277","Kumiko Tanaka-Ishii, KSiti Hasida and Itsuki Noda Reactive Content Selection in the Generation of Real-time Soccer Commentary ....... 1282","Pasi Tapanainen, Jussi Piitulainen and Timo J~rvinen Idiomatic Object Usage and Support Verbs ................................. 1289","Heike Tappe and Frank Schilder Coherence in Spoken Discourse ......................................... 1294","Davide Turcato Automatically Creating Bilingual Lexicons .for Machine Translation from Bilingual Text . 1299","Naohiko Uramoto and Koichi Takeda A Method for Relating Multiple Newspaper Articles by Using Graphs, and Its Application to Webcasting ..................................................... 1307","Takehito Utsuro, Takashi Miyata and Yuji Matsumoto General-to-Specific Model Selection .for Subcategorization Preference ............... 1314","Evelyne Viegas Multilingual Computational Semantic Lexicons in Action: The WYSINNWYG Approach to NLP .......................................................... 1321 •","Evelyne Viegas, Stephen Beale and Sergei Nirenburg The Computational Lexical Semantics of Syntagmatic Expressions ................ 1328","°°° XVlll","GuoDong Zhou and KimTeng Lua Word Association and MI-Trigger-based Language Modeling .................... 1465 Student Papers Anja Belz Discovering Phonotactic Finite-State Automata by Genetic Search ................ 1472 Donna Byron and Amanda Stent A Preliminary Model of Centering in Dialog ................................ 1475 Hua Cheng Embedding New Information into Referring Expressions ....................... 1478 Olivier Ferret How to Thematically Segment Texts by using Lexical Cohesion? .................. 1481 Oskari Heinonen Optimal Multi-Paragraph Text Segmentation by Dynamic Programming ............ 1484 Oi Yee Kwong Bridging the Gap between Dictionary and Thesaurus .......................... 1487 Mark Lewellen Neural Network Recognition of Spelling Errors .............................. 1490 Diana McCarthy and Anna Korhonen Detecting Verbal Participation in Diathesis Alternations ....................... 1493 Scott McDonald Target Word Selection as Proximity in Semantic Space ........................ 1496 Elliot Smith A Cognitive Model of Coherence-Driven Story Comprehension ................... 1499 Ivelin Stoianov","Tree-based Analysis of Simple Recurrent Network Learning ..................... 1502 Scott M. Thede Predicting Part-of-Speech Information about Unknown Words using Statistical Methods . 1505 XX","Eric Villemonte de la Clergerie and Miguel Alonso Pardo A Tabular Interpretation o-f a Class of 2-Stack Automata ....................... 1333","Takahiro Wakao, Terumasa Ehara, Eiji Sawamura, Ichiro Maruyama and Katsuhiko Shirai Project for Production of Closed-Caption TV Programs -for the Hearing Impaired ..... 1340","Marilyn A. Walker, Jeanne C. Fromer and Shrikanth Narayanan Learning Optimal Dialogue Strategies: A Case Study of a Spoken Dialogue Agent-for Email 1345","Stephen Wan and Cornelia Maria Verspoor Automatic English-Chinese Name Transliteration -for Development of Multilingual Lexical Resources ........................................................ 1352","Ye-Yi Wang and Alex Walbel Modeling with Structures in Statistical Machine Translation ..................... 1357","Mark Wasson Using Leading Text -for News Summaries: Evaluation Results and Implications -for Commercial Summarization Applications ..................................... 1364","Hideo Watanabe and Koichi Takeda A Pattern-based Machine Translation System Extended by Example-based Processing . . . 1369","Yasuhiko Watanabe and Makoto Nagao Diagram Understanding Using Integration o-f Layout Information and Textual Information 1374","Yasuhiko Watanabe, Yoshihiro Okada, Kengo Kaneji and Makoto Nagao Aligning Articles in TV Newscasts and Newspapers ........................... 1381","Eric Wehrli Translating Idioms .................................................. 1388","Graham Wilcock and Yuji Matsumoto Head-Driven Generation with HPSG ..................................... 1393","Yorick Wilks and Mark Stevenson Word Sense Disambiguation using Optimised Combinations of Knowledge Sources ..... 1398","Karsten L. Worm A Model -for Robust Processing of Spontaneous Speech by Integrating Viable Fragments 1403","Dekai Wu and Hongsing Wong Machine Translation with a Stochastic Grammatical Channel .................... 1408","Haodong Wu, Eduardo de Paiva Alves and Teiji Furugori Structural Disambiguation Based on Reliable Estimation of Strength of Association .... 1416","Masaya Yamaguchi, Takeyuki Kojima, Nobuo Inui, Yoshiyuki Kotani and Hirohiko Nisimura Combination of an Automatic and an Interactive Disambiguation Method ........... 1423","Kazuhide Yamamoto and Eiichiro Sumita Feasibility Study -for Ellipsis Resolution in Dialogues by Machine-Learning Technique . . 1428","Alexander S. Yeh and Marc B. Vilain Some Properties of Preposition and Subordinate Conjunction Attachments .......... 1436","Takehiko Yoshimi, Toshiyuki Okunishi, Takahiro Yamaji and Yoji Fukumochi Evaluation o-f Importance of Sentences based on Connectivity to Title .............. 1443","Klaus Zechner Automatic Construction of Frame Representations -for Spontaneous Speech in Unrestricted Domains ......................................................... 1448","Klans Zechner and Alex Waibel Using Chunk Based Partial Parsing of Spontaneous Speech in Unrestricted Domains -for Reducing Word Error Rate in Speech Recognition ............................ 1453","Xiaoheng Zhang Dialect MT: A Case Study between Cantonese and Mandarin .................... 1460 xix"]},{"title":"Author Index","paragraphs":["Abaitua, J ............... 812 Abe, N .................. 749 Aduriz, I ................ 379 Agirre, E ............ 22, 1103 Ahrenberg, L ............. 29 Akbar, M ................. 36 A1-Adhaileh, M.H ....... 687 Alegria, I ................ 379 Alshawi, H ............... 41 Amsili, P ................. 48 Amtrup, J.W ............. 55 Andersson, M ............. 29 Aone, C .................. 62 Argamon, S ............... 67 Arriola, J.M ............. 379 Azzam, S ................. 74 Bagga, A ................. 79 Baker, C.F ............... 86 Baldwin, B ............... 79 Bangalore, S .............. 41 Barcena, E ............. 1086 Barg, P ................... 91 Barker, K ................. 96 Barri~re, C .............. 103 Beale, S ................ 1328 Beals, K.P ............... 980 Becker, T ................ 110 Beesley, K.R ............. 117 Belz, A ................. 1472 Ben Hamadou, A ........ 438 Blache, P ................ 124 Black, E ................. 131 Black, E.W .............. 658 Bod, R .............. 138,145 Boitet, C ............... 1205 Bond, F ................. 152 Bopp, S ................. 471 Bos, J ............... 160, 433 Bozsahin,: C ............. 167 Braden-Harder, L ........ 206 Branco, A ............... 181 Bredenkamp, A ......... 1193 Brill, E .............. 186, 191 Brockhaus, W ........... 578 Brun, C ................. 196 BrSker, N ............... 174 Burger, J.D .............. 201 Burstein, J .............. 206 Buschbeck-Wolf, B ...... 160 Byron, D ............... 1475 Caelen, J ................. 36 Calcagno, M ............. 663 Candito, M.-H ........... 211 Carberry, S ........ 512, 1150 Cardie, C ................ 218 Carpenter, B ............ 256 Casillas, A ............... 812 Chang, J.S .............. 237 Changning, H .............. 1 Charniak, E ............ 1110 Chelba, C ............... 225 Chen, D ................. 763 Chen, H.-H .............. 232 Chen, J.N ............... 237 Chen, K.-J .............. 244 Cheng, H ............... 1478 Chien, L.-F .............. 244 Chodorow, M ............ 206 Choi, K.-S ..... 251,723, 1015 Choi, S.-K ............... 251 Chotimongkol, A ........ 836 Chu-Carroll, J ........... 256 Cohen, P.R .............. 823 Collier, N ........... 263,268 Corley, S ............... 1060 Covington, M.A ......... 275 Cristea, D ............... 281 Cucchiarelli, A .......... 286 Daelemans, W ........... 491 Dagan, I .................. 67 Dahl, D.A ........... 763,980 Dang, H.T ............... 293 Davis, P.C ............... 663 Declerck, T ............. 1193 Deligne, S ............... 300 Delisle, S ................ 307 Dimitrova, L ............. 315 Ding, Y.-W .............. 232 Dini, L .................. 320 Di Eugenio, B ........... 325 Di Tomaso, V ........... 320 Doan-Nguyen, H ......... 330 Doi, S ................... 336 Dolan, W.B ............ 1098 Dorna, M ....... 160,341,365 Douglas, S ................ 41 Duff, D .................. 794 Dymetman, M ........... 348 Egg, M .................. 353 Ehara, T ............... 1340 Eineborg, M ............. 775 Elmi, M.A ............... 360 Emele, M.C ......... 341,365 Erjavec, T ............... 315 Evans, R ................ 372 Evens, M ................ 360 Evett, L.J ............... 614 Ezeiza, N ................ 379 Ferret, O ........... 392, 1481 Ferrg~ndez, A ............ 385 Fillmore, C.J ............. 86 Finch, A ............ 131,658 Finkler, W .............. 110 Flank, S ................. 397 Florian, R ............... 186 Frank, A ................ 341 Freitag, D ............... 404 Fromer, J.C ............ 1345 Fuchi, T ................. 409 Fukumochi, Y .......... 1443 Fukumoto, F ........... 1272 Fung, P .................. 414 Furugori, T ............. 1416 Furuse, O ........... 421,855 Gahl, S .................. 428 Gaizauskas, R ........ 74,699 Gamb~ck, B ............. 433 Gargouri, B ............. 438 Gaussier, ]~ .............. 444 Gavald~, M .............. 451 van Genabith, J ......... 341 Gojenola, K .............. 22 Gong, J ................. 600 Gorlinsky, J .............. 62 Grau, B ................. 392 xxi Grishman, R ............ 843 Groenendijk, M ........ 1193 Gros, C .................. 498 Guo, J ................... 457 Gupta, V ................ 464 ten Hacken, P ........... 471 Hahn, U ................. 476 Haji~, J ................. 483 van Halteren, H ......... 491 Hamon, T ............... 498 Harper, L ............... 794 Harris, M.D ............. 206 Haruno, M .............. 505 Harvey, T ............... 512 Hasida, K .......... 917, 1282 Heine, J.E ............... 519 Heinecke, J .............. 526 Heinonen, O ............ 1484 Henderson, J ............ 531 Henderson, J.C .......... 186 Hepple, M .......... 538, 699 Higgins, D ............... 545 Hirakawa, H ......... 263,268 Hirschman, L ............ 201 Hitzeman, J ............. 550 Hladkti, B ............... 483 Honda, T ................ 881 Huang, C ................ 600 Huang, S.-J .............. 232 Humphreys, K ............ 74 Hur, W ................. 1015 Hwa, R .................. 557 Ibekwe-SanJuan, F ...... 564 Ide, N ............... 281,315 Iida, H .............. 653,855 IJdens, J ............... 1060 Ikeda, T ................. 571 Ingleby, M ............... 578 Inui, N ................. 1423 Isahara, H ............... 802 Ishizaki, M .............. 583 Jacquemin, C ............ 595 Jelinek, F ............... 225 Ji, D .................... 600 Jing, H .................. 607 Jmaiel, M ............... 438 Jobbins, A.C ............ 614 Johnson, M .............. 619 Johnston, M ............. 624 Jokinen, K .............. 631 Jordan, P.W ............. 325 Jun, Z ..................... 1 Jung, H.-M .............. 251 Jurafsky, D ............. 1122 J~vinen, T ............. 1289 JSnsson, A .............. 590 Kaalep, H.J ............. 315 Kageura, K .............. 638 Kahane, S ............... 646 Kaki, S .................. 653 Kamei, S.-i .............. 336 Kan, M.-Y ............... 680 Kaneji, K .............. 1381 Kang, J.-G ............. 1015 Kaplan, F .............. 1243 Kaplan, R ............... 145 Kashioka, H ......... 131,658 Kasper, R.T ............. 663 Kato, T ................. 583 Kawata, Y ............... 658 Kijsirikul, B ............. 836 Kikui, G ................. 670 Kilger, A ................ 110 Kim, B .................. 675 Kim, T .................. 251 Kinjo, Y ................. 658 Kipper, K ............... 293 Klavans, J.L ............. 680 Knight, K ............... 704 Kojima, T .............. 1423 Kong, T.E ............... 687 Korhonen, A ........... 1493 Kotani, Y .............. 1423 Koyama, Y .............. 694 Krotov, A ............... 699 Krymolowski, Y .......... 67 Kukich, K ............... 206 Kumano, A .............. 263 Kunze, J ................ 526 Kurz, D ................. 152 Kwong, O.Y ............ 1487 Lamping, J .............. 464 Lane, P .................. 531 Langkilde, I ............. 704 Langlais, P .............. 711 Lavoie, B ................ 718 Lee, G .............. 675,756 Lee, J.-H ............ 675,756 Lee, S ................... 723 Lee, W .................. 675 Lepage, Y ............... 728 Lesmo, L ................ 787 Levin, L.S .............. 1129 Levow, G.-A ............. 736 Lewellen, M ............ 1490 Lezius, W ............... 743 Li, H .................... 749 Li, H.-F ................. 756 Li, L ................ 763,980 Lin, D ................... 768 Lindberg, N ............. 775 Linebarger, M.C ......... 763 Litman, D.J ............. 780 LLoberas, A ............ 1233 Loehr, D ................ 794 Lombardo, V ............ 787 Long, D ................ 1091 Lowe, J.B ................. 86 Lu, C .................... 206 Lua, K ................. 1465 LuperFoy, S ............. 794 Luzi, D .................. 286 L~tourneau, S ........... 307 Ma, Q ................... 802 Macleod, C .............. 843 Makino, T ............... 807 Mangu, L ................ 186 Marquez, L .............. 997 Martinez, R ............. 812 Maruyama, I ........... 1340 Masson, N ............... 392 Matiasek, J ............. 1041 Matsumot0, Y. .............. 990, 1314, 1393 Matwin, S ............... 307 Maybury, M.T ........... 819 McCarthy, D ........... 1493 McCoy, K.F ............ 1198 McDonald, S ........... 1496 McGee, D.R ............. 823 McIntyre, A ............. 830 McKeown, K ....... 607, 1003 Meddeb-Hamrouni, B... 1205 Meknavin, S ............. 836 xxii Menzel, W ............... 526 Merkel, M ................ 29 Meyers, A ............... 843 Mikheev, A .............. 848 Miller, K ................ 794 Mima, H ................ 855 Min, K .................. 862 Mitkov, R ............... 869 Mitsuishi, Y ............. 876 Miyata, T .............. 1314 Mochizuki, H ............ 881 Moghrabi, C ............. 886 Mohri, M ................ 891 Moliner, J.L ............ 1233 Moore, J.D .............. 325 Moreno, L ............... 385 Moreno-Sandoval, A ..... 843 Mori, S .................. 898 Mori, T ................. 929 Mouret, P ............... 905 Muraki, K ............... 571 Murata, M .............. 912 Nagao, K ................ 917 Nagao, M. .......... 898,912, 1374, 1381 Nagata, M ............... 922 Nakagawa, H ............ 929 Nakanishi, M ........... 1171 Nakano, M .............. 934 Nakatani, C.H ........... 939 Narayanan, S ........... 1345 Nasr, A .................. 646 Nazarenko, A ............ 498 Nederhof, M.-J ...... 946,953 Ney, H .................. 960 Niehren, J ............... 353 Niet3en, S ................ 960 Niklfeld, G ............. 1041 Ninomiya, T ............. 968 Nirenburg, S ....... 975, 1328 Nisimura, H ............ 1423 Noda, I ................. 1282 Norton, L.M ........ 763,980 Nuttee, C ............... 836 Och, F.J ................. 985 Oflazer, K .............. 1277 Oishi, A ................. 990 Okada, Y ............... 1381 Okamura, J .............. 929 Okumura, A ............. 571 Okumura, M ............ 881 Okunishi, T ............ 1443 Okurowski, M.E .......... 62 Omori, N ................ 929 Ono, K .................. 268 Ooyama, Y .............. 505 Oviatt, S ................ 823 Padr6, L ................. 997 de Paiva Alves, E ....... 1416 Palmer, D ............... 201 Palmer, M ............... 293 Palomar, M ............. 385 Pan, S ............. 780, 1003 Paraboni, I ............. 1010 Pardo, M.A ............ 1333 Park, D.-I ............... 251 Park, J ................. 1015 Park, J.-S ............... 251 Pautler, D .............. 1020 Penn, G ................ 1027 Pereira, F.C.N ........... 891 Pericliev, V ............. 1034 Petkevic, V .............. 315 Phelan, P ............... 1193 Pierce, D ................ 218 Piitulainen, J ........... 1289 Pirker, H ............... 1041 Poesio, M ............... 550 Poller, P ................. 110 Popescu-Belis, A ....... 1046 Power, R ............... 1053 Poznanski, V ........... 1060 Pr6sz~ky, G ............ 1067 Quilici, A .............. 1020 Radev, D.R ............ 1072 Rainbow, O ......... 646,718 Rapp, R ................. 743 Raskin, V ............... 975 Ratnaparkhi, A ......... 1079 Read, T ................ 1086 Reed, C ................ 1091 Reeder, F ................ 794 Richardson, S.D ........ 1098 Rieder, S ............... 1193 Rigau, G ............... 1103 Roark, B ............... 1110 Robba, I ............... 1046 Rodriguez, H ........... 1103 Rogers, J ............... 1117 Roland, D .............. i122 Rolbert, M .............. 905 Romary, L ............... 281 Rosenzweig, J ........... 293 Rossari, C ................ 48 Ros~, C.P .............. 1129 Roth, D ................ 1136 Ruhrberg, P ............. 353 Rupp, C.J ............... 160 Sabah, G ............... 1046 Sagisaka, Y .............. 300 Saint-Dizier, P .......... 1143 Samuel, K .............. 1150 Sanfilippo, A ........... 1157 Sankoff, D ................. 8 Sarasola, K ............... 22 Sarkar, A .......... 953, 1164 Sato, K ................. 1171 Satta, G ........... 953, 1176 Sawamura, E ........... 1340 Schiehlen, M ........... 1183 Schilder, F ........ 1188, 1294 Schmid, P .............. 1193 Schnattinger, K .......... 476 Schneider, D ........... 1198 SchrSder, I .............. 526 Schuler, W ............. 1176 Schulz, H ............... 1193 Scott, D ................ 1053 Segond, F ............... 320 Sekiguchi, Y ............ 1272 Seligman, M ............ 1205 Senellart, J ............. 1212 Shaw, J ................ 1220 Shen, D ................ 1265 Shimazu, A .............. 934 Shirai, K ............... 1340 Shirai, S ............ 152,505 Shudo, K ................ 694 Sire, C.-M ............... 251 Simard, M ............... 711 Smith, E ............... 1499 Somers, H.L ............ 1227 Sopena, J.M ............ 1233 Stede, M ............... 1238","o°o XXlll Steels, L ................ 1243 Stent, A ................ 1475 Stevenson, M ........... 1398 Stoianov, I ............. 1502 Strube, M .............. 1251 Strube de Lima, V.L... 1010 Strzalkowski, T ......... 1258 StrSmb~ick, L ............ 590 Sumita, E .......... 653, 1428 Sun, M ................. 1265 Suzuki, Y .............. 1272 Szpakowicz, S ............. 96 Takagi, S ................ 409 Takeda, K ........ 1307, 1369 Tanaka, H ............... 631 Tanaka-Ishii, K ......... 1282 Tapanainen, P .......... 1289 Tappe, H ............... 1294 Thede, S.M ............. 1505 Theofilidis, A ........... 1193 Thomason, R.H ......... 325 Tillmann, C ............. 960 Torisawa, K .... 807, 876,968 Trost, H ................ 1041 Tsai, S.-C ............... 232 Tsou, B.K .............. 1265 Tsuei, W ................ 244 Tsujii, J ........ 807, 876,968 Tufts, D ................. 315 Turcato, D ............. 1299 Tiir, G ................. 1277 Umbach, C ............. 1238 Uramoto, N ............ 1307 Urizar, R ................ 379 Utsuro, T .............. 1314 Valdds-Pdrez, R.E ...... 1034 Vanderwende, L ........ 1098 Velardi, P ............... 286 Verspoor, C.M .......... 1352 Viegas, E ......... 1321, 1328 Vijay-Shanker, K ....... 1150 Vilain, M.B ............ 1436 Villemonte de la Clergerie, E. , ....................... 1333 Vogel, S ................. 960 Voutilainen, A ............ 22 Vdronis, J ............... 711 Waibel, A .... 451, 1357, 1453 Wakao, T .............. 1340 Walker, M.A ....... 780, 1345 Walther, M ............... 91 Wan, S ................. 1352 Wang, J ................ 1258 Wang, Y.-Y ............ 1357 Wasson, M ............. 1364 Watanabe, H ........... 1369 Watanabe, Y ..... 1374, 1381 Weber, H ................ 985 Weber, V ................. 55 Wehrli, E ............... 1388 Weir, D ................. 372 Wettler, M .............. 743 Whitelock, P ........... 1060 Wilcock, G ............. 1393 Wilks, Y ........... 699, 1398 Wilson, W.H ............ 862 Wise, B ................ 1258 Wolff, S ................. 206 Wong, H ............... 1408 Worm, K.L ............. 1403 Wu, D .................. 1408 Wu, H .................. 1416 Wu, J ................... 191 Xu, F ................... 353 Yamabana, K ............ 336 Yamada, S ............... 421 Yamaguchi, M .......... 1423 Yamaji, T .............. 1443 Yamamoto, K ...... 421, 1428 Yangarber, R ............ 843 Yasutake, M ............. 694 Yee, L.Y ................. 414 Yeh, A.S ............... 1436 Yokoo, A ................ 631 Yoshida, M .............. 807 Yoshimi, T ............. 1443 Yoshimura, K ............ 694 Zavrel, J ................. 491 Zechner, K ........ 1448, 1453 Zelenko, D ............. 1136 Zhang, X ............... 1460 Zhou, G ................ 1465 xxiv"]}]}