{"sections":[{"title":"The Logical Structure of Binding Ant6nio Branco","paragraphs":["DFKI and Univ. of Lisbon","Dep. Inform~itica, Fac. Ci~ncias, Campo Grande, 1700 Lisboa, Portugal Antonio.Branco@di. fc.ul .pt"]},{"title":"Abstract","paragraphs":["A log.ical recasting of B.inding Theory is performed as an enhancing step tor the purpose ot its gull and lean declarative implementation. A new insight on sentential anaptioric processes is presented which may suggestively be c%ptured by the slogan binding conclitions are me effect of phase quantification on the universe of discourse referents."]},{"title":"Introduction","paragraphs":["Due to its central role in natural language and its intriguing propert.ies, reference and anap'hor resolution has been a central topic for NLP research. Given the intensive attention devoted to this subject, .it can however be said that sentential anaphor orocessmg has been quite overlooked, when compared io the amount of research effort put in tackling non sentential anaphoric dependencies. This tends to be so because there seems to be a more or less implicit assumption that no substantial difference exists between the two ~cesses 1.","ile this may be arguably true for. the heuristics involved in picking out a given antecedent from a list of suitable candidates, a more s.ubtle point asks. itself to be made when we focus on the syntactic conditions which sentential anaohoric relations comply with, but from which non senfential ones are exempt. In theoretical linguistics these grammatical conditions are grouped under the hea.ding of BindingTheory.. In computational linguistics however, tlaoug.n there have been a few papers directly concerned with me implementation of this theory, mainstream research tends t 9 disregard its conceptual, grammatical or practical modularity. When it comes to define me algorithm. .for.setting up the list of suitable candidates from which the antecedent should be chosen, binding conditions, holding just at the sentential level, are most otten put on a par with any other kind of conditions, morphological, semantic, pragmatic, etc.~ which hold for anaptioric relations at both sentential and non sentential level. The interesting p.oint to be made in this connection is at, it the modularity ot grammatical knowledge is to be ensured in a sound reference resolution system, more attention should be paid to previous attempts of implementing, Binding Theory.. It would then become ewdent that mis theory, in its current formulation, appears, as ,a , piece of formalised grammatical KnowJe~age wnicn nowever escapes a full and lean declarative implementation. In fact, implementation efforts concerning Binding Theory 2 bring to light what tend to be eE!ipsed by. mainstream clean theoretical formulations ot it. Behind t.he apparent declarative aspect of its definition under the form ot a set of binding principles(plus definitions of associated concepts, e.g. o-command, o-bound, local IAs entry points into bibliography vd References in Grosz etal. (95) and Botley et al. (96). -'Vd. Chomsky(81 ), Correa(88), lngria et al (89), Fong (90), Giorgi et al. (90), Pianesi (91). domain, etc.), there is a set of procedures which turn out to be an essential p.art ot the theory: after parsing being completed, (it in~lexation: assignln.dices to NPs; (ii) filtering: store the indexed tree it the indexation respects binding principles, reject otherwise; (iii) recursion: repeat (i)with a new assignment until all possible assignments are exhausted. T.his sort of resistance to declarative encompassing is also ap.oarent when one considers how Binding Theor Z is hani:lled in grammatical theories developed on top ot constraint based formalisms and particularly concerned with computational implementa'bility, lille LFG or HPSG. As to HPSG, it has passed quite unnoticed that its Binding Theory is the only piece of the grammar fragment not encoded in its own formalism. In the Appendix of the foundational book (Pollard and Sag ~9\"4)), where the fragment of grammar developed along tts 700 pp. is encoded in the adopted formalism, Binding Theory_ escapes such encoding. Bredenkamp (96) and Backot'en et al.. (96) subsequent elaboration on this. is.sue jmplied that som. e. ki.'nd pf essential limitation ot the tormallsm might have been reacnea and that H PSG. Binding Theory is still waiting to be accommpdate~ into HPS.G grammars ...... As tO the UP~ tormulaUon ot t~lndmg lneory, it requires the integration of inside-out equations, a sp6cial purpose extension to the general'declarative fbrmalism. And even though initial scepticism about their tractabili.ty was dissipated by Kaplan and Maxwell [88), the recent survey, of l~acKoten et al. (96) repo.rts that no implementeH formalism, and no implemented grammar, is known to handle LFG Bin.ding Theory.. . ..... In this connection the central aim ot the research to De pres.ented here is to render possible a lean declarative implementation of Binding Theory in constraint based formalisms without resorting to specific complex mechanisms. This involves two steps. First, as a sort of enhancing step back, a new account, of Binding lheory, is set up. Second, by the exhibition ot aft example~ the new shape of the theory is shown to support full declarative implementation in basic HPSG formalism. Due to sp.ace constraints, this .paper is mostly concerned with the first, while the latter receives just a rough sketch in last section, being develope~l in future papers."]},{"title":"1 Preliminaries 1.1 The Square of Opposition","paragraphs":["Recent cross linguistic research, e.g. Xue, Pollard and Sag (94) and Branco and Marrafa (97), ILas shown that the binding ability of long-distance renexives.is not reducible to recursive concatenation of short distance relations, as it has been assumed in GB accounts, but that it is ruled by a fourth binding principle: (1) Principle Z An o-commanded anaphoric pronoun must be o-bound."]},{"title":"181","paragraphs":["(2) Z: B: x is bound compatible x is locally free"]},{"title":".I","paragraphs":["contradictory 1 implies 1 contradictory C: contrary A: x is free x is locally bound This new perspective on long-distance reflexives had an important impact in the whole shape of Binding Theory. Branco and Marrafa noted still that the four principles can be arranged in a classical Aristoteli.an s~uare at oppositions, as in (2). This su~zgests that the Binding Theory may have an unsuspec'(td underlying q uantificational structure. The present paper aims at snowing that there is such structure and at determining its basic lines. 1.2 Phase Quantification Barwise and Cooper (81) seminal work gave rise to a uitful research tradition where Generalised Quantiller Theory has been applied to the analysis of natural land e \" \" =uag q.uant~ficanon. These authors suggested that a universal characterisation of NL nominal quantification could be formally given by means of ,formal prop, erties defined in that theory. Th.'e property to live on was postulated as being the most prominent one~ admittedly constituting the common specific nature at all nominal quantifiers. L.ater, Loebner (87)suggested a criterion to ascertain the quantihcat,onal nature at natural language expressions in general. That is the property that, for a one place second order operator Q expressed by a given exc~ression, there be a corresponding dual operator THls'duality-\"¢- based perspective on the essence of natural langua,,. ,.~, e quantificauon permitted to extend quann~fication su orted 19 the determiners all, some. canon well beyond the classic cases of nominal q PP . . most many, etc., namely ~y covering also the realms of tempora'litv and Doss'ibility. Moreover, items like still/ already, , and others (enough~too, scaling adjectives, man)/few, etc.) though they do not lend themselves to be straightforwardly analysed in terms of set .quantification, they can alsob.~ arranged in asquare of duality. The formalization at the semantics at these aspectua] items by Loebner led tq the enlarging of the notion at quantincation through the introduction at the new concept of phase cmantification. He noted that still and alreaclv express duals m2,,d that they are corners,of a square of,d, uality. Let P be she is asleep\" and -P 'she is awake', durative propositions which are the arzuments of the semanuc operators corresponding to aTready and still. Then: (3) She is already asleep iff","it is not the case that she is still awake.","ALREADY P iff - STILL -P Further similar tests can be made in order to show that these aspectual items enter the following square of duality: (4) inner","still negauon .not yet"]},{"title":"/q ,","paragraphs":["e OU ~r OUt ~\" negauon/ dual | negauon no longe) ~'~---~ ~ already inner neganon In order to ~et a formalization of (4), Loebner noted that alreac~,.should be taken as convey.in~ the information that there is a phase of not-P which has st a(ted before a given reference time tO and might be IOllOWeO lay at most one phase P which reaches tall tu. This can be displayed in a time axis by means of the diagram in (5). (5) tO tO"]},{"title":"1","paragraphs":["'\"~'\"'\"'-\" ~ t P -P ~p P still P not yet P tO tO P -P ~p P no longer P already P Similar diagrams for the meaning of the other aspectual phase quantitiers at this square of duality are easily intemretable. Inner negation results in exchanging the positive and the negative semiphases, while outer negati9n c.oncerns the.decision whether the parameter to tails Into the hrst or the second semiphase. Phase quantifiers in general (already, scaling a.djectives, etc.) . were thus characterised as requiring two ingredients: (i) a property P, which defines a positive phase in a sequence of two opposi[e phases; (ii) a p.arameter point. The four types at quantifiers just ~liffer in presupposing that either the positive or the negative semiptiase,co.mes first_and in stating that the parameter point tm~s rata the tirst or into the second semiphase. . . . . Next Loebner showed that the semantics of phase ~oUantifiers sketched in the diagrams above can be rmalised in such a way that\" a square of duality formed b~, the generalised q.uanti.fiers XX.some'(D,X~/ XX.every (D,X) turns out to t~e su.bjacent to the square of duality of already~still. In order to do it, he just needed the auxiliary, notion at starting, point at the relevant semiphase. This is rendered as the intimum at the set of the closest predecessors of the parameter po.i.nt pt which, forman unint.errt~pted linear sequence w~th property P, or ~P (.termed Libl(K,pt) lay Loelaner): (6) GSI(R,pt) =df inf{x I x<pt & R(x) &","Vy(x<y<pt & R(y) --~ Vz(x<z<y ----~ R(z)))} The semantics of the four ohase quantifiers above can then. be rendered in the following way, making pt=tO tar the parameter point and R=P or R=-P: (7) still: XP.every'(X x.(GSI(P,a)<x<t0),P)","already: XP.some'(X x.(GSI(-P,a)<x<t0),P)","not yet: XP.no'(Xx.(GSI(-P, a) < x < t0),P)","nolonger: XP.not every'(Xx.(GSI(P,a)<x<t0),P) 2 The Logic of Binding Taking Loebner's view on quantification, our goal in this section is to make apparent the quantificational structureof binding by showing that on a par with the square o! opposition, of (2) binding, principles form a ,squa4\".e of d.dality, we are going tDus to argue .that olnain.g prlnciptes are out the reflex ot the ph.ase quantincational nature oI corresponding nominal expressions: reflexives, prg.no.uns, long-distance reflexives and R-expressions will be shown to express phase quantiners acting on the grammatical oonqueness axis. 182"]},{"title":"2.1 Phase quantification ingredients","paragraphs":["In order to show that the above referred nominals .express ,phase quantifi.ers t.he relevant .components mvoJvea m pnase.quantm.catlon snored t~e. mentmea. lne relevant scale here Is not the continuous nnear ~.rder of mo.ments of time, as for"]},{"title":"still~already,","paragraphs":["but a lscrete partla~ order made oI mscourse rererents (ct. DRT) arramzed according to the relative obliqueness of grammatical functions. Note that in multiclausal constructions there is the corresponding subordination of different clausal obliqueness hlerarchles (for the salve or comparalgility with diagrams (3) involving time arrow, Hasse dm~ams for obliqueness are displayed with a turn of 90~right): (8) Kim said Lee saw Max.","O","k 1 m Note also that the relation \"less oblique than\" may not be linear: (9)Kim said Lee, who saw Max, hit Norma.","O--------O O","k 1 n","O O"]},{"title":"I m","paragraphs":["The sequence of two oEposite semiphases is defined by a,prooerty 1-'. Contrarily to what happens with"]},{"title":".alread3,","paragraphs":["wfie.r.e operator (quantifier). and o~rand (auraUve proposmon) are renderecl p.y mtterent expressions, m binding p.hase, quantification .me operanu r is also contnbuteO by. the nomlna~ expressing the operator, i.e. expressing the binding phase quantiner. For a given nominal N P is determined by the relative position of N in the scale . For a discourse referent r corresponding to N, semiphase P is a linear stretch containingonly elements that. are less than or equal to r in the obliqueness order, that is discourse reterents correspondi.ng to. , nom in.als o-commanding N.. Moreover, it semlpnase .r Is. presupposecl to precede semiphase -P, P is such that the last successor m it is local wrt to r; and if semiphase -P is presupposed, to precedes semlphase P, P is such .tha.t the first predecessor in It is local wrt to r. In both cases tide closest ~ nei~hbour or semiphase -P has to be local wrt r, where the notion of locality has the usual sense given in the definition of binding principles: (10) P(x) iffdef x < r & Vy[(-P(y)&","(x-<y or y-<x))----) x is local wrt r] As to the parameter point, in binding..p.hase quantification, it is the discourse reterent a winch is the antecedent of r. 2.2"]},{"title":"Binding phase","paragraphs":["quantifiers We can now formalise phase quantification subjacent to nominals. Let us start with an anaphoric expression N like"]},{"title":"himself","paragraphs":["(11)Kim said Lee thinks Max/hit himself/. *Kim said Lee/thinks Max hit himself/. QA: XP.some'(Xx.(GSI(-P,a)<x<a),P) .a P o ! k .... 0 X C X N can thus be inte.rpreted as presupposing that a semiDhase -P precedes a semipfiase P and requiring that the p.arameter point occurs, in the. !atter~ ttiat is, the antecedent a ~s to be round in .s.em~pn~e r among the discourse referents corresponding to Uae local o-commanders of r, the disc referent correspgnd.ing tq N 3. This is captured by_ the definition oI tide pna:s.e .quantifier QA. Sanstaction. of QA(P) obtains iH between the bottom ot tide uninterrupted linear sequence -t-' most close to me parameter p.omt/antecedent a and a inclusive there is at'least one ~liscourse referent in P. Given -P.P, this amounts to requiring that a be in P, and that a be a local o-commander of r. 3 Next, it is then easy to see how the phase quantificational force or a pronominal expression N should be formalised: (12) *Kim said Lee thinks Max/hit him/.","Kim said Lee/thinks Max hit him/.","QB:XP.no'(Xx.(GSI(~P, a) < x < a),P)"]},{"title":"_p ~a","paragraphs":["~:~ p Here the parameter point a occurs in semiphase -P, which amounts to the antecedent being picked 9utside t,n.e set of loc~ o-commanders. QB(P). Is satisnea itt no discourse reterent between the bottom ot me uninterrupted, linear sequence -P re.ore c.lose to the oarameter i~olnt/antecedent a and a Inclusive Is In r'. Given.-P.P, this.amount.s to requiring that a be ,in semiplmse ~1 ~, and mat a be not a local o-commanoer of r. Like in diagram of (11), ~P is taken here as the complement set oIP. All discourse reterents which are not \"local o-commanders of r are in it, either o-commanding r or not. Notice that set -P includes also discourse referents"]},{"title":"Xl.vX n","paragraphs":["introduced by previous sentences or the extra-linguistic context, which in constructions similar to (l'2)b. accounts for possible aeictic readings of the pronoun. Below, when studying .R.-expressions~we,wlll see why. the possible non linearity ot me ot~li.qu.eness orizler will led. us. to consider that -1: is sljglatly more complex than just me complement se_t ot r'._ Coming now to long-distance reflexives, ruled by. the fourth binding principle in (1), we get the following formalisation: (13)[O amigo de Kim]i disse que ele pr6prioi acha que","Lee wu Max. (Portuguese)","[Kim's friend]/saidLDRi thinks Lee saw Max.","*[O amigo de Kimi] disse que ele pr6prioi acha que Lee viu Max. [Kim'si friend] said LDRi thinks Lee saw Max. Qz:XP.every'(X x.(GSI(P, a)<x_<a),P) ~a P _p O"]},{"title":"I xn k","paragraphs":["3For the sake of simplicity, agreement requirements between N and its antecedent are overlooked here."]},{"title":"183","paragraphs":["Here, like for short-distance reflexives in (11), a is required to occur in P though the presupposition now is .t.13at semiphase P is fpIlowe.d by~ ~m.ipnase ?,r'. laKmg.mto account the de/m.mon oI t- m t~u), me antecedent of N is thus required to Dean o-comma3a.ger Qocal or n.ot) of N. Thesemantics PL P.13ase quantiner ~Z ~s such tpat, tor QZ(r') to .De saUsned, between me bottom oI the uninterrupted linear sequence V more close to the parameter point/antecei[lent a and a inclusive every ..discourse referent is in P. This amounts to requmng that a be in semiphase P, and that a be an o-commander or r. Finally R-expressions call to be formalised as the fourth phase quantifier of (7): (14) [Kim'si friend] said Kimi thinks Lee saw Max.","*[Kim's friend]/said Kimi thinks Lee saw Max.","Qc:hP.not every'(Xx.(GSI(P,a)<x< a),P) P","-P o m 0"]},{"title":"I xn k a)","paragraphs":["The parameter point a is required to occur in -P, which means that a cannot be an o-commander (local or not) of r. This renders the same condition as expressed by Principle C, that R-expressions be free, though it also encodes an uncommon assumption agout the referential autonomy of R-expressions. Here, like for other more obvious dependent reference• nominals, the interpretation .of l,~-expressions is. taken as being dependent on the interpretation ot other expressions or on the salience of discourse referents made available by the communicative context. Taking an extreme example in order to support the plausibility of. this view and awkwardly, ab'6reviate a deep philosophical discussion, one should notice that even a proper name is not a unique label of a given individual~ once knowing who is the person called John (out ot those we know that are named John) depends on the context. Note that like in previous diagrams, -P is taken in (14) just as the complement set of P. However, QC asks finally for a serious ponderation o) this and a more accurate definition of -P for phase quantincation in non linear orders, where it is possible that not all elements are comparable.. ..... Por t~c(P ) to be satisfied, between the t~ottom o[ i-and the parameter point/ antecedent a inclusive not every discourse referent is in P. Since we have here the p.resupposition P.-P, andgiven P is an uninterru.pted linear sequence, this would-amount to requiring that a be in -P. It is wortb noting then that i.f we keep -P simply as the complemen.t set of r', the interpretation o! ~- expressions is however not adequately predicted by"]},{"title":"~c(P).","paragraphs":["(15) John said Kimj thinks Lee saw Max. P -P a-...~l o n P -P ~: ......... m Let D be Ix: GSI(P,a)<x<. a}~t.he domain of .Qc. Taking (15)b., it is easy to check that in constructiops like (.IS)a, D is always empty. In fact, it is not the case that G S.I(P,a)<a as a=xl- is not comparab.le to any element ot 1-',"]},{"title":"andafortiori","paragraphs":["it is not comparable to the bottom.of P. Consequently, every'(D,P) is trivially true whatever discourse referent xn we take as antecedent for r, and not every'(D,P) is trivially false. The interpretation of.(1.5)a, sketched in (15)b. would thus be incorrectly ruled out. What these considerations seem then to suggest is that, when ph.ase quantification opera.tes o.n non linear orders, negatmn ot the ooerand r' ~s slightly more complex ttian sim_ple Boplean negation rendering the complement se.t.W..e are thus.taugm tla.at negation qf.P involves also the lilting ot the comolement set o~ L', P_L, with _1_ equal to"]},{"title":"r,","paragraphs":["the top of P, when P.-P . It is easy to check with diagra..m (15)c. that this specification of-P makes it possible to satisfy Qc(P) in exactly the correct constructions."]},{"title":"2.3 The Binding Square of Duality","paragraphs":["Fol!owing Loebner's claim that logical duality is the cardinal property to recognise the quant~hcational character 9f nat.ural language expressions, we are thus led to the vmw that the interpretaUon or pon quantincational dennite nominals ~s...ruled by their phase quantincational Iorce over the obliqueness order. Since ~he defining formulas of binding quantiners result from .(7) just by assigning P the ~lefinition .in (10) and taking the .p.arameter point,"]},{"title":"pt","paragraphs":["to be toe antecedent a, ~t is w~th no su.rpnse that we get the following square of duality for binding quantitmrs: (16) ~ inner ,-,","x/Z negatmn ~/ ~~~ ~outer outer - / dual / ne~atmn negauon/ _ _ /","q -- C inner Q A negation 3 Consequences This new conception of binding seems to have important consequences not only in terms of the understandimz of dependent reference mechanisms captured by Binding Theory but also in terms of our conception o.f generalised quantification in natura] language, of the twofold semantic capacity, ot nominal expressmns, referential and quantificational, and maybe even of the.nature of grammar devices. Here we cannot do but to limit ourselves to hint how a lew central i.ss.ues usual]y assgciated to binding are handled, u.nder this new viewpoint, bet~e we proceed to bnetly~ consider its consequences tor the implementation ot Binding Theory in constraint based grammars. 3.1 Further insights into binding... Parameterization It is well known that though binding principles are assumed to hold universally m all languages, final \"grammatical geometry\" between 184 nominals and their antecedents may be different from lanRuage to language.. .... Da[ry mple (9.3) pointed out that this is.oue .to l.anguage specific cqndit!ons i.mpinging ~),on the eligibimy or t.ne anteceoe.nt (wnemer it is a ~ubiect. or not) and ~l~) the range 9t the local domain (whether it ~s nnite, tensed, .etc.). As to (i), Branco and Marrafa (97) showed that it ~s a conseqgence of a lexical property of the precticates, whose ot~liqueness.hierarchy may be either linear or non linear. Es to (ii), t0is variation may accommogated in the definiuon ,ot property P in 00.), in particular in the de.finitiqn of loca~ w.rt tq r., to proyl(Je for each partlcu!ar language. ~oth splu.hons are oertectly contluent w~th. the uLi standpomt .that binding v.aria.tions across language are the result ot parameterlzatlon. Lexical gaps 4 It is also well known th.at although. t~e tour binding principles, are claimed to be universal mere are. languages wnicn nave not all the corresponding tour type of nominals. For instance, English is not known fo have long-distance reflexives. Ine answer Ior this oecomes now quite simple: like what happens in other squares of duality, it is possible that no[ ever)/, corner of the. square IS le~calized. 9oeoner t~s/) qlscusses at.length t.ne Issue. m ~ngusn, ~or instance, it is noted mat the square or ouauty concerning deontic possibility involvingright h.appens","nave only two le_xic_alized .corners, right and duty. , r~xe.mption, and Iogophoricity AlSO worm considering here is the borderline case where the maximum shrink of semiphase P occurs, i.e. when P is the singl.eton whose sole ele .ment is r, the .discourse r.eterent whose interpretation ~s to De anchored Dy nnolng an antecedent tor ~t. _ . Oiven the definition of binding phase quantitlers~, me maximum shripk .of P into a. singl.eton attects significantly only the quantifiers wlaere the parameter polnU antecedent a is to be found in P, namely QA and QZ. In these cases, for a to be in P an~l-me quantincation to 0e satisfied, a can only be r, r being thus its own antecedent. Consequently.~, although the Quantification is satisfied, a '.meaningftil a.nc.hor.mg of the discourse referent r is still to be accomplished since by the sole effect of.quantification satisfaction r is iust anchored to itself. Admittedly, an overarching inte~retability requirement imposes that the significant anchoring of nominals be consummated, which, i.nduces in present case an exceptional logopnorlc ettect: tor me anap.nor (snort or Io.ngdistance), tq t)e lnterpreted,.and given t.nat satls.t.act.lon ot its t)lnding constramt is ensured, It should thus freely . find an antecedent outside any specific restriction. This constitutes th.usan explanation for the exemption restrictions in the definitions oI rrinciples. A and Land so called logophoric effects associated .to exempt anaphor.s. Restrictions. which appeared until no.w to ,~ .mere.stlp.ulations recewe in this approach a pnnciplea jusnttcatlon. 3.2 ... for a lean implementation The new conception of. Binding Theory presented in is paper is currently being inte~ated\" in an HPSG grammar implemented in ProFI.T 1.54.. Space lim.its restrict us here to a very. prier rauonme ot .mat implementation, which wall be fully presented in tuture tpapers. T.he in}erestingpqint t 9 note in t.his connectip.n.is .th.at me new insight !nto oinmng phenomena elicited t~y the discovery of. t0eir qua ntin.cationa] nature seems, to constitute a breakthrough tot t.ne desideratum or giving Binding Theory a lean declarative implementation. Adopting a pnnciple based semantics in fine with Frank and Reyle (95), the central goal is not anymore 4 Though it is empirically not necessary, for the sake of uniformity, when -P.P, the order-theoretic dual of this specification of -P can be assumed. 9o filter coindex.ations between NPs in post-processing ut rather to identi.ty the relevant sets oldiscourse reterents against which satistation ot the binding phase fluantitlc.atlon expresse.d by .NPs is check.ed. .. . in practical term.s that myolves first._ collecting discourse reterents into set values ot specific teatures, requiring a minor extension to \"HPSG feature declaration. S.econd, giyen the possible .non local nature ot the elements ot a given set, in order to avoid termina.tion problems\" some. mechanism of delaying constrmnt satlstactlon has to be ensured."]},{"title":"Conclusions","paragraphs":["fThoe research .reported here present a cogent ,argument","r the quantmcatlonal nature ot sententlal dependent reference relations among nominals. This radically new conception of binding appears as a decisive step. ~w~fls a full lean decIara.tive, encompassi_ng or .~inaing lneory i.n constrain.t based g.ram.mars. It may have also opened .new intriguing directions 3or the research on natural language generalised quantitl.cation~ on the. apEarent twolold semantic .capacity .ot nominals, reterential and quantillcational, or on the nature of grammar devices."]},{"title":"Acknowledgements","paragraphs":["lSfsecial thanks are due to Palmira Marrafa and Hans","zkoreit for their advice and discussion and to Berthold Crysmann for his detailed comments."]},{"title":"References","paragraphs":["Chomsky (81), Lectures on Government and Binding, Foils, Dordrecht.","Correa (88), \"A Binding Rule for Government-binding Parsing\", COLING'88 Proceedings.","Backofen, Becker, Calder, Capstick, Diui, Dtirre, Erbach, Estival, Manandhar, Mineur, van Noord, Oepen and Uszkoreit (96), Final Report of EAGLES Formalisms Working Group.","Barwise and Cooper (81), Generalized Quantifiers and Natural Language, L&P 4, 159-219.","Botley, Glass, McEnery and Wilson, eds. (96), Proceedings of Discourse Anaphora and Resolution Colloquium, Lancaster University.","Branco and Marrafa (97), \"Long-Distance Reflexives and the Binding Square of Opposition\", 4th International Conf. on HPSG.","Bredenkamp (96), Towards a Binding Theo, T for HPSG, PhD dissertation, Univ. of Essex.","Dalrymple (93), The Syntax of Anaphoric Binding, CSLI, Stanford.","Erbach (95), ProFIT 1.54 User's Guide, DFKI.","Fong (90), \"Free lndexation: Combinatorial Analysis and a Compositional Algorithm\", Proceedings of ACL Meeting, 105-110.","Frank and Reyle (95), \"Principle Based Semantics for HPSG\", Proceedings of EA CL'95 Meeting.","Giorgi, Pianesi and Satta (90), \"A Computational Approach to Binding Theory\", Proceedings of COLING'90, 1-6.","Grosz, Joshi and Weinstein (95), \"Centering: A Framework for Modelling the Local Coherence of Discourse\", Compututional Linguistics 21.","lngria and Stallard (89), A Computational Mechanism for Pronominal Reference, Proceedings of ACL Meetit,g, 262-271.","Kaplan and Maxwell (88), \"An Algorithm for Functional Uncertainty\", Proc. t~f COLING'88.","Loebner (87), \"Quantification as a Major Module of Natural Language Semantics\", in Croenendijk, Jongh and Stokhof, eds., Studies in DRT and the Theory of Generalized Quantitiers. Foils, Dordrecht. Pianesi (91), \"Indexing and Referential Dependencies within Binding Theory\", Proceedings of EACL Cm!]erence, 39-44. Pollard and Sag (94), Head-Driven Phrase Structure Grammar, CSLI, Stanford. Xue, Pollard and Sag. (94), \"A New Perspective on Chinese Ziji\". Proceedings of the West Coast Co,!ference on Formal Linguistics, vol. 13, CSLI, Stanford."]},{"title":"185","paragraphs":[]}]}
