{"sections":[{"title":"Accumulation of Lexical Sets: Acquisition of Dictionary Resources and Production of New Lexical Sets DOAN-NGUYEN","paragraphs":["Hai","GETA - CLIPS - IMAG","BP 53, 38041 Grenoble, France","Fax: (33) 4 76 51 44 05 - Tel: (33) 4 76 63 59 76 - E-mail: Hai.Doan-Nguyen@imag.fr Following is the abstract written in Vietnamese:"]},{"title":"T6m t~t","paragraphs":["Trong bM n~y, chang toi trlnh b~y mot cOng tr~nh v~ ffch lu~ cdc ta.p h.op tit v.tmg, bao gbm s.~ thu h'Oi cdc thi nguyen tit die'n v~ s.tr s~n sinh cdc t.~p h.op tit v.trng m6i. Phttong phdp thu h'Oi s{t du.ng mot bo. djch theo ca phdp phi nggt cdnh vh cdc k~ thu.at s~a ddi van bhn, da chang tO d~ ddng, linh ho.at vh hiCu quh. Trdn ca s(r phan rich cdc lo.ai hinh sdn sinh cdc t.~p h.op tit v.~ng m6i, chang tOi d~ ra cdc thao tdc ca bdn vh thid't la.p mot ca chd\" hlnh thgtc giap mO th vh th.u'c hiCn vi¢c sdn sinh. V6i cdc ph~ong phdp vh cOng cu. tr~n, khohng 1,7 triCu don vi tit v.tmg da d~qc thu hbi vh shn sinh tit cdc ngubn tit did'n thuo.c nhi~u 1o.ai vh dO. ph~c tap khdc nhau. Cang trong bhi nhy, chang tOi d~ nghi. mO.t phttong cdch td chic dO.ng vh c6 tinh tO\" h.op cho cdc he thong tit v.tmg, d.tta trdn khdi niCm ffch luy ho vh cdc cap tritu ttt.ong hod c{ta t~.p h.op tit v.ung.","Dohn Nguydn Hhi Following is the abstract written in French:"]},{"title":"R6sum6","paragraphs":["Cet article pr~sente notre travail sur l'accumulation d'ensembles lexicaux qui comprend l'acquisition de ressources dictionnairiques et la production de nouveaux ensembles lexicaux. La mdthode pour l'acquisition, utilisant un traducteur hors-contexte gouvern~ par la syntaxe et des techniques de modification de texte, se montre flexible, efficace et facile ?, utiliser. Des operations de base sont propos~es qui forment un formalisme de spdcification et d'impl~mentation de processus de production. Environ 1,7 million unit~s lexicales ont ~t~ r~cup~r~es et produites ?, partir de dictionnaires de types et de complexit~s diff~rents. Nous proposons aussi une organisation combinatoire et dynamique pour les syst~mes lexicaux, bas~e sur la notion d'accumulation virtuelle et sur des niveaux d'abstraction d'ensembles lexicaux. 335"]}]}
