{"sections":[{"title":"Generative Power of CCGs with Generalized Type-Raised Categories Nobo Komagata","paragraphs":["Department of Computer and Information Science","University of Pennsylvania","Philadelphia, PA 19104","komaga t a@ 1 inc. c i s. upenn, edu"]},{"title":"Abstract","paragraphs":["This paper shows that a class of Combinatory Categorial Grammars (CCGs) augmented with a linguistically-motivated form of type raising involving variables is weakly equivalent to the standard CCGs not involving variables. The proof is based on the idea that any instance of such a grammar can be simulated by a standard CCG."]},{"title":"1 Introduction","paragraphs":["The class of Combinatory Categorial Grammars (CCG-Std) was proved to be weakly equivalent to Linear Index Grammars and Tree Adjoining Grammars (Joshi, Vijay-Shanker, and Weir, 1991; Vijay-Shanker and Weir, 1994). But CCG-Std cannot handle the generalization of type raising that has been used in accounting for various linguistic phenomena including: coordination and extraction (Steedman, 1985; Dowty, 1988; Steedman, 1996), prosody (Prevost and Steedman, 1993), and quantifier scope (Park, 1995). Intuitively, all of these phenomena call for a non-traditional, more flexible notion of constituency capable of representing surface structures including \"(Subj V) (Obj)\" in English. Although lexical type raising involving variables can be introduced to derive such a constituent? unconstrained use of variables can increase the power. For example, a grammar involving (T\\z)/(T\\v) can generate a language"]},{"title":"A\"B\"C\"D\"E\"","paragraphs":["which CCG-Std cannot (Hoffman, 1993).","This paper argues that there is a class of grammars which allows the use of linguistically-motivated form of type raising involving variables while it is still weakly equivalent to CCG-Std. A class of grammars, CCG-GTRC, is introduced in the next section as an extension to CCG-Std. Then we show that CCG-GTRC can actually be simulated by a CCG-Std, proving the equivalence.","°Thanks to Mark Steedman, Beryl Hoffman, Anoop Sarkar, and the reviewers. The research was supported in part by NSF Grant Nos. IRI95-04372, STC-SBR-8920230, ARPA Grant No. N66001-94-C6043, and ARID Grant No. DAAH04-94-G0426.","IOur lexieal rules to introduce type raising are non-recursive and thus do not suffer from the problem of the overgeneration discussed in (Carpenter, 1991). 2 CCGs with Generalized Type-Raised Categories In languages like Japanese, multiple NPs can easily form a non-traditional constituent as in \"[(Subj I Objl) & (Subj2 Obj2)] Verb\". The proposed ~ammars (CCG-GTRC) admit lexical type-raised categories (LTRC) of the form \"1\"/(T\\a) or'l'\\ (T/a) where T is a variable over categories and a is a constant category (Const). 2 Then, composition of LTRCs can give rise to a class of categories having the formT/(T\\a"]},{"title":".... \\at)","paragraphs":["or T\\"]},{"title":"(T/a .... /at),","paragraphs":["representing a multiple-NP constituent exemplified by \"Subjl Objt\". We call these categories generalized type-raised categories (GTRC) and each"]},{"title":"ai","paragraphs":["of a GTRC an argument (of the GTRC).","The introduction of GTRCs affects the use of combinatory rules: functional application \">: z/y + y ---, z\" and generalized functional composition \">B ~ (x) :"]},{"title":"z/y + ylzt ...[zk","paragraphs":["---","zlzl ...[z~\" where k is bounded by a","grammar-dependent"]},{"title":"kma~ as","paragraphs":["in CCG-Std. 3 This paper assumes two constraints defined for the grammars and one condition stipulated to control the formal properties.","The following order-preserving constraint, which follows more primitive directionality features (Steedman, 1991), limits the directions of the slashes in GTRCs. (1) In a GTRC \"1\"[o"]},{"title":"(T[,a ....","paragraphs":["Ira,), the direction of [0 must","be the opposite to any of In, ..., ]b","This prohibits functional composition '>B×' on","'GTRC+GTRC' pairs so that"]},{"title":"\"T/(T\\A\\B) + U\\(U/C/D)\"","paragraphs":["does not result in"]},{"title":"T\\ (T\\A\\B/C/D)","paragraphs":["or U/(UIC/D\\A\\B). That is, no"]},{"title":"movement","paragraphs":["of arguments across the functor is allowed. The variable constraint states that: (2) Variables are limited to the defined positions in","GTRCs.","This prohibits '>B k (×)' with k > I on the pair","2Categories are in the \"result-leftmost\" representation and associate left. Thus"]},{"title":"a/b/c","paragraphs":["should be read as"]},{"title":"(a/b)/c","paragraphs":["and returns"]},{"title":"a/b","paragraphs":["when an argument c is applied to its right. A ..... Z stand for nonterminals and a,...,z for complex, constant categories.","3There are also backward rules (<) that are analogous to forward rules (>)."]},{"title":"Crossing","paragraphs":["rules where zt is found in the direction opposite of that of y are labelled with 'x'. 'k' represents the number of arguments being passed. '[' stands for a directional meta-variable for {/, \\}. 513 'Const+GTRC'. For example, '>B 2' on"]},{"title":"\"A/B +","paragraphs":["T/(TkC)\" cannot realize the unification of the form"]},{"title":"\"A/B +","paragraphs":["TrITe./(TtITz\\C)\" (with T = TilT,_) resulting in"]},{"title":"\"AIT,./(BITz\\C)\".","paragraphs":["In order to assure the expected generative capacity, we place a condition on the use of rules. The condition can be viewed in a way comparable to those on rewriting rules to define, say, context-free grammars. The bounded argument condition ensures that every argument category is bounded as follows: (3) '>B (x)' should not apply to the pair","'Const+GTRC'. For example, this prohibits"]},{"title":"\"A/ B + T~ (TkC....\\Ct) -- A/(B\\C,...\\Cl)\",","paragraphs":["where the underlined argument can be unboundedly large. These constraints and condition also tell us how we can implement a CCG-GTRC system without overgeneration. The possible cases of combinatory rule application are summarized as follows: (4) a. For 'Const+Const', the same rules as in CCG-Std","are applicable.","b. For 'GTRC+Const', the applicable rules are:","(i) >: e.g., \"T/(TkAkB) +"]},{"title":"SkAkB -- S\"","paragraphs":["(ii)"]},{"title":">B k","paragraphs":["(x): e.g.,"]},{"title":"\"T/(TkA\\B) + SkA\\BkC/D -. S\\C/D'\"","paragraphs":["c. For 'Const+GTRC', only '>' is possible: e.g.,"]},{"title":"\"S/ (S/ (S\\B)) +r/(T\\B) --, S\" d. For 'GTRC+GTRC', the possibilities are: (i) >:","paragraphs":["e.g.,"]},{"title":"\"T/(mx (S/A/B)) + Tk (T/A/B)","paragraphs":["(ii) >B: e.g., \"T/(T\\A\\B) + T/(T\\C\\D) -."]},{"title":"T/(TkAkB\\C\\D)\"","paragraphs":["CCG-GTRC is defined below where g, ta and ~a,rc represent the classes of the instances of CCG-Std and CCG-GTRC, respectively: Definition 1 Gatrc is the collection of"]},{"title":"G's","paragraphs":["(extension of"]},{"title":"a G E G, ta)","paragraphs":["such that:","l. For the lexical function f of G (from terminals to sets of categories), if a E f (a),"]},{"title":"f'","paragraphs":["may additionally include { (a, T/(T\\a)), (a, T\\ (T/a)) }.","2. G' may include the rule schemata in (4). The main claim of the paper is the following: Proposition 1 ~9*~e is weakly equivalent with ~,ta. We show the non-trivial direction: for any G' E Ggt~c, there is a"]},{"title":"G\" 6 ~,,a","paragraphs":["such that"]},{"title":"L (G') = L (G\").","paragraphs":["As G' corresponds to a unique G E ~,ta, we extend G\" from G to simulate"]},{"title":"G',","paragraphs":["then show that the languages are exactly the same."]},{"title":"3 Simulation of CCG-GTRC","paragraphs":["Consider a fragment of CCG-GTRC with a lexical function f such that f(a) = {A,T/(T\\A)},f(b) = { A, T/(TkA) }, f (¢) = {SNA\\B}. This fragment can generate the following two permutations: (5) a. ~ b ¢",",/(T\\a) +",">"]},{"title":"S\\A","paragraphs":["> $"]},{"title":"b. b a c","paragraphs":["r/(r\\B) + r/(r\\a) + s\\a\\8",".>BX S\\B",">","S Notice that (5b) cannot be generated by the original CCG-Std where the lexicon does not involve GTRCs. In order to (statically)"]},{"title":"simulate","paragraphs":["(5b) by a CCG-Std, we add"]},{"title":"S\\BkA","paragraphs":["to the value of f\" (c) in the lexicon of"]},{"title":"G'.","paragraphs":["Let us call this type of relation between the original"]},{"title":"S\\A\\B","paragraphs":["and the"]},{"title":"S\\B]\\A]","paragraphs":["wrapping, due to its resemblance to the new operation of the same name in (Bach, 1979). There are two potential problems with this simple augmentation. First, wrapping may affect unboundedly long chunks of categories as exemplified in (6). Second, the simulation may overgenerate. We discuss these issues in turn. (6) \"T/(T\\A)+T/(TkB)+...+T/(T\\A)+T/(T\\B)+","s\\a\\B...\\a\\B\\c - s\\c\" We need"]},{"title":"S\\~ -- \\AXB...kAkB 1","paragraphs":["which can be the result of unboundedly-long compositions, to simulate (6) without depending on the GTRCs. Intuitively, this situation is analogous to long-distance movement of C from the position left of"]},{"title":"SkAkB...kC","paragraphs":["to the sentence-initial position. In order to deal with the first problem, the following","key properties of CCG-GTRC must be observed:","(7) a. Any derived category is a combination of lexical","categories. For example,"]},{"title":"SkAkB\\A\\B...\\AkBkC","paragraphs":["may be derived from"]},{"title":"\"SkAkBkC + ... + SkAkBkS + SkAkBkS\"","paragraphs":["by '<B'.","b. Wrapping can occur only when GTRCs are involved in the use of'> Bkx ' and can only"]},{"title":"cross","paragraphs":["at most"]},{"title":"km~=","paragraphs":["arguments. Since there are only finitelymany argument categories, the argument(s) being passed can be encoded in"]},{"title":"afinite store.","paragraphs":["For derivable categories bounded by the maximum number of arguments of a lexical category, we add all the instances of wrapping required for simulating the effect of GTRC into the lexicon of G\". For the unbounded case, we extend the lexicon as in the following example: (8) a. For a category"]},{"title":"S\\A\\B\\C,","paragraphs":["add"]},{"title":"S{\\c}\\AkB","paragraphs":["to the lexicon.","b. For"]},{"title":"SkA\\BkS,","paragraphs":["add"]},{"title":"S{\\c}\\A\\BkS{\\c}, S\\A\\B\\C\\S{\\c} ..... S\\C~\\S{\\c}. S{\\c}","paragraphs":["is a new category representing the situation where \\C is being passed across categories. Thus \\C which originatedin"]},{"title":"SkAkB\\C","paragraphs":["in (a) may be passed onto another 514 category in (b), after a possibly unbounded number of compositions as follows:"]},{"title":"(9)","paragraphs":["S{\\c}\\A\\B + S{\\c}\\A\\B\\S{\\c}+ ... +"]},{"title":"S\\~S{\\c}","paragraphs":["-.-"]},{"title":"S\\GJ \\A\\B...\\A\\B\\A\\B","paragraphs":["Now, both of the permutations in (5) can be derived in this extension of CCG-Std. The finite lexicon with finite extension assures the termination of the process. This covers the case (4bii).","Case (4e) can be characterized by a general pattern"]},{"title":"\"cl (hi (b\\ak...\\a,))","paragraphs":["+ T/(T\\ak...\\a,) --* c\" where T = b. Since any argument category is bounded, we can add"]},{"title":"b/(b\\ak...\\a~) 6 f'","paragraphs":["(al...a,) in the lexicon as an idiom. The other cases do not require simulation as the same string can be derived in the original grammar.","The second problem of overgeneration calls for another step. Suppose that the lexicon includes jr(c) ="]},{"title":"{S\\A\\B},","paragraphs":["f(d) ="]},{"title":"{S\\B\\A},","paragraphs":["and f(e) ="]},{"title":"{E\\(S\\B\\A)}","paragraphs":["and that"]},{"title":"S\\BF~","paragraphs":["is added to f(c) by wrapping. To avoid generating an illegal string \"c e\" (in addition to the legal \"de\"), we label the state of wrapping as"]},{"title":"S\\Bt+~o,~pl[ \\A~+,~,.~,p] t The","paragraphs":["original entries can be labelled as"]},{"title":"S\\Bt ....","paragraphs":["p]\\A[ .... pj and"]},{"title":"E\\ (S\\B[","paragraphs":[".... pj\\A[ .... pl). The lexical, argument categories, e.g., A, are underspecified with respect to the feature. Since finite features can be folded into a category, this can be written as a CCG-Std without features."]},{"title":"4 Equivalence of the Two Languages Proposition","paragraphs":["I can be proved by the following lemma (as a special case where c = S): Lemma 1 For any G' 6 Ggtre (an extension of G), there is a G\" 6 ~,td such that a string w is derivable from a constant category c in G' iff (~) w is derivable from c in Gll • The sketch of the proof goes as follows. First, we construct G\" from G' as in the previous section. Both directions of the lemma can be proved by induction on the height of derivation. Consider the direction of '---.'. The base (lexical) case holds by definition of the grammars. For the induction step, we consider each case of rule application in (4). Case (4a) allows direct application of the induction hypothesis for the substructure of smaller height starting with a constant category. Other cases involve GTRC and require sublemmas which can be proved by induction on the length of the GTRC. Cases (4hi, di) have a differently-branching derivation in G\" but can be derived without simulation. Cases (4bii, c) depend on the simulation of the previous section. Case (4dii) only appears in sublemmas as the result category is GTRC. In each sublemma, the induction hypothesis of Lemma 1 is applied (mutually recursively) to handle the derivations of the smaller substructures from a constant category.","A similar proof is applicable to the other direction. The special cases in this direction involves the feature"]},{"title":"[+wrap]","paragraphs":["and/or the new categories of the form 'z{...}' which record the argument(s) being passed. As before, we need sublemmas to handle each case. The proof of the sublemma involving the 'z{...}' form can be done by induction on the length of the category."]},{"title":"5 Conclusion","paragraphs":["We have shown that CCG-GTRC as formulated above is weakly equivalent to CCG-Std. The results support the use of type raising involving variables in accounting for various linguistic phenomena. Other related results to be reported in the future include: (i) an extension o[ the polynomial parsing algorithm of (Vijay-Shanker and Weir, 1990) for CCG-Std to CCG-GTRC (Komagata, 1997), (ii) application to a Japanese parser which is capable of handling non-traditional constituents and information structure (roughly, topic/focus structure). An extension of the formalism is also being studied, to include lexica/type raising of the form T/(T\\c)"]},{"title":"ld~...Id~","paragraphs":["for English prepositions/articles and Japanese particles."]},{"title":"References","paragraphs":["Bach, Emmon. 1979. Control in Montague grammar."]},{"title":"Lingui- stic Inquiry,","paragraphs":["10.","Carpenter, Bob. 1991. The generative power of Categorial Grammars and Head-driven Phrase Structure Grammars with lexical rules."]},{"title":"ComputationalLinguistics,","paragraphs":["17.","Dowty, David. 1988. Type raising, functional composition, and non-constituent conjunction. In Richard Oehrle et al., editors,"]},{"title":"Categorial Grammars and Natural Language Struc- tures.","paragraphs":["D. Reidel.","Hoffman, Beryl. 1993. The formal consequences of using variables in CCG categories. In"]},{"title":"ACL31.","paragraphs":["Joshi, Aravind, K. Vijay-Shanker, and David Weir. 1991. The convergence of mildly context-sensitive grammatical formalisms. In Peter Sells et al., editors,"]},{"title":"Foundational Issues in Natural Language Processing.","paragraphs":["MIT Press, pages 31-81. Komagata, Nobo. 1997. Efficient parsing of CCGs with generalized type-raised categories. Ms. University of Pennsylvania. Park, Jong C. 1995. Quantifier scope and constituency. In"]},{"title":"ACL33.","paragraphs":["Prevost, Scott and Mark Steedman. 1993. Generating contextually appropriate intonation. In"]},{"title":"EACL6.","paragraphs":["Steedman, Mark J. 1985. Dependency and coordination in the grammar of Dutch and English."]},{"title":"Language,","paragraphs":["61:523-56.","Steedman, Mark. 1991. Type-raising and directionality in Combinatory Grammar. In"]},{"title":"ACL29.","paragraphs":["Steedman, Mark. 1996."]},{"title":"Surface Structure and Interpretation.","paragraphs":["MIT Press.","Vijay-Shanker, K. and David J. Weir. 1990. Polynomial time parsing of Combinatory Categorial Grammars. In"]},{"title":"ACL28.","paragraphs":["Vijay-Shanker, K. and D. J. Weir. 1994. The equivalence of four extensions of context-free grammars."]},{"title":"Mathematical Systems Theory,","paragraphs":["27:511. 515"]}]}
