{"sections":[{"title":"Briefly Noted Books Received","paragraphs":["book itself persistently uses an ASCII hyphen where longer, non-ASCII dashes would be correct.) Nor does the lengthy chapter on text formatting include discussion of good or bad typography or layout, or what features such systems need for the user to achieve attractive documents. (The book's typesetting is not too bad, but the leading is a tad too tight, the paragraph spacing two tads too loose. The layout is based on the elegant MIT Press house style, but there are many widows and orphans, and figures are often very poorly placed and hard to distinguish from the text.)","The book is oriented strongly toward Unix and its textprocessing tools. Although primarily intended as an undergraduate textbook (pun unavoidable), it may also serve as a useful reference work for its summary of techniques in encryption, hyphenation, and the like.--G.H. BOOKS RECEIVED Books listed below that are marked with a ~r will be reviewed in a future issue.","Authors and publishers who wish their books to be considered for review in"]},{"title":"Computational Linguistics","paragraphs":["should send a copy to the book review editor, Graeme Hirst, Department of Computer Science, University of Toronto, Toronto, Canada M5S 1A4. All books received will be listed, but not all can be reviewed.","Readers who wish to review books for the journal should write, outlining their qualifications, to the book review editor at the address above. Obviously, we cannot promise the availability of books in anyone's exact area of interest.","i'PC-KIMMO: A Two-Level Processor for Morphological Analysis Evan L. Antworth (Summer Institute of Linguistics) Dallas: Summer Institute of Linguistics, 1990, xii + 273 pp. and disks for IBM PC or Macintosh (Occasional publications in academic computing, number 16) Paperbound, ISBN 0-88312-639-7, $23.00","Naturally Intelligent Systems Maureen Caudill and Charles Butler Cambridge, MA: The MIT Press, 1990, ix + 304 pp. Hardbound, ISBN 0-262-03156-6, $19.95","Proceedings of the Eighth West Coast Conference on Formal Linguistics, Vancouver, February 1989 E. Jane Fee and Katherine Hunt (eds.) Stanford: Stanford Linguistics Association, 1989, viii + 478 pp. (Distributed by the University of Chicago Press) Paperbound, ISBN 0-937073-45-8, $19.95","Artificial Intelligence: Its Scope and Limits James H. Fetzer (University of Minnesota, Duluth) Dordrecht\" Kluwer Academic Publishers, 1990, xvii + 338 pp. (Studies in cognitive systems 4) Hardbound, ISBN 0-7923-0505-1, $63.00, Dfl 160.00, £53.00","A Theory of Content and Other Essays Jerry A. Fodor (Rutgers and CUNY Graduate Center) Cambridge, MA: The MIT Press, 1990, xii + 270 pp. Hardbound, ISBN 0-262-06130-9, $29.95","tPractical SGML Eric van Herwijnen (CERN) Dordrecht: Kluwer Academic Publishers, 1990, xviii + 307 pp. Paperbound, ISBN 0-7923-0635-X, $39.95","tA Computational Model of Metaphor Interpretation James H. Martin (University of Colorado at Boulder) Boston: Academic Press, 1990, xxiii + 229 pp. (Perspectives in artificial intelligence 8) Hardbound, ISBN 0-12-474730-2","tMathematical Methods in Linguistics Barbara H. Partee, Alice ter Meulen, and Robert E. Wall (University of Massachusetts, Amherst; University of Washington; a.nd University of Texas, Austin) Dordrecht: Kluwer Academic Publishers, 1990, xx + 663 pp. (Studies in linguistics and philosophy 30) Hardbound, ISBN 90-277-2244-7, $99.00, Dfl 225.00, £79.00","The Foundations of Artificial Intelligence: A Sourcebook Derek Partridge and Yorick Wilks (eds.) (University of Exeter and New Mexico State University) Cambridge, UK: Cambridge University Press, 1990, xiv + 498 pp. Hardbound, ISBN 0-521-35103-0, $59.50; Paperbound, ISt3N 0-521-35944-9, $22.95","Relatlviized Minimality Luigi Rizzi (University of Geneva) Cambridge, MA: The MIT Press, x + 147 pp. (Linguistic Inquiry monographs 16) Paperbound, ISBN 0-262-68061-0, $14.95","Predstavlenie i Analiz Smysla v Intellektualftykh Informatsionnykh Sistemakh [Representation and Analysis in Intelligent Information Systems] V.Sh. Rubashkin (Problemy Iskusstvennogo Intellekta [Problems in Artificial Intelligence]) Moscow: Glabnaya Redaktskiya, Fiziko-Matematicheskoy Literatury, 1989, 190 pp. Hardbound, ISBN 5-02-014213-1","Logic: Programming: Proceedings of the Seventh International Conference David H.D. Warren and Peter Szeredi (eds.) (University of Bristol) Cambridge, MA: The MIT Press, 1990, xviii + 788 pp. Paperbound, ISBN 0-262-73090-1, $55.00","Artificial Intelligence at MIT: Expanding Frontiers Patrick Henry Winston with Sarah Alexandra Shellard (eds.) (Mrr) Cambridge, MA: The MIT Press, 1990, xix + 656 pp. (Vol. 1), xvii + 634 pp. (Vol. 2) (Artificial intelligence series) Hardbound, ISBN 0-262-23150-6 (Vol. 1), 0-262-23151-4 (Vol. 2), 0-262-23154-9 (the set), $35.00 per volume, $70.00 the set 246 Computational Linguistics Volume 16, Number 4, December 1990"]}]}