{"sections":[{"title":"ABSTRACTS OF CURRENT LITERATURE Selected Dissertation Abstracts","paragraphs":["Compiled by: Susanne M. Humphrey National Library of Medicine Bethesda, MD 20209 Bob Krovetz University of Massachusetts Amherst, MA 01002 The following are citations selected by title and abstract as being related to computational linguistics or knowledge representation, resulting from a computer search, using the BRS Information Technologies retrieval service, of the Dissertation Abstracts International (DAI) database produced by University Microfilms International. Included are the UM order number and year-month of entry in'to the database; author; university, degree, and, if available, number of pages; title; DAI subject category chosen by the author of the dissertation; and abstract. References are sorted first by DAI subject category and second by author. CitalSons denoted by an MAI reference do not yet have abstracts in the database and refer to abstracts in the published Masters Abstracts International. Unless otherwise specified, paper or microform copies of dissertations may be ordered from: University Microfilms International Dissertation Copies Post Office Box 1764 Ann Arbor, MI 48106 telephone for U.S. (except Michigan, Hawaii, Alaska): 1-800-521-2;042 for Canada: 1-800-268-6090. Price lists and other ordering and shipping information are in the introduction to the published DAI. An alternate source for copies is sometimes provided at the end of the abstract. The dissertation titles and abstracts contained here are published with permission of University Microfilms International, publishers of Dissertation Abstracts International (copyright by University Microfilms International), and may not be reproduced without their prior permission. A Knowledge-Based Electronic Messaging System: Framework, Design, Prototype Development, and Validation DAI V50(05), SecA, pp1121 Motiwalla, Luvaifazlehusen, The University of Arizona Ph.D. 1989, 229 pages Information Science. Business Administration, Management. Mass Communications. University Microfilms International ADG89-19049 NEW REPORTS AND ][EMOS Although electronic: messaging systems (EMSs) are an attractive business communication medium, several studies on the usage and impact of EMSs have shown that depsite the benefits, they have been generally used for routine and informal communication activities. Theoretically, EMS, s have yet to find their niche in organizational communications. Technically, EMS designs are not flexible to support communication activJlties of managers, are not maintainable to permit easy integration with other office applications and access to information from data/knowledge bases, and are not easily extendible beyond the scope of their initial design. Behaviorally, end users are not directly involved in the development of EMS.","This dissertation attempts to bridge the transition of EMS technology from message processing systems to communication support systems. First, the dissertation provides an analysis for a knowledge-based messaging system (KMS) through a framework. The framework provides a theoretical basis to link management theory to EMS technology. It suggests that the communication needs of the managers vary depending on the activity level, implying rdated variations in EMS functionality.","Second, the dissertation provides a design for the KMS through an 126 Computational Linguistics Volume 16, Number 2, June 1990 Abstracts of Current Literature Utilization of Expert Systems in Selected Industries DAI V50(05), SecA, ppl123 Wilson, Connie Ann Oklahoma State University Ed.D. 1988, 181 pages Information Science. Scope and method of study. University Microfilms International ADG89o15050 Prominence Relations and Structure in English Compound Morphology DAI V50(03), SeeA, pp675 Bates, Dawn E University of Washington Ph.D. 1988, 272 pages Language, Linguistics. University Microfilms International ADG89-11609 architecture that incorporates the design and implementation issues such as flexibility, maintainability, and extendibility. The superimposition of the KMS on an existing EMS provides flexibility, the loose coupling between the KMS-interface components and the KMS functions increases its maintainability, and the strong functional decomposition and cohesion enhances the extendibility of the system beyond the scope of its initial design.","Finally, the dissertation provides an implementation through the development of a prototype KMS that involves users into the design process through a validation study conducted at the University of Arizona. The prototype used GDSS tools in eliciting message attributes for the personal knowledge base. This method proved effective in reducing the bottleneck observed in the acquisition of knowledge simultaneously from multiple experts. Similarly, the combination of observation with interviews proved effective in eliciting the organizational knowledge base. The validation method measured the system's accuracy (which was very accurate) in prioritizing messages for the users. This study was designed as a descriptive study to determine the extent of use of expert systems in industry and to obtain quantitative information concerning the present and future effect and utilization of expert systems' applications in industry. Data were obtained from the Fortune 500 businesses in the United States concerning their utilization of expert systems' applications. Findings and conclusions. Even though respondents indicated employment in relatively large businesses, according to annual gross revenue and number of company employees, the majority of companies spent less than $100,000 on expert systems development and maintenance. Currently, low numbers of respondents are utilizing expert systems' applications, with diagnostics as the most often utilized application. There is considerable difference of opinion regarding the utilization of expert systems, the required expert systems skills of existing employees, and the current expert systems' applications in various types of industry. This work presents an analysis of English compounding that integrates the advances of recent morphological theory with a detailed metrical account of compound stress. It is argued that theories of compound structure should be developed in tandem with explicit accounts of the phonological behavior unique to compounds, and that this has not been done adequately to date.","The phonological analysis is couched in a grid-based metrical framework, and the stress rules are expressed in terms of morphologically sensitive templates whose function is to augment the lexical grids of compound constituents. Crucial use is made of the notion of a general default compound stress rule and a limited number of rules that can assign nondefault prominence in certain morphological environments. A literature review and critique traces the treatment of compound stress from the beginnings of generative phonology to the present, and argues that the analysis presented here is the one most consistent with contemporary assumptions concerning the interaction of phonological and morphological rules.","The structural analysis is set in the framework of Selkirk (1982), and synthesizes the contributions of Selkirk (1984) and Zwicky (1986), as well as capturing heretofore unnoticed generalizations about compound morphology. Computational Linguistics Volume 16, Number 2, June 1990 127 Abstracts of Current Literature The Syntax and Semantics of 'Have' and Its Complements DAI V50(04), SecA, pp935 Brugman, Claudia Marlea University of California, Berkeley Ph.D. 1988, 235 pages Language, Linguistics. University Microfilms International ADG89-16596 Discourse and the Syntax of Multiple Constituent Questions DAI V50(03), SecA, pp676 Comorovski, lleana Cornell University Ph.D. 1989, 235 pages Language, Linguistics. University Microfilms International ADG89-15178","A detailed investigation of adjectives in English compounds reveals distinctions between lexical processes and processes of the phrasal syntax that have not appeared in such a highly articulated form in the literature; these argue :for a separate lexical component and against some influential analyses that allow syntax to feed compounding. A discussion of coordination inside ,compounding (salt and pepper shakers) further supports a purely morphological analysis of compounding. The verb HAVE heads a diverse set of distinct but related syntactic constructions in Engllislh. The dissertation shows how these constructions are related to one another and how those relations can be expressed via a multidimensional network of senses.","The distinctness of the constructions can be seen in a sentence such as \"I had my moped stole:n,\" which is ambiguous in three ways. We can detect the presence of ~Lhree constructions here by noting that the ambiguity cannot be resolved either by making reference to different constituent structures or by assigning different meanings to its individual constituents (particularly HAVE). Instead, the semantic differences lie at the level of the cortsl~ruction.","The inventory of HAVE-constructions includes the semantic subtypes Causative, Resultant State/Event, \"Depictive,\" Attributive-Existential, and Affecting Event. I show that these all instantiate a single constructional schema,, though they cannot be reduced to that schema. I also show that the complex semantics of individual constructions is a product of three dimensions of simple semantic factors: the semantics of individual constituents, of constructions as a whole, and of the use of constructions in larger environments. This dissertation examines the role played by Discourse-linking in the syntax of two types of multiple wh-constructions: multiple constituent questions and questions formed by fronting out of a wh-complement. Related explanations are offered for why Discourse-linking cancels Superiority effects in the former and wh-island effects in the latter. The account is worked out principally on data from Romanian, a Romance language that permits :multiple wh-fronting. Parallels are drawn between the Romanian multiple, wh-constructions and their counterpart in English, where at least one of the wh-phrases has to stay in situ.","Chapters II and III offer a modular account of the restrictions on the order of wh-phrases in Romanian: those at work in both echo and standard questions are attributed to the ECP; those that constrain standard questions only are attributed to a semantic/pragmatic condition on questions, which requires them to be answerable. A question is defined to be answerable if its presupposition is satisfied. Multiple questions are shown to have a conditional-type presupposition, in which the wide scope wh-phrase is associated with a universal quantifier. This presupposition is shown to be satisfied only by questions whose wide scope wh..phrase is Discourse-linked (e.g. which); hence, in Romanian, the first wh-phrase, which is also the wide scope one, must be Discourse-linked. A parallel account explains why Discourse-linking cancels Superiority effects in English.","Chapter IV explains why only Discourse-linked wh-phrases can be questioned out of wh-complements. Questions formed by such extractions are shown to presuppose that the set over which the extracted wh-phrase ranges has. more than one member. If the extracted wh-phrase is non-Discourse-linked, the set over which it ranges is of nondeterminate membership; hence, in violation of the condition put forth in Chapter III, it is impossible to tell whether the presupposition of the question is satisfied and the question is answerable or not. 128 Computational Linguistics Volume 16, Number 2, June 1990 Abstracts of Current Literature The Stony Idiom of the Brain: A Study in the Semantics and Syntax of Metaphors DAI V50(04), SecA, pp937 Fong, Heatherbell Nancy University of California, San Diego Ph.D. 1988, 256 pages Language, Linguistics. University Microfilms International ADG89-14184 The Comprehension of Metaphor by Preschool Children: Implications for a Theory of Lexicon DAI V50(03), SecA, pp677 Pearson, Barbara Zurer University of Miami Ph.D. 1988, 224 pages Language, Linguistics. Education, Early Childhood. University Microfilms International ADG89-10905","In the last chapter, Discourse-linked wh-NPs are assimilated to the class of strong NPs. It is proposed that the definiteness effect that arises in English existential sentences is a result of the interaction between discourse factors and the nature of the determiner of the postcopular NP. The dissertation opens with a brief review of some of the influential extant views of metaphor. The review shows where these different views converge and where they diverge with respect to five fundamental questions: Is metaphor 'linguistic' or 'cognitive'? Is metaphor 'special' or 'normal' language use? What kind of associations are made among words in a metaphorical expression? What is the importance of metaphorical implication? Does metaphor create a 'third something' out of its basic terms?","The questions are answered after an investigation of many different metaphors, using Ronald W. Langacker's theory of Cognitive Grammar. In Cognitive Grammar, semantics is encyclopedic: words are characterized with reference to cognitive domains. Using this notion, it is a simple matter to show that metaphor involves the close and unconventional associating of two different domains. It is hypothesized in this dissertation that the making of a metaphor involves the formation of a hybrid domain from the two (or more) domains involved in its interpretation.","Evidence for the hybrid domain hypothesis is adduced from the use of 'linking' words such as is, of, make, his, and such in poetic metaphors. Their standard semantics and syntax are not only retained in the metaphor, but are actually exploited by the poet to bring together the two concepts that s/he wants the reader to associate. More evidence is found in the metaphors of everyday speech, such as ARGUMENT IS WAR and LANGUAGE IS A CONDUIT. In these metaphorical systems, it is possible to come up with 'ungrammatical' metaphors, which implies that there is some conventionally limited domain characterizing the expressions of the metaphor in a quasi-literal way.","The original questions are answered in the following way: apprehension of metaphor is not confined to language use, but is a normal part of cognition. Within language, metaphor is phenomenologically and syntactically normal: sometimes, and to varying degrees, it is semantically bizarre. Implication is a defining characteristic of poetic metaphor. If there is a 'third something' created by metaphor, it might be described as a hybrid domain. Comprehension of metaphor in preschoolers was studied through an elicited repetition task. Subjects were 52 children ages 3;0 to 5;2. Repetition performance on metaphors was compared with repetitions of semantically well-formed literal sentences as well as semantically anomalous sentences, all matched for length, vocabulary, and sentence structure. Accuracy on literal and metaphoric stimuli were comparable, and both were significantly better than performance on anomalous sentences. There were no effects for age or sex. It was shown that the metaphors were not semantically anomalous to the children and that they were processed on a par with literal language. The argument is advanced from a review of the literature that imitation implicates understanding of the material imitated.","If metaphor is thus shown to emerge early in the child's linguistic repertory, figurative language, it may be argued, occupies a more central position in linguistic theory than it has been accorded.","The implications of this reassessment of the role of figurative language were examined in the framework of the philosophy of language and of Computational Linguistics Volume 16, Number 2, June 1990 129 Abstracts of Current Literature Varieties of Questions in English Conversation: A Study of the Role of Morphosyntax in Declarative and Nonclansai Forms DAI V50(04), SecA, pp941 Weber, Elizabeth Gean University of California, Los Angeles Ph.D. 1989, 331 pages Language, Linguistics. Speech Communication. University Microfilms International ADG89-14067 Sonority Constraints on Prosodic Structure DAI V50(03), SecA, pp678 Zec, Draga Stanford University Ph.D. 1989, 267 pages Language, Linguistics. University Microfilms International ADG89-12390 computational lingu~sl:ics, and the argument for a dynamic lexicon was put forward. The many-to-many relation that holds between morphosyntactic form and communicative function has long been noted by linguists and philosophers interested in language use. A single comrr, unicative function can be realized by many different syntactic forms, and a single syntactic form can r(,~alize several different functions in the appropriate discourse contexts. The production and interpretation of utterances with regard to function, tlmen, is a problematic issue that requires some explanation. In other words, how do speakers know how to encode the messages they intend, and how do recipients interpret those messages correctly with regard to their function? The present study will address this issue by examining the role of morphosyntax in the interpretation of declarative and noncla.usal questions in English conversation.","While interrogative forms are typically associated with question function, declarative and nonclausal questions are not uncommon in conversation. On the basis of the literature, one can assume that these so-caUed atypical questions do not correlate regularly with morphosyntactic markers associated with question function. The literature clearly maintains that such correlations do not exist and treats that lack as a problematic issue. An examination of naturally occurring conversational discourse reveals, however, that nontypical question forms do correlate regularly with morphosyntactic markers associated with question function. Moreover, morphosyntactic form correlates with communicative function on two different levels of analysis. The correlation exists at the general functional level of doing questioning. It also exists at a level of more subtle functional analysis, i.e., a level at which specific functional types of questions are described. In other words, declarative clailses and nonclausal forms correlate with different kinds of specific functional types of questions. The form/function correlations that are exhibited in this study are not arbitrary. It is shown that the specific patterns of morphosyntactic marking that characterize declarative and nonclausal questions respectively are functionally motivated. This study shows that morphosyntactic form correlates strongly with both question function in general and more specific functional types of questions. In the light of the correlations of declarative and nonclausal forms with specific question types, it is clear that further elaboration of discourse function is required for statements of typicality with rega:rd to doing questioning in conversation. The form/function correlaltions exhibited in this work have significant implications for language processing (interpretation), language acquisition (learning), and the study of language universals. The goal of this dissertation is to argue for a prosodic hierarchy with the mora, rather than the syllable, as its lowest unit. This idea is developed within the framework of lexical phonology and morphology, which includes rules and constraints pertinent to prosodic structure.","The arguments for the prosodic status of the mora are presented in two steps. First, it is sbown that the mora should be assigned the status of a primitive constituent in subsyllabic structure. This argument is based on the difference in sonority requirements on moras and on syllables. The standard assumption is that, if we think of segment inventories in terms of a sonority scale, syllabic segments, constituting the leftmost mora of a syllable, are a subset of the entire segment inventory. In this dissertation it is shown that segments constituting the rightmost mora, henceforth moraic segments, are also a subset of the entire segment inventory. These two subsets are in fact independent of 130 Computational Linguistics Volume 16, Number 2, June 1990 Abstracts of Current Literature Objectivity and the Evidence for a Davidsonian Theory of Meaning DAI V50(05), SecA, pp 1324, Larson, David University of Kansas Ph.D. 1988, 187 pages Philosophy. University Microfilms International ADG89-18387 A Pragmatic Structural Analysis of Conversations for Making Appointments DAI V50(04), SecB, pp1670 Goldthwaite, Danalee Simon Fraser University (Canada) Ph.D. 1988 Psychology, Experimental. This item is not available from University Microfilms International ADG05-65620 each other, and are determined on a language-particular basis. However, they stand in a fixed mutual relation: syllabic segments are always a subset of moraic segments. The subset relation between the syllabic and the moraic segments follows, as a necessary consequence of the representation of subsyllabic metrical structure with the mora as its primitive constituent.","The generalization about the two subsets of the segment inventory has the following desirable consequences: first, it establishes a range of possible language types. Second, it gives rise to various implicational relations between the possible types of closed syllables on the one hand, and the possible types of heavy syllables on the other. One such relation is Trubetzkoy's generalization about the implicational relation between CVV and CVC syllables.","Taking as a point of departure the independence of moraic and syllabic structure, two algorithms are proposed for building prosodic structure: one that creates moras, and one that groups moras into syllables. From this can be derived both the curvelike sonority properties of the syllable and the sonority constraints that hold between adjacent syllables.","The second step of the argument is a demonstration of the prosodic status of the mora, in the role of a prosodic licenser. The crucial evidence consists of cases with a simultaneous requirement for the presence of moraic structure and the absence of syllabic structure, as in Bulgarian and Serbo-Croatian. This thesis seeks to develop the account of natural language semantics found in the work of Donald Davidson. Special attention is given to the empirical character of theories of meaning, and Quine's theses of translational and referential indeterminacy are examined for their bearing on this. It is argued that a strict form of Davidson's principle of charity plays the essential role in making these theories empirical. The formal modifications Davidson makes to Tarski in the course of structuring theories of meaning after Tarskian theories of truth are identified, and a modified version of Convention T is provided. On the basis of the account of interpretation thus developed, the case is made that Davidson's argument against global skepticism is inadequate unless supplemented with his argument against incommensurable conceptual schemes. This latter argument is defended as being an argument for a notion of objectivity that rules out any interesting sort of correspondence theory of truth. Six studies examine conversational structure by applying a pragmatic analysis to two-party conversations. In Study IA, a subgoal achievement label was applied to each talking turn of 93 automatically tape-recorded telephone conversations between native English-speaking beauty salon receptionists and one confederate female caller trained to play a standardized, nonleading role in getting an appointment for a haircut. Chi square tests showed that these conversations have a subgoal structure and that some structures are more prevalent than others. Regularities were attributed to social and organizational problems that appointment-making presents.","Study IB obtained acceptable inter-rater reliability values of the Study IA structural assignments using a trained independent male observer whose agreement with the researcher was assessed.","Study IIA failed to provide evidence for knowledge of conversational subgoal structure among 83 female native English speakers who attempted to resequence two transcribed and scrambled Study I conversations. Computational Linguistics Volume 16, Number 2, June 1990 131 Abstracts of Current Literature","In Study IIB, 53 native English-speaking females rated three versions of both Study IIA conversations for naturalness. Chi square tests confirmed that the s~tbjects could reliably select the naturally occurring ones. The results are attributed to successful engagement of knowledge about conversational subgoal structure.","In a test of the mel~hodological and theoretical generalizability of Study IA, Study IIIA applied the subgoal structural analysis developed in Study IA to a set of 59 recorded telephone appointment-making conversations between acquaintances collected from one beauty salon. Chi square tests demonstrated that subgoal structure exists within this set and that some structures occur more frequently than others. These results confirmed predictions from Study IA data. Those predictions were based on the idea that conversational regularities are due to the operation of social artd organizational factors that influence conversational goal pursuit.","Study IIIB generated inter-rater reliability values for the Study IIIA structural assignments using the same trained independent observer from Study IB. High levels of agreement were obtained.","Overall, the research supported the conclusion that it is meaningful and useful to view conversations and the knowledge conversationalists have of them from a pragmatic perspective. A variety of extensions of this research are discussed. A Theory of Grammatical Intuition DAI V50(04), SecB, pp1674 Warner, John David Rutgers University The State University of New Jersey (New Brunswick) Ph.D. 1988, 117 pages Psychology, Experimental. University Microfilms International ADG89-14255 The purpose of this dissertation is to determine where grammatical intuitions come from. Grammatical intuitions have been considered a valuable source of data for both linguists and psychologists, but there has been some division over the source of these intuitions and the existence of a distinct level of syntactic representation. What position is adopted depends on which of two general theories of sentence comprehension one favors. In one class of theories, called syntax explicit, an autonomous syntactic representation is constructed prior to the processing of semantic information. The second class of theories, called syntax implicit, suggest that no distinct syntactic representation is constructed, but rather that a semantic representation of the sentences meaning is constructed.","A detailed syntax implicit spreading activation theory of sentence comprehension is proposed, based on the Logogen model of word recognition, and a number of clearly testable empirical predictions concerning grammatical intuitions are derived from the theory. The five experiments, in which subjects were asked to provide acceptability ratings for different types of sentences, fragments, and ungrammatical strings, provide data testing these predictions.","The results support the theory proposed, indicating that several kinds of information besides syntactic relations are incorporated into subjects' grammatical intuitions, and suggesting that a separate syntactic representation is unnecessary as an explanation of grammatical intuition. Finally, tlaese theories are discussed in light of other general theories of sentence: comprehension and cognition. 132 Computational Linguistics Volume 16, Number 2, June 1990"]}]}