{"sections":[{"title":"Book Reviews Books Received","paragraphs":["(Laughren). The collection is completed by two articles on psycholinguistic aspects (Lebeaux, and Carlson and Tanenhaus).","I am not a devotee of GB. As an outsider, I can only say that its practitioners would do well to look beyond the confines of their own circle to see what other authors in other frameworks have said about the issues addressed in this collection.--Harold Seiners, UMIST REFERENCES Levin, Beth (ed.) 1985 Lexical semantics in review. Lexicon Project Working Papers 1. Center for Cognitive Science, Massachusetts Institute of Technology, Cambridge, MA. Dirven, Ren~ and Radden, Gfinter (eds.) 1987 Concepts of Case (Studien zur englischen Grammatik 4). Gunter Narr Verlag, Tfibingen. Somers, H. L. 1987 Valency and Case in Computational Linguistics (Edinburgh Information Technology Series 3). Edinburgh University Press, Edinburgh. THEORETICAL ISSUES IN NATURAL LANGUAGE PROCESSING Yorick Wilks (ed.) (New Mexico State University) Hillsdale, N J: Lawrence Erlbaum Associates, 1989, xix + 243 PP. Hardbound, ISBN 0-8058-0183-9, $36.00; Softbound, ISBN 0-8058-0184-7, $17.50 This volume makes more widely available proceedings of the third conference on Theoretical Issues in Natural Language Processing (January 1987). This conference followed the unusual format of consisting entirely of panels of invited speakers, each of whom contributed a position paper written in advance. The volume of position papers was distributed by the Association for Computational Linguistics.","The present volume contains a number of these position papers, some of them revised by their authors, along with selected transcripts of the discussion. Subject and name indexes have been added.","The panels were the following:--Words and world representations (Walker, Boguraev, Amsler, Hobbs, Kegl); Unification and the new grammatism (Gazdar, Pulman, Joshi); Connectionist and other parallel approaches to natural language processing (Waltz, Cottrell, Charniak, McClelland, Lehnert); Discourse theory, goals, and speech acts (Perrault, Wilensky); Why has theoretical NLP made so little progress? (Sondheimer, Birnbaum); Formal versus commonsense semantics (Israel, Wilks, Sparck Jones); Reference: The interaction of language and the world (Appelt, Dahl, Kronfeld, Goodman); Metaphor (Gentner et al., Ortony and Fainsilber, Plantinga); Natural language generation (Joshi, McDonald, Appelt). BOOKS RECEIVED Books listed below that are marked with a * will be reviewed in a future issue.","Authors and publishers who wish their books to be considered for review in Computational Linguistics should send a copy to the book review editor at the address below. All books received will be listed, but not all can be reviewed.","Readers who wish to review books for the journal should write, outlining their qualifications, to the book review editor, Graeme Hirst, Department of Computer Science, University of Toronto, Toronto, Canada M5S 1A4. Obviously, we cannot promise the availability of books in anyone's exact area of interest.","*A Counectionist Approach to Word Sense Disambiguation Garrison W. Cottrell (University of California, San Diego) London: Pitman, and San Mateo, CA: Morgan Kaufmann Publishers, 1989, xi + 220 pp. (Research Notes in Artificial Intelligence) Paperbound, ISBN 0-934613-61-3, $24.95","*Generating Natural Language under Pragmatic Constraints Eduard H. Hovy (Information Sciences Institute, University of Southern California) Hillsdale, N J: Lawrence Erlbaum Associates, 1988, xiii + 214 pp. Hardbound, ISBN 0-8058-0248-7, $29.95; Softbound, ISBN 0-8058-0249-5, $19.95","*Learnability and Linguistic Theory Robert J. Matthews and William Demopoulos (eds.) (Rutgers University and University of Western Ontario) Dordrecht: Kluwer, 1989, vii + 217 pp. (Studies in Theoretical Psycholinguisties 9) Hardbound, ISBN 0-7923-0247-8, Dfl 130.-, $64.00, £42.00","*Metataxis in Practice: Dependency Syntax for Multilingual Machine Translation Dan Maxwell and Klaus Schubert (eds.) (BSO/gesearch, Utrecht) Dordrecht: Foris, 1989, 323 pp. (Distributed Language Translation 6) Hardbound, ISBN 90-6765-422-1, $55.00, Dfl 110.-; Softbound, ISBN 90-6765-421-3, $26.00, Dfl 52.-.","A General Explanation-Based Learning Mechanism and Its Appfication to Narrative Understanding Raymond J. Mooney (University of Illinois) London: Pitman, and San Mateo, CA: Morgan Kaufmann Publishers, 1990, x + 166 pp. (Research Notes in Artificial Intelligence) Paperbound, ISBN 1-55860-091-4, $24.95","An Invitation to Cognitive Science. Volume 1: Language Daniel N. Osherson and Howard Lasnik (Massachusetts Institute of Technology and University of Connecticut) (eds.) Cambridge, MA: The MIT Press, 1990, xix + 273 pp. Hardbound, ISBN 0-262-15035-2, $37.50; Softbound, ISBN 0-262-65033-9, $18.95","Foundations of Cognitive Science Michael I. Posner (ed.) (University of Oregon) Cambridge, MA: The MIT Press, 1990, xiv + 888 pp. Hardbound, ISBN 0-262-16112-5, $45.00","*Working with Analogical Semantics: Disambiguation Techniques in DLT Victor Sadler (BSO/Research, Utrecht) Dordrecht: Foris, 1989, 256 pp. (Distributed Language Translation 5) Hardbound, ISBN 90-6765-429-9, $60.00, Dfl 120.-; Softbound, ISBN 90-6765-428-0, $33.00, Dfl 67.-.","An Introduction to Programming in Prolog Patrick Saint-Dizier (Universit6 Paul Sabatier) New York: Springer-Verlag, 1989, xi + 184 pp. Softbound, ISBN 0-387-97144-0 and 3-540-97144-0 Computational Linguistics Volume 16, Number 2, June 1990 125"]}]}