{"sections":[{"title":"Keeping you up-to-date","paragraphs":["Two new volumes coming this year!"]},{"title":"Syntax and Semantics","paragraphs":["Volumes 22-24","series editor Stephen R. Anderson Volume 22"]},{"title":"Structure and Case Marking in Japanese Shigeru Miyagawa","paragraphs":["CONTENTS: Arguments and Adjuncts. Numeral Quantifiers and Thematic Relations. Ergative Construction. Paradigmatic Structures and the Causatives. A Uniform Approach to the Passive. Historical Development of the Accusative Case Marker. Index. In Paperback: $29.95/ISBN: 0-12-606103-3 Casebound: $59.95/ISBN: 0-12-613522-3 1989, 259 pages Volume 23"]},{"title":"The Syntax of the Modern Celtic Languages","paragraphs":["edited by Randall Hendrick CONTENTS: G.M. Awbery, Dialect Syntax, A Neglected Resource for Welsh. A. Rouveret, X-Bar Theory, Minimality, and Barrierhood in Welsh. R.D. Borsely, A GPSG Approach to Breton Word Order. G.T. Stump, Inflection and the Lexical Representation of Compounds in Breton. R. Hendrick, Breton Pronominals, Binding, and Barriers. N. Stenson, Phrase Structure Congruence, Government, and Irish/English Code-Switching. J. McCloskey, Resumptive Pronouns, A-Binding, and Levels of Representation in Irish. References. Index. In Paperback: $29.95/ISBN: 0-12-606104-1 Casebound: $59.95/ISBN: 0-12-613523-9 July 1990, c. 256 pages Volume 24"]},{"title":"Modern Icelandic Syntax","paragraphs":["edited by Joan Maling and Annie Zaenen CONTENTS: Word Order: E. Rrgnvaldsson and H. Thrfinsson, On Icelandic Word Order Once More. H.A. Sigursson, V1 Declaratives and Verb Raising in Icelandic. J. Maling, Inversion in Embedded Clauses in Modem Icelandic. Verbs and Their Arguments: A. Zaenen, J. Maling, and H. Thrrinsson, Case and Grammatical Functions: The Icelandic Passive. A. Zaenen and J. Maling, Unaccusative, Passive, and Quirky Case. J. Maling and A. Zaenen, Preposition-Stranding and Passive. A.D Andrews, The VP Complement Analysis in Modem Icelandic. A.D Andrews, Case Structures and Control in Modem Icelandic. S.R. Anderson, The Grammar of Icelandic Verbs in -st. Reflexives: J. Maling, Clause-Bounded Reflexives in Modem Icelandic. H. Thrrinsson, A Semantic Reflexive in Icelandic. H.A. Sigursson, Moods and (Long Distance) Reflexives in Icelandic. Coordination: E. Rrgnvaldsson, We Need (Some Kind of a) Rule of Conjunction Reduction. J. Bresnan and H. Thrfinsson, A Note on Icelandic Coordination. E. Rrgnvaldsson, Null Objects in Icelandic. Long Distance Dependencies: J. Maling and A. Zaenen, The Nonuniversality of a Surface Filter. Bibliographies: H. Thrrinsson and E. Rrgnvaldsson, Bibliography of Modem Icelandic Syntax. E. ROgnvaldsson and H. Thrdtinsson, Bibliography of Diachronic Icelandic Syntax. Each chapter includes references. Index. In Paperback: $29.95 (tentative)/ISBN: 0-12-606105-X Casebound: $74.50 (tentative)/ISBN: 0-12-613524-X September 1990, c. 415 pages The first volume in a new series."]},{"title":"Phonetics and Phonology","paragraphs":["series editors","Stephen R. Anderson and Patricia A. Keating Volume 1"]},{"title":"Rhythm and Meter","paragraphs":["edited by Paul Kiparsky and Gilbert Youmans This volume discusses the analysis of verse metrics and, more generally, the sound structure of all spoken language. While phonological theory remains a central concern for most of the authors of this coherent collection of articles, the emphasis is placed on metrical theory, formulating and illustrating metrical principles within the tradition of generative metrics as well as within competing traditions. CONTENTS: G. Youmans, Introduction: Rhythm and Meter. R. Jackendoff, A Comparison of Rhythmic Structures in Music and Language. A. Prince, Metrical Forms. M. Halle, Addendum to Prince's \"Metrical Forms.\" R.T. Oehrle, Temporal Structures in Verse Design. M. Tarlinskaja, General and Particular Aspects of Meter: Literatures, Epochs, Poets. B. Bjorklund, Iambic and Trochaic Verse--Major and Minor Keys? D. Attridge, Linguistic Theory and Literary Criticism: The Rhythms of English Poetry Revisited. B. Hayes, The Prosodic Hierarchy in Meter. E.R. Weismiller, Triple Threats to Duple Rhythm. E.C. Traugott, Meter in Auden's \"Streams.\" P. Kiparsky, Sprung Rhythm. G. Youmans, Milton's Meter. Index. 1989, 399 pages, $59.50 ISBN: 0-12-409340-X","Order from your local bookseller or directly from"]},{"title":"@ ACADEMIC PRESS Harcourt Brace Jovanovich, Publishers Book Marketing Department #19060 1250 Sixth Avenue, San Diego, CA 92101","paragraphs":["CALL TOLL FREE"]},{"title":"1-800-321-5068 FAX: 1-314-528-5001","paragraphs":["Quote this reference number for free postage and handling on your prepaid order ~ 19060","Prices subject to change without notice. ¢~1990 by Academic Press, Inc. All Rights Reserved. LK/MJD- 19060."]},{"title":"Linguistics & Language Behavior Abstracts Now enterin 9 our 24th year (135,000 abstracts to date) of service to linguists and language researchers worldwide. LLBA is available in print and also on-line from BRS and Dialog. Linguistics & Language Behavior Abstracts P.O. Box 22206 San Diego, CA 92122 Phone (619)695-8803 FAX (619)695-0416 Fast, ecanomical document delivery available. The leading interdisciplinary forum for natural language semantics Journal of SEMANTICS Includes: * Contributions from the fields of philosophy, psychology, linguistics and artificial intelligence * Original research papers * Review articles * Notes, discussions, and book reviews The Journal of Semantics is the leading international forum for the rapid developments that have taken place over the last decade in the field of natural language semantics. Increasingly, its crucial relevance has been recognized in all areas of natural language research. High formal standards have been set as it has striven to meet the growing need for computational and empirical adequacy. This process has been aided by the intense interdisciplinary exchange and co-operation that has simultaneously occurred, setting new standards for the field as a whole and working towards a true integration. The Journal's editors and advisory board are composed of internationally established specialists, and it is firmly rooted in the interdisciplinary study of natural language semantics, with linguistics, psychology, philosophy, and artificial intelligence as the major contributing disciplines. Subscription Rates, Volume 7, 1990 (4 issues) Individuals: N.America US$ 36.00, UK £18.00, elsewhere £20.00 Institutions: N.America US$90.00, UK £40.00, elsewhere £45.00 To subscribe, obtain further information or a free sample of the Journal of Semantics please write to: Journals Marketing, Oxford University Press, Inc., 2001 Evans Road, Cary, North Carolina 27513 Oxford University Press Linguistic Inquiry Samuel Jay Keyser, Editor-in-Chief Published quarterly by The MIT Press One year: $40 individual, $80 institution, $28 student/ retired. Add $14 postage and handling outside U.S.A. ISSN 0024-3892 Highly respected for its sust,'dned excellence in quality of scholarship, Linguistic Inquiry leads the field in research on current topics in linguistic theory. Issue after issue, LI keeps you informed of new theoretical developments by presenting the latest in international research. Contributors include some of the world's most celebrated linguists whose articles transcend disciplinary boundaries and bridge language families. Keep informed about current research in linguistics. Subscribe to Linguistic Inquiry today[ Prepayment is required. Send check dra,~m against a U.S. bank in U.S. funds,, MasterCard or VISA number to: MIT :Press Journals 55 Hayward Street Cambridge, MA 02142 (617) 253-2889 FAX (617) 258-6779 ACL","paragraphs":["1990 DUES STATEMENT ACL MEMBERSHIP DIRECTORY Planned; Please Provide Complete Phone & Email Information Membership in the Association for Computational Linguistics is for the calendar year, regardless of when dues are paid. Membership includes a full year of the ACL journal Computational Linguistics, reduced registration at most ACL-sponsored conferences, and discounts on ACL-sponsored publications. A late payment fee will be charged for renewals made after 15 March; this fee does not apply to new members. Institutions now subscribe to the journal through MIT Press Journals, 55 Hayward Street, Cambridge, MA 02142 USA; (+1-617)253-2889. Back issues and proceedings are available only from the ACL Office, except that institutions should backorder joumals from 1988 on through MIT Press. An order form is on the other side of this statement. Payments for dues, back issues, and proceedings can be made in Europe and Japan as well as the U.S.; most Europeans should pay through Europe; read the directions under the heading PAYMENT below carefully. Identify your institutional affiliation if it is not part of your address. Also provide your telephone country & city codes and your computer network & email address. FULL NAME ADDRESS INSTITUTION TELEPHONE COMPUTER NETWORK & EMAIL ADDRESS Please correct any errors in the label provided. Provide prompt notification of address changes; copies returned because of bad addresses will not be remailed until a $3.00 postage and handling fee is remitted. MEMBERSHIP DUES FOR 1990: Dues for Regular Members are $25. Couples with the same mailing address may become Joint Members for $30; they will receive only one set of publications, but each will be eligible for all other member benefits. Full-time students may become Student Members for $15 with copy of current student ID. CHECK MEMBERSHIP CATEGORY: DUES $ IqRegular($25) FqJoint($30) IqStudent($15 with ID) (surface mailing costs included) Additional for 1st class or air ($10 U.S., Canada, & Mexico; $20 elsewhere): DUES MAILING $ $10 late payment for renewals after 15 March 1990 LATE PAYMENT FEE $ INTERNATIONAL FUND: INTERNATIONAL FUND $ The ACL set up a fund in 1982 to make ACL memberships and publications available to colleagues who have difficulty in using their national currencies for international transactions or for whom membership would otherwise be impossible. Contributions may be tax-deductible in the United States and in some other countries; check local regulations. PAYMENT: Prepayment is necessary; invoices are available on request. The U.S. dollar price is definitive when paying in other currencies. Checks and money orders should be made out to the Association for Computational Linguistics (or to ACL). Payments can be made to one of the addresses below, as follows:","1. In the USA to Walker; mail this dues statement with a check or money order payable to ACL. Note: PAYMENTS IN THE USA MUST BE MADE IN U.S. DOLLARS, DRAWN ON A U.S. BANK.","2. In Europe to Rosner; mail this dues statement with a check or money order in Swiss francs or the equivalent in your local currency on the day the check is written, payable to ACL. Ensure that the check is payable in Switzerland or France. Do not issue a check or money order in U.S. dollars unless it is drawn on a U.S. Bank. Payment can also be made by bank transfer to ACL account number 141.880.LAV at the Union Bank of Switzerland, 8 rue de Rhone, CH-1211 Geneva 11, SWITZERLAND. Send Rosner a copy of the bank transfer as well as the dues statement. Note: EUROPEAN MEMBERS SHOULD PAY THROUGH ROSNER UNLESS THEY HAVE A U.S. BANK ACCOUNT.","3. In Japan to Nagao; transfer an equivalent amount in yen on the day of payment to \"Dai-ichi Kangyo Bank, Hyakumanben Branch; Ordinary Deposit, 476-1319944; Name: Keisangengogakkai Kaihi Nagao Makoto.\" Mail this dues statement to Walker together with a copy of the bank transfer. Also send Nagao a copy of the bank transfer. Note: THE DUES STATEMENT MUST BE SENT TO WALKER TO BE PROPERLY RECORDED IN THE ACL OFFICE. Dr. Donald E. Walker (ACL) Bellcore, MRE 2A379 445 South Street, Box 1910 Morristown, NJ 07960-1910, USA Dr. Michael Rosner (ACL) IDSIA Corso Elvezia 36 CH-6900 Lugano, SWITZERLAND Prof. Makato Nagao (ACL) Electrical Engineering Kyoto University Yoshida, Sakyo, Kyoto, JAPAN [28 May 1990]"]},{"title":"ORDER FORM FOR ACL BACK ISSUES AND PROCEEDINGS CL Microfiche Back Issues from 1974-1978 at Reduced Rate BACK ISSUES:","paragraphs":["Back issues of Computational Linguistics are available from the ACL, as well as two special supplements: a Directory of Graduate Programs in Computational Linguistics and a Survey of Computational Linguistics Courses. Surface mailing costs are included in the prices; additional charges for 1st class or air delivery are noted. Institutions must order back issues from 1988 on through MIT Press Journals, 55 Hayward Street, Cambridge, l~k 02142 USA; (+1-617)253-2889. CIRCLE VOLUME-YEARS REQUESTED (Reduced Rates, Each: Members $15; others $25): BACK ISSUES $. Additional for 1st class or air (Each volume-year: $5 U.S., Canada, & Iviexico; $10 elsewhere): BACK ISSUE MAILING $. Microfiche only: 1974 1975 1976 1977 1978 [No issue publishedin 1979] CIRCLE VOLUME-YEARS REQUESTED (Each: $25 Regular, $15 Student; others $50): BACK ISSUES $ Additional for 1st class or air (Each volume-year: $10 U.S., Canada, & Mexico; $20 elsewhere): BACK ISSUE MAILING $ Print withmicrofiche: 1980 1981 1982 1983 1984 1985 1986 1987 Print only: 1988 1989 (Members order through ACL; institutions must order through MIT Press Journals) CHECK SUPPLEMENTS REQUESTED (Members $5; others $10): SUPPLEMENTS $ Additional for 1st class or air (each: $3 U.S., Canada, & Mexico; $6 elsewhere): SUPPLEMENT MAILING $ [] 1986 Directory of Graduate Programs [31986 Survey of Courses PROCEEDINGS: Proceedings are available for the ACL conferences listed below, including the COLING-84 volume, which was also the 22nd ACL Annual Meeting. Because of the size of the COLENG-84 proceedings, it costs more and is listed separately. The COLING-86 proceedings can be ordered through the ACL or directly from Bonn as noted below; shipment is from Bonn. The COLING-88 proceedings is also available from the ACL. Surface marling costs are included in the prices; additional charges for 1st class or air delivery are noted. CHECK ACL PROCEEDINGS REQUESTED (each: Members $25; others $50): Additional for 1st class or air (each: $8 U.S., Canada, & Mexico; $16 elsewhere): ACL ANNUAL MEETINGS D17th, San Diego, 1979 [-'ll8th, Philadelphia, 1980 [-319th, Stanford, 1981 [-121st, Cambridge, 1983 -22nd, see COLING-84 below F]:'3rd, Chicago, 1985 F125th, Stanford, 1987 I-q26th, Buffalo, 1988 F327th, Vancouver, 1989 CONFERENCES ON APPLIED NATURAL LANGUAGE PROCESSING I-qFirst, Santa Monica, 1983 DSecond, Austin, 1988 EUROPEAN CHAPTER CONFERENCES FlFirst, Pisa, 1983 l-qSecond, Geneva, 1985 I-3Third, Copenhagen, 1987","ACL PROCEEDINGS $ ACL PROCEEDINGS MAILING $ I'q20th, Toronto, 1982 I'q24th, New York, 1986 F128th, Pittsburgh, 1990 I-'lFourth, Manchester, 1989 CHECK COLING PROCEEDINGS REQUESTED (note differences in prices and in additional charges for 1st class or air delivery): F]COLING-84, Stanford, 1984 (Members $45; others $90) COLING-84 PROCEEDINGS $. Additional for 1st class or air ($12 U.S., Canada, & Mexico; $24 elsewhere): COLING-84 PROCEEDINGS MAILING $.","FqCOLING-86, Bonn, 1986 (through ACL: $65 surface delivery; $8(I air): COLING-86 PROCEEDINGS $. (through Bonn: 95 DM surface delivery; 120 DM air; order from IKS e.V., Poppelsdorfer Allee 47, D-5300 Bonn 1, WEST GERMANY; +49/228/735645; UPK000%DBNRHRZ1.BITNET; pay IKS by check or by bank transfer to Bank f/dr Gemeinwirtschaft Bonn, Account no. 1205 163 900, BLZ 380 101 11) [-1COLING-88 (2 volumes), Budapest, 1988 (Members $75; others $150): COLING-88 PROCEEDINGS $. Additional for 1st class or air ($16 U.S., Canada, & Mexico; $32 elsewhere): COLING-88 PROCEEDINGS MAILING $. PAYMENT: Prepayment is necessary; invoices are available on request. Checks should be made out to the Association for Computational Linguistics (or to ACL). Payments can be made in U.S. dollars drawn on a U.S. bank to Walker at the address below. Payments can also be made in Switzerland by check or bank transfer and in Japan by bank transfer only; for details see the other side of this form.","SEND TO Dr. Donald E. Walker (ACL) FROM Bellcore, MRE 2A379 445 South Street, Box 1910 Morristown, NJ 07960-1910, USA"]},{"title":"Guidelines for Submissions","paragraphs":["Manuscripts to Computational Linguistics should be submitted on letter-size paper (8.5 by 11 inches, or A4), double-spaced throughout, including footnotes and references. The paper should begin with an informative abstract of approximately 150-250 words. Manuscripts must be written in English. Contact the editor regarding the possibility of electronic submission. Submissions may be made in any of the following categories: PAPER: This category includes contributions that report significant new research results in computational linguistics or that provide critical reviews of the literature on a particular topic. The length of a paper depends on its content, but we suggest that manuscripts be limited to forty double-spaced pages. That is the equivalent of twelve journal pages. Each paper is fully refereed, being read by at least two members of the editorial board and usually by an additional expert in the particular subject matter. The submission of an article to CL for refereeing means that the author certifies the manuscript is not copyrighted; nor has it been published or submitted for publication to another refereed journal. If any version of the paper has appeared, or will appear, in a non-refereed publication, the details of such publication must be made known to the Editor at the time of submission. The final version of a paper tentatively accepted for publication must be accompanied by a Copyright Transfer Agreement signed by all of the authors or, in the case of a \"work for hire,\" by the employer. This written transfer is necessary under the 1978 U.S. Copyright law. TECHNICAL CORRESPONDENCE: This category includes short articles reporting preliminary results of some project in progress, or the results of other studies of interest to the readership. Technical correspondences should not generally exceed eight double-spaced pages. Each technical correspondence is reviewed by at least two members of the editorial board before acceptance. LETI'ERS TO THE EDITOR: This includes statements of opinion on issues relevant to the readership. The Editor and the editorial board will evaluate the appropriateness of these contributions for inclusion. Five copies of papers, technical correspondences, and letters should be sent to the Editor: James F. Allen, CL Editor Department of Computer Science University of Rochester Rochester, NY 14627, USA INTERNET:acl@cs.rochester.edu Anyone interested in reviewing a book, or in suggesting a book for review, should contact the Book Review Editor; publishers may also submit copies of books for review directly to the Book Review Editor: Graeme Hirst, CL Book Review Editor Department of Computer Science University of Toronto Toronto, CANADA M5S 1A4 INTERNET:gh@ai.toronto.edu The FINITE STRING Editor should receive (a) copies of technical reports and reprints of papers published elsewhere--or at least citation information and abstracts of such items and of books and monographs; (b) summaries of research in progress--of particular interest would be perspectives on the activities at a particular institution; (c) announcements of meetings of potential interest to the membership; and (d) personal notes (e.g., honors, moving, changes in status). Time-sensitive material should be received by the first day of the second month of each quarter to appear in the next issue. Submissions (where possible in electronic form) should be sent to The FINITE STRING Editor: Ralph Weischedel, Finite String Editor BBN Systems & Technologies Corporation 10 Moulton Street Cambridge, MA 02238, USA INTERNET:weischedel@bbn.com The Association for Computational Linguistics is an international scientific and professional society with membership open to any person whose professional goals relate to computational linguistics. For information on dues and payments, see the inside front cover or the membership application form included in this issue.","President (1990) Jerry R. Hobbs Artificial Intelligence Center SRI InternaJ!ional 333 Ravenswood Avenue Menlo Park, CA 94025, USA (+ 1 415) 859-2229; INTERNET:hobbs@ai.sri.com","Vice President (1990) Ralph Gri,;hman Computer Science Department New York University 251 Mercer Street New York, NY10012, USA (+ 1 212) 998-3497; INTERNET:grishman@nyu.edu","Secretary-Treasurer (1977-1990) Donald E. Walker Bellcore, II~RE 2A379 445 South Street, Box 1910 Morristown, NJ 07960-1910, USA (+ 1 201) 829-4312; INTERNET:walker@flash.bellcore.com","Executive Committee 1988-90 1989-91 1990-92 Journal Editor Series Editor","Nominating Committee 1988-90 1989-91 1990-92 President, Vice President, Secretary-Treasurer, and Bruce W. Ballard, A T& T Bell Laboratories Wolf gang W ahlster, German Research Center for Artificial Intelligence Kathleen MeKeown, Columbia University James F. Allen, University of Rochester Aravind Joshi, University of Pennsylvania William C. Mann, Summer Institute of Linguistics Alan W. Bie:rmann, Duke University Candy Sidner, Digital Equipment Corporation ACL EUROPEAN CHAPTER OFFICIALS Chair (1987-90) Secretary (1986-90) Treasurer (I 982-90) Advisory Committee (1989-90) Nominating Committee (1987-90) (1989-92) Margaret King ISSCO 54 route des Acacias CH-1227 Geneva, SWITZERLAND (+41 22) 7(15 71 14; EARNET:king@divsun.unige.ch Beat Buchmann Credit Suisse Department RU PO Box 590, Schanzeneggstr 3 CH-8021 Zurich, SWITZERLAND (+ 41 1 ) 215 31 26; EARNET:beat%idsia.uucp@chx400.switch.ch Michael Rosner IDSIA Corso Elw,zia 36 CH-6900 Lugano, SWITZERLAND (+ 41 91) 51 86 60; EARNET:mike%idsia.uucp@chx400.switch.ch Maurice Gross, University of Paris Christian Rohrer, University of Stuttgart Eva Haji~(w;i, Charles University (Chair) Gerard Kempen, University of Nijmegen Jan Landsbergen, Philips Research Laboratories Anna Sfigva]l-Hein, University of Uppsala"]}]}