{"sections":[{"title":"Analysis of Indirect Uses of Interrogative Sentences Carrying Anger * ","paragraphs":["Hye-Jin Min and Jong C. Park","","Computer Science Division EECS Department, KAIST","373-1 Guseong-dong, Yuseong-gu Daejeon 305-701 South Korea {hjmin, park}@nlp.kaist.ac.kr"," Abstract. Interrogative sentences are generally used to perform speech acts of directly asking a question or making a request, but they are also used to convey such speech acts indirectly. In the utterances, such indirect uses of interrogative sentences usually carry speaker’s emotion with a negative attitude, which is close to an expression of anger. The identification of such negative emotion is known as a difficult problem that requires relevant information in syntax, semantics, discourse, pragmatics, and speech signals. In this paper, we argue that the interrogatives used for indirect speech acts could serve as a dominant marker for identifying the emotional attitudes, such as anger, as compared to other emotion-related markers, such as discourse markers, adverbial words, and syntactic markers. To support such an argument, we analyze the dialogues collected from the Korean soap operas, and examine individual or cooperative influences of the emotion-related markers on emotional realization. The user study shows that the interrogatives could be utilized as a promising device for emotion identification. Keywords: Interrogative sentences, Wh-words, Emotion identification, Anger  "]},{"title":"1. Introduction","paragraphs":["Every utterance has its illocutionary force that makes the hearers to act a certain behavior, in accordance with the speaker’s intentions, such as assertives, directives, commissives, expressives and declarations (Austin, 1962; Searle, 1969). The actions induced by such intentions, or speech acts, are systematically related to particular types of a sentential form uttered by the speaker (Levelt, 1989). However, these relations do not appear quite strict because speech acts with a particular sentential form could be dependent upon prosodic and paralinguistic devices. For instance, interrogative sentences are not only used for asking a question or making a request directly to the hearers, but also perform speech acts indirectly, including rejection, refutation, and reproach. In particular, in an utterance, such indirect speech acts could also carry the speaker’s psychological attitude (Kim, 2003), as shown in the following utterance.  (1) A: 어서 그에게 가서 잘못을 사과해. (Promptly apologize to him for your fault.)1  * This research was performed for the Intelligent Robotics Development Program, one of the 21st Century Frontier R&D Programs, and Brain Science Research Center, funded by the Ministry of Commerce, Industry and Energy of Korea.  Copyright 2007 by Hye-Jin Min and Jong C. Park  1 The transcriptions in English are placed in round brackets. 311 B: 사과라구요? 내가 왜 사과하는데요? 잘못한 사람이 누군데? (Apology? Why do I have to apologize to him? Who did something wrong?)  Example (1) contains the interrogatives ‘왜(why)’ and ‘누군데(who)’ to convey an indirect speech act that the speaker B rejects the proposal of the speech partner A, carrying a negative attitude in the utterance. Similarly, in the most utterances of soap opera, the indirect speech act with such psychological attitudes is much closer to the negative emotion, such as anger, than to the positive emotion, such as joy. In contrast to this realization by the interrogatives, the distinction of anger from joy is known as a difficult problem in emotion identification with speech signals, which are actively utilized as an important information source in the most studies for emotion recognition. The speech signals for anger and joy have quite similar pitch and intonation. Thus, if we identify certain types of interrogative sentences related to a negative psychological attitude and make the patterns from those types, emotion identification from speech signals could perform better with the help of the patterns. In this paper, we analyze interrogative sentences with psychological attitudes, especially related to the speaker’s anger. We first describe the interrogatives for their underlying effects on emotions in utterance, and other emotion-embedded expressions, such as adverbial words, demonstrative expressions, syntactic markers and discourse markers. Such expressions are often used alone to convey the speaker’s emotions, but they could be used in interrogative sentences so as to expose the emotions more clearly. We look into the individual or cooperative uses of interrogatives and the emotion-embedded expressions, in order to classify the characteristic patterns related to the emotion of anger. In order to analyze interrogatives, we collect utterances from the scripts of romantic soap operas that show rich emotional expressions in Korean. We examine the collection of utterances to see how such interrogative sentences influence the process of identifying the speaker’s anger, and then confirm the influence through a user study of tagging emotions to utterances in the same domain. As a preliminary result from the user study, we constructed patterns of sentences and their speech acts carrying particular emotions. We believe that such patterns could be utilized as a high quality resource to identify the emotion and the mood of dialogues with precision. The rest of this paper is organized as follows. Section 2 shows previous researches for the linguistic elements that express the speaker’s emotions. Section 3 analyzes the linguistic structures of interrogative sentences as well as other linguistic components in contexts, especially focusing on an indirect speech act with emotional attitudes. Section 4 describes a user study of emotion tagging and its preliminary result. Section 5 discusses complex cases in interrogative sentences. Finally, Section 6 concludes the paper. "]},{"title":"2. Background","paragraphs":["There have been many researches on linguistic elements in the Korean spoken language related to the speaker’s psychological attitudes. (Jang, 1998) examined the actual function of ‘Wh-words’ in a spoken language corpus, who asserted that the frequencies of ‘what’ and ‘where’ as an exclamation and an infinite in a real utterance is not so low and even higher than those of ‘what’ and ‘where’ as a standard interrogative. The collected examples show that these interrogatives function as exclamations expressing the instant senses or abrupt emotions. (Jung, 2005) analyzed the meaning of the interrogative ‘what’ by classifying it as a basic meaning for standard questions and an extended meaning for discourse markers. According to her classification, three meanings of ‘what’ as a discourse marker are related to emotions of the speaker. First, when it is utilized for emphasis it contains regretfulness. Second, it is a marker for surprise by the unexpected information. Third, when the speaker does not accept the current situation emotionally, it served as a marker for disappointment or abandonment. (Kim, 2003) regarded some interrogatives as modal interrogatives when they are used in special interrogative 312 questions with indirect speech acts. These researches show that the usages of ‘Wh-words’ or interrogatives are not just limited to the basic and standard questions, but many of them are used to convey the speaker’s psychological attitude. Exclamations, adverbial or demonstrative expressions that function as discourse markers also express the speaker’s diverse psychological attitude such as persistence, surprise, hedge, and so on (Byron and Heeman, 1997; Kang, 2002). These expressions do not affect the informative meaning of the utterances but convey additional emotional meanings or attitudes along with it. In addition, special endings of questions with indirect speech acts such as rhetorical questions, echo questions, or imperative questions influence the expression of negative attitudes such as refutation, rejection, or suspicion (Jeon, 1996; Kim, 1999) The ending in rhetorical-echo questions functions as a syntactic marker indicating that the sentence is in the form of an ending and that it is a repeated expression of the previous utterance. In the case of imperative questions, the ending serves as a marker for emphasizing the given action. All these researches reveal that there are some linguistic elements in the spoken language that describe the speaker’s emotional attitude, but their main focus has not been on emotional attitudes. Neither have the relations among these components been discussed systematically. It is hard to see how all these co-occurring components in utterances affect the speaker’s emotional attitude at a glance, but there could be at least some characteristic patterns. In this paper, we analyze these linguistic components together as they are used in utterances and examine how much these components influence the process of recognizing the speaker’s emotion, especially anger, by focusing on interrogative sentences. "]},{"title":"3. The Structure of the Interrogative Sentences Related to Anger 3.1. Interrogative sentences and interrogatives","paragraphs":["The expected action of the hearer when the speaker is asking a question is to provide some information for the speaker. However, if the sought information is already accessible to both the speaker and the hearer, the real intention of the speaker would be different from simply asking for it. In such a case, the interrogative is utilized in order to emphasize the intention. For example, the speaker B produces an utterance in the form of an interrogative sentence to emphasize refutation against A’s assertion in (1). The interrogative pronoun ‘who’ in the second one has its antecedent in the context as opposed to those of standard questions. Although B knew who did something wrong, B asked such a question to convey the negative attitude to A. The interrogative pronoun ‘who’ refers to B and what B actually believes is the opposite of the mentioned information in such a question. The corresponding declarative sentence could be that ‘잘못한 사람이 내가 아니다’ (I didn’t do anything wrong)’ by substituting ‘누구’(who) with ‘나’(I) and negating the predicate ‘인데’(be). The speaker could express the same meaning with such a declarative sentence without losing the denotative meaning of the original utterance. However, the connotative meaning of the utterance such as anger in this case may be lost. From this observation, we looked further into other interrogatives related to anger by collecting 100 short dialogues from the scripts for soap opera with two genre, teen-agers and romance. Each dialogue consists of one speaker’s turn that includes at least one utterance expressing the speaker’s anger","2",", and its preceding and following turns that support the fact that the utterance expresses the anger. We then found out that the frequency of the interrogative sentences with negative attitudes such as denial, refutation, persistence, reproach and oppressive order is quite high, approximately twenty percent, in the turn of the speaker, who expresses his or her anger. The utterance in (2) is one of the examples that we collected, which contains the interrogatives, with the Wh-words ‘where’ and ‘how’.  2 We utilized descriptive information such as facial expressions, emotion words or behaviors within the scripts to choose the utterance with anger.  313  (2) 동규: 대체 화안당이 어디 붙어 있는 거야?","네비게이션에도 안 뜨는 촌구석을 어떻게 찾아가라구? (Dong-kyu: Where in the world is hwaan-dang located ? How can I find out such a small place not listed in the GPS navigation device?)  Dong-kyu is having a difficulty in finding a place called hwann-dang, although he knew its address and the way to reach it in the situation. It is obvious that the two interrogative sentences are not utilized for asking but for emphasizing his annoyance. In a way similar to the case of ‘who’, the second sentence with ‘how’ could be related to the declarative sentence, ‘네비게이션에도 안 뜨는 촌구석을 찾을 수 없네(I can’t find such a small place not listed in the GPS navigation device)’ by negating the predicate and having the declarative ending. Figure 1 shows the frequency of ‘Wh-words’ in the dialogues we have collected.   Figure 1: Frequency of Wh-words "]},{"title":"3.2. Other emotion-embedded expressions with interrogative sentences","paragraphs":["One of the major reasons that people get angry is that they find out something or someone blameworthy by their standards of judgment (Ortony et al., 1988). So when they express their anger, some specific words or phrases that are related to the degrees of the standards of judgment appear in their utterances. Such degrees could be measured as the amount of the blameworthy actions or deepness of each action’s blameworthiness. Adverbs or demonstrative expressions have properties that can infer the degree of blameworthiness within the interrogative sentences. For example, the adverb ‘자꾸/맨날(so many times)’ shows that the action in the utterance is repetitive and that its amount exceeds the speaker’s acceptable standards. ‘아예(why don’t you)’ in (3b) indicates that the predicate in the utterance is regarded as an extremely unacceptable behavior, so the degree of the blameworthiness is quite high. (3c) shows the role of the demonstrative expression ‘그렇게(so)’ in the utterance. It comes with the interrogative adverb ‘왜(why)’, and the connoted meaning is the same as that of ‘매우(very)’ (Shin, 1993). It decides the degree of the blameworthiness, in this case, ‘비뚤어지다(being bully)’. In the opinion of the speaker’s opinion, the degree of blameworthiness of the hearer exceeded some limits, so she chose to use such a word. All these expressions let the hearer notice that his or her action is not acceptable to the speaker more clearly with the interrogatives.  (3) a. 황회장: 너 지금 할애비한테 반항하는 거여? 맞고 할텨? 그냥 할텨? 314 (President Whang: Are you defying me now? Will you do it after getting spanked?","Or just do it?)","동규: 아 글쎄 그 촌구석에 있는 집을 왜 자꾸/맨날 탐내시냐구요?","300 년 된 종택이라 팔 수도 없다잖아요!","(Dong-kyu: Ah, why do you keep craving for the house in such a small village so many times?","They can’t even sell it because of its long historical background!)","b. 수하: 남의 걸 허락없이 왜 뒤져요? 정말 이상한 사람이야! (Sue-ha: Why did you search for my stuff without my permission? You are so weird!) 동규: 누가 뭘 뒤졌다고 그래요? 연락처 알라고 잠깐 본 건데? 아, 울컥하네.","왜에? 아예 훔쳤다고 하지?","(Dong-kyu: Who searched for what? I just took a quick look to find your phone-number.","I’m so annoyed. Why? Why don’t you say I stole it?)","c. 수하: 부모님 밑에서 부족한 거 없이 잘 자란 애가 왜 그렇게 비뚤어진 건데?","왜? 애기씨 소리 못 들어서 서운해?","(Sue-ha: How come you are so bully despite being raised under such caring and rich parents?","Why? Are you sad that you are not called as a princess?) 준희: 허! 누가 그딴 소리 듣고 싶대? 웃겨 진짜! (Jun-hee: Huh! Who would like to hear such a sound? That’s so ridiculous!)  Exclamations as discourse markers are often located either in the front or at the back of the interrogative sentences. They also work as clues for indirect speech acts related to an emotional attitude with those sentences. In fact, emotional exclamations apparently function as markers expressing the emotions such as ‘하하’ and ‘히히’ for joy or ‘에고’ and ‘어이’ for sadness (Nam and Ko, 1985). Likewise, exclamations ‘아(ah)’ and ‘글쎄(well)’ in (3a) and ‘허(huh)’ in (3c) are the clues that indicate their utterances carry the spearker’s anger. However, these might express several emotions depending on the co-occurring utterances, so we should analyze not only the exclamations but also other kinds of information such as interrogatives and speech acts. For example, the discourse marker ‘글쎄(well)’ is used both when the speaker highlights her strong opinion against the thought of the addressee and when the speaker must answer with uncertainty, so it’s hard to identify the speaker’s emotion with only the presence of ‘글쎄(well)’. However, it could be utilized to strengthen the speaker’s refutation in connection with the following rhetorical echo question. Further cases of when it is still necessary to consider contextual information such as the previous or following utterances will be discussed in Section 5. The speaker often repeats the hearer’s former question to emphasize her anger. In this case, the special ending with the role of repetition is attached to the verbs or adjectives in the utterance of the speaker like ‘-라구요’ in (1). The ending belongs to ‘-다고(-tako)’, which syntactically makes a sentence end (Jeon, 1996). Jeon examined the functions of this type of ending and she argued that one of the functions is to indicate the speaker’s refutation or denial. She explained why the speaker utters this way instead of just directly mentioning a refusal according to the politeness principle (Leech, 1983). By uttering that way, the speaker can unload the hearer’s burden. However, when the speaker wants to express the anger at the hearer, she also takes this kind of repercussive question with other linguistic expressions that we have discussed so far. Dong-kyu’s utterance in (3a) is one example containing the adverb and the discourse marker. Therefore, repercussive questions with –tako ending that indicating a refusal or denial also express the speaker’s anger with the help of other linguistic device such as interrogatives, discourse markers. Table 1 summarizes some of these linguistic elements in Korean.  Table 1: Interrogatives and emotion-embedded expressions for anger","Adverbial words 자꾸/맨날 (so many times), 아예, 315 감히(dare) Demonstrative expressions 그렇게/그런/그딴(so), 이딴(this) Discourse markers 아(ah), 글쎄(well), 허/흥(huh), 뭐(what) -Tako endings -라고/라구, -다고, -라고/라구/다고","그래(요) "]},{"title":"4. User Study and the Results","paragraphs":["In order to examine the real influence of the interrogative sentences on identifying the speaker’s anger, we took a test tagging utterances within the scripts for soap opera, with the same genre as we analyzed. We first collected segments of a script that includes a situation where one of the speakers uses interrogative sentences when he or she expresses his or her anger. Each segment is either a whole scene or part of a scene. Then we converted the interrogative sentences into declarative sentences and made a copy of each segment including converted declarative sentences (CS) instead of interrogative sentences (IS). The conversion rules are as follows. [1] If a sentence is a rhetorical question, we remove the interrogative and negate the meaning of the sentence manually. In case of the interrogative ‘who’ we substitute it with a relevant antecedent. We then convert the ending of the sentence for the question into the one for the declarative. [2] If there are discourse markers, adverbial words, and demonstrative expressions near the interrogative sentence, we remove them. For example, the converted utterance of Jun-hee in (3c) is “난 그런 소리 듣고 싶지 않아 (I don’t like to hear about it)” by substituting ‘누가(who)’ with ‘난(I)’ and by removing the exclamation ‘허(Huh)’. We asked 20 subjects to judge whether the speaker is angry in the given example utterances by assigning the intensity of the anger on a seven-point Likert scale-based questionnaire. We divided the subjects into two groups where one group takes utterances with original interrogative sentences and the other group takes the ones with converted declarative sentences. Figure 2 shows two different kinds of utterances with the same denotative meanings and Figure 3 shows the screen shot of the test page. Subjects can tag the intensity of the anger by the dropdown box. The subject in Figure 3 tagged the last two sentences so the outline of the boxes became pink. During the test, they did not know about the actual intention of the test.   (a) The original interrogative sentences  316","(b) The converted declarative sentences Figure 2: A sample set of utterances for test (in Korean)   Figure 3: The screen shot of the test page (in Korean)  We performed an independent T-test (p < 0.05, two-tailed). The total number of the interrogative sentences we used for the test was 29; the mean values of IS and CS were 3.81 and 2.89, respectively; and their standard deviations were 1.60 and 1.536, respectively. The result was found to be statistically significant at the 0.05 level (df: 508, p < 0.05). Table 2 shows part of the sentences that are statistically significant.  Table 2: Statistically significant sentences","Original interrogative sentences Mean","(CS) Mean (IS) Std. D (CS) Std. D (IS) p-value 은심: 물만 먹어도 살찌는걸 나보고 어쩌라고? (Eun-sim: Since I get fat by drinking just water, what am I supposed to do?) 2.30 5.10 1.947 2.132 0.007 동규: 주인이 안 판다는데 그럼 어떡하라구요? (Dong-kyu: Since the owner has not the least intention of selling it, What can I do?) 1.40 2.70 0.699 0.949 0.03 수하: 남의 걸 허락없이 왜 뒤져요? 정말 이상한 사람이야! (Sue-ha: Why did you search for my stuff without my permission? You are so weird!) 2.70 3.85 0.675 1.226 0.01 동규: 왜에? 아예 훔쳤다고 하지? (Dong-kyu: Why? Why don’t you 2.30 4.00 0.675 1.333 0.02 317 just say I stole it?) 동규: 휴지통에 홀라당 버린 사람이 누군데 그래요? (Dong-kyu: Who threw it away in the garbage bin?) 2.20 4.50 1.135 1.9 0.04 수하: 도망이라뇨? 내가 왜 도망을 치는데요? 잘못한 사람이 누군데? (Sue-ha: Running away? Why should I run away? Who did something wrong?) 3.10 4.40 1.449 1.188 0.014  As shown in Table 2, the utterances with the interrogatives ‘왜(why)’ and ‘누구(who)’ are more significant in order to judge how much the speaker gets angry than any other interrogatives. In addition, if such utterances appear consecutively, the subjects tend to tag the intensity of the speaker’s anger far higher. "]},{"title":"5. Discussion","paragraphs":["Through a statistical evaluation, we found that some interrogative sentences play a significant role when the speaker expresses her anger. This shows that there are some relations among such linguistic components so the combinations of the components are useful for identifying the emphasized emotional attitude in utterances. From this point, we can create patterns for the interrogative sentences carrying anger. We identify some general rules from the example and encode them with regular expressions. For example, once the expression (\\s*\\S*)*누군데\\s*\\S* is created by looking into the sentence ‘잘못한 사람이 누군데?’, it can also be made to account for other sentences, for instance, ‘휴지통에 홀라당 버린 사람이 누군데 그래요?’ with a special ending such as ‘-그래요’. In order to consider discourse markers or adverbial and demonstrative expressions, patterns could be extended by accommodating spaces for them. These patterns from such sentences may work as an effective device for identifying the speaker’s underlying intentions as well as subtle emotional changes more precisely by distinguishing them from negated declarative sentences. It is still too early to say that they are more important than the corresponding declarative sentences that the speaker expresses her anger directly with explicit emotional words, but interrogative structures are employed to ask the hearer to pay more attention to the speaker and allow the hearer to have some time to anticipate the following utterance of the speaker as shown in (4).  (4) a. 동규: 진짜 그것뿐이에요? 찬민이 좋아하는 마음 조금도 없어요?","(Dong-kyu: Is really that all? Don’t you like Chan-min at all?)","b. 수하: 내가 그 인간을 왜 좋아해요?","(Sue-ha: Why Do I like the jerk?)","c. 하나도 안 좋아해.","(I don’t like him at all.)","d. 지금 같아선 황동규 씨 보다 백배 천배 만배 더 싫구만!!","(I hate him hundred, thousand, and million times more than Mr. Whang Dong-kyu!)  The declarative sentence (4d) is the most obvious one that expresses Sue-ha’s refutation among her utterances (4b) ~ (4d). However, she didn’t say (4d) in the first place because by adopting the interrogative sentence first and having the same verb as Dong-kyu’s utterance, she 318 can connect her utterance with his more naturally. In addition to it, she can emphasize her emotion gradually with three consecutive sentences without losing his attention. Since interrogative sentences that express the speaker’s emotion are highly dependent upon their context, we also need to consider the preceding or the subsequent utterance. By the turn-taking rule, if the speaker does not assign the right to speak to the hearer, even if she utters until she reaches the normal transition-relevance place in the question (Levelt, 1989), she might not expect the hearer to answer her question. Furthermore, if the hearer, who is also the following speaker, does not produce the utterance that is relevant to the adjacency pair as an answer for the speaker’s question, the current speaker’s communicative intention is not related to the question but interpreted as an indirect assertion or reproach. This is more apparent in the case where the utterances between the speaker and the hearer are in the form of an interrogative sentence consecutively as in (3b), (3c) and (4). From such clues, we can also build inter-sentential patterns identifying the speaker’s angry emotion. There are some general rules in the use of inter-sentences. First, the main verb or adjective is repeated when the hearer utters after the speaker’s normal question. Second, if the speaker takes two interrogative sentences consecutively with ‘왜(why)’ and ‘누구(who)’ or ‘뭐(what)’, the sentence with ‘왜(why)’ is followed by the one with ‘누구(who)’ or ‘뭐(what)’. Example (1) shows these rules. The main verb ‘사과하다(apologize)’ is repeated and the interrogative sentence with ‘왜(why)’ is preceded. If the second interrogative sentence with ‘누구(who)’ is followed by it, it seems to be an awkward sequence. Figure 4 shows the schematic diagram of the inter-sentential pattern by applying the rules.   Figure 4: Inter-sentential pattern "]},{"title":"6. Conclusion","paragraphs":["In this paper, we analyzed interrogative sentences that convey the speaker’s emotion of anger. The result from the user study shows that rhetorical questions with Wh-words ‘who’ and ‘why’ are statistically significant. We believe that this is a substantiated finding that is novel in emotion identification, to the best of our knowledge. We also believe that patterns from such sentences with the help of emotion-embedded expressions could be utilized as a high quality resource to identify anger. However, the correlation between these sentences with other utterances that use different sentential forms in the context may also affect the speaker’s emotions. In addition, emotions resulting from the relative meaning of verbs or adjectives depending on the individual’s point of view may influence the identification in real utterances. Further study is necessary for the proper contextual setting.  319"]},{"title":"References","paragraphs":["Austin, J.L. 1962. How To Do Things With Words. Oxford:Clarendon Press. Byron, D.K. and P.A. Heeman. 1997. Discourse Marker Use in Task-Oriented Spoken Dialog. Proceedings of Eurospeech’97, pp. 2223-2226. Chang, S.-W. 1998. The Study of the Actual Usage of the Korean Wh-words. Korean Journal of Linguistics, 23(4), 691-708. (In Korean) Jeon, H.-Y. 1996. On Pragmatic Functions of ‘-tako’-ending Repercussive Question. Korean Journal of Linguistics, 21(3), 889-991. (In Korean) Jung, E.-H.. 2005. The Study of an Interrogative ‘Mua’ in Korean. Journal of Korean National Language and Literature 35, 110-131. (In Korean) Kang, W.-W. 2002. A Comparative Study on Characteristics of ‘a’ and ‘eo’. Language Research 12, 241-257. (In Korean) Kim, J.-H. 1999. The Interpretation of Wh-words in Echo Questions. Eneohak [Linguistics], 25, 77-100. (In Korean) Kim, S.-H. 2003. A Study on the Modal Interrogative in Special Interrogative Sentence. Hangeul [Korean languages], 259, 115-140. (In Korean) Leech, G. 1983. Principles of Pragmatics. London: Longman. Levelt, W. J. M. 1989. Speaking: From Intention to Articulation. The MIT Press. Nam K.-S. and Y.-G. Ko. 1985. Pyojunkukeyomunbubnon [Korean Standard Grammar]. The Top Press. Ortony, A., G.L. Clore, and A. Collins. 1988. The Cognitive Structure of Emotions. Cambridge University Press. Searle, J. R. 1969. Speech Acts. Cambridge University Press. Shin, J.Y. 1993. Deixis in Spoken Language. Eohakyeungoo [Linguistics Study]. 363-380. (In Korean)  320"]}]}