{"sections":[{"title":"Gei 3 ta 1 in Taiwan Mandarin--- A Particular Construction *  Chiachun Lee","paragraphs":["Nan-Jeon Institute of Technology, Department of Applied English, 737-46, No.178. Chaochin Rd. Yianshui Town, Tainan County. Taiwan","chiachun@njtc.edu.tw"," Abstract. The present paper investigates a particular structure in Taiwan Mandarin, “(NP) + (intensifier) + gei3","ta1","“give him/it”+ adjective” in terms of construction grammar. The structure is mostly observed in utterances of younger generation. Though it is not regarded as a grammatical or standard structure, it is still a register of language. The structure lays emphasis on speaker’s attitude toward an undesired, unpleasant event. In most cases, the attitude tends to be negative. The events or propositions must have existed or been completed. The adjectives compatible with this structure belong to category of higher degree. The grammatical usage illustrates semantic bleaching of gei3","ta1",". And the changes from giving to a grammatical particle denoting subjective belief is a kind of subjectification. Moreover, ta1","could refer to events or situation expressed by a more complicated grammatical structure, or denotes nothing as a dummy word. Though many previous studies paid attention to the newly developed structure resulted from language contact, the adequate account was not provided. It is hoped through this investigation, we will get a better understanding of this particular structure.","Keywords: gei3 ta1",", construction meaning, speaker’s subjective attitude/belief, negative, event  "]},{"title":"1. Introduction","paragraphs":["Taiwan Mandarin is the result of language contact between Mandarin Chinese and Taiwanese Southern Min(TSM). There have been plenty of investigations on novel usages brought about by influence from TSM, including Kubler(1985), Tsai(2002) and Zeng(2003). However, these previous investigations mainly focus on the differences between Mandarin and Taiwan Mandarin. Few efforts were made to provide an adequate account on these newly emerged sentence structures. In the present paper, I am going to be concerned with one particular construction which are newly developed structure. In modern Taiwan Mandarin there are two particular structures evoking gei3","ta1",". One is descriptive expressions, “gei3","ta1","+ adjective”. The other one is resultative structure, “verb + gei3","ta1","+ complement”. These two sentence structures could be regarded as the result of language contact. The former structure is more novel and is confined in ordinary utterances of younger generation. Instead of their content meaning of a giving verb and the third person pronoun, gei3","ta1","function like an infix for the purpose of denoting speakers’ undesired and unpleasant attitude toward on the event mentioned. The corresponding combination of giving word and the third person pronoun in TSM do not have the similar function. Thus, he present paper aims at pinning down the function and features conveyed by the construction “(NP) + (intensifier) + gei3","ta1","+ adjective” in TM from the perspective of construction grammar proposed by Goldberg(1995, 2006). Through careful investigation on this novel structure, it is proven once again that language has its own life. It will be influenced by surrounding languages and has its own development. The data used as examples are attracted from, mainly blogs, internet and radio programs in Taiwan. The  * I would like to express my heartfelt thanks to the anonymous reviewers for comments and suggestions on the earlier abridged version of this paper. Needless to say, I am solely responsible for any infelicities.  Copyright 2007 by Chiachun Lee 268","paper is organized by the following parts. Chapter 2 tackle with the function and features of the structure","“(NP) + (intensifier) + gei3 ta1","+ adjective”, including its syntactic variations and features of the","compatible adjectives, the function of gei3","ta1",", the reference of ta1",". Chapter 3 is conclusion.",""]},{"title":"2. The structure“gei 3 + ta1 + adjective” in TM 2.1 Construction meaning","paragraphs":["Based on Goldberg (2006), grammatical constructions are conventionalized pairings of form and function.","She claims that constructions bear specific function, especially idiosyncratic structure.1","While verbs are","important in semantics of a construction, construction also denotes certain kind of meaning. Moreover,","CG claims that different surface structure spells different meaning. Furthermore, CG also take","information structure and pragmatics into consideration. In the step of mapping from semantics to syntax,","not all roles in frame are necessarily profiled in surface structure. Some could be omitted if they are","recoverable from the context or they are of no importance in information.","In this study, I am going to investigate the newly developed construction in terms of CG on account","of the following reasons. First, this construction is signified by its characteristics. This structure amplifies","speaker’s emotive evaluation on undesired or unpleasant event or situation. The event or situation must","be realis. That is to say that, it must be fact. Second, the adjectives compatible with this structure must be","adjectives with higher degree. General adjectives are seldom found in this structure. There are two kinds of special structures evoking “gei3","+ ta1","”2","in TM. Type I, descriptive expressions,","“gei3 ta1","+ adjective” and “gei3","ta1","+ verb”. The other one is resultative structure, “verb + gei3","ta1","+","complement”. In the present study, the focus is on “gei3","ta1","+ adjective”. The core part of the structure is","“gei3 ta1","+ adjective”. By adding adverbs there are several variations3",":"]},{"title":"1.","paragraphs":["gei3 ta1",""]},{"title":"+ ge","paragraphs":["0"]},{"title":"+ N","paragraphs":["a. Wo3","zhan4","zai4","yuan2","di4","bu4","zhi1","dao4","yiao4","shuo1","sha2",",","I stand at original place NOT know will speak what","zhen1","shi4","gei3","ta1","ge0","bu4","yu3","zhi4","pien4","really GEI TA CL not give place comment","Standing at the original place without knowing what to say, I really do not intend to give any","comment.","b. Wo3","jüe2","de2","jin1","tian1","zhen1","de0","hen3","gei3","ta1","ge0","jin4","bao4","I feel today really very GEI Ta CL surprise","Today, I really feel very much surprised."]},{"title":"2.","paragraphs":["gei3 ta1"]},{"title":"+ ADJP","paragraphs":["a. ta1","suo3","xue2","de0","fan2","wei2","zhen1","de0","shi4","you3","dian3","gei3","ta1","za2","he learn field really be a little GEI TA complicated","What he learned was a little complicated."]},{"title":"3.","paragraphs":["fei1 chang2"]},{"title":"+","paragraphs":["gei3 ta1"]},{"title":"+ ADJ","paragraphs":["a. jin3","ji2","xun2","zhao3 ...(fei1","chang2","gei3","ta1","jin3","ji2",")","urgent look for (very much GEI TA urgent","Look for something in emergency. (Extremely in emergency)"]},{"title":"4.","paragraphs":["(zhen1","de0","+) you3 dian3","+ gei3","ta1",""]},{"title":"+ ADJ a. Tian","paragraphs":["1"]},{"title":"yu","paragraphs":["3"]},{"title":"chuan","paragraphs":["2"]},{"title":"shuo","paragraphs":["1"]},{"title":"... zhen","paragraphs":["1"]},{"title":"de","paragraphs":["0"]},{"title":"you","paragraphs":["3"]},{"title":"dian","paragraphs":["3"]},{"title":"gei","paragraphs":["3"]},{"title":"ta","paragraphs":["1"]},{"title":"wu","paragraphs":["2"]},{"title":"liao","paragraphs":["2"]},{"title":"shuo","paragraphs":["1","Tianyuchanshuo(a puppet play) really a little GEI TA boring speak Tianyuchanshuo is really very boring.  1 For more details, please take reference to Goldberg (2006:6, 7). 2 The character of third person pronoun is “他”or “它”. “他” is human 3rd","person pronoun. “它” usually denotes unanimated objects/matters or animated animals, excluding human. Though there are different characters presenting different gender of the third person personal pronouns, the male third person pronoun is more general than female one, especially in informal situations. Thus, in original data both “他”and “它” are observed. 3 I use Hanyu Pinyin for transliteration of Chinese words. Some function lexemes are not clearly explained. Instead, I use capitalized letters, such as CL is classifier, LE is a marker indicating the completion of event or changes. LA is a sentence final particle. NOM is nominalization marker. NOT is negation. 269"]},{"title":"5.","paragraphs":["zhen1","de0","+ gei3","ta1","+ you3","dian3"]},{"title":"+ ADJ a. shuo","paragraphs":["1"]},{"title":"zhen","paragraphs":["1"]},{"title":"de","paragraphs":["0"]},{"title":"ni","paragraphs":["3"]},{"title":"de","paragraphs":["0"]},{"title":"fan","paragraphs":["3"]},{"title":"ying","paragraphs":["4"]},{"title":"zhen","paragraphs":["1"]},{"title":"de","paragraphs":["0"]},{"title":"you","paragraphs":["3"]},{"title":"dian","paragraphs":["3"]},{"title":"gei","paragraphs":["3"]},{"title":"ta","paragraphs":["1"]},{"title":"chi","paragraphs":["2"]},{"title":"dun","paragraphs":["4"]},{"title":"le","paragraphs":["0"]},{"title":"shuo","paragraphs":["1"]},{"title":"speak the truth your reaction really a little GEI TA slow LE speak ","paragraphs":["To tell the truth, your reaction is really a little slow."]},{"title":"6.","paragraphs":["zhen1","(shi4",") + gei3 ta1","+ you3","gou4","+"]},{"title":"ADJ","paragraphs":["a. kuang2","dao1","zhen1","de0","shi4 gei3","ta1","you3","gou4","shuai4","de0","la0","Kuangdao4","really be GEI TA very much handsome DE LA","Kuangdao is really handsome.","In the 1st","token, gei3","is a verb of giving. The noun following gei3","ta1","is the theme transferred. The","goal of giving action is ta1",". The three internal arguments of giving verb are realized, though the theme","transferred is abstract. These themes are nominalized by the classifier ge0",". This structure could be","regarded as residue of original functions as a giving verb. In the other variations, the constituent","following gei3","ta1","is no longer a noun, instead, these elements compatible could be adjectives. Thus, gei3","","is not a verb and ta1","not a goal. In the first type of variations gei3","ta1","is obligatory because gei3","is still a","main verb in the clause while in the other variations it is no longer essential. Thus, there are some","changes in syntax and semantics in gei3","and ta1",". That will be investigated in the later section. With regard","to the other variations, the syntactic distribution could be summarized as the following pattern:","(3) (zhen1","/zhen1 de0","/ zhen1","shi4","/ zhen1","de0","shi4","‘truly, really’+) gei3","ta1","(+ fei1","chang2","’very","much’/ you3 dian3"]},{"title":"’ a little’/","paragraphs":["you3","gou4","’enough’) + ADJ","“zhen1","/zhen1","de0","/ zhen1","shi4 / zhen1","de0","shi4","” emphasizes the validity of the following evaluation. In our data,","gei3","ta1","must go after this type of adverbs. Moreover, their syntactic position must precede adverbs","modifying adjectives, including fei1","chang2","/ you3","dian3"]},{"title":"/","paragraphs":["you3","gou4",". The relative position between gei3","ta1","","and intensifier is more flexible. These degree adverbs come before or follow after gei3","ta1",".","The structure in question is featured with the following quality. First, the structure expresses","speaker’s subjective evaluation. Second, the goal of evaluation is factivity. Third, the adjectives tend to","be negative in most cases, though the positive ones are compatible.","The concept of subjectivity here is defined as that a construction or a particular item should make","reference to speaker for its interpretation. Take the following pair of sentences as a example (Smet and","Verstraete, 2006: 367).","( 4 )a. Mum won’t let us go out tonight. I asked her but she said we had partied more than enough","this week.","b. Judith won’t be late. She never is.","In (4) a, won’t expresses Mum’s unwillingness to give permission to them to go out at night. In(4) b,","won’t describes speaker’s judgment on the matter that whether Judith is likely to be late or not. The","speaker reasons on the basis of Judith’s previous behavior. Because it “refers to a judgment by the","speaker rather than an action or a characteristic of one of the clausal participants” (Smet and Verstraete,","2006: 367), sentence (b) is subjective while sentence (a) is not. In the concept of subjectivity the speaker","should be included in the interpretation. Take the following “minimal pair” sentences as examples.","( 5 ) a. ta1","suo3","xue2","de0 fan2","wei2","zhen1","de0","shi4","you3","dian3","gei3","ta1","za2","He learning NOM field really a little GET TA complicated","What he learned was a little complicated.","b. ta1","suo3","xue2","de0 fan2","wei2","zhen1","de0","shi4","you3","dian3","za2","He learning NOM field really a little complicated","What he learned was a little complicated.","(6 ) a. Ah! Kai1","Xiao3 hei1","chu1","qü4","you3","dian3","gei3","ta1","wei2","xian3","Ah! Drive Xiaohei out have a little GEI TA danger","Ah! Driving Xiaohei(black car) is a kind of danger.","b. Ah! Kai1","Xiao3 hei1","chu1","qü4","you3","dian3","wei2","xian3","Ah! Drive Xiaohei out have a little danger","Ah! Driving Xiaohei(black car) is a kind of danger.","In these minimal pair sets, sentences b are more general while sentences a manifests the emphasis of","speaker’s emotion. Though sentences b also indicates speaker’s evaluation on the matter talked about, the","addition of gei3ta1 specifies the matter being judged. In (5) a the evaluation of “complication” is based","on speaker’s understanding of his field of study, and in (6) a “danger” is a judgment from speaker’s  4 Kuangdao is a character in a puppet play. 270 knowledge of the car or of the person will drive the car. The interpretation of the evaluation should make reference to speaker’s understanding of the real world."]},{"title":"2.2 The adjectives in the construction","paragraphs":["As far as the adjectives are concerned, only intransitive adjectives are observed, for examples, wu2","liao2","","boring, chi2","duen4 slow (in thought or action), za2","complicated, bu2","iao4","lian3","shameless, bu4","shuang3","angry,","wue2","xian3","dangerous, jin3","zhang1","nervous. From the data, it is observed that about 70% of the predicates","observed in our data are negative while approximately 30% of these adjectives are positive.","","Table 1: The percentage of adjective quality number percentage examples negative adjectives","120 70% bu4 shuang3","not well, chi2","duen4","","slow (in thought or action),","bu2 iao4","lian3","shameless,","wue2 xian3","dangerous positive adjectives","48 30% shuai4 handsome, xing4","fu2","","happy, hao3","kan4","beautiful,","haoi3","ting1","pleasant to hear","total 168 100%  In this construction, gei3","and ta1","do not keep their respective original function. It carries more grammatical meaning, especially pragmatically. On the one hand, gei3","ta1","could be regarded as an expletive. In English, there is also expletive to stress the emotion of speaker, such as bloody in perbloody-haps, inde-bloody-pendent. Macmillian(1980) claims that infixing is emotive stress amplifier and semantically neutrual. The additional insertion entails emotive factors, such as taboo violation, vehemence, (dis)approval, playfulness and irritation. On the contrary, Adams(2001, 2004) argues that the inserts add lexical meaning to their matrices in addition to emotive intensity. In addition to emotional intensity, it also conveys lexical meaning, such as humor, which depends on its relationship to verbal context at the same time. Growing numbers of examples suggest that the rules of infixing and interposing are changing and more flexible. gei3","ta1","in TM, like bloody in English functions as an expletive to stress emotion. It seems that gei3","ta1","is empty in meaning. But through careful investigation, it implies lexical meaning.","The differences between sentences of these “minimal pairs” lie in the attachment of gei3","ta1",". There is no difference in lexical meaning between the two sentences of the same pair. That means gei3","ta1","is not an obligatory. Like the expletive in English, gei3","ta1","not only involves the amplification of speakers’ emotion, it also has its own lexical meaning. With regard to its function as an emotive stress amplifier, gei3","ta1","changes a detached report of an event into an expression of personal involvement, especially speakers’ unpleasant and undesired feeling. In these pairs of sentences above, sentence a conveys more than sentence b in terms of speakers’ subjective attitude and emotive reaction toward the event being mentioned.","According to Shetter(2000), Spanish, French and German have ethical pronoun to express speakers’ caring. However, in other languages ethical pronoun is first person pronoun. Fogsgaard(2005) claims that what the ethical dative does is “to introduce the enunciator directly in the reference scene of the utterance and so put an extra stress on the interest taken in that scene, the evaluation regarding the emotional importance of the event.” Gei3","ta1","involves two subparts in meaning. One is the source, that is the speaker. The other is the goal of giving, the event or situation being evaluated. In spite of the loss of content meaning of gei3","ta1",", the addition of it reminds addressee the existence of addresser and event. Gei3 Ta1","is somewhat like an ethical dative which highlights speaker’s implication.","Traugott(2003:125) interprets subjectivity as the way in which natural languages, in their structure and their normal manner of operation, provide for the locutionary agent’s expression of himself and his own attitudes and beliefs. Finegan (1995) holds that language expresses not only objective consideration on preposition but also speakers’ perspective, affect and epistemic modality. In addition to stress on speaker’s subjective emotion, the structure in question profiles speaker’s position in utterance reference scene by which speaker has much closer correlation with his utterances."]},{"title":"2.3 The reference of ta1","paragraphs":["Though gei3 ta1","carries more pragmatic function, in order to have sufficient understanding about its","essence, it is absolutely crucial to figure out its lexical meaning. The reference of ta1","will be discussed 271","firstly. Regarding to the antecedent of pronoun, ta1","in our data are classified as pleonastic and referential.","There are two kinds of linguistic references, exophora and endophora. Exophora is reference to","something extralinguistic. For example,","( 10 ) that chair over there is John’s","The words “that” and “there” in the above example are exophoric because they indicate the direction of","the chair referred to. Endophora is to something intralinguistic, i.e. in the same text.","( 11 ) I saw Pam yesterday. She was lying on the beach.","In the sentence “she” is intralinguistic because it refers to “Pam” in prior expression. Based on the data,","referential ta1","could be a type of endophora. It could refer to something else already mentioned in the","preceding utterances. Observation shows that the referential ta1","refers to events, propositions or situations.","According Gundel et al.(2004), events, as well as facts, propositions, situations and other ‘higher-order’","entities are often introduced into discourse by non-nominal constituents like clauses, sequences of clauses","and verb phrase. Similarly, the references of ta1","are expressed by more complicated and higher","constituents.","(12 )a. Zhe4","ci4 de0","ban1","jü4","hen3","duo1","ren2","dao2","This time DE class gathering very many people reach","zhen1","shi4 gei3","ta1","you3","yi4","dian3","jing1","yia2","","really GEITA a kind of surprising","Many people took part in classmates reunion. It really makes me surprised","b. Ming2","tian1","zhong1 wu3","shi4","wuo3","gen1","xi3","huan1","de0","nü3","hai2","tomorrow noon be I and like DE girl","di4","yi1","ci4","dan1 du2","Yüe1","hui4",", gei3","ta1","fen3","jin3","zhan1","the first time separately date GEITA very nervous","I am going to have a date with the girl I love at noon tomorrow. It makes me very nervous.","The reference of ta1","in a is a fact that many classmates attended classmate reunion. Similarly, ta1","in c","refers to one’s first date with the girl he likes. Both events in b and c are presented by clause.","Asher(1993) regards that eventualities have a relatively high degree of world immanence, since such","entities have spatialtemporal location and causal efficacy. Because of the high degree of world","immanence, eventualities are available to immediately subsequent with ta1",". Thus, in summary, ta1","is an","event-related argument. Moreover, the events denoted by ta1","are interpreted as reason contributing to the","final result, such as sentence (13) or a matter or issue on which speakers to make a comment, sentence","(14 ) b. .","( 13) Ting1","lao3 yin1","yüe4","de0","xia2","chan3",",","Listen to old music DE result","jiu4","shi4","hui4 muo4","ming2","gei3","ta1","shang1","gan3","qi3","lai2","JIU BE will without any reason GEITA sad start to","The result of listening to old music is starting to get sad without any reasons.","( 14 ) XX gou4","wu4 wan3","yie4","you3","gou4","gei3","ta1","bu4","zhuan1","yie4","","xx buy objects webpage enough GEITA NOT professional","xx shopping webpage is very unprofessional.","In terms of information structure, presentation of a clausally introduced entity within the topic of an","utterance is one of the ways to promote salience, and bring the entity into focus. Gei3","ta1",", the repetition of","the event mentioned previously not only indicates reasons or topics but also emphasize speaker’s attitude,","feeling.","The pleonastic ta1 could not find any antecedent to refer to, even in the whole context.","(15) a. wuo4","hu3","cang2 long2","zhen1","de 0","gei3","ta1","chao1","hao3","kan4","Crouching Tiger, Hidden Dragon truly GEITA very nice see","Crouching Tiger, Hidden Dragon is really a good movie","b. tai2","wan1","ba1","dian3 dang3","lian2","xü4","jü4","zhen1","shi4","gei3","ta1","bu4","hao3","kan4","Taiwan 8 o’clock soap opera really GEITA NOT nice watch","In Taiwan the soap opera at eight o’clock was really bad."]},{"title":"3. Conclusion","paragraphs":["“(NP) + (intensifier) + gei3 ta1","+ adjective” is a newly developed expression which is","frequently observed in utterances spoken by younger generation in Taiwan. In comparison with the","corresponding expressions in Mandarin, the usage of gei3","ta1","amplifies speaker’s emotional attitude, 272 mostly negative. In some cases, the third person pronoun could refer to an event or situation but in other cases ta1","does not denote anything like a dummy word. The path of change could roughly depicted as:","transfer of object > evaluative situation > textual/metalinguistic meaning >","subjective attitude toward proposition The adequate and explicit path of grammatical change needs deeper investigation. On the other hand, there is still another way to account the change. One of the reviewer suggests that gei3","ta1","could be analyzed semantically as a two-place predicate with an event argument and an individual argument, representing as the following : lamda lamda_x [SP_NEG_ATT(e) & High-Degree (e) & Theme (e,x)] The reason why gei3","ta1","is followed by adjective is that the degree of the event must be specified as a high scale. The analysis provides another perspective to explain this structure. It deserves further investigations. Moreover, the motivations for the change are also another issue which deserve further research. It is assumed that the newly developed structure originates from Taiwan Southern Min because in Taiwan Mandarin the functions of gei3","could correspond to ka7","in TSM. However, the adequacy of the assumption needs further study. "]},{"title":"References  Asher, Nicholas. 1993. Reference to Abstract Objects in Discourse. Boston: Dordrecht, Kluwer Academic. Finegan. E. 1995. Subjectivity and Subjectivisation: an Introduction. In Subjectivity and Subjectivisation eds. by Stein and Wright. pp. 1-15. Cambridge: Cambridge University Press. Fogsgaard, Lene.(2005) Enunciation and emotion: grammatical devices for emotion coding in language. From: http://www.hum.au.dk/semiotics/pdf/emotion_dev.pdf Kubler. Cornelius.C. 1985a. The development of Mandarin in Taiwan: a case study of language Contact. Taipei: Student Book Co. Ltd. Kubler. Cornelius C. 1985b. The influence of Southern Min on the Mandarin of Taiwan. Anthropological Linguistics. Vol. 27. . 156-176. Heine, Bernd., Ulrike Claudi, and Friederike Hünnemeyer. 1991. Grammaricalization: a Conceptual Framework. Chicago: University of Chicago Press. Goldberg, Adele E.1995. Constructions: A Construction Grammar Approach to Argument Structure. Chicago and London: The University of Chicago Press. ______________ 2000. Patient arguments of causative verbs can be omitted: the role of information structure in argument distribution. Langauge Science 23. 503-524. ________________ 2002. Surface Generalizations: an alternative to alternations. Cognitive Linguistics. ________________ and Ray Jackendoff.2004. The English resultative as a family of constructions. Language 80.532-568. ________________2005a. Argument realization: the role of constructions, lexical semantics and discourse. FactorsIn Östman, Jan-Ola (ed. and introd.); Fried, Mirjam (ed. and introd.), Construction Grammars: Cognitive Grounding and Theoretical Extensions. 17-43. Amsterdam, Netherlands: Benjamins. ________________ 2005b. Constructions, lexical semantics and the correspondence principle: Accounting for generalizations and subregularities in the realization of arguments Nomi Erteschik-Shir and Tova Rapoport eds., The syntax of aspect. Oxford University Press. _________________ 2006. Constructions at work: The nature of generalization in language. New York: Oxford University Press. Gundel, Jeanette; Hedberg, Nancy; Zacharski, Ron. 2004. Pronouns without explicit antecedents: How do we know when a pronoun is referential? In Branco, António (ed. and foreword); McEnery, Tony (ed. and foreword); Mitkov, Ruslan ed. and foreword, Anaphora Processing: Linguistic, Cognitive and Computational Modelling. Amsterdam, ","paragraphs":["273"]},{"title":"Netherlands: Benjamins. 351-64. CILT Amsterdam, Netherlands: Amsterdam Studies in the Theory and History of Linguistic Science IV: Current Issues in Linguistic Theory. Macmillan, James B. 1980. Infixing and interposing in English. American Speech 55, 163-183. Lord, Carol, Foong Ha Yap, and Shoichi Iwasaki. 2002. Grammaticalization of ‘give’: African and Asian perspectives. In: Ilse Wischer and Gabriele Diewald eds., New reflections on grammaticalizaiton (Topological Studies in Language 49), 217-235. Amsterdam/Philadelphia: John Benjamins. Shetter, William Z. 2000. My dogs died on me. Pronoun of ‘caring”. http://home.bluemarble.net/~langmin/miniatures/ethical.htm Smet, Hendrik De. & Verstraete, Jean-Christophe. 2006. Coming to termswith subjectivity. Cognitive Linguistis 17-3: 365-392. Traugott, Elizabeth Closs. 1987. From less to more situated in language: The unidirectionality of semantic change. Papers from the Fifth International Conference on English Historical Linguistics. Ed. by Sylvia M. Adamson. Vivien Law. Nigel Vincent, and Susan M. Wright. Amsterdam: Benjamins. Traugott, Elizabeth Closs. 1989. On the rise of epistemic meanings in English: an example of subjectification in semantic change. Langauge 65:31-55. Traugott, Elizabeth Closs and Ekkehard König. 1991. The semantics—pragmatics of grammaticalization revisited. In Approaches to grammaticalization. Vol.1 ed. by ElixabethCloss G\\Traugott and Bernd Hein. Amsterdam/Piladelphia: John Benjamins Publishing Company. 189-218. Traugott, Elizabeth Closs and Richard B. Dasher. 2002. Regularity in semantic change. Cambridge: Cambridge University Press. Traugott, Elizabeth Closs. 2003. From subjectification to intersubjectification. Motives for language change. ed. by Kickey, Raymond. Cambridge, New York Cambridge University Press. 124-139. Tsai,Mei-chih.2002.Yiou","paragraphs":["4"]},{"title":"tai","paragraphs":["2"]},{"title":"wan","paragraphs":["1"]},{"title":"guo","paragraphs":["2"]},{"title":"yü","paragraphs":["3"]},{"title":"de","paragraphs":["0"]},{"title":"yü","paragraphs":["3"]},{"title":"fa","paragraphs":["3"]},{"title":"te","paragraphs":["4"]},{"title":"dian","paragraphs":["3"]},{"title":"kan","paragraphs":["4"]},{"title":"gong","paragraphs":["4"]},{"title":"tong","paragraphs":["2"]},{"title":"yü","paragraphs":["3"]},{"title":", fang","paragraphs":["1"]},{"title":"yian","paragraphs":["2"]},{"title":"zhi","paragraphs":["1"]},{"title":"hu","paragraphs":["4"]},{"title":"dong","paragraphs":["4"]},{"title":". On the interaction between pidgin and dialects from the perspective of grammatical features of Taiwan Mandarin. Papers from The 4","paragraphs":["th"]},{"title":"International Conference on Taiwan Language and Teaching. 1-25. Zeng, Sin-Yi. 2003. Dangdai Taiwan Guoyude Jyufajiegou. The syntax structures of contemporary Taiwanese Mandarin. Master thesis. National Taiwan Normal University. Graduate Institute of Teaching Chinese as a second language.    ","paragraphs":["274"]}]}