{"sections":[{"title":"Exploiting Linguistic Iconism for Article Machine Translation","paragraphs":["Cornelia Zelinsky-Wibbelt University of the Saarlnad, FRG e-mail: cor@dude.uni-sb.de"]},{"title":"Selection in","paragraphs":["1 Introduction This paper is meant to give a cognltive-linguistic explanation of the process of reference. This means that we ate concerned with meaning arising from the speaker's conceptualization of reality. Different ways of referring to the s~me real situation are reflected differently on the expression side of language. We will exemplify this with the use of articles. We deal with two contrasting processes wh/.ch are reflected in NP syntax: on the one hand, this is the selection of a spedfic part of a MAss, which normally has an indefo inite extension. This process results in identification emd hence in ~oken reference (cf. Deelerck 1986:163; Croft 1985; Langacker 1987a). On the other hand we are concerned with type reference to COUNT entities (cf. ibd.), more specifically with how we can talk about the whole kind of an entity which in reality is represented by individual instances. Our ultimate aim is to exploit the cognitive principles by which reference is determined and to hnport them into Machine T~anslation (MT). Traditional MT systems so far have not been concerned with a semantic interpretation mid translation of articles. The translationai relevance of interpreting NP readings has been stressed in different places (cf. Meya 1990; Grabski 1990; gelinsky-Wibbelt 1988, 1901): Bounding by individuatioh of a MASS results in definiteness in Germanic languages (Das Wasser in der Tasse ist sehmutzig. 'The water in the cup is dirty.'). In English type reference to masses is usually expressed by the bare construction as in Wa~er is indispensable, which in German can be expressed both by the definite NP and by the bare construction as in (Das) Wasser ist nnverzichtbar (see e.g. ter Meulen 1988:390). In Spanish a D~.FINITZ NP is usually used for type reference (El espa~ol me gnsta rods que el raso. '1 like Spanish better than Russian.'). Type reference to a COUNT entity by the subject NP may surface in two contrasting structures in French: Uu specta~enr veut voir quelque chose. 'A spectator wants to see something.' Le speeta~eur es~ uu ~tre humaiu. 'The spectator is a human being.' In this paper we will explain the conceptual conditions for type and token reference, which in turn establish the conditions for generating the correct surface structures in the respective target language. We interpret genericity vs. identification by default rules (cf. McDermott & Doyle 1980; Reiter 1980), which should mirror cognitive processing (cf. e.g. Morreau 1988, Schubert & Pelletier 1988). There seems to exist a preference order among the contextual conditions on the restriction or preservation of the unbounded extension of a MASs. This order is based on the degree of prototypicality of the respective reference function: the typicality of the NP's reference function is rendered by the strength which the modo ifiers have with respect to bounding or unbouudlng the entity's normal extension denoted by the noun. The component of default rules has been implemented in the CAT2 system and results in successful article translation. We relate our conceptual conditions to the CAT2 rules given in the annex. DeMing with different ways of reference, the conceptualization of entities will be in the foreground. Entities are denoted by nouns. We assume that words have a basic prototypical sense, which is represented in the lexicon. Senses of decreasing prototypicniity ate related to this prototypical sense by systematic metonymy rules. 2 Reference and prototype semantics It is our ulna to explain how universal and language-specific iconic principles result in different ways of referring to the same tea] situation by using differ-ing syntactic structures. Speakers of different lan~ guage communities, constrained by their different cultures, arrive at different measures of conventionality, salience, relevance and typicality for specific parts of their environment and thus categorize and refer to these in different ways. Our theoretical framework will be prototype semantics (cf. Rosch 1978), because this theory explains how categorization is in line with human judgement. Categorization is the recognition or judgement of some instance as being the same as n previously occurring one~ where the differences which may well exist in reality are then irrelevant for the human conceptualizer. We want to adapt these hmnan strategies of categorisation to a computational interpretation of reference. 2.1 Cognitive constraints on","conceptualization Nouns denote something by virtue of their basic, lexicai meaning. Reference is only achieved when a noun is used in a grammatical construction. The interpretation of a word's meaning in different ways relies on the speaker's capacity to construe alternate cognitive representations of the same real situation and to express this by different grammatical constructions. This is the result of selecting certain substructures from several cognitive dimensions (cf. Langacker 1987c:189ff.): ACrEs DE COL1NG-92, NANnieS, 23-28 AOUt\" 1992 7 9 2 PROC. OF COLING-92, NANTES, AUG. 23-28, 1992 • Along the most significant dimension a speaker divides a scene into profile and base. The base is the necessary background knowledge out of which the profile is singled out as the prominent part. For instance the English words lamb, ewe, mutton and sheep profile different aspects of the common base which consists in the knowledge that we have about a certain animal, namely the aspects of AGE, GENDER I NUTRITION, COLLEC~ TION respectively. The English nouns all translate into the German noun Schaf, which generalizes over all aspects profiled in English. This shows that both the selection of alternate substructures and of different degrees of granularity result in different mental profilings and hence different expressions. * Along the figure/ground dimension the mental foregrounding and backgrounding of the parts which constitute a scene is achieved. For llnguistic purposes the foregrounded part constitutes the trajector (of. Langacker 1987c), which corresponds to the grammatical subject or verb, and the background constitutes the landmark, which corresponds to the grammatical object. • Speakers may mentally image reality from different perspectives. To take Bolinger's example (1975:181): (1) The airlines charge too much. (2) Airlines eharye too much. In the first case the speaker's perspective cointides with the time of speech and the scope of his predication includes all airlines currently existing. In the second case the speaker is farther away from the real situation, so that the scope of his predication includes all airlines of past, present and future (cf. rule (16) in the annex). The conditions for this difference in perspective are not provided within this sentence. * Finally, prototypicality is a dimension along which the speaker construes his cognitive representation of reality. The core of a semantic category relating to a word is represented by the \"optimal\" prototypical instance to which in-stances of decreasing typicality are related (cf. Rosch 1978). A speaker can use an expression in a more or less typical meaning. We have to relate entities to their typicality space, as reference to entities by the predication of a typical property may differ in surface strucnre from reference by predicating a contingent property (Us speefafear vent voir qnelqne chose. 'A spectator wants to see something.' Le speetatenr est nn et~e humain. 'The spectator is a living being'.) 2.2 Conceptualizing external and internal","bounding of entities The following characteristics determine whether an entity is conceptualized as COUNT or MAss, and whether a MASS is conceptualized as HOMOGENEOUS or as HETEROGENEOUS (of. Wiersbicka 1985:335): • unboundedness vs. boundedness * arbitrary vs. non-arbitrary divisibility • pragmatically relevant vs. non-relevant count-","ability Langacker (1987a:63) defines COUNT nouns to denote a hounded region. This implies that COUNT nouns are individuated on the lexical level. It in for this reason that we can coneeptualise several in-stances of a COUNT entity and express this fact by the plural form (cups, rooms, figures). A MAss noun denotes an unbounded region in physical or mental space (butter, water). A MAss is cumulative, that is, different amounts of the same MAss are arbitrarily unifiable without changing the MAss meaning (cf. Quine 1960:91; Bunt 1985; Link 1983). The unbounded extension of a MAss implies that we cannot conceptualize one or several bounded partitions of a MASS per se, s MASS may not be indlviduated without additional linguistic means. HOMOGENEOUS entities, such as those denoted by butter are arbitrarily divisible without losing their constitution and function. The form and function of HETEROGENEOUS MASS entities, such as those denoted by furniture, are violated if they are divided. Langacker's definitions apply to lexical units; they do not exclude n bomtding or unbounding at the level of the NP. If we determine the countability of MAss entities in semantic terms, three classes emerge dependent on their inner constitution (el. Wiersbicka1985:321):","1. For MAss entities conceptualized exclusively as HOMOGENEOUS there exists no possibility of counting them without additional linguistic means. They have no 'built-in modes of distinguishing their reference' (Quine 1960:91). These MAss nouns can, however, adopt the criteria of distinctness, identity and particularity under a specific pragmatic purpose; then a classifier expresses some conventionalized form or function (cL Lehrer 1986, Allan 1977) as in a piece of butter, a glass of water.","2. For COLLECTIVE MASS entities comprising different individuals, such as furniture, there exists no relevant perspective from which they may be counted.","3. Some MAssEs are normally conceptualized as HOMOGENEOUS t but under a pragmatically unusual perspective may also be conceptualized as a HETEROGENEOUS COLLECTIVE entity comprising identical individuals, such as graiu, hair;, for instance one may count hair in order to have a measure for the density of a person's hair. In this situation the individual members are referred to by the plural form (eL Zeliasky-Wibbelt 1992). 3 Multiple ways of reference Type reference to a COUNT entity by default is achieved by attributing a typical property to it: (3) Airlines fly airplanes. If, in contrast to this, we attribute a contingent property to airlines, token reference to some bounded part occurs attd a definite NP expresses the restriction in English: (4) The airlines fly airplanes again. AcrEs DE COL1NG-92, NAm~:S. 23-28 AO~' 1992 7 9 3 P~oc. OF COL1NG-92, NANTES, AUG. 23-28. 1992 Type reference to a count entity may be expressed by a singular definite NP in most European languages: (5) The computer i~ an indispensable ~ool nowada~/s. In this case the totality is referred to by metonymy: one instance is taken to represent the whole kind of computers (cf. Bolinger 1975:182). This generaliza-tion is achieved by the predication of an EVaLUaTION: indispensable is an EWtLUX'rIVE adjective, and if the speaker utters an evaluation this results in a habitual meaning which implies TEMPORAL UNBOUNDEDNESS in the absence of conflicting conditions (cf. rule (14) in the annex). The prototypical type reference occurs to entities desiguated by NPs in subject position, i.e. to entities which are mentally foregrounded as the trajector and located with respect to some property space designated by the landmark NP in object positiou. The latter is usually restricted by the verbal scope of predication, especially if the verb expresses some temporally extended action as in (4). This does not hold for verbs expressing an ATTITUDE or a SEMIOTIC or COGNITIVE action or state as in (22). These verbs imply habituality, i.e. TEMPOItaL UNBOUNDEDNESS which the process has in relation to the speech event, if not restricted by conflicting conditions: (22) The~/ regard computers as important. 4 Contextual bounding a MASS","concept Whereas in German individuated as well as non-individuated entities may be designated by definite NPs, in English only individuated entities may be so designated; non-individuated entities are designated by the bare construction: (6) Das Wasscr in der Tasse isi schmutzig.","---4","The water in the cup is dirty. (7) (Das) Wasscr ist unverzichtbar f~r die Men-","schheit.","___.+","Water is indispensable for humanit~.l. In (6) the definite article expresses that out of the basicaily unbounded MAss water the PP-modifier picks out the quantity which is in the cup as being dirty (cf. Platteau 1980:114; cf. rule (7) in the annex). In (7) the adjective expresses an evaluation about the subject NP, from which u habitual sentence meaning is inferred and the subject NP thereby refers to a totality, hence the bare construction in English (cf. rule (14) in the annex). In order to individuate a specific part of a MASS, this specific part has to be identified by restrictive modification, as the water in the cup in (6) (cf. C. Lyons 1980; Hawkins 1980), whereas the unbounded extension of the Mass is preserved, if the Mass entity has no modifier, as in (7), or if the modifier is not successful in scope narrowing, which holds for non-restrictive modifiers which are themselves conceptualised as unbounded, as in (15) below. We assume that a hearer - following a conversational principle (cf. Declerck 1986:87) - tends to interpret German definite NPs dominating Mass nouns an GENERIC by default, unless semantically restrictive modifiers yield a contrasting interpretation (cf. rule (15) in the annex). In this section we will give the conditions for interpreting German definite NPs and translating them into English. 4.1 Relative clause modification Relative clauses modifying Mass nouns have greatest strength with respect to modifying the reference function. A relative clause inherits the temporal bounded-hess from its verbal predicate. According to Vendler's classification (cf. Vendler 1967, Dowry 1979) TEMPORALLY BOUNDED verbs a~e those which express an ACHIEVEMENT or an ACCOMPLISHMENT of some state of affairs (cf. also Langacker 1987a). In (8) the relative clause - by virtue of its predicate liefcrn, which denotes a~ ACHIEVEMENT","--","narrows down the unboundedness which Information expresses in its basic meaning to that amount which holds for a specific period of time (cf. rule (2) in the annex): (8) Die Information, die 9eliefert wird ... The information which is given ...","(9) Die 1ndasfrie, die entwickelt wird, braucht finauzielle Untcrst~tzun9.","Industry.t, which is being developed, needs finan-","cial support. In (9) the Aktionsart of the modifying relative clause is ACTIVITY, which is unbounded, and hence does not restrict the unbounded extension which industry denotes in its basic meaning (el. rule (4) in the annex). In anaiogy to the Ak~iousart of the verb, the aspect of the relative clause can affect the unboundeduess of MAss entities. In (9) above, the DURaTIVE pect of the relative clause, which implies that the beginning and end of the action is unbounded in relation to the reference time (of. Comrie 1976), is an additional condition for the preservation of the unbounded extension of the Mass. In contrast to this, the RIgTROSPECTIVE aspect of a relative clause, by the completion which the action has with respect to the reference time, results in delimitation of some part of a Mass (cf. rule (3) in the annex): (10) Die lndustrie, die entwickelt worden ist, brauch~","weiterhin .tlnanzielle Unterst~ttznng.","----4","The indastr~y, which has been developed, needs","further financial support. Note again that these conditions only apply in the absence of conflicting conditions which may be provided by a broader context. 4.2 Adjective phrase modification Among the conditions provided by adjective modification the comparison expressed by the superlative has greatest strength in bounding a Mass entity. It fixes the conception of the MJtss entity from all its possible realisations exactly to the degree of the property specified by the adjective, as in sentence (11) (cf. Bierwisch 1989). The result is identification, which is ACTES DE COLING-92, Nnr, rrEs, 23-28 nO(Zr 1992 7 9 4 PROC. OF COLING-92, NANTES, AUG. 23-28, 1992 expressed by a definite NP in English (of. rule (1) in the annex): (11) Die interessantesLe Indusirie enfwiekelt sich. The most interesting industry is developing. NoN-GItADABLE adjectives (e.g. adequate, sufficient, genuine) have a similar effect when modifying MASS nouns. They are also called 'absolute' because they either do or do not apply to an entity as there exists only one reMisation of them; they are concep ~ tuMised as sharply bounded and hence in German definite NPs result in a restriction of the unbounded extension of a MAss as the adjective system- bezoeen ('system-related') (cf. rule (8) in th ...... ). Note that we are concerned here with the translation of German definite NPs into English: (12) Die systcm-bezogene Information fehlt. The systcm-rcla~ed informalion is lacking. This is the unmarked, typical modification of MAss nouns by NON-GRADABLE adjectives. There are, however, NoN-GRADABLE adjectives which stand out as non-typical when modifying a MAss noun. By choosing a LOGATIONAI, or t~ROVE, NANGE adjective as rnodifyer, as in (13) and (14), the speaker merely makes an additional commentary to the inherently unbounded entity by locating it in a conventionalized property space and thus creates a new unbounded MAss (cf. rule (6) in tl ....... ). (13) Die curop~ische Indas~rie cntwickel~ sich.","Eu~vpean industry is dew;loping. (14) Die Koguiiive Linguisfik IJst das Problem.","Cognitive Linguistics solves the problem. GRADAnLE adjectives preserve the unboundedness of a Mass entity in the unmarked case, because GRADAnLE properties, without being contextually fixed by a conventional stzatdard of conlparison, are vague with respect to their degree of realization on a contextually graded scale (eL Dowry 1979:88; Kamp 1975). Genericity and hence indefiniteness results in Engfish (el. rnle (9) in the annex):","(15) Die inleressante Forschung wird nieht gcfdvderl. --t httercsting resea~h is not being supported. Again, this is tile default case of modification by GnADABLE adjectives. An exception are MODAL adjectives which are DI~ONTIC. They restrict the MAss to exactly that partition about which the speaker expresses an obligation (cf. rule (8) in the annex): (16) Die notwendige Forschung wird uich~ gefJrdert. The necessary research is not being supported. COMPARISON adjectives such as similar behave in the same way by identifying the specific part of the unbounded MAss which is compased, ms we can only compare what we can identify (cf. rule (8) in the annex): (17) Die veryleichbare lnformatiou [chit. The comparable information is lacking. 5 Tylle reference to COUNT entities If the speaker refers to the type of a COUNT entity, the indefinite astide expresses that the entity's descrip-tion satisfies its prototypical or \"ideal\" concept (cf. Croft 1985:7-5), or it expresses a certain regularity (cf. Kri~a 1988:287). This results from attributing a typical property to the whole kind of the entity (cf. Declerck 1986:168f.): (18) Ein Zuschauer will ctwas schen. Uu spectateur veut voir quelque chose. 'A spectator wants to see something.' ttere the predicated property defines a stereotype of the species of guschauer in the sense of Putnam (1975), hence this sentence is GENErtIC by default, i.e. it is true even if the predicated typical property does not hold 'inclusively' (cf. Declerck 1986:157L) of all members of tile species of Zasehauer. If no typical property is attributed to the entity, but the entity is classified by a basic domain supereategory, comparable to Heyer's essential property (cf. Heyer 1988:180ff.), a law-like GENERIC reading results, which holds 'inclusively' - without exception - for the whole kind (also referred to as 'nomic' sentences or 'gnomic' by Carlson 1982). Three different NPs may then be used in German, but only definite NPs in French (eL also Winkelmann 1980:97), as shown by the following examples, where guschauer is classified by NXTUrtXL and NOMINAL (SOCIAl:,) kinds: (19) Zuschauer sind Menscheu."]},{"title":"~,e(s) ,pcc~at~,(s} e,~ OonO uu (des) ~tre(,) h~","paragraphs":["main(s). 'Spectators are human beings.'","(20) Der gasehauer is~ ein soziales Wcsea."]},{"title":"Le(s) *p~e*a*eu~(s) es* (so,.) u,, (des) ~t~(s) social","paragraphs":["(sociau~). 'The spectator is a social being.'","(21) Ein Zuschauer isl ciu Meusch. Lc(s) spectaieur(s) est (son~) un (des) ~trc(s) hu-"]},{"title":"m~i,,(O.","paragraphs":["'A spectator is a human being.'","6 Marked type reference by NPs in object position The prototypical type reference occurs with entities in subject position. Generally the scope of the verbal predication restricts the unbounded extension of an entity to which an object NP refers to that quantity for which the verbal predication holds as in (22) (cf. rule (10) in the annex): (22) They sell water. An exception to this rule are verbal predicates which express it MENTAL ACTIVITY or a MENTAL STAT~. ACRES DE COLING-92. NANTES. 23-28 ô{rl' 1992 7 9 5 Pgot:. ot: COLING-92, Nnrcri.:s, AUG. 23-28. 1992 They do not restrict the unbounded extension reletted to by the object NP (cf. rule (11) in the annex), hence the bare construction is used in English and a definite NP in Span~h:","(23) The~/ regard computers as important.","-.----t","Considcran importantcs los ordenadores.","(24) I like Spanish more than Russian. El espa~ol me gasta rods qne el ruso. Here GENERIC reference is achieved by the verbal scope of predication, whose EVALUATIVE meaning applies to the total extension of the entity refered to by the object NP, In the following sentence the ttajector is an individual token which is located with respect to a laudmark which is basically conceptualized as a MASs. The contingent process of writing a text is located with respect to n specific use of a language; the noun Spanish does not refer to the language as such~ but part of it is used at the particular occasion of writing a text. Hence the bare construction in Spanish.","(25) This tczt i~ written in Spanish. ----t Este tezto estd escrito en eslm~ol. 7 Conclusion We have shown how conceptual bounding and unbounding of entities result in different ways of reference. The translational relevance of the process of bounding and unbounding arises from the fact that different languages are sensitive to the process by surface distinctions in different ways. Our nonmonotonic approach to the problem guarantees extensibillty of the rule fragment, that is, we can add rules with conflicting conditions provided by a larger context in the future, when the interpretation is made from n broader perspective, for instance by including discourse phenomena and by using a knowledge base. 8 Annex of Default Rules This annex contains out fragment of default rules, which interpret German NPs in a compositional way, i.e. by unifying the semantic and syntactic features of different lexical and non-lexical nodes of the sentence. The result of this interpretation process is an interlingually constant NP reading out of which the syntactic NP structure is generated. The rule order represents the degree of markedness; the less marked, more typical interpretation only applies after the exceptional marked conditions have failed. In order to facilitate reading we have translated the CAT2 rules into trees and simplified the feature structures to mere labels (The only relations are those enclosed in curly brex.kets: \";\" indicates disjunction, \",\" conjunction). For n mote detailed explanation of CAT2 cf. Sharp 1991. CAT2 consists in stepwise translation between two linguistically motivated leveis, both in source language analysis and in target language synthesis. These levels represent eonfigurational structure and semantic functional structure. The semantic level should contain all information needed for transfer, analysis and synthesis. Our rule fragment is implemented on this level. The structure of the ~ules is based on the DP analysis (cf. Abney 1987, Raider 1988, Olson 1988).","Rule 1 DP ............. i ............. I I","predicate arguaent 1","DETERMINER ~P","£RTICLE IDENTIFYING","DEFINITE ........ ] .......","I I","predicate modifier","S L\"","MASS SUPERLATIVE","Rule 2 DP ............. i ............. [ I","predicate Lr 8u~en~","DETERMINER NP ARTICLE IDENTIFYING DEFINTE ........ I .......","t [","predicate modifier","N S","MASS RELATIVE","TEHPORtLLY","BOURDED Rule 3 DP ............. I ............. [ I predicate ar~ent DETERMINER lip ARTICLE IDENTIFYING DEFINITE ........ [ .......","f l","predicate nodif ier","N S","MASS RELATIVE","RETROSPECTIVE Rule 4 DP","I I","predicate argtmont","DETERMINER NP","ARTICLE GENERIC","DEFINTE ........ I .......","I f","predicate modifier","N CLkUSE","MASS TEMPORALLY","UNSOUNDED Rule 6 DP","t I","predicate arsulent","DETER/~I NEE NP","ARTICLE GENERIC","DEFINITE ........ J .......","I I","predicate modifier","N LP","MASS {LOCATIONAL ;","PROVENANCE} AcrEs DE COLING-92. NAN1ES. 23-28 Aot~r 1992 7 9 6 PROC. OF COLING-92, NANTES. AUG. 23-28. 1992 Rule 7 DP","I i","predicate argmaent","DETERMINER NP","ARTICLE IDENTIFYING","DEFINITE ........ ] .......","I I","predicate modifier","N PP","MASS ~NON-LOCATIONAL.","NON-PROVENANCE} Rule 8 DP ............. I ............. I I predicate argument DETERMINR NP ARTICLE IDENTIFYING DEFINITE ........ [ .......","I I","predicate modifier","R AP","MASS ~SONGRADABLE;","MODAL;","COMPARISON} Rule 9 DP ............. I ............. I I predicate arsmaent DETERMINER NP ARTICLE GENERIC DEFINITE ........ l .......","I I","predicate modifier","R AP","MASS GRADABLE Rule I0 S ................. J ......... I I predicate arsuieut2 V DP ~NON-MEMTAr. ..... I ........... 80N-EMOTIONAL, [ I NON-SEMIOTIC} predicate argtment","DETERMINER NP","NON-DEICTIC RON-GENEHIC Rule 11 S ................. [ ..... l I predicate arsuzent2 V DP ~MENTAL; ........ I ..... EMOTIORAL; I I SEMIOTIC} 8or argument","DETERMINER NP","SON_DEICTIO GENERIC Rule 13 S","I I I","predicate arSlmentl argtment2","V DP AP","COPULATIVE ..... I ........ (NONGRADABI,E;","I I MODAL;","RoY argument COMPARISON} DETEImINER I/P NON-DEICTIC IDENTIFYING","I","R","MASS","Rule 14 S","................. [ ...............","I I I","predoicate argt~entl it~gtment2","V DP AP","COPULATIVE ..... [ ........ EVALUATIVE","I I","8or argument DETERMINER NP NON-OEICTIC GENERIC","I","N","MASS","Rule 15 S .............. I ........... I i I","predicate arsument I * V DP ............. i ......... I I predicate argtment DETERMINER NP ARTICLE GENERIC DEFINITE I","R","MASS","Rule 16 S .............. ] ........... I I I","predicate argtment 1 * V DP","TEMPORALLY I","UNBOUNDED I ............. i ........ I I predicate arRttment DET NP ZERO GENERIC","i","gov","S","PLURAL References","[1] Abney, S. P. 1987 The English Noun Phrase in its Seutcntial Aspect, Ph. D. Dissertation. Cambzidge/Mass.MIT.","[2] Allan, K. 1977 Classifiers. Language 53.285-311.","[3] Van der Auweza, J.(ed.) 1980 The Semantics of DeterminerJ. London. Croom Helm.","[4] Bierwisch, M. 1989 The Semantics of Gradation. In: Bierwisch, M. & E. Lang (eds.) Dimensional Adjectives. Grammatical Structure and Conceptual Interpretation. Spzinger-Vezlag. Berlin.","[5] Bollngez, D. 1975 A Postscript to Postnn on the Article. The Modern Language Journal 59 (4). 181-185.","[6] Bunt, H. 1985 Mass Terms and Model-Theoretic Semantics. Cambridge University Press. Cambridge.","[7] Caxlson, G. 1982 Generic Terms and Generic Sentences. Journal of Philosophical Logic 11.145-181.","[8] Cnmrie, B. 1976 Aspect Cambridge. Cambridge University Press. ACrEs DE COLING-92, NANTES, 23-28 hol~r 1992 7 9 7 PROC. OF COLING-92, NANtes, AUG. 23-28, 1992","[9] Croft, W. 1985 Determiners and Specification. In: J. Hobbs, J., T. Blenko, W. Croft, G. Hager, It. A. Kautz, P. Kube, & Y. Shoam. Common-sense Summer: Final Report. CSLI Report 85-35.","[10] Croft, W. 1991 Syntactic Categories and Grammarital Relations: The Cognitive Organiza-tion of Information. Chicago University Press, Chicago.","[11] Declerck, R. 1986 The Manifold Interpretations of Generic"]},{"title":"Sentences.Lingua","paragraphs":["68.149-188. [12] Dowty, D. R. 1979 Word"]},{"title":"Meaning and Montague","paragraphs":["Grammar. The Semantics of Verbs and Times in Generative Semantics and in Montague's PTQ. Dordrecht, Reidel.","[13] Grabski, M. 1990 Transfer Statements as Condi~ional Constraints. EUROTRA-D WORKING PAPERS 18.","[14] Haider, H. 1988 Die Struktur der deutschen NP. Zeitschrift f'~r Spraehwissenschafl 7 (17.32-59.","[15] Hawkins, J.A. 1980 On Surface Definite Articles. In: J. van der Auwera (ed.)","[16] Heyer, G. 1988 A Frame-Based Approach to Generic Descriptions. In: Krifka, M. (ed.). 1988.","[17] Krifka, M. 1988 Genericity in Natural Language. Proceedings of the 1988 T~ibingeu Conference. Seminaz ffir natfirlich-sprachliche Systeme. T~bingen.","[18] Langacker, R. 1987a Nouns and Verbs.Language 63 (I).53-94.","[19] Langacker, R. 1987c Foundations of Cognitive Grammar. Theoretical Prerequisites. Vol. 1. Stanford University Press. Stanford.","[20] Lehrer, A. 1991 Polysemy, Conventionality and the Structure of the Lexicon. Cognitive Linguistics 1-2.207-246.","[21] Link, G. 1983 The Logical Analysis of Plurals and Mass Nouns: a Lattice-theoretical Approach. In: Baeuerle, R., C. Schwaxze, A. yon Stechow (eds.). Meaning, Use, and Interpreta-tion of Language. Walter de Gruyter, Berfin.","[22] Lyons, C. G. 1980 The Meaning of the English Definite Article. In: J. van der Auwera (ed.).","[23] McDermott, D. & J. Doyle 1980 Nonmoaotonic Logic I.Artifieial Intelligence 13.41-72.","[24] Meya, M. 1990 Tenets for an InterUngual Representation of Definite NPs.In: Proceedings of the l $th International Conference on Computational Linguistics, Helsinki, Vol.2","[25] Morreau, M. 1988 Default Formalisms for Generics. In: Krifka, M. (ed.). 1988.","[26] Olson, S. 1988 Die deutsche Nominalphrase als 'Determinalphrase ~. In: Olson, S. & G. Fanselow (eds.). Akten der Parametersektion der 11. Jahrestagung der DGfS, Osnabrfick. T~bingen. Niemeyer.","[27] Putnam, H. 1975 The Meaning of 'Meaning'. In: Gunderson, K. (ed.) Language, Mind, and Knowledge.. University of Minnesota Press. Minneapolis.","[28] Platteau, F. 1980 Definite and Indefinite Generics. In: Van der Auwera (ed.)","[29] Qnine, W. 1960 Word and Object. MIT Press. Cambridge.","[30] Reiter, R. 1980 A Logic for Default Reasoning. Artificial Intelligence 13. 81-132.","[31] Roach, E. 1978 Principles of Categorilation. In: Rosch,E. & B.B. Lloyd (eds.) Cognition and Categorization, ttillsdale. Erlbaum.","[32] Schubert, L.K. & F.J. Penetier 1988 An Outlook on Generic Statements. In: Kritka, M. (ed.). 1988.","[33] Sharp, R. 1991 CAT2 - An Experimental EUROTRA Alternative. Machine Tanslation, EUROTRA Special Issue 1.","[34] Ter Meulen, A. 1988 Semantic Constraints on Type~shlfting Anaphora. In: Kriflm, M. (ed.). 1988.","[35] Vendler, Z. 1967 Linguistics in Philosophy. Cotnell University Press. London.","[36] Wiersbicka, A. 1975 Oats and Wheat: The Fallacy of Arbitrariness. In'. J. Halman(ed.). Iconicity in Syntax. 311-342. Amsterdam, John Benjamins. 1975","[37] Winkelmann, O. 1980 Some Reflections on the French Article System. In: Van der Auwera"]},{"title":"Ced.).","paragraphs":["[38] Zelinsky-Wibbelt, C. 1988 Universal Quantifica-tion in Machine Translation. In: Proceedings of the 12th International Conference on Compuiational Linguistics, Budapest. 791-795.","[39] Zelinsky-Wibbelt, C. 1989 Machine Translation Based on Cognitive Linguistics: What Lexical Semantics Contributes to the Semantic Unity of the Sentence. EUROTRA-D Working Paper 16.","[40] Zelinsky-Wibbelt, C. 1991 Token Reference vs. Type Reference: Implications for Machine Translation. Machine Translation, EUROTRA Special Issue 1.","[41] Zelinsky-Wibbelt, C. 1992 forthcoming Reference as a Universal Cognitive Process: a Contrastive Study of Article Use. In: Getter, R. (ed.)A century of Reference. Now available as: EUROTRA-D WORKING PAPERS 21. Acr~ DE COLING-92. NANTEs, 23-28 AOt]T 1992 7 9 8 PROC. OF COLING-92, NArCrES. AUG. 23-28, 1992"]}]}