{"sections":[{"title":"A TENSE AND ASPECT CALCULUS","paragraphs":["DIANA SANTOS INESC, R. Alves Redol, 9, P-1000 Lisbon, Portugal dms¢inesc, inesc .pt may be used for further reasoning, by assuming it in the absence of contradictory information. Further investigation should be done to connect these non-monotonic reasoning aspects. There may be more true statements than those that can be proved. However, this seems to be a correct property for a system modelling natural language: Ordinarily, we only express relevant facts -- not all true facts."]},{"title":"2 The method","paragraphs":["The departing points are aspectual classes (stored in the lexicon) and morpho-syntactic information (tenses, aspectualizers, adverbs, particles, subbordinated clauses, etc., which we presume are given by former syntactic processing).","Aspectual classes will be translated by simple formulas talking about times (intervals, points or unspecified with regard to this distinction) or conjunctions or disjunctions of these.","The other mechanisms will be described by implications. The formulas on both sides refer directly to the aspectual classes instead of their respective translations, enabling us to express significant generalizations. Let us make some remarks on the intended meaning of the logical connectives. OR (V) links different properties of an object. That is, taken in isolation, that NL fragment or device has all those properties, irrespective of the fact that it may never exhibit them together in actual use. It will be the role of other constituents in the text to select the intended reading. However, that selection is not compulsive, which means that OR represents linguistic vagueness. Example: An acquisition (see below) like remember may be used in an inehoative reading (-~ come to my mind~ \"After some time, I remembered it\"), or in a stative reading (= be in my mind, \"~I still remember it\"}. But none is enforced in UDead men do not remember ~. AND (A) connects a set of properties of a single occurrence, even if some do not occur (but they"]},{"title":"Abstract","paragraphs":["This paper focuses on a theory of tense and aspect (the representation of time in natural language) that attempts a formM representation of the relevant liltguistic devices as implication rules in first order logic. It presents a rich ontology as far as verb aspect is concerned, distinguishing between complex patterns and vagueness. Examples and conclusions are drawn from tile comparison between English and Portuguese, pinpointing the importance of contrastive studies both for the understanding and for the evaluation of a general theory of tense and aspect. In the paper, we present the actual translations of a wide range of phenomena, and a short example."]},{"title":"1 Introduction","paragraphs":["The method we propose to represent and reason with tense and aspect (T&A) in natural language has several distinguished features:","It is both used in the building of the semantic representation of natural language text, and in the inferences allowed from what was actually said. There is therefore no conceptual separation between parsing and reasoning.","It is based on a two-step translation into first-order predicate calculus, that allows us to use standard logic while preserving certain generalizations, i.e., some (sets of) patterns of temporal relations are identified as lexicalizing an aspectual class, and T&A mechanisms are expressed in terms of the latter. Grammatical mechanisms are translated into simple implications. On one hand, they restrict / identify the set of situations they can apply to, while they may also introduce lexical information of their own. This second property allows for an elegant treatment of redundancy, in addition to an obvious explanation for their stand-alone occurrence (cf. begin or just). Being proof-theoretical, the meaning of a sentence or text is what can be proved. If other information is brought to focus but not proved, it ACTeS nE COLING-92, NANTES, 23-28 hot3\"r 1992 1 I 3 2 PROC. OI: COLING-92, NANTES, AUG. 23-28, 1992 may). The several properties conjoined are related for each actual occurrence; they are several faces of the same situation; and no vagueness is at stake. AND links the several ways people may choose to present a given situation (called view-point aspect in [12[). Example: An accomplishment like build may be used in a durative description (\"He was building it slowly\"), or in a resultative description (\"He built it in two years')~ referring nevertheless to the same event. Or, in an achievement like leave, the period when a person is leaving surrounds the moment of leaving. The lefthand side of an implication represents the conditions which are required to the felicitous use of the mechanism. In case not all information is available, it may provide the sort of defeasible information that can be seen as the type coercion proposed in [81 . A sentence has a meaning iff there is at lea~t one derivation including all components. If there is more than one, the alternatives will stand in an OR relation, and one will probably be selected by the following co-text. Example: \"He was attending a course on seman. tics\" could mean ~he would\" at a future time point relative to the past in question, or that he was actually attending it. Syntax defines what are the possible arguments to the operators, thus driving inference and disallowing certain combinations. One way to model this fact is to allow syntactic structure itself to introduce axioms or metaaxioms, restricting inference order. We stick to compositionality, but assign a non-trivial meaning to syntactic structure, contrarily to e.g. [1]. The method thus reduces to applying simple resolution to get all possible derived information, and possibly get rid of different interpretations. The set of all asserted formulas in the system is what it can understand.","We will now argue for this method's adequacy to handle natural language tense and aspect systems by presenting linguistic motivation from two different languages (English and Portuguese), see [10] for more detail. At the same time, we give novel treatments of well-known phenomena. These two points, we think, should be considered independently. That is, one can accept the general calculus yet proposing totally different translations, or on the contrary, import our linguistic solutions into a distinct framework."]},{"title":"2.1 Aspectual classes","paragraphs":["Aspectual classes indicate the temporal constituency of the situation they describe. They range from states (without any restrictions what-soever, or better, with no internal temporal dimension) to accomplishments or achievements that include a complex temporal pattern in their lexical"]},{"title":"ITleaning.","paragraphs":["They can~ moreover, represent vague concepts that materialize in different temporal patterns, with some common core meaning, as was described above. Our ontology is based solely in temporal properties, thus cause or agentivity are considered separate information, contrary to the overwhelming majority of aspectual classifications (cf. the overview in [14]). In the figure next page, T represents an unspecified temporal object, which can denote either an interval, I, or a time point, t. We define three 'basic' classes, corresponding to three irreducible temporal patterns, and then five others in terms of the former, with some additional \"low-level\" conditions, linking the temporal variables among the elementary intervening aspectual class definitions. The sole reason why we did not define other combinations is that we did not find, in the languages studied, examples of lexical items that covered such complex patterns. For a more detailed exposition of the classes and objective criteria for distinguishing between them in Portuguese, see [11]. Still, some remarks are in order here:","1. We distinguish between changes and achievements since elements of the first class cannot be amplified in time, that is, they have to be punctual, like notice or discover, while the others also involve some encompassing time connected to them: leave, die, open. This shows in the acceptance of the progressive by the latter.","2. We distinguish act-states from states, on one hand, for its well-formedness with the progressive, and from activities, on the other, because their present tense implies the progressive. Example: He lives there, it hangs from there =,~ he is living there, it is hanging there. 1","~They were mentioned as problematic in [4] and ela~ed together in {3]. ACTES DE COLING-92, NAICrEs, 23-28 AO~r 1992 1 1 3 3 PROC. OF COLING-92, NANTES, AUG. 23-28, 1992"]},{"title":"state(P) ~ P(T) act(P) ~ P(I) change(P) ~ P(t) A notQ(i) A Q(t) A initial(i, I) A final(t, 1) ace(P) ~-~ act(P) A change(R) A final(t, I) =- P(I1) A R(t) A notQ(i) A Q(t) A initial(i, I2) A final(t, I~) A final(t,","paragraphs":["I1)"]},{"title":"ach(e) ~-~ act(P) A change(P) A inside(t, 1)","paragraphs":["------ P(I1) A"]},{"title":"P(t) A notQ(i) A Q(t) A initial(i, 1~) A final(t, I~) A inside(Iz, It) act - state(P) ~ act(P) V state(P) A inside(T, [) =-- P(I)","paragraphs":["V"]},{"title":"P(T) Ainside(T,I) acq(P) ~ change(P) V state(P) A initial(t,T)","paragraphs":["-- P(t) A notQ(i) A Q(t) A"]},{"title":"initial(,', I) A fi.al(t, I) v P(T) A initial(t, T) series(P) ~ change(P) V act(P) A initial(t, I) =- e(t) A notQ(i) A Q(t) A initial(i, I) A final(t, I) V P(I) A initial(t, I)","paragraphs":["3. We name acquisitions those verbs which express both the change that takes place and the resulting state, such as"]},{"title":"remember, understand, know.","paragraphs":["They can be operationally pinpointed by the simultaneous acceptance of present tense and of point adverbials like"]},{"title":"suddenly","paragraphs":["in the past. ~","4. Finally, series can mean both an individual change and a set of them. s They accept both frequency and duration adverbs in the simple past:"]},{"title":"Example: He coughed all night~once.","paragraphs":["The temporal indices have roughly the same status of those in the semantic representation of UCG(15], except that we do not impose one (sole) index per formula. We differ also in that we are not committed to a basic ontological distinction between states and events, and that instead of those indexes we use plain temporal objects. 2.2 Grammatical mechanisms Grammatical mechanisms are defined in terms of \"simple\" aspectual classes instead of a full translation into predicates of time. We further need two basic operations, namely state creation (Slat) and activity creation (Act):"]},{"title":"Slat(P) = PO Act(P) = act(Q)","paragraphs":["The first abstracts from time, to model what we call temporal intensionality (i.e., non-dependence on temporal extension). The second creates a new activity ranging over an interval containing","2In Portuguese, where this clals is bigger, there is clearer evidence~ namely the existence of a straightforward difference in meaning between the two \"simple pasts\", Perfelts and Imperfeito. References to this class (uanmned) can also be found in [4} and [6 I,","aln this last sense, they correspond to the ones in [5]. [9] uses the name \"actions\" for our series. more than one instance of P, or, equivalently~ covering an unhomogeneous temporal region where P is true. The introduction of these two operations corresponds to our belief that there is more to sentence aspect than verbal aspect, contrarily to what most classifications and calculi have as-sumed without questioning. It seems to us that the latter is a proper subset of the former. Thus, it makes perfectly sense to let morphosyntactic (i.e., non-lexical) mechanisms introduce new aspect properties that cannot be found at the lexical level. Let us now present some contrastive analyses:"]},{"title":"Progressive act(P) ~ P(t) A inside(t, I) Progressive P :=¢, Slat(Q) A","paragraphs":["Q(T)A"]},{"title":"P(t) A before(T, t) A short(T) Estar act(P) -~ P(t) A inside(t, I)","paragraphs":["By the first definition 4, progressive applies to activities, achievements and acquisitions, and is automatically true of act-states, or rather: for that class, the progressive and the non-progressive versions are equivalent. The second definition encompasses the fllturate reading and stative uses such as"]},{"title":"He is resembling his father more and more.","paragraphs":["With accomplishrnents, progressive may be ambiguous between tile two."]},{"title":"Estar,","paragraphs":["the Portuguese progressive, has only the first English reading."]},{"title":"SirnplePres P =~. Slat(P) A P(now) Presente P ~ Slat(P)","paragraphs":["A P(T)A"]},{"title":"inside(now, T)","paragraphs":["The English definition allows for the timeless truths X are Y and property readings such as"]},{"title":"She dances,","paragraphs":["while the Portuguese one accounts for the fact that we say"]},{"title":"Estou em Lisbon hd £ anos","paragraphs":["(\"I'm","4Whenever there are several definitions of tile same operator~ an OR is intended. ACZF.S DE COLING-92, NANTES, 23-28 AOr~T 1992 1 1 3 4 PROC. OF COLING-92, NANTES. AUG. 23-28, 1992 in Lisbon (since) two years ago\"-- in English the present perfect should be used), or"]},{"title":"Estou em Lisbon atd damingo (\"I'm","paragraphs":["in Lisbon until Sunday\")."]},{"title":"lmperfeito P :~ state(P)","paragraphs":["A P(T)A"]},{"title":"before(7', now) Per felts ~ final(t, T) A before(t, now) SimplePast P ~ before(t, now) Perfect P ~ final(t,T) At <. T.~/',Q(T2)","paragraphs":["Tim above accounts for the following facts:"]},{"title":"I have run","paragraphs":["means I've finished (and similarly for any accomplishment/achievement), and that it gets translated by the Portuguese Perfeito in all those cases. Also,"]},{"title":"I had run","paragraphs":["means it was finished before the time I am talking abou, t. Finally,"]},{"title":"to have done","paragraphs":["definitely means completion. We can also derive tim meaning of the present and past perfects:"]},{"title":"PresPerf P ~ final(t,T) A t 5~_ T2A","paragraphs":["Q(7~) A"]},{"title":"Stat(Q) A inside(T2 ..... ) PastPerf P ~ final(t,7\")","paragraphs":["A t < 7:~A"]},{"title":"Q(T2) A Stat(Q) A before(T2, now) Just final(t,T) 2, t < 7'.z ~ initial(t, I) A final(T2, I) A short(I)","paragraphs":["This definition allows one to apply"]},{"title":"just","paragraphs":["only fi~r perfect tenses, and also to make"]},{"title":"just","paragraphs":["a function of measure, thus domain dependent (by the use of the predicate"]},{"title":"short).","paragraphs":["Present perfect with"]},{"title":"just","paragraphs":["is translated in Portuguese by the aspectualizer"]},{"title":"aeabar","paragraphs":["(syntactically, a verb taking the preposition"]},{"title":"de","paragraphs":["before the infinitive verb)"]},{"title":"Acabar act(P) A final(t, 11) ~ act(Q)A final(t, 12) A final(12,","paragraphs":["11)"]},{"title":"Acabar P(t) ~ initial(t, I) A final(T:, l)A short(I) acabar","paragraphs":["(see [2]) may either specify the last interval of an activity with definite end, or a short interval after a point event (change). This makes it ambiguous for accomplishments."]},{"title":"PC act(P) A final(t,","paragraphs":["T) -~"]},{"title":"before(now, t)A initial(i, T) A before(i, now) PC P","paragraphs":[":>"]},{"title":"Act(P) A final(now, I)","paragraphs":["If Perfeito Composts (PC) takes an accomplishment, PC rueans the final is not yet over:"]},{"title":"Tenho eonstruido a minha easa","paragraphs":["(I have been building my house). If it takes an activity, it means a set of distinct actual activities up to now:"]},{"title":"Tenho cotrids","paragraphs":["(I have run lately). If it applies to a state, PC may represent a set of distinct states or an homogeneous up-to-now state:"]},{"title":"Tenho estado aqul todas as quartas / desde as 3,","paragraphs":["just like its English present perfect translation (\"I've been here every Wednesday / since 3 o'clock\"), it should be mentioned that apart from states, the English translation of PC requires the adverb"]},{"title":"lately. Lately flnal(t,","paragraphs":["7\")"]},{"title":"A t <_ T~ ̂inside(T~, now) initial(t, I)/~ final(now, I)/~ short(I)","paragraphs":["Tile formula above says that"]},{"title":"lately","paragraphs":["requires the present perfect, and implies t < T~. This is justified if we note that even though states can be used with present perfect and"]},{"title":"lately","paragraphs":["in English, this use requires that tile state does not extend til now:"]},{"title":"Have you been here latelyf","paragraphs":["would other-wise not make sense."]},{"title":"Andar P(t) ~ Act(Q) Andar act(P) :~- act(Q) A inside( lz, I1) Andar","paragraphs":["either creates a big activity out of small events, or selects a subactivity inside one. English renderings of the first meaning are"]},{"title":"keep -ing, now and then","paragraphs":["or tim iterative progressive. The second is usually translated by the progressive (check the similarity with our translation of the English progressive). 2.3 Connectors Connectors relate two different tense-aspectual descriptions and are realized ms temporal connectives or prepositions. To clearly indicate their double input, we will use the symbol & to separate the conditions from the first and the second arguments (the second is the one immediately following the connector)."]},{"title":"At P(t)&Q :~ Q(t) While act(P) v P(t)&act(Q) :> inside(Te, I0)","paragraphs":["While the translations above do not explain the different interpretations arising from different positioning of the arguments, we believe that this is precisely the kind of information that should be brought by syntax, though for tile moment we do not have a precise formulation for it. 3 Example Example: \"Many people died yesterday\". die:"]},{"title":"act(die) A change(die) A inside(t, ll)","paragraphs":["yesterday:"]},{"title":"P ~ before(T,,tow) A","paragraphs":["day(T) A 0 <"]},{"title":"T - now < 24h A inside(Tp,","paragraphs":["7\") simple-past:"]},{"title":"P ~ before(T, now)","paragraphs":["plural-NP: P =>"]},{"title":"Act(P) 5","paragraphs":["die-yesterday:"]},{"title":"act(die) A change(die) A inside(t,I) A before(T, now) A day(T) A inside(t, T) A inside(I, T)","paragraphs":["died-yesterday:"]},{"title":"act(die) A change(die) A inside(t, I) A befo~e(T,.o,O A day(T) A inside(t, T) A inside(l, T)","paragraphs":["SSince we are dealing only with tente-~pectual phenomena, we ~implify plural noun phrases interpreting them ;~s activity creation. AC:IEs DE COLING-92, NAN'rI~S, 23-28 Ao(Yr 1992 1 1 3 5 PROC. OF COLING-92, N~̂rrl!s, AUG. Z3-28, 1992 many-people-died-yesterday: Act(act(dle)) A Act(change(die)) A ... This example deliberately reflects an important issue, namely, the relevance of non-verbal constituents to the overall aspect, which is the subject of most calculi (see [13] or [7]). We agree with Krifka [7] on that, as aspect marking on noun phrases in several languages demonstrates, there is no fundamental difference in the import brought by lexical aspect, be it of verbs or other parts of speech. When we postulate a verbal aspect as opposed to sentence one, thus, the stress should be on lexical rather than verbal. What is particular to our approach is the belief that grammatical means (syntax or tense) may purport significant aspect properties not available (or not present) at the lexical level."]},{"title":"4 Discussion","paragraphs":["From a descriptive point of view, the system provides a liner characterization of verbs, drawing an important distinction: that between the parts of a same situation and a don't care or vagueness associated with a lexical item (the first is related to the perception of an action by a speaker of a language; the second is related to the language system / lexicon).","Second, it is based on a linguistic comparison of two distinct languages, therefore making it applicable at least to more than one. This makes it also of interest for machine translation research. Third, we expect a system thus formalized to be easy to extend, simply by adding new and subtler constraints in the form of implications and/or complex syntax import, and not bothering with the reasoning algorithm, by using standard logic. Finally, we think that this method has significant advantages compared to applicational models in the treatment of redundancy. Redundancy is a pervasive property of natural language, but it is hard to model when one device is required to apply before another, each bringing different information. In this account, on the contrary, similar information brought in twice does nothing but assert it once. To conclude, we should acknowledge that given the early stage of this investigation, no implementation and thus testing results are yet available."]},{"title":"5 Acknowledgements","paragraphs":["I am indebted to JNICT who granted me a PhD scholarship, and to IBM Portugal for support of my studies. Most of the ideas present in this paper arose from stimulating discussions with Lauri Carlson."]},{"title":"References","paragraphs":["lll Calder, Jonathan, Mike Reape & Henk Zeevat. \"An algorithm for generation in Unification C, ategoo rial Grammar\", in Proceedings of the 4th Conference of the European Chapter of the ACL, (Manchester, 10-12 April 1989), ACL, 1989, pps. 233-40. [2] Campos, Henriqueta Costa. \"Ambiguidade lexical c represeata~5o metMinguistica\", Boletim de Filolo-9ia, Tomo XXX, 1985.","13] Carlson, Lauri. \"Aspect and Quantification\", in Tedeschi & Zaenen (eds.), Syntax and Semantics, Volume 14: 7~nse and Aspect, Academic Press, 1981.","[4] Dowry, David R. Word Meaning and Montague Grammar, Dordrecht: D. Reidel, 1979.","I51 Freed, Alice F. The Semantics of English Aspectual Complementation~ Dordrecht: D.Reidel, 1979."]},{"title":"[6]","paragraphs":["Hein~anS.ki, Orvokki. \"Aspect in FinuiMl', in de Groot & Tommolay {eds.), Aspect bound: a voyage into the realm of Germanic, Slavonic and Finno-Ugrian Aspectology, Forts, 1984. {7] Krifka, Manfrsd. \"Thematic Relations as Links between Nominal Reference and Temporal Constltu~ tion', in Sag & Sabolsci {eds.}, Lexieal Matters, Chicago University Press, 1991. 181 Moens, Marc. \"Tense, Aspect and Temporal Reference\", PhD thesis, University of Edinburgh, 1987."]},{"title":"191","paragraphs":["Ritchie, Graeme D. \"Temnoral Clauses in English\", in Theoretical Linguistics 6, 1979~ pp.87-115. [101 Santos, Diana. \"Contrastive Tense and Aspect Data\", [NESC Report hr. RT/57-91, 1991. Ill] Santos, Diana. USobre a caracterita(;~o aspectual dos verbos portugueses', to appear in Actas do 7. Encontro da Assoeiaf(to Portuguesa de Lingulstica, {Lisbon, 7-8 October 1991), 1992. [121 Smith, Carlota S. The Parameter of Aspect, Kluwer Academic Publishers, 1991. [13] Vcrkayl, H.J. On the compositional nature of the aspects, Dordrech¢: D.Reidel, 1972. [14] Verkuyl, lt.J. \"Aspectnal classes and aspectual composition\", in Linguistics and Philosophy 1~, 1989, pps.39-94. [15] Zeevat, Henk, Ewan Klein & Jo Calder. \"Unification Categorial Grammar\", Research Paper EUCCS/RP-21, Centre for Cognitive Science, University of Edinburgh, December 1987. ACRES DE COLING-92. NANTEs. 23-28 AOt'~\" 1992 1 1 3 6 PROC. OV COLING-92. NANTES. AUG. 23-28, 1992"]}]}