{"sections":[{"title":"LA RESOUTION D'ANAPHORE A PARTIR D'UN LEXIQUE-GRAMMAIRE DE45 VERBES ANAPHORIQUES","paragraphs":["Blandine GEL.AIN & Gelestin SEDOGBO 26 place Ovale BULL cediag 94230 Cachan 78430 Leuveciennes","(France) Abstract This paper presents a system which intends to resolve anaphora in the framework of the Discourse Representation Theory, arrd using a lexicon-grammar of anaphoric verbs, through the application of selection criteria for assignment of a referent to an anaphora. From a semantic representation of text provided by a DRT system implemented in Prolog, the system uses several criteria of selection of referent. One of these criteria is the anaphoric conditions of verbs described as a lexicon-grammar of anaphoric verbs. The present paper investigates a transformational analysis of verbs related to their anaphoric behaviour, and the adequacy of extension of the lexicon~grammar of MGROSS to anaphonc conditions on verbs. 1. Introduction La Th~orie de la Representation du Discours (ou DRT 1) propose une approche unifiee de phenom~nes du langage naturel tels que le temps, I'evenernent, I'anaphore Elle se caracterise par sa filiation avec la semantique Iogique, et sa distance d'avec les niveaux de representations basees sur la Iogique des predieats et ses extensions. Ainsi les notions de consequence Iogique et de validite ([SEDO 87]) peuvent s'appliquet naturellement aux structures maniputees par la DR1 Cette theorie propose une explication de la formation de I'anaphore, sans en proposer ta resolution. Celle-ci passe en general par I'application de orit~res de selection syntaxiques, semantiques et pragmatiques, qui levent les ambiguites engendrees par t'usage de I'anaphore. [GUIN 85], [CARB 88], [RICH 88] entre autres ont intloduit les notions de foyer et de contramtes successives 8 activer Cependant cos criteres sont paffois insufiisants pour etablir une relation evidente entre un nomet un pronom Dar~s sa theorie du Oouvernement-liage, 1 H.KAMP \"A Theory of T[uth and SemarY0c Interpretation\" GroP.nendiik Amsterdam 1-(:JR t NCHOMSKY 2 explique I'anaphore ~ partir d'un mecanisme de liage et s'appuie sur la remarque que le liage d'une anaphore A son referent depend aussi des proprietes anaphoriques du vetbe. Aucune etude empirique des proprietes anaphoriques n'a ete faite ~) ce jour, alors que toute approche de resolution d'anaphore devrait etre basee sur un texique des verbes et leurs proprietes anaphonques associees. Le present article decdt une approche de resolution d'anaphore qui repose sur:","- la mise en oeuvre de ta DRT pour representer la semantique d'un discours;","- I'elaboration d'un lexique-.grammaire des verbes anaphotique@;","- un systeme de filtre base stir differents criteres de selection Ce systeme illustte la resolution automatique de certaines anaphores en partant de la representation semantique d'un texte obtenue d'apres la DRT los ptonoms que nous avons etudies font partie d'un type d'anaphore qui represente une relation pouvant s'etablir entre deux phrases saris mettre forcement en jeu une regle syntaxique (le pronom pout identifier un referent dans le discours precedent): Jean croit que Mane IU/ offre un //we Cet article est divise en cinq parties: introduction ~ notre travail, presentation de la DRT, puis de son implementation en Prolog, description des lexique-grammaires et leur extension aux proprietes anaphoriques, presentation generale de I'architecture de notre systeme de resolution, et enfin perspectives de creation systematique d'un lexique-grammaire. 2. La reprdsentatlon s~manticlue La DRT se fonde done sur un ensemble de regtes de construction traduisant un disoours en une representation semantique formelte: la Structure de Representation du Discours. Pour chaque pattie de discours, une DRS est construite, boite pouvant err contenir d'autres, 2 \"Government Binding\", notee GB 3 Exlension des tables de verbes d#vetoppt~es au LADL, aux propri~tes anaphonques (cf [GELA g2]) Ac:iEs DE COLING-92. NAtCI~S, 23-28 AO~£ t992 90 1 PROC. OI; COLING=92, NANI'E,'I. AUG. 23-28, 1992 qui reprL~sente le contenu significatif de cette par'tie Une DRS complete est I'ensemble de plusieurs DRSs apparaissant t~ mesure que le discours continue. La DRT etudie doric les contraintes sur cette continuation. La forme d'une DRS consiste en une paire <U,Con> constituant deux z6nes, o0 U (univers) est un ensemble des r~fdrents #u discours representant les entites du disc, ours, et Con un ensemble de conditions qua doivent satisfaire ces referents. Celles-ci sont des predicats et des relations de referents du discours mais peuvent etre plus complexes. Notees comme en Iogique des pr~dicats, les conditions de verite sont definies par rapport & la possibilit~ d'incture la DRS dens un modele (pour plus de details, consulter [GUEN 85]). D'autre part, I'extension d'une DRS ne peut changer les valeurs d(~j& assignees: tout Ce qui etait vrai auparavant restera vrai par la suite:","Un aamion bansporte une charge u.K=[xl,x2], Con.K=[carnion(Xl),charge(X2),t~'ansporte(Xl ,X2)].","Tout camion b'ansporte une charge U.K=[ ], Con.K = [:>,K1 ,K2]; U.KI=[Xl], Con.K1= [camion(X1)]; U.K2=[X2], Con. K2=[charge(X2),transporte(Xl ,X2.)]. 2. I La notion d'accessibilite","On peut representer des restrictions configurationnelles sur les relations anaphoriques possibles entre les pronoms et leurs antecedents. Ces restrictions sont obtenues en reduisant I'accessibilitd des referents. L'accessibilit~ permet donc de determiner les liens anaphoriques entre un marqueur pronominal et un marqueur de discours. Toute DRS est accessible d'eltem~me; son univets de marqueurs accessibles est I'unNers du discours de la DRS. Dans une DRS implicative, la DRS antecedente est accessible de la DRS consequente Enfin, la relation d'accessJbilite est transitive. Donc pour \"tout camion qui transporte une charge la declare\", I'antecedent du pronom obJet laest une charge. Ici, U.K1 est accessible & K2. Les conditions de continuite d'un discours sont aussi fonotion de I'accessibilite: la phrase: \"il va & Berlin\" ne peut continuer la precedente puisqu'aucun marqueur de diseours n'est accessible de la DRS K (voir ce sujet [KASP 86]) Ceci explique pourquoi une phrase comme: \"Cheque chauffeur possC~de un camion, fl te conduit\": doit etre formulae: \"Chaque chauffeur qui poss~de un camion le conduit* (avec \"qui poss~e un cam/on\" comma extension de \"cheque chauffeur\") pour Otre representable. Mais la DRT a des limites; elle n'explique pas la bonne formation de ce texte, par example:","Cheque chauffeur transpo~te une charge.","II n)et plusieurs jours & la tivrer.","Ella ne sere livr~e qu'au bout de 3lOUtS Les cleux dernieres phrases, selon la DRT, ne peuvent suivre la premiere, & cause de la portee du quantificateur cheque. Par contre la phrase \"Cheque chauffeur fransporfe une charge qui ne sere livree qu'au bout de 3 jours\" sere parfaitement representee par la DRT. Ces r~gles obligeraient doric le Iocuteur & d~crire une situation en une seule phrase! 2.2 Imp.~. mentation de la DRT","Notre analyseur semantique demane avec des arbres syntaxiques resultant d'une grammaire de type GPSG, programmee en Prolog La grammaire semantique est bas~e sur les memes principes: unification de structures, augmentation de listes ordonnees, presentee sous forme de regles de reecriture suivies de contraintes, de type:","ph -> gn gv","<ph drs courante>=<gn drs courante>","<gn suite drs>=<gv drs_courante>","<gn argument>=<gv arg_sujet>","<ph arg sujet>=<gv arg suJet>","<ph arg objet>=<gv arg_objet> Ceci donne, 8 partir de regles DCG issues de la compilation des precedentes: traduire(ph(GN, G V), P) :-","~'aduire(G V, P2),","traduire(GN, PI),","imerge(P,[courante],Pl,[courante),","imerge(P l, [suite], F~2, [courente]),","tmerge(Pl, [arg], P2,[arg sujet],","imerge(P,[arg sujet], P2,[erg_sulet),","tmerge(P, [arg_objet], P2,[arg_objet]) soit la formule semantique: drs (arg sujet(Xl),arg objet(X2), cour(cond( [imp(drs(cond([camion(X l)]), univ([X1])), drs(cond( [charge(X2), transporte(X l, X2)]),univ([X2])) )] )) ). correspondant ~ la phrase \"tout camion ffansporfe une charge\". C'est 8 partir d'une telle formula que commence la resolution anaphorique"]},{"title":"3.Le lexique-clrammaire","paragraphs":["Le lexique-grammaire, represente sous forme de tables (matrices composees de colonnes ACIT~ DE COLING-92, NAN-IT~, 23-28 AOt~Zr 1992 9 0 2 PRoc. OF COLING-92, NANTES, AUO. 23-28, 1992 et de rangees), contient les phrases strnples, les diff~rents emplois verbaux et los propri~tes qui leur sent assoei~es: nature semantique des arguments, trallsforrnations possibles et tours conditions, nombre et structure des complements, type de la preposition associ~e etc I/ consid~re la nominalisation comma la transformation d'une phrase contenant un op~rateur verbal, en une autre phrase contenarlt url op~rateur nominal. On y introduit un verbe predicativement vide -verbe support- dent le r,~le est d'actualiser le substantif qui n'a pas de marques morphologiques susceptibles de le taire:","l.uc complimente los acteurs = Luc fail des compliments aux acteuts 3 1 L'entoura~e lexical","Nous nous limiterons dans cet article aux possessifs, sur lesquels [GULL 81], [DANL 80], [GROS 89] et [VtVE 83] notamment nous ont fourni des informations fort utiles. L'examen des roots voisins du possessir est important, e. g; Luci donne # L~.aj son i+ j argent","Luc i donne a L~,a son i amour Dens le premier cas, donner est un verbe ordinaire (plein) alors qua dens le second, 41 est un verbe support (V-sup) Seut le substantif N2 change ([NO donne ~ N1 N2jaoss]). Pourtant dens la premiere phrase, son peut ref~rer & trois personnes: - si t'argent est & Lea, son est relie ~ L#a; - si I'argent est ALuc, son est relie a Luc; - si I'argent n'est ni ~ I'un ni ~ I'autre, son est relic ,9 une tierce personne du discours pr~o~dent. Dans la seconde phrase par centre il n'y a qu'un r#ferent: Luc, ~ cause du terme amour qui appartient aux roots \"abstFaits\" ou de sentiments, pour lesquels on ne peut pas trouver, dans ce type de structure, d'autre relation ~ sot] qua le sujet, ici l,uc. II s'agit de cor~f~rence obligatoire au sujet Dens \"Luci cheque L~j par sos i id~'es ~ et \"Luc i cheque Leajdans sos11rig, as\", il y a le verbe chequer Pourtant dens ta pre.miere phrase sos est forcement relic 8 Luc. II s'agit d'un cas de coreference obligatoire au sujet, induit par la preposition par. Alors qua dens la seconde, la cor(~f~rence est oblJgMoire au cempl~ment d'objet sos est reli~ ~ L~4a, ~ cause de la preposition dens 3.2 Phrases construites aulour d'un V-sUlq","On trouve des expressions verbales figees et d'autres mettant enjeu la paire"]},{"title":"Vsup/Npred","paragraphs":["mais sans 6tre des expressions figees. I.es expressions verbMes fi£~es sent de la torme [NO V Nl-poss/, construites autour de variantes aspectuelles et d'op~.rateur causatif du verbe avozr, dent le N1 est teuioum \"pattie du corps\" ou \"abstrait\" (\"Luc i rettent sos i tarmes'), et dent la hansformation en gnest impossible. Elles peuvent aussi etre completees par url troisieme argument ([NO V N1 Pr#p N2] avec V support ou non. L& encore, le nom (N1 ou N2) d~tenniue pal le possessif est \"pantie du corps\" ou \"abstrait\", et aucune restructuration n'est possible: L.ucHelte son i d#volu sur L~a","l.uci #erda L#a sous sa i protection Si le possessif d~termine I'objet direct dens une structure INO V Nl-poss Prep N2], [Prep N2] pout 0tre remplac# par une compl~tive I'infinitive, donnant [NO V Nl-poss Pr~p Vlnf]:","Luc i passe son i temps au travail","Luc~ passe son i temps ~ travailler Daris toutes ces phrases, la cor~ference est touIours obligatoire au sujet [.es expressions non #g#es sent construites autaur de verbes support ou de variantes aspectuelles 1NO V N%poss] ou [NO V Nl-poss Prep N2]: Luci a perdu ses i illusions (~ur L~a). On ne peut pas transformer [NO V Npred (Prep N1)] en [NO V Npred de N2 (Prep N1)] (* Luc a pe~du les illusions de Paul sur L~a). En d'autres termes, I'argument NO de Nprep est le sujet du verbe, mais ce verbene pout prendre une expression [Npred Pr#p NO] comme complement (ici: los illusions de Paul). La presence ou non du complement d'objet indirect n'a pas d'incidence sur la relation qui lie le possessif au sujet. Ces phrases nese construisent pas avec une infinitive. Certaines expressions non fig~es se construisent avec le possessif comma d(~terminant de N3; dens cecas, los trois arguments sent obligatoires etla cor~f~rence n'est pas obtigatoire au suiet , II s'agit de cas de norPcor~f~rence obligatoire ~ I'objet (\"Lucj met Lea ~ sai4 j disposition\") On pout restructurer en reliant les complements par ~tre: Lea est ~ ta disposition de (L uc, Paul) Fin resume, parmi les phrases construites autour dt t Vsup, I'adjectif possessif qu'elles contieonent n'est jamals coref~rent ~ I'objet, AcrEs DE COLING-92, NANrHS, 23-28 AO~r 1992 9 0 3 l'rtOC. Ot; C()I.ING-92, NAN'I'ES, AUG. 23-28, 1992 mais toulours au moins cor(~f~rent a. sujet En reconnaissant d'emblee ces phrases et teur verbe comma Vsup, on pourra r/esoudre automatiquement I'anaphore Pour cela nous proposons de reperer les autres phrases, pu~s de considerer les phrases non reconnues comme ~tant de carte categorie 33 Phrases construites autour de verbes ordinalres","Elles s'articulent autour d'un verbe ~ un ou deux arguments, rNement predicatif de la phrase puisqu'il definit la structure des arguments II est determin#, par: le nombre d'arguments - I'articulation syntaxique de ces arguments - les traits semantiques de ces a{guments Dans la st[ucture [NO V Nl-poss] que ron ne peut poursuivre avec [&/de N2], la coreference est obligatoire aun autre nero que le sujet NO (du discours anterieur)","Luc approuve son choix","Luc apptouve le choix de L#a Par centre, si une phrase a deux arguments et qu'elle peut etre completee par un troJsiCme, la presence ou non de ce dernier fait varier la coref~rence, ou tout au moins la preference entre lee antecedents possibles:","Luc i avoue son i depit.","Lucj avoue soni+ j d~p/t a Lea k La relation de coreference existe toujours entre le possessif et le sujet dane ~es phrases simples [NO V NI]; ou complet~es par [Pr~p N2] oQ la relation peut aussi exister entre le poss et un referent du discours ant~rieur. ©n a donc la un cas de non-cor#f~rence obligatoire ~ I'objet Tous les verbes qui donnent ces r~sultats dans une telle structure appartiennent a la table 9. Quand le syntagme prepositionnel est obligatoire, on distingue les phrases ou I'adjeetif possessif determine le N1 et celles oO il d~terrnine le N2. Parmi tes premieres, on trouve une cer~fdrence obligatoire au sujet Iorsqu'il y a possibilit~ de pronominalisation:","Luc i consacre sa i vie a ta pemture.","Luc se consacre e la peinture OU de verbalisation simple:","Luc i accorde son i pardon ~ L#a","Luc pardonne a L#.~ Mais pour celles dent la transformation donne une completive ~nfinitive [nO V N1 VinfJ, la coref~rence est obligatolre ~ I'ebjet:","Luc i motive L~ajdans son 1 travail","Luc motive Lea g~ travailter Tous ces verbes appartiennent a la table 11 Parmi les phrases de structure [NO V NI Pr~p N2-poss], la relation est obligatoire au sujet, ou obIigatoire ~ t'objet Dans les exemples suivants (verbe de la table 4), oQ la 1estructuration est possible en IN2 de NO V N1], la relation est etablie entre le possessif et le sujet, Iorsque ta preposition est par ou avec: Luc i cheque L&aj paffavec see i idles.","Lea Ides de Luc choquent Lea. Pa~ centre, la mC~me phrase avec clans ou pout; par exemple, donne [a transformation [NO V N2 de N1], et on etablit alors la relation entre le possessif et le ~:ompldment d'ebjet:","LUC I cheque Lea] darts .~esj Ideas.","Luc cheque tee id#es de L&a. 4.Architecture .qdndralle du s.ystdme Notre systeme se compose donc d'un analyseur sfntaxirlue qui donne des arbres & paftir desquels un analyseur s~mantique produit des ORS. C'est sur etles qu'oNrera le piogramme de ~euolution anaphorique Ce systerne se complete d'url fichier de verbes par tables, et d'un fichier \"fonetionnel\", constitue ~ mesure de I'arlalyse semantique, ou sent stockes tousles norns et pronoms, et leur forlction grammaticale. La procedure de r~solution: apres reperage des pronoms, commence par une recherche des verbee (A chacun est associ~ un trait pour sa table d'appartenance) et de leur structure, dans le fichier lexique-grammaire. Si cela est trouve, on cherche sila coreference est obligatoire. Si oui, le traiternent est termine. Sinon, il faut activer d'autres filtres syntaxicos~mantiques: en partant des listes ordonn~es de pronoms, univers et conditions, on verifie la compatibilite de fonction 4, de genre et de hombre, semantique 5. II faut parfois chercher te verbe darts plusieurs tables. Si I'identite de structure entre le texte etles fables n'est pas ~tabtie, on examine I'entuurage substantival du verbe si robjet est concret, il taut activer tes autres filtres. S'il est abstrait ou \"partie du corps\", on a affaire ~ une phrase a verbe suppolt (peut-t~tle figee) dont le statut induit la (non) coreference obtigatoire. &ConclUsion et perspectives [~emarques sur Des travaux: 4 Un candidat sulet est pr~f~e aun autre pour ¢tre reli~ & un pronom suJet, dans deux phrases d{tes paralleles 5 Des traits semanhques sent associes aux roots lexicaux ACRES I)E C()LIN(;-92, NAm'~s, 23-28 aot~rr 1992 9 0 4 Pr~oc. oJ; COLfNG-92, NANtES, AUrJ. 23-28, 1992","-lous les ver'~;t; donl~uHt lieH ~'~ Hn type de construction partmulier, appadiormuHt ~'~ k~ ~me table. Sur chaque table on p~;[IL contraindre la relation de (no~ 0 coiet~rence entre le possessif et Hn argurnent du w~'ibe.","..Tous les uornpl6ments d'obje/ d6termine par le possessif sent \"abstraits\" uu \"pattie du colps\". Avec d'aubes 1~ulns, nun pr~dicatifs, les verbes sotR ordinailt;s et on ne peut resoudre I'ambiguRe anapholique Done en ajoutant ces caract~ristiques dabs la table en question on peat resoudrc, automatiquement I'anaptiofe Ccci ~)11i/iHi~: I'hypath~se que routes les tables peuvent, a priori, ¢tre uinsi complete;as par les sp~.cillcites liees a remploi d'adjectif..; possessifs et permethe ainsi aH syst~me d'¢viter d'autres filtres plus co0teHx en calClll et pas toujours fiables. I1 taut done ~.tablir HI~ lexique-grammaim des ve~bes anaphorique'.;, (pris darts une structure mettant en jeLl till pronom ou, ici, tin adjectif ~x~ssessif) Darts la table 4 du lexiquegran.nu.e, pal exemple, nous repaltissons leS verbes erl: roul~.~__J_: verL~+par (ou avec et pa~ft~isd~;), et cor~f~mnce obligatoite au a~jet (NO): [ uc i d,~prime L g, aj par son i attilu&e. r u.q.E~_~e~: verbe+darts, e.t co~ef~len(;u obligatoire ~ I'objet: [.uc i d~lonne l.g~j dg~tla"]},{"title":"~esj","paragraphs":["propo~. NOUS avons ajot~te A la table 1me colol,le concernant la pr6sence ou non de #)t~p N2], divisee en deux colorines: les deux cas ,3u cor~ference obligatoile. Les verbes de la table 11 suHi ~¢;partis an: ~: V N1 darts [NO V NI & VOinfl puut etre remplace par pronomi~-~#sation (hi verbe Le possessif est tore.~.ment coref~lent au sujer","Luc consacre se vie (e d~.ssme:) au d~s~it~","Luc se consacre (,~ dessJne 0 au dessin Si N1 n'est pas abstrait la pior~t~mirlalisation est imF~ssible:(*Luc con~a{:m son hao#~ au dessm): Grou~: M6rne structt.e sans prouontina.- lisation. II peut y avoir simple ve~r-b~l/saiJ~a~ L.e possessit est toujol,s cor~f6rc'r~t au soj~ N1 est toujours abst~ait et pemiet M verbalisation:","Luc appolle SOn ,sogtie~l ~ c(flh ~. ',dfa#O","Luc ~outJent celia ~nb6\"prl~e; ~: Verbes qHi, clans la tlarlsknmatiu1~ de [NO V N1 &/pour VOilffJ eH [NO V Nf ~/dans N2] oQ N2 est d,~terniin,} par un poss~ssif, induisent obligatoirement une I t ~t. ,!~fin Ittk; I.(~:? pou; #av~#liu'~ Nuuu avo~ls &t~;Hdll t;~tke tabk; (a~ y ajoutaHt ulle CLtla(..tk')i{f, ti(]iit;i CXi'G[t](I(;(! ~)11 111011 d'Llll(; Stlucttll~; lllOllOllli¢lal(~, .~:;tl[}~iJvik::k'~e {;11 110i14, pol_~r k;,,, ,';|ltli;klli~tu i]hrastiq111:,-,; (,~hldi(~e~ (;t I'oblig~ioil (:lt~ colOi:Or<~i .;L, qtli k'H~"]},{"title":"c(~lll.~,'.;po|ld","paragraphs":["[(:Ab',l ~ []~q JCAFd ~,()1\\11<l !, I-~ I~ROWN ~_~lq~//h,:v~] Re.~o!~jti_u_t;: q mul(V :gha2?g~ A#pl~?:~uIE ( .:131 IN(;, l }uduHa.-~t. AI t{j 1988","[CI IAN ,L~TJ ].1 \"4 I/\\Nll !R, !;C,! il All\\J, (; SEDf)(;I t{ ) Ih~, A_~rc,.hu Uni~eyL't~ .SVq/~xe~ ~21 rift M ,Mrn_a-f~J~Ll(~J!.{:c; ,9 6s ,'IFC(k I, Sofia Antipoti~a Nov 1987","[I)ANL 89] L,DANL(:),% Rep!~se.~jt~#90.~: d','ni.fm~#i~p~; huguL.4igU~L.~. COf*St¢~O*~Ql*S /V t}~rt; t/*e~'p X. I |10.~,t) de 3~;I m~ cycle, LADI Pail!; 7, !i][;U","JGt I/~, 91} HGFAAIrq these de ductorat (~'~ p:aHii,t~) I ~aH.'; /, 199>'","[~z,t ~()~ 89] (:; (~Ro,~.~; lug~t~J~.~ammair~_:. !AUI. ,::L Lh,v. Paris; ? S[fMANTICA f>afi:-: Juin igB.q","[GROS /sJ M GhtOSS M~t!ode.u.~jL~A/~{~x P. L::d.{ k;in|arln, i'ari-u 1!)[,*;","[k-Jk ILiN 85] F.GI IENTI tNL£R, P ,'4ABAIli ]-~","ser~{qtjgp. F:NS, I )nivel-sit0 t tlbingeu I )(.'-u 1985 [GIlIN 85] R GIJIN[)ON Focusing. MCC Austin AC.I.i.'185","[Gt I1[ 81] A.Gt IILI.EI ~, CLECI,ERIZ f ¢3[n~s. ~ e tpj~_ff;]&; :;S3ff_(tntiq ~¢!.'.. [.angages n\"63. Ed I alottsse Paris \"H;WI","[I(AX;t > 8.5] W KASPER Dtscourse R~#/es~/!t~liun 7hec~E. Rapport ACORD, Ur~iv.Stuttgart, Mai 1986","[IdCtl 88] ERICH, S.LUPERFC>Y","tir~ A. MCC A u sti n, A. £';. l.. f#,v 1988 [t;I [)O 871 C SEI )( )GB( ) SEatet~le r~ueJ_. ~OJL-U~t2g)!!s~{. Thbse de DooLorat d'Etat [J ive~sit#, dr; Ma~seille, 1{:)87","[VlVl/83J I{ VIVES","::~}rne Cyck; IAI)I Pad:; 7 1983 [WAI)A 811 tt WAI]A, N.AsI let4 /~e~o/(~hlo q t hfiv{n.~.ity Texas, Austin, .l~m 1.987 ACRES DE C'O[ JNG 92, NANH~S. 23-21i AO{lr 1992 9 0 5 l'l¢oc. ~j: (X)I.IN(; 94, l,[ai,a i I!s, Atlas. 23-28, 1992"]}]}