{"sections":[{"title":"Fifth Conference of the European Chapter of the Association for Computational Linguistics Proceedings of the Conference 9-11 April 1991 Congress Hall, Alexanderplatz Berlin, Germany Published by the Association for Computational Linguistics ©1991, Association for Computational Linguistics Order copies of this and other ACL proceedings from: Donald E. Walker (ACL) Bell Communication Research 445 South Street MRE 2A379 Morristown, NJ 07960-1910, USA Preface","paragraphs":["The preparation of the Fifth Conference of the European Chapter of the Association for Computational Linguistics was done, without doubt, under extraordinary circumstances. To characterize the situation one only has to remember that since the Manchester conference there have been four governments on the territory of the former GDR, differing in every imaginable respect. The change in autumn 1989 and the unification on 3 October 1990 - the two outstanding events - were accompanied by an immense number of radical political, economic, and social changes which were not without consequences on the preparation of this conference. We therefore ask for your understanding; not everything went as we wanted and there were some mishaps in preparing the conference which we regret very nmch. The main reason for this trouble was the inadequacy of communications, which did not improve to a degree necessary for a smooth handling of the organization. That nevertheless everything went comparatively well is mainly due to two different facts: on the one hand to the energy and enthusiasm which some of our collaborators put in to making a successful outcome possible. We particularly want to thank them here. On the other hand it is also due to the generous financial support which (although not in every case meant for the conference) raised our technical and other facilities to a level allowing more effective work during the last months. This holds above all for the financial aid we received from the Federal Minister of Research and Technology. Finally, we would like to extend our gratitude to the project group KIT-FAST of the Technical University of Berlin, who helped us with their communication facilities. We received 186 papers which were reviewed and, in addition, about 25 contributions which, in spite of a postponement of the deadline for ten days, unfortunately could not be taken into account. Since the programme permitted only 50 papers contributions of high quality had sometimes to be rejected. With very few exceptions the referees have done their work properly and in time, and the members of the programe committee, each of them responsible fi)r one or several sub-fields, have handled the flood of papers in a competent and committed way. Each paper was reviewed by four referees who had to send one copy of their report to the member of the programme committee responsible for that sub-field and another to the programme chair. On this basis the members of the programme committee, who also had copies of the papers, wrote a general assessment. This procedure guaranteed a largely objective classification of the papers. Compared with the preceding EACL conferences we increased the number of papers to 50; consequently each paper has only been allowed 6 pages in the Proceedings. Jiirgen Kunze Dorothee Reimann Programme Committee Chair Ill"]},{"title":"Acknowledgements","paragraphs":["The Fifth European Conference of the Association for Computational Linguistics was generously supported by Senat von Berlin Deutsche Forschungsgemeinschaft and by donations from Commission of the European Communities Gottlieb Daimler - und Karl Benz - Stiftung IBM Deutschland GmbH"]},{"title":"ACL European Chapter Officials","paragraphs":["Chair: Secretary: Treasurer:","Advisory Committee: Nominating Committee: Christian Rohrer, University of Stuttgart Beat Buchmann, Credit Suisse, Zfirich Michael Rosner, IDSIA, Lugano Margaret King, ISSCO, Geneva Jiirgen Kunze, Zentralinstitut fiir Sprachwissenschafi, Berlin Ewan Klein, University of Edinburgh Anna S/lgvall Hein, Uppsala University Jan Landsbergen, Philips Research Lab, Eindhoven Henrik Holmboe, The }krhus School of Business Petr Sgall, Charles University, Prague iv"]},{"title":"Conference Organization Chair: Jfirgen Kunze and Dorothee Reimann (Berlin) Programm Committee: Leonard Bolc (Warsaw) Nicoletta Calzolari (Pisa) Giacomo Ferrari (Pisa): Eva Haji~ov~i (Prague) Peter HeUwig (Heidelberg) Kimmo Koskermiemi (Helsinki) Bente Maegaard (Copenhagen) Alexander S. Narin'yani (Moscow) Elena V. Paducheva (Moscow) Steve G. Pulman (Cambridge) Carlo Tasso (Udine) Henry S. Thompson (Edinburgh) Harald Trost (Saarbrficken) Wolfgang Wahlster (Saarbrficken) Local Arrangements: Gunter Gebhardi Renate Henschel Iris Hbser Uwe Jung Andr6 Kempe Gerda Klimonow Sabine Koch Andreas Kfistner Herbert Kfistner Wolfgang Menzel Barbara Rfidiger Lothar Schwarz lngrid Starke Referees Lars Ahrenberg (Linkrping) Jean-Louis Binot (Everberg) Christian Boitet (Grenoble) Gosse Bouma (Groningen) Edward J. Briscoe (Cambridge) Ernst Buchberger (Vienna) Stephan Busemann (Saarbriicken) Lauri Carlson (Helsinki) Nicolae Curteanu (Ia~i) Walter Daelemans (Tilburg) Laurence Danlos (Paris) Louis des Tombe (Utrecht) Marc Domenig (Zflrich) Roger Evans (Brighton) Norman Fraser (Guildford) Danilo Fum (Trieste) Gerald Gazdar (Brighton) Tom Gerhardt (Luxembourg) Jan Haji~ (Prague) Johann Haller (Saarbrficken) Chrism Hauenschild (Berlin) Helmut Horacek (Bielefeld) Leonid L. Iomdin (Moscow) Harry Jgppinen (Helsinki) LAszl6 K~ilrn~.n (Budapest) Gerard A.M. Kempen (Nijmegen) Alexander Kibrik (Moscow) James Kiibury (Dfisseld0r 0 Steven Krauwer (Utrecht) Jan Landsbergen (Eindhoven) Nina N. Leont'yeva (Moscow) Jan Tore Lonning (Oslo) Heinz-Dirk Luckhardt (Saarbrficken) Juri S. Martem'yanov (Moscow) Wolfgang Menzel (Berlin) Klaus Netter (Saarbrficken) Gunter Neubert (Dresden) Jarmila Panevowi (Prague) Wolf Paprott6 (Mfinster) Vladimir Perieliev (Sofia) Patrice Pognan (Paris) G~ibor Prrsz~ky (Budapest) Claudius Pyka (Hamburg) Allan Ramsay (Dublin) Graeme Ritchie (Edinburgh) Dietmar Rfsner (Ulm) Graham Russell (Geneva) Hanne Ruus (Copenhagen) Anna Slgvall-Hein (Uppsala) Klans Schubert (Utrecht) Camilla Schwind (Marseille) Petr Sgall (Prague) Bengt Sigurd (Lund) Harold Somers (Manchester) Erich Steiner (Saarbrficken) Oliviero Stock (Povo) Dan Tufi~ (Bucharest) Giovanni Battista Varile (Luxembourg) Susan Warwick (Geneva) J~rgen Wedekind (Stuttgart) Eric Wehrli (Geneva) Peter John Whitelock (Edinburgh) Gerd Wili~.e (Bonn) Mary McGee Wood (Manchester) Frank 7_&aker (Dresden) Programme Tuesday, 9 April 1991","paragraphs":["9.00 9.30 Opening In vited Paper Antonio Zampolfi (Italy) Large Reusable Linguistic Knowledge Bases 10.30 Coffeo Break 11.00 11.30 12.00 Steve G. Pulman (Great Britain) Comparatives and Ellipsis Wolfgang Wahlster, Elisabeth Andre, Winfried Graf, Thomas Rist (Germany) Designing Illustrated Texts: How Language Production is Influenced by Graphics Generation David M. Magerman, Mitchell P. Marcus (USA) Pearl: A Probabilistie Chart Parser 15 12.30 Lunch Section A Section B 14.00 14.30 15.00 Tilman Becker, Aravind K. Joshi, Owen Rainbow (USA) Long-Distance Scrambling and Tree Adjoining Grammars Alberto Lavelli, Giorgio Satta (Italy) Bidirectional Parsing for Lexicalized Tree Adjoining Grammars Stephen J. Ilegner (USA) Horn Extended Feature Structures: Fast Unification with Negation and Limited Disjunction 21 27 33 Fabio Pianesi (Italy) Indexing and Referential Dependencies within Binding Theory: A Computational Framework Manfred Pinkal (Germany) On the Syntactic-Semantic Analysis of Bound Anaphora Longin Latecki (Germany) An Indexing Technique for Implementing Command Relations 39 45 51 15.30 Coffee Bresk 16.00 16.30 17.00 Patrick Saint-Dizier (France) Processing Language with Logical Types and Active Constraints Ren~ Leermakers (Netherlands) Non-deterministic Reeursive Ascent Parsing Tsuneko Nakazawa (USA) An Extended LR Parsing Algorithm for Grammars Using Feature-Based Syntactic Categories 57 63 69 Pete Whitelock (Great Britain) What sorts of trees do we speak? - A Computational Model of the Syntax-Prosody Interface in Tokyo Japanese 75 Eric Bilange (France) A Task Independent Oral Dialogue Model 83 Steven Bird, Patrick Blackburn (Great Britain) A Computational Approach to Arabic Phonology 89 v/"]},{"title":"Wednesday, 10 April 1991","paragraphs":["9.00 9.30 10.00 Section A Dan Tufts, Octav Popescu (Roumania) A Unified Management and Processing of Word-Forms, Idioms and Analytical Compounds Alan W. Black (Great Britain),Joke van de Plassche (Netherlands), Briony Williams (Great Britain) Analysis of Unknown Words through Morphological Decomposition Michel Gilloux (France) Automatic Learning of Word Transducers from Example 95 101 107 Section B Stephan Busemann (Germany) Structure-Driven Generation from Separate Semantic Representations Alison Cawsey (Great Britain) Using Plausible Inference Rules in Description Planning Lee Fedder (Great Britain) Generating Sentences from Different Perspectives 113 119 125 10.30 Coffee Break 11.00 I 1.30 12.00 Sabine Reinhard, Dafydd Gibbon (Germany) Prosodic Inheritance and Morphological Generalisations James Kilbury, Petra Naerger, lngrid Renz (Germany) DATR as a Lexical Component for PATR Gunnel Kiillgren (Sweden) Parsing without Lexicon: the MorP System 131 137 143 Danilo Fum, Bruno Pani, Carlo Tasso (Italy) Teaching the English Tense: Integrating Naive and Formal Grammars in an Intelligent Tutor for Foreign Language Teaching Mori Rimon, Jacky llerz (Israel) The Recognition Capacity of Local Syntactic Constraints Robert Dale, Nicholas lladdock (Great Britain) Generating Referring Expressions Involving Relations","° , Lunch 149 155 161 12.30 14.00 14.30 15.00 Richard P. Cooper (Great Britain) Coordination in Unification-Based Grammars 167 Luis Damas, Nelma Moreira (Portugal), Giovanni B. Varile (Luxembourg) The Formal and Processing Models of CLG Gosse Bouma (Netherlands) Prediction in Chart Parsing Algorithms for Categorial Unification Grammar 173 179 Matthew W. Crocker (Great Britain) Multiple Interpreters in a Principle-Based Model of Sentence Processing llelmut lloracek (Germany) Exploiting Conversational Implicature for Generating Concise Explanations Eiena V. Paducheva (USSR) Semantic Features and Selection Restrictions Coffee Break 185 191 194 15.30 16.00 16.30 17.00 Guy Barry, Mark llepple, Neil Leslie, Giyn Morrill (Great Britain) Proof Figures and Structural Operators for Categorial Grammar Jiirgen Wedekind (USA) Classical Logics for Attribute-Value Languages Joep Rous (Netherlands) Computational Aspects of M-grammars 198 204 210 Sabine Bergler (USA) The Semantics of Coiiocational Patterns for Reporting Verbs 216 Michael R. Brent (USA) Automatic Semantic Classification of Verbs from their Syntactic Contexts: An Implemented Classifier for Stativity 222 Jean Veronis (France), Nancy M. Ide (USA) An Assessment of Semantic Information Automatically Extracted from Machine Readable Dictionaries 227 v/i III IIIII 233 9.00 9.30 10,00 10.30 Arne JSnsson (Sweden) A Dialogue Manager Using Initiative-Response Units and Distributed Control Gudrun Klose, Thomas Pirlein (Germany) Modelling Knowledge for a Natural Language Understanding System Gfinter Neumann (Germany) A Bidirectional Model for Natural Language Processing r 239 251 245 Coffee Break • Demonstrations 11.00 11.30 12.00 Espen J. Vestre (Norway) An Algorithm for Generating Non-redundant Quantifier Scopings Richard Ball, Keith Brown, Anne de Roeck, • Chris Fox, Marjolein Groefsema, Nadim Obeid, Ray Turner (Great Britain) Helpful Answers to Modal and Hypothetical Questions Karin llaenelt, Michael Ktlnyves-Tdth (Germany) The Textuei Development of Non-Stereotypic Concepts 257 263 Lunch Demonstrations"]},{"title":"Thursday, 11 April 1991","paragraphs":["12.30 14.00 14.30 15.00 Bianka Buschbeck, Renate llenschel, Iris lliiser, Gerda 269 Klimonow, Andreas Kfistner, Ingrid Starke (Germany) Limits of a Sentence Based Procedural Approach for Aspect Choice in German-Russian Machine Translation Jun-ichi Tsujii, Kimikazu Fujita (Great Britain) L~xical Transfer Based on Bilingual Signs: Towards Interaction During Transfer 275 Yannis Dologlou (Greece), Giovanni Malnati (Italy), 281 Patrizia Paggio (Denmark) A Preference Mechanism Based on Multiple Criteria Resolution . Demonstrations 15.30 Coffee Break 287 16.00 16.30 Graham Russell, Afzai Baifim, Donfinique Estival, Susan Warwick-Armstrong (Switzerland) A Language for the Statement of Binary Relations over Feature Structures Louisa Sadler, llenry S. Thompson (Great Britain) Structural Non-Correspondence in Translation 17.00 Final Meeting 293 Reserve Papers: Nelson Correa (Colombia) An Extension of Farley's Algorithm for S- and L-Attributed Grammars llubert Lehmann (Germany) Towards a Core Vocabulary for a Natural Language System lleinz-Dirk Luckhardt (Germany) Sublanguages in Machine Translation - What are they worth? Allan Ramsay (Ireland) A Common Framework for Analysis and Generation VIII 299 303 306 309"]},{"title":"Author Index","paragraphs":["Elisabeth Andr6 Richard Ball Afzal Ballim Guy Barry Tilman Becker Sabine Bergler Eric Bilange Steven Bird Alan W. Black Patrick Blackburn Gosse Bouma Michael R. Brent Keith Brown Bianka Buschbeck Stephan Busemann Alison Cawsey Richard Cooper Nelson Correa Matthew W. Crocker Robert Dale Luis Damas Anne de Roeck Yannis Dologlou Dominique Estival Le~ Fedder Chris Fox Kimikazu Fujita Danilo Fum Dafydd Gibbon Michel Giiloux Winfried Graf Marjolein Groefsema Nicholas Haddock Karin Haenelt Stephen J. Hegner Renate Henschel Mark Hepple Jacky Herz Helmut Horacek Iris Hfser Nancy M. Ide Arne Jrnsson Aravind K. Joshi Gunnel K,~llgren James Kilbury Gerda Klimonow Gudrun KIo~ Michael Kfnyves-Trth Andreas K/istner Longin Latecki 8 257 287 198 21 216 83 89 101 89 179 222 257 269 113 119 167 299 185 161 173 257 281 287 125 257 275 149 131 107","8 257 161 263 33 269 198 155 191 269 227 233 21 143 137 269 239 263 269 51 Alberto Lavelli Ren6 Leermakers Hubert Lehmann Neil Leslie Heinz-Dirk Luckhardt David M. Magerman Giovanni Malnati Mitchell P. Marcus Nelma Moreira Glyn Morrill Tsuneko Nakazawa Petra Naerger G/inter Neumarm Nadim Obeid Elena V. Paducheva Patrizia Paggio Bruno Pani Fabio Pianesi Manfred Pinkal Thomas Pirlein Octav Popescu Steve G. Pulman Owen Rambow Allan Ramsay Sabine Reinhard lngrid Renz Mori Rimon Thomas Rist Joep Rous Graham Russell Louisa Sadler Patrick Saint-Dizier Giorgio Satta Ingrid Starke Carlo Tasso Henry S. Thompson Jun-ichi Tsujii Dan Tufts Ray Turner Joke van de Ptassche Giovanni B. Varile Jean Veronis Espen J. Vestre Wolfgang Wahlster Susan Warwick-Armstrong J/irgen Wedekind Pete Whitelock Briony Williams Antonio Zampolli 27 63 303 198 306 15 281 15 173 198 69 137 245 257 194 281 149 39 45 239 95 2 21 309 131 137 155","8 210 287 293 57 27 269 149 293 275 95 257 lOl 173 227 251","8 287 204 75 lOl","l /x J"]}]}