{"sections":[{"title":"","paragraphs":["Proceedings of EACL '99"]},{"title":"Detection of Japanese Homophone Errors by a Decision List Including a Written Word as a Default Evidence Hiroyuki Shinnou Ibaraki University Dept. of Systems Engineering 4-12-1 Nakanarusawa Hitachi, Ibaraki, 316-8511, JAPAN","paragraphs":["shinnou@lily, dse. ibaraki, ac. jp"]},{"title":"Abstract","paragraphs":["In this paper, we propose a practical method to detect Japanese homophone errors in Japanese texts. It is very important to detect homophone errors in Japanese revision systems because Japanese texts suffer from homophone errors frequently. In order to detect homophone errors, we have only to solve the homophone problem. We can use the decision list to do it because the homophone problem is equivalent to the word sense disambiguation problem. However, the homophone problem is different from the word sense disambiguation problem because the former can use the written word but the latter cannot. In this paper, we incorporate the written word into the original decision list by obtaining the identifying strength of the written word. The improved decision list can raise the F-measure of error detection."]},{"title":"1 Introduction","paragraphs":["In this paper, we propose a method of detect-ing Japanese homophone errors in Japanese texts. Our method is based on a decision list proposed by Yarowsky (Yarowsky, 1994; Yarowsky, 1995). We improve the original decision list by using written words in the default evidence. The improved decision list can raise the F-measure of error detection.","Most Japanese texts are written using Japanese word processors. To input a word composed of kanji characters, we first input the phonetic hiragana sequence for the word, and then convert it to the desired kanji sequence. However, multiple converted kanji sequences are generally produced, and we must then choose the correct kanji sequence. Therefore, Japanese texts suffer from homophone errors caused by incorrect choices. Carelessness of choice alone is not the cause of homophone errors; Ignorance of the difference among homophone words is serious. For example, many Japanese are not aware of the difference between '.~.,'~,' and '~,~,', or between '~.~.' and ,~,t.","In this paper, we define the term homophone set as a set of words consisting of kanji characters that have the same phone 2. Then, we define the term"]},{"title":"homophone word","paragraphs":["as a word in a homophone set. For example, the set { ~/~-~ (probability), ~7 (establishment)} is a homophone set because words in the set axe composed of kanji characters that have the same phone 'ka-ku-ri-tu'. Thus, q/~' and '~f_' are homophone words. In this paper, we name the problem of choosing the correct word from the homophone set the"]},{"title":"homophone","paragraphs":["problem. In order to detect homophone errors, we make a list of homophone sets in advance, find a homophone word in the text, and then solve the homophone problem for the homophone word.","Many methods of solving the homophone problem have been proposed (Tochinai et al., 1986; Ibuki et al., 1997; Oku and Matsuoka, 1997; Oku, 1994; Wakita and Kaneko, 1996). However, they are restricted to the homophone problem, that is, they are heuristic methods. On the other hand, the homophone problem is equivalent to the word sense disambiguation problem if the phone of the homophone word is regarded as the word, and the homophone word as the sense. Therefore, we can solve the homophone problem by using various","1 '~'.-~.,~. and '~.~..m~,' have a same phone 'i-sift'. The meaning of '~,' is a general will, and the meaning of '~:~'.~.,,... is a strong positive will. '~.~.' and '~' have a same phone 'cho-kkan'. The meaning of 'l-ff__,~. i is an intuition through a feeling, and the meaning of '~' is an intuition through a latent knowledge.","ZWe ignore the difference of accents, stresses and parts of speech. That is, the homophone set is the set of words having the same expression in hiragana characters. 180 Proceedings of EACL '99 statistical methods proposed for the word sense disambiguation problem(Fujii, 1998). Take the case of context-sensitive spelling error detection 3, which is equivalent to the homophone problem. For that problem, some statistical methods have been applied and succeeded(Golding, 1995; Golding and Schabes, 1996). Hence, statistical methods axe certainly valid for the homophone problem. In particular, the decision list is valid for the homophone problem(Shinnou, 1998). The decision list arranges evidences to identify the word sense in the order of strength of identifying the sense. The word sense is judged by the evidence, with the highest identifying strength, in the context.","Although the homophone problem is equivalent to the word sense disambiguation problem, the former has a distinct difference from the latter. In the homophone problem, almost all of the an-swers axe given correctly, because almost all of the expressions written in the given text are correct. It is difficult to decide which is the meaning of 'crane', 'crane of animal' or 'crane of tool'. However, it is almost right that the correct expression of '~' in a text is not '~-~' but '~1~'. In the homophone problem, the choice of the written word results in high precision. We should use this information. However, the method to always choose the written word is useless for error detection because it doesn't detect errors at all. The method used for the homophone problem should be evaluated from the precision and the recall of the error detection. In this paper, we evaluate it by the F-measure to combine the precision and the recall, and use the written word to raise the F-measure of the original decision list.","We use the written word as an evidence of the decision list. The problem is how much strength to give to that evidence. If the strength is high, the precision rises but the recall drops. On the other hand, if the strength is low, the decision list is not improved. In this paper, we calculate the strength that gives the maximum F-measure in a training corpus. As a result, our decision list can raise the F-measure of error detection.","2 Homophone disambiguation by a decision list In this section, we describe how to construct the decision list and to apply it to the homophone problem.","SFor example, confusion between 'peace' and 'piece', or between 'quiet' and 'quite' is the context-sensitive spelling error. 2.1 Construction of the decision list The decision list is constructed by the following steps. step 1 Prepare homophone sets.","In this paper, we use the 12 homophone sets shown in Table 1, which consist of homophone words that tend to be mis-chosen. Table 1: Homophone sets Phone Homophone set sa-i-ken ka-i-hou kyo-u-cho-u ji-shi-n ka-n-shi-n ta-i-ga-i"]},{"title":"{ ~, ~¢~ } {~, ~} { t~-~, ~ } {~,~#} { ~,~,, r~,c, } { ~, ~,~% } u-n-ko-u { ~, ~T } do-u-shi { NN, N± } ka-te-i { ~_, ~..~:? } ji-kko-u { ~, ~ } syo-ku-ryo-u { ~, ~ } syo-u-ga-i { ~=-~, [~=-~ }","paragraphs":["step 2 Set context information, i.e. evidences, to identify the homophone word. We use the following three kinds of evidence. • word (w) in front of H: Expressed as w- • word (w) behind H: Expressed as w+","• fi~tu words 4 surrounding H: We pick up the nearest three fir/tu words in front of and behind H respectively. We express them as w±3.","step 3 Derive the frequency frq(wi,ej) of the collocation between the homophone word wl in the homophone set {Wl,W~,-.-,wn} and the evidence e j, by using a training corpus.","For example, let us consider the homophone set { ~_~1~ (running (of a ship, etc.)), ~_~7 (running (ofa train, etc.))} and the following two Japanese sentences. Sentence 1 r~g~)~J~;o~ ~ - b J~'~7~_ (A west wind of 3 m/s did not prevent the plane from flying.)","4The firitu word is defined as an independent word which can form one bun-setu by itself. Nouns, verbs and adjectives are examples. 181 Proceedings of EACL '99 Table 2: Answers and identifying strength for Evid. ~: +"]},{"title":"(to+) (of-)","paragraphs":["~T~ ±3 (plane±3) °.. ~+ (hour+) ~.~ ±3 (midnight±3) ~K~ ±3 (shorten±3) .,."]},{"title":"default","paragraphs":["I Freq. of Freq. of"]},{"title":",~_~, ,~,","paragraphs":["77 53 252 282 4 0 14 11 0 48 0 4 1468 1422 evidences","Ans. I Identifying Strength"]},{"title":"~ 0.538 ~ 0.162 ~ 5.358","paragraphs":["~.~t~ 0.345"]},{"title":"~ 8.910 ~ 5.358","paragraphs":["~ 0.046 Sentence 2"]},{"title":"F-~-~7)~'~~s~:~ '~.-f,= o J","paragraphs":["(Running hours in the early morning and dur-ing the night were shortened.)","From sentence 1, we can extract the following evidences for the word '~': and from sentence 2, we can extract the following evidences for the word '~':"]},{"title":"\"~#r~? +\", \"¢) -\", \"~+~ ±3\", \"~@ +3\", \"@r~ +Y', \"~ +3\", \"~ +3\".","paragraphs":["step 4 Define the strength"]},{"title":"est(wi, ej)","paragraphs":["of estimat-ing that the homophone word wl is correct given the evidence e j:"]},{"title":"est(wi, ej ) = log( w, P(Pif:j l),e ~ ) 2.,k#i ~ kl","paragraphs":["j] where P(wi]ej) is approximately calculated by:"]},{"title":"frq(wi, ej ) + a P(wl [ej) = )-~k frq(wk, ej) + a\"","paragraphs":["a in the above expression is included to avoid the unsatisfactory case of"]},{"title":"frq(wl, ej) = O.","paragraphs":["In this paper, we set a : 0.15. We also use the special evidence"]},{"title":"default, frq(wl, default)","paragraphs":["is defined as the frequency of wl. step5 Pick the highest strength"]},{"title":"est(wh,ej)","paragraphs":["among","5As in this paper, the addition of a small value is an easy and effective way to avoid the unsatisfactory case, as shown in (Yarowsky, 1994). {est(wl, ), ea(w , e#), • • •, e e#)), and set the word wk as the answer for the evidence ej. In this case, the identifying strength is"]},{"title":"est(wk, ej).","paragraphs":["For example, by steps 4 and 5 we can construct the list shown in Table 2.","step 6 Fix the answer wkj for each ej and sort identifying strengths"]},{"title":"est(wkj, ej)","paragraphs":["in order of dimension, but remove the evidence whose identifying strength is less than the identifying strength"]},{"title":"est(wkj,default)","paragraphs":["for the evidence"]},{"title":"default","paragraphs":["from the list. This is the decision list.","After step 6, we obtain the decision list for the homophone set { ~_~, ~.~ } as shown in Table 3. Table 3: Example of decision list","~id. ~gth 1 ~lJ~ ±3 (train±3) ~.~ 9.453 2 ~ ±3 (ship±3) ~.~l~ 9.106 3 ~ ±3 ~.~ 8.910","(midnight±3) 701 ~r,~- (hour-) ~.~ 0.358","746 ¢)+ (of+) ~.~ 0.162",".","... , ...",".","...... 760"]},{"title":"default","paragraphs":["~_~ 0.046 2.2"]},{"title":"Solving by a decision","paragraphs":["llst In order to solve the homophone problem by the decision list, we first find the homophone word w in the given text, and then extract evidences E for the word w from the text: E = {el, e:,..., e, }. 182 Proceedings of EACL '99","Next, picking up the evidence from the decision list for the homophone set for the homophone word w in order of rank, we check whether the evidence is in the set E. If the evidence ej is in the set E, the answer wkj for ej is judged to be the correct expression for the homophone word w. If wkj is equal to w, w is judged to be correct, and if it is not equal, then it is shown that w may be the error for wkj. 3 Use of the written word In this section, we describe the use of the written word in the homophone problem and how to incorporate it into the decision list. 3.1 Evaluation of error detection systems As described in the Introduction, the written word cannot be used in the word sense disambiguation problem, but it is useful for solving homophone problems. The method used for the homophone problem is trivial if the method is evaluated by the precision of distinction using the following for-mula:","number of correct discriminations number of all discriminations That is, if the expression is '~]~' (or '~.~'), then we should clearly choose the word '~t~' (or the word '~') from the homophone set { ~_~t~, ~_~T }. This distinction method probably has better precision than any other methods for the word sense disambiguation problem. However, this method is useless because it does not detect errors at all.","The method for the homophone problem should be evaluated from the standpoint of not error discrimination but error detection. In this paper, we use the F-measure (Eq.1) to combine the precision P and the recall R defined as follows: number of real errors in detected errors P= R= number number of detected errors","of real errors in detected errors number of errors in the tezt","2PR F- P+R (1)","3.2 Use of the identifying strength of the written word The distinction method to choose the written word is useless, but it has a very high precision of error discrimination. Thus, it is valid to use this method where it is difficult to use context to solve the homophone problem.","The question is when to stop using the decision from context and use the written word. In this paper, we regard the written word as a kind of evidence on context, and give it an identifying strength. Consequently we can use the written word in the decision list.","3.3 Calculation of the identifying strength of the written word First, let z be the identifying strength of the written word. We name the set of evidences with higher identifying strength than z the set a, and the set of evidences with lower identifying strength than z the set f~,","Let T be the number of homophone problems for a homophone set. We solve them by the original decision list DLO. Let G (or H) be the ratio of the number of homophone problems by judged by a (or f~ ) to T. Let g (or h) be the precision of a (or f~), and p be the occurrence probability of the homophone error.","The number of problems correctly solved by a is as follows: aT(1 - p), (2) and the number of problems incorrectly solved by a is as follows: GTp. (3) The number of problems detected as errors in Eq.2 and Eq.3 are GT(1 - p)(1 - g) and GTpg respectively. Thus, the number of problems detected as errors by a is as follows: GT((1 - p)(1 - g) + pg)."]},{"title":"(4)","paragraphs":["In the same way, the number of problems detected as errors by/~ is as follows: HT((1 - p)(1 - h) + ph). (5) Consequently the total number of problems detected as errors is as follows: T(G((1 -p)(1 -g) + pg) +H((1 -p)(1 - h)+ph))."]},{"title":"(6)","paragraphs":["The number of correct detections in Eq.6 is Tp(Gg + Hh). Therefore the precision P0 is as follows:","Po = p(Gg + Hh)/{G((1 - p)(1 - g) + pg) + H((1 - p)(1 - h) + ph)} Because the number of real errors in T is Tp, the recall R0 is Gg+Hh. By using P0 and R0, we can get the F-measure F0 of DL0 by Eq. 1.","Next, we construct the decision list incorporat-ing the written word into DL0. We name this decision list DL1. In DL1, we use the written word to solve problems which we cannot judge by c[. That 183 Proceedings of EACL '99 iEvid. Ans. Strength"]},{"title":"DLO %","paragraphs":["Evid. Ans. Strength x+~ Evid. Arts. written f.ritten~ .ord ~ .,,rd /"]},{"title":"DLI","paragraphs":["Strength","x+ ~ X Figure 1: Construction of DL1 is, DL1 is the decision list to attach the written word as the default evidence to a (see Fig.l).","Next, we calculate the precision and the recall of DL1. Because a of DL1 is the same as that of DL0, the number of problems detected as errors by a is given by Eq.4. In the case of DL1, problems judged by ~ of DL0 are judged by the written word. Therefore, we detect no error from these problems.","As a result, the number of problems detected as errors by DL1 is given by Eq.4, and the number of real errors in these detections is TGpg. Therefore, the precision P1 of DL1 is as follows:","p1 = Pg (1 - p)(1 - g) + pg\" Because the number of whole errors is Tp, the recall R1 of DL1 is Gg. By using P1 and t/1, we can get the F-measure F1 of DL1 by Eq.1.","Finally, we try to define the identifying strength z. z is the value that yields the maximum F~ under the condition F1 > F0. However, theoretical calculation alone cannot give z, because p is unknown, and functions of G,H,g, and h are also unknown.","In this paper, we set p = 0.05, and get values of G, H, g, and h by using the training corpus which is the resource used to construct the original decision list DL0. Take the case of the homophone set {'~', '~.~T'}. For this homophone set, we try to get values of G, H, g, and h. The training corpus has 2,890 sentences which include the word '~.~]~' or the word '~.~'. These 2,890 sentences are homophone problems for that homophone set. The identifying strength of DL0 for this homophone set covers from 0.046 to 9.453 as shown in Table 3. Next we give z a value. For example, we set z = 2.5. In this case, the number of problems judged by a is 1,631, and the number of correct judgments in them is 1,593. Thus, G = 1631/2890 = 0.564 and g = 1593/1631 = 0.977. In the same way, under this assumption z -- 2.5, the number of problems judged by j3 is 1,259, and the number of correct judgments in them is 854. Thus, H = 1259/2890 = 0.436 and h = 854/1259 = 0.678. As a result, if z = 2.5, then P0 = 0.225, R0 = 0.847, F0 = 0.356, P1 = 0.688, R1 = 0.551 and F1 = 0.612. In Fig.2, Fig.3 and Fig.4, we show the experiment result when z varies from 0.0 to 10.0 in units of 0.1. By choosing the maximum value of F1 in Fig.4, we can get the desired z. In this homophone set, we obtain z = 3.0. 4 Experiments First, we obtain each identifying strength of the written word for the 12 homophone sets shown in Table 1, by the above method. We show this result in Table 4. LRO in this table means the lowest rank of DL0. That is, LR0 is the rank of the default evidence. LR1 means the lowest rank of DL1. That is, LR1 is the rank of the evidence of the written word. Moreover, LR0 and LR1 mean the sizes of each decision list DL0 and DL1.","Second, we extract sentences which include a word in the 12 homophone sets from a corpus. We note that this corpus is different from the training corpus; the corpus is one year's worth of Mainichi newspaper articles, and the training corpus is one year's worth of Nikkei newspaper articles. The extracted sentences are the test sentences of the experiment. We assume that these sentences have no homophone errors.","Last, we randomly select 5% of the test sentences, and forcibly put homophone errors into these selected sentences by changing the written 184 Proceedings of EACL '99 1 0.9 0.8 0.7 0.6 0.5 0,4 0.3 0.2 o ¢","o~ 'DL-I\" o 'DI.-O\" + o~ g o~","I","r","I","=","r","I","B","=","B","1 2 3 4 S 6 7 It 9 Figure 2: Precisions Po and P1 Table 4: Identifying strength of the expression Identifying","homophone set strength LR0 LR1 of expression"]},{"title":"{ ~, ~ } 4.9 { ~, ~ } 4.6 { ~, ~j~ } 4.3 { ~, ~$P} 4.8 { ~,,~,, r~,t:, } {/~-, ~t. }","paragraphs":["5.7 3.9","{ ~.~, ~.~T } 3.0","{ ~],:~,, ~]=]= } 4.5 5.1 ,~°"]},{"title":"{ ,~+~, ~+~ }","paragraphs":["4.3"]},{"title":"{ ~}~, J~}~ }","paragraphs":["4.7 { t~-~-=, ~=-~ } 5.1 1062 844 1104 671 1120 667 1134 622 1007 424 921 921 760 319 811 788 799 469 760 665 697 255 695 397 0,9 o.8 0.7 0.6 0.5 0,4 0.3 o.2 o.1 0 0.7 0.6 0s 0.4 0.3 0,2 01 0"]},{"title":"\\","paragraphs":["e o","I i","I","I","1 2 3 4 % ~oooo0oo ~ i i i i i","S 6 7 8 9 Figure 3: Recalls Ro and Rt 'DL'I' o 'DL'O' + o j - % % % o~","I","r","f","I","f","I","I","L","I","1 2 3 4 5 6 7 8 9 Figure 4: F-measures Fo and Ft homophone word to another homophone word. As a result, the test sentences include 5% errors. From these test sentences, we detect homophone errors by DL0 and DL1 respectively.","We conducted this experiment ten times, and got the mean of the precision, the recall and the F-measure. The result is shown in Table 5.","For all homophone sets, the F-measure of our proposed DL1 is higher than the F-measure of the original decision list DL0. Therefore, it is concluded that our proposed method is effective. 5 Remarks The recall of DL1 is no more than the recall of DL0. Our method aims to raise the F-measure by raising the precision instead of sacrificing the recall. We confirmed the validity of the method by experiments in sections 3 and 4. Thus our method has only a little effect if the recall is evaluated with importance. However, we should note that the F-measure of DL1 is always not worse than the F-measure of DL0.","We set the occurrence probability of the homophone error at p = 0.05. However, each homophone set has its own p. We need decide p exactly because the identifying strength of the written word depends on p. However, DL1 will produce better results than DL0 if p is smaller than 0.05, because the precision of judgment by the written word improves without lowering the recall. The recall does not fall due to smaller p because It0 and R1 are independent of p. Moreover, from the definitions of P0 and Pt, we can confirm that the precision of judgments by the written word improves with smaller p. 185 Proceedings of EACL '99 Table 5: Result of experiments homophone set Number of","problems { ~, t~ } 1,254 { ~, ~-~ } 1,938"]},{"title":"{ } { { r ,c, } { )","paragraphs":["4,845"]},{"title":"3,682 2,032 618 588 { ~,~,~,, ~]:J= }","paragraphs":["1,436 { ~, ~¢ } 1,220"]},{"title":"{ ) mean","paragraphs":["1,563 1,074 1,636"]},{"title":"I","paragraphs":["DLO DL1 Po [ Ro I Fo"]},{"title":"et ] R1 I Fx","paragraphs":["0.190 0.824 0.309 0.310 0.774 0.443 0.295 0.899 0.443 0.573 0.835 0.680 0.583 0.957 0.724 0.616 0.934 0.742 0.343 0.911 0.499 0.470 0.725 0.571 0.773 0.987 0.867 0.804 0.981 0.884 0.708 0.980 0.822 0.806 0.980 0.885 0.127 0.745 0.217 0.289 0.420 0.342 0.391 0.939 0.552 0.440 0.913 0.594 0.789 0.990 0.879 0.903 0.910 0.906 0.548 0.966 0.700 0.617 0.911 0.736 0.091 0.692 0.161 0.135 0.287 0.183 0.681 0.976 0.802 0.760 0.858 0.806"]},{"title":"II 0.46010-906 I 0-581 II 0.560 10.79410.648","paragraphs":["1,824","The number of elements of all homophone sets used in this paper was two, but the number of elements of real homophone sets may be more. However, the bigger this number is, the better the result produced by our method, because the precision of judgments by the"]},{"title":"default","paragraphs":["evidence of DL0 drops in this case, but that of DL1 does not. Therefore, our method is better than the original one even if the number of elements of the homophone set increases.","Our method has an advantage that the size of DL1 is smaller. The size of the decision list has no relation to the precision and the recall, but a small decision list has advantages of efficiency of calculation and maintenance.","On the other hand, our method has a problem in that it does not use the written word in the judgment from a; Even the identifying strength of the evidence in a must depend on the written word. We intend to study the use of the written word in the judgment from a. Moreover, homophone errors in our experiments are artifidal. We must confrm the effectiveness of the proposed method for actual homophone errors. 6 Conclusions In this paper, we used the decision list to solve the homophone problem. This strategy was based on the fact that the homophone problem is equivalent to the word sense disambiguation problem. However, the homophone problem is different from the word sense disambiguation problem because the former can use the written word but the latter cannot. In this paper, we incorporated the written word into the original decision list by obtaining the identifying strength of the written word. We used 12 homophone sets in experiments. In these experiments, our proposed decision list had a higher F-measure than the original one. A future task is to further integrate context and the written word in the decision list. Acknowledgments We used Nikkei Shibun CD-ROM '90 and Mainichi Shibun CD-ROM '94 as the corpus. The Nihon Keizai Shinbun company and the Mainichi Shinbun company gave us permission of their collections. We appreciate the assistance granted by both companies. References","Atsushi Fujii. 1998. Corpus-Based Word Sence Disambiguation (in Japanese)."]},{"title":"Journal of Japanese Society for Artificial Intelligence,","paragraphs":["13(6):904-911.","Andrew R. Golding and Yves Schabes. 1996. Combining Trigram-based and Feature-based Methods for Context-Sensitive Spelling Correction. In"]},{"title":"3~th Annual Meeting of the Association for Computational Linguistics,","paragraphs":["pages 71-78.","Andrew R. Golding. 1995. A Bayesian Hybrid Method for Context-Sensitive Spelling Correction. In"]},{"title":"Third Workshop on Very Large Corpora (WVLC-95),","paragraphs":["pages 39-53.","Jun Ibuki, Guowei Xu, Takahiro Saitoh, and Kunio Matsui. 1997. A new approach for Japanese Spelling Correction (in Japanese). SIG Notes NL-117-21, IPSJ. 186"]},{"title":"Proceedings of EACL '99 Masahiro Oku and Koji Matsuoka. 1997. A Method for Detecting Japanese Homophone Errors in Compound Nouns based on Character Cooccurrence and Its Evaluation (in Japanese). Journal of Natural Language Processing, 4(3):83-99. Masahiro Oku. 1994. Handling Japanese Homophone Errors in Revision Support System; RE-VISE. In 4th Conference on Applied Natural Language Processing (ANLP-9$), pages 156-161. Hiroyuki Shinnou. 1998. Japanese Homohone Disambiguation Using a Decision List Given Added Weight to Evidences on Compounds (in Japanese). Journal of Information Processing, 39(12):3200-3206. Koji Tochinai, Taisuke Itoh, and Yasuhiro Suzuki. 1986. Kana-Kanji Translation System with Automatic Homonym Selection Using Character Chain Matching (in Japanese). Journal of In-formation Processing, 27(3):313-321. Sakiko Wakita and Hiroshi Kaneko. 1996. Extraction of Keywords for \"Homonym Error Checker\" (in Japanese). SIG Notes NL-111-5, IPSJ. David Yarowsky. 1994. Decision Lists for Lexical Ambiguity Resolution: Application to Accent Restoration in Spanish and French. In 32th Annual Meeting of the Association for Computational Linguistics, pages 88-95. David Yarowsky. 1995. Unsupervised Word Sense Disambiguation Rivaling Supervised Methods. In 33th Annual Meeting of the Association for Computational Linguistics, pages 189-196. 187","paragraphs":[]}]}