{"sections":[{"title":"","paragraphs":["IR-NLI : AN EXPERT NATURAL LANGUAGE INTERFACE TO ONLINE DATA BASES"]},{"title":"(o)","paragraphs":["Giovanni Guida , Carlo Tasso (*)","Istituto di Matematica, Informatica e Sistemistica","Universit~ di Udine Via Antonini,8 - 33100 Udine, Italy ABSTRACT","Constructing natural language interfaces to computer systems often requires achievment of advanced reasoning and expert capabilities in addition to basic natural language understanding. In this paper the above issues are faced in the frame of an actual application concerning the design of a natural language interface for the access to online information retrieval systems. After a short discus - sion of the peculiarities of this application, which requires both natural language understanding and reasoning capabilities, the general architecture and fundamental design criteria of a system presently being developed at the University of Udine are then presented, The system, named IR-NLi, is aimed at allowing non-technical users to directly access through natural language the services offered by online data bases. Attention is later focused on the basic functions of IR-NLI, namely, understanding and dialogue, strategy generation, and reasoning. Knowledge represenetation methods and \"~igorithms adopted are also illustar~ed. A short example of interaction with IR-LNT~I is presented. Perspectives and direcZions for future research are also discussed. I INTRODUCTION","Natural language processing has developed in the last years in several directions that often go far beyond the original goal of mapping natural laua- ~uage expressions into formal internal representa - zions. ?roblems concerned with discourse modeling, reasoning about beliefs, knowledge and wants of speaker and hearer, expiicitely dealing with goals, plans, and speech acts are only a few of the topics ~f current interest in the field. This paper is con- :erned with one ~spect of natural language processing that we name here reasoning, it is intended as a basic • ctivity in natural language comprehension that is aimed at capturing spes/~er's goals and inten - tions that often lie behind the mere literal meaning of the utterance. In this work we explore the main implications of reasoning in the frame of an acttu&l application which is concerned with the natttral language acees to online information retrieval services (Politt,1981; Waterman,1978).","In particular, we shall present the detailed design of a system, named IR-NLI (Information Retrieval Natural Language Interface), that is being developed at the University of Udine and we shall discuss its main original features. The topic of natural language reasoning is first shortly i!lustrated from a conceptual point of view and compared to related proposals. The main features of the chosen application domain are then described and the specifications of ~R-NLI are stated. We later turn to the architecture of the system and we go fturther into a detailed account of the structure of its knowledge bases and of its mode of operation. Particular attention id devoted to the three fundamental modules STARTEGY GENERATOR, REASONING, ~nd UNDERSATNDING AND DIALOGUE. A sample search session with IR-NLI concludes the illustarion of the project. A critical evaluation of the work is zhen presented, and main lines of the future development ~f the project are outlined with particular ~tention to original research issues. II NATURAL LANGUAGE UIi~ERST?S4DING .~ND REASONI:~G","Research in natural langage precessin 6 has recome in the last years a highly multiiisciplinzry topic, in which artificial inteliigence, computational linguistic, cognitive science, psycholo~- , ~nz logic share a wide set of common intrests, in tnia frame, reasoning i~ not a new issue. The meaning that we attach to this term in the zontex~ ~f this [~ R±~o with : Milan Polytechnic Artificial Intelligence Project, Milano, Italy. ' ~ ~iso with : CISM, International Center for Mechanical Sciences, Udine, Italy. 31 work is, nevertheless original. We distinguish in the natural language comprehension activity between a surface comprehension that only aims at representing the literal content of a natural language ex - pression into a formal internal representation, and a leap comprehension that moves beyond surface meaning to capture the goals ~nd intentions which lie behind the utterance (Grosz,1979; Hobbs,1979; Allen, ?errault,1980). The process that brings from surface to deep comprehension is just what we name here reasonin~ activity. Differntly from Winograd (1980), reasoning is not , in our model, something that ta-kes place after understanding is completed and aims at developing deductions on facts ~nd concepts %cquired. Reasoning is a basic paz~c of deep comprehension and involves not only linguistic capabilities ~understanding and dialogue) but also deduc - tion, induction, analogy, generalization, etc., on common sense and domain specific knowledge. Figure","presents a graphic representation of the basic relationships betwe=n understanding and reasoning, and clearly shows how reasoning moves the internal representation of an utterance from a first point, zorresponding to surface eoprehension, to a second Dne that represents ~eep comprehension.","in the application of online information retrieval that we face in this work,the above concepts are :~nsi!ered in the fr%me of man-machine commLLnica - :ion, and reasoning will mostly be concerned with terrsinolo~j, as we shall further explore in the next section. SPEAi(!'R ' S GOAL"]},{"title":"/ ~'~IATU RAL LANGUAGE EXPRESS IONS • . OERSTANO ING '~ REASON I NG ..~ ~ur\"r~lCe","paragraphs":["~lees INTERNAL ~EPRESE.NTAT ION","Figure I. Capturing speaker's goals through natural lang,/age reasoning. !if A SA~MPLE APPLICATION : 3NLIN£ INFO2MATION RETRIEVAL","in :his section we present an application domain ;here the topic of natural language reasoning plays","fundamental role, namely, natural language access to online information retrieval services. As it is well known, online services allow interested users zo solve information problems by selecting and re- ~riev~ng reievant io~uments stored in very large bibilogr%phic sr f~ctual data bases. 3enerail~\" end-users ire unwilling or unable] ~o serach ~ersonai!y and iirectly access these large files, but they Dften rely 3n the ~ssistanee ~f e skilful information professional, the intermediary, who h.ws how tc select e~prtpriate data bases end hr.. to design good search ~%artegies for the retrieval of the desired information, and how ~o impiement them in e suitable formal luery !an~/age. Usually, the interaction between end- ~=er %n~ intermediary begins ~ith ~ presearch intervlew aimed e~ precisely clarifying the content and t .e Db.jecti'zes of nhe information need. On tha base zf the information gathered, the inzeremdiary chooses 32 the most suitable data bases and, with the nei~ :f seraching referr~l aids such ~s thesauri, iirecncties, etc., he devises the search ~trate~# no 0e executed by the information retrieval system. The output of the search is then evaluated by the end-user, who may propose K refinemen~ ~nd an interaction of the search for better matching hi3 requests.","We claim that the intermediary's task represents a good example of the issues of natur~i ian~aage reasoning, part~icularly for what concerns the ebliity ~f understanding natural language user'3 :'equest~ an! ;:' reasoning on their linguistic and aemanzlz z'..nn:e~ in order :o fully :~pture user's nears ~nd gczl~. Besides, it has to be stressed that ~he intermedizrv should also posses other important skills, nh..: i_ expertise ~nd precise knowledge ~bout ia~a ba~e can-tent, organization, and indexing criteria, abcu~ availability and use of searching referral ai!s,abBut system query languages and ~coess procedures, znd last about how %o plot ~nd construct en adequate search strategy. The above illustrated :hrzcteriszlcs motivate the design of a natural Language expert ~ystem for interfacing online ~ata bases. 3n fact, the !R-NLI project has among its long term goals the i~ plementation of a system to be interposed between the end-user and the information retrieval system, capa ble of fully substituting the intermediary's role. IV THE IR-NLI SYSTEM","IR-NLI is conceived as an interactive interface to online information retrieval system suppoz~ing English language interaction. It should be able to manage a dialogue with the user on his information needs and to construct an appropiate search strategy. More precisely, IR-NLI is aimed at meeting the needs of non-technical users who are not acqua/nted with on line searching. For this purpose three different capabilities are requested. First, the system has to be an expert of online searching,i.e, it must embed knowledge of the intermediary's professional skill. Second, it must be able of understanding natural language and of carrying on the dialogue with the user. Third, it has to be capable of reasoning on language in order to capture the information needs of the user and to formulate them with appropriate terms in a given formal query language.","In the current first phase of the project we have considered a set of working hypotheses for IR-NLI :"]},{"title":"-","paragraphs":["it operates on just one data base; - it utilizes only one query language; - it refers to only one subject domain; - it is conceived only for off-line use without interaction with the data base during the search session. fire suitable sequences of understanding, dialogue, and reasoning functions until the internal repre.- sentation of the user's requests is completely expanded and validated.","The UNDERSTANDING AND DIALOGUE module is devoted to perform activities mostly of linguistic concern. First, it has to translate the natural language user's requests into a basic formal internal representation (IR). Second, it manages the dialogue with the user by generating appropriate queries and by translating his replays,thus expanding the IR with new information. The UNDERSTANDING AND DIAILGUE ~odule utilizes for its operation a base of lin~uiszic"]},{"title":"kno.led~e (LK).","paragraphs":["The REASONING module is aimed at reasoning on IR in order to enlarge its content with all the information required to generate an appropiate search strate~[. It utilizes for this task a base of domain specific knowledge (DSK).","The FORMALIZER module, after the STRATEGY GEf~- RATOR has completed its activity, constructs from the IR the output search stra~e~ to be executed for accessing the online data base. The FORMALIZER utili"]},{"title":"zes","paragraphs":["for its operation knowledge about the formal fan"]},{"title":"guage","paragraphs":["needed to interrogate the online data base and operates through a simple syntax-directed schema, it is conceived as a parametric translator capable of producing search strategies in several languages for accessing online services, such as SDC ORBIT, Euronet DIANE, Lockheed DIALOG, etc. \"! SYSTSM ARCHITECTURE","The general architecture designed for the IR-NLI system is shown in Figure 2. The kernel of the system is constituted by the 3~dEI'ZGY GENERATOR , which is devoted to devise the top-level choices conzerning the overall operation of the syszem and to :cntroi their execution. It utilizes for it~ acti- \"'ity a base 3f expert knowledge (E~K) which concerns the evaluation of user's requests, the managament 3f the presearch interview, the selection of a suitable approach for ~eneration of the search strategy, and ~uheduling of the activities of the lower Level modules :~ERSTAINDING AND DIALOGUE, REASONING, and FORMALIZER. The operation of the STRATEGY GENERATOR is organized around a basic sequence of steps, each taking into ~ccount a differnt subset of expert rules, that"]},{"title":"r%ppiy","paragraphs":["tO different situations and 33"]},{"title":".|t~rll ~angua$1 )","paragraphs":["userrs ~UeStS"]},{"title":"t '-°'°\"°'\"° J r ..... --ml A,~O ~IAt.QGUE ~nowildqQlinqulstic ! 0\". ....","paragraphs":["Figure 2. Functions and knowledge bases ~:\" [R-~[L2. Vl KNOWLEDGE BASES","In this section we shall illustrate the main features of the three knowledge bases utilized by the IE-NLI system.","Let us begin with DSK. The purpose of this kno K ledge base is to store information about the domain covered by the online data base to which IR-NLI refers. This information presents two ~spects : a semantic facet concerning what concepts are in the data base and how they relate to each other, and a linguistic one concerning how the concepts are currently eta'pressed through appropriate termS. The structure of DSK proposed reflects and generalizes to ~ome extent that of classical searching referral aids (in particular, thesauri and subject classifications). At a logical level, it is constituted by a labelled directed network in which nodes represent concepts and directed arcs represent rela-tions between concepts. Each node contains a ~erm., a fla~ denoting whether the term is controlled or not, a field that stores the post in~ count, i.e. the number of items in the data base in which the term appear, and a level number which represents the degree of specificity of ~he term in a hirar- :hical subject classification. Arcs g'n~erai!y denote the usual cross-reference relationships utilized for struc=uring thesauri; e.g., BT (broader term),","(narrower term), RT (related term), UF (used for). In addition, arcs of type ne~ are provided that al-Low, in connection with the level numbers of nodes,","sequential scanning of the knowledge base accoriing to the currently utilized hierarchical subject ~iassification. This s~ructure is conceived to be ilrec~ly obtained (possibly in a partially automatic way ~hrough appropriate data conversion programs) from ~vailable searching referral aids and online thesauri.","Le~ us turn now to LK. This knowledge base is ~imed at supplying all information concerning natural language ~ha~ is needed to understand user's reluests. According to the mode of operation of =he 'XDERSTANDING A~D DIALOGUE module (see section IX), it 2on%ains the lexicon of the application domain which is currently considered. Each record of the lexicon 2ontains ~ word of =he language, its sem:~nt~2 ~2~.~e concept, ~onnec~ive, f'anction~, ~nd its ~e%nin~. The semantic type denotes ~he role ~f % ~ord in a sentence; namely: - ienoting ~ term of zhe da=a base; - iefining z parz icuiar relation between different 2.]nc~ta in user's requests; - specifying ~ particular function that the user ie- ~ires ~o obtain from the information re.ri_,al~ =z ~ystem. The meaning 9f R word may be expressed zs ~ pointer 34 to a term of the DSK in the case of a word of type concept, as a special purpose procedure in ~he case of a connective or a f~nc:ion.","Let us note that,in order to avoid ~nuseful duplication of informa=ion in =he DSK and LK, a shared directory of en~r y words may be u~iiized f~r boLh bases.","The purpose of EK is to contain information tha= concerns the professional expertise of the intermediary on how to manage a search session in 0rder to appropriately satisfy the information needs of the end-user. Its contort= is made up sf several classes of rules concerning the different kinds 3f activities performed during a search session. 3he general s~ructure of the rules is of the ciassical type !F-THEN. Vll STRATEGY GENERATOR","The task of the STRATEGY JENEEATCR can be considered from two differen~ poinzs of view :","- an external one, tha= concerns performing in~ermedia~j's activity;","- an in=ernal one, that rela=es to management and control of REASONING and U~DERSTANDiI;G ~ 31ALC-GUE modules. On ~he base of these specifications, it mus~ embed exper~c capabilities and behave Rs a consultation system for information retrieval [?oli:t,~9@: ..... basic mode of operation of this =odtule is ~rganized around the following four main steps tha~ reflect the usual practice of online information searching (Lancaster,~979; Meadow, Cochrane,~Od~. ~. perform presearch interview 2. select approach 3. devise search startegy h. construct search s~ar~egy.","The IN adopted is unique throughou: the whole operation of the system and it is :onszitu:e/ by z frame, initialized by the UNDERSTAS~ING ~ :IALSOUE modu_le,and then further refined and expanded cy the reasoning module. This fr~-me i~ &ErucEured in%z ~ucframes in such % way no :ontain, :!zssi:'~ei un!er different headings, any information ~ha% is relevant for searching an online data base, and ~3 zii;w an effective pattern-matching for the seleczizn cf search approaches and tactics. More ~ecifizziiy, l? encompasses terminology about zoncepts and facetz present in user's requests, c~-ifi=~tizns about search constraints and output forma~, ~nd fi~lres about search objectives such &s recall and ~recisi~n ~Meadow, Cochr~ne,1981~. To go further in our description, let us introduce precise definitions of two technical terms above used in an informal way : search approach : the abstract way of facing a search problem, reasoning on it, analyzing its facets, and devising a general mode of opera~ion for having access to desired informazion stored in an online data base; search tactic : a move, a single step or action, in the execution of a search approach. Let us recall that a search strafe@D, is a program, written in an appropriate formal query lan~aa~e, for obtaining desired information from an online system; taking into account the two above definitions a search strate~j can be viewed as the"]},{"title":"result ~£","paragraphs":["the execution of a search approach through application of appropriate ~earch tactics.","Within IR-NLI, a search approach is represented as an al~orithm that defines which tactics to utilize, among the available ones, and how to use them in the construction of a s~rate~. An approach is not however a fixed procedure, since it does not ~pecify at each step which paz~cicular tactic to execute, but only suggests a set of candidate tactics, whose execution may or may not be fired.","Tactics are represented at two different levels of abstraction :","- an high-level representation <name, objectives> provided for ~se by the STRATEGY GENERATOR;","- a low-level representation <name,reasoning actions> supplied for use by the REASONING modLtle. About ~5 tactics ~re considered, taken from the very rich discussion by Bates (]979) : CORRECT, CUT, SELECT, EXHAUST, .REDUCE, PARALLEL, PINPOINT, BLOCK, $b~ER, SUB, RELATE, NEIGHBOUR, FIX, RESPELL, RESPA-2Z, etc.","The operation of the STRATEGY GENERATOR is basically pattern-directed; namely, the particular activities to be performed and the way in which UNDERSTANDING ~D DIALOGUE and REASONING modules are activated are determined by the content of the current IR *or of some par~cs of i~), which is matched with zn appropriate subset of the exper~ rules. In :his way !~3 mode of ~peration is not strictly determinate : ~ome %ctivities may or may not be fired .r may be perfDrmed in !ifferent ways according ~o the results 3f :he pattern-matching algorit~hm."]},{"title":"module STRATEGY GENERATOR initialize search session per~o~ presearch interview actiuage UNDERSTANDING AND DIALOGUE <generation of IR from first user's requests> <pattern-cna~ching with the","paragraphs":["cu.rr~nt"]},{"title":"It? and selection of aubfr~nes tha~ could be appropriatel~ filled up with new info~naeion> a~iv~e UNDERSTANDING AND DIAbgGUE <engag~nent of suitabZe dialogue for gather~ing additional information about search convent and objectives : concepts, limitations, con- attaints, e~uaions, decider precision ~nd reca~Z> <aa~ansion of IR> seZect approach <selection of the approach which best fits search objeccive8 through pattern-marching bemaeen IR and high-level represencation of ~a~ics involved in each approach> devise search strategy <pa~tarn-ma~ohing bevween vhe current IR and tactics involved ~n the selected approach> <firing of appropriate tactics> activate REASONING <as:passion of IR through execuvion of reaso- ning a~ions> activuZe UNDERSTANDING AND DIALOGUE <uaZidation of eurrencZy expanded IR> oonaCru~C search strategy activate FORMALIZE2 <generation of search aCraCegy f..om fully ~xpc:dad IR> close search session endmodule","paragraphs":["As already mentioned in section IV, in the first version of IR-NLI the off-line operation :f the system lead us go consider only the buiidin~ block approach; future versions of the system viii encompass also other classical and ~ommoniy u~ilized approaches such as successive fraction, zita - :ion pearl growing, most speclfic facet flrsn, ~nc. {Meadow, Cochr~e,1981), ~hac are more ~uizab!e fJr an on-line operation of the ~ystem in which iicezt interaction with the data base luring the ae~rcn session is allowed. VIII REASONING","The .ctivity 3f the STRATEGY GENERATOR can now he repr:sented in % more ~etaiied way through ~he fsllowing high-lave! program : The REASONING module operates on the IR"]},{"title":"ani za","paragraphs":["aimed at precisely capturing user's ~cals ~nd neela through deductive and inferenniai processes. More specifically, the REASONING uodule has the main ~a~k of executing the tactics fired by the S.-?..ATE-GY GENERATOR. Hence, from this point cf view, it 35 represents the actuator of the reasoning process devised by the STRATEGY GENERATOR.","It utilizes the low-level representation of the tactics, which specifies suitable reasoning actions expressed in terms of : - accessing DSK; - updating the I~ with the new information. Among the basic capabilitis of the ~ESONING module we consider generalization to broader terms, extension to related concepts, particularization to narrower terms, analysis of synonymi and homonymi, etc. its operation is based on special-purpose procedures that correspond to the reasoning actions involved in the tactics. Furthermore, when an action has to be performed on IR for extending its content, validation may be requested from the user in order to ensure a correct matzhing betvwen his wants and system proposals. This is done through the U~DERSTANDING AND DIALOGUE molule which has to gather user's agreement about the new terms to be introduced in the IR. ZX U~DERSTA/~DING .~D DIALOGUE","Zdr.e purpose of the UNDERSTANDING AND DIALOGUE module is twofold :","- =o ~ranslate user~ requests into IR;","- to generate ~ueries to the user and to understand his ~nswers, i.e. to manage a bounded scope dia-Logue.","The conception of this module strongly relies, fDr what ~oncerns ~he ,anderstanding function, un ~he experience previously developed by the authors vith ][LI project, and is organized around the con- :epts of semantics-directed and goal-oriented parsing ~Guida,Tasso,IQ82a).its mode of operation is ma~niy rule-based : ~ main parsing algorithm per-for=Is the most elementa~/ steps of the ~nalysis search in the lexicon, construction of a basic ten~ative internal representation, validation of • :'.: basic internal ~epresentation~, an~ manages a 7%ttprn-iirected invocation of heuristic rules for :-eso~uti~n 9f critical ~vent~ 'e.g., ambi~ai~ies, 9ilizpes , %naphorlc references, indirect ~9eech, :[2..~ important feature 0f the understanding fun- ~%lon iz the ability to solve critical situations by engaging the user in a clarification iizlDgue ±ccivated by some of the above mentioned heuristic rules, to gather additional information which is zecessar}\" to correctly ~inderstand the input natur%i [~nguage requests.","For what concerns the dialogue function, it relies on two strictly connected activities :","- generation of a lue~j, according to some requests from the STRATEGY GENERATOR ~r HEASONIIIG modules, through assembly and completing of parametric =e:~ fragments stored in the UNDERST.~ND!NG '~D DIALOGb~ module%","- understanding of the user's answer and refinement, i.e. validation, updating or completing, of the current IR. Let as s~ress that, according to the basic goal-oriented conception of the parsing mechanism of \"~TDERSTANDING AND DIALOGUE module, the ur.ders~uding activity performed in the frame of :he diaiogue function is strongly directed by knowledge of the query tha~ the system has asked the user ~nd, therefore, of expected information to be zap~ured in the answer. X A SAMPLE SEARCH SESSION","In this section we present % short example of the basic mode of operation of IE-ZLI. Figure shows a sample ~ession in which, in ~ddition to the user-system dialog/e, parts of the .'R and the search strategy generated (in Euronet DI.L\\'~ EL~O-LANGUAGE) ~re reported. The -~xample refers to the domain of computer science. iCi CONCLUSIOn;","In the paper the main features of =he ZR-~;LI system have been presented. The projec~ is now entering the experimental phase =hat will be carried on on a VAX 11,'7~0 syszem.","The design activity so far !evelc~ed ,3uiia, Tasso,1982b,1982c) has reached, 2n cur mind, a quite assessed point so that fuzure work :n -his norA-\" will oe mainly concerned wi-h r~mo':~i -f -he restric =ions and working hypotheses -'onsiaered in the current first ~nase and with refinemenr. ::' [z~/emen=~- %ion de=aLia. ~he authors also g~±n %: [aziememt _n the next future a-'omple~.e prototype versicr. ~f =::z system to be -'onnected to a real ;nlane S~:s=e~ in \"-he fro-me .~f a strictly application ~rle..ted interest .","The research activity will be focused, .'n -he ocher hand, on several issues c'::z= [i,~-r'--~ f-~her 36 > PLEASE SPECIFY YOUR REQUEST ! * I would like to have information about intelligent terminals for online information","retrieval","IR : concept-1 : INTELLIGENT TERMINALS concept-2 : ONLINE INFORMATION RETRIEVAL > DO YOU PREFER AN HIGH RECALL OR AN HIGH PRECISION SEARCH ? * an high recall one > DO YOU HAVE ANY PARTICULAR POINT OF VIEW TO CONSIDER FOR THIS RESEARCH ? * yes, cost considerations > ANY OTHER ONE ? * no > DO YOU LIKE ONLINE OR OFFLINE PRINTING OF RESULTS ? * please supply offline prxnting > PLEASE SPECIFY THE FORMAT : WITH OR WITHOUT ABSTRACT ?","with abstract IR : concept-3 : cost recall : HIGH output : OFFLINE, FULL FORMAT > BUILDING BLOCK APPROACH SELECTED > TRYING TACTICS :","SELECT","PARALLEL","RELATE","RESPELL","RESPACE","> THE CONCEPT \"ONLINE INFORMATION RETRIEVAL\" COULD BE SPLITTED INTO : - ONLINE - INFORMATION RETRIEVAL PLEASE VALIDATE yes","> THE FOLLOWING ADDITIONAL TERMINOLOGY IS PROPOSED FOR THE CONCEPT \"ONLINE\" L~FfERACTIVE, REALTD[E PLEASE '/ALIDATE !","* ok > THE CONCEPT \"ONLINE\" COULD BE EXPRESSED THROUGH THE FOLLOWING TERMS : ONLINE, ON LINE, ON-LINE PLEASE VALIDATE ! * ok > SEARCH STRATEGY ]ENERATED : I. FI?D I:~ELLIGENT.TERMINALS 2. FInD ONLINE OR ON.LI~ O__RR INTERACTIVE O__RR REALTIME OR REAL.TIME","FInD INFORMATION OR REFERENCE OR BIBLIOGRAPHICS OR RETRIEVS OR SEARCH$ 2. FInD COSTS OR PRICE 5. FI~ S=~ A~ S=2 ;~ND S=3 A~ S=4 6. ?RI2~ FI","> END OF SEARCH SESSION, BYE Figure 3. Sample search session with IR-NLI. 37 investigation. Among these we mention :","- the development of more flexible and robust dialogue capabilities, including limited justification of the mode of operation of ~he system (Webbet,1982);","- the study of advanced representations of ~actics through generalized rule structures that will allow more refined matching and firing mechanisms (Winston,198E);","- the design of new tactics (e.g., PATTERN, ~ECORD, BIBBLE (Bates,~979)) ~nd reasoning actions, that enable the system to keep track of previous search sessions ~nd to ~nalogize from experience in devising and executing a search approach.","D.A. Waterman. 1978. Exemplery programming in RITA. In D.A.Waterman, F.Hayes-Roth (Eds.), Patzern ±irected inference ~stems, Academic Press, ::~w f~rk, 261-279.","B.Webber, A.Jozhi. 1982. Taking the ini~iazi':e in natural language data base interactions : justifying why. Proc. COLiNG-82,Prague, Czechoslovakia, North-go!land Linguistic Series aT, ~13-g~8.","T.Winograd. 1980. Wh~rt does it mean to understand natural language? Co~nuitive Science k, ~09-2~.","P.H.Winston. 1982. Learnin~ by au~mentin~ rules an! accumulatin~ censors. Artificial intelligence Laboratory, Massachusetts Institute of Technol~%7, AIM 678, Cambridge, Massachuse~zs. XII REFERENCES .F.AJ.len, C.R.Perrau_It. 1980. Analysing intention in utterances. Artificial Intelligence 15,3. .J.Bates. '979. Information search tactics. J. of the Ameri~.an Society for Information Science 30,"]},{"title":"205-2'","paragraphs":["\". .D.3rosz. \"~:79. r/tterance and ebjective : issues in za-ur~i lan%,lage ~-ommunication. Proc. 6th int. Joint 7cnf. on Artificial intelligence, Tokio, Japan, '~67-TO76. .3uida, 2.7zsso. 1982a. NLI : a robust interface for natural l~nguage person-machine ccmmunica - tion. int. 7. ~f Mam.-Machine Studies 17. .]uida, \".Tasa=. '982b. Natural language access to '.~ ine iaua ba-~_a, in R.Trappl (Ed.), Cybernetics ~.~-~ystems ?.ese~_r~h ' North-Halland Amsterdam,"]},{"title":"~.~ul.~,C.:~sso. '}c2:. )nline information retrieval","paragraphs":["~hrou~h na.~ra I 2 n%_aa~e\" Proc. Conf. on Analyzis,","\"'- ~j~%lua-lzn~-:- Man-Machine Systems, Baden-B~den, .;est Germ. an7, Pergamon Press, Oxford.","J.R. Hobbs. ~gz~\" l°ncversatlon as olanned behaFiour. Proc. 6th \"-- --=","............. r.z ]onf. :n A.-tificia! lnte!ii- ~, Tokio, j=_~. 390-]96-? F.:I. Lancaster. '}-}. i~fc_z..a_i:.i retrieval ~ystems. ./=an Wiley ~ $cna, ie',,' Ycr-.","7-~-\" )!ezdo'w,P.A. is~.::r%n~ :~-~! -=asizs ~\" ::.line -~. ucP.r. ,~l-9~; k oorls \"'e \",- A.S.P'~Ii<t. ~98]..-'m exne.-- system as ~ online search, inter.mediary. ~Sth .'n~. :nline !nf~r- ~at-C= )[e~r : n - ~,~._ _","......... , =-'.gland, 25-32.","L.C.Smi=h. \"~,~0. imoli.-~:ic.~ ~f ~trifi~ial \" 1~;",".... in% e--. - gence f=r end user uae of ]nline sys-ems. Online Review; ~, 3~3-39~. 38"]}],"references":[],"cites":[{"style":0,"text":"Winograd (1980)","origin":{"pointer":"/sections/1/paragraphs/6","offset":1063,"length":15},"authors":[{"last":"Winograd"}],"year":"1980","references":[]}]}
