{"sections":[{"title":"Hypothesis Selection in Grammar Acquisition","paragraphs":["Masaki KIYONO * and Jun'ichi"]},{"title":"TSUJII","paragraphs":["Centre for Compul, ational Linguistics","University of Manchester Institute of Science and Tcchnoh)gy PO ]3ox 88, Manchester M60 1QI)","United Kingdom"]},{"title":"kiyonoOccl, umist, ac. uk, tsuj i iOccl, umist, ac. uk Abstract","paragraphs":["This pat)er t)resents some techniques for selecting linguistically adequate hypol;heses of new grammat.foal knowledge to be used as resources of gralmnatical knowledge acquisition. In our frame-work of liuguistic knowledge acquisition, a rule-based hypothesis generator is inw)ked in case of parsing failures and all the possible hypotheses of Llew graliLlnar rules or lexical entries are generated ffOln partial parsing results. Although each hypothesis could recover the (lef>cl, s of the existing grammar, the greater part of hypotheses are linguistically unnatural. The techniques we propose here prevent such unnatural hypotheses Dont being gene,'ated without discarding plausible ones and make the following corpus-based acquisition l)rocess In(ire ellieien(, and more reliable."]},{"title":"1","paragraphs":["Introduction Reusability of existing linguistic knowledge is the most import,~mt requirement for the rapid development of pra.ctical nal, ural ]augtlage l)rocessing systems. In order to realize, automatic customizatiou of existing linguistic knowledge to each applicat;ion domain, we proposed a new approach of linguistic knowledge acquisition, which is a combination of symbolic and statistical approaches [Kiyono and Tsujii, 1993].","The fi:amework of our al)proach is shown in Figure 1. '1'111\". acquisilion flow starl;s with executing the l)arse of each sentence in a corpus. If parsing lhiled, |,he 'tiypoi;hesis Generator' produces the hyl)otheses of additional gramnu~tical knowh;dge, each of which could recover t;lle incompleteness of the existing grammar After iterating t;his hypothesis generation process for all the senten('es in the corpus, the hypotheses are passed to the statistical analysis procc.ss and finally plausible hypotheses are chosen as new knowh'.dge by observing statistical properties of tile hypotheses.","Unlike robusl; parsing [Mellish, 1989; Goeser, 1992; l)ouglas and I)ale, 1 !)92] or nou-statisl.ical alll)roach for grallunar a(:lluisil;ioll , our al/proach does Ilol; require a mechanism to detect tile cause of the parsing fail-- ure in the sentencial analysis phase and therefore the 'Ilypothesis (~eneral;or' may output ;111 I,he possible hypotheses, l[owever, the greater part 1)t' hypotheses generated by a simple deductive mechanism are unnatural revisions of the e.xisting grammar. For example, even ~ rule which derives a tot) node category ,9 direcl,ly from the input string of words might be hypol,hesize(I.","*a.lso a staff member ol7 Mattsus|dt~t Electric lndustri~d Co.,Ltd., Shina.gawa, Tokyo, .IAPAN."]},{"title":"Q__._ C°rlnts ) i 17 k Ilypothesis [","paragraphs":["(lener;ttor"]},{"title":"C nyl,oth~s,: ,~ i~)-- ..... i ~ (~ra111111[tr)","paragraphs":["St a.tistiea.I Analyser"]},{"title":"-<[Iypothesis I)B)","paragraphs":["INdc-Bascd Processing Corpus-Betsed lSocessiu Figure 1: Framework of Graulmar Acquisition","Linguistically unnatural hypqtheses have harnfful et: fects on lille lbllowing corpus-based process, not only making the process inefficient but, also int, erl'ering wil, ll statistical dnl, a as noise. In this paper, some techniques to remove such inadequate hytml, heses are proposed and the results of exl)eriments which show the efl'ecl.iwme.ss of the proposed techniques are also discussed."]},{"title":"2 Grammar","paragraphs":["Hypothesizing"]},{"title":"2.1 Grammar","paragraphs":["Formalism The grammar lbrlnalisnl we use is a conventional uniIication-based grammar. F, ach gramLnar rule is written in the form of a combination of a conl, ext-free rule and feature unilication functions. This R)rmalism is not specitic to any linguistic ~;heory, but we inl.roduced a number of concepts widely accepted in lil,- guisl, ic theories, such as grammatical flmctions, sub-"]},{"title":"categorization |'ralLies,","paragraphs":["aim X-bar theory.","'FILe parsing system we introdttced 1,11 allply our grammar lbrlnalism is a sysl,enl called SAX [Matsmnoto, 1986]. SAX uses the concepts of act, iw~' and inactive edges of Chart P~lrsing and analyses an input sentence with a bottom-up and parallel algoril;hm. As the grammar hyl)othesiziLLg algorithm is supposed l:o refer partial parsiug results of unsuccessflflly parsed sentences, we slightly modified SAX so that it ou/.lmts inactive edges as partial parsing results. 837 2.2 Basic Algorithm When SAX fails to parse a sentence, no inactive edge of category 5' sl/anning the whole sentencc exists in the parsing result. Grammar tlypothesizing is a process to introduce this inactive edge by augnlentmg the current gramnmr. The basic part of the hypothesis generation algorithm is written as fbllows:","[Algorithm] An inactive edge lie(A) : a:o, '%1 Call be introduced from x0 to x,~, with label A, by each of the ]lypotheses generated by the following two steps. [Step 1] For each sequence of inactive edges,","lie(B1): :r0,Xl],..., [ie(Bn) : .Vn_l,a:n], spanning","from x0 to x~, generates a yew rule. A :=> /31,-..,B n","[Step 2] For each existing rule A -~ AI,...,An, find an ineonlplete sequence of inactive edges, lie(A1) : x0,xl], ..., [ie(Ai_l) : xi-~,Xi_l], [ie(Ai+l ): :ci, .r:i+l] .... , [ie(A,) : :,:,,_~, x,~], and call this algorithm ibr [ie(Ai) : xi-1, .vii. Feature Structures: A rule generated in [Step 1] could be a lexieal entry when this top-down algorithm reaches the bottom. As we adopted a unification-based grmnmar fbrmalism, we extended the algorithm so thai, it can hyt)othesize a feature structure of a lexical entry by observing surrounding successful categories. As the algorithm works even ibr a eOml)lex feature like a subcategorization frame, it can be used to acquire a subeategorization dictionary. While some previous works on subcategorization fi'alne acquisition assumed very little prior knowledge concerning the classification of subcategorization frames [Brent, 1991; Manning, 1993], our apllroach assumes the existence of grammar rules Sllecifying subcategorization fi'ame assignment, which enables more accurate learning of subcategorization frames. Multiple Defects: In [Step 2] of the algorithm, it is SUl)t)osed that each unsuccessfully parsed sentence has exactly one cause of failure but a sentmtee in actual texts often contains two or more causes of failure (for example, two unknown words). To solve this problem, we extended the algorithm so that it searches for a multiple hypothesis which is a set of rewriting rules and lexlcal entries. 3 Hypothesis Selection 3.1 Basic Grammatical Constraints From a linguistic point of view, hypotheses generated by the algorithnl given above might contain nlany unnatural hypotheses because the algorithm itself does not have any linguistic knowledge to judge the appropriateness of hypotheses. To remove unnatural hypotheses, we have introduced the following criteria [Kiyono and Tsujii, 1993].","• The maximum number of adjacent unsuccessful categories is set to 2 in order not to decrease the efIiciency of the algorithm.","• The lnaxilnuln nulnber of daughter nodes is set to 3.","• Supl)osing that the existing grammar contains all the category conversion rules, a mmry rule which has only one daughter node is not generate.d. • Using generalizations embodied ill the existing grammar, a hypothesis contaiuing a sequence of subnodes which are collected into a larger category by existing grammar rules is not generated.","• Distinguishing non-lexieal categories from lexica.l categories, a hypothesis whose mother category is a lexical category is not generated.","• Assuming that tile existing gramznar has a complete set of fllnctional words, a lexical hypothe~sis is restricted to the open lexical categories, such as noun, verb, adjective, and adverb 3.2 Constraint based on /meal Boundaries A new constraint on the violation of the boundary condition given to phrases was introduced to avoid any collection of adja/:ent successfifl categories in rule hypothesizing. The bomnlary condition is given by putting parentheses at both ends of a phrase, such as a noun phrase, a verb l)hrase, and a prelmsitional phrase. This constraint tilters out a hylmthesis which crosses either end, not both ends, of a phrase. For example, when parentheses are put like \"[Tile default blocking factor] is [20 blocks]\", a hyl)othesis 'VP ='e VP, NP, VE'R.BBIs\"' covering \"blocking factor is\" is discarded because of the violation of the boumlary con dition of a noun phrase \"The defimlt blocking factor\"","This constraint requires the hunlan task of putting parentheses before the hypothesis generator is invoked. hi comparison with writing a constituent structure of tile whole sentence, this work is much easier because we have only to give parentheses to delinite phrases. Moreover, instead of giving parentheses by hand, we can even obtain various tagged corpora. As this constraint is also atlplieable to other constituents of the input sentence, it might improve the etliciency of the top-down hypothesizing algorith m. 3.3 Constraint based on X-bar Theory Most of the criteria in 3.1 are based on linguistic category classification but none of them commits itself to dealing with the rcla.tionship among the nlother node and the daughter nodes. For example, supposing the existing granmmr does not contain a rule for participial adjuncts ill t10UU phrases, the hypothesizing program generates a new rewriting rule 'NP ~. VP, NP' t¥om the phrase \"blocking tactor\" in the sentence \"The default blocking factor is 20 blocks\". Ilowever, tile program also general,es other alternative hyt)otheses from the same phrase, such as 'PP ~ VP, NP', 'INFINIg'IVI'~ ~ VP, NP', and 'THAT_CLAUS'I,/~ VP, NP', each of which derives a. 1lost-positional adjunct for \"default\" by believing \"default\" is a head noun of the noun phrase. Liuguislically, such combinations of nlother nodes and daughter nodes are not allowed. As a general l)rinciple for explaining phrase structures, X-bar lheoryis widely accepted. According to X-bar theory, a grannnar rule is (or can be converted to) either of the following forlns, where each prime(') expresses the l)rojection level of' a head X. The l)rojec - tion level increases as gramnlar rules are applied and X\" is called a maa:imal projection of that category. U and W are adjuncts of X' and should I)e maximal pro jeetions of some ca.tegories. 838"]},{"title":"X\" ~ YX'Z","paragraphs":["X' -> HXW ItLhe cxisi.ing grammar is wriLl,en in X-bar L]mory, l,his const]'aint is drastically etl'(,cliv(~ in reduciug Li.~ mmd)er of hyi)()Lhes(~s. 3.4 Plausibility of Hypotheses Among the hypo|,h(~scs which passed throug, l~ all th(- C()llSi;lll,i[[l;S, ea, c}l oI[c [[;bq ll~ (till'er(ml, plausibility as gramnl;~l;icM knowl(~dg('.. Assumin I, l;[laI, the cxisl;iug grammm' is rtmsonahly COmln'(~hensive , lcxical or idiosyncratic km~wledg(~ should be lllOl:(! i)lausil)le than gen<:ral r(~wril,iug rules, lu oMcr 1;o eulphasizc this ten- (hmcy, each hyl)othcsis is given the rolhm, ing i)lausihil. ity value. W ("]},{"title":"I1 !q)oi) x II ( I1 ypo,:) :'(/::vj,o~) : l- Iv(,v) x n(,~')","paragraphs":["This wdue is relat(~d Io tshc I)rOl)orl, ion of tlw si/e, or tim 1)roducl, of the width and l,he hcighl,, of the m[l)l,r(,c. (:omt)osed by l,he hylmthesis in the whole sLrll(:l;llrO, o[' the senl;(mcc. The wduc ral~ges I'rom 0 l,o 1 and gel,s bigger i[' the hypol, hesis cowers a smaller pro'l, o[\" l,[l(~ seHl,ew::e, The widLh or t,h¢~ hyl)ol, hcsis ,"]},{"title":"14:(llypoi),","paragraphs":["is delined as l;he woM cot[l|t ,Jl\" t,hc sul)lrce aml lhe h(~ight II(llgpoi) is as t, he shorl,est, path I'rom h!xical uodes I,o the Lo 1) node ol: I, hc sHt)l, re(!. 4 Experiments 4.:1 Corlms In order to check I, he eIl'ecl;s of the hyp(Mwsis sclecl,ion tcchuiqucs, wc carried out some eXlw.rim(ml;s wil,h I, hc UNIX I.)ll lille [11111[11111. 100 ,q(!ItLCIICOH W(!I'O chos(211 ;~ls HII ext)('~rimt!nLal set from the ll[alttl;t[. 'l'h(~ ch;u'acl;(~risl.ics ol7 this Col'pUS are as fl)llows.","• Number o[' s(mLen(:(~s: 10ft","• L(;ngl.h of senl.cnces: 9.08 w,)rds (av(!rage)","• Number of dilrcr(mt words: 381","• I,'xaull)lcs: 'l'}ler(~ is ]no (:Seal)C: scquc~ll(:c l, hal, prints a (Iot[l)[e-.(lUOl;(~= IJsc Lhc llCXI. ;ll'gUlllt~lt{, ~IS l.he hlocldng fact;or ['or t;al)C r(~cor(Is. The' d('faull, I)lo(:killg factor is 20 I)lo(:ks. 4.2 Given (~rammaticai Knowledge Two set;s (71' grammar rules were prel)ar(~d ti)t' l.h(~ cx perimenl,s, (:ramma'v A and (/ru'ntntar II. (ll?;tllll[lar A contaius 118 r(~writing rules LhaL ('(~vcr basic exprcs sions o1' I,;I@ish. (fl'amma.r l~l is a subset of Grammm\" A and (:on(.ains only 25 rewriting rules. The conl,eul,s o1' (~ra][llll,q.r A all(l (]l';[llllllar [{ ;[I'C ,~howll ill 'rablc 1.","The dictionary we use is th(' I','])1~ f';~[glish l)iclioo nary containing 200,000 enl,rics, 'l'hc eifl, rics of Lhis dic-Lionary ar(, not wril.L(m in t.lm I;:)rm o1\" a feal.ur(~ sLruc.. 1,[11'(: t)llt hav0 l,h(~ cllcodcd ild'ormation ()f Lhe SyllL~ctic pM;terns, which wc interpr(% its a f(~at, m'e sl, ru(:Lnre. As Lhe 1';1)1{ I)icl, ionary was d(;vclol)(>d as a masl,cr dicLionary for various al)plications , il; took ht 1;}1(2 il[forilmtioH concerning all 1,he apl)(mran('es of ca(:h word wit]> out"]},{"title":"scre(!niug","paragraphs":["1)y h'(!quen(:ies. Th is characl;crisl,ic of t,lm S(![[ I,(;ll(:(? Verh Phras(~ Noun l'hras,~ I'rel)osit, ionM I'hrase A(Ijectivc 1)tu'as( ' Adverbia.l ]'hrase Inlinitive Claus(! 'l']t;d; ( Jhulse Rchttive Clause Sul)ordinate ( ',l;ttls(, 2:1 1 4O 12 27 Y 2 1 9 1 5 I 4 l 1 l (i 0 1 0 118 25 'l'(fl, al 'l'abh'. [: I{.ule (;ounLs of Two (~l:H[llll[~ir SC[,S EI)IL I)icl, ionary i[lcreascs I;h(~ aml)iguity of parsing. [u fact, each word wil, hin the Saml)h', s(mt('~uces I'r()m IJw I;NIX mamIM has 1.49 l)arts of speecl, in l;he I:,l)l/ I)icl, iona, ry while l;hc same vahlc is IAI according I,o the COL/)INS COIl UII, I) I)iclio~lar:ll. 4.3 Generated Ilypotheses (4choral ()utcoll[m: 'Fh<: CXl)r.rimcnts ()[ gencraLiug hyl)ot, hen(~s were carried ()ttl, with (;rammar A umh~r thrt,.e (li[li~rent ctmdMons, (a) using tim basic grammai.- ical (:onsl, rMnLs only, (h) adding Lhe conslraiul with local I)hras;d boundaries giv(m as l)areld;h(:ses, and (c) adding l;tte consLraint wit,h X-I)ar theory, To carry out exp(,rimcnts (h) aud (c), within 1,he targt,t sentl!ll(t(!S, i)arellLh(!s(~s weft! given t() llOllll l)llr;is(~s, ill[illi-. Live chmses, that-cla, uses, aml rod)ordinate clauses A lmrt of I.lw resltll, of (~Xl)erimcnt, (a) is shown in Tahle 2, e;.:h c()hmm of which disl)lays l, he numb('r of hyl)othcsos g(!nm'atcd '['lm cohmms 'SiHgle' and 'MultilflC ~ ,~d.)w I,h(~ mmthcrs of single and multilflC hypol, h(:s('.s resl)eCl,ivcdy.","The r(~sull, s of the t;hre(~ CXl)erimeul,s art. summarized in Table 3. The i)arser failed Lo amdyse 61 out of 100 senL(m(:es and I,he grammar hyl)olJ,esizing program was iuvoked lot 1,hose scnl,tm(;(:.~;. While no hypol, heses were g(mera, Lt~d [rom 2(1 or 30% of unsu(:ct!ssfully parsed s(mt.ca~ces I)ccause tim current hypothesizing algonil, hm does m)t allow verth:M duplical, ion of incOnll)l(%cncss and also because I,he l)armH(d,crs of I, hc basic gra, mnmt-ical (:ons|,raints do 11ol, allow th('. (':xisl,Cll(:(: ()['lllor(; l, ll;lll l.wo adjaceul; inc.omplet,~ nodes, Lh('. results on 1,he nttm. l)crs ot acLual hypotheses made show t]ml, lhc ,q|,r()llger l;hc coHsl.raint, we pose, Lhc l}'~wer hYl)ol.heses are gell(W al,(!(I. The average hypol, lieses per S(;ll[,(!ll(;(!, cah:ulatcd 1)y d ivi(ling l,]le total hyl)ol,hc,~;is (:omfl; of 1,30l in (a), 708 in (b), and 23l ill (c), I)y the number or actual scntt'.nccs From which llyl)ol, hcses wer(~ g(m(:]'al,cd, 50 in (a), .~4 in (I,), and 41 i,, ((:), ,w,~ ,.~,h,c(~d r,.(,,,, ~.0 t;() 5.6.","Ill ,~ollie cas(:s, a][ 1,11(~ hyl)oLh(,scs ;IFC l'(~lllOV(!d I)y ncwly introduced COllSl, r;tilli,s, 6 Sclll,(!lic(!s by Lhe local boundary consl,l:ailfl, and 3 more ,q(~llliellC(!S I)y I,he COilsl;raint o1\" X-I)ar I,hcory. hlvestigation of the iuiLial set. of hyl)oLh(~scs .g(:uer;ttct] t'rOllI Sll(:ll SOH{,OIlC(~S r(wc;41(?d thaL no plausible hypot,hesis was included iu it. '['h(~rc %re, Lhcse seni;ences are liOt; criLical to 1,he hyl)oLlmsis seh:cl;ion nmt, hod we inl,roduce(I.","In tim linal sel; o/' hypol.heses, 3{) plausible hyl)(ll.h(!"]},{"title":"839","paragraphs":["Sentence II Single ~_ Multiple II T°t'all","Lex Rule Lex Mixed Rule Tie efault oc ing factor is 20 ~ \"~1800021 The output device in use is not capable of backspacing. l{emove initial definitions for all predefined symbols. The escaped NEWLINE is not included in the macro value. Components of an expression are separated by white space. The name of this directory is listed in tile fohler wu'iable. The name of the editor is listed in tile EDITOR variable. Table 2: }'art of tile Result of Experiment (a) No. of Unsuccessfully l'arsed Seutences No. of Sentences which generated No llypothesis No. of Sentences which generated Single Ilypotheses No. of Sentences whieh generated Multiple IIypotheses No. of Sentences which generated Plausible Ilypotheses Rank of Plausible llyl)otheses (Average) No. of llypotheses (Total) No. of ttypotheses (Average)","Experiment (a) EXllerin,eut (b) l':xperiment (e) 61 61 6I 11 43 7 ' 33 7.4 17 39 5 32 2.8 708 16.1 1301 26.0 20 37 4 30 1.6 231 5.6 Table 3: tlypotheses Generated fi'om Different Conditions ses, 7 new rewriting rules and 23 new or modified lexteal entries, remained without being filtered out by newly introduced constraints Some of the plausible hypotheses are listed below. New Rule: np => np,adjp. New Rule: nil =¢. np,np~ New Rule: np =¢, vp,np. (from 3 sentences) New Rule: up => vppsv,np. New Rule: vp :e~ vp,p. New Lexical Entry: n => ['DF, LI'~TE']. New Lexical Fmtry: n => [patlummes]. Modified Lexical Entry: v => [default]. Modified Lexical Fmtry: adj => [invisible]. Modified Lexical Entry: adj => [callable ]. New Lexical Entry: adv => [recursively].","The weighting function explained ill 3.4 was not used for selecting hypotheses but tim validity of it was proved by counting the order of each plausible hypothesis in the set of generated hypotheses. The row of 'Rank of Plausible IIypotheses' in Table 3 indicates that plausible hypotheses stand much higher than the middle of the order. ExamI)les: IIereafter, in order to show how hypotheses were selected by each constraint, we explain tile results for some typical examples.","Ex.1) \"The default blocking factor is 20 blocks.\" As Grammar A does not contain a rule for participial adjuncts, the parser fails to analyse the noun phrase \"tile det~ult blocking fact, of' and the grammar hypothesizing program is iuvoked. While this program generates 21 hypotlmses in experiment (a), it filters out the following 12 hypotheses in experiment (b). While checking local boundary violation, the program removes those grammatically unnatural combinations of categories, though it does not use any linguistic knowledge. New Rule: advp => np,vp. New Rule: infinitive => np,Vpo New Rule: infinitive => vp,np,vp. New Rule; np => s,vp,np. New Rule: np=> vp,np,vpo New Rule: pp => np,vp. New Rule: pp => vp,np,vp. New Rule: that_clause => vp,np,vpo New Rule: vp => vp,np,auxbe. New Rule: vp --> vp,np,s. New Rule: vppsv => vp,np,auxbe. New Rule: vppsv => vp,np,vp. Moreover, the l)rogram filters otlt (;lie following 4 llypothese with tile constraint of X-bar theory. New Rule: infinitive => vp,npo New Rule: pp => vp,np. New Rule: that clause => vp,np~ New Rule: vppsv => vp,np. Finally, the fol]owing 5 l~ypotheses, alnong which the expected hypothesis 'NI'=> VP, NI\" still remains are generate.d Modified Lexical Entry: n => [factor]. New Lexical Entry: adv => [factor] New Lexical Entry: n => [blocking]. New Rule; np => vp,np. New Rule: np => s,vp,np.","Ex.2) \"Tile output dcviee ill use is not capal)h~ of backspacing.\" This sentence is also parsed unsuccessfully beeause the current version of the EI)R 1)ictionary does not have information that \"capable\" subcategorizes a prepositional phrase. Among the initial set of 30 hyl)otheses , the following 8 llypotheses pass through 840 No. of Unsuccessfully Parsed Sentences No. of Senl,ences which generated No Ilypothesis No. of Sentences which generated Single llypotheses No. of Sentences which generated Multiple llyl)otheses No. (if Sentences which generated Plausible Hyl)otheses No. of Ilylmtheses (Total) No. of llypotheses (Aw'.rage)","(;raimnar A Grammar B","97 61 11 43 7 31","1301 26.0 45 41 11 16 550 10.6 Table d: Ilylmtheses Generated from Two Grammar Sets the constraints o1' local bomMaries and X-bar the-ory. The lirst hypothesis iu the list is the plausible hypothesis obtained in search of the real cause of the feature disagreement between \"capable\" and \"of backsl~aeiug\". This lexical hypothesis for \"capa hie\" contains a modified version of its subcategorizalion frame so that it subcategorizes @prepositional phrase. NodJ_*ied Lexical Entry: adj => [capable]. New Lexical Entry: n => [capable]. New Lexical Entry: v => [capable]. New Lexical Entry: v => [not]. New Rule: adjp => neg,adjp. New Rule: adjp => neg,adjp. New Rule: s => s,adjp. Re~r Rule: vp :> vp,p. 4.4 tIypotheses from Smaller Knowledge Another experiment was pertbrmed with (;ramlmtr B under the basic grammatical eoustraints in order to compare 1,he effects of the maturity of existing gramma.tieal knowledge. The nmnl)ers el' hypotheses generated from two grammar sets are shown iu Tal)le 4. The eoverage of (lranunar II is so limited that 97 ()tit of 100 sentences were parsed unsuccessfully and passed to the Ilypol, hesis Generator [lowew!r, as the immaturity of Grammar B also al[ects the number of generated hypotheses, the mmlber of plausible hypotheses among the 550 hyl)otheses (10.6 hyl)otheses per sentence) generated l'rom 97 sentellces was only I(L This result claims that cyelie acquisition of grammatical knowledge is wdid. I\",w'.n the sentences frolu which no hylmt,heses are gellerated with a small grammar would be taken into consideration ill a. later acquisition cycle with a larger grammar.","5 Conclusion","This paper l)rOl)osed l,eehuiques for selecting appro-","priate hyl)¢)these.s in (.he rule-hased l)roeessing stage","Of grallllllar aeqllisitioll. The experinlents tt) (;X~Llnille","the etl'eets o[' these techniques indicate that (,hey have","several advant;~ges","• The newly introduced COllstraiuls reduce the nmnbet of hypotheses per sentence, from 26.0 1;o only 5.6, small enough to be treal;ed in a corpus-based processing enviromnent. This hyl~othesis selection is done without discarding plausilAe hypotheses. Although, all the initial hypotheses may be, in certain cases~ removed by the lle.W constraints, this hapl)ens only if no plansilAe hyl)othesis is inch,tied iu the ini tM set.","• Even if no hylmthesis is generated from all unsuccessfully l)arsed sentence (20 out of 61 sentences ill experiment (el) or no plausible hypothesis is ill-eluded ill I, he initial hypothesis set (11 out of 41 sentences in experinmnt (el), a plausible hypothesis will be generated in the later acquisition cycle al: ter adding grammatical knowledge vital lot the sentenee~","• Among the generated hypotheses, lexical hypotheses arc more Idausible than rule hypotheses"]},{"title":"(2a","paragraphs":["out of 30 plausible hypothese.s were lexical in expermmnt (el). This fact amahs l;hat the. grammar used R)r the experilnents has an almost sullieient set of rewriting rules and that, after t;he grammar reaches such a mature situat;ion during the acquisition cycle, only lexieal or idiosyncratic knowledge has to be added. As our method has a facility to hypothesize a lexical entry with it, s l~;aI, ure structure including a subcategorization frame, we can set the target of acquisition only to lexieal knowledge for a large dictionary.",",, '['he loeaI boundary const;raint was introduced for automatie hypothesis selection, but it might also be used in an interactive debugging tool lbr grammar lllailltellanee.","References","[lh'ent, 1991] Michael R. Brent. Automatic Acquisition of Subeategorization Frames from Untagged Text. In Prec. of th.e ~29st ACL meeting, pl).209 2t4, 1991.","[l)ouglas and I)ale, 1!)92] Shona l)ouglas and l{obert l)ale. Towards Robust PNI'IL In Prec. of COLING-02, pp.468 474, 1992.","[Goeser, 1992] Sel)astian Goeser. Chart Parsing of II.o-I)ust (~h:amnmrs. hi Prec. of COLING-92, pp.120 126, 1992~","[Kiyono and 'l)sujii, 1993] Masaki l(iyono and aun'ichi Tsujii. Linguistic knowledge acquisition from parsing taihu'es. In Prec. oJ£'AUL-93, pp.222-231, 1993.","[Maturing, 1993] (Jhristopher I). Manning. Automatic Acquisition of a I,arge Subcategorizatiou l)ictionary from Corpora. in PTvc. oJ' lhe 31st ACL mccling, 1)p.235 242, 1993.","[Matsumoto, 1986] Yuqi Matsumoto. A I'm:aiM I'ars-ing Sysl;em for Natural Language Analysis. ]n Lechtrc Noles in Uompuler Science 225, Springer-Verlag, pp.39d 409, 1986.","[Mellish, [989] Chris S. Meltish. Some Chart-hased Techniques for l:'axsing I]l-[brmed Input. In Prec. oJ lhc 27th ACL meeting, pp.102- 109, 1989. 841"]}]}