{"sections":[{"title":"A BIDIRECTIONAL, TRANSFER-DRIVEN MACHINE TRANSLATION SYSTEM FOR SPOKEN DIALOGUES","paragraphs":["Yasuhiro SOBASHIMA, Osamu FURUSE, Susumu AKAMINE, Jun KAWAI,","and Hitoshi IIDA A TR Interpreting Telecommunications Research Laboratories"]},{"title":"ABSTRACT","paragraphs":["This paper presents a brief overview of the bidirectional (Japanese and English) Transfer-Driven Machine Translation system, currently being developed at ATR. The aim of this development is to achieve bidirectional spoken dialogue translation using a new translation technique, TDMT, in which an example-based framework is fully utilized to translate the whole sentence. Although the translation coverage is presently restricted to conference registration, the system meets requirements for spoken dialogue translation, such as two-way translation, high speed, and high accuracy with robust processing."]},{"title":"1. INTRODUCTION","paragraphs":["Transfer-Driven Machine Translation[ll,[2],[9], (TDMT) is a translation technique which utilizes empirical transfer knowledge compiled from actual translation examples. The main part of translation is performed by the transfer module which applies the transfer knowledge to each input sentence. Other modules, such as lexical processing, analysis, and generation, cooperate with the transfer module to improve translation performance. With this transfer-centered translation mechanism together with the example-based f'ramework[3],[4].[5], which conducts distance calculations between linguistic expressions using the semantic hierarchy, TDMT performs efficient and robust translation. TDMT is especially useful for spoken language translation, since spoken language expressions tend to deviate from conventional grammars and since applications dealing with spoken languages, such as automatic telephone interpretation[6],[7l,[S], need efficient and robust processing to handle diverse inputs. A prototype system of TDMT which performs bidirectional translation (Japanese to English and English to Japanese) has been implemented. This bidirectional translation system simulates the dialogues between two speakers speaking in different languages (Japanese and English) using an interpreting telephone system. Experimental results have shown TDMT to be promising for spoken dialogue translation."]},{"title":"2. TRANSFER-DRIVEN ARCHITECTURE","paragraphs":["The bidirectional TDMT system, shown in Figure 1, translates English into Japanese and Japanese into English. Conversion of the translation direction is simply done by flipping the mode selection switch. Moreover, all of the sharable processing modules are used in both translations. This bidirectional translation capability, along with other features adopted tbr spoken language, shows the possibility of two-way dialogue translation. The transfer module, which is the heart of the TDMT system, transfers source language expressions into target language expressions using bilingual translation knowledge. When another language-dependent processing, such as lexical processing, analysis, or generation, is necessary to obtain a proper target expression, the required module is called by the transfer module. In other words, all modules in a TDMT system function as a part of or hell) the transfer module. This transfer-centered architecture simplifies the configuration as well as the control of the machine translation system. English Terminal Japanese Terminal","Fig. 1 Configuration of Bidirectional TDMT System 64"]},{"title":"3. TRANSLATION MECHANISM","paragraphs":["3.1 Examplc-based analysis and transfer The TDMT system utilizes an example-based framework to translate a sentence. The central mechanism of this framework it; the distance calculation[4],[5], which is measured in terms of a thesaurus hierarchy. We adopt the calculations of Sumita[51. Figure 2 shows an example of the transfer knowldege tbr the Japanese pattern \"X no Y.\" (X and Y are lexical variables and \"no\" is an adnominal particle. X' represents the English translation for X, and the English translations are noted in braces after the Japanese words for readers' convenience.) X no Y --~ Y' ofX' ((ronbun {paper}, daimohu {title}) .... ), Y' for X' ((beya {room}, yoyaku {reserwltion}) .... ), Y' in X' ((Tokyo {Tokyo}, haigi {conference}) .... ), X' Y' ((en{yen}, heya {room}) .... ), Fig. 2 An Example of Transfer Knowledge The first transfer knowledge, \"X no Y -, Y' of X' (ronbun {paper}, daimoku {title})\" represents the translation example that a set (ronbun{paper}, daimoku{title}) in structure \"X no Y' is transferred into structure \"Y' of X'.\" Thus, pattern selection is conducted using such examples. When the source pattern \"X no Y\" is applied to an input, the transfer module compares the actual words tbr X and g with the sets of examples, searches for the nearest example set with its distance score, and provides the most appropriate transferred pattern. For example, if the Japanese input is \"Kyoto no kaigi\" and the nearest example set (X, Y) would be (Tokyo, kaigi), then the transfer module selects \"Y' in X'\" as the translation pattern and outputs \"conference in Kyoto.\" Thus, bilingual transfer knowledge consisting of patterns and translation examples is used in TDMT to select, the most appropriate translation. To analyze a whole source sentence and to form its target structure, the transfer module applies various kinds of bilingual transfer knowledge to the source sentencet.ql. Figure 3 is a list of different types of bilingual transfer knowledge (patterns and words), that are used with examples to analyze the Japanese expression \"torokuyoushi wa sudeni o-mochi deshou ha\" and to form its transferred result \"do you already have the registration tbrm.\" As shown in Figure 4, both the source and target structures are formed based on the distance calculation. The numbers in brackets represent the transfer knowledge pairs in Figure 3. X dcshou ka --~ do you X' (1) X wa Y - ~ Y' X' (2) sudeni X --, already X' (3) o-. X -~ X' (4) torokuyoushi ~-~ registration form (5) mochi -~ have (6) Fig. 3 Various Kinds of Transfer Knowledge As we have seen, the example-based framework is employed in the transfer module of the TDMT system, in which bilingual transfer knowledge is used for both analyzing and transferring the input sentence cooperatively. In other words, in the transfer module, both the source and target structm'es are formed by applying the bilingual transfer knowledge extracted from the example database. Source Sentence: \"torokuyoushi wa sudeni o-mochi deshou ks\" ]"]},{"title":"4,","paragraphs":["Source structure Tarzet st,uetu,'c"]},{"title":"×de ho,,l. ] ---3---- r ] do you X (4) ~--~___ (3) ........... (3) -- [","paragraphs":["torokuyoushi ] [ ....... sudcni X ]llii!i!!i!i!iiiiii::il}it ~Y_._X~ I registration fi)rm ] I (6)"]},{"title":"[","paragraphs":["mochi 6 Target you ah'eady have the registration form\" ] I Sentence: lldo Fig. 4 A Transfer Example for \"torokuyoushi wa sudeni o-mochi deshou ka\" 65 3.2 Structural disambiguation Multiple source structures may be produced in accordance with the application of the bilingual transfer knowledge. In such cases, the most appropriate structure is chosen by computing the total distances for all possible combinations of partial translations and by selecting the combination with the smallest total distance. The structure with the smallest total distance is judged to be most consistent with the empirical knowledge, and is chosen as the most plausible structure. (See [9] for details of the distance and total distance calculations.) For instance, when the pattern \"X no Y\" is applied to the expression \"ichi-man en {10,000 yen} no heya{room} no yoyaku{reservation},\" there are two possible structures. 1) ichi-man en no (heya no~) 2) ( ichi-man en no heAL ~) no ~ The TDMT system calculates the total distance for each of the structures 1) and 2) using the bilingual transfer knowledge stored in the system. The following are the target structures when the transfer knowledge in Figure 2 is applied. (Source structures 1 and 2 give target structures 1' and 2', respectively.) 1') 10,000 yen (reservation for room) 2') reservation for (10,000 yen room) In this case, (en{yen}, yoyaku{reservation}) in 1 is semantically distant from the examples of \"X no Y,\" which increases the total distance for structure 1. Figure 5 illustrates the two sets of source and target structures generated by the transfer module of the TDMT system. 3.3 Sentence generation The generation module completes the translation of the transferred sentence using target language knowledge that is not provided at the transfer stage. This module performs the following two tasks in cooperation with the transfer module.","1) Grammatical sentence generation: It determines the word order and morphological inflections, and generates lexically essential words, like articles in English, so that the whole sentence is fully grammatical.","2) Natural sentence generation: It brushes up the sentence by changing, adding, or deleting word(s) so that the whole sentence is as natural as a spoken dialogue sentence.","Figure 6 shows an example of Japanese natural","sentence generation where addition of a polite","auxiliary adverb and deletion of redundant","pronouns take place."]},{"title":"~","paragraphs":["\"I will send you the form\" Transfer I \"~ ~:~:~:~:~:~: watasht-waanata-n~ youshi-wo okuru\" iiiiii!iiiiiiii I {I~,= {to you} {the form} {send}","Generation Jl clglete ~ ......... ....,.add","' ~£.,,. ,, ..... fit\" \"youshi-wo o-okuri-shi masu\" {the form} {send} + politeness","Fig. 6 An Example of Natural Sentence Generation en no heya noyoyaku\" ] ! Source Sentence: \"ichi-man i iiii~!~ i~i~!~iii!iii~!i i~ !i !ii':!:E:i! ''''~' ~' ~'\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"'\"\"\"\"~' ~\"~' ~'~\"'~'~\":':~i~i ~i!ii~ii!iEi!i~ili!i~!!i~i~ili~iiiii!!~!iiii~i~i~!~i~!iiiiii~!i~ i~ili~ i i~i~i~i ~i~il i~ i lil i~i[i!ili~i~ilili!ii~iiii!i!iii!iii',i~i ~!ii~iil ~i~ff.i~ii~iiiii~ii!~iiiili~ i\" ~':'~' \"~': ................. .̀....̀`̀.~.......~.~..~...~.~...̀...~..̀..~.~~̀~̀.~:~.È~.~..̀~.~!i':i~i~i~i~i~i~i~ii iiiiiiiiiiiiiiiiiii Source structures iiiiiii[iiiiiiiiiiiiii::~i~i~i:: i~:i::ii :::::7:::::::::::::::: Target structures iiiii:::::::::::: ::: :: : :::::: : : : :: :::: :::::::::::::::::::: ::: 1) X no Y ......................................................... 1 ) ' ....... ........................................................................................................ : XY iiiilil ,/ \" \"~ I structure pair .:iil ,-I -~, I ichi-man en X no Y (totaldistance = 0.5) :~i 10,000 yen Y for ~' ' ......................................... iii!::~ ', reservation \"~ iiiiiii \" [, ~ structure pair 'ii ~ iii ichi-manen ~ liiiii:ilil iiili 10000y:n ~"]},{"title":"-F","paragraphs":["Target a 10,000 yen room\" ] Sentence: \"reservation for Fig. 5 A Disambiguation Example for \"X no Yno Z\" 66"]},{"title":"4. IMPLEMENTATION 4.1 System specification","paragraphs":["The bidirectional TDMT system has been developed in Common Lisp and runs either on a Sun Workstation or Symbolics Lisp Machine. Ti~e dictionaries and the rules are made by extracting the entries from the ATR corporaU0l concerning conference registration (Table 1). Table 1 System Specifications","Hardware Sun Workstation, Symbolics Lisp Machine Software Common Lisp","Translation Japanese to English (J-E), English to Japanese (E-J) Domain Conference registration 4.2 System operation Figure 7 shows a screen shot of the bidirectional TDMT System on a Symbolics Lisp machine. The system simulates the communication between an applicant (Japanese speaker) and a secretary (English speaker). The dialogue history is displayed at the bottom of the screen. In the screen, Terminal A is the applicant's terminal and Terminal B is the secretary's terminal. The translated sentences are displayed in reverse video (white on black). 4.3 System performance The system has been trained with 825 Japanese sentences for J-E translation and 607 English sentences fl)r E-J translation. These sentences were selected from the ATR corpora and typical dialogues about the domain. The system can translate sentences with a vocabulary of 1500 words. In J-E translation, the system on a Lisp machine with 10MIPS performance has provided an average translation time of 1.9 seconds for sentences having an average length of 9.2 words, and a success rate of about 70% for open test sentences of this domain.","7-LDM T \"\" \"':'- .........","] >)> analysls","Clear Window All Carldldate5 OCAL-.lRllltUlORHMlI[]rl ,","Model Conversations Morphemes (~1,~[ IIITI:RJ J.t:\" ~-~')\"","Oemo Sentences Structures >> > tf-ar~sfer-","Free Input ,Show Color lransfer (~,~ ~r~f[!RJ ,~,~\" ~-# )","Quit Color Transfer","TDMT Ll~t~nor ~ EOdhL:'~f~S~'~ll~M ... ELEL) H tl.OI)O005 : (~1~,~,~ J,t:') => (I.~I~,L IHTKRJ #,t-) {'t) Bt£~i~'-~'h') ~4TOTnL DZStftriCE = O.OOUOO5","f3 ( TERMIHAL-A )>>> ( I ERMIIIRL-R >>>> 1ERMINRI.-II Yes i~ Is) >>>> :TERIIIMflL-B May I help you} >:,>> >>>> (fERMIMRL-fl Ev32.-)~'ff-I~£~ltI:~Z.SL~-C'L ,t 5h,) )>>> (IERMIIIRL-B You hu~t u~e a i'egl~t.ration £orm) >>>> (TERMI~IIL-8 Do you have one) ( l ERMItIAL-A L~ 3~#[-~t\" ) \":GUGb\" • E- ~J 6 {~,~g~g~ -C ~-)2\" [ ,mr, . :1\" ) [.m':i;~ Irl:FI t~r;t i1~1 h'~ ~,]: nt ~ VT t V[~; ['l/.'~*Fi~ q, i t ,,t m p I fran~ let\" 0.13tjtJOUO : ('/H -(-~) :> (I}O .... (J) {}*tlOfJtlllO : BI[: : (3.1~) :> ([I[IV not yet) TOTAL DlSIl}lICEi - [¢,O000k}{} [ r31~ ~ rill J'Tl\"47ITI ~i[ l\"ql ~Yes It |.~\" ~May I help yell ~ ~YmJ mist u~e a re~lstr'atlnn rerM* \"De yell have el~e N"]},{"title":"III IIII Ir , Fig. 7 Screen of the Bidirectional TDMT System","paragraphs":["67"]},{"title":"5. FUTURE WORK","paragraphs":["We have presented an overview of a bidirectional TDMT system that simulates communication between an English speaker and a Japanese speaker. The system performs efficient and robust processing by utilizing an example-based framework. Future work will include: (1) the introduction of contextual processing, which can cope with spoken dialogue utterances, (2) application of TDMT to other language pairs including Japanese and Korean, and (3) integration of the TDMT system with speech recognition and synthesis processors to achieve a fully automatic telephone interpreting system.","[18] Waibel, A. and Woszczyna, ~.: \"Recent Advances in JANUS: A Speech Translation System,\" Proc. of IWST '93","[9] Furuse, O. and Iida, H.: \"Constituent Boundary Parsing for Example-Based Machine Translation,\" Proc. of COLING-94 (1994)","[10] Ehara, T., Ogura, K. and Morimoto, T.: \"ATR Dialogue Database,\" ICSLP-90, pp.1093-1096(1990)"]},{"title":"ACKNOWLEDGEMENTS","paragraphs":["The authors would like to thank Eiichiro Sumita, Naoya Nishiyama, Hideo Kurihara, and other staff members for their help and collaboration. Special thanks are due to Kohei Habara and Yasuhiro Yamazaki for their support of this research."]},{"title":"REFERENCES","paragraphs":["[1] Furuse, O. and Iida, H.: \"Cooperation Between Transfer and Analysis in Example-Based Framework,\" Proc. ef COLING-92, pp.645-651 (1992)","[2] Furuse, 0., Sumita, E. and Iida, H.: \"Transfer Driven Machine Translation Utilizing Empirical Knowledge,\" Transactions of Information Processing Society of Japan, Vol. 35, No. 3, pp.414-425 (in Japanese) (1994)","[3] Nagao, M.: \"A Framework of a Mechanical Translation Between Japanese and English by Analogy Principle,\" in Artificial and Human Intelligence, Elithorn, A. and Banerji, R. (eds.), North-Holland, pp.173-180 (1984)","[14] Sato, S. and Nagao M.: \"Toward Memory-Based Translation,\" Proc. of COLING-90","[5] Sumita, E. and Iida, H.: \"Example-Based Transfer of Japanese Adnominal Particles into English,\" IEICE TRANS. INF. & SYST., Vol. E75-D, No. 4, pp.585-594 (1992)","[6] Kikui, G., et al.: \"A Spoken Language Translation System: ASURA,\" Proc. of IJCAI '93, Vol. 2, pp.1705 (1993)","[7] Morimoto, T., et al.: \"A Spoken Language Translation System: SL-TRANS2,\" Proc. of COLING-92, pp.1048-1051 68"]}]}