{"sections":[{"title":"TWP: How to Assist English Production on Japanese Word Processor KaZUltori MUI{AKI, Susumu AKAMINEJ, Kenji SATOH and Sinichi A NI)O","paragraphs":["IImna.n ]:,a.nt~mtge Research l,atb., Informa.tion Technoh)gy Research L~d)s., NEC Corp.","Jqlnterprcting Telecommunications Res('.a.rch l,:d)s., ATI~ Miya.zaki 4 1.-1, Miyamac-ku, Ka.wasaki 216 JAPAN e-mail: k-muraki(cOh~m.cl.nec.co.jp"]},{"title":"1 A new type translation support is available.","paragraphs":["We propo~;e the l.]drd type of translation ..rapport system in this lm.per, which ena.l)le>~ users to mI.ioy simulta.neously both la.rge m;ut-hour reductioi, pro vided ])y the conventiona,l autom~tic ln;u:hine tr~tn.q-l~tion syS~elll) ~bl,(l COliti!lltlil(*.llt with the flute,ions I)rought by tit(', dictiolia.ry refl~rence and gra.nim;rt.ical consulta.tion. Our new system possesses tit,' fbllowing fet~tures[4, 5, 6]:","1. it a.utoma.tica.lly generates the corresponding En-. glish e::qm~ssions, simultaneously with the ~x('.cu-tion of input,in:'; catch Japa.nese word~ phrase, or sentence.","2. it assist,~; word to word, or phrase to phrase trans-l~tion, which a.llow.~ use>s to con t;rol tra.n~:httion [)roc(~ss.","3. It lninimizes tit(; numl3m: of key .~;trokes ior Eilglislt tra.usla.tion with a.n Md of fully auroras.tic phrase a.l,d simple ,sentence tra.nslation ca.I~abilit.y.","4:. ]t gllil, ra,lll;lK',S tlHl, t llscrs (;~tn bo contcllt with a.lI interhtce by which they (mat monitor ~utd ca.noel (',~mh process of r(~cOgltitiOll it.lid COllVersiol, (:,f ,'very if,lint words, phrases, and SCIItCItCt~S.","5. It greatly assi'~t.~; Ja.tm.nese :ta%iv('. spe.akcrs in l)repa.ring El,glish (loc,llite,tt.",":Let :1~ c;dl it \"Transla.tion Word l>rocess()r('l?WP here;ffter), realizing a w:ry con:tbrtal)h.' working platform ('.quipped with a simult;mcous a,,tomatic J~q)a.nc'se-l~h,glish converaio:: fa.cility th:rt contributes to ~ dr;~stic reduction of key stroke and mouse clicks.","The lirst type of tr~msh~tion suplmrt system or ms. chine tr~msla.tion(a.utoma.tic tra.nsla.tion) syste:n ;tlta;- lyz(3s and generate SO.Ilt('.]~CO;; O110 ])y Olle. Evon ltOW w]lcn :IlOrO iha.1, tel, sorts of machim~ tra.nsla.tion sys- :.ema ;,.re a.wdhd>le in tim market~ ~.ll w:~ are forced to do while waiting for tit(: teas,slat,on to b(: outl);:tted i:: to pray theft |;it('. result may not be like tit(: piece:; of wreckage, i]. I)3ven if it is lIOt wrecked, we ne~,d t.o recognize damage ~n,d spe:id extr~ (;()st Iixing it.","rJ~he second type is the bi/il~gUal dlction~try co:mul ta.tion l,tcility. This typ('~ of assistance sy>;tems are already ill use on various kiz:ds of word processors[10,, but does not ~tchieve si~tisfactory et:iciency in tr~msh> lion job. l:t demands users to set np the dictiom~ry con-. sultation function, to choose suittd)h', expression out of the dlspl~tyc'd words, phrases, ;tlt(t s:mll)le sentences, a.nd to a.rrange them by key a.nd mouse opera,lions to produce ],htglish SClltcnct!8. Evelt it' dictio,mry refbr-- ence is quickly ~tll(l chea.ply assisted, most p~rt of English compositio:t work is left in user's hands.","The. third type ~'I'WP, is designed to visualize the ~mtoms,it ga.panese-English conversion(J/E conversion herea.ftcr) process in lmrMhJ to inputting Japanese text, a.nd to consequencely ~mhieve the best cost-efficient pe.rforln~mce, in ;t fl'aln(} work of IBa.ll t~itd COlIlpurer interaction. In the TWP, w~rious supporting functions are provided ;,,cording to nser's English writ ins c~q)M)ility:","1.. J/g c~onversion of word~, phrases ~md simple sen-. [CIICOS~","2. lli~tt.ern based J/E conw;rsion of conq)h..x sen- ~(?llC(?S 1 3. ;/;q~anese-E:,glish tra.nsh~tinn DB retrieved,","4. learning flmction of word sum phrase conversion knowledg,,, ~nd comph.x l)~ttLerl, COl,Version knowledge, which helps user to COilll)OSe F, nglish greatly,","5. ~mtoma.tic ambiguity resolution in conversion il.ild retricwd designed to reduce the number of nperi~. tions necessa,y for utilizing those assistance tiuiclions. 1,br the purpose to achieve user's COllt(;!.ltlIleltt ill TWP opc'r a.tlon,","6. tlexible \"clmc('l~ \"llndo a.nd \"option selc't'Zion in-terfitcc are enll)ioycd. 'l'he a.ccur~n:y of ~tmbiguity resolution,","7. rises u I) greatly by continuM use of the lean'sing function 4.","A Japanese struc.turaJ editor with tim.thins[7] stated a.bow~, ca.n recognize ~ logical unit of ~ word, a phrase ~md a sentence, in sequences of Japanese symbols. The Japa.nese-F, nglish conw~rsion c~n, start iu,to,m~tic~dly at ew..ry moment ;t ~Ia.pa.nese wol'd: ~t phr~e or :~ Sil,l-. ple smm'nce (ca.lied logk:al ,,nits) is recognized. When more than two siml)lc sentences(cla, uses) ,,re extracted, 847 they are transferred to complex sentence conversion based on user detlnable complex sentence J/E translation patterns.","TWP can make user reach a target English by their monitoring and controlling Japanese-English conversion process~ so that they can feel content with each step of every interactive assistances or automatic processes. It can also save key strokes for arranging word order as it generates English expressions in a correct word order by conversion capability of a phras% a sin> pie sentence and a complex sentence, besides word level dictionary consultation facility. TWP also has proposed a protocol to eliminate redundant user key strokes for selecting menu or commanding process by default reasoning to guess user's next stroke. This means that no other key strokes are sometimes necessary than those for inputting Japanese sentences, as transh~tion is over at the same time of that a period of a Japanese sentence is keyed-in on a screen.","Whenever any error of conversion is found while inputting Japanese, any step during the conversion can be cancelled and corrected by adopting the second alternative automatically based on key stroke history learning mechanism. A cheap cancel and undo protocol is the key issue to make the best use of each default reasoning of TWP system, because strokes to select correct one after cancels and undos are the sources for tuning up default reasoning by learning mechanism."]},{"title":"2 What is considered of for comfortable usability?","paragraphs":["TWP brings about both users' contentment with functions that machine translation has failed to realize, and large cost reduction ibr sentence generation in target language that simple dictionary consultation facility has not fulfilled. No other system has ever been presented to satisfy two of them at the same time. Machine translation system takes no hmnan cost if complete translation is acquired. If any errors occur, however, manual re-translation or post-editing charges vast amount of expense. Post-editors have reported so many time high stress by repetitious or utterly unexpected errors machine translation caused. Moreover, even when they use Japanese-English automatic translation system~ they are required to comprehend both languages in reality. Experience of using dictionary consultation facilities and grammar checkers tells us that such assistance as bilingual dictionary reference, sample sentence reference and grammatical check does not contribute so much to efficiency of translation and that the key operation cost taken to call those functions, e.g. key strokes, is essentially no less than that in case of consulting paper dictionaries.","TWP peribrms automatic recognition of a word, a phrase, and a simple sentence, and immediately after that, successive conversion based on bilingual word dictionary ~ and simple phrase and simple sentence translation functim, is executed. These recognition, and conversion processes are supervised by the user in the course of inputting Japanese text. TWP users reserve the means of cancelling and resolving the errors that the recognition or conversion created. TWP makes users feel content with processes on a screen by confirming every step of translation with their eyes. TWP supports so much easy use of dictionary consultation facility in such a manner that either English and Japanese word on a cursor position is interpreted as a key word for looking up word and bilingual dictionaries, and is transferred any time automatically to consultation facility to retrieve and display the dictionary data on a pull-down window. Users need not to take a special dictionary look up procedure. It assists longer sentence gener,~tion in English word order by J/E conversion using complex sentence translation patterns defined by users[5], as well as using a phrase and a simple sentence translation facility. In the following chapter~ we explain the overview of TWP; English producing support system at first then talk about Japanese-to-English interactive conversion framework for comfortable English composition in particular."]},{"title":"3 Which Resources support English Composition ?","paragraphs":["TWP for English composition support is constructed fl'om well understood and transparent resources and mechanisms under an extended, what is called, Kana-Kanji convcrsion user interface. The noble feature of tile (PWP iutroduced hereafter~ is of great transparency in every 1)rocess of support mechanism. ~l'he traceability of process and the controllability of the TWP based on default reasoning mechanism in recognition and conversion of logical units in Japanese input, and cheap cancellability of wrong steps selected by TWP or a user are a noble part of invention which supports a great cost reduction of English production on Japanese word processors with full of contentment. The characteristics of TWP is summarized as follows.","1. Japanese to English conversion interface simulat-ing Kana-Kanji Conversion helps an user to learn so easily[i, 3, 41.","2. User controllable complex sentence translation pattern based cortversion achieves translation transparency even in long sentence J/E conversion[5, 8, 9].","3. Automatic le~rning feature based on user key stroke history covers learnings for translation disambiguations of words, verb phrases, complex sentential conversion patterns, etc[6].","4. It is fully equipped with consultation facilities of translation ex~rnples, word dictionaries, bilingual 848 dictionaries and so on.","The figure ]. depiets the configuration of q'WP 1)reretype on a. structural editor:' , with the PIVOT translation system as s. ha.ok end conversion processor. J/[i ( ?(rove,slim \" cogll!zct __ t_ ......... ~ l \"' wo,~,u~,+, :: .",".J M(;,i,h++tt;g+cal 5;ttuctme | l'm~:gsso.~ __ ~..(I,,o, (td,,a~) ] [U,+~i+gsT;ri;i.~,,isiii7 .......... l '}~C;'-:t; a ,t::t ton English Prodtlctiou ~quplmtt Japanese Wold Processo~ J/l{ It anslat/)r \"1'1 V[J'r nlicm\" I"]},{"title":"5_ ]__","paragraphs":["\"[ F, an slafion !~.x ,u/!!?!cs j 10igure 1. The conligur~t.ion of TWP","The cot,version of 2Ial)anese i~,to English exi)res-sion starts here with determination of scope to convert into English. The sequences of key strokes are transft.'fred 1;o morl)hoh)gical processing fttnction tbr detecting logical units like words, phrases, cla.uses, etc. Any ,I/E conversion of each unit is carted out easily with MT subset of I?]IV()T ;I/l'; transla.tion system ;ts ;~ l)~ck end translat.or.","The .~;trnct;ure editor ([de;d?) on a robust .]al)a:tese morphological processing function detects .'lap~umse logical unit,; a,nd keeps every strokes a.nd every pro cesses, during editing , conversion (trlmslation), dictionary look up etc., in order ti)r user to back to any 1)oint from lmexpected result in English production by cancelling ctmh preceding st,rokes +rod processes.","The c;u,celling l)rotocol between man and computer plays a. gre~vt role of providing users with the most eomfort.abk; operationtd)ility, which is backed up by the high traltSl>a.rency of system process.","The transl>arency introduced here is (:mnl)osed of two aspects; 1) hiding primitive mechanical steps from a. screel, a.l,d showing ev(.u'y and only logical unit level stei)s of edit and conversion on a, screen, 2) letting e.ven phrase, clsa:se .I/1'; conversion to look like Kan;t-Kanji conversioi, to casuM users. 'l'h(~ similarity of user interface 1)rotocol ()i' the one we. propose here and the widely a.cknowh'dged Kana.-Kan.ii c(mversion interf~ce lets users to believe in con i;rolbd)ility of .//E (:onversit):,. The controllal)ility of J/F, conversion on iJ al)anese word proces.~;ors is easily o])tabm/)le through the. experienc.es of Ka.na,-K~utji conversi(tn built i:t Japan:'se word processors,","+Tlw. structure editor called \"Idea.I)\"[7] c~u~ muintain.~ tim logical units like words, phrases, clausc~s ~utd pemfits users to (:dit Lhos(! ,llt{i,s so ea,sy whilu ~.'dl.al J al)altose word processors ca.itt~ot h;Itldlo those looical units oil:el' t]lt:ti (:hat'~t(:tt!rs. 4 TWP operation and process","4.1 What meets casual user's requlrc-Incnt? There is ;L big ditl'(~rence between J/E conversion and Kam>Kanji conversion. The former requires structural trar, sform;~tion like word order transformation, structural reduction or exi)anslon , and so on, while the lat-ter only him(lies a Ka.na sequm,ce to produce it kanji sequence without any modification of the word order in a sentence. The fully automatic machine transh~- tion system c~m 1)reduce English transl;~tions of input ,lapanese sentences, by milking word to word translation, 1)hrase to phrase structured translation, el,rose to clause structurM tr+msh~tion, etc. at once within a second. User ha.s no chance to see what hal)pens in a travslatiov system, so she gets lost at a glance of the meaningless seque.nces of word fragInents and gets embarrassesl in front of pairs of sound"]},{"title":"a~panese","paragraphs":["sentence ~uM miser+title Fnglish output in case of failure in 1tier - ticulax. She, fbr ex~mq)le, a student in a. colh,.ge, even if she would like to h~ve a sort of help R)r English conlposition, never try to use ~t Mg.' ~s ~ tool ag~dn, after she incident~dly ha~ had .~n experience to sit beside those kinds of unconceivable screen outputs. A person like her usually has :~ fltndament~d grammatlc~d and lexlc,tl kuowledge, tbr rc+~ding a te×tbook of English compost-- :ion. She needs to be able tit imp@he how computer works and what it i)roduces, before she starts to learn the operations.","TWP does have. a very limited ~md robust c~q)~bility of auto:ha.tic transl~ttio:, witl, a variety of ~mcessories inch:din E a. relialfle text book function, an useflfl dictionary function, an easily a ccessibh; wording examples (l~tt~d)ase, etc. as well. It ha.s been designed for a help for Japanese. who has basic skill of writing English.","Some of those persons(Group A) who compose English need +t very slight help like English dictionary h)okup facility, some others(Group B) need a help like vi~rious consulting supports of bilingual dictionary, word sense detinitions, transl~tion examples, English g:':Unlnar text books etc., the others(Group C) need a, pe.rfect hell). 'I?WP helps Group A and (_4roup B mainly who work on aal);mese word processor and F,nglish word processor for English production. They need very cheap, timely, comfort;~ble support, and do not want perfect, exl)ensive supl)ort necessarily. A. comfortable support in English composition on word processors includes the folh)wings at least. 1.. limlted but sound translation fimility if awdh~ble,","2. ~ w~riety of word, 1)ilingual, idiom , and wording dictionary look-up fimiliGe~,","3. a w~riety of transl+ttion example consult~tion SUl>- ports, rPhere are :ilany re.sources like the above available [n the market iu,d ~q)l)ears the folh)wing keen in-. Ix;rests of users wheimver they use them. 849","4. No irritation waiting for response: very quick response to every key or mouse strokes,","5. No eyesorefull da~a on a screen, because capacity of human eyes is very much limited,","6. Necessary information should be on a screen be-fbre user mentions it,","Y. Ea.sy recovery to the preceding screen from any unexpected result on a screen with no anxiety,","8. System controllability based on system transparency.","The point 1. of simple and fast translation capability atfords to the point 4. and the point 8. transparency. The points 2. and 3. very simple and fast executable retrieving function support the point 4. the point 7. and very much the point 8. The points 4. through 8. are explicated here from now on.","Whenever TWP finds Japanese word en(l, phrase end or clause end, the translation equiwdent is displayed on a screen line for inputting Japanese. J/E conversion needs scope determination of phrases and clauses. The TWP iterates scope determination and conversion very explicitly on a screen for realising traceability and transparency of translation. Two issues are left necessary to explain fllrther. 1. How to determine a scope of conw',rsion ? 2. tIow to lind an appropriate type. of conversion ?","The tlgure 2 of intuitive image of J/E conversion depicts the two issues more clearly."]},{"title":"4.2 How to align a sequence of conversion step ?","paragraphs":["The scope determination tbr conversion is one of key issues to specify eemfortable user interfa.ce. The con~ version should be carried out successfully at any case. ()therwise, users cannot rely on the conversion support and have anxiety of operation. The sequence of conversion steps shouhl also be Lraceable within a limited human's eye capacity, that is to say, which conversion scope selected by TWP should be able to guess, and what sequence of conversions also should be foresee-M)le. User can catch up with every proce.ss very easily if user conhl expect ew'xy kind of change on a screen. TWP's idea to resolve user's anxiety (:ome.s from the above observation, to afford to the items 4. and 8. above greatly.","There are two reasonable scope interpretations for J/E conversion on the screen1 where a cursor stays just after a Japanese string"]},{"title":"~}~tNJ(~","paragraphs":["which is con> posed of two Japanese phrases (bunsetsuis),[*J,:I , }g: Subject-marker,\"I is the head of this u.oun phrase \"bunsetsu],[~3~: paper, ~:Object-marker,'paper is the head of this noun phrase\" bunsetsu]. One. of the Screenl *L }~ ~5~ ~\" Word watashi/wa /ronbun/wo cormnent I /SM/paper /OM ,~ ;Conversion the scope of \"ronbun\" Screen2 ;~:/dJ: essay ~\" ;translation {essay, paper, ... } Word watashi/wa /ronbun/wo comment I /SM/paper /OM"]},{"title":"$","paragraphs":[";interactive pull-down menu selection of an alternative \"paper\" Screen3 a:X~2 paper ~ r.~: < o Word watashi/wa /ronbun/wo /kaku comment I /SM/paper /OM/write",";conversion of the scope of","[~],t~ paper ~ J","Screen4 I write a paper. ;English word order has been produced by simple sentence(clause) conversion SM: subject-marker OM: object-marker Figure"]},{"title":"2.","paragraphs":["Stepwise Japanese-English conversion alternative scopes is \"~L t±~ ¢3 C(cursor)\", and the other is \"~ gc C\".","TWP adopts such a simple strategy as a scope tbr conversion is the biggest logical unit of words, phrases, and clauses just adjacent to C(cursor) on the left part of input line. This strategy comes from Japanese in-trinsic linguistic structure called head final.","Whenever an input is don% it is transihrred to morphological processing to find logical units like word, phrase, and clause. A logical unit is handed to J/E conversion function to produce English equivalent. Japanese logical unit has a head word in the right most part of it usually so that every end of Japanese unit is guessed much easier than that of Fnglish. Fortunately popular and robust algorithm of detectivg end of unit is widely known and it looks Mmad one word or one phrase to decide whether string on the left of cursor is on the end or not. In practice, TWP may recognize the end of unit more easily by hearing unit end signMs fi'om Kana-kanji conversion stroke as well. TWP can gness scope of logical unit with high preci-sion accordingly. The screen1 and screen2 in the figure 3 shows a selected conversion scope is the left smallest phrase(bunsetsu) which is usually signMed by kanahnji conversion key stroke."]},{"title":"4.3 Simulated Mode of Automatic J/E Conversion","paragraphs":["The \"look ahead\" algorithm detecting conversion scope by finding logical unit described above is also usable in another way. An already guessed logical unit 850 ~djacent t{) a string on ~ cursor is llnally recognized as i~ logical unit a.ul;oma%icaily if the string {)it tile cursot couhl be guessed as a logical unit,. This is calhBd a \"delayed\" type of look Mw.ad algorithm to finding lugical l)ttnsc|;sll units ,which frees users from inputting logical unit end siEna.Is when input is disl}layed frmn left t{} right {}it a, screen line. This algorithm pernfits a,n ~ml;oma.tic detection of ]ogicM units tbr {:onversion. The figure three depicts ('lcarly an ilnl)lementation of im~{}mtttic i{;erative J/E conversi{m of T\\'VP.","The ,/a,1)a, nese input fa,cility is built; in TVVI } aut{}lnatically fixes the i}receding bunsetsu( snla.llest phrase) ills1; M; the Sa.llte tilne as ~t string"]},{"title":"adjacent","paragraphs":["to C(cursor) may ])e guessed a, }}unsel;su. '.Fhe Screen1 bunsetsu ca.ndidate \"~1 \" with i~ cursor just. [tfter ~t lmnsetsu end m;n'ker c:mdidate }2 is lie{; trlmsferre.d to ,J/E {:{}nversiou [tore. The \"~)~ \" ]mnsctsu ca.ndidate is determined as a. I)unsetsu t2},' conversi{)n unit and iS transferred to ,I/l{; C{}llVerSit)n ;Lt the sa,nle time as a. l)unsetsu {:~u~di{la.tc \"~,,imX\"~'~ \" is guessed on tit{; screen2 on its right. The second bunsetsu candidate \"i)~e~ \" is fixed and transferred to"]},{"title":"3/E","paragraphs":["conv{:rsion when tire next; verba.l bunsetsu candidated \",!,w/z \" is guesses on t.he screen3. The Jal}a.nese, period \"o \" signals an end of verl)a.1 bunsetsu \"~l}:W/~ \" ;utd triggers .]/t!3 conversi(m of i{, on screen 4. IIere are three lmnsetsus(smaIlest phrases). 'PWP reeognlzes ea.sily a sentence, a.ll {}f 1)hrase lmad words of which lmve been converted into English, a.nd transihrs three, l)hrases to .]/]\", conversiolt altogether to l)roduce tit{: English expression on screen5. The product is well ordered a.nd well translated with the hel 1} {)f siml)le translation function.","A Jal)a.nese and Alphal}et mixed disl)h~y fornta.t of intermediate conw~,rsion is a. convent.io~l for user's trac-ing internie(li~te stei)s el'"]},{"title":"J/:E","paragraphs":["conversi{)n easily on a screen. Japanese. symbols in a mixed (lisl)lay con-vention express ,J:ll)a.:w.sc functional words like surfiu:e case-m~rker, conjunct 1)artlch>, a.n{l a.uxili{try vert)s. They are l:ey inf{}rn:ation t(} determine granmtati{;id nmaning of hea.d word in a, soutence, ~t,l(l 1;o exectll;e strllc[;lll'al ,J/]~ (:OllVel'SiOll} which should be transtL, rred t{} tr~nsl~tti(m COllll)OZl{;llt. Th~tt is to say, functional words exl)ressed 1}y .la4}a.nese symbols help Jal}itnese tlsers to ],:ee l) gl'alnnl~Lticill s{A']t(;l;Ul'e of SOllrce J&lntnese senl'[.ence through E,glish Contl)ositi(m on TWP. '['hose like case lrmrkcrs {leterllline English silrll)le serttence structure with ease structure m;q)t}ing scheme in a J/F, bilingual dictionary corresponding to a head wn'b ot' a. {;lltllSe."]},{"title":"4.4 Screenplay examples of TWP","paragraphs":["The figure 4(at through tit,; figure 4(c) demonstrate q?WP's J/E translation Sul}p{}rt l)]'imit;ives. Tlte first exl}licates tra(:ea, blil;y a.nd tra.nsi}a.r,'.ncy of TWP ,//E conversi{}n. 'Phe second eXa.lnl}lifies an easy a.nd ehea 1} (;illt{;(!l l)rot;oc{}l (,o achiev{~ Ilgt~l'}S C{}llt(~nLnlenl,. The last; shoves a, lt exalnl)les {}f dictionary e{}nsuttati{m pro Screen1 ~};~ C Word ka~re/wa /C Cmnmen~ IIe /SM/C","Screen2 he }1~ C ; ~/~i~ {ronbun} has plural translations {pai)er, t)aper, ...}"]},{"title":"Word He /wi~ /rent, us/we /C","paragraphs":["Comment IIe /SM/paper /OM/C $ ~mtoma%ic conversion Screen3 he }t ess~y e~'~:U~Yz C"]},{"title":"Word ~e /w,~ /p<,er /wo /kait,~/C Comme.~ ~Ie /SM/paper /OM/wrae/C","paragraphs":["Screen4 he 1I essay ~ write/2:o C Screen5 lie wrote ;t pa.l}er.C ~J~: k,2re:he ~X :wa:subject-ma.rker i~_~: ronbu n: l}al)er/essay/~r ticle... ~ :wo:ot)ject-ma,r ker ,q:u~ ?~ :kaita:wrotc, SM:subject-marker OM:object-m~rker C:cursor Figure 3. TWP J/E aug{trestle conversion sgep cedure on TVCP.","The figure 4(a) traces steps of real responses to Jlq)anese input \"~ a) -;,~ ¢ z, ~:: .k o -C / ~*~ / {/I~ ~7O ~ ~ ~fi / %* 8 9- /o \", where \"/\" nlarks ])llnsetsu ends. This figure is composed of the five, top lines of 5 screen copies from 1) down to 5). Tile fo:'th lille h~s three convm'ted l)}lnsetstt8 \"tllis sysl;enl/~ \"l)tq}er', and \"mMwY and one not converted bunsetsu \"-2 3 -~-.\" The l}unsetsu \"{el'hj~\" 7o ~- ~ ~e ,, is converted into the mixed tbrma% of \"m~tke \"Y 7o ~_ k ~\" when and after inlmtting the tbrth bunsetsu is completed. r~","lh~ figure 4(b) shows a cancel amd undo protocol of TWP by listing five top liues of consecutive tire screens from 1) to ,5). TWP backspace key brings ~ status 1) to a status 2). After moving a cursor to \"i~3~ \" in st~ttus"]},{"title":"3),","paragraphs":["an user (;iut edit to have \"~2~ \" instead of \"N3~ \" in ,% s~atus 4).She can get an J/E conw, r ted expression of a sentence with \"~2Z \":English in i~ I}ositlon of \"iN3~ \":essay only moving a cursor to a Selttence end 1)ositi{tn.","#1 (","I.h> figure 4(c.) is COml}osed of two scre(:ns. The screen 2) with three sma.ll windows open depicts what is displayed when dictionary consultation fi~eilifies ttre invoked. Under a mode of dictionary consultation, hi(tying i~ Cllrsor t{} }tny w(}rd either ,]~t}ttllese mr Ell-glish triggers dictionary h}ok u I} with the word its a B57 key. The pull-down window wl is opened to hold conversion dictionary contents of \"essay under ~ cursor. The window w2 is opened with \"essay\" as a key in the pull-down window wl for further information of the word \"essay\". The window w3 has been opened with \"paper as a. key in wJ.. Lexical inf()rmation on w2 and w3 comes from conventional 1oilingual dictionaries. Any word in w2 or w3 ca.n be selected for a key of dictionary look-up."]},{"title":"5 Conclusion","paragraphs":["TWP brings about both users ~ contentment with tim(:- tions that machine translation has failed to realize, and large cost reduction for sentence generation in target la.ngu~ge that simple dictionary consultation facility has not fulfilled. No other system has ever been presented to satisfy two of them at the same time.","TWP users reserve the means of cancelling and resolving the errors that the ~rWP or users created. TWP makes users feel content with processes on a screen by confirming every step of translation with their eyes. These hell) them to use it so easy with no anxiety."]},{"title":"References","paragraphs":["[1] Akamine, et.al.,'English Composition Support qboP', l?roc, of 43rd conference of IPSJ, pp.205-206> 1991","[2] Aizt~wa, et.M.,\"Foreign I,anguage Word Processor using Bi-directional Transh~tion System\",Proc. of 44th conference of IPSJ, pp. t47 148, 1991.","[3] Akamine, et.M.,\"interface Protocol tbr interactive F,nglish Production on Japanese Word Processor\", Prec. of' 44th conference of ]PSJ, pp.261-262, 1992.","[4] Akamine, et.al.,\" I?olun Kana-l.(anji Conversion to Kana-English Conversion\", Proc. of 46th conference of IPSJ, pp.119-120, 1993.","[5] Satoh, et.M.,\"User ControllM)le 'l'ranslation based on Complex Sentence Translation Pattern\"~Proc. of 46th conference of IPSJ, pp.121-122, 1993.","[6] An(lo~ et.al.,\"Translation with Lexical Learning Capabillty \",Prec. of 46th conference of IPSJ, pp.123-1.24, 199:t.","[7] Nomura~ et.al.,\"Japanese Word Processor with Word, Phrase and Sentence Handling Capability\",NI,P-S[G report of IPSJ, 1991.","[8] Kamei, et.M.,\"Lexical Discourse Grammar '~, NLC-SIG report of Society of Electronics, InIbrmation and Communication of Japan, 1986.","[9] l)oi, et.al.,\"Lexical Discourse Grammar applied to Inter-clausal Parsing (11)\"~ NLC-SIG report of Society of Electronics, Infbrmation and Conmrunication of Japan, 1991. Tsutsumi, et.al.,\"Editor for MT with Simple Lean-. ing Mechanlsm\",Proc. of 3ard conference of"]},{"title":"IPSJ,","paragraphs":["pp.1771-]772, 1986. [10] this"]},{"title":"syste~{;oko-'('N3~-","paragraphs":["n~, x ......................................"]},{"title":"~N[5~N * * [ZNNN3N]fENN[ET~[NE~","paragraphs":["kids systel~ ~2_~ \"9 ~paper ~g)i;~J~,g ~_ ~ 7~ @ N-~7~- ............................................ this syste~,Z~k-~Z'paper.~r~ake-~7#Z. ~ 75\":\"(\"~ ,~.'-'~o F @ ~w.~xt It is possible to make a paper by ghls syste~.l-Figure 4(@ Traceablity a, nd Transparency of TWP o-rl~fl ~-~ :5: ~: ~'J'>(' ,~ ~t'~° !1 possible Lo ~ake an essay by this syste~/.r (7) ir>~_J • • ~~~~ ~t ~3~ • • [~k~-~l~~l~L~a r,~s'~ l .utll I' '111' IIII ' I ' I II '111 I I' I I I .s possible l.o nlake English by this sysl.ei.~ ,, re 4(b). Easy and Cheap Uancel Protocol"]},{"title":"(-4)","paragraphs":["D_a'4['~[lil • • I,giitl[t~ tli]l!a ~ID ll~ll~),?,~r<l [i.]7 i,os~;]i~l,,-i,; iab, a i>at,o,' Ig) ii,iT~ s~'sl011.1"]},{"title":"II","paragraphs":[",~ ,~-, ~n i Ill i ii II I I I ii1 It is i,~lssil~le to lake a t,ssay b~' tills s~siell.-"]},{"title":"il O","paragraphs":["#114 @ 71i,lllll> ~tti~ ) ~<1 a i,,j,,,,,,, ~;t, mi(~4~ t ,, ...... Figure 4(c). Dictiom~ry Consultation Procedure 852"]}]}