{"sections":[{"title":"Anticipating the Reader's Problems and the Automatic Generation of Paraphrases Nils Lenke Gerhard-Mercator-Universitact-Gtt Duisburg FB3 - Computerlinguistik Lotharstr. 65, D-47048 Duisburg voice: +49 (0)203-379-2007; c-mail: he2331e@unidui.uni-duisburg.de 0. ABSTRACT","paragraphs":["The notion of paraphrase is discussed ,'rod compared with the similar notion of periphrase, qhe role of paraphrases in oral communication is described, and the results of a study on the role of paraphrases in texls are given. Finally, a system which models the use of p~aplu-ases in texts is described. 1. PARAPtlRASES IN I)IALOGUES If you look at ordinary dialogues you will find that communication failures - i.e. different types of misunderstandings - happen frequently, cf [Ringle & Bruce 1982]. One important techaique for the participants of the communication to solve these problems is"]},{"title":"paraphrasing,","paragraphs":["that is, saying it again in other words. Parapla-ases can be offered by the hearer (\"Is it this what you want to say: ...\") or requested from the speaker by five hearer (\"Iluh? 1 don't understand.\"). These kind of paraphrases may be called"]},{"title":"cotmnunicative","paragraphs":["or"]},{"title":"pragmatic","paragraphs":["paraphr,~tses. 2. OTHER NOTIONS OF \"PARAPIIRASE\" Notions of \"paraphrase\" exist which differ fiom the one presented above. In linguistics, especially Trimslbnnationat Grammar, cf. e.g. (Smaby 1971), (Nolml 1970), the paraphrase relation is induced by the rules of the limguage system. Two formulations count as paraphrases of each other if they can be derived from a common deep structure, e.g. the active and the passive version of a sentence. So, the paraphrase relation is completely independent of the situation and communication participants. This view has been heavily criticiscd, cf. (Ungeheuer 1969).","In CI,, the generation of a surface form from a meaning representation is sometimes called paraphrase generation, especially if different surface forms can Ix: generated for the same meaning representation. An ,'unbiguity exists here, because the paraphrase relation can be meant to hold (a) between the mcaning representation and the NL text derived from it or (b) between two alternative formulations which could both be derived from the meaning representation.","1 will shnply call case a) \"generation\" because that is what it means: deriving a text from an underlying meaning representalion. Case b), exemplified by (Gokhn~m 1975) and most wolk in the area of Meaning-Text Models, cf. e.g. (lordanskaja, Kittredge & Polgut3re 1991), (Mercuk 1981), stresses the possibility of an alternative formulation which could be uttered"]},{"title":"instead","paragraphs":["of another formulation, whereas in seclion 1 we talked of paraphrasing as uttering a formulation"]},{"title":"in a&lition","paragraphs":["to imother formulation. To differentiate between these cases I will not call case b)"]},{"title":"tutraphrase","paragraphs":["but - in accord:race with classical rhetoric -"]},{"title":"periphrase. 3. RELATED WORK IN CL","paragraphs":["Quite a lot of work exists on the use of paraphrases in connection with Nl.-database frontentks, cf. e.g. (McKeown 1979), (Meteer & Shaked 1988). \"ll~e formal representation g~fined from the user's query is translated back to NI, ag~dn and the user is requested to indicate if the system understood him correctly. This fits nicely into the framework from section 1.","As indicated atxwe, much of the work presenlcd under the title \"p,-uaphmse generation\" should better be called \"periphrase generation\". Reiter's (1990) system IN generates - depending on the user model entry for the problematic word \"shark\"- one of the following alternative fonnulations: I a) 'll~crc is a shark in the water lb) There is a dangerous fish in the water Similarly, the system WISBER (Iloracek 1990) generatcs one of the following formulations, where the problematic word is \"Notgroschctf' (nfiuy day fund):","2a) 1 [aben Sic cinch Notgroschen? [Do you have a rainy &ly lhnd't]","2b) 1 laben Sic ein Sparbuch mit zwci Ncttomonatseinkommcn? [l)o you have a savings account with two montlfs net income?] In the terminology advocated here, the b)-c,-tses ,are"]},{"title":"periphrases","paragraphs":["of the a)-cases. Real tormulations with p~u'a-phrases would look so,nethiug like this:","lc) There is a shark,that is, a dangerous fish, in the water","2c) l tabcn Sic einen Nolgroschcn, d.h. ein Sparbuch nfit zwei Ncltomonatseinkommcn? [1)o you have a rainy day fund, that is, a a savings account with two mouth's net income? It will be discussed below under which circumstances such uttcnmccs could be superior to the ~0- or b)-cases. 4. ANTICIPATION OF MISUNDER-","STANDINGS AND TIIEIR AVOII)ANCE Turning now to the geaeratiou of written texts it seems to bca bit paradox to do this in connection with paraphrases, since in scction 1 we showed them to be a phcnomcmm of"]},{"title":"dialogue,","paragraphs":["i.e. oral communication. But parapla-ases do play a role in texts as well, especi,'dly when"]},{"title":"anticipation","paragraphs":["is considered. This elm ,'already be noted in the cage of si×)kcn l~mguage. A well known model of the preduction of spoken language is the one of I,evelt (1989). One of its mzfiu aspects is the existence of control and revision loops which can be used to monitor the planned or re,'dizcd utterm~ce and detect errors in it. So, part of the errors c,'m 319 already be anticipated in advance by the speaker before the hearer even gets to hear the problematic utterm~ce.","When we now turn to written language again, we also find the concept of problem anticipation and revision loops. These are of even greater importance here because the reader normally has no chance of signalling his problems with a text to the author. So, the author has to take the role of the reader and anticipate problems he might have with the text. Most models of the writing process thus include a revision loop, cf. the well-known model of Hayes and Flower (1980). In CL, this mechanism is known under the name anticipation-feedback loop, cf. (Jameson & Wahlster 1982), and in the form of revision-based generation systems, cf. (Gabriel 1988), (Vaughan & McDonald 1986).","What are the options for an author if he detects trouble sources in his planned text? lte may choose to a) add a meta-comment; the addition of meta-conunents (Sigurd 87) like \"loosely speaking\", \"to say it frankly\", \"a kind of\", etc. is often used to indicate to the reader how to interpret a problematic utterance. b) add a futaher, alternative formulation (a paraphrase) or c) replan the text (formulate a periphrase). The rest of the paper will solely deal with b) mid c). What was said so far leads to the following hypothesis: Writers of texts anticipate reader problems, anti, in some cases, include paraphrases to avoid these troubles. 5. A STUDY ON PARAPIIRASES IN TEXTS A study, cf. (Lenke, in preparation) for details, was conducted in order to find occurrences of paraphrases in texts and analyse them with the aim of checking the hypothesis mentioned at the end of section 4.","First, a small corpus of German texts was scanned manually for paraphrases; the major results were: • Paraphrases of the kind described above can indeed be found. Typical examples of such paraphrases are1:","(3) \"... introduces the notion of multiple inheritance - that is, the ability of a class to have more than 0he direct base class - and presents ...\" [p. 182]","(4) \"A language is said to support a style of progr,'unming if it provides facilities that make it convenient (reasonably easy. safe. and efficient) to use that style.\" [p. 14] • only part (roughly 50%) of the paraphrases ,'u'e announced by indicators like \"that is\", \"in other words\", parentheses or hyphenation. The other paraphrases are simply added as an apposition to the pm'aphrased term. • the total number of paraphrases differs vastly between text types: in narrative texts few and mostly unannounced paraphrases occur; in more technical texts, 1 the following English examples all stem from [Stroustmp 1991] and were collected just to be English examples suitable for the presentation in this paper. especially manuals and introductory texts, many paraphrases. In the second phase of the study, the IJMAS corpus of German (1 million running words from 500 texts of different types) was then scanned automatically for the most conunon German paraphrase indicators (a.o. \"d.h.\", \"das heiBt\", in anderen Worten\", \"also\") Well above 1000 occurrences of paraphrases were found and analysed. \"[he results of the first phase could be confirmed. Other results wel~: • the syntactic form of the paraphrases is in most cases either a complete sentence (in which another complete sentence is paraphrased) or an apposition, which belongs to the same syntactic category ,as the word/phrase it belongs to. • Paraphrases are directed to quite different problem sources which were anticipated by the author. Among the different types found were the following: 1. problematic lexical items a) unknown words (cf. examples 3 above) b) ambiguous words; c) words of abstract nature which obtain their concrete meaning through the context in which they occur. The paraphr,'tses indicate the direction in which this concrete meaning should be sem'ched. Cf. example 4 above. 2. reference problems a) ,ambiguous anaphoric references, e.g. pronouns; b) anaphoric expressions where the referent is very distant","(causing memory problems) c) missing knowlcdge to understand referring expression. 3. problems induced by rhetoric figures (metaphors, metonymy). 4. inference problems a) problems of ,'k,;pcctualization. (only some aspects of the meaning of a word are relevant in a certain contex0. b) preblems of logical inferences. (Obvious and relevant inferences from an utterance might be too difficult to dnaw by tile intended reader). Thus, one can conclude that paraphrases ,are indeed used by authors to avoid auticipated reader problems. These problems can be of all those types that have since long been noticed in file ,area of NL understanding. 6. IMI'LEMENTED MODEL The next step in the project was to design and implement a model which describes this use of paraphrases in texts. It should answer tile following questions: • I low can problems of the reader be anticipated? • Under which circumstances are paraphr,xses file adequate answer to this problems (and not, say, periphrases or meta.-co~mnents)? • I low can p,araphrases be genenlted? Three well known approaches to NL generation are combined in the model : user modelling, anticipation-feedback 320 loops ,'rod revision-b,'t~d text generation, its architecture is shown in Fig h Fig 1: tile system's architecture qlae main feature is the revision/mlticipalion-feedback loop, which is highlighted in tile figure.","The types of problems for which paral)hntses c,'m be generated by file system are restricted to problems which occur during lexicalization and involve only conceptual knowledge (no assertiomtl knowledge) in order to restrict complexity. These are (in terms of seclion 5) tile types la, lb, 3a, and - with restriclions - 4a, which are (together with type lc) by flu\" the most flequent types occurring in natural texts. \"llae other types could princip.'dly be dealt with in a similar lhshion. A corpus of about 25 cxmuples, ,all collected from the s,'une somce, the manual fl)r the Apple Macintosh operating system 7, were used as a basis. The advantages of this approach is that .'ill exmnples are based on a common domain (knowledge about Macintosh computers), so that a common lexicon and a common knowledge base can be used tot all of them. Of course, the techniques and principles used are not restricted to this ~t of ex~nnples ,'m(l could be transfeffed to other dom~fins. 6.1 An example To demonstrate how the components of the systems work together consider example 7, from the co~pus on which the system is based:","(5) Alle Macintosh Modelle sind mit einem Steekplatz oder &rt~f/ir Gerlite ausgestattct, tier die SCSI-Schnittstelle (Small Computer System Interlace) unterst0tzt. [all Macintosh models fire cqtfil~pcd with a slot or ~ for SCSl-devices] qtLe content pl,'mner of the system is only implemented as an oracle, that is, it is preset to produce tile concepts to be formnlated ,-rod to answer certain questions by tile form pl,'mner as if it were a full-fledged content planner in a complete NL system. In the concrete ex,'unple, it would first inform the other components that the linguistic context of the target item consists of the concept Macintosh (the only concept that precedes slot in the lthmned sentence) ,and would then request the form phmner to verb,'dize tile concept slot.","The form planner would then look up tile first possible linguistic items for tim concept slot in the lexicon. The lexicon not only iucoq~rates inlommtion about the linguistic items but also about their connections to items of tile concept-base, qlmse connections take the form of ZOOM-schemata, as known from the WISBER system, cf. (lloracek 1~)0). Briefly, Z(X)Ms are links between concepts or slmdl subslrticltlres Of tile concept-netwo,k on the one h,-md and linguistic items (words) on the other hand. In our example, the first choice to verbalize slot would be 'AnschluB'. This proposal is then put torward to the revision component which tries to anticipate reader trouhle. To do this, it uses a simple user model, which employs the well known stereotype approach (Wahlster & Kobsa 1989). All concepts, lcxical entries and ZOOMs belong to one of the three categories common vocabulary, computer jargon and Macintosh specific jargon, qlle static part of the user lm~lcl then simply consists of three variables which indicate if the intended reader is expected to be fiuniliar with tile respective jargon.","This user models dilfem from other approaches because it allows tile special wdue \"?\" which indicates incomplete (you never know ~dl about the readers) or inconsistent (a text can be meant simultaneously for novices and experts) knowledge. From this static part of the u~r model a delault value can be c~dculated which c,'m be ovcLTidden through learning (see below). \"lkl be a bit more exact, two wdues are calculated in a kind of \"worstcw~e-amdysis\" due to the \"?\" values in tile user model. In our example two Z(X)M-schemata exist for slot: slot <-> 'Anschlug' slot <-> 'Steckphttz' 'Anschhff~' (and tile ZOOM connecting it with slot) is marked Macintosh, the alternative lexical entry 'Steckplatz' is marked comttlon. So, if the user model indicated that Macintosh w~cabulary was yes, the revision component would judge tile wording 'Anschlug' ok and the realization COmlmnent would output \"Alle Nacintosh Modelle sind mit EINEM ANSCIILUSS for Ger~te ausgestattet, der die SCSI-.Schnittstelle unterstQtzt.\" B ut now consider a user model which indicates timt the knowledge of computer aml Macintosh jargon is known to be no. Of course, the revision component would indicate that the term 'Anschlug' cmmot be used. A possible solution would be to generate a periphrase, i.e. replacing 'Anschluss' by 'Stcckltialz' which would be the next choice of the fonu planner. This would then be accepted by the revision component. In some cases, however, tiffs wouhl be less than perfect: (a) if the concept has repeatedly to be verbalized in tile course of the text, (b) if them are stylistic reasons to use the first choice term (here: 'Anschluss'), (c) if there are pedagogical reasons to use the first choice.","(a) consider a case in which the periphmse is a longish de-Iinilion. It would be a Ixlre to replace a short term by this dcllnition 15 times around the text. So you do it once and simltiy use the now learned term in the rest of tim text.","(b) Cerlain texls can loose their \"feel\" if slripped of e.g. tile expert wycabulary of a ce~lain area.","(c) Manutds and inmxluctory texts are oftcn mc,'mt to teach tile vocabulary in addition to the concepts. In this ease it would be nonsense to replace the to-be-taught vocabulary by e~tsier \"terms\". 321 All these conditions can only be determined by the content planner (demonstrating the need for an interaction between form planner and content planner); in the system, the form planner asks the content planner, which works as an oracle, i.e. gives the correct answers (by forwarding the questions to the human operator). If one of the conditions holds, it would be unwise to formulate a periphrase. The next choice of the form planner would then be to ask the content planner to completely replan this part of the text, namely to include a new sentence def'ming the problematic term. The system output looks like this: ANSCHLUSS BEDEUTET STECKPLATZ. Alle Macintosh Modelle sind mit EINEM ANSCHLUSS f~r Ger&te ausgestattet, der die SCSI-Schnittstelle unterst~tzt. Even this solution doesn't work in some cases and that is where paraphrases come into play. If stylistic variation is necessary or if the problematic term is embedded in the definition of still another term it is the right place to use a paraphrase: Alle Macintosh Modelle sind mit EINEM ANSCHLUSS D.H. EINEM STECKPLATZ f~r Ger&te ausgestattet, der die SCSI-Schnittstelle unterst~tzt. 6.2 A second example Just another path may lead to the generation of paraphrases for an unknown term, ,as the next example will show:","(6) \"Mit der MR~- dem Ger~it zum Zeigen und Klicken - werden die meisten Macintosh Funktionen aktivicrt.\" [With the mouse - the device for pointing and clicking - most Macintosh fimctions am activated] Fig. 2 shows the part of the conceptual network underlying this example: Fig. 2: the concept mouse t. Instr for The term 'Maus' is classified computer jargon and may not be known to the user. The replacement of the term by a definition (no synonym is available) yields the danger of encouraging false conversational implicatures by the reader, cf. (Reiter 90). Consider a user model where computer and Mac jargon are indicated as \"?\". A worst case analysis by the revision component would show that the use of 'Mans' is inappropriate because some novices wouldn't know the term, but that the pcriphrase 'Gerfit zum Zeigen (und Klicken)' is inappropriate either, because some experts will know the tenn 'Mans' and conclude from its absence that some other pointing device, but not the mouse, was meant. 2 So, a paraphra~ would again be the best solution. The system thus generates: Mit DER MAUS D.H. DEM GERAET DES COMPUTERSYSTEMS ZUM ZEIGEN werden die meisten Macintosh Funktionen aktiviert. 11ere the paraphrase is a definition of the form per genus proximum et differentia specifica which results from part of the systems' concept net shown in figure 2. The system is capable of generating two other forms of definitions (paraphrases), definition by antonymy and by enumeration. 6.3 Detection and resolution of arnhiguity Up to now, only the problem type of unknown words has been discussed. Due to lack of space only one more problem type which leads to the generation of paraphr,'tses can be discussed, n;unely the problem of ambiguous words. This problem type has since long been discussed in the area of NL understanding. Techniques for its solution include the use of spreading-activation mechanisms workiug on conceptual networks, cf. (llirst 1987). This can now be used for the purpose of problem anticipation. We just try to disambiguate terms and interest ourself in the c,xses in which it fails: these are candidates for paraphrase generation. Cf. the following ex,'unple from the corpus:","(7) \"l)as aktive Fenstcr stcht im Vordergrund[,] also yor allen anderen ee~l'flleten Fenstcrn.\" [llm active window stands iu the foreground, that is, in front of all other open windows] 1 lere, for beginners two readings of 'ira Vordergrund' ,-Ire possible: a literati (this is file correct reading) ,and a metaphorical (in the sense of \"important, to be regarded\") which are equally propable. The revision component comes to this conclusiou by conducling a worst case analysis using the concept net, an activation-spreading aigorithm and the user model. Only Ihose concepts and links that are known to at reader may forwmd energy, so in tile case of \"?\" values in the user model, both alternatives have to be tested (hence the term \"worst case anaysis\"). If comparable quantities of the activalion energy induced into the net by the liuguistic context find their way to both (or more) readings (concepts) of the ,'unbiguous terms it is concluded (and then indicated to tile lbrm planner by the revision compo,mnt) that the ambiguity might not be resolved by the reader. Then, a paraphrase could eventually (in a process similar to that described above) be generated, defining the correct reading. See (Lenke, in preparation) for derails of the spreading-actiwttion mechanism used. 2 cf. Reiter's (1990) \"dangerous fish\" vs. \"shark\" example. 322 6.4 Two more features of the system These can only be discussed brietly. See (I.enkc, in preparation) 1or details. • Paraphrases of the aspoctualization type (see above, section 5) can ,also be generated, llere, only one of the defining elements of a concept, either the superclass (genus plx)xhnum) or one of the roles (differentiae) is verbalized. At the moment, this kind of paraphrase is only generated when requested by the content planner; in the future, it will be necessary to model the anticipation of inference processes based on relcvmlcc by the reader to correctly predict the need for such paraphrases. An exmnple from the corpus, the mtderlying concept net and the equiwdeut produced by the system ,are shown below.","(8) Durch das Klicken werden die Objekte aktiviert, d.h., sic werden nun sd~warz (¢~!¢~ anderen Farbe) dargestellt und somit hervor~ehobcn. [Caused by the clicking the objects are activated, that is, printed in black (or another colour) and so highlightedl"]},{"title":"h.~.. ~-k~--~_ ~______~ b~qtt% )","paragraphs":["Fig. 3: the concept actiwtte Durch das Klicken werden die Objekte AKTIVIERT D.H. SCHWARZ DARGESTELLT . • if a p,-u'aphrase for ,an unknown term has been generated, it can be concluded tlmt the reader now knows this temt qlais is modelled by an active component of the user model which overrides the default values computed by the static component decribed above. So, only for the tkst (or first ,and second) appe~ucnce of a term a paraphrase is generated. \"ll~cre:dter the term is simply used. This nicely mimics the obserwitions made in naturally occurring texts. 7. IMPLEMENTATION DETAII,S The system is implemented in an object-oriented programming language and runs on Macintosh computers. It cont~dns a conceptual network similar to KL-ONE, consisting of approx. 130 concepts ,'rod 65 roles. Its lexicon consists of 70 ZOOM schemata and 50 lexieal entries. 8. FUTURE WORK Some possibilites for future work have ~dready been indicated in the text, most notably the embedding of the procedures descrilx-.d into a full-fledged NL-system. The approach described could al~ be transferred to oilier kinds of possible reader problems as enumerated in section 5. Since these are the problem areas of NL-undefstanding, algorithms exist which try to solve the understanding problems posed by these language features. These could be used to predict f~filure (as w,'ts demonstrated above for the actiw~tion-spreading mechanisms).","9. RI~FERENCI~S","Gabriel, R.P. (1988). Deliberate Writing. In: McDonald & Bole F.ds. Natural Language Generation Systems. pp. 1-46.","Goldman, N.M. (1975) Conceptual Generation. Ill: R.C. Sclmnk 1.21. Conceptual Information Processing.","Hayes, J. R. & L. S. Flower (1980). Identifying the Organization of Writing lhocesses, lu 1 ,W. Gregg & E.R. Steinberg Eds. Cognitive t'rocesses in Writing. pp. 3 - 30.","tlirst, (;. (1987) Semantic interpretation and the Resolution of Ambiguity.","lloracek, II. (1990). The Architecture of a Generation Component in a Complete NL Dialogue System. In 1)ale, Mellish, Zoek Eds. Current Research in Natural Language Generation. pp. 193-227.","Iordanskaja, L., R. Kittredge & AI. Polgut3re (lt~)l). l.exical Selection and l'araphm~ in a Meaning-Text (;eneration Model. In Paris, Swmlout, Mann Fxls. Natural Language Generation in AI and CL.","Jameson, A.& W.WMdster (1982). User Modeling in Anaphora Generation: FAlipsis and l)efinite 1)escription In: Proc. of ECAI 82. pp. 222-227,","McKcown, K. R. (1979) \"Paraphrasing Using Given and New Infommtion in a Question-Answer System\", in Proc. of the 7th Confereuce of the ACL, La Jolla, 1979, pp. 67 - 72.","Lcuke, N. (in prep.). Paraphrascn - L6sungen f/Jr antizipie~ae I.,cseq~robleme Ix~i tier automatischcn Textgenerierung. l)issertation, Univ. of Duisburg.","Levelt, W. (1989). Speaking. l:rom Intention to Articulation.","Mel'cnk, 1. A.. Meaning-Text M~×lcls (1982): A Recent Trend iu Soviet Linguistics. Ann. Rev. Anthropology 10:27-62.","Mcteer, M. & V. Shaked (1988). Slrategies h>r Effective l~araphrasing. Proc. of Coling '88. pp. 431 -436.","Nohm, R. (1970). Foundations for an Adequate Criterion of l~araphntse.","Rotter, E. (1990). Generating Descriptions that Exploit a User's I)omain Knowledge. Iu l)~de, Mellish, Zock Eds. Current Research in Natttral Language Generation. pp. 257 - 285","Riuglc, M. II. & B. C. Bruce (1982). Conversation Failure In Lehuert; Ringle Eds. Strategies for Natural l_xmguage Processing. pp. 203- 221.","Sigurd, B. (1987). Mctacommcnts in Text Generation. In G. Kempen 1.21. Natural lxmguage Generation. pl t. 453-461.","S maby, R. M. (1971). Paraphrase Grammars.","Stroustrup, B. (1991) The C++ Progr,'unming Language. 2d. 1'21.","[lngcheucr, G. (1969) i)araphmse und syntaklisehe Ticfcustruktur. Folia Ling. 3. pp. 178-227.","Vauglmn, M. & I). Mcl)onald (1986). A Model of Revision in Natural Language Geuemtion. Proc. of the 241h Annual Meeting of the ACL. pp. 90-96.","W:dflster, W. & A. Kobsa (1989) User Models in Dialog Systems. In A. Kobsa & W. WahlsterFxls. User Models in Dialog Systems. pp. 4 - 34. 323"]}]}