{"sections":[{"title":"Polyphony and Argumentative Semantics","paragraphs":["Jean-Michel","Grandchamp* LIMSI-CNRS","B.P. 133 91403 ORSAY CEDEX FRANCE kMevala@limsi.fr"]},{"title":"Abstract","paragraphs":["We extract from sentences a superstructure made of argumentative operators and connectives applying to the remaining set of terminal sub-sentences. We found the argumentative interpretation of utterances on a semantics defined at the linguistic level. We describe the computation of this particular semantics, based on the constraints that the superstructure impels to the argumentative power of terminal sub-sentences."]},{"title":"1 Introduction","paragraphs":["Certain utterance structures contain linguistic clues that constrain their interpretation on an argumentative basis. The following example illustrates these constraints:","I was robbed yesterday...","(1) ...but luckily I had little money.","(2) ...but luckily I had a little money."]},{"title":"(3)","paragraphs":["...but unfortunately I had little money.","(4) ...but unfortunately I had a little money.","We describe and compute the signification of such sentences by specifying how the key words (in italics) constrain the argumentative power of the terminal sub-sentences (TSS) \"I was robbed yesterday\" and \"I had money\". They may all be interpreted in a relevant context, but hints for recognizing the need of an \"odd\" context are given. For instance, in (1) and (2), the robbery is considered bad because of the opposition introduced by \"but\", to something considered happy because of \"luckily\". Holding money is considered good in (2) and bad in (1) because of the general structure of the sentence and the opposition between \"little\" and \"a little\". In (3) and (4), the robbery is considered good, while in (3) money is normally considered good too, and in (4) (the oddest) it is considered bad (imagine a speaker who","* This research is supported by SNCF, Direction de la Recherche, D6partement RP, 45 rue de Londres, 75379 Paris Cedex 08 France. usually likes to be robbed just to see the disappointment because he holds no money). We see on these examples that TSS's are argumentatively ambiguous and modifiers constrain them.","In this paper we propose, for a given utterance, the construction of the signification of the under-lying sentence, which captures its polyphonic and argumentative aspects. The signification of a sentence is viewed as the application of an argumentative super-structure to the signification of TSS's, free of operators or connectives. The signification must finally be interpreted in the context of the utterance. 2 Linguistic Background Our model rests on a framework inspired by Ducrot (1980). He defines an utterance as a concrete occurrence of an abstract entity called a sentence. Understanding an utterance means computing its meaning, which may be formalized in different contexts (such as speech acts or beliefs). The meaning is built from the context and from the signification of the sentence which :lescribes all potential uses of the linguistic matter. Ducrot's integrated pragmafics also claims that many phenomena usually described at the pragmatic level, must be described in the signification (such as argumentation).","Within Ducrot's framework, we use his theory of polyphony, topoi and modifiers. Polyphony is a theory that models utterances with three levels of characters. The talking subject refers to the person who pronounced the words. The talking subject introduces the speaker to whom the words are at-tributed (different from the talking subject in some cases such as indirect speech). Sentences contain literal semantic contents, each one being under the responsibility of an utterer. The relation between the speaker of a sentence and the utterer of a content defines the commitment of the speaker to such a semantic content. This commitment takes one of the following values: identification (ID), opposition (OPP) and partial commitment (PC) (Ducrot, 1984; Grandchamp, 1994).","Sentences are chained under linguistic warrants"]},{"title":"305","paragraphs":["called topoi (plural of topos). Topoi are found in words. In a sentence or a combination of sentences, some topoi are selected, others are not relevant to the discourse context. In the interpretative process, still others will be eliminated because of irrelevance to the situation. A topos is selected under one of its topical forms, made up of a direction (positive or negative) and other parameters. The topical form is selected with a given strength. For instance, there is a topos T linking wealth to acquisitions. The word \"rich\" may be seen as the positive form of T that says \"when you are rich you may buy a lot of things\". The word \"poor\" contains the negative form of the same topos T, that is \"when you are not rich you may not buy a lot of things\". Unlike the warrants of Toulmin (1958), topoi are not logic warrants. They may give some support for inferences, but do not have to.","The strength is ruled by a subclass of operators called modifiers, whose semantics is described precisely as modifying the strength of a selected topos. Such words include \"very\", \"little\" or \"a little\". Modiffers combine with each other and with argument sentences. The strength is specified by a lexical-based partial ordering, producing non-quantitative degrees similar to Klein's (1982) . 3 Computational Framework 3.1 Signification of sentences We have discarded the utterance/sentence level of polyphony in order to simplify the presentation. Given a set of topoi T, a set of strength markers F, the set D={positive, negative} of directions, and the set"]},{"title":"V={ID,PC,OPP}","paragraphs":["of polyphonic values, we define the set C=TxFxDxV of argumentative cells: the topos, its direction, the strength and the polyphonic commitment. The signification of a sentence is defined as a disjunction of subsets of C. 3.2","Syntax Given a sentence, we identify operators, connectives and modifiers, and build the A-structure of the sentence linking these linguistic clues to the TSS's. A sample A-structure is given in Figure 1. Connectives constrain a pair of sentences or a sentence and a discursive environment, operators constrain argumentative power, and modifiers constrain only argumentative orientation and strength. In addition, connectives and operators also specify the commitment of the speaker to semantic contents, by means of the theory of polyphony. 3.3 Lexical contributions A TSS has a semantics that is described in terms of predications, all but one being marked by presupposition. The semantics of each predication is described as a set of argumentative cells. Connectives and operators contribute to the computation of Connective"]},{"title":"but I [ Unfortunately ] [ Terminal sentence I Terminal sentence [I was robbed yesterday I had money","paragraphs":["Figure 1: A-structure for \"I was robbed yesterday, but unfortunately I had a little money\" the signification in terms of functional transformations of the signification along the four dimensions of the cells. The signification of TSS is assumed to be computed from the lexicon by a compositional process. 3.4 Argumentative structure The A-structure is then considered as the application of an argumentative structure (made of modifiers, operators and connectives) to a vector of TSS's. The signification of a complete sentence is computed as the application of what we call the &-structure. A &-structure is a function that takes as many arguments as there are TSS's, and is defined by using basic functions that are also used for the description of operators and connectives. Examples of basic functions that operate cell by cell are the modification of the polyphonic value, the direction or the strength. Examples of basic functions that operate on a set ofcells are the selection of cells with a given polyphonic value, topos or direction. The ~-structure is computed recursively on the A-structure. As the identification or the contribution of an operator may be ambiguous, the ~-structures may contain disjunctions. 3.5 Computation Given a se.atence, its (ambiguous) A- and ~- structures are computed. In the normal bottom-up process, the signification of TSS's is computed, and the ¢-structure is applied. The result is the (ambiguous) signification of the complete sentence.","If the signification of TSS's reflects their \"standard\" or \"literal\" potential, the normal bottom-up process may fail. We wish to design &-structures so that they may be used for two additional tasks that may require a top-down process: (1) accept TSS descriptions containing free variables, and produce the sets of constraints on them that lead to a solution; (2) provide the interpretation process with a way of generating \"unusual significations\" of TSS's required by the global effect of the ~-structure."]},{"title":"306 4 Sample Lexical Descriptions","paragraphs":["Connective \"but\": the signification of \"P1 but P2\" is computed from the significations of P1 and P2, with the following modifications: generate alternatives according to a partition of topoi of P1 and P2 (whose cells have free commitment variables) with the \"opposite\" relation which holds in T; in each alternative, commit the corresponding cells with the value PC for P1 and ID for P2. \"P1 but P2\" will argue in the same way as P2 alone, based on a topos that can be opposed to one of P1. Modifier \"a little\": the signification of \"a little P\" is the one of P where the strength of all cells is attenuated. Modifier \"little\": the signification of \"little P\" changes the direction of the cells into the converse value (anti-orientation). TSS \"John stopped smoking\": its signification is formed of two sets of cells, the commitment value being fixed to Pc for the cells from the presupposed predication [John smoked before] and left free for the main predication [John does not smoke now]."]},{"title":"5 Interpretation","paragraphs":["The signification of TSS's, connectives, and operators may contain instructions referring to the context for the attribution of values. The interpretative process must fill these holes. It also further selects in the sets of topoi those connected to the situation. It drives the top-down process for generating data corresponding to \"odd\" contexts.","We claim that the argumentative structure of sentences is never questioned by the interpretative process, that it fully captures the argumentative potential of the sentence and that it is reliable. The signification is then a firm base for the computation of the meaning."]},{"title":"6 Related Work","paragraphs":["Most works on argumentation define links between propositions at a logical level, so that linguistic studies focus on pragmatics rather than semantics (Cohen, 1987). Some ideas of Ducrot were already used in systems: argumentative orientation (Guez, I990) and polyphony (Elhadad and McKeown, 1990). Besides, Itaccah (1990) develops argumentative semantics without the need of a theory of utterance."]},{"title":"7 Conclusion","paragraphs":["We have isolated a semantic module which allows the interpretation process to take into account the argumentative constraints imposed by linguistic clues. We designed this module so that it starts from lexical descriptions which we are able to provide manually, and produces a structure whose interpretation can be computed. Remaining difficulties lay in the linguistic theories themselves (mainly combining modifiers and cataloguing topoi), the signification of TSS's (which should be compositional) and the integration of argumentative semantics with informative and illocutionary elements. References","It. Cohen. 1987. AnMyzing the structure of argumentative discourse. Computational linguistics, 13(1-2).","O. Ducrot et al. 1980. Les roots du discours, les ~ditions de Minuit.","O. Ducrot. 1984. Le dire et le dit. les ~ditions de Minuit.","M. Elhadad and K. It. McKeown. 1990. Generating connectives. In Proc. Coling, Helsinki, Finland.","J.-M. Grandchamp. 1994. l~nonciation et dialogue homme-machine. In Proc. Le Dialogique, Le Mans, France.","S. Guez. 1990. A computational model for arguments understanding. In Proc. Coling, Heisinki, Finland.","E. Klein. 1982. The interpretation of linguistic comparatives. Journal of Linguistics, 18.","P.-Y. Itaccah. 1990. Modelling argumentation, or modelling with argumentation. Argumentation, 4.","S. Toulmin. 1958. The uses of Arguments. Cambridge University Press."]},{"title":"307","paragraphs":[]}]}
