{"sections":[{"title":"A UNIFIED ACCOUNT OF POLARITY PHENOMENA CHUNGMIN LEE","paragraphs":["Department of Linguistics, Seoul National University, Seoul 151, Korea [clee@plaza.snu.ac.kr]","This paper argues, in an attempt at a unified account of negative polarity and free choice phenomena expressed by"]},{"title":"amu /any","paragraphs":["or wh-indefinites in Korean, English, Chinese, and Japanese that the notion of concession by arbitrary or d isjunctive choice (based on indefiniteness) is crucial. With this central notion all the apparently diverse polarity-related phenomena can be explained consistently, not just described in terms of distribution.","With strong negatives and affective licensors, their negative force is so substantial that concessive force need not be reinforced and the licensed NPIs reveal existential force. With free choice and generic-like items, licensed by modals, weakly negative in their natrue of uncertainty/irrealis, concessive force is reinforced and emphasized and the whole category denoted by the given Noun is reached in the process of concession by arbitrariy choice of its members on quantificational scale, giving the impression of universal force. The logical consequences of monotone decreasingness are transparent with strong negatives but less so with weaker ones."]},{"title":"Negative polarity, free choice, genericity, concession, arbitrary choice, indefiniteness, scale, Korean, English. 1. INTRODUCTION","paragraphs":["This paper attemps to explore the essential semantic and pragmatic nature of negative polarity phenomena including free choice cases in Korean, English and other relevant languages. It will be argued that they can be explained in terms of the notion of arbtrary choice (via indefiniteness) and the notion of concession (via inclusion), and these notions are shown to be closely interwoven with a scale set up by a concession marker and/or the context. I present an account of"]},{"title":"amu","paragraphs":["'any' and its corresponding lexical item"]},{"title":"any","paragraphs":["in English that unifies both their uses of polarity and free choice. The same account is shown to be applied to wh-indefinites as NPIs. It is noted, however, that there is a slight distinction in markers in Korean between the negative polarity use and the free choice use and that there is a distinction between strong overt negatives and weak covert negatives, with lexical variation in between in negative force within and across languages.","In the first part of the paper,"]},{"title":"I","paragraphs":["will discuss the notions of arbitrary choice and concession in connection with negative polarity, and then, discuss how a free choice item or generic-like item, licensed by modals, is focused to emphasize arbitrariness in choice. In section 3 it is shown that affective licensors such as conditional, modified generic, 'at most,' and adversative predicates license NPI of clausal origin with existential force. In section 4"]},{"title":"I","paragraphs":["examine NPIs formed by wh-indefinites to see how parallel principles are applied; in section 5 I discuss how disjunction in its open sense can be interpreted conjunctively and how that process is applied to disjunction-marked free choice items in Korean; in section 6 the logical consequences of monotone decreasingness of various licensors are condidered and it is shown that entailment from a disjunctive predicate to a conjunctive S with separate subjects by something like de Morgan's law is not so transparent with weaker licensors."]},{"title":"2. NEGATIVE POLARITY AND FREE CHOICE","paragraphs":["In English there is no distinction in form between the negative polarity use and the free choice use of"]},{"title":"any,","paragraphs":["as illustrated in (1) and (2), respectively: (1) I don't have any friends. (2) a. Any bird flies.","b. Pick any card.","On the other hand, Korean exhibits two distinct marker forms for negative polarity expressions and free choice expressions, though maintaining the same indefinite Det/adjectival form"]},{"title":"amu","paragraphs":["'any', as in (3) and (4) respectively:","a. amu chinkwu -to an o -ass -ta any friend even not come Past Dec 'No [not any] friend came.'","b. *amu chinkwu-to o-ass-ta 'Any friend came.' (lit.)","a. amu ton -i -ra -to\\tcoh -ta any money be Dec even (if) OK Dec 'Any money (whatsoever) is OK.'"]},{"title":"281","paragraphs":["b. amu ton -i -ra -to\\tkaci-e wa any money be Dec even (if) bring Imp 'Bring any money (whatsoever).' The negative polarity use has the general form of"]},{"title":"[amu","paragraphs":["Common N -to], typically occurring with overt negation, as in (3), and the form cannot occur without negation, as in (3b). In contrast, the free choice use has the form of"]},{"title":"[amu","paragraphs":["Common N"]},{"title":"-i-ra-to ]","paragraphs":["(of clausal origin), occurring with deontic or uncertainty/irrealis modality, as in (4). Both uses, however, have"]},{"title":"amu","paragraphs":["'any' and"]},{"title":"-to","paragraphs":["'even' in common. The important commonalities will be","explained readily. Let us, then, consider the properties of the prototypical negative polarity item (NPI) use of"]},{"title":"amu","paragraphs":["'any' as in the first form above and its English counterpart any. Any and other NPIs in English have been found to be licenced if they are in the scope of a downward entailing (monotone decreasing) operator like negation (Ladusaw 1979), as illustrated below: (5) If 'swim(x) --> move(x)' [not possible with"]},{"title":"any longer],","paragraphs":["then 'NOTmove(x) --> NOTswim(x)' [possible with"]},{"title":"any longer].","paragraphs":["Likewise, the Korean NPI"]},{"title":"amu","paragraphs":["is basically licenced by the same kind of operator like negation. In the case of Korean, however, the non-clausal form is applied to sharply limited contexts such as overt negation, inherently negative predicates and a few implicit negation environments, whereas the English form"]},{"title":"any","paragraphs":["is applied to a wider","variety of contexts. The syntactic position of"]},{"title":"amu","paragraphs":["or"]},{"title":"any","paragraphs":["is the Det(erminer)/attributive modifier position before (any number of attributive modifier +) a Common N, as in"]},{"title":"'any","paragraphs":["(good) friends.' Because of its indefiniteness and its syntactic nature as a determiner, it is not preceded by any other indefinite or definite determiner.","Its crucial function is, I argue, that it behaves like an attributive modifier (or intersective Adjective) variable or a Phantom property. It should be a set X of all those possible modifiers, which is intersective with the set denoted by the following Common N, forming the NP of XnA. It can rather be viewed as a predicate variable taking the Common N as its argument, forming a generalized quantifier (cf. Barwise and Cooper 1981). How to make the functor part Det-like is something to be solved. The predicate or function variable represents any possible qualitative (or quantitative) properties of the following Common N. These properties together with the Common N show any possible subtypes/subkinds of the N category/set and are restricted by various contexts. A generalized quantifier approach avoids a specific choice of individuals in the domain but we need at least contextual restrictions and pragmatic scales (Fauconnier 1975) based on contexts for appropriate interpretation of utterances. With this notion of arbitrary choice via indefiniteness, if"]},{"title":"amu","paragraphs":["or"]},{"title":"any","paragraphs":["is associated with negation or an implicitly negative element, it exhibits existential force and leads to universal/total negation as a whole, and the first"]},{"title":"[amu","paragraphs":["Common N"]},{"title":"-to]","paragraphs":["form is required in such strongly negative contexts in Korean. Let us observe such contexts as overt negation as in (3), intrinsically/morphologically negative predicates and Adverbials as in (6), and the implicitly negative subordinate clause with"]},{"title":"cen-ey","paragraphs":["'before' as in (7) and the implied negative verbs"]},{"title":"silh-","paragraphs":["'dislike' and"]},{"title":"thuliess-","paragraphs":["'far from' as in (8):","(6) a. eps- 'not have' b. eps-i 'without' e.g., amu towum-to eps-i 'without any help' c. moru- 'not know'","(7) Mary -nun [amu-to nathana-ki cen-ey] ttena -ass -ta Top anyone appear Comp before leave Past Dec 'Mary left before anyone appeared.'","(8) a. amu-to po -ki\\tsilh -e","anyone see Nom dislike SE","'I dislike seeing anyone.' [OK in gerundive in English] cf. ??amu-to silh -e","anyone dislike SE","'I dislike anyone.' (lit., but unacceptable in English) b. ke namca-nun amu -hako-to kyelhonha-ki\\tthuli -ess -e","the man Top anyone with even marry\\tNmnlzr wrong Pst SE","'As for that man, he is far from being able to get married to anyone.'","In English, 'the lack of any discipline' is allowed but not 'He is ignorant of anything.' NPI-licensibility of lexical","items with 'negative,' affective or adversative senses is not so predictable. The transparent 'negatives' in (6) in","Korean are clear licensors but its causative verb"]},{"title":"eps-ay-","paragraphs":["'cause not to exist,' 'remove' is not one. The subordinate clause ending"]},{"title":"cen-ey","paragraphs":["('before') licenses NPI as 'before' does in English, whereas both"]},{"title":"twi-ey","paragraphs":["'after' and"]},{"title":"after","paragraphs":["in English fail to. The 'before' clause entails the negative version 'when no one appeared yet,' and also downward 282 entails 'before 'any friends' appeared,' constituting a strong negative in Korean. However, it is not strong enough to license another NPI"]},{"title":"pakkey","paragraphs":["'beyond, except,' which only occurs with overt negation. The NPI"]},{"title":"pakkey","paragraphs":["originally occurs with"]},{"title":"[amu","paragraphs":["Common N"]},{"title":"-to]","paragraphs":["following and the latter"]},{"title":"amu","paragraphs":["expression optionally deletes, the former behaving as an independent NPI. The NPI"]},{"title":"amu-to","paragraphs":["in (7) with no Common N in between is necessarily human. Example (8) is reminiscent of English verbs like"]},{"title":"doubt,","paragraphs":["which allow NPIs in their complement clauses (intensional position) but not in their extensional Direct Object position (e.g., 'John doubts that anyone came' is all right but not *'John doubts anyone') (Progovac 1993). Those can be said to be fairly strong negatives in both languages, though not so strong as overt negation.","Those strong negatives we have considered above including overt negation license the type of NPIs with the form"]},{"title":"[amu","paragraphs":["N"]},{"title":"-to]","paragraphs":["in Korean. A strong negative is a strong operator that affects the bindee NPI in such a way that","the latter is interpreted existentially. Thus, the NPIs with this form and sense can also appear in any non-modal, non-","generic contexts freely with a strong negative.","Then, what is the function of the marker"]},{"title":"-to","paragraphs":["'also'/'even'/ 'even though' attached to an NPI? If the same marker is attached to a definite/specific NP as in (9), it shows the sense of inclusion predominently, the sense of membership concession or the sense of event concession:","(9) Mary -to an o\\t-ass -ta","either not come Past Dec a.'Mary didn't come, either.' b.'Even Mary didn't come.' c. 'Mary didn't come, though.'","By (9a), we understand that Mary is included in the set of people who didn't come, which is not empty. Depending on the context, however, Mary could be the most expected or likely person to come. Then, a pragmatic scale would come into being, on which less likely people to come might be listed in order, and they readily get interpreted to belong to the set of people who didn't come, because the most expected failed to. In this sense, 'Mary' normally gets a stress, and Mary's not coming is a surprise. In this case, the sense of"]},{"title":"-to","paragraphs":["is clearly concessive, close to 'even,' concessive in the sense that the least likely person not to come is admitted into the negative set. The definite proper name is simply a point on the particular scale triggered, almost functioning as an indefinite. The final reading is such that Mary unexpectedly failed to come, and this failure can be a bit disappointing. It is something like 'even (though)' applied to the whole sentence rather than only to the Noun involved. In this case, the negative set can be a singleton, with no previous members.","On the other hand, the marker"]},{"title":"-to","paragraphs":["cannot be applied to an indefinite, nonspecific Numeral + Noun in an affirmative sentence, as in (10), though the marker can be applied to the same kind of NP in a negative sentence, constituting negative polarity expressions in Korean, as in (11) and (12) below:","(10) *han chinkwu -to o -ass -ta one friend also come Past Dec 'Even one friend came.'","(11) han chinkwu -to an o -ass -ta one friend even not come Past Dec 'Even one (single) friend didn't come.'","(12) Mary -nun sey muncey -to mot phul -ess -ta Top three problem even not solve Past Dec 'Mary couldn't solve even three problems.' Let us examine the function of case markers in domain restriction in numeral NPIs. Consider the following:","(13) kaymi -ka [han marl] -to eps\\t-ta ant\\tNom one Cl even not exist Dec 'There is no single ant.'","(14) [kaymi han marl] -to\\teps\\t-ta ant one Cl even not exist Dec 'There is not even an ant.'(There are no people around.)","(15) kaym -ka tases marl -to ?*(an) nathana -ss -ta ant Nom 5 Cl even not appear Pst Dec 'Even 5 ants did not appear (Even less than 5 ants appeared).'","(16) ?Mary-nun [han saram -to\\to -ki\\tcen-ey] na-ka -ss -ta Top one person even come Nom before out go Past Dec 'Mary went out before a single person came.'"]},{"title":"283","paragraphs":["In (13) above, we get an existential expectation of ants because of the Nom marker attached to 'ant' (Lee 1989), while a quantitative scale with the restricted domain of 'ants' being triggered. The scale is possible because of the concession marker"]},{"title":"-to","paragraphs":["'even,' and we go down even to the humblest or lowest countable natural number one (so that the identity of the unit 'ant' can be maintained) and negate its predicate, and then the negation of any higher number is entailed and in consequence 'there are no ants' in the context. The scope of the concession function is limited to [han marl] 'one head.' The subject of sentence (12) can have the same construction"]},{"title":"(chikwu-ka han saram-to,","paragraphs":["'friend-Nom one person-even'). On the other hand, in (14) the scope of the concession function marked by"]},{"title":"-to","paragraphs":["'even' includes 'ant' and the pragmatic scale triggered has the domain of animals of all sizes from ants to human beings, cats and monkeys in between. So, if we make concession and deny the existence of even an ant, then it is naturally entailed that there are no such large and salient animals like human beings in the context. In other words, 'there is no trace of humans.' As in (15), any indefinite numeral (not only 'one') can be the 'minimum' or 'bottom line' expected and can function as NPI with the aid of"]},{"title":"-to","paragraphs":["in Korean. Therefore, we can embed this kind of NPI clause in the frozen 'let alone' construction (Lee 1993). If a numeral NP is definite or specific (referential), with no"]},{"title":"-to","paragraphs":["'even,' then the number denoted is discrete with no scalar principle applied, and the same subject, not functioning as NPI, can occur with affirmative predicates. In (15), if-to is replaced by the clausal form"]},{"title":"-i-ra-to,","paragraphs":["it becomes free choice requiring a modal predicate like 'must appear'"]},{"title":"(nathanaya ha-n-ta),","paragraphs":["and the whole S comes to mean 'At least five ants must appear,' with the concessive meaning 'at least.'","In (11), the lowest expected number of friends to come is one, which is the easiest to satisfy, and (far) more than one friend are expected to come on the scale in the context. If even one is denied, then a bigger number is entailed to be denied on the scale. This entailment is possible with a scalar relation, not with a discrete reading. One is the smallest possible countable number and together with a small unit expression it is employed in idiomatic negative polarity expressions in various languages (e.g., 'lift a finger,' 'budge an inch,' 'a red dime,\"een rode cent'(D), 'eine muede Mark'(G), 'tongcen han phun-to'(even a coin, Kor.), 'son hana-to kkattak ha-'(move even a hand a bit, Kor.), etc.). In (12), (far) more than three problems are expected to be solved, and if the bottom line of three is denied then it is entailed that an even bigger number than expected (whatever it may be) is also denied. However, it is implied that Mary could solve less than three problems and universal negation is not applied in such cases. These numeral expressions must occur with strong negatives including a 'before' clause (e.g., (16)) to become well-formed and to count as NPIs in Korean. Other small amount expressions together with -to also form NPIs, but this kind of NPI must depend on a quantitative scale at all times.","Here, the notion of concession expressed by"]},{"title":"-to","paragraphs":["'even' is crucial; the quantificational scale is triggered by this notion, and without it and with a normal case marker instead, a discrete cardinal number is usually denoted (e.g., if-to in (12) is replaced by the Acc marker"]},{"title":"-rul,","paragraphs":["the number of problems Mary couldn't solve is three and no notion of scale is triggered). However, if the notion of concession by going down to the bottom line can be ascertained by the linguistic or non-linguistic context, the marker"]},{"title":"-to","paragraphs":["can sometimes be deleted (e.g., from (13), but if deleted, extraordinary stress must be placed on the numeral, otherwise, a discrete number is denoted). In such contexts, even in English, a word such as 'even' that indicates concession can easily be deleted (e.g., '(Even) The best student didn't succeed.'). The concession involved is going down to the bottom line on the scale, implying 'even if we go down to the bottom line of ---,' in which case the bottom line is usually one, but it depends on the context. Concession in polarity inherently involves the notion of challenge as in betting.","What, then, is the function of"]},{"title":"-to","paragraphs":["'even' in the negative polarity expression"]},{"title":"[amu","paragraphs":["Common N -to]? We already considered the meaning of"]},{"title":"amu","paragraphs":["and"]},{"title":"any,","paragraphs":["and the function of"]},{"title":"-to","paragraphs":["can again be said to show the notion of concession, membership concession in this case, together meaning something like 'even arbitrarily chosen (subkind of) Common N.' In (3) above, therefore,"]},{"title":"[amu","paragraphs":["chinkwu Triend'-to 'any friend'] can mean 'even an arbitrarily chosen far friend,' if close friends were expected in the context.The kind of qualitative property/characteristics dimension (e.g., close/far, good/bad) assumed by the speaker and the addresse that is implied by"]},{"title":"amu","paragraphs":["or 'any' depends purely on the context. This kind of quality dimension is typical of"]},{"title":"amulany","paragraphs":["and the indefinite adjectival/pronominal forms originating from wh-words. However, the kind of quality dimension assumed, though very vague it may be, is still on the degree/quantificational scale. In contrast, quantity is typical of numeral/degree NPIs and quality is described by the predicate in this case.","At any rate, as an indefinite and non-specific constituent,"]},{"title":"amu","paragraphs":["or 'any' shows arbitrary choice of a member from among all the individual/entity members of the category denoted by the Common N following. In the process of choice, some operation like disjunction works, but the kind of disjunction involved is special, as shown below:","(17) a. a v b, where both a and b are positive b. -( a v b ) 4-+ -a & -b","As in (17a), it is an inclusive disjunction in which both sides are positive/true, which turns out to be equivalent to conjunction. On the other hand, as in (14b), if the negation operator applies, de Morgan's law works, and its consequent is toatal/ universal negation. In English, 'no' before an N (which I view as 'not+any') functions as a 284 strong Det, which can be preceded by 'almost.' In Korean, if"]},{"title":"keuy/kejin","paragraphs":["'almost' precedes the non-clausal"]},{"title":"amu","paragraphs":["expression, its acceptability is not so good but it is better than the 'almost' plus clausal"]},{"title":"amu","paragraphs":["expression. It starts as disjunction or existential and ends as conjuction or universal. In this way, a disjunction/conjunction or existential/universal flip-flop arises. If"]},{"title":"[amu","paragraphs":["Common N"]},{"title":"-to]","paragraphs":["or"]},{"title":"'any","paragraphs":["Common N' occurs with negation or a strong negative, it is ultimately interpreted as a universal negation. Because of this notion of total negation, this type of negative polarity expression cannot be entirely free from quantity interpretation. In English, the concession function is not morphologically marked but contextually triggered in the case of"]},{"title":"any,","paragraphs":["just as in the lowest numeral/bottom-","line scalar NPIs.","As already indicated, the Korean free choice expression has a form of clausal origin, distinct from the negative","polarity expression (see (4) above): ["]},{"title":"amu","paragraphs":["'any' + Common N + Copula -1 'be' + Declarative S final ending"]},{"title":"-ra + -to","paragraphs":["'even (though)']. The original subject (of the copulative predicate) must be a dummy, making it mean 'whatever money"]},{"title":"it","paragraphs":["may be (even some hidden money),"]},{"title":"it","paragraphs":["<is OK>.' This type of"]},{"title":"amu","paragraphs":["expressions, with some hypothetical/irrealis flavor, must occur with deontic or uncertainty/irrealis epistemic modality. Strong stress is usually assigned to"]},{"title":"amu","paragraphs":["here. In fact, Korean has clausal concessive free choice"]},{"title":"amu","paragraphs":["expressions, such as the following:","(18) na-nun [amu -ka\\to -a -to] hwanyengha -kess -ta I Top anyone Nom come even though welcome will Dec 'I will welcome whoever may come.' The same marker"]},{"title":"-to","paragraphs":["is a concessive subordinate clause ending in (16). The sentence has deontic modality of volition and it can be followed by epistemic modality of presumption or modality of necessity (nomological/habitual) as well. (18) may take an interrogative or negative sentence form without any change in the concessive free choice clauses. Also here, strong stress is usually put on"]},{"title":"amu.","paragraphs":["The context provides a scale for a concessive clause (e.g., in (18), the bottom line of the scale can be a stranger and the top line can be a close friend and in between different subtypes of the set of people). A concessive clause implies its corresponding conditional clause and has the meaning of concession in addition. I can go down to the bottom by concession and the range of the scale is the whole category of human beings.","The concessive clauses in (18) can be replaced by the free choice form of [amu Common N -i('be')-ra('Dec')- to](of clausal origin), e.g., by"]},{"title":"amu chinkwu-i-ra-to","paragraphs":["'any friend (whosoever).' The free choice"]},{"title":"amu","paragraphs":["expression can occur with deontic modality, modality of necessity and possibility, and uncertainty/irrealis (presumption) epistemic modality, just like concessive clauses with"]},{"title":"amu,","paragraphs":["as illustrated in (18). (4a) has the modality of permission and (4b) the modality of volition as an imperative. Formally, the modal operator must bind the free choice"]},{"title":"amu","paragraphs":["expression","as its licensor. The concessive"]},{"title":"amu","paragraphs":["clause inherently implies a conditional behind and also gives the flavor of something hypothetical. For instance, in (18), what is implied is, if a close friend comes, I will welcome her, and if a stranger comes, even in that case (=even if a stranger comes), I will welcome her. The concession of going down to the least expected bottom line and by that admitting an arbitrarily chosen member of the whole category has a hypothetical nature. The free choice"]},{"title":"amu","paragraphs":["form has exactly this nature. Therefore, this form cooccurs with uncertainty or deontic modality, but not with certainty predicates. An antecedent conditional clause is followed not by certainty clauses but by modal clauses.","In English, we can observe a parallel phenomenon. A free choice 'any' occurring within an NP is stressed and it can be followed by wh-indefinites such as 'whatsoever' and 'whosoever' (e.g., 'Pick any card whatsoever.'). Furthermore, an NP with free choice 'any' can be paraphrased into a concessive clause (e.g., 'Pick whatever card it may be.'). NPI 'any' in an NP is different in this respect.","The free choice"]},{"title":"amu","paragraphs":["expression form cannot occur with certainty-denoting statement or question (usually in","the past form) either affirmative or negative, as shown below:","(19) a. ?*amu -i-ra-to o -ass -ta [PAST] anyone\\tcome Past Dec 'Anyone (whosoever) came.' (lit.)","b. ???amu -i-ra-to an o -ass -ta [NEG, PAST] anyone\\tnot come Pst Dec 'Anyone (whosoever) didn't come.' (li.t)","c. ??amu umsik -ra -to (an) mek -ess -ni?[PAST] any food\\tnot eat Past Q 'Did you (not) eat any food?' [lit., OK in English]","d. amu umsik -ra -to mek -kess -ni? any food\\teat will Q 'Will you eat any food?'","As in (19b&c), the free choice form cannot be in the immediate scope of negation, and we can see in (19c) that 285 a straightforward question asking about an established past event with the free choice form is barely acceptable, wheras 'any' in English can appear in interrogative sentences with no regard to modality of volition, etc. A question involving volition like (19d) is perfect.","Illocutionary modal force, rather than sentential type, sometimes is relevant in licensing the free choice form of clausal origin. If the whole utterance is a statement and negation is in the conditional clause, then the negative polarity-sensitive form must occur there as in (20). In this case, the proposal marker"]},{"title":"corn","paragraphs":["'please' cannot be inserted. Consider the following:","(20) amu kes -to (*com) mek -ci anh -umyen cwuk-e any thing even eat Nom not if die SE 'If you don't eat anything, you die.' [statement]","A generic sentence makes a generalization about a generic NP. It consists of a Common N or a generic NP as a Topic and its predicate or Comment. The latter describes some property or characteristics of the former, constituting not an episodic but an individual-level predicate. The Common N talked about is necessarily a Topic (Lee 1995), as in (21). In place of a generic Topic, we can have the free choice form [amu Common N -i-ra-to], of clausal origin, or an NP with free choice 'any' in English, as illustrated in (22):","(21) a. say -nun na -n -ta bird Top fly Pres Dec 'Birds fly.' b. A bird flies. Birds fly.","(22) a. amu say -i ra -to na -n -ta any bird (clausal) fly Pres Dec 'Any bird flies.' b. Any bird flies.","Just like generic sentences, the sentences in (22) have a non-episodic, individual-level predicate (in permanent or habitual aspect). They may allow legitimate exceptions such as a tweety as well as generic sentences (Kadmon & Landman 1993). They certainly share genericity with original generic sentences. However, they have the free choice constituent, which is stressed both in Korean and English. Furthermore, a free choice generic sentence does not occur as an initial utterance in discourse. It occurs in a context where some negative atmosphere regarding some birds' flying is present. It occurs as a challenge to that kind of negative contextual factor, as an echoic utterance, echoic in Sperber & Wilson's (1981) sense.","A Topic has an inherent conditional meaning. Particularly, a generic Topic, even if it is singular, is both distributively and categorially interpreted (Lee 1995). In other words, the asserted predicative property can be applied to a variable individual member of the Common N category, and furthermore of the whole category, except for legitimate exceptions. The free choice"]},{"title":"amu","paragraphs":["expression is originally formed from a concessive clause and also has an inherent conditional meaning, as already indicated. They share a conditional meaning. Particularly, in the case of a free choice generic sentence, there is an assumed or deleted Topic at the head, presumably, after which the"]},{"title":"amu","paragraphs":["expression comes (as 'say -nun amu kes -r -to na -n -ta 'Birds, any of them, fly.'). Topic Common N"]},{"title":"say","paragraphs":["'bird,' together with the nature of the property predicate, seems to allow legitimate exceptions. Those exceptions","don't show up on the concession scale. The object free choice expression of an imperative S, on the other hand, undergoes contextual or spatio-","temporal restrictions arising from the nature of an action-related volitional (or imperative) mood. Observe: (23) amu say -i -ra -to cap -ara!","any bird be Dec even catch Imp","'Catch any bird (whatsoever).' The object free choice"]},{"title":"amu","paragraphs":["expression of clausal origin logically denotes the generic category of birds, but it must be physically limited (so some subset of birds available may be denoted) by the situational context of the given illocution. (24) is not a generic S, in the sense that it does not have a generic Topic, associated with an individual-level predicate. Therefore, the object generic term with"]},{"title":"amu","paragraphs":["cannot allow the same kind of legitimate exceptions as the generic Topic of a generic S.The same holds in English."]},{"title":"3. WEAK LICENSORS","paragraphs":["We have still another group of constructions that license NPIs or"]},{"title":"amu","paragraphs":["expressions of clausal origin. This group includes:"]},{"title":"286 (24) [kikkeshayya] 'at","paragraphs":["most' 'There were at most (*at least) three persons who have ever dated anyone.'","(25) generic-modifying clause amu -i-ra-to saranghay po -n saram -un ipyel -uy kothong -ul any clausal love\\tRel person Top parting of pain\\tAcc a\\t-n -ta know Pres Dec 'People who have loved anyone know the pain of parting.'","(26) Students who have any questions should raise their hands. =If students have any questions, they should raise their hands."]},{"title":"(27) [-myen]","paragraphs":["'if; question asking about volition, experience, etc."]},{"title":"(28) tahayng-i-ta","paragraphs":["'lucky,'"]},{"title":"nollap-ta","paragraphs":["'surprising,'"]},{"title":"yukam-i-ta","paragraphs":["'regrettable'","(29) Be glad we got any tickets!","(30) -ki-eynun nemu --- 'too --- to'","'It is too late for him to get married to anyone.'","The NPIs involved above cannot take the non-clausal form in place of the clausal form. (24) is downward entailing, and the conditional"]},{"title":"-myen","paragraphs":["'if construction is controversial as to its downward entailingness; Heim (1984) sees it as dubious, while Kadmon et al (1993) need the stipulation of a constant perspective or a sort of conditional entailment. Anyway, its downward entailingness is not so clear-cut, different from the reversed upward entailingness between the two clauses without"]},{"title":"-myen 'if.'","paragraphs":["For instance, 'If she meets any friend she can't see, she waves her hand' does not seem to entail 'If she meets any friend, she waves her hand' so clearly. As in (24), restrictive relative clauses modifying generic terms with a Topic marker can have the"]},{"title":"amu","paragraphs":["form of clausal origin. Here, the Topic marker, making conditional meaning possible, cannot be replaced by a Nominative marker. Similarly, a generic term including a universal quantifier such as 'every N' and 'all Ns,' modified by a restrictive relative clause, gets a conditional interpretation and allows an NPI in the relative clause, which is part of the argument head N in the scope of the universal functor Det. But the NP as a whole is monotone increasing, different from 'no N,' which can also license an NPI in the second argument or the predicate. The"]},{"title":"amu","paragraphs":["form of clausal origin is allowed in interrogative Ss with modality. In English, any interrogative S can license an NPI and the relation between the question operator (Q) and the argument S as the operator's scope can be put as: Q(S). Conditional meaning requires a modal or aspectually permanent/habitual predicate. Adversative predicates such as those in (28) and (29) allow"]},{"title":"amu","paragraphs":["or"]},{"title":"any","paragraphs":["expressions in their intensional complement(-like) constituent. The word 'glad' in English can have concessive meaning (Kadmon et al's 1993 'settle for less' interpretation) and thus can license 'any.' As in (28), 'regrettable' in Korean needs a clausal concessive construction rather than an"]},{"title":"amu","paragraphs":["NP. The construction in (30) is parallel to 'too ---","to' in English, which also allows an NPI in the infinitival phrase. It is expected to be closer to a strong negative but","functions as a weak licensor in Korean.","The clausal"]},{"title":"amu","paragraphs":["expressions in (23)-(28) cannot get emphatic stress on"]},{"title":"amu,","paragraphs":["differing from free choice clausal expressions. Those unstressed"]},{"title":"amu","paragraphs":["expressions may cause us to go down to the humblest sort (or quantity) of the category denoted by the Common N on the concession scale. It is not entirely negative as in the non-clausal"]},{"title":"amu","paragraphs":["form, but it is at least barely affirmative or neutral, even though"]},{"title":"amu","paragraphs":["is triggered by the NEGATIVE or uncertainty implication of the lexical item or construction involved. The tickets in (27) and (27') can thus be the humblest ones. Otherwise, a casually encountered one, though humble, may be existentially denoted by the clausal"]},{"title":"amu","paragraphs":["expression. The whole category does not have to be taken into consideration. This type of humble existential choice is made possible by the weak licensors listed above. A paralell phenomenon holds in English. (28), however, has a strong implicit negation and even nearly licenses the non-clausal"]},{"title":"amu","paragraphs":["form."]},{"title":"4. WH-INDEFINITES WITH -TO AS NPIS","paragraphs":["As already indicated, indefiniteness (and non-specificity) is required for any type of NPI. Therefore, numerals, least amount (or most likely) expressions on the scale, and"]},{"title":"amu/any,","paragraphs":["together with the notion of concession,","constitute NPIs including free choice expressions. In Korean, there are indefinite pronouns such as"]},{"title":"nwukwu","paragraphs":["'someone,'"]},{"title":"mues","paragraphs":["'something' and"]},{"title":"eti","paragraphs":["'somewhere,' and indefinite Dets/Adjs such as"]},{"title":"musun","paragraphs":["'some kind of,"]},{"title":"etten","paragraphs":["'certain' and"]},{"title":"enu","paragraphs":["'which,' and an idiomatic indefinite"]},{"title":"taman myets","paragraphs":["'few, only a few.' They are homophonous with or originate from the corresponding wh-words. If those indefinites are followed by (Common"]},{"title":"N)-to,","paragraphs":["they constitute NPIs, just like"]},{"title":"[amu","paragraphs":["'any' Common N"]},{"title":"-to","paragraphs":["'even'], licensed by strong negatives (Japanese has a parallel in this respect and also in the respect that it has the distinction between the form of non-clausal origin and that of clausal origin). Observe the following:"]},{"title":"287","paragraphs":["(31) a. Mary-nun nukwu -to manna -ci anh -ass -ta","Top whosoever meet Cmp Neg Pst Dec 'Mary did not meet anyone (whosoever).'","b. Mary -nun nwuku -rul manna -ss -ta","Top someone Acc meet Pst Dec 'Mary met someone.'","(32) ---etten muncey -to (whatsoever problem)---Neg---","Those wh-indefinites used as NPIs as in (31a, 32) are stressed, while their corresponding non-question affirmative indefinites as in (3 lb) are not. In contrast to"]},{"title":"[amu","paragraphs":["(Common N)-to], they give the impression of specific designation, though indefinite and arbitrary as well. Therefore, those wh-indefinite NPIs can be preceded by the emphatic demonstrative"]},{"title":"Ice","paragraphs":["'that/ the' (its vowel is lengthened in this use). If the wh-indefinites listed above are combined with [(Common"]},{"title":"N)-i-ra-to],","paragraphs":["of clausal origin, then they become free choice wh-indefinite expressions and are licensed by modals, just like free choice"]},{"title":"amu","paragraphs":["expressions of clausal origin. They are also stressed, and the indefinites can form free choice concessive clauses, like the examples in (16). In (16a,b),"]},{"title":"amu","paragraphs":["can be replaced by"]},{"title":"nwukwu","paragraphs":["and in (16c)"]},{"title":"amu","paragraphs":["by"]},{"title":"etten","paragraphs":["without any significant change in meaning. Let us consider an example of a free choice wh-indefinite expression of clausal origin.","(33) Mary-nun etten\\tmuncey -i-ra-to phul swu iss -ta","Top whatsoever problem clausal solve can\\tDec 'Mary can solve any problem whatsoever.'","In (33), Mary can solve whatever kind of problem (even the most difficult one) may be chosen as a specific alternative. The word"]},{"title":"amu","paragraphs":["sounds more open-ended on the scale than"]},{"title":"nukwu","paragraphs":["and"]},{"title":"etten.","paragraphs":["However, quality/property dimensions of the given category can intervene even in the latter, depending on context.","A wh-phrase in an interrogative S may be viewed as a set of alernative answers and in that sense it is also indefinite. The presence or absence of the Q or wh- feature creates a distinction between wh-words and mere indefinites from them, and in quite a few languages those two share the same form, as is the case in Korean and Japanese.","On the other hand, if the wh-indefinites are licensed by weak licensors such as in (24-30), they again take the clausal form and are unstressed, meaning something like 'at least a certain (Common N).' So, in this case, the notion of the whole category extension is very weak.","The notion of arbitrary choice from among various alternatives in the given category denoted by the Common N and the notion of concession marked by"]},{"title":"-to","paragraphs":["or"]},{"title":"-i-ra-to","paragraphs":["make wh-indefinites NPIs (including free choice items). Korean happens to employ both wh-indefinites and"]},{"title":"amu","paragraphs":["'any,' and languages that lack the lexical item corresponding to"]},{"title":"any/amu","paragraphs":["employ normal indefinites, adding concessive or emphatic particles to them. All the NPIs formed by wh-indefinites can be preceded by the emphatic demonstrative"]},{"title":"ku","paragraphs":["'that, the.' As we reviewed numeral indefinite NPIs above, the given number is normally the minimum and the notion of 'even' (negation) or 'at least' (obligation/necessity modality) and 'as many as' (or 'at least') (permission/possiblity). For"]},{"title":"any/amu","paragraphs":["or wh-indefinites,","something like the minimum in concession (quality- and quantity-wise) is set up by context including the speaker-","addressee assumptions.","Japanese does not have a lexical item corresponding to"]},{"title":"'any' I amu","paragraphs":["but shows a parallel phenomenon of wh-indefinites plus"]},{"title":"-mo","paragraphs":["'even' as NPIs and wh-indefinites plus"]},{"title":"-de","paragraphs":["'be'"]},{"title":"-mo","paragraphs":["'even' (of clausal origin) as free choice items or NPIs licensed by weak licensors, for example:"]},{"title":"dare","paragraphs":["'someone=who'"]},{"title":"-mo","paragraphs":["('anyone' as NPI)"]},{"title":"vs.dare -de","paragraphs":["'be'"]},{"title":"-mo","paragraphs":["('anyone' as free choice item or weak NPI). In this respect, Chinese is anther language that lacks a lexical item corresponding to"]},{"title":"'any' I amu","paragraphs":["and has wh-indefinites as NPIs instead. 5. DISJUNCTIVE CHOICE AND ITS CONSEQUENCES Korean has the disjunction marker"]},{"title":"-(i)na","paragraphs":["'or' and we can observe the use of closed disjunction and that of open disjunction, as follows:","(34) a. Mary -na Ken -i o\\t-1 kes-i-ta","or Nom come will Dec 'Mary or Ken will come.'","b. Mary -na Ken -ina ta o\\t-I kes-i-ta","or\\tor all come will Dec 'Mary or Ken or everybody will come.' As in (34a), if the disjunctive (Subject) NP ends in a case (Nom)) marker, the disjunction is closed and the 288 choice is between the two given alternatives. As in (34b), however, if the last item is not closed by Nom and ends in another disjunction marker -(i)na, the NP usually occurs with"]},{"title":"-ta","paragraphs":["'all, exhaustively' and the disjunction is open and the choice goes on (or gives the impression of going on) and conjunctive meaning is implied. In other words, it comes to have the function of free choice disjunction, and indeed when applied to"]},{"title":"amu","paragraphs":["or wh-indefinites, those indefinites function as free choice items. This kind of free choice disjunction shows the notion of concession by open-endedness in disjunctive choice from the given restricted domain. Because the choice is open-ended, it tends to becomr casual or random and even trivial by concession, particularly with"]},{"title":"amu","paragraphs":["(Common N). In English, Ladusaw noticed free choice or affective"]},{"title":"Or","paragraphs":["(Ladusaw 1980). The expression"]},{"title":"amu","paragraphs":["(Common N)(-i)-na is used for free choice and as weak NPIs but not for strict negative polarity in the scope of negation. Even if it is used with negation, its reading is in free choice or weak negative polarity. When used for free choice, it is stressed. In this sense, it is similar to"]},{"title":"[amu","paragraphs":["(Common"]},{"title":"N)-i-ra-to],","paragraphs":["being licensed by modals and weak NPIs, but it can occur with a wider range of predicates. For example:","(35) Mary-nun amu umak -i-na culkye tut -nun -ta","Top any music Disj enjoy listen Pres Dec 'Mary enjoys listening to any music (randomly).'","(35) is perfect in a situation where Mary is not choosy (between classical and rock, for instance). When licensed by weak licensors,"]},{"title":"[amu","paragraphs":["(Common"]},{"title":"N)-i-na]","paragraphs":["is not so felicitous as"]},{"title":"[amu -i-ra-to].","paragraphs":["If the disjunctive marker is combined with the indefinite Pronoun"]},{"title":"nukwu","paragraphs":["'someone' as in [nukwu-na], its universal flavor gets stronger, giving the impression of denoting exhaustively 'every specific' member of the given category by disjunctive choice. It is felicitously used for free choice but barely for weak negative polarity. Another kind of disjunction marker"]},{"title":"-tunji","paragraphs":["has a similar function of forming free choice and weak negative polarity expressions, combined with wh-indefinites. If the disjunctive marker"]},{"title":"(-i )-na","paragraphs":["is attached to [indefinite Numeral + Classifier], however, it comes to mean 'as many as' and does not particularly constitute any free choice item or weak NPI and, therefore, it can occur with certainty predicates. In this case, the number denoted by the Numeral must be more than one. When attached to an N and used in an S with deontic modality such as an imperative S, it has the effect of casualizing or trivializing the N."]},{"title":"6. MONOTONE DECREASING AND ENTAILMENT","paragraphs":["Those NPIs that are licensed by overt negation such as"]},{"title":"amu-to, nwukwu-to, han saram-to '(no)","paragraphs":["one' in Korean show the following entailment relation from disjunction to conjunction because of the monotone decreasing nature of negation in the predicate. In English, monotone decreasing quantifier NPs like 'no one,\"no flower' show the same effect. Negation in the Det position as in English is more marked than negation in the predicate position as in Korean. Observe:","(36) a. amu-to ttwi-kena ket-ci ahn -nun -ta anyone run or walk not Pres Dec 'No one runs or walks.'","b. amu-to ttwi-ci ahn -ko amu-to ket-ci ahn -nun -ta anyone run not and walk not Pres Dec 'No one runs and no one walks.'","The disjunctive (36a) entails the conjunctive (36b). The same effect holds in an imperative S. What we should","note is that in these cases, the reverse entailment also holds; (b) entails (a) in (36). The English counterparts also","hold. In other words, the NPIs together with negation here constitute quasi-ideals (Zwarts 1990).","In contrast, free choice expressions such as"]},{"title":"[amu","paragraphs":["Common"]},{"title":"N-i-ra-to]","paragraphs":["and"]},{"title":"[etten","paragraphs":["Common"]},{"title":"N-i-ra-to],","paragraphs":["of clausal origin, occurring with modals, do not show the same transparent entailment relation from disjunction to conjunction. Observe the following:","(37) a. amu-i-ra-to ttwi -kena kel -ul swu iss -ta","anyone\\trun or walk Acc can Dec","'Anyone can run or walk.' b. 'Anyone can run and anyone can walk.'","(38) a. amu-i-ra-to tampae-rul phiwu-kena swul-ul masi-e -ra!","'Anyone smoke or drink!' (Lit.) b. 'Anyone smoke and anyone drink!' (Lit.) 289","Both in (37) and (38), (a) intuitively fails to entail (b) transparently. In (37), even if no one can run, (a) can be true, but not necessarily (b) (the domain is not empty). Particularly in (38), even if people drink but do not smoke, it is complying with the order of (a) but not that of (b). Such obligation modality as in 'Anyone (of you) drink or drive!' may only allow exclusive disjunction and not entail 'Anyone drink and anyone drive!,' which happens to allow simultaneous drinking and driving. This is an accepted contraint in deontic logic. Weak licensors of clausal NPIs (claimed to be downward entailing by Ladusaw 1979) also seem to show less transparency in the from disjunction to conjunction entailment than overt negation. Let us consider the following case of the downward entailing quantifier"]},{"title":"kikkeshayya","paragraphs":["'at most':","(39) a. kikkethayya han chinkwu-ka wus -kena wur -ess -ta at most one friend Nom laugh or cry Pst Dec 'At most one friend laughed or cried.' b. 'At most one friend laughed and at most one friend cried.'","In everyday conversation, (39a) does not entail (39b) pragmatically, even though it may logically. In (39b), the impression we get is that two friends may be involved in case both conjuncts are true. If the nominal head is just a Common N like"]},{"title":"yeja chinkwu-tul","paragraphs":["'female friends,' however, entailment sounds valid. If the weak NPI is"]},{"title":"-man","paragraphs":["'only' instead of"]},{"title":"kikkeshayya","paragraphs":["'at most,' the difficulty of entailment is more real in its occurrence with a Numeral. However, when it occurs with a simple Common N head, with"]},{"title":"amu","paragraphs":["in its relative clause, entailment is clearly valid. Consider the following:","(40) amu-i-ra-to teyriko o-n saram ?*-i/ -man ipcangha -kena memul -ess-ta","anyone\\tbring Rel person Nom only admit\\tor remain Pst Dec","'Only those who brought anyone were admitted or remained.'","(41) 'Only those who brought anyone were admitted and only those who brought anyone remained.' (40) entails (41). If the subject NP ends in a Nominative case marker instead of"]},{"title":"-man","paragraphs":["'only,'"]},{"title":"amu","paragraphs":["cannot be licensed in the relative clause modifying the head N, as in (40). Likewise, 'only' in English licenses NPI in its scope of the first argument.","Entailment failure seems clearer with action-related imperatives, declarative volitional modality including obligation and permission, and all kinds of presumptive modality than with pure possibility modality. Let us observe a case of the latter in (42):","(42) amu sayk -i-ra-to pyenha -kena paray -1 swu iss-ta","color Clausal change or fade can\\tDec 'Any color can change or fade.'","(43) amu sayk -i-ra-to pyenha -kena paray -n -ta","change or fade Pres Dec 'Any color changes or fades.'","The entailment inference from (42) to the sentence 'Any color can change and any color can fade' sounds logically valid, but the one from (43) to 'Any color changes and any color fades' sounds less so. The predicate of (43) shows some permanent property of the subject and the disjunction may have to be interpreted as exclusive. A typical generic S such as (19) has a stronger tendency toward this. The whole category is relevant here. So, if we add, say, 'and lay eggs' to the generic S in (19), it comes to entail 'Birds fly and birds lay eggs,' revealing a monotone increasing nature just like a definite/strong Det/referential NP. However, a generic S such as ' Finns are good at skiing or cooking may be interpreted as an open free choice disjunction, ultimately getting a conjunctive reading like 'Finns are good at skiing and Finns are good at cooking (and whatever).' Or, rather, because a generic Topic has conditional meaning, the disjunctive predicate in association with it may at least vaguely entail its corresponding conjunctive S. Or, in still another reading, an individual Finn, though generically, is either good at skiing or good at cooking by exclusive disjunction.","The monotone decreasing or downward entailing nature of strong negatives causes the entailment relation from a disjunctive S to its corresponding conjunctive S with a separate subject in each conjunct to be transprent. With weak NPIs and free choice generic items, however, entailment from disjunction to conjunction is less transparent and tends to be subject to pragmatic constraints. Different degrees of negative force create different behaviors of NPI kinds. 7."]},{"title":"CONCLUSION","paragraphs":["Strong negatives (including overt negation) and various weak or affective licensors license NPIs with existential"]},{"title":"290","paragraphs":["force in both Korean and English, although the former alone licenses the non-clausal form"]},{"title":"[amu N-to]","paragraphs":["in Korean. On the other hand, free choice and generic-like items licensed by (irrealis) modals, at most weak in negative force, are focused and show some apparently universal force because the scale triggered is exhausted through focus and the whole category denoted by the N is reached. This does not happen with NPIs with existential force. Strong negatives have a strong negative force and thus with an NPI create universal negation, and weak affective licensors occur with humbling NPIs.","In our unified account of all the apparently different negative polarity phenomena, the underlying essential notion is concession by arbitrary (disjunctive) choice. Arbitrary choice is based on indefiniteness, and, therefore, NPIs can be formed not only through"]},{"title":"any/amu","paragraphs":["but also through wh-indefinites in Korean and other languages. The Concessive marker"]},{"title":"-to","paragraphs":["in Korean marks concession function and triggers a scale, by which different dimensions and degrees of concession are revealed and measured. In English, the context and the NPI"]},{"title":"any","paragraphs":["of arbitrary choice make predict concession function even without 'even.' Even in English, wh-indefinites occur in Concessive constructions. ENDNOTES 1 Earlier versions of this paper were presented at different meetings such as the 3rd French-Korean Conference on Grammar and Lexicon in 1993, the 9th PACLIC in 1994, and the First Int'nl Conference in Contrastive Semantics and Pragmatics in 1995. I would like to express my gratitutde to the scholars who showed their responses at the meetings, to Seungho Nam, who made some comments, to Beom-mo Kang, with whom I discussed grammaticality of some Korean data, and to Lizanne Kaiser, who kindly made comments on the general style of an earlier version of the paper. REFERENCES Fauconnier, G. (1975). Pragmatic Scales and Logical Structure."]},{"title":"LinguisticInquity","paragraphs":["6, 353-375. Horn, L. (1972)."]},{"title":"On the Semantic Propertyies of Logical Operators in English,","paragraphs":["Ph.D.Dissertation, UCLA, distributed by IULC, 1976.","Kadmon, N. & F Landman (1993) 'Any,'"]},{"title":"Linguistics and Philosophy","paragraphs":["16, 353-422. Keenan, E. and L.M. Faltz (1985)."]},{"title":"Boolean Semantics and Natural Language.","paragraphs":["Reidel, Dordreicht.","Koenig, E. (1986). Conditionals, Concessive Conditionals and Concessives: Areas of Contact, Overlap and Neutralization. In E. Traugott"]},{"title":"et al","paragraphs":["(eds.)"]},{"title":"On Conditionals.","paragraphs":["Cambridge University Press, 229-46. Krifka, M. (1990). Polarity Phenomena and Alternative Semantics. In M. Stokhof & L. Torenvliet (eds.)"]},{"title":"Proceed's of the 7th Amsterdam Colloquium,","paragraphs":["ITLI. Ladusaw, W. (1979)."]},{"title":"Polarity Sensitivity as Inherent Scope Relations.","paragraphs":["Ph.D. Dissertation, University of Texas. Ladusaw, W. (1980). Affective"]},{"title":"Or,","paragraphs":["Factive Verbs, and Negative-Polarity Items. J. Kreiman et al (eds),"]},{"title":"CLS","paragraphs":["16. Lee, C. (1993). Frozen Expressions and Semantic Representation."]},{"title":"Language Research,","paragraphs":["Seoul National University. Lee, C.(1995). Generic Sentences Are Topic Constructions. In F. Thorstein and J. Gundel (eds.)"]},{"title":"Reference and Referent Accessibilit,","paragraphs":["pp. 205-215. John Benjamins, Amsterdam. Lee, Y-S (1993). Licensing and Semantics of"]},{"title":"ANY","paragraphs":["Revisited."]},{"title":"NELS","paragraphs":["22. Linebarger, M. (1987). Negative Polarity and Grammatical Representation."]},{"title":"Linguistics and Philosophy","paragraphs":["10, 325-387. Nam, S. (1993) 'Another Type of Negative Polarity Item.' In Kanazawa et al (eds)"]},{"title":"Dynamics, Polarity and Quantification,","paragraphs":["CSLI, Stanford. Progovac, L. (1993). Negative Polarity: Entailment and Binding."]},{"title":"Linguistics and Philosophy","paragraphs":["16, 149-80. Progovac, L. (1994)."]},{"title":"Negative and Positive Linguistics.","paragraphs":["Cambridge University Press. Quirk, R., S. Greenbaum, G. Leech and J. Svartvik (1985)."]},{"title":"A Comprehensive Grammar of the English Language.","paragraphs":["Longman. Sperber, D. and D. Wilson (1981) Irony and the Use-Mention Distinction. In P. Cole (ed.)"]},{"title":"Radical Pragmatics.","paragraphs":["Academic Press, New York. Vendler, Z. (1967). Each and Every, Any and All. In Z. Vendler,"]},{"title":"Linguistics in Philosophy,","paragraphs":["Cornell University Press, Ithaca.","Zwarts, F. (1990). The Syntax and Semantics of Negative Polarity. In S. Busemann (ed.)"]},{"title":"Views on the Syntax-Semantics Interface","paragraphs":["II, Berlin. 291"]}]}