{"sections":[{"title":"Prototype Theory and Case Assignment","paragraphs":["Yumiko Kinjo","Graduate School of Humanities and Social Siences","Kobe University Rokkodai-cho, Nada-ku, Kobe 657, Japan Abstract","Case assignment is one of the most important issues in theoretical linguistics. The goal of this paper is to describe both syntactic and semantic bases for case assignment in terms of Prototype theory [1, 2] and to give an explanation for the difference in case assignment between English and Japanese by examining the Instrument Subject construction and deverbal nouns. English allows the structural case assignment under the syntactic prototype, while Japanese does not, because it has a strong requirement for the semantic prototype."]},{"title":"1 Instrument Subject Construction","paragraphs":["The argument called 'Instrument' appears with the case marker in a transitive construction, which is not an obligatory argument. (1) a. John opened the door with the key.","b. Taro ga doa wo -kagi de aketa.","NOM door ACC key INST opened T̀aro opened the door with the key' According to the representation in Levin and Rappaport Hovav [3], open has the argument structure in (2). The placement of agent 0-role outside the brackets marks it as an external argument which acts as the subject of the sentence. The gothic letters indicate that the 0-role acts as the direct object. Parentheses around 8-roles indicate that the role is optionally assigned. akeru seems to have the same argument structure as open. (2) open: agent <theme (instrument)>","However, Instrument appears in the subject position in English if there is no agent nominal. (3) a. The key opened the door. b. *The door opened with the key. On the other hand, Instrument is not able to act as the subject in Japanese. 157","(4) a!*Kagi ga doa wo aketa. key NOM door ACC opened T̀he key opened the door'","b. Doa ga\\tkagi de aita. door NOM key INST opened T̀he door opened with the key' Instrument is still marked with 'de' in the same manner as in the transitive construction. The sentence which has the same meaning as (3b) is not a transitive construction but an intransitive construction.","We have two possible answers to explain the difference between English and Japanese. (i) They both require 'Agent' as the subject of the transitive construction, but they allow different set of nouns to function as 'Agent', or (ii) They require different 0-roles as the subject of the transitive construction. In other words, English allows 'Instrument' subject, while Japanese does not.","One might consider 'the key' in (3a) as Agent. In addition, English has many deverbal nouns formed with -er which can mean both the person doing the action and the instrument used in the action. Rappaport Hovav and Levin [4] state that new instrumental nominals are coined constantly, as a survey of the recent terminology of computer science shows.","(5) accumulator, assembler, compiler, debugger, delimiter, file server, garbage collector, generator, matcher, parser, processor, scheduler, spooler,... Japanese also has deverbal nouns used insturmentally such as hataki (duster). There seems to be no difference between them if we look only at deverbal nouns. However, the root verb hakaku (dust) does not allow the Instrument subject. This fact implies that the difference exits at the sentential level.","In the next section, to understand the difference between nouns and sentences, we look closely at deverbal nouns in English."]},{"title":"2 Event Nominal","paragraphs":["Grimshaw [5] has pointed out that derived nominals with complements only have the event interpretation. In other words, destruction can refer to the process of destroying something or to the result of the process. On the other hand, destruction of Rome which appears with its complement can only refer to the actual event.","Furthermore, Grimshaw has also showed the certain prenominal modifiers such as frequent and constant are found only with event derived nominals, but not with result derived nominals. (6) a. The (*frequent) expression is desirable. b. The (frequent) expression of one's feelings is desirable. c. We express *(our feelings). 158 The examples above show that an event nominal such as (6b) inherits the argument structure of the verb express. Because it has to appear with the complement like its sentential counterpart.","Rappaport Hovav and Levin [4] have observed parallels between -er nominals and derived nominals. The -er nominal with the complement, the destroyer of the city, which can only refer to someone who has participated in the event of destroying the city, presupposes that the destruction has actually occurred. While the nominal destroyer on nonagentive interpretation, which refers to something intended to be used for the purpose of destroying, never presupposes actual destruction. Of course, -er event nominals can appear with prenominal modifiers such as frequent. (7) a. frequent riders of the MBTA's Red and Orange Lines b. constant defenders of the government's politics c. a frequent buyer of lottery tickets","However, the -er nominals with the complement noun do not allow nonagetive interpretation. They cannot refer to a thing. (8) a. a grinder of imported coffees b. a grinder (8a) refers only to the person, though the verb 'grind' also accepts the Instrument subject. (9) a. Pat ground the coffee freshly for us. b. This machine ground the coffee well yesterday.","Suppose that (8a) inherits the argument structure of the verb grind such as in (10) strictly, -er nominals with complements do not allow Instrument subject as in Japanese. (10) grind: agent <theme>","What is the difference between deverbal nouns and sentences? 'Imported coffee' in (8a) has the same thematic role 'theme' with 'the coffee' in (9). However, ìmported coffee' is case-assigned by 'or lexically. Now, let us consider the requirements on case assignment."]},{"title":"3 Burzio's Generalization","paragraphs":["In the literature on Government-Binding Theory, Burzio [6] has suggested the principle which relates Accusative case assignment to the existence of the subject 0-role. It is called \"Burzio's generalization\", which is given in (11). 159 (11) Os <-+ A","(11) means that a verb has the property of assigning a 9-role to its subject (Os), if and only if it has the property of assigning Accusative Case (A). (Accusative Case is assigned by a head under government to a linearly adjacent position.) This statement consists of two independent claims in (12). (12) a. –Os –+ –A b. –A –Os","Burzio pointed out that (12a) is empirically true, but that it lacks theoretical motivation. He assumes that (12a) is an autonomous lexical principle, not just a reflex of syntactic factors. On the other hand, (12b) is theoretically derivable. If a verb which takes a direct object does not assign Case to it, it must fail to assign 0-role to the subject position. Because \"the only two possibilities for such a direct object to receive Case will be: (i) that it be linked with a non-argument subject; (ii) that it move into subject position. Both possibilities require –0s.\" (p.184)","Burzio's generalization makes strong predictions about two kinds of intransitive verbs. Current linguistic theories divide intransitive verbs into two subclasses, one usually called \"unergative\" verbs and the other \"ergative\" or \"unaccusative\" verbs. The unergative verbs such as dance, run, and shout have agentive subjects while the unaccusative verbs such as break and fall have subjects which are assigned a theme 0-role, not an agent 0-role. (13) unergative verb run: agent < unaccusative verb break:\\t<theme> Unaccusative verbs, which do not have the subject 0-role, cannot assign Case to their sole complement in the post-verbal position. So the post-verbal NP will be forced to move to the subject position. Unergative verbs, which have the subject 0-role as sole complement, are potential accusative assigners. (14) a. The joggers ran their Nikes *(threadbare). b. They laughed John *()off the stage.)","Consider the examples above. run and laugh are unergative verbs, so they do not have the object argument. However, they can have the post-verbal NP with the resultative phrase because they are potential accusative assigners. This kind of case assignment is considered to be structural.","On the other hand, unaccusative verbs cannot have the post-verbal NP with the resultative phrase.","(15) a.*The balls bounced the markings off the floor. (meaning: the markings came off the floor as a result of the balls bouncing; cf. The basketball players dribbled the markings off the balls/floor) 160","b.*The rice slowly cooked the pot black. (meaning: the pot became black as a result of the rice cooking)","It should be noticed that Burzio's generalization says nothing about the semantic conditions among arguments. Though it concerns the existence of the subject 0-role, we can consider the generalization a structural requirement on case marking. In the next section, semantic requirements will be discussed."]},{"title":"4 Semantic Basis for Case Marking","paragraphs":["In the previous section, I assumed that Burzio's generalization is a structural requirement on case assignment. In other words, the noun assigned Accusative Case must be adjacent to the verb and the subject position must be occupied. If Accusative assignment occurs under prototypical environment, the structural requirement is the syntactic prototype of transitive constructions.","Jacobsen [2] gives the following four principal ingredients as the semantic prototype of transitive constructions. (16) a. There are two entities involved in the event. b. One of the entities (called the \"agent\") acts intentionally. c. The other entity (called the \"object\") undergoes a change. d. The change occurs in real time.","Consider the semantic conditions of (14) and (15). They involve 'two events' in a sentence instead of 'two entities.' The first event expressed by the main verb causes the second event which refers to a change of the post-verbal NP. The subject of the main verb may be considered to be 'agent' in (16b). Some of them act intentionally in the first event, however none of them can be considered to cause the second event intentionally. In short, they have the same semantic condition because both (14) and (15) do not satisfy (16b).","Assuming that their semantic conditions do not differ, the ungrammaticality of (15) can be attributed the violation of the syntactic requirement. The existence of the trace prevents the post-verbal NP from receiving Case. (17) a.*The balls bounced t i the markings off the floor. b. *The ricei slowly cooked ti the pot black. c. *The icei melted t i the name off the mailbox.","Transitive constructions usually satisfy the prototype both syntactically and semantically. However, the case assignment does not have to be done under the unique condition. If the case assignment under the prototypical condition is the lexical case assignment, the case assignment in resultative constructions of unergative verbs such as in (14) can be considered the structural one. 161","How should the Instrument subjects, e. g. 'the key' in (3a), be treated? The Instrument subjects cannot act intentionally, therefore sentences with Instrument subject do not seem to fit the semantic prototype. However, the syntactic requirement can be satisfied by the Instrument subject, therefore the structural case assignment will occur.","Consider the following example. (18) The door opens with the key.","In the middle construction, the Theme 'the door' is able to appear in the subject position, even if Instrument exists. The middle construction describes not the event which happened to Theme, but the attributes of the subject noun. Hence, (18) doesn't satisfy (16c). In this case, since the structural case assignment is not available, 'the door' has to move to the subject position to get Case."]},{"title":"5 Conclusion","paragraphs":["In the previous section, examples of structural case assignment have been considered. Accepting that English allows structural case assignment and Japanese doesn't, we were able to explain the difference between the two languages.","Japanese does not have the Instrument subject construction. However, we should not consider that English and Japanese have the different thematic roles and syntactic structures. Japanese also has deverbal nouns which have transparent readings like -er nominals in English. Therefore, they are different in the structural case assignment and it is caused by the difference which prototype needs the strict accordance. Japanese is one of the languages that require the accordance with the semantic prototype."]},{"title":"References","paragraphs":["[1] E. Rosch. Principles of Categorization. Hillsdale: Lawrence Erlbaum Associates, 1978.","[2] W. M. Jacobsen. The Transitive Structure of Events in Japanese, volume 1 of Studies in Japanese Linguistics. Tokyo: Kurosio Publishers, 1992.","[3] B. Levin and M. Rappaport Hova y . The formation of adjectival passive. Linguistic Inquiry, 17:623-661, 1986.","[4] M. Rappaport Hovav and B. Levin. -Er Nominals: Implications for the The-ory of Argument Structure, volume 26 of Syntax and Semantics. New York: Academic Press, 1992.","[5] J. B. Grimshaw. Nouns, arguments and aduncts. Unpublished manuscript, Brandeis University, 1986.","[6] L. Burzio. Italian Syntax: A Government-Binding Approach. Dordrecht: Reidel, 1986. 162"]}]}