{"sections":[{"title":"ACL Minutes The FINITE STRING Newsletter Minutes of the 1984 ACL Meeting","paragraphs":["Following are the minutes of the 22nd Annual Business Meeting of the Association for Computational Linguistics, held 5 July 1984 at Stanford University in Stanford, California, in conjunction with COLING84, the 10th International Conference on Computational Linguistics. Martha Evens, ACL President, presided. COLING84 Committee Report COLING84, the first held in the United States since the inaugural meeting in 1965, is proving to be an unquestioned success. The attendance of about 450 is one-and-a-half times larger than any previous COLING. Of the 270 papers submitted, 105 were accepted, 17 as long papers, 88 as short ones. Two innovations, an exhibit program and a mini-summer school, were noteworthy additions to the conference. Secretary-Treasurer's Report The demands of COLING84, coupled with the Secretary-Treasurer's imminent move to New Jersey, resulted in the presentation of a summary report instead of the usual detailed presentation. Income for 1983 was approximately $130,000 and expenses $85,000, for a surplus of about $45,000. Total assets at the end of the year were over $100,000, a total that does not take into consider-ation all of the costs for production and distribution of the 1983 journal issues. Membership for 1983 was approximately 1300; the late mailing of the dues statement for 1984 (deliberate because of the lateness of the journal production cycle), makes it inappropriate to present any figures for 1984. Editor's Report: Studies in Natural Language Processing The first volume in the ACL/Cambridge University Press series is in page proof:"]},{"title":"Natural Language Processing-- PsychologicaL Computational, and Theoretical Perspectives,","paragraphs":["edited by David Dowty, Lauri Karttunen, and Arnold Zwicky. Kathleen McKeown's"]},{"title":"Generating Natural Language,","paragraphs":["and Douglas Appelt's"]},{"title":"Planning Natural Language Utterances,","paragraphs":["are both in various stages of production."]},{"title":"Space and Prepositions in English,","paragraphs":["by Annette Herskovits, and"]},{"title":"An Introduction to Computational Linguistics,","paragraphs":["by Ralph Grishman, should provide final copy shortly. Manuscript submissions are encouraged. Editor's Report: AJCL/CL The last 1983 issue of American Journal of Computational Linguistics has been mailed out, and the first 1984 issue of Computational Linguistics is ready to be sent to the printers. Site reports are beginning to appear in The FINITE STRING; more are encouraged, as are abstracts for the \"Abstracts of Current Literature\" section. Books that need reviewing are available; interested people are urged to contact Lyn Bates, the Book Review Editor. Vice President's Resignation Lance Miller submitted his resignation, responding to the pressures of his work responsibilities. The resignation was regretfully accepted, with appreciation expressed for his many contributions to the ACL. Nominating Committee Report The following slate of officers for 1985, submitted by the Nominating Committee (Norm Sondheimer, Jane Robinson, and Ray Perrault), was accepted by acclamation:","President Madeleine Bates, Bo/t Beranek and Newman","Vice President Ralph M. Weischedel, University of De/aware","Secretary-Treasurer Donald E. Walker, Be//Communications Research","Executive Committee (1985-1987) Alan W. Biermann, Duke University","Executive Committee (1985; to complete Weischedel's term) Richard I. Kittredge, University of Montrea/","Nominating Committee (1985-1987) Martha W. Evens, ///inois Institute of Techno/ogy ACL Meetings The 1985 Annual Meeting is scheduled for the University of Chicago, 8-12 July; Bill Mann is Program Chair; Martha Evens is responsible for Local Arrangements. Both the University of Delaware and New York City are being considered as sites for the 1986 meeting. The Linguistic Society of America's Summer Linguistic Institute will be held in New York in 1986, and computational linguistics will be a major focus of its program. The European Chapter This second anniversary of the ACL European Chapter finds the organization flourishing. Over 100 people attended the Chapter's first meeting in Pisa, 1-2 September 1983. A second conference is scheduled for 28-29 March 1985 in Geneva. Margaret King is Program Chair; Mike Rosner is responsible for Local Arrangements. An attendance of 200-300 is projected. Fortyseven new members were added in 1983 for a total of 418; the Chapter treasury in Switzerland shows a balance corresponding to $7000. AFIPS Developments The most recent distribution of surplus from the National Computer Conferences has provided ACL with $50,000. The new AFIPS President, Stephen Yau, was prevented by illness from attending COLING84 and being present for the Business Meeting; he sent his regards instead. AFIPS is considering responding to a White House Initiative on Community Action to increase the public's understanding of computers. ACL members are encouraged to participate in AFIPS Committees; anyone interested should contact Norm Sondheimer. 220 Computational Linguistics, Volume 10, Numbers 3-4, July-December 1984 The FINITE STRING Newsletter ACL Minutes"]},{"title":"Cooperation with the Linguistic Society of America","paragraphs":["The LSA membership is becoming more interested in things computational; as a result, the ACL is considering more involvement in Linguistic Institutes and other kinds of interactions with LSA."]},{"title":"Membership Drive","paragraphs":["A new ACL brochure is being prepared under the direction of Norm Sondheimer. It will be used in a forthcoming membership drive. Members are encouraged to disseminate copies widely when they appear."]},{"title":"Announcements","paragraphs":["The Secretary-Treasurer reiterated the need for a statement on careers that could be distributed by the ACL office, as well as brief descriptions, with selected bibliographies, for a broad range of topics in computational linguistics. Many requests for such information are received each year.","Carol Lane described CALICO, the newly formed Computer-Assisted Language and Instruction Consortium, and its journal, CALICO. A conference is scheduled for January/February 1985 in Baltimore, and a summer institute will be held in 1985. A data base containing information on the use of computers in language instruction will be available online soon. ACL members with an interest in this area should consider joining this new society.","Raoul Smith remarked on the success of the first Conference on Computer/Human Interaction held in December 1983, which ACL co-sponsored, and announced that the next CHI conference would be held 14-18 April 1985. He invited ACL members to submit papers on nat~Ural language interfaces, text generation, voice quality in speech synthesis and recognition, and related topics."]},{"title":"Resolution Committee Report","paragraphs":["Lyn Bates expressed the appreciation of the ACE to the many members who contributed significantly to its operation over the year since the last meeting.","The meeting was adjourned.","DonaM E. Walker Secretary-Treasurer Computational Linguistics, Volume 10, Numbers 3-4, July-December 1984 221"]}]}