{"sections":[{"title":"Computational Linguistics Formerly the American Journal of Computational Linguistics Volume 10, Numbers 3-4 July-December 1984 SPECIAL ISSUE ON MATHEMATICAL PROPERTIES OF GRAMMATICAL FORMALISMS Guest Editor: C. Raymond Perrault","paragraphs":["On the Mathematical Properties of Linguistic Theories C. Raymond Perrault English and the Class of Context-Free Languages Paul M. Postal and D. Terence Langendoen On Two Recent Attempts to Show that English Is Not a CFL Geoffrey K. Pullum Comments on Pullum's Criticisms D. Terence Langendoen and Paul M. Postal Strong Generative Capacity, Weak Generative Capacity, and Modern Linguistic Theories Robert C. Berwick"]},{"title":"Book Review","paragraphs":["A Grammar of English on Mathematical Principles Reviewed by Bruce E. Nevin"]},{"title":"The FINITE STRING Newsletter","paragraphs":["A New Section: Sources Recent Computer Implementations of PSGs Site Report BBN Labs Program Workshop on the Lexicon, Parsing, and Semantic Interpretation Minutes of 1984 Annual Meeting Abstracts of Current Literature COLING84"]},{"title":"Microfiche (CL Mr. 99) 165","paragraphs":["177"]},{"title":"182","paragraphs":["187 189 203 212 215 219 220 222"]},{"title":"Published Quarterly by the Association for Computational Linguistics Computational Linguistics Formerly the American Journal of Computational Linguistics","paragraphs":["Published quarterly by the Association for Computational Linguistics. (ISSN 0362-613X) Editor Managing Editor Associate Editor Book Review Editor The FINITE STRING Editor Production Editor Editorial Board Members 1982-84: 1983-85: 1984-86: James F. Allen Computer Science Department University of Rochester Rochester, NY 14627 USA (716) 275-5288; ACL@ROCHESTER.ARPA Donald E. Walker Bell Communications Research 445 South Street Morristown, NJ 07960 USA (201) 829-4312; bellcore!walker@berkeley.ARPA Michael C. McCord IBM Thomas J. Watson Research Center P.O. Box 218 Yorktown Heights, NY 10598 USA (914) 945-1308; MCCORD.YKTVMX. IBM@ RAN D- R ELAY.ARPA Madeleine Bates Bolt Beranek and Newman 10 Moulton Street Cambridge, MA 02238 USA (617) 497-3634; BATES@BBNG.ARPA Ralph M. Weischedel Bolt Beranek and Newman Inc. 10 Moulton Street Cambridge, MA 02238 USA (617) 491-1850; WEISCHEDEL@BBNG.ARPA Cay Dietrich IBM Thomas J.,Watson Research Center (914) 945-2947; AJCL.YKTVMV.IBM@RAND-RELAY.ARPA Jaime G. Carbonell, Carnegie-Mellon University Daniel L. Chester, University of Delaware Martha W. Evens, Illinois Institute of Technology Ronald M. Kaplan, Xerox Palo Alto Research Center S. Jerrold Kaplan, Teknowledge Madeleine Bates, Bolt Beranek and Newman Alan Biermann, L~uke University Beatrice T. Oshika, System Development Corporation D. Terrence Langendoen, CUNY Graduate Center Lenhart K. Schubert, University of Alberta Lauri J. Karttunen, SRI International Richard I. Kittredge, Universit~ de Montreal Gerald Gazdar, The University of Sussex David J. Israel, Bolt Beranek and Newman William C. Mann, UCS/Information Systems Institute Wolfgang Wahlster, Universit3t Hamburg Copyright © 1985 by the Association for Computational Linguistics. The code and copyright notice appearing at the bottom of the first page of an article in this journal indicate the copyright owner's consent that a single copy of the article may be made for personal use. Any copier must pay for copying beyond that permitted by Sections 107 and 108 of the U.S. Copyright Law. The per-copy fee for each article appears after the dollar sign and is to be paid through the Copyright Clearance Center, Inc. This consent does not apply to other kinds of copying, such as copying for general distribution, for advertising and promotional purposes, for creating new collective works, or for resale. Such permission requests and other permission inquiries should be addressed to the Managing Editor at the address given above. Subscriptions to CL are available only through membership in the ACL. Each subscription includes both hard-copy and microfiche versions of the journal. Back issues of the AJCL may be ordered at annual rates of $15 for orders from personal members, $30 from institutional members. The first five volumes (1974-1978) are available only on microfiche; add $3 for first class mailing in North America; $6 for air printed mailing overseas. Volumes 6 - 9 (1980-1983) are available in both hard-copy and microfiche form; add $6 for first class, $12 for air printed mail. The AJCL was not published during 1979: Annual dues are $15 for personal and $30 for institutional memberships. A joint membership for couples that provides one subscription is available for $20. The dues payment includes bulk or surface mailing fees. First class mailing is available in North America for an additional $6; air printed mailing is available overseas for an additional $12. Address changes should be sent to the ACL Secretary-Treasurer. Payments for dues or back issues should be made payable to the Association for Computational Linguistics (or ACL). Payments sent to the ACL Secretary-Treasurer should be payable in US dollars. Payments from people in Europe or with Swiss accounts should be sent to the European Chapter Treasurer; they can be paid in Swiss francs, by personal checks in the currency of that country, or by a banker's draft that credits account 141.880.LAY at the Union Bank of Switzerland, 8 rue de Rhone, CH-1211 Geneva 11, SWITZERLAND. European residents can get information on currency conversion values from the European Chapter Secretary. A Note from the Editor: At the 21st Annual Meeting of the ACL at MIT in 1983, one of the sessions was devoted to the formal properties of various linguistic formalisms and to the significance of these results. This Special Issue is an aftermath of that session, although the list of participants is somewhat different.","In their 1982 paper \"Natural Languages and Context-Free Languages\", Geoffrey Pullum and Gerald Gazdar examined all the published claims that natural languages might not be context-free and found them wanting. The contributions by Postal and Langendoen and by Pullum to this issue continue to explore this question. Postal and Langendoen argue in \"English and the Class of Context-Free Languages\" that English is not context-free by examining the class of sentences exhibiting the sluicing construction, such as Joe discussed some bourbon hater but it's not known which bourbon hater. Pullum's paper \"On Two Recent Attempts to Show that English Is Not a CFL\"attacks the linguistic data on which Postal and Langendoen's argument is based, as well as those underlying a similar claim by James Higginbotham. The second contribution by Langendoen and Postal is a rejoinder to Pullum's paper.","Robert Berwick's \"Strong Generative Capacity, Weak Generative Capacity, and Modern Linguistic Theories\" is a discussion of some of the formal properties of Lexical Functional Grammar and the Government-Binding (GB) version of transformational grammar. It contains the first published formalization of GB, a proof that GB languages under this formalization are recursive and that they have the arithmetic growth property.","Finally, my contribution to this issue is an expanded version of a survey of formal results about various linguistic theories and a discussion of how these results can be used as lower bounds and as upper bounds on acceptable theories. C. Raymond Perrault, Guest Editor"]}]}