{"sections":[{"title":"The FINITE STRING Newsletter 1983 ACL Membership List Membership List","paragraphs":["Following is a listing of the 1983 members of the Association for Computational Linguistics as of the time Issue 3-4 of the AJCL went into production. Personal members are listed first, ordered alphabetically by last name. Institutional members follow, ordered alphabetically by country, province (for Canada), city, and then institutional name; for the United States, the sorting is by ZIP-code. Wanted: Addresses for the members whose names appear at the end of the Personal Members listing. Information should be for-warded to the ACL Secretary-Treasuer."]},{"title":"Personal Members Maria Tereza Aarao","paragraphs":["Softmedia Pesquisa e","Desenvolvimento Rua Rego Freitas, 530-B7 Sao Paolo, Brazil 01220 Clifford Abbott 441 S. Van Buren Street Green Bay, WI 54301 Russell J. Abbott Computer Science California State University Northridge, CA 91330 Jun'ichi Abe Behavioral Science Faculty of Letters Hokkaido University Sappporo N-10 W-7, 060 JAPAN Giovanni Adamo Lessico Intellettuale Europeo CNR Via Nomentana 118 1-00161 Rorna, ITALY R. Adams Birdsell Road Francestown, NH 03040 Roger Addelson Academic Computing Loyola University 6525 Sheridan Road Chicago, IL 60626 Giovanni Adorni Istituto di Eletrotecnica Via All' Opera Pia 11A 1-16145 Genova, ITALY Thomas Ahlswede 4161 West Byron Chicago, IL 60641 Glenn Akers Kurzweil Alpha Systems, Inc. 411 Waverley Oaks Road Walham, MA 02154 B.E.P. Alden 1 Copford Lane Ashton Theynes, Long Ashton Bristol BS18 9NF, ENGLAND Yawar All Computer Science University of Toronto 10 Kings College Road Toronto, MSS 1A4, CANADA Earl Allen 4100 Winfield Avenue Ft. Worth, TX 76109 Elizabeth Allen Computer Science University of Maryland College Park, MD 20742 James Allen Computer Science University of Rochester Rochester, NY 14627 Jonathan Allen M.I.T. Room 364419 Cambridge, MA 02139 Sture Allen Haakansdal 86 S-417 44 Goeteborg, SWEDEN Jens AIIwood Linguistics Goeteborgs Universitaet Erik Dahlbergsgatan 11B S-411 26 Goeteborg, SWEDEN Lori Alperin 1096 Vistavia Circle Decatur, GA 30033 Richard Alterman Computer Science University of California Berkeley, CA 94720 Alan Altman 127 Brahms Way Sunnyvale, CA 94087 Robert A. Amsler Natural-Language and Knowledge-Resource Systems SRI International Menlo Park, CA 94025 Sophie Ananiadou ISSCO 54 route des Acacias CH-1227 Geneva, SWITZERLAND Don D. Anderson 12902 Old Chapel Rd Bowie, MD 20715 Galia Angelova Institute of Mathematics PO Box 373 1090 Sofia, BULGARIA Alena Appelova SIovenska technic, kniznica Drienpva 36 CS-880 23 Bratislava CZECHOSLOVAKIA Douglas Appelt Artificial Intelligence Center SRI International Menlo Park, CA 94025 i, V, Arapov Belrnozskaja 10-2-210 SU-111524 Moscow, USSR Armar A. Archbold Natural-Language and Knowledge-Resource Systems SRI International Menlo Park, CA 94025 Robert Archer 803 La Sell Drive Champaign, IL 61820 Yigal Arens Computer Science Univ. of Southern California SAL 200 Los Angeles, CA 90089 Douglas John Arnold Languages and Linguistics University of Essex Wivenhoe Park, Colchester Essex, CO4 3SQ, ENGLAND John Aronis Computer Science Carnegie-Mellon University Pittsburgh, PA 15213 Stephanie August UCLA/Hughes Aircraft 7824 McConnell Avenue Los Angeles, CA 90045 Fernando AvilaMurillo A.P. A-32 Hermosillo, Sonora 83190 MEXICO Joan Bachenko Code 7596 Naval Research Laboratory Washington, DC 20375 William Badecker Psychology Johns Hopkins University Baltimore, MD 21218 Norman I. Badler CIS-Moore School D2 University of Pennsylvania Philadelphia, PA 19104 Ellen A. Bailey 3402 S. Winston, No.108 Tulsa, OK 74135 R. I. Bainbridge Computer Science Teeside Polytechnic Borough Road, Middleborough Cleveland, ENGLAND M.H. Bakalla 3 Old House Court Church Lane, Wexham, Slough Bucks, ENGLAND Laura Blumer Balcom 640 Taylor Court, No.510 Mountain View, CA 94043 Catherine N. Ball SMS Inter. Div. 51 Valley Stream Parkway Frazer, PA 19355 Bruce W. Ballard Computer Science Duke University Durham, NC 27706 Henry Ballard 4208 Camino Ticino San Diego, CA 92122 Jerzy Banczerowski Instytut Jezykoznawstwa Uniwersytet Poznanski Marchlewsiego 124/126 PL-61 874 Poznan, POLAND Steven Bankes Rand Corporation, ISD/1 1700 Main Street Santa Monica, CA 90406 Jacek Bankowski Instytut Informacji Nauk. Technicznej i Ekonomicznej ul. Zurawia 3/5 PL-00 926 Warszawa, POLAND Robert F. Barends 8600 Fathom Circle, No.2408 Austin, TX 78750 John A. Barnden Computer Science indiana University Bloomington, IN 47401 Robert F. Barnes Philosophy, Bldg 15 Lehigh University Bethelehem, PA 18105 Naomi S. Baron Brown University, Box E Providence, RI 02912 Joseph Barone PO Box 53 Monmouth Junction, NJ 08852 Frederick B. Bart 2217 Cheyenne Street Golden, CO 80401 Thomas i. Bartold 20045 Woodside Harper Woods, MI 48225 i. Bateman Centre for Computational Linguistics UMIST, PO Box 88 Manchester M60 1QD, ENGLAND iadeleine Bates Bolt Beranek and Newman 10 Moulton Street Cambridge, MA 02238 Jorge Batista 7055 SW 147 Ct Miami, FL 33193 Edwin Battistella English University of Alabama University Station Birmingham, AL 35294 J. Baudot Linguistique Universite de Montreal CP 6128 Suc.A, Montreal Quebec, CANADA H3C 1J7 John S. Bear Artificial Intelligence Center SRI International Menlo Park, CA 94025 Robert Bechtel 8051 Nightingale Way San Diego, CA 92123 Donald A. Becker German University of Wisconsin 818 Van Hise Hall Madison, Wl 53706 Lee A. Becker Engineering & Computer Science Tulane University 301 Stanley Thomas Hall New Orleans, LA 70118 Henry F. Beechhold 13 Perry Drive West Trenton, NJ 08628 Daniel Beeghly Ford Product Development Group PO Box 2160 Dearborn, MI 48123 Barbara Begier SrodowiskowyOsrodeklnformatyki Politechnika Poznanska PI M. Sklodowskiej-Curie 5 PL-60 965 Poznan, POLAND 58 Computational Linguistics, Volume 10, Number 1, Janury-March 1984 The FINITE STRING Newsletter 1983 ACL Membership List John M. Bennett Basser Dept Computer Science University of Sydney Sydney, New South Wales AUSTRALIA 2006 Paul Bennett Centre for Computational Linguistics UMIST, PO Box 88 Manchester M60 1QD, ENGLAND David B. Benson Computer Science Washington State University Pullman, WA 99164 lan Benson 7 Lambert Jones Mews Barbicon London EC24 8DP, ENGLAND John E. Benson 769 Avenue E, Apartment 1 Bayonne, NJ 07002 William Benzon Language, Literature and Communication Rennselaer Polytechnic Troy, NY 12181 Jared Bernstein 511 8th Avenue Menlo Park, CA 94025 Pamela Bernstein 840 Wellington Avenue, No.517 Elk Grove Village, IL 60007 Dominque Beroule LIMSI (CNRS) BP 30 F-91406 Orsay, Cedex, FRANCE Genevieve Berry-Rogghe Computer & Information Science Temple University, Bldg 03824 Philadelphia, PA 19122 Robert C. Berwick MIT AI Laboratory 545 Technology Square, Rm 820 Cambridge, MA 02139 Robert i. Best 16016 9th Avenue, NE Seattle, WA 98155 Robert Bethel 1536 Pickwood Avenue Fern Park, FL 32730 Sooda L. Bhatt 800-9 Hyde Park Avenue Hyde Park, MA 02136 Carlo Biagioli Istituto per la Documentazione Giuridica (CNR) Via Panciatichi 56/16 Firenze, ITALY Doug Biber 132 Sierra Bonita Avenue Pasadena, CA 91006 Janusz S. Bien Institute of Informatics Warsaw University PKiN p.850 PL-00 901 Warszawa, POLAND Marie A. Bienkowski EE&CS Department, U-157 University of Connecticut Storrs, CT 06268 Alan W. Biermann PO Box 2425 Chapel Hill, NC 27514 Meyer Billmers Digital Equipment Corporation 200 Forrest Street (MR01-1/M2) Marlboro, MA 01752 Jean-Louis Binot 35 Quai du Longdoz B4020 Liege, BELGIUM H. Andrew Black Inst. Linguistica de Verano Casilla 2492 Lima, 100 PERU John B. Black Psychology Yale University Box 11A Yale Station New Haven, CT 06520 Glenn David Blank 101 I Eagle Heights Madison, Wl 53705 Richard Blasdell 5467 Vanderbilt Mobile, AL 36608 Tom Blenko Computer Science University of Rochester Rochester, NY 14627 a. Scott Blois 50 Chumasero, Apt 11-K San Francisco, CA 94132 Eugene Blum 4 Seagull Lane Port Washington, NY 11050 iichal Blumenstyk 1-29A Virginia Drive Fairlawn, NJ 07410 Robert J. Bobrow Bolt Beranek and Newman 50 Moulton Street Cambridge, MA 02238 Daniel G. Bobrow Xerox PARC 3333 Coyote Hill Road Palo Alto, CA 94304 Julian E. Boggess, III & Lois C. Boggess Star Route, Box 220-6 Columbus, MS 39701 W. Mark Boggs Computer Science Carnegie-Mellon University Pittsburgh, PA 15213 Branimir Boguraev Computer Laboratory Cambridge University Corn Exchange Street Cambridge, CB2 3QG, ENGLAND Christian Boitet GETA, CNRS ERA 293 BP 68, Domaine Universitaire F-38402 St. Martin d'Heres FRANCE Roger Boivin 5482 18e Avenue Montreal, Que, CANADA H1X 2P4 Leonard Bolc Institute of Informatics Warsaw University PKiN p.850 PL-00 901 Warsaw, POLAND Veronica Bonebrake Rt.3, Box 235B Leander, TX 78641 Alain Bonnet ADEC/ENST Departement Informatique 46 rue Barrault F-75634 Paris cedex 13, FRANCE John G. Bordie 14454 Merriltown Road Round Rock, TX 78664 Maria Christina Borges New York University 251 Mercer Street, Room 507 New York, NY 10012 Colin Hugh Borland African Languages University of Cape Town 7700 Rondebasch REPUBLIC OF SOUTH AFRICA Jan Borota Ceskomalinska 17 CS-160 O0 Praha 4 CZECHOSLOVAKIA Volodya Borschchev ul. Tallinskaya, d.2, kv.156 SU-123458 Moscow, USSR Steven Bossie Computer Sciences Laboratory Texas Instruments MS 238, PO Box 226015 Dallas, TX 75266 Beth Antoinette Bottos Computer Science Carnegie-Mellon University Pittsburgh, PA 15213 Laurent Bourbeau 1501 Ducharme Avenue Outremont Montreal, Que, CANADA H2V 1G2 Goerge F. Bowie, III 1820 South Alston Avenue Durham, NC 27707 Ronald Jay Brachman Artificial Intelligence Lab. Fairchild Research & Development 4001 Miranda Avenue, MS 30-888 Palo Alto, CA 94304 Deanna Bradshaw 1702 W. Clark Champaign, IL 61820 Frank Roberts Brandon 709 W. 9th Street Quanah, TX 79252 Jana Branicka Lomnicka 4/1 CS-949 01 Nitra CZECHOSLOVAKIA Stefano Breccia Scuola Superiore G.R.Romoli strada prov di Coppito, Kn 0,3 1-67010 Coppito (AQ), ITALY Jeutonne P. Brewer Arts and Sciences Univ. North Carolina Greensboro, NC 27412 Victor Briabrin Computer Center Academy of Sciences of USSR 40 Vavilova Street SU-117333 Moscow, USSR Steve Brich NCR Corporation Corporate R&D, WHQ-5E Dayton, OH 45479 Victoria R. Bricker Anthropology Tulane University New Orleans, LA 70118 Peter Bright Aerospace Corporation PO Box 92957-M1-114 Los Angeles, CA 90009 David Brill System Development Corporation MD 72-27 2500 Colorado Avenue Santa Monica, CA 90406 Daniel Brink English Arizona State University Tempe, AZ 85287 Barry J. Brinkman Battelle Columbus Division 505 King Avenue Columbus, OH 43201 Ted Briscoe Linguistics Sidgwick Avenue University of Cambridge Cambridge, CB2 3QG ENGLAND E. A. Briss 907 Varsity Avenue Columbus, OH 43221 Benny Brodda Institute of Linguistics University of Stockholm S-109 91 Stockholm, SWEDEN Florian Brody Schottenfeldgasse 20/7 A-1070 Wien, AUSTRIA Philip D. Brooke 59 Beacon Street Boston, MA 02108 JoAnn M. Brooks 332 S. Silver Lane Sonderland, MA 01375 Ruven Brooks ITT Advanced Technology Center 1 Research Drive Shelton, CT 06484 John S. Bross 604 Howard Road West Chester, PA 19380 Brian J. Brown Gamle Kongevei 148 N-3000 Drammen, NORWAY E. K. Brown Language and Linguistics University of Essex Wivenhoe Park Colechester CO4 3SQ, ENGLAND Gretchen P. Brown Computer Corp. of America 4 Cambridge Center Cambridge, MA 02142 Mark Brown 3255 Descanso Drive Los Angeles, CA 90026 Charles Browne 428 Estante Way Los Alarnos, NM 87544 Nils C. Brubaker 12643 Black Saddle Lane Germantown, MD 20874 Computational Linguistics, Volume 10, Number 1, Janury-March 1984"]},{"title":"59 The","paragraphs":["FINITE STRING Newsletter 1983 ACL Membership List Bertram C. Bruce Bolt Beranek and Newman 50 Moulton Street' Cambridge, MA 02238 Robert i. Bryan Mathematics Nebraska Wesleyan University Lincoln, NE 68504 Ernst Buchberger Medical Cybernetics University of Vienna Freyung 6 A-1010 Vienna, AUSTRIA Fridolin Buechel Birmannstrasse 7 CH-4055 Basel, SWITZERLAND Erik Bugge Recau NY Munkegade DK-8000 Aarhus, DENMARK Harry Bunt Computational Linguistics Research Unit Tilburg University, POB 90153 NL-5000 LE Tilburg NETHERLANDS Henry G. Burger The Wordtree 7306 Brittany Merriam, KS 66203 John F. Burger 21173 W. Hillside Drive Topanga, CA 90290 Edward I. Burkart English Language Institute The American University Washington, DC 20016 James R. Burman 723 W. Maryland Avenue St. Paul, MN 55117 Nancy Burns 404-A Buena Vista Austin, TX 78746 Roberto Busa, SJ CAAL Aloisianum 21013 Gallarate, ITALY Alan Buseman JAARS Box 248 Waxhaw, NC 28173 Clifton H. Butcher Steward Towers 705 200 Fort Meade Road Laurel, MD 20707 Roy J. Byrd IBM TJ Watson Research Center PO Box 218 Yorktown Heights, NY 10598 Nicoletta Calzolari via Tevere 17 1-56100 Pisa, ITALY Fred Cameron Access Centers Inc. 3000 Scott Blvd, Suite 109 Santa Clara, CA 95050 J. Campbell 6015 Oakland Ave So Minneapolis, MN 55417 Enrique J. Cansino PO Box 710 Bacolod City 6001 Philippines Richard Cantone Navy AI Center NRL- Code 7510 Washington, DC 20375 Amadeo Cappelli Via C. Battisti 35/A 1-56100 Pisa, ITALY Sandra Carberry 50 Darien Road Newark, DE 19711 Jaime G. Carbonell Computer Science Carnegie-Mellon University Pittsburgh, PA 15213 Elizabeth Carlock 105 Carteret Court Clemson, SC 29631 Frank C. Carman/ll liT Advanced Technology Center One Research Road Shelton, CT 06484 Homer C. Carney Carney Associates, Inc. 6000A West Broad Street Richmond, VA 23230 Marillyn L. Carney The Computer Company 1905 Westmoreland Street PO Box 6987 Richmond, VA 23230 Hardy Carroll 618 Axtell St. Kalamazoo, MI 49008 John Carroll Computer Laboratory Cambridge University Corn Exchange Street Cambridge CB2 3OJ, ENGLAND John B. Carroll 409 Elliott Road Chapel Hill, NC 27514 David Carter University of Cambridge Computer Laboratory Corn Exchange Street Cambridge CB2 3QG, ENGLAND Jim Carter Computational Sciences University of Saskatchewan Saskatoon, Saskatchewan CANADA S7N 0W0 Patrick Cassidy 735 Belvidere Avenue Plainfield, NJ 07062 Christiano Castelfranchi Via dei Monti Tiburtini 509 1-00157 Roma, ITALY Maria Luigia Ceccotti Istituto di Linguistica Computazionale Via della Faggiola 32 1-56100 Pisa, ITALY Mats Cedvall Datalogilaboratoriet Sturegatan 2B S-75223 Uppsala, SWEDEN Stefano A. Cerri Dipartmento di Informatica University of Pisa Corso Italia 40 1-56100 Pisa, ITALY Stephen W. Chan 325 Casitas Avenue San Francisco, CA 94127 Steve Chandler English University of Idaho Moscow, ID 83843 B. Chandrasekaran 2053 luka Avenue Columbus, OH 43201 Wei-Hsing Chang 4142 Cranford Circle San Jose, CA 95124 Paul G. Chapin Linguistics Program National Science Foundation Washington, DC 20550 Gene B. Chase Messiah College Grantham, PA 17027 Chin-Chuan Cheng Linguistics University of Illinois 707 S. Mathews Avenue Urbana, IL 61801 Daniel Chester Computer & Information Science University of Delaware Newark, DE 19711 David N. Chin 5300 Van Fleet Avenue, No.4 Richmond, CA 94804 Martin S. Chodorow 218 E. 74th Street, Apt.5R New York, NY 10021 Key-Sun Choi Computer Science Korean Adv Inst Sci & Technol PO Box 150 Chongyang Seoul, KOREA Maxim Chomyakov Avangardnaya ul. 14, kv.5 SU-125493 Moscow, USSR Thomas Christaller Research Unit for IS and AI University of Hamburg Mittelweg 179 D-2000 Hamburg 13 W. GERMANY Wei-Hang Chu Solo Systems 3025 Orchard Parkway San Jose, CA 95134 Kenneth W. Church Bell Laboratories, 2D-518 600 Mountain Avenue Murray Hill, NJ 07974 Mark Clardy 20745 Zuni Road Apple Valley, CA 92307 Douglas Clark, Jr. 23765 Calla Azorin Mission Viejo, CA 92692 Dee L. Clayman Classics Department Brooklyn College, CUNY Brooklyn, NY 11210 William Cline Foreign Languages Alexander Hall East Michigan University Ypsilanti, MI 48197 Joel Cohen Mathematics & Computer Science University of Denver Denver, CO 80208 Philip R. Cohen Fairchild Lab for AI Research M/S 30-888 4001 Miranda Way Palo Alto, CA 94304 Robert Cohen Condor Computing Corporation 28832 Shody Lane Laguna Beach, CA 92651 Robin Cohen 224 St. George Street, No.302 Toronto, Ontario CANADA M5S 1A7 John Colarusso Anthropology McMaster University 1280 Main Street West Hamilton, Ont, CANADA L8S 4L9 Robert R. Cole 5707-C Harpers Farm Raod Columbia, MD 21044 D. Wells Coleman Linguistics University of Texas at El Paso El Paso, TX 79968 Grant M. Colvin 1220 Waldron Avenue St. Louis, MO 63130 M.J. Connolly 50 Tarleton Road Newton Center, MA 02159 Chantal Contant 3110 Ed-Montpetit App. 15 Montreal, Quebec CANADA H3T 1J9 A. Conway Psychology University of Bristol 8-10 Berkley Square Bristol BS8 1HH, ENGLAND Henry R. Cook 5611 Catoctin Ridge Drive Mt. Airy, MD 21771 David Cooper 143 Magnolia Avenue Millbrae, CA 94030 Gary Cooper 2501 Hilgard Berkeley, CA 94709 Robin Cooper Linguistics, 1128 Van Hise 1220 Linden Drive University of Wisconsin Madison, WI 53705 David Copp 74 Sussex Avenue Morristown, NJ 07960 Francisco Corella Symantec 306 Potrero Avenue Sunnyvale, CA 94086 Marcel CorM Eq. Informatique Linguistique Universite Paris VII, Tr Cntrl 2 PI Jussieu, 8e Etage F-75251, Paris cedex 05 FRANCE Sally Cordes Burroughs Corporation Terminal Systems Group/ASDO 11010 Roselle Street San Diego, CA 92121"]},{"title":"60 Computational Linguistics, Volume 10, Number 1, Janury-March 1984 The","paragraphs":["FINITE STRING Newsletter 1983 ACL Membership List Daniel W. Corwin Wang Laboratories One Industrial Avenue Lowell, MA 01851 John Josef Costandi PO Box 29 Pacific Grove, CA 93950 G.D.L. Costin Summer Inst. of Linguistics 7500 West Camp Wisdom Road Dallas, TX 75236 Garrison W. Cottrell Computer Science University of Rochester Rochester, NY 14627 Karen Courtenay 67 Bartlett Street Andover, MA 01810 Carl Covell PO Box 97 Somerville, MA 02143 James Reid Cowie 235A East Clyde Street Helensburgh G84 7AY, SCOTLAND Edward J. Coyne 4600 Connecticut Avenue--207 Washington, DC 20008 David J. Cranmer 14 Lakeside Circle Riverside, RI 02915 James M. Cretsos Merrell Dow Pharmaceuticals 2110 East Galbraith Road Cincinnati, OH 45242 Jim Critz 3275 Kipling Street Palo Alto, CA 94306 Robert E. Cromack 15 Glenn Street Cortland, NY 13045 Donald E. Crook Burroughs Corporation 4820 Adohr Lane Camarillo, CA 93010 George R. Cross Computer Science Louisiana State University Baton Rouge, LA 70803 J. Norwood Crout Artificial Intelligence Corp. 100 Fifth Avenue Waltham, MA 02254 Roberto Armino Cuervo Conde de Aranda 21 Madrid 1, SPAIN David Curran 30 West 39th Avenue Vancouver, BC CANADA V5Y 2N9 Steven Cushing 90 Bynner Street, No. 4 Jamaica Plain, MA 02130 W.R. Cyre 9955 Alabama Road Bloomington, MN 55438 Zbigniew Czech Computer Science Institute Silesian Technical University PstrowskJego 16 PL-44 100 Gliwice, POLAND Bruce D'Ambrosio 2156 Ward Street, No,4 Berkeley, CA 94705 Deborah A. Dahl Linguistics University of Pennsylvania 619 Williams Hall CU Philadelphia, PA 19104 Hartvig Dahl Box 88 Downstate Medical Center 450 Clarkson Avenue Brooklyn, NY 11203 Veronica Dahl Computer Science Simon Fraser University Burnaby, BC, CANADA V5A 1S6 David Dahlbacka 301 Country Fair Drive, Apt.60 Champaign, IL 61821 Ingetraut Dahlberg Woogstrasse 36a D6000 Frankfurt 50 W. GERMANY Kathleen Dahlgren Pitzer College Claremont, CA 91711 Brian Dalio 71 Keene Street Providence, RI 02906 Fred J. Damerau Nash Road Purdys, NY 10578 Art Dana 1670 El Camino Real Menlo Park, CA 94025 William J. Daniels 43 Maple Leaf Circle Penfield, NY 14526 Douglas D. Dankel, II CIS - 512 Well Hall University of Florida Gainsville, FL 32611 Mark David 77 Francis Avenue Cambridge, MA 02138 James E. Davidson Teknowledge 525 University Avenue Palo Alto, CA 94301 Carol C. & James S. Davis 6583 Brock Street Dublin, OH 43017 Patrick A. Davis 218 Christopher Street Montclair, NJ 07042 Paul H. Davis 640 Anderson Boulevard Geneva, IL 60134 Thomas F. Deahl 815 Carpenter Lane Philadelphia, PA 19119 Richard C. DeArmond Linguistics Simon Fraser University Burnaby, BC, CANADA V5A lS6 Dennis M. deChampeaux ADAC Laboratories 2424 Hellyer Avenue San Jose, CA 95138 Nan Decker 25 Surrey Cambridge, MA 02138 Edward DeGregorio Country Drive, RFD Kenyon, RI 02836 Natalie & Joseph Dehn 15 Ruby Road West Haven, CT 06516 Rodolfo Del Monte Dipartimento di Scienze Ambientali - Santa Maria Universita di Venezia Venezia, ITALY Marc T. M. DeMey Logika en Kennisleer Rijksuniversiteit Gent Blandijnberg 2 9000 Gent, BELGIUM Anne DeRoeck 13 Alma Street Wivenhoe, Colchester Essex, ENGLAND Jean-Pierre Devaud 3918 North Fremont Chicago, IL 60613 Henrietta DeVeer 752 West End Avenue, No.14F New York, NY 10025 William DeVries 37 Carl Street San Francisco, CA 94117 Kieren Devine Computer Science Queens University Belfast BT7 1NN NORTHERN IRELAND David Dewan 24 Manchester Road Newton Highlands, MA 02161 Simon Dickens Logica UK Ltd. 68 Newman Street London W1A 4SE, ENGLAND Colleen Diegnan GTE Systems Western Division 100 Ferguson Drive PO Box 7188, M/C B213 Mountain View, CA 94039 Cay Dietrich IBM TJ Watson Research Center PO Box 218 Yorktown Heights, NY 10598 Martin Dillon Library Science Univ. of North Carolina Chapel Hill, NC 27514 Michael DiLoreto Merrie Computing Company 21632 Glen Peak Cove Diamond Bar, CA 91765 Michael R. Dilts 9 Melrose Street Arlington, MA 02174 Mauro diManzo Istituto di Elettrotecnica Viale Causa 13 1-16145 Genova, ITALY David A. Dinneen French & Italian University of Kansas Lawrence, KS 66045 John Dinsmore Computer Science Southern Illinois University Carbondale, IL 62901 Wayne R. Dobson 6362 Douglas Street West Vancouver, BC CANADA V7W 2E9 David C. Dodson 68 Appledore Avenue Wollaton, Nottingham NG8 2RW ENGLAND John M. Doherty 1240 Wisteria Drive Ann Arbor, MI 48104 John Donald 1409 Viejas View Lane Alpine, CA 92001 Cameron Donaldson Harris Corporation, Government Information Systems Division PO Box 9800 Melbourne, FL 32901 Gerard F. Donlon, Jr. 2 Morrison Court Cambridge, MA 02140 Bonnie J. Dorr 84 Hillside Avenue Arlington, MA 02174 Cynthia Ann Dorsey 12572 Argyle Drive, Rossmoor Los Alamitos, CA 90720 Tamas E. Doszkocs 9627 Lawndale Drive Silver Spring, MD 20901 Ray C. Dougherty 100 Bleecker Street, 27A New York, NY 10012 Robert J. Douglass Computer User Services-MS B296 Los Alamos National Laboratory Los Alamos, NM 87545 Linn H. Downs Burroughs Corporation Burroughs Place, No.2F51 Detroit, MI 48232 Terry Downs 63 Beechcroft Road Ipswich, Suffolk ENGLAND William P. Doyle 60 Pineapple Street, No.7H Brooklyn, NY 11201 Raimund Drewek Ernst Klett Corporate Planning Computational Linguistics Rotebuhlstrasse 77 D-7000 Stuttgart 1, W. GERMANY Stephen Drucker 5577 Taft Avenue Oakland, CA 94618 Arthur G. Duncan General Electric • Corporate R&D Schenectady, NY 12345 George S. Dunham 3840 Harrison St. Washington, DC 20015 Frank Dunn 3714 Holt Austin, TX 78749 Richard P. Duran Educational Testing Service Princeton, NJ 08541 Aldo Duro via F. Nicolai, 91 1-00136 Roma, ITALY Don Dwiggins Logicon OSD 21031 Ventura Blvd Woodland Hills, CA 91364 Computational Linguistics, Volume 10, Number 1, Janury-March 1984"]},{"title":"61","paragraphs":["The FINITE STRING Newsletter 1983 ACL Membership List Marc Dymetman Artificial Intelligence Center SRI International Menlo Park, CA 94025 Dean Earnest Burroughs Corporation 3519 West Warner Santa Ana, CA 92704 Caroline a. Eastman Computer Science & Engineering Southern Methodist University Dallas, TX 75275 M.N. Easton PO Box 895 West Acton, MA 01720 H. P. Edmundson Computer Science University of Maryland College Park, MD 20742 Mats Eeg-Olofsson Lilla Sigridsgatan 1 S-223 50 Lund, SWEDEN Jurgen Ehlers Libellenweg 9 D 7000 Stuttgart 80 W. GERMANY Susan Ehrlich Wang Laboratories One Industrial Avenue Lowell, MA 01851 Kurt Eiselt Information & Computer Science University of California Irvine, CA 92717 Marc Eisinger IBM France 49 rue Auguste Lancon F-75013 Paris, FRANCE Richard P. Ejzak 916 Ohio Court Carol Stream, IL 60188 Kerstin Severinson Eklundh Kummelnasvaegen 34 S-132 00 Saltsjo-Boo, SWEDEN \" Stig Eliasson Noreens vaeg 96 S-752 63 Uppsala, SWEDEN James Elkin 322 4th Street Brooklyn, NY 11215 Donald A. Elliott 5916 Bradley BIvd Bethesda, MD 20814 Jeremy EIIman 9 Ardern Road Manchester 8 M8 6WN, ENGLAND Robert S. Engelmore Teknowledge 525 University Avenue Palo Alto, CA 94301 Samuel S. Epstein Bell Communications Research 600 Mountain Avenue Murray Hill, NJ 07974 Mary S. Erbaugh Linguistics University of Oregon Eugene, OR 97403 Lars W. Ericson NYU Courant Institute 251 Mercer Street New York, NY 10012 Markus Erni Stockenstrasse 36 CH-8903 Birmensdorf SWITZERLAND Ross Errington S.I.L., Nasuli Malaybalay, 8ukidnon PHILIPPINES 8201 Dominique Estival 315 S. 46th Street, No.6 Philadelphia, PA 19143 John B. Eulenberg 1250 Daisy Lane East Lansing, MI 48823 David A. Evans 5536 Beverly Place Pittsburgh, PA 15206 Roger Evans Graduate P/H Arts D University of Sussex Falmer, Brighton BN1 9QN ENGLAND Sandra Eveland IBM Dept. M76/F47 555 Bailey Avenue San Jose, CA 95150 iartha W. Evens 2026 Orrington Avenue Evanston, IL 60201 Catherine Exarhos 2524 Davison Avenue Richland, WA 99352 Joel L. Fagan 59G Hasbrouck Apartments Ithaca, NY 14650 Scott E. Fahlman 6410 Wilkins Avenue Pittsburgh, PA 15217 Leonard M. Faltz 2155 W. Farmdale, No.4 Mesa, AZ 85202 Michel Fanton 12 rue Montalivet F-75008 Paris, FRANCE AIM Farghaly Omnitrans Company 940 East Meadow Drive Palo Alto, CA 94303 Luciano F. Farina Romance Languages - Cunz 248 Ohio State University 1841 Millikin Road Columbus, OH 43210 Arthur i. Farley Computer Science University of Oregon Eugene, OR 97403 Christopher Farrar 1321 Virginia Avenue Columbus, OH 43212 Daniel C. Fass 5 De Vere Lane Wivenhoe, Colchester Essex CO7 9VV, ENGLAND Robin Fawcett 4 Windsor Crescent Radyr, Cardiff CF4 8AE, WALES Dianne L. Fecteau 805 Green Pond Road Rockaway, NJ 07866 James L. Felty Prime Computer, Inc. MS 10C-17 500 Old Connecticut Path Framingham, MA 01701 Robert S. Fenchel 339 Island Drive, No.4 Madison, Wl 53705 Giacomo & Irina Prodanof Ferrari Istituto di Linguistica Computazionale Via della Faggiola 32 1-56100 Pisa, ITALY Karel Fiala U mlyna 23 CS-141 00 Praha 4 CZECHOSLOVAKIA Nicholas Findler Computer Science Arizona State University Tempe, AZ 85287 Edward Finegan Linguistics, GFS 301 Univ. of Southern California Los Angeles, CA 90089 Linda Fineman 2752 Middleton Avenue, Apt.271 Durham, NC 27705 Timothy Finin Computer&Information Science University of Pennsylvania Philadelphia, PA 19104 Pamela K. Fink Southwest Research Institute 6220 Culebra Avenue San Antonio, TX 78284 Kathleen Finn 2718 N. Pershing Drive, No.3 Arlington, VA 22201 Louise B. Fish 83-43 118 Street Kew Gardens, NY 11415 Gene Fisher Information and Computer Science University of California Irvine, CA 92717 Gordon Fisher Mathematics & Computer Science James Madison University Harrisonburg, VA 22807 W. M. Fisher Texas Instruments MS 238 PO Box 226015 Dallas, TX 75266 Beatrice Fitter 3952 Pine Street Philadelphia, PA 19104 Hogan Flake Lane County Dept of Assessment and Taxation 3550 W. Amazon Drive, Apt.3 Eugene, OR 97405 Margaret i. Fleck Box 301, Village Hill Road Williamsburg, MA 01096 Charles R. Fletcher Psychology University of Colorado Boulder, CO 80309 Thaddeus P. FIoryan, Jr. 1522 Wistaria Lane Los Altos, CA 94022 Margot Flowers & Michael Dyer 3532 Boelter Hall University of California Los Angeles, CA 90024 Kathleen Flynn Linguistics Univer. Southern California Los Angeles, CA 90007 A. Dean Forbes 820 Loma Verde Avenue Palo Alto, CA 94303 Jean-Marie Fortin Banque de terminol, du Quebec Office de la langue francaise 700, boul. Saint-Cyrille Est Quebec, CANADA G1R 5G7 Elaine Fossati Box 70607 Sunnyvale, CA 94088 Carol L. Foster 2033 Greenwood Place Huntsville, AL 35802 John Fought Linguistics 609 Williams HalI/CU University of Pennsylvania Philadelphia, PA 19104 Fumi Fowells 1979 Jeanette Drive Pleasant Hill, CA 94523 Edward A. Fox 203 Craig Drive Blacksburg, VA 24060 Samuel Fox 6708 N. Seeley Chicago, IL 60645 Gert K. Frackenpohl Inst fuer deutsche Sprache Postfach 5409 D-6800 Mannheim 1 W. GERMANY Robert France 902 E. Franklin, No.3 Chapel Hill, NC 27514 Stephen Frank 7437 Kathydale Road Baltimore, MD 21208 Dick H. Fredericksen 77 Jefferson Avenue White Plains, NY 10606 Robert Frederking Computer Science Carnegie-Mellon University Pittsburgh, PA 15213 Michael W. Freeman R&D/SDC Burroughs Corporation PO Box 517 Paoli, PA 19301 Michael J. Freiling Tektronix Corporation, 50-662 PO Box 500 Beaverton, OR 97077 Eric D. Frey Chestnut Hill Road Amherst, NH 03031 Werner Frey Keplerstrasse 17 Institut fuer Linguistik/ROM D-7000 Stuttgart 1, W. GERMANY"]},{"title":"62 Computational Linguistics, Volume 10, Number 1, Janury-March 1984 The FINITE STRING Newsletter 1983 ACL Membership","paragraphs":["List Barbara Friberg SIL - Kotak Pos 164 Ujung Pandang Sulawesi Selatan INDONESIA Joyce Friedman 221 Mt. Auburn Cambridge, MA 02138 Alan Frisch School of Social Science University of Sussex Brighton BN1 9QN, ENGLAND David Frost Psychology Middlesex Hospital Mortimer Street London Wl, ENGLAND Rebecca i. Frumkina Institute of Linguistics Academy of Sciences of USSR Semashko 1/12 SU-103009 Moscow, USSR Kazuhiro Fuchi ICOT Mita Kokusai Bldg 21F 4-28 Mita 1-chome Minato-ku Tokyo 108 JAPAN Osamu Fujimura Bell Laboratories, 2D-545 Murray Hill, NJ 07974 Tetsunosuke Fujisaki IBM Japan, Japan Science Inst. No. 36 Kowa Building 5-19 Sanbancho, Chiyoda-ku Tokyo 102, JAPAN Judith W. Fuller 723 Upper Johnson Circle St. Peter, MN 56082 Thomas W. Fuller CHI Systems, Inc. 100 Edward Burns Place Goleta, CA 93117 Mike Fullingim Wesleyan Mission - Alia Box 21 Pangia, SHP Papua, NEW GUINEA Francesca Fusconi Ufficio RRL-Elsag SpA Via Hermada 6-Sestri Pon 1-16154 Genoa, ITALY Brian R. Gaines Computer Science York University 4700 Keele Street Downsview, CANADA M3J 1P3 Oliver Gajek Linguistics University of Texas Austin, TX 78712 Annie Gal 5611 Northfield Road Bethesda, MD 20817 Janine Gallais-Hammond 20 avenue Reille F-75014 Paris, FRANCE Patricia Galloway Mississippi Department of Archives & History PO Box 571 Jackson, MS 39205 Anne v.d.L. Gardner 286 Selby Lane Atherton, CA 94025 B. J. Garner Computing and Mathematics Deakin University Victoria 3217, AUSTRALIA Curtis W. Garrett 6918 Wildwood Court Indianapolis, IN 46268 Leanna Gaskins 10149 Cass Place Cupertino, CA 95014 Michael K. Gavin Computer Science Box 1910 Brown University Providence, RI 02912 Jean-Claude Gavrel Convergent Technologies, Inc. 220 Laurier Ave West, Ste 740 Ottawa, Ontario CANADA K1P 5Z9 Jean Mark Gawron Artificial Intelligence University of Edinburgh Hope Park Square, Meadow Lane Edinburgh EH8 9NW, SCOTLAND Gerald Gazdar Social Science, Art Building University of Sussex Falmer, Brighton BN1 9QN ENGLAND Manfred Gehrke Fachbereich Informatik Universitaet Hamburg Rothenbaumschaussee 67-69 D-2000 Hamburg 13, W. GERMANY Dedre Gentner Bolt Beranek and Newman 50 Moulton Street Cambridge, MA 02238 J. Germain Webber College Babson Park, FL 33827 Febo-Basilio Ghicopoulos Facolta di Lettere Dipartimento di Italiano Universita di Salonicco Thessaloniki, GREECE Helen Gigley Computer Science University of New Hampshire Durham, NH 03824 W. Gillespie & Jill Quirk PO Box 232 Monarch, Alberta CANADA T0L 1M0 Allesandro Giorgi Istituto Psicologica, CNR Via dei Monte Tiburtini 509 1-00157 Roma, ITALY Philip Gleason 209 Vassar Street Rochester, NY 14607 Peter Glickert 140 Twelfth Street SE Washington, DC 20003 Bonnie Glover 1314-1/4 Barrington Avenue Los Angeles, CA 90025 Kurt Godden Computer Science General Motors Research Labs Warren, MI 48090 Randy G. Goebel Computer Science University of Waterloo Waterloo, Ontario CANADA N2L 3G1 Harold Goldberger 19 rue Charles V F-75004 Paris, FRANCE Richard S. Goldhor Intelligent Designa 100 Fairview Avenue Belmont, MA 02178 Neil M. Goldman USC-ISI 4676 Admiralty Way Marina del Ray, CA 90291 Fernando Gomez Computer Science University of Central Florida Orlando, FL 32816 Carolyn J. Gongwer 309 Clara Peoria, IL 61614 Bradley A. Goodman Bolt Beranek and Newman 10 Moulton Street, Dept. 45 Cambridge, MA 02238 James W. Goodwin Computer & Information Science Linkoeping University S-581 83 Linkoeping, SWEDEN Kenneth Goodwin 77 Brookwood Road Mercerville, NJ 08619 Daniel B. Gordon 2066 Ashton Avenue Menlo Park, CA 94025 Reena Beth Gordon 40 Ocean Parkway Brooklyn, NY 11218 Letizia Gori Piazza Magenta 49 1-57100 Livorno, ITALY George Gosline 1514 35th Avenue Seattle, WA 98122 Kathleen M. Goudie Texas Instruments PO Box 10508, MS 5739 Lubbock, TX 79408 James Gough, Jr. Information&Computer Science Georgia Inst. of Technology Atlanta, GA 30332 Philip B. Gough Psychology University of Texas Austin, TX 78712 Arthur C. Graesser Psychology California State University Fullerton, CA 92634 iadeleine Graitson NIH/DCRT, 12A-3043 9000 Rockville Pike Bethesda, MD 20014 Michael M. Granaas 426 Fraser Hall University of Kansas Lawrence, KS 66045 Robert Granville 14 Bond Street Boston, MA 02118 Cordell Green Kestrel Institute 1801 Page Mill Road Palo Alto, CA 94304 Peter Greene 15 Martha Lane Evanston, IL 60201 Steven L. Greenspan Cognitive Science, C-015 University of California at San Diego La Jolla, CA 92093 Patrick Griffith 102 Glebe Avenue Ottawa, Ontario CANADA K1S 2C3 Joseph E. Grimes DMLL - Morrill Hall Cornell University Ithaca, NY 14853 Ralph D. Grishman Computer Science New York University 251 Mercer Street New York, NY 10012 Ralph E. Griswold Computer Science University of Arizona Tucson, AZ 85721 Kevin Gross 54 Breck Avenue Brighton, MA 02135 Louis Gross 28 Russell St. Arlington, MA 02174 iaurice Gross Universite de Paris VII, LADL 2 Place Jussieu F-75231 Paris Cedex 05 FRANCE Barbara J. Grosz Artificial Intelligence Center SRI International Menlo Park, CA 94025 Alexander Gruz 263 Congressional Lane Apt.210 Rockville, MD 20852 Luis F. Guadarrama Apartado Postal 22-424 Mexico City 22, D.F. MEXICO Franz Guenthner Englisches Seminar Universitaet Tuebingen Wilhelmstr, 50 D-7400 Tuebingen, W. GERMANY Giovanni Guida Politecnico di Milano Piazza Leonardo da Vinci, 32 1-20133 Milano, ITALY Raymond Guindon Psychology University of Colorado Boulder, CO 80309 Samuel L. Gulden 108C Christmas-Saucon No.14 Computing&Information Science Lehigh University Bethlehem, PA 18015 Andrew Gullen Computer Science University of Toronto Toronto, CANADA M5S 1A4 Computational Linguistics, Volume 10, Number 1, Janury-March 1984"]},{"title":"63 The FINITE STRING Newsletter 1983 ACL Membership","paragraphs":["List Mary Ann & Raymond D. Gumb Computer Science Calif. State Univ. Northridge 18111 Nordhoff Street Northridge, CA 91330 Takao Gunji Language and Culture Osaka University 1-1 Machikaneyama-cho, Toyonaka-shi, Osaka 560, JAPAN Michael D. Gunther IBM Corporation 201 Perry Parkway, Suite 4 Gaithersburg, MD 20877 Cheng-aing Guo 5 Maple Street Athens, OH 45701 Norman Haas 3485 Alameda 4 Menlo Park, CA 94025 Robert A, Haas Bolt Beranek and Newman 10 Moulton Street Cambridge, MA 02238 Christopher Habel Bleibtreustr, 36A D-1000 Berlin 15, W. GERMANY Carole D. Hafner Computer Science General Motors Research Laboratory Warren, MI 48090 Dorothea Robin Haines Box 1170 2000 Center Street Berkeley, CA 94704 Eva Hajicova Hvozdnicka 1049 CS-100 00 Praha 10 CZECHOSLOVAKIA Austin Hale Summer Inst. of Linguistics PO Box 2270 Metro Manila, PHILLIPINES Per-Kristian Halvorsen Xerox PARC 3333 Coyote Hill Road Palo Alto, CA 94304 Russell Ham Information International Inc. 5933 Slauson Avenue Culver City, CA 90230 Henry Hamburger Mathematical Science George Mason University 4400 University Drive Fairfax, VA 22030 Bruce Hamilton 213 Moonstone Manhattan Beach, CA 90266 John R. Hammen PO Box 12931 Seattle, WA 98111 David Hammond PO Box 894 Belvedere, CA 94920 Lindsey Elizabeth Hammond Centre for Computational Linguistics UMIST, PO Box 88 Manchester M60 1QD, ENGLAND Sally Handy-Zarnstorff Bell Laboratories 101 J.F. Kennedy Parkway Short Hills, NJ 07678 Barbara F. Hanson 1340 Shasta Avenue San Jose, CA 95126 Peter Harasym Office of Medical Education University of Calgary 3330 Hospital Drive NW Calgary, Alta, CANADA T2N 4N1 Shoshana Hardt Computer Science SUNY Buffalo 4226 Ridge Lea Rod Amherst, NY 14226 Brian Harris School Translators & Interpr. University of Ottawa Ottawa, Ontario CANADA K1N 6N5 Larry Harris Artificial Intelligence Corp. 100 W. Fifth Street Waltham, MA 02254 Marion O. Harris Oak Street Morristown, NJ 07960 Mary Dee Harris Mathematical Sciences Loyola University New Orleans, LA 70125 Steven D. Harris RFD 1, Box 343 Riner, VA 24149 Betty i. Hart 1903 North 77th Street Kansas City, KS 66112 Steven Hartman 1442 Gary Drive Carbondale, IL 62901 David Hartzband Digital Equipment Corporation ZK02-2/N59 110 Spit Brook Road Nashua, NH 03062 T.C. Hasler 11 Priory Walk London SW10 9SP ENGLAND Bill Hasling 1030 P Castleton Terrace Sunnyvale, CA 94087 Christa Hauenschild SFB 99 - E2 Universitaet Konstanz Postfach 5560 D-7750 Konstanz, W. GERMANY Jostein H. Hauge Bergen Universitetet Harald Harfagresgt. 31 PO Box 53 N-5014 Bergen, NORWAY Hans Haugeneder Sebastianiplatz 14 D-8262 Neuotting W. GERMANY Philip J. Hayes Computer Science Carnegie-Mellon University Pittsburgh, PA 15213 Daniel G. Hays Psychology University of Alabama Huntsville, AL 35899 David G. Hays 25 Nagle Avenue, Apt 3-G New York, NY 10040 Benjamin D. Haytock Computer Science Allegheny College Meadville, PA 16335 Kolbjorn Heggstad University of Bergen Stromgatan 53 D-5000 Bergen, NORWAY George E. Heidorn IBM TJ Watson Research Center PO Box 218 Yorktown Heights, NY 10598 Wolfgang Heinz Delugstrasse 9/4/4 A-1190 Wien, AUSTRIA Hermann Helbig VEB Robotron PSF 330 8012 Dresden, GERMAN DEMOCRATIC REPUBLIC Gyorgy Hell BME, Nyelvi Intezet Muegyetern RKP H-1111 Budapest, HUNGARY Peter Hellwig Germanistisches Seminar Hauptstrasse 207-209 69 Heidelberg W. GERMANY David H. Helman Philosophy Case Western Reserve University Cleveland, OH 44106 Kozetta Henderson BBDO-Chicago 410 N. Michigan, 7th floor Chicago, IL 60611 Rufus S, Hendon 804 Still Hill Rd. Hamden, CT 06518 Gary G. Hendrix Symantec 306 Potrero Avenue Sunnyvale, CA 94086 Steve Herbst"]},{"title":"c/o","paragraphs":["Honeywell 4 Cambridge Center, 9th floor Cambridge, MA 02142 Robert Hertz English California State University Long Beach, CA 90840 Michael Hess AIIgemeine Sprachwissenschaft Plattenstrasse 54 CH-8032 Zurich, SWITZERLAND Arild Hestvik Utleirveien 35D N-7000 Trondheim, NORWAY Thomas T. Hewett Psychology Drexel University Philadelphia, PA 19104 Carl E. Hewitt MIT AI Laboratory, Room 813 545 Technology Square Cambridge, MA 02139 F. R. Higgins 3 Laurel Lane Amherst, MA 01002 Jim Hightower 4947 Browndeer Lane Rancho Palos Verdes, CA 90274 Archibald A.:Hill Box 8120 Univ. Station Austin, TX 78712 Jane C. Hill 135 Summer Street Amherst, MA 01002 Michael Hillinger TSC, A Houghton Mifflin Co. Box 683 Hanover, NH 03755 Donald M. Hindle Box 119 Greenwich, NJ 08323 Elizabeth A. Hinkelman 348 Ripplewood Drive Rochester, NY 14616 Daniel J. Hintz c/o Tom Dixon Route 1 Leon, KS 67074 Akihiro HiraM Systems Development Laboratory Hitachi, Ltd. 1099 Ohzenji Asao-ku Kawasaki 215, JAPAN Lynette Hirschman R&D Activity, FSSG Burroughs Corporation PO Box 517 Paoli, PA 19301 Graeme Hirst Computer Science University of Toronto Toronto, Ontario CANADA M5S 1A7 Nancy J. Hoar Main Street Haydenville, MA 01039 Jerry Hobbs Artificial Intelligence Center SRI International Menlo Park, CA 94025 Wolfgang Hoeppner University of Hamburg Mittelweg 179 D-2000 Hamburg 13 W. GERMANY Cecilie Anne Hoffman 2883 Kipling Palo Alto, CA 94306 Diane Hoffman 2580 S. University, No.903 Denver, CO 80210 Thomas R. Hofmann Faculty of Humanities Toyama University Gofuku Toyama, JAPAN 930 Douglas Hogan 13625 Middlevale Lane Silver Spring, MD 20906 64 Computational Linguistics, Volume 10, Number 1, Janury-March 1984 The FINITE STRING Newsletter 1983 ACL Membership List Alistair D. C. Holden Elec. Eng. Computer Sci. FT-10 University of Washington Seattle, WA 98195 C. W. Holeman 1160 Chase Avenue, No.3125 El Cajon, CA 92020 Lew Hollerbach John Wiley & Sons, Inc. Higher Education Group 605 3rd Avenue New York, NY 10158 Heather Holmback Max Planck Institute for Psycholinguistics Berg en Dalseweg 79 NL-6522 Nijmegen, NETHERLANDS William Holmes Biochemistry Washington Univ. Med. School 660 Euclid Avenue St. Louis, MO 63132 Se June Hong IBM TJ Watson Research Center PO Box 218, 31-206 Yorktown Heights, NY 10598 Jan Horecky Linguistic Institute Slovak Academy of Sciences Nalepkova 26 CS-800 00 Bratislava, CZECH. William C. Hornet 2110 D.H. Hill Library North Carolina State University, Box 5007 Raleigh, NC 27650 John Y. Hou Oriental Studies University of Arizona Tucson, AZ 85721 John M. Howie 503 Crestland Avenue Columbia, MO 65201 Xiuming Huang Cognitive Studies Centre University of Essex Colchester CO4 3SQ, ENGLAND Charles T. Huff Computer & Information Sciences Ohio State University 2036 Neil Avenue Columbus, OH 43210 D. Lynn Hughes 320 N. Murieta BIvd Livermore, CA 94550 Mary Hughes 4771 Berkeley Terrace, NW Washington, DC 20007 Michael N. Huhns Engineering Univ. of South Carolina Columbia, SC 29208 John Hulbert Hillside Lustleigh South Devon TQ13 9TH ENGLAND Jon Hull Computer Science SUNY Buffalo 4226 Ridge Lea Road Amherst, NY 14226 Christopher Hume 75 Pine Street Belmont, MA 02178 Susanne M. Humphrey 2123 Arcola Avenue Wheaton, MD 20902 Harold Huntley Telecommunications Sciences SRI International Menlo Park, CA 94025 Jeffrey F. Huntsman English Indiana University Bloomington, IN 47405 Patrick Alan Hutchinson Department of Computation UMIST, PO Box 88 Manchester M60 1QD, ENGLAND Ruth Hvidberg Computational Linguistics Uppsala University Sturegatan 13B (5 tr) S-75223 Uppsala, SWEDEN Eero Hyvonen Koivuviita 6A SF-02130 Espoo 13 FINLAND Nancy M. Ide Box 520 Vassar College Poughkeepsie, NY 12601 Peter Illing 1116 North Vine Denver, CO 80206 Pierre Isabelle 4405 Isabella, App.2 Montreal, Quebec CANADA H3T 1N5 Atsuko Isatsu Systems Development Laboratory Hitachi, Ltd. 1099 Ohzenji Asao-ku Kawasaki 215, JAPAN Arata Ishimoto Industrial Administration Science University of Tokyo Node, Chiba, 278 JAPAN David J. Israel Bolt Beranek and Newman 10 Moutton Street Cambridge, MA 02238 Vjaceslav Ivanov Academy of Sciences Trifonovskaya d.34 kv.262 SU-129110 Moscow, USSR Paul Jacobson 522 North Humphrey Oak Park, IL 60302 Harri Jappinen SITRA PO Box 329 SF-00121 Helsinki 12 FINLAND Lieven Jaspaert Torenhoflaan 67 B-3110 Rotselaar, BELGIUM Ronald A. Javitch PO Box 67 - Station H Montreal, Qua, CANADA H3G 2K5 Thomas L. Jenkins OMNITRANS 940 East Meadow Drive Palo Alto, CA 94303 Hanne Jensen IBM A/S 10 Vester Soegade, Room 320 DK-1646 Copenhagen V, DENMARK John Thayer Jensen PO Box 358 Yap, TT 96943 Karen Jensen IBM TJ Watson Research Center PO Box 218 Yorktown Heights, NY 10598 Jean-Claude Jequier 5201 Cote St. Antoine Montreal, Quebec CANADA H4A 1P2 Peter Jirku Biomathematics, Czechoslovak Academy of Sciences Videnska 1083 CS-142 20 Praha 4, CZECH. P. P. Joag Regional Computer Centre Poona University Campus Poona-411007, INDIA Bob Johnson Kirk Computer Systems Box 1976 Yellowknife, NWT CANADA X1A 2P5 David E. Johnson IBM TJ Watson Research Center PO Box 218 Yorktown Heights, NY 10598 Eric J. Johnson 3644 Partridge Path No.3 Ann Arbour, MI 48104 Eric Johnson 4737 SE 38th Avenue Portland, OR 97202 Roderick L. Johnson Centre for Computational Linguistics UMIST, PO Box 88 Manchester, M60 1QD, ENGLAND Ronald W. Johnson 6302 Wissahickon Ave Philadelphia, PA 19144 Samuel V. Johnson 1986 15th Street Troy, NY 12180 Phil Johnson-Laird MRC Applied Psychology Unit 15 Chaucer Road Cambridge CB2 2EF, ENGLAND Richard C. Johnston PO Box 925 Cotati, CA 94928 Philip H. Johnstone Modern Languages University of Bath Bath BA2 7AY, ENGLAND Nancy Jokovich Educational Development Center PO Box 2909, M/S 2201 Texas Instruments Austin, TX 78769 Mark A. Jones Computer Science SUNY Stony Brook Stony Brook, LI, NY 11794 Nine K. Jones Rt. 2, Box 2357 Stafford, VA 22554 Randall L. Jones Humanities Research Center 3060 JKHB Brigham Young University Provo, UT 84602 Baldur Jonsson Tomasarhaga 22 107 Reykjavik, ICELAND Larry i. Jordan 3122 Marwick Avenue Long Beach, CA 90808 Aravind & Susan Joshi Computer&Information Science R. 268, Moore School University of Pennsylvania Philadelphia, PA 19104 Mary Lu Joynes 6621 Bishop Drive Waco, TX 76710 Paul Juell Mathematical Sciences North Dakota State University Fargo, ND 58105 Brenda Jung-Hough 1575 Dorsey Lane San Jose, CA 95120 Zbigniew Jurkiewicz Institute of Informatics Warsaw University PKiN p.850 PL-00 901 Warszawa, POLAND Michael B. Kac Linguistics University of Minnesota 142 Klaeber Court Minneapolis, MN 55455 Ray Kajma 2223 Murray Hill, Apt.1 Cleveland, OH 44106 Panayota Kalamvoka 33 av Monterey 2163 Luxembourg Ville Luxembourg iarilyn A. Kalan 2815 Sore Center Road Willoughby, OH 44094 Iris a. Kameny 1029 Via De La Paz, No.328 Pacific Palisades, CA 90272 Ryotaro Kamimura 203 Eiwa Hanabatake Oho-Machi Tsukuba Gun Ibaraki, JAPAN Nitaya Kanchanawan Faculty of Humanities Ramkhamhaeng University Bangkok 10240, THAILAND Dorothea S. Kane 8819 E. Emperor San Gabriel, CA 91775 Constantine Keniklidis 918 President Street Brooklyn, NY 11215 Ronald M. Kaplan Xerox PARC 3333 Coyote Hill Rd. Palo Alto, CA 94304 S. Jerrold Kaplan Teknowledge 525 University Avenue Palo Alto, CA 94301 Hans Karlgren Kval Institute for Information Science Soedermalmstorg 8 S-104 65 Stockholm, SWEDEN Computational Linguistics, Volume 10, Number 1, Janury-March 1984"]},{"title":"65 The FINITE STRING Newsletter 1983 ACL Membership","paragraphs":["List Laenu A. Karp 214 Watchung Terrace Scotch Plains, NJ 07076 Kevin Karplus Electrical Engineering Phillips Hall Cornell University Ithaca, NY 14853 Lauri J. Karttunen Artificial Intelligence Center SRI International Menlo Park, CA 94025 Robert T. Kasper Computer Science 221 Angell Hall Ann Arbor, MI 48109 Boris Katz MIT AI Laboratory 545 Technology Square Cambridge, MA 02139 Derek Kaufman 3640 South 2175 East Salt Lake City, UT 84109 Henry A. Kautz Computer Science University of Rochester Rochester, NY 14627 Martin Kay Xerox PARC 3333 Coyote Hill Road Palo Alto, CA 94304 E. Robert Keller, II Renaissance Consulting RD 2- Box 386 Harvard, MA 01451 Robert Kelly 928 S. Casitas, Apt.D Tempe, AZ 85281 Gerard Kempen University of Nijmegen, Psych. Montessorilaan 3 NL-6525 HE, Nijmegen NETHERLANDS James Kenevan Computer Science Illinois Inst. of Technology Chicago, IL 60616 Robert Khan Challenge Systems, Inc. 1299 Commerce Drive Richardson, TX 75081 Tom R. Kibler Wang Laboratories One Industrial Avenue Lowell, MA 01851 Ferenc Kiefer Institute of Linguistics Hungarian Academy of Sciences Szentharomsag utca 2 H-1014 Budapest, HUNGARY iasato Kikuchi 1117 CL University of Pittsburgh Pittsburgh, PA 15260 James Kilbury Jansastrasse 7 D-1000 Berlin 44 WEST GERMANY Paul W. Kilpatrick English College Station University of Puerto Rico Mayaguez, PR 00708 Han-Kon Kim Language Research Institute Seoul National University San 56-1 Shinlim-dong Kwanak-ku, Seoul, 151, KOREA Jonathan J. King Symantec 306 Potrero Avenue Sunnyvale, CA 94086 Margaret King ISSCO 54 route des Acacias CH-1227 Geneva, SWITZERLAND Barbara Kipfer 60 Cornfield Road Milford, CT 06460 Robert S. Kirsner Germanic Languages 310 Royce Hall, UCLA Los Angeles, CA 90024 Richard I. Kittredge Linguistics University of Montreal Montreal, Quebec CANADA H3C 3J7 Judith Klavans IBM TJ Watson Research Center PO Box 218 Yorktown Heights, NY 10598 Ewan Klein School of Epistemics University of Edinburgh 2 Buccleuch Place Edinburgh EH8 9LW, SCOTLAND Louise H. Klein 550 Coventry Road Berkeley, CA 94707 Sheldon Klein Computer Science University of Wisconsin 1210 West Dayton Street Madison, WI 53706 David Kleinecke 2784 Glendessary Lane Santa Barbara, CA 93105 Paul Klingbiel Building 57, Apartment 5 2435 Sumatran Way Clearwater, FL 33575 Jerzy Kolendowski Srodowiskowe Centrum Oblicz. CYFRONET- KRAKOW Reymonta 4 PL-30 059 Krakow, POLAND Rodger Knaus 4977 Battery Lane, No.411 Bethesda, MD 20814 Jacqueline Knight 105 Waterside, Peartree Bridge Milton Keynes MK6 3DF ENGLAND Gerhard E. Knorz Fachbereich Informatik TechnischeHochschule Darmstadt Karolinenplatz 5 D-6100 Darmstadt, W. GERMANY Francis E. Knowles Modern Languages University of Aston Costa Green Birmingham B4 7ET, ENGLAND Beverly Knystautas 9516 Ewing Drive Bethesda, MD 20817 Hisashi Kobayashi Science Institute, IBM Japan 21 Mori Bldg 1-4-34 Roppongi, Minato-ku Tokyo, JAPAN 106 Sakir Kocabas 48 Norfolk Road London, E6, ENGLAND Dietrich Koch Zentralinst. f Kybernetik u Informationsprozesse AdW d DDR DDR-1086 Berlin GERMAN DEMOCRATIC REPUBLIC Dan D. Kogan System Development Corporation 2500 Colorado Avenue Santa Monica, CA 90406 Eva Koktova 9 Kvetna 1576 CS-390 01 Tabor CZECHOSLOVAKIA Janet L. Kolodner Information&Computer Science Georgia Inst. of Technology Atlanta, GA 30332 Johannes A.G.M. Koomen Computer Science Ray R. Hylan Building University of Rochester Rochester, NY 14627 Tatiana Korelsky & Zholkovsky 316 Eastwood Avenue Ithaca, NY 14850 Andras Kornai Computing Centre Academy of Sciences Pusztaszeri ut 72 H-1025 Budapest, HUNGARY iichiko Kosaka 28 Riverside Avenue Apt 3-G Red Bank, NJ 07701 Kimmo Koskenniemi Vaenrikki Stoolin katu 9 A 15 SF-00100 Helsinki 10 FINLAND Karen C. Kossuth Mason 217, Pomona College Claremont, CA 91711 Donald W. Kosy 182 W. Waldheim Road Fox Chapel, PA 15215 Ilona Koutny Furedi u. 52 IX/110 H-1144 Budapest, HUNGARY Juergen Krause FG Ling Informationswissensch Inst f AIIgemeine Sprachwiss Postfach 397 D-8400 Regensburg W. GERMANY Wolfgang E. Kreitmair Waldfriedhofstr. 5 D-8000 Muenchen 70 W. GERMANY Stuart J. Kretch 1428 Cedar Bluff St. Louis, MO 63011 Tillie Krieger 272 Halfway Tree Baton Rouge. LA 70810 Kerstin Kristoferson Valhallavaegen 137 S-115 31, Stockholm, SWEDEN Anthony S. Kroch Linguistics 618 Williams Hall University of Pennsylvania Philadelphia, PA 19104 Friedrich Krollman Bundessprachenamt Horbeller Strasse 52 5030 Huerth, bei Koeln W. GERMANY Jed Krohnfeldt 6834 Brookhill Drive Salt Lake City, UT 84121 Robert Jeffrey Krovetz 7400 Lakeview Drive, No.105 Bethesda, MD 20817 Gilbert K. Krulee Computer Sciences Northwestern University Evanston, IL 60201 Henry Kucera Slavic Languages Brown University Providence, RI 02912 Karen Kukich 520 Montview Place Pittsburgh, PA 15221 Olga S. Kulagina Institute of Applied Mathematics Miousskaja pl. 4 125047 Moscow A-47, USSR Susumu Kuno 47 Glendale Road Belmont, MA 02178 Arthur E. Kunst Comparative Literature 924 Van Hise Hall University of Wisconsin Madison, Wl 53706 Michel Kuntz 25 rue Gazan F-75014 Paris, FRANCE Juergen Kunze Zentralinst Sprachwissenschaft AdW der DDR, Bereich V Leipziger Strasse 3-4 DDR-108 Berlin, DDR Howard Kurtzman Psychology, El0 MIT Cambridge, MA 02139 Zofia Kurzowa Instytut Filologii Polskiej UJ Golebia 20 PL-31 007 Krakow, POLAND Yutaka Kusanagi Literature & Linguistics University of Tsukuba Sakura-mura Ibaraki 300-31, JAPAN Toshio Kushida Sakuragaw-a-ryo Hitachi-shi 213 Kokubu-cho Ibaraki 316, JAPAN Stan Kwasny Computer Science Indiana University 101 Lindley Hall Bloomington, IN 47405"]},{"title":"66 Computational Linguistics, Volume 10, Number 1, Janury-March","paragraphs":["1984 The FINITE STRING Newsletter 1983 ACL Membership List Tjoeliong Kwee General Linguistics University of Amsterdam Spuistraat 210 - III NL-1012 VT Amsterdam, NETH. C.D. Lackey PRC-GIS Box 330 Fort Monmouth, NJ 07703 William A. Ladusaw Linguistics University of Iowa Iowa City, IA 52242 M. Lafon E.D.F. 2 rue Louis Murat F-75384 Paris, Cedex 08 FRANCE Jacques E. LaFrance Mathematical Science Oral Roberts University Tulsa, OK 74171 Robin B. Lake SOHIO Research 4440 Warrensville Center Road Cleveland, OH 44128 Wilf Lalonde RR 2 Kinburn, Ontario CANADA K0A 2H0 Rolande i. Lamarche Universite de Montreal PPMF Primaire-Pavillon MtRoyal Case Postale 6128, Succ.A Montreal, Que, CANADA H3C 3J7 Charles Lamprey, Jr. 10 Patricia Court Gales Ferry, CT 06335 Herbert J. Landar English California State University Los Angeles, CA 90032 David Landeck 1624 Argonne Place, NW Washington, DC 20009 S.P.J. Landsbergen Treurenburgstraat 15 Eindhoven, NETHERLANDS Carol L. Lane 5305 Hesperus Dr. Columbia, MD 21044 D. Terence Langendoen CUNY Graduate Center 33 West 42 St New York, NY 10036 Patrick W. Langley Robotics Institute Carnegie-Mellon University Pittsburgh, PA 15213 Sitaram Lanka Computer & Information Science University of Pennsylvania Philadelphia, PA 19104 Francois Laplace Villa Antionette 32, rue de Plaisance F-88800 Vittel, FRANCE Mark Vincent Lapolla Linguistics University of Texas Austin, TX 78712 Don Larner 5700 Harrison Kansas City, MO 64110 Robert H. Larson 2624 Wooster Court Vienna, VA 22180 Andrew Russell Latto Mathematics Harvard University Cambridge, MA 02138 Joachim H. Laubsch Institut fuer Informatik Universitaet Stuttgart Azenbergstr 12 D 7000 Stuttgart 1, W. GERMANY John Lawler Linguistics 1076 FB University of Michigan Ann Arbor, MI 48109 Scott W. Layson 25B Sixth Street Cambridge, MA 02141 Judith Hash LeBon 2152 Boisjoli Sillery, Quebec CANADA G1T 1E5 Michael Lebowitz Computer Science Columbia University 406 Mudd Building New York, NY 10027 Koenraad Lecot 3732 Keystone Ave, No.2 Los Angeles, CA 90034 Edward T, Lee Mathematical Sciences Memphis State University Memphis, TN 38152 Hans Lee Computer Science Michigan State University East Lansing, MI 48824 Howell Lee Townhouse 13 Amherst, MA 01002 K. P. Lee Gould. Inc. 40 Gould Center Rolling Meadows, IL 60008 Kenneth R. Lee 15 Kindle Lane Levittown, PA 19055 Richard Lee 7870 Americana Circle 201 Glen Burnie, MD 21061 Egbert Lehmann Hermann-Sack-Str. 2 D-8000 Muenchen 2 W. GERMANY Hubert Lehmann Mozart-strasse 11 6922 Meckesheim W. GERMANY Winfred P. Lehmann 3800 Eck Lane Austin, TX 78734 Wendy G. Lehnert COINS-Graduate Research Center University of Massachusetts Amherst, MA 01003 John Lehrberger 56 89th Avenue Chomedey Laval, Quebec CANADA H7W 3G8 Aarno Lehtola Otakaltio 1 B 13 SF-02150 Espoo 15, FINLAND C. G. Leininger 1536 Park Place Wichita, KS 67203 Alan V. Lemmon GTE Laboratories 40 Sylvan Road Waltham, MA 02254 Michael J. Lemon 299 N. Sycamore El Paso, IL 61738 Winfried Lenders Hauptstrasse 128 D-5300 Bonn 3, (Holzlar) W. GERMANY Matthew Lennig Bell-Northern Research 3 Place du Commerce lies des Soeurs Montreal, Que, CANADA H3E 1H6 Marjorie Leon 4311 Linden Street Silver Springs, MD 20906 Leonardo Lesmo Istituto di Scienze dell'lnformazione Corso M. D'Azeglio, 42 1-10125 Torino, ITALY Yves Lesperance Computer Science University of Toronto Toronto, Ontario CANADA M5S 1A4 Lori S. Levin Linguistics University of Pittsburgh Pittsburgh, PA 15260 Leon S. Levy 2D Dorado Drive Convent Station, NJ 07961 Barbara Lewandowska Pawla Gdanca 10 A/16 PL-80 336 Gdansk, POLAND Barbara Lewandowska -Tomaszczyk Institute of English University of Lodz Kosciuszki 65 PL-90 514 Lodz, POLAND Andrzej-Maria Lewicki institute of Polish Univ. M. Curie-Sklodowska Plac M, Curie-Sklodowskiej 4 PL Lublin, POLAND Gene Lewis Computer Science North Texas State University Denton, TX 76203 M. Paul Lewis c/o Instituto Linguistico de Verano Apdo. 74 Guatemala City, GUATEMALA Miles A. Libbey 88-16 173rd Street Jamaica Queens, NY 11432 Mark Liberman Bell Laboratories, 2D-551 600 Mountain Avenue Murray Hill, NJ 07974 Svein Lie Nordisk Institut University of Oslo Blindern, Oslo, 3 NORWAY Mark Lighterman 9230 S.W. 59th Street Miami, FL 33173 E. Jay Lindsay TSC Houghton-Mifflin Box 683 Hanover, NH 03755 S.E. Lipsett PO Box 80554 San Diego, CA 92138 Kenneth C. Litkowski 396-201 No. Summit Avenue Gaithersburg, MD 20877 Diane Litman Computer Science University of Rochester Rochester, NY 14627 Robert Litteral Box 59 Ukarumpa via Lae Papua, NEW GUINEA Thelma Litsas 8360 Greenboro Drive The Rotunda, No.1002 McLean, VA 22102 Yong-quan Liu Institute of Linguistics, CASS 29 Xue Yuan Lu Beijing PEOPLE'S REPUBLIC OF CHINA Rick Lively 1445 W. Jessamine, No.309 St. Paul, MN 55108 R. Bruce Loatman 9903 Snowbound Court Vienna, VA 22180 Abe Lockman Computer Science Hill Center, Busch Campus Rutgers University New Brunswick, NJ 08903 Staffan Lof Hjortronvaegen 19 S-590 54 Sturefors SWEDEN Robert G. Logan Bell Laboratories, Room 3K-419 Crawfords Corner Road Holmdel, NJ 07733 Cynthia Loiselle 114 N. Whitney Street Amherst, MA 01002 Christopher Longyear English GN-30 University of Washington Seattle, WA 98105 Franco Lorenzi via S. Sebastiano 37 52044 Cortona (Arezzo) ITALY Donald J. Loritz English University of North Iowa Cedar Falls, IA 50614 Julie B. Lovins PO Box 987 Mountain View, CA 94042 Computational Linguistics, Volume 10, Number 1, Janury-March 1984"]},{"title":"67 The FINITE STRING Newsletter 1983 ACL Membership","paragraphs":["List Suen Caesar Lun PO Box 7146 Austin, TX 78712' Eric Lund 2210 Wilshire BIvd, Suite 272 Santa Monica, CA 90403 Paul C. Lustgarten Bell Laboratories, Room 2C-213 101 J.F.Kennedy Parkway Short Hills, NJ 07078 Greg Lyons Summer Inst. of Linguistics 7500 West Camp Road Dallas, TX 75236 Nina Macdonald Bell Laboratories, F-307 190 River Road Summit, NJ 07901 Filip iachi System Development Corporation 2500 Colorado Avenue, 72-27 Santa Monica, CA 90406 Svatava iachova Computing Centre Charles University Malostranske nam. 25 CS 118 00 Praha 1, CZECH. T. Richard MacMillan 10150 Cabana, Apt. 2K St. Ann, MO 63074 Brian MacWhinney Psychology Carnegie-Mellon University Pittsburgh, PA 15213 Bente iaegaard Solskraenten 49 DK-2500 Valby, DENMARK Antonio iagi-Spinetti Centro di Calcolo Interfacolta P. Aldo Moro 1 Universita Roma Roma, ITALY Anthony S. iaida Center for Cognitive Science Box 1911 Brown University Providence, RI 02912 David Maier Computer Science & Engineering Oregon Graduate Center 19600 Walker Road Beaverton, OR 97006 John Makhoul Bolt Beranek and Newman 10 Moulton Street Cambridge, MA 02238 William C. Mann USC-ISI 4676 Admiralty Way Marina del Rey, CA 90291 Heinz Marburger Informationswissenschaft und Kuenstliche Intelligenz Mittelweg 179 D-2000 Hamburg 13 W. GERMANY Witold iarciszewski Instytut Filologii Polskiej UW Swierkowa 20a PL-15 328 Bialystok, POLAND Richard Marcus MIT, Room 35-414 Cambridge, MA 02139 Rita Marinelli Via Pendola 9 1-57100 Livorno, ITALY William S. Mark USC/ISI 4676 Admiralty Way Marina del Rey, CA 90291 Lawrence Z. iarkosian IMSS, Ventura Hall Stanford University Stanford, CA 94305 Erni Markus Am Stadtrand 45 CH-8600 Dubendorf SWITZERLAND Elaine Marsh Naval Research Laboratory Code 7510 Washington, DC 20375 William E. Marsh Box LC Hampshire College Amherst, MA 01002 Catherine R. Marshall Bell Laboratories, 1 M-211 6 Corporate Place Piscataway, NJ 08854 Fred Marshall 4626 Winthrop Street Pittsburgh, PA 15213 W. D. Marslen-Wilson Psychology Laboratory University of Cambridge Downing Street Cambridge CB2 3EB, ENGLAND Maurizio iartelli CNUCE CNR Via Santa Maria 36 1-56100 Pisa, ITALY Marc P. iarthaler 22 ch Crets-Champel 1206 Geneva, SWITZERLAND Hanno Martin 6 Arncliffe Mews York YO1 4EL ENGLAND James Martin Linguistics University of Sydney Sydney, NSW 2006, AUSTRALIA Larry W. Martin 16 Milford Street Boston, MA 02118 Paul A. Martin Artificial Intelligence Center SRI International Menlo Park, CA 94025 James Mason Computer Science Atkinson College-York U. Downsview, Ontario CANADA MJJ 2R7 Gerald B. iathias East Asian Languages Univ. of Hawaii, Moore 370 1890 East West Rd. Honolulu, HI 96822 Jim iathias MRM, Inc. PO Box 400 Kensington, MD 20895 Hiroshi Matsuoka 100-2 Tatsunodai Zama City, Kanagawa Prefecture JAPAN 228 Sakari M. iattila Laajalahdentie 26 B 25 SF-00330 Helsinki 33 FINLAND Stephen A. iattin Rte 84, RFD 1 East Kingston, NH 03827 Eleny A. Maul 2015 Shroyer Road Dayton, OH 45419 Michael L. Mauldin Computer Science Carnegie-Mellon University Pittsburgh, PA 15213 Eric Mays 69 Knollwood Lane Ridgefield, CT 06877 Lawrence J. Mazlack Information Systems, 130 Qualitative Analysis University of Cincinnati Cincinnati, OH 45221 Stephen J. iazurek 2714 Piedmont Ave, No.3 Berkeley, CA 94705 Gordon McCalla Computer Science University of Saskatchewan Saskatoon, Saskatchewan CANADA S7N 0W0 John icCallum Computer Science National Univ. Singapore Kent Ridge, SINGAPORE 0511 Michael F. McCarthy 452 New Scotland Avenue Albany, NY 12208 L. Thorne McCarty Computer Science Rutgers University Hill Center, Busch Campus New Brunswick, NJ 08903 James D. McCawley Linguistics University of Chicago 1010 East 59th Street Chicago, IL 60637 John McCIoskey Middle East Software Corp. 614 Massachusetts Avenue Cambridge, MA 02139 George W. McConkie Ctr for the Study of Reading University of Illinois 51 Gerty Drive Champaign, IL 61820 Michael C. McCord IBM TJ Watson Research Center PO Box 218 Yorktown Heights, NY 10598 Kathleen Filliben McCoy Computer & Information Science University of Pennsylvania Philadelphia, PA 19104 David McDonald Computer Science Carnegie-Mellon University Pittsburgh, PA 15213 David D. McDonald COINS-Graduate Research Center University of Massachusetts Amherst, MA 01003 James T. McDonough Saint Joseph's University Philadelphia, PA 19131 Joyce P. McDowell 1341 Rocking Horse Lane La Habra, CA 90631 Roland F. McKenney 5 Karen Circle, No.6 Billerica, MA 01821 Kathleen R. icKeown Computer Science Columbia University New York, NY 10027 Henry B. icLoughlin Computer Science University College Belfield IRL-Dublin 4, IRELAND John icNaught Centre for Computational Linguistics UMIST, PO Box 88 Manchester, M60 IQD, ENGLAND William Mead 5722 Ettrick Drive Houston, TX 77035 Lee ieador World Bible Translation Center 1401 Hillcrest Drive Arlington, TX 76010 Anthony Meadow PO Box 1021 Berkeley, CA 94701 James Meehan Cognitive Systems, Inc. 234 Church Street New Haven, CT 06510 Jose A. Meireles RuM Infante D. Pedro Lote 1-6 ESQ 1700 Lisboa, PORTUGAL Alan K. ielby 1223 Aspen Avenue Provo, UT 84604 Igor A. ielchuk Linguistique Universite de Montreal CP 6128 A Montreal, CANADA H3C 3J7 C. S. Mellish CARN BHAC 67 Winterbourne Close Lewes, East Sussex BN7 1JZ ENGLAND Susan A. iengel 14112 Benson Road Edmond, OK 73034 Michael iepham Faculte des Lettres Universite Laval Quebec, CANADA G1K 7P4 Robert Mercer Computer Science University of British Columbia Vancouver, BC, CANADA V6T 1W5 Roberta H. Merchant 5420 Storm Drift Columbia, MD 21045"]},{"title":"68 Computational Linguistics,","paragraphs":["Volume 10, Number 1, Janury-March 1984 The FINITE STRING Newsletter 1983 ACL Membership List Lunella Mereu Via Ottaviano 42 1-00192 Rome, ITALY Marie-France Merger Via Sercambi 23 San Concordio 1-55100 Lucca, ITALY J.J.E. iesserschmidt PO Box 50884 Wierdapark 0149 REPUBLIC OF SOUTH AFRICA Douglas Metzler IDIS University of Pittsburgh Pittsburgh, PA 15260 Jacob Mey Linguistics University of Odense DK-5230 Odense, M, DENMARK Sidney Michaelson Computer Science University of Edinburgh JCMaxwell Bldg, Mayfield Rd, Edinburgh, EH9 3JZ, SCOTLAND GiUian Michell SLIS, Elborn College Univ. of Western Ontario London, Ontario CANADA N6G 1H1 Archibal Michiels 37 rue du Parc B-4020 Liege, BELGIUM K. Michielsen North Holland Publishing PO Box 1991 NL-IO00 B2 Amsterdam NETHERLANDS A. Patricia Miller 6898 S. Broadway Littleton, CO 80122 Dale A. Miller Computer & Information Science University of Pennsylvania SEAS/D2 Philadelphia, PA 19104 George A. Miller Psychology Princeton University • Princeton, NJ 08544 Lance A. Miller IBM TJ Watson Research Center PO Box 218 Yorktown Heights, NY 10598 Michael I. Miller Warsaw (Fulbright) Department of State Washington, DC 20520 Perry L. Miller Anesthesiology Yale University School of Medicine New Haven, CT 06510 Rodger S. Miller Consultant Box 209 Norris, TN 37828 Richard B. aillward Psychology Brown University Providence, RI 02912 Robert W. Milne 66 W. Jackson Road Springfield, OH 45502 Eliana Minicozzi Istituto Fisica Teorica Mostra d'Oitremare PAD19 1-80125 Napoli, ITALY Jack Minker 6913 Millwood Road Bethesda, MD 20817 Murray S. Miron 542 Huntington Hall Syracuse Univ. Syracuse, NY 13210 Linda D. Misek-Falkoff IBM TJ Watson Research Center PO Box 218 Yorktown Heights, NY 10598 Purna C. Mishra Computer Science University of Oregon Eugene OR 97403 K. aizukoshi Systems Development Lab Hitachi Ltd 1099 Ohzenji, Aso-ku Kawasaki-shi 215 JAPAN Yoshio Uomouchi Division of Information Engineering Hokkaido University Sapporo 060, JAPAN Brian D. Monahan 14 Deerfoot Lane Dobbs Ferry, NY 10522 Michele Montagnini Via Barducci 37 1-50015 Grassina (Firenze) ITALY Christine A. Montgomery Logicon, Inc. 6300 Variel Avenue, Suite H Woodland Hills, CA 91367 Timothy iontler Anthropology University of Montana Missoula, MT 59812 Dave Moody c/o Institut Linguistik SIL WDT No. 26 Kota Kinabalu, Sabah EAST MALAYSIA Tag Young Moon 4109 Moorland Drive Midland, MI 48640 Ray iooney 711 W. Vermont Avenue Urbana, IL 61801 Raymond Mooney 4012 Sequoia San Diego, CA 92109 James A. Moore Academic Information Systems IBM Los Angeles Scientific Ctr 9045 Lincoln Boulevard Los Angeles, CA 90045 Robert C. Moore Artificial Intelligence Center SRI International Menlo Park, CA 94025 Wendy Moore 7417 17th Avenue Burnaby, BC, CANADA VJN 1L3 Douglas B. Moran Telecommunication Sciences SRI International, EK101 Menlo Park, CA 94025 Marie-Anne aoreaux 46 rue du Chateau d'Eau F-75010 Paris, FRANCE Katharina aorik Averhoffstrasse B D-2000 Hamburg 76 W. GERMANY Jerry L. Morgan Linguistics, 4088 FLB University of Illinois Urbana, IL 61801 John Moyne PhD Program in Linguistics Graduate School, CUNY New York, NY 10036 Erik Mueller 11663 Gorham Avenue, No.12 Los Angeles, CA 90049 Stephen iuka 3321 S. York Oak Brook, IL 60521 David Mumford Mathematics Harvard University 1 Oxford Street Cambridge, MA 02138 Tamar Murachver Psychology University of California at San Diego La Jolla, CA 92093 J. David iurley, Jr. 650 Coleraine Road Baltimore, MD 21229 Makoto Nagao Electrical Engineering Kyoto University Yoshida- Honmachi Sakyo-ku Kyoto, JAPAN Alexander Nakhimovsky General Linguistics Program State University of New York Oswego, NY 13126 Shamim A. Naqvi Bell Laboratories, 3C-313 600 Mountain Avenue Murray Hill, NJ 07974 Hiroshi Nara East Asian Languages University of Kansas Lawrence, KS 66045 A.S. Narin'yani Computer Center Siberian Division Academy of Sciences Novosibirsk-90, USSR Anthony Naro Av. Atlantica 3308 Apt. 601 22.070 Rio de Janeiro - RJ BRASIL David Nasjleti 317 S. Mississippi Morton, IL 61550 James Nattinger Portland State University Box 751 Portland, OR 97207 Jeannette G. Neal 499 Knapp Road Akron, NY 14001 Mary S. Neff 21 Meadow Road Montrose, NY 10548 Laura Jean Neher 611 West Hill Champaign, IL 61820 A. Neijt Nicolailaan 26 3723 HS Bilthoven NETHERLANDS Esa Nelimarkka Institute of Mathematics Helsinki Univ. of Technology SF-02150 Espoo 15, FINLAND Joachim Neuhaus Westfaelische Wilhelms- Univ. Johannisstrasse 12-20 D-4400 Muenster W. GERMANY Christine Neuwirth English Carnegie-Mellon University Pittsburgh, PA 15213 Paula S. Newman IBM Los Angeles Scientific Ctr 9045 Lincoln BIvd Los Angeles, CA 90045 Ngo Thanh Nhan 72-77 Yellowstone Blvd Forest Hills, NY 11375 David Wood Nicholas Psychology Carnegie-Mellon University Pittsburgh, PA 15213 Gerhard Niedermair Siemens AG ZT ZTI INF 32 Otto-Hahn-Ring 6 D-8000 Muenchen, W. GERMANY Sergei Nirenburg Computer & Information Studies Colgate University Hamilton, NY 13346 Fujio Nishida Engineering University of Osaka Mozu-Umemachi Sakai, Osaka, 591 JAPAN Toyoaki Nishida A.I. Project Yale University PO Box 2158 Yale Station New Haven, CT 06520 Yoshihiko Nitta Systems Development Laboratory Hitachi, Ltd 1099 Ohzenji Asao-ku Kawasaki, 215 JAPAN Jacques Noel Allee de la Cense Rouge 50 B-4200 Ougree BELGIUM A. Michael Noll 58 Baker Street Stifling, NJ 07980 Lewis M. Norton 350 Hilltop Road Paoli, PA 19301 Peter Norvig 2141 Rose Street, Apt B Berkeley, CA 94709 Gordon Novak 801 Loma Linda Austin, TX 78746 William R. Nugent 1448 Yellowood Ct. Reston, VA 22090 Computational Linguistics, Volume 10, Number 1, January-March 1984"]},{"title":"69 The FINITE STRING Newsletter 1983 ACL Membership","paragraphs":["List R.S, Nunes Laboratorio Calculo Automatico R, das Taipas 135 Univ, de Porto Porto, PORTUGAL J, Terry Nutter Computer Science Tulane University New Orleans, LA 70118 Klaus Obermeier Linguistics Ohio State University 1841 Millikin Road Columbus, OH 43210 Gary Oblock 1070 Cook Street Denver, CO 80206 John O'Connor 1905 Fairland Avenue Bethlehem, PA 18018 Gregg Oden Psychology University of Wisconsin 1202 W, Johnson Street Madison, WI 53706 Richard Oehrle & Susan Steele Linguistics University of Arizona Math Building 89, Room 203 Tucson, AZ 85721 Tsunao Ogino Linguistics University of Tokyo Hongo 7-3-1, Bunkyo-ku Tokyo 113, JAPAN Choon-Kyu Oh Linguistics University of Kansas Lawrence, KS 66045 William Ogden IBM Corporation 5600 Cottle Road Dept. P16, Bldg 078 San Jose, CA 95193 Ludmila Ohlsson Computer & Information Science Linkoeping University S-581 83 Linkoeping, SWEDEN Rajmund Ohly PO Box 21902 Windhoek 9000 SWA/NAMIBIA Cesare Oitana Via Baretti, 36 1-10125 Torino, ITALY Atsushi Okajima Systems Development Laboratory Hitachi, Ltd 1099 Ohzenji Asao-ku Kawasaki, 215 JAPAN Laval Oliva Na Vysince 219/6 CS-252 27 Praha 512 - Radotin CZECHOSLOVAKIA John Olney Systems Development Corp. 2500 Colorado Avenue Santa Monica, CA 90406 Niall H. Olsen 2500 East Campus Drive Salt Lake City, UT 84121 Slavo Ondrejovic Jazykovednij mstav L.Stura SAV Malejkova 26 CS-813 64 Bratislava CZECHOSLOVAKIA Dusan Ondrus Computing Centre SIovak Academy of Sciences Dubravska cesta 9 CS-842 35 Bratislava, CZECH. F. Oppacher Computer Science Carleton University Ottawa, Ontario CANADA KIS 5B6 Paul Orgren & M. Ferreira-Orgren Shell Development Company Physics and Computer Science PO Box 481 Houston, TX 77001 Beatrice Oshika System Development Corp. Mail Drop 72-27 2500 Colorado Avenue Santa Monica, CA 90406 Nicholas Ostler SCICON 49 Berners Street London, Wl P 4AQ ENGLAND ailos Pacak 4970 Battery Lane Apartment 306 Bethesda, MD 20014 Elena V. Paducheva ul. Alabjana 10 kv.168 125080 Moscow, USSR Ellis B. Page 213 West Duke Building Duke University Durham, NC 27708 iartha Stone Palmer 171 Appletree Drive Media, PA 19063 Zbigniew L. Pankowicz 105 Stanwix St. Rome, NY 13440 Eugene Papa 6 Whittier Place, ADt.7K Boston, MA 02114 George Papcun Los Alamos National Laboratory MS B296 Los Alamos, NM 87545 Ferenc Papp Slavics University L. Kossuth H-4010 Debrecen, HUNGARY James Paradise Artificial Intelligence Corp. 52 Adams Street Norwood, MA 02062 Remo Pareschi Linguistics University of Texas Austin, TX 78712 Barbara H. Partee Linguistics University of Massachusetts Amherst, MA 01003 G. H. Partmann 110 Carlotta Circle, No.B Mill Valley, CA 94941 Elena Pascaleva Institute of Mathematics Bulgarian Academy of Sciences PO Box 373 1090 Sofia, BULGARIA L. F. Pau Optics & Electronics Battelle Research Center 7, route de Drize CH-1227 Carouge, SWITZERLAND Joseph F. Paul Redwood Acres PO Box 303 Guerneville, CA 95446 E. Anne Paulson Hewlett-Packard Laboratories Bldg 3LL 1501 Page Mill Rd Palo Alto, CA 94304 Noemi Paz & William Leigh 819 Entique Court, D Indianapolis, IN 46260 Michael J. Pazzani Aerospace Corporation Mail Stop M1-105 PO Box 92957 Los Angeles, CA 90009 Barbara Pearson 6880 SW 98 Street Miami, FL 33156 George B. Peck Mathematics Arizona State University Tempe, AZ 85287 Per-Bjorn Pedersen Roglan Distrikt Hogskole N-4001 Stavanger, NORWAY Jeffrey Pelletier Philosophy University of Alberta Edmonton, Alberta CANADA T6G 2El Gene Pendergraft Route 3 Jasper, AR 72641 John W. Pennisten 135 Willow Street, Apt.711 Brooklyn, NY 11201 Joseph E. Pentheroudakis PO Box 1965 Provo, UT 84603 Jordan Penchev Institute for Bulgarian Language Chapaev Str. 52 Sofia, BULGARIA Paul M. Peranteau John Benjamins North America One Buttonwood Square 202 Philadelphia, PA 19130 Fernando C.N. Pereira Artificial Intelligence Center SRI International Menlo Park, CA 94025 Rebecca Perez Box 22040 University Station San Juan, PR 00931 Vladimir Pericliev Inst. Cybernetics & Robotics Bulgarian Academy of Sciences Acad. G. Bonchev Street, B1.12 1113 Sofia, BULGARIA Donald R. Perils Computer Science University of Maryland College Park, MD 20742 C. Raymond Perrault Artificial Intelligence Center SRI International Menlo Park, CA 94025 Matthew P. Perriens 19024 Coltfield Court Gaithersburg, MD 20879 Dennis J. Perzanowski 719 Parkway East Utica, NY 13501 Joseph H. Peterson 2415 Polk Street, NE Minneapolis, MN 55418 Lynn Peterson Computer Science & Engineering U Texas at Arlington UTA Box 19015 Arlington, TX 76019 Thomas H. Peterson 951 17th Street Santa Monica, CA 90403 Stanley R. Petrick 2355 Mark Rd. Yorktown Heights, NY 10598 Brian Phillips Texas Instruments PO Box 226 015 Mail Station 238 Dallas, TX 75266 Thomas Phillips 22 Newton Avenue Norwich, NY 13815 Marco Piazzalunga Via Borromeo, 3 24044 Dalmine, ITALY Janet B. Pierrehumbert Bell Laboratories 600 Mountain Avenue Murray Hill, NJ 07974 Jorgen Pind Faculty of Arts University of Iceland Reykjavik 10, ICELAND Petr Pitha Charles University Malostranske nam. 25 CS-118 00 Prague 1 CZECHOSLOVAKIA William Bruce Pitt PO Box 356 Riverdale, MD 20737 Warren Plath IBM TJ Watson Research Center PO Box 218 Yorktown Heights, NY 10598 Eugen C. Platt 9720 Beechnut, No.406 Houston, TX 77036 Steve Platt 4426 Chestnut Street Philadelphia, PA 19104 Patrice Pognan 41, rue des Bergers F-75015 Paris, FRANCE Peter Politakis Digital Equipment Corporation 200 Forrest Street (MR01-1/M2) Marlboro, MA 01752 70 Computational Linguistics, Volume 10, Number 1, January-March 1984 The FINITE STRING Newsletter 1983 ACL Membership List Jordan Pollack 1004 W. Clark Urbana, IL 61801 Martha E. Pollack Computer & Information Science Moore School / D2 University of Pennsylvania Philadelphia, PA 19104 Carl Pollard Linguistics Stanford University Stanford, CA 94305 Joseph J. Pollock 967 Caniff PI. Columbus, OH 43221 Hans W. Polzer Box 602 10398 Democracy Boulevard Fairfax, VA 22030 Robert F. Port Linguistics Indiana University 401D Lindley Hall Bloomington, IN 47405 Harry Porter 1209 SW Sixth, No.304 Portland, OR 97204 J. L. Potter 7389 Shadyview Massillon, OH 44646 E. Gordon Powell 1126 Apple Valley Road Accokeek, MD 20607 Joseph R. Power 1 Surfway, No.110 Monterey, CA 93940 David Powers 259A Trafalgar Street Petersham, NSW 2049 AUSTRALIA Gary D. Prideaux Linguistics University of Alberta Edmonton, Alberta CANADA T6G 2H1 J. P. Privitera Ford Aerospace MS V02 3939 Fabian Way Palo Alto, CA 94303 Gabor Proszeky Institute of Musicology Hungarian Academy of Sciences Orsaghaz u. 52 IX/110 H-1144 Budapest, HUNGARY Calton Pu Computer Science FR-35 University of Washington Seattle, WA 98195 Jeanette Pugh Centre for Computational Linguistics UMIST, PO Box 88 Manchester M60 1QD, ENGLAND Geoffrey Keith Pullum Cowell College University of California Santa Cruz, CA 95064 Stephen G. Pulman Linguistics, English, & American Studies University of East Anglia Norwich, NR4 7TJ ENGLAND John Putnam 113 South Scoville Oak Park, IL 60302 Feng Qian Institute Educational Technol. East China Normal University Shanghai PEOPLE'S REPUBLIC OF CHINA Pierre-Yves Raccah ATP Internationale (CNRS) 4, rue du Roi de Sicile F-76004 Paris, FRANCE Francesco Rago Viale della Republica, 92 1-70125 Bari, ITALY Robert Ramage 463 N. Calmgrove Avenie Covina, CA 91724 Lance A. Ramshaw 176 West Main Street Newark, DE 19711 Daniela Ratti Istituto di Linguistica Computazionale Via della Faggiola 32 1-56100 Pisa, ITALY Hans-Dieter Rauschner Via Garibaldi 31 1-56100 Pisa, ITALY James V. Rauff Linguistics Northwestern University Evanston, IL 60201 Michael L. Rawlings 149 Dickinson Street, No.1 Springfield, MA 01108 Jerry L. Ray Ray Associates, Inc. PO Box 34577 Omaha, NE 68134 Wayne J. Redenbarger Romance Linguistics 248 Cunz Hall Ohio State University Columbus, OH 43212 Harry L. Reed, Jr. 138 Edmund Street Aberdeen, MD 21001 Larry H. Reeker Computer Science Tulane University New Orleans, LA 70118 Uwe Reichenbach 285-36 Merrimac Trail Williamsburg, VA 23185 Kevin D. Reilly 304 N. Burbank Drive Bluff Park, AL 35226 Ronan Reilly Educational Research Centre St. Patrick's College Drumcondra, Dublin 9 IRELAND Raymond Reiter Computer Science University of British Columbia Vancouver, BC, CANADA V6T 1W5 Charles W. Restivo PO Box 4584 Stanford, CA 94305 Marc Rettig 42-18 34th Avenue Long Island, NY 11101 Uwe Reyle Pfarrhausstrasse 13 D-7000 Stuttgart 80 W. GERMANY Daniel Ribbens Institut d' Electricite Montefiore, Informatique B-4000 Sart Tilman, BELGIUM Lloyd Rice 821 Pacific St., No. 4 Santa Monica, CA 90405 Stephen D. Richardson IBM TJ Watson Research Center PO Box 218 Yorktown Heights, NY 10598 Burghard B. Rieger German, MESY-Group Technical University RWTH Templergraben 55 D-5100 Aachen, W. GERMANY Chris Riesbeck Computer Science Yale University Box 2158 Yale Station New Haven, CT 06520 J. R. Rinewalt Computer Science & Engineering Box 19015 University of Texas Arlington, TX 76019 Graeme Donald Ritchie Artificial Intelligence University of Edinburgh Hope Park Square, Meadow Lane Edinburgh, EH8 9NW SCOTLAND Johannes Ritzke Sondersforschungsbereich 100 Teilproject O/Romanistik Universitaet des Saarlandes D6600 Saarbruecken, W. GERMANY John Roach Computer Science Virginia Polytechnic Inst. Blacksburg, VA 24061 Kelly Roach Xerox PARC 3333 Coyote Hill Road Palo Alto, CA 94304 Thomas N. Robb 6-27 Hirakata- Motomachi Hirakata-shi, Osaka 573 JAPAN C. Scott Roberts Computer & Information Science University of Oregon Eugene, OR 97403 Charles Roberts 4001 West Northgate, No.504 Irving, TX 75062 Ann E. Robinson Symantec 306 Potrero Avenue, No. 306 Sunnyvale, CA 94086 Jane J. Robinson Artificial Intelligence Center SRI International Menlo Park, CA 94025 Robert Rodman Computer Science North Carolina St. Univ. Raleigh, NC 27650 Horacio RodriguezHontoria Intersoftware S.A. Avenida Pau Casals No.24, 8th Barcelona (21), SPAIN Sabine M. Rohlfs Interface Consulting Ltd PO Box 6865, Station J Ottawa, CANADA K2A 3Z5 Christian Rohrer Institut fuer Linguistik Universitaet Stuttgart Keplerstr. 17 D-7000 Stuttgart 1, W. GERMANY Humberto Roman Airborne AF, c/o INTEVEP 2009 NW 70th Avenue Miami, FL 33152 Guy Rondeau Universite Laval 1673 Place de la Bruyere Quebec, Que, CANADA GlW 3G9 Peter H. Roosen-Runge Computer Science York University 4700 Keene St. Downsview, Ont., CANADA Jarrett Rosenberg Xerox PARC 3333 Coyote Hill Road Palo Alto. CA 94304 Richard S. Rosenberg Computer Science University of British Columbia Vancouver, BC CANADA V6T 1W5 Stanley J. Rosenschein Artificial"]},{"title":"Intelligence","paragraphs":["Center SRI International Menlo Park, CA 94025 Robert Rosenstein PO Box 3467 SMU Dallas, TX 75275 Michael Rosner ISSCO 54 route des Acacias CH- 1227 Geneva, SWlTZERLAND Donald Ross English University of Minnesota 207 Church Street, SE Minneapolis, MN 55455 Kenneth i, Ross 325 Jardin Los Altos, CA 94022 B. L. Rosser Computer Centre Polytechnic of Wales Ponty Pridd, Mid Glamorgan CF37 1DL, WALES UK Nilda Rummy Istituto di Linguistica Computazionale Via della Faggiola 32 1-56100 Pisa, ITALY Robert Russell 1117 No. 600 East Orem, UT 84057 Hanne Ruus Institut for Nordisk Filologi University of Copenhagen Njalsgade 80 DK-2300 Copenhagen, DENMARK Computational Linguistics, Volume 10, Number 1, January-March 1984"]},{"title":"71 The","paragraphs":["FINITE STRING Newsletter 1983 ACL Membership List Karen Ryan 1108 7th Street S.E. Minneapolis, MN 55414 Simon Sabbagh Laboratoires de Marcoussis Route de Nozay F-91460 Marcoussis, FRANCE Conrad F. Sabourin 2785 Edouard-Monpetit App.45 Montreal, Que, CANADA H3T 1J6 Ivan A. Sag Linguistics Stanford University Stanford, CA 94305 Naomi Sager Linguistic String Project New York University 251 Mercer St. New York, NY 10012 Gerard Salton Computer Science Cornell University Upson Hall Ithaca, NY 14853 Sharon C. Salveter Computer Science Department Boston University 232 Bay State Road Boston, MA 02215 Tariq Samad Electrical and Computer Engineering Carnegie-Mellon University Pittsburgh, PA 15213 Geoffrey Sampson Linguistics & Modern English University of Lancaster Lancaster LA1 4YT, ENGLAND Jerry Sanders 743 Brummel Evanston, IL 60202 Mark S. Sanders 700 Dominik Apt 3205 College Station, TX 77840 Erik Sandewall Computer & Information Science Linkoeping University S-581 83 Linkoeping, SWEDEN David L. Sanford 608 Progress Street Blacksburg, VA 24060 Barbara C. Sangster 9 Bellevue Road Wellesley, MA 02181 Richard E. Sansom TRW One Space Park 134/10831 Redondo Beach, CA 90278 Paul T. Sato Language and Linguistics Occidental College 1600 Campus Road Los Angeles, CA 90041 John E. Savarese Box 49 Sweet Briar, VA 24595 Elena N. Savvina 1st Vladimirskaja ul. 25-3-58 111401 Moscow, USSR Ethan A. Scarl The MITRE Corporation PO Box 208, A134 Bedford, MA 01730 Remko J. Scha van Eeghenstraat 26 NL-1071 GG Amsterdam NETHERLANDS Roger Schank Computer Science Yale University PO Box 2158 New Haven, CT 06520 Thomas W. Schiebel Computer Center Illinois State University Normal, IL 61761 Charles F. Schmidt Psychology Busch Campus Rutgers University New Brunswick, NJ 08903 Janusz Schminda Marszalkowska 58/19 PL-00 545 Warszawa, POLAND Thomas Schneider Siemens AG, KSD TM Postfach 70 0072 D-8000 Muenchen 70 W. GERMANY Helmut Schnelle Ruhr- Universitaet Bochum Postfach 102148 D-4630 Bochunn, W. GERMANY Sara Lee Schnur 6009 Lincolnwood Court Burke, VA 22015 Steven C. Schoen Makiki Plaza, No.1102 1561 Pensacola Street Honolulu, HI 96822 James W. Scholl 721 E. Chilton Drive Tempe, AZ 85283 Kent Schroeder Rt.3 Box 220AB Roanoke, TX 76262 Lenhart K. Schubert Computing Science University of Alberta Edmonton, Alberta CANADA T6G 2H1 Paul Schubert Heitlandstrasse 8 D-4800 Bielefeld 1 WEST GERMANY Robert Schudy Bolt Beranek and Newman 10 Moulton Street Cambridge, MA 02238 Ethel Schuster Computer & Information Science University of Pennsylvania Philadelphia, PA 19103 Dan Schutzer 8 Whig Road Scarsdale, NY 10583 Warren D, Schwinden 7815 Capwood Avenue Tampa, FL 33617 B. Sciarone Kanaalweg 2/B NL-2628 EB Delft, NETHERLANDS Bernard Scott Logos Corporation 2 Low Avenue Middleton, NY 10940 Dana S. Scott Computer Science Carnegie-Mellon University Pittsburgh, PA 15213 Teresa Scott Route 1, Box 243 Oglesby, IL 61348 Gerald Seagraves 2285 Clay San Francisco, CA 94115 P. David Seaman 3600 Moore Circle Flagstaff, AZ 86001 Larry Seaward c/o American Embassy Kathmandu, NEPAL Sally Y. Sedelow Computer Science University of Kansas Lawrence, KS 66045 Daniel A. Segel 1208 Pine Lane Davis, CA 95616 Alberto Maria Segre 2010 Boudreau Drive Urbana, IL 61801 Mallory Selfridge EE & CS, U-157 University of Connecticut Storrs, CT 06268 Mark Seligman 2632B Regent Street Berkeley, CA 94704 Jouko J. Seppanen Computing Centre Helsinki U. of Technology SF-02150 Espoo 15 FINLAND Petr Sgall Dimitrovovo n. 24 CS-170 O0 Prague 7 CZECHOSLOVAKIA Leonard Shaefer 3104 Old Dominion Boulevard Alexandria, VA 22305 Jayant Shah 44 Kirkland Street Cambridge, MA 02138 Varda Shaked GTE Laboratories 40 Sylvan Road Waltham, MA 02254 Patrick Shann ISSCO, University of Geneva 54 route des Acacias CH-1227 Geneve, SWITZERLAND Stuart C. Shapiro Computer Science SUNY Buffalo 4226 Ridge Lea Road Amherst, NY 14226 Mark F. Sharefkin Resources for the Future 1755 Massachusetts Avenue, NW Washington, DC 20036 B. Sharp Computer Science The Polytechnic Wulfruna Street, Wolverhampton Midlands, ENGLAND Guy Shaw 2201 California Avenue Santa Monica, CA 90403 Michael Sherman 707 Continental Circle No.1610 Mountain View, CA 94040 Peter Sherwood Interactive Technology, Inc. 50 E. Quinobequin Road Waban, MA 02168 Stuart M. Shieber Artificial Intelligence Center SRI International Menlo Park, CA 94025 Hiromitsu Shirakawa Electrical Engineering Ritsumeikan University Kita-Ku, Kyoto 603, JAPAN Maruta Shobo, Inc. Central PO Box 34 Nagoya 450-91, JAPAN June E. Shoup Speech Science Laboratory 3375 South Hoover, Suite H Los Angeles, CA 90007 Jeff Sbrager Psychology Carnegie-Mellon University Pittsburgh, PA 15213 Kosho Shudo Electronics Engineering Fukuoka University 8, 19-1 Nanakuma, Jonan-ku Fukuoka-shi, 814-01 JAPAN Candace L. Sidner Bolt Beranek and Newman 10 Moulton Street Cambridge, MA 02238 Jeff R. Siegel 15 Appaloosa Avenue Pelham, NH 03076 Liz Siegfried Bell Laboratories, IC 329A Whippany Road Whippany, NJ 07981 Ann Silva Naval Underwater Systems Ctr Code 3513 Bldg 1171(1) Newport, RI 02841 Laura Silver 433 South Trenton Ave Pittsburgh, PA 15221 Shirley Silver Anthropology Sonoma State University Rohnert Park, CA 94928 Robert F. Simmons Computer Sciences University of Texas Austin, TX 78712 Ann F. Simon 800 S. Franklin Street Wilmington, DE 19805 Gary F. Simons 610 E. 20th Street The Dalles, OR 97058 Robert L. Simpson, Jr. 2550 Rocky Springs Drive Marietta, GA 30067 Diana Mae Sims Texas Instruments PO Box 226015, MS 3602 Dallas, TX 75266"]},{"title":"72 Computational Linguistics, Volume 10, Number 1, January-March 1984 The FINITE STRING Newsletter 1983 ACL Membership","paragraphs":["List Douglas R. Skuce Computer Science University of Ottawa Ottawa, Ontario CANADA K1N 6N5 Jon Michael Slack Social Sciences Open University Milton Keynes MK6 7AA ENGLAND Jonathan Slocum Linguistics Research Center PO Box 7247 University Station Austin, TX 78712 Brian Cantwell Smith Cognitive & Instructional Sciences, Xerox Corporation 3333 Coyote Hill Road Palo Alto, CA 94304 Caroline Smith 1828 Pine Street Boulder, CO 80302 Howard R. Smith PO Box 29583 San Antonio, TX 78229 John Charles Smith School of Modern Languages University of Bath Claverton Down, Bath, Avon BA2 7AY, ENGLAND Lawrence R. Smith 1471 Main Street Concord, MA 01742 Peter D. Smith Computer Science Cal State Northridge Northridge, CA 91330 Philip H. Smith, Jr. Arts Computing Office University of Waterloo Waterloo, Ontario CANADA N2L 3G1 Raoul Smith 206 Nagog Hill Road Acton, MA 01720 William H. Smith English Piedmont College Demorest, GA 30535 Vicky Louise Snarr Computer Science University of Toronto CANADA M5S 1A7 Charles T. Snow 624 S. Howard Ct. Edmond, OK 73034 G. Edward Snyder 631 Benowe Scotia Road Glendale, CA 91207 R. J. Snyder PO Box 20571 Indianapolis, IN 46220 iarmo Soemarmo Linguistics, Gordy 204 Ohio University Athens, OH 45701 Basuki Soeterman Box 541 UCLA 308 Westwood Plaza Los Angeles, CA 90024 Jeff Sokolov Cognitive Science Institute of Human Learning University of California Berkeley, CA 94720 Harry J. Solo English Mankato State University Mankato, MN 56001 Harry L. Somers Centre for Computational Linguistics UMIST. PO Box 88 Manchester M60 1QD, ENGLAND John D. Somes 830 Boston Place Pomona, CA 91767 Norman Sondheimer USC-ISI 4676 Admiralty Way Marina del Rey, CA 90291 James H. Soper 138 Forest Avenue Pacific Grove, CA 93923 David C. Sowell 103 College Street Greenville, NC 27834 Henry Sowizral 1105 Idaho Avenue, No.210 Santa Monica, CA 90403 Karen SparckJones Computer Laboratory University of Cambridge Corn Exchange Street Cambridge, CB2 3QG ENGLAND Steve Spear PO Box 6650 Lawrenceville, NJ 08648 Rudy S. Spraycar 605 Worcester Towson, MD 21204 Sverre Spurkland Norwegian Computing Center Box 335- Blindern N-Oslo 3, NORWAY Richard Sproat Linguistics and Philosophy MIT 20D-219 Cambridge, MA 02139 Edward P. Stabler, Jr. Centre for Cognitive Science Univ. of Western Ontario London, Ontario CANADA N6B 2C2 Valerie Stagg 441 Alfred Street, Apt,5 Kingston, Ontario CANADA K7K 4J1 George H. Stalker 13 Cambridge Street Belmont, MA 02178 John A. Starkweather Langley Porter Institute University of California San Francisco, CA 94143 Stanley Starosta Linguistics University of Wisconsin PO Box 413 Milwaukee, Wl 53210 Marc Steedman Epistemics University of Edinburgh 2 Buccleuch Place Edinburgh EH8 9LW SCOTLAND Erwin Stegentritt Sondersforschungsbereich 10() Teilproject O/Romanistik Universitaet des Saarlandes D6600 Saarbruecken, W. GERMANY Ingeborg Steinacker Medical Cybernetics University of Vienna Freyung 6 A-1010 Vienna, AUSTRIA David Steiner 206 Easton Avenue New Brunswick, NJ 08901 Robert C. Stern 4809 Wagner Drive Box 92508 Lewisville, TX 75056 Oliviero Stock Istituto di Psicologia, CNR Via dei Monti Tiburtini 509 1-00157 Roma, ITALY Johnny Stovall Route 2, Box 86 Hamlin, TX 79520 Patricia Strauss 282 Williams Street Providence, RI 02906 Victor J. Streeter 2715 Hampshire Ann Arbor, MI 48104 Elizabeth Strodach 477-A 41st Street Oakland, CA 94609 Tomasz Strzalkowski Institute of Informatics Warsaw University PKin pok 850 PL-00 901 Warszawa, POLAND Susan U. Stucky Linguistics Stanford University Stanford, CA 94305 Franciszek Studnicki ul. 1 Majie 1 m. 8 PL-31 133 Krakow, POLAND Edward L. Stun 3068 Fresno Court Beavercreek OH 45385 Jagan Sud 7809 Suthard Drive Derwood, MD 20855 Ching Y, Suen Computer Science Concordia University 1455 de Maisonneuve Blvd West Montreal, Que H3G 1M8 CANADA Kenji Sugiyama Advanced Computer Systems SRI International Menlo Park, CA 94025 J. R. Sullivan 35 Dovedale Road West Bridgford Nottingham NG2 6JB, ENGLAND Sam Sullivan 1506 Kamloops Street Vancouver, BC, CANADA VSK 3W2 Beth Sundheim 3530 Buena Vista Street San Diego, CA 92109 R.D. Sussex Russian and Language Studies University of Melbourne Parkville 3052, Victoria AUSTRALIA Ann M. Swanson 4201 Massachusetts Avenue N.W., No. 8044C Washington, DC 20016 William Swartout USC/ISI 4676 Admiralty Way Marina del Rey, CA 90291 Mark Swartwout 1402 Windsor Ridge Drive Westboro, MA 01581 Jan Svartvik Tumlaregraenden 7 S-222 51 Lund, SWEDEN Patrick J. Sweeney 39-59 59th Street Woodside, NY 11377 Eva Szollosy National Szechenyi Library Jagello ut 42/b H-1124 Budapest, HUNGARY Mary Taffet 6400 W. Bellfort, No.1019 Houston, TX 77035 John Irving Tait Acorn Computers Limited Fulbourn Road, Cherry Hinton Cambridge CB1 4JN, ENGLAND Osamu Takahara 182-6 Doonomae, Gunge Mikage-cho, Higashinada-ku Kobe-shi 658, JAPAN Norifumi Takao 1541 Oxford Street, No.201 Berkeley, CA 94709 Yuri A. Tambovtsev Novosibirsk University Russkaya 25, KB 174 SU-630058 Novosibirsk-58 USSR Carlo Tasso Matemat, Informat e Sistem University of Udine Via Mantica 3 1-33100 Udine, ITALY Jeff Teeters Computer Science University of Massachusetts Amherst, MA 01003 Virginia Teller 2 Washington Square Village New York, NY 10012 Marjorie P. Templeton System Development Corporation MD 72-27 2500 Colorado Avenue Santa Monica, CA 90406 Harry R. Tennant Texas Instruments PO Box 225621, M/S 371 Dallas, TX 75265 Alan L. Tharp Computer Science North Carolina State Univ. Raleigh, NC 27650 Computational Linguistics, Volume 10, Number 1, January-March 1984"]},{"title":"73","paragraphs":["The FINITE STRING Newsletter 1983 ACL Membership List James W. Thatcher IBM TJ Watson Research Center PO Box 218 Yorktown Heights, NY 10598 Robert H. Thibadeau Robotics Institute Carnegie-Mellon University Pittsburgh, PA 15213 Glenn E. Thobe 6701 De Soto Ave, No.135 Canoga Park, CA 91303 Jeffrey C. Thomas 104 E. Yale Loop Irvine, (~A 92714 Kevvin Thomas Thomas Technologies, Inc. 420 12th Street Brooklyn, NY 11215 Richard Howard Thomas Collins Publishers PO Box Glasgow G4 0NB, SCOTLAND Bozena Henisz & Fred Thompson 766 Oak Knoll Circle Pasadena, CA 91106 Clifford L. Thompson 248 Kenston Court Geneva, IL 60134 Craig W. Thompson Texas Instruments, Inc. PO Box 226015, MS 238 Dallas, TX 75266 George Thompson 14, chemin Colladon CH- 1209 Geneva Switzerland Henry Thompson Artificial Intelligence University of Edinburgh Hope Park Square, Meadow Lane Edinburgh EH8 9NW, SCOTLAND Tim Thompson 1400 Smokey Wood Drive Apt.812 Pittsburgh, PA 15218 iarta Tobey 1510 Sonoma Avenue Albany, CA 94706 Ch. Todenhagen Rt.5 Box 92W Chico, CA 95926 E. So Toeche-iittler Verlagsbuchhandlung Hindenburgstrasse 33 6100 Darmstadt W. GERMANY Jerzy Tomaszczyk Institute of English University of Lodz Kosciuszki 65 PL-90 514 Lodz, POLAND James E. Tomayko 828 S. Holyoke Wichita, KS 67218 Yuko & iasaru Tomita Computer Science Carnegie-Mellon University Pittsburgh, PA 15213 Wayne Tosh English St. Cloud State University St. Cloud, MN 56301 H. Transgaard Huginsvej 9 DK-2680 Solroed Strand Copenhagen, DENMARK Robert Trappl Inst. Medizinische Kybernetik Universitaet Wien Freyung 6 A-1010 Wien, AUSTRIA Giuseppe Trautteur Istituto Fisica Teorica Mostra d'Oltremare PAD19 1-90125 Napoli, ITALY David J. Trawick 2120 Tynes Drive Placentia, CA 92670 Steven A. Trojnacki 2 Elinor Place Yonkers, NY 10705 Andrzej Trybulec Instytut Matematyki UW Akadernicka 2 PL-15 276 Bialystok, POLAND Hiroaki Tsurumaru Electronics Nagasaki University 1-14 Bunkyo-machi Nagasaki 852, JAPAN Charles Tucker Nova Graphics International 1015 Bee Cave Woods Austin, TX 78746 Pamela W. Tunnell 517 Truett Drive Tallahassee, FL 32303 Murray Turoff 1531 Golf Street Scotch Plains, NJ 07076 Giovanni Turrini Istituto di Linguistica Computazionale Via della Faggiola 32 1-56100 Pisa, ITALY Heath Tuttle SAS Institute PO Box 8000 Cary, NC 27511 iabry Tyson Artificial Intelligence Center SRI International EK254 Menlo Park, CA 94025 Seiichi Uchinami 1-6-10 Sone-Minami-Machi Toyonaka, Osaka 561 JAPAN Mr. Uchiyama/OUE Osaka University Midori Bookstore Co. PO Box 269, Osaka Central Osaka, JAPAN Laurence Urdang Box 668 Essex, CT 06426 Hans J. Uszkoreit Artificial Intelligence Center SRI International Menlo Park, CA 94025 Ramasamy Uthurusamy Exxon Production Research Co. PO Box 2189 Houston, TX 77001 Joseph Vaisman 98-39 65th Road, Apt 3B Rego Park, NY 11374 Darrel J. VanBuer 11840 Pacific Avenue Los Angeles, CA 90066 Christopher J.S. Vance c/o YWAM PO Box 296 Sunland, CA 91040 Frank VanEynde Inst v algemene taalwetenschap Katholieke Universiteit Leuven Blijde Inkornstraat 21 B-3000 Leuven, BELGIUM Andrew H. VanTuyl Naval Surface Weapons Center Code R44 Silver Spring, MD 20910 Denes Vargha Nepkoztarsasag u. 32 H-1061 Budapest, HUNGARY Giovanni B. Varile Commission of the EC J. Monnet Building, B4/106 L-2719 LUXEMBURG Richard G. Varsanik Calgon Corporation Calgon Center, Box 1346 Pittsburgh, PA 15230 Bernard Vauquois GETA Bibliotheque BAT CETA Domaine Univ. BP 53 F-38041 Grenoble, cedex FRANCE Jose Luis Velasco Casa del Medico Cigales (Valladolid) SPAIN Marco Veneziani v. F. Grossi Gondi 62 1-00162 Roma, ITALY M. Felisa Verdejo Facultad de Informatica Apartado 649 San Sebastian, SPAIN Jacques Vergne 29, rue Titron F-75011 Paris, FRANCE Christopher Vickery 8702 Palo Alto Street Holliswood, NY 11423 Marc Vilain Bolt Beranek and Newman 10 Moulton Street Cambridge, MA 02238 Robert R. Viscount 420 Vanderbilt Avenue New York, NY 11238 Juan Vishnivetz Av. Santa Fe 2029 3oB Capital Federal 1123 ARGENTINA R.M. Vismans Inst. Modern Dutch Studies University of Hull Hull HU6 7RX, ENGLAND Dusko Vitas Matematicki Institut KNEZ Mihailova 35 1100 Beograd, YUGOSLAVIA George Vladutz & N.A. Vleduts-Stokolov 520 Kathmere Road Havertown, PA 19083 Veil Voipio Summer Inst. of Linguistics PO Box 44456 Nairobi, KENYA Geoffrey vonLimbach 11820 79th Avenue S Seattle, WA 98178 Marika vonSydow 111 Cadima Avenue Coral Gables, FL 33134 Michel Voultoury Bull Systemes Route de Versailles F-78430 Louveciennes, FRANCE J.D. Vragel A.M. Best Company Ambest Road Oldwick, NJ 08858 Hiroshi Wada Information Processing Society of Japan, Nalgo Ltd 36-1 Udagawa, Shibuya Tokyo 150, JAPAN Tim Wadsworth 883 Montserate Avenue Chula Vista, CA 92011 Diane M. Wagner 3344 W. Tanforan Drive Englewood, CO 80110 K. Heinz Wagner Borkurner Strasse 5 D-2870 Delmenhorst WEST GERMANY John H. Wahlgren 3894 Yale Street Burnaby, BC, CANADA V5C 1P6 Sandra Waites 54 Kippington Road Sevenoaks, Kent TN13 2LL ENGLAND Jack Walden Digital Equipment Corporation 200 Forrest Street (MR01-1/M2) Marlboro, MA 01752 Adrian Walker 5846 Lalor Drive San Jose, CA 95123 Donald E. Walker Natural-Language and Knowledge- Resource Systems SRI International Menlo Park, CA 94025 James Robert Walker 5167 Haverford Drive Lyndhurst, OH 4,4124 Dieter Wall Gesellschaft Wissenschaftliche Datenverarbeitung, Am Fassberg D-3400 Gottingen W. GERMANY Robert E. Wall Linguistics University of Texas Austin, TX 78712 Bob Wallace Synamyn Software 219 First N. No.224 Seattle, WA 98109 Mark Wallace 5th Floor ICL Lovelace Road Bracknell, Berks RG12 4SN ENGLAND 74. Computational Linguistics, Volume 10, Number 1, January-March 1984 The FINITE STRING Newsletter 1983 ACL Membership List Chuck Walrad 2720-33 Ariane Drive San Diego, CA 92117 Sharon i. Walter RADC/COES Griffiss AFB, NY 13441 David L. Waltz Coordinated Science Lab. University of Illinois 1101 W. Springfield Urbana, IL 61801 Bob Ward Box 17244 St. Paul, MN 55117 Tom M. Warms 113 Shippen Road Erdenheim, PA 19118 Amy Warner Library & Information Science University of Illinois 1407 W. Gregory, 410 McKinley Urbana, IL 61801 John Warner 219 Burnam Court Richmond, KY 40475 Richard Warner English Colorado State University Fort Collins, CO 80523 David H.D. Warren 326 Encinal Avenue Menlo Park, CA 94025 David Scott Warren Computer Science SUNY at Stony Brook Stony Brook, NY 11794 Lawrence M. Washington Modern Languages SE Massachusetts University North Dartmouth, MA 02747 Kenneth C. Wasmundt 7043 W. Hinsdale Drive Littleton, CO 80123 Thomas Wasow Linguistics Stanford University Stanford, CA 94305 Kelley A. weaver 20 Surrey Drive Norwalk, CT 06851 Bonnie Lynn Webber Computer & Information Science Moore School University of Pennsylvania Philadelphia, PA 19104 Cheryl Weber Hazeltine Corporation Commack, NY 11725 David Weber Inst. Linguist. de Vevano Apartado 345 Huanuco, PERU Immo Wegner Oberloh 6 D-5830 Schwelm, W. GERMANY Eric Wehrli 39 Blvd de la Cluse CH- 1205 Geneve, SWITZERLAND Peter J. Weinberger Bell Laboratories 600 Mountain Avenue Murray Hill, NJ 07974 E. Judith Weiner Computer&Information Science Temple University Computer Activity Bldg Philadelphia, PA 19122 Glen S. Weinert 4943 Brewster Avenue San Jose, CA 95124 Michael A. Weininger School of Business Admin. University of Wisconsin Milwaukee, WI 53201 Scott Weinstein Philosophy University of Pennsylvania Philadelphia, PA 19104 Ralph M. Weischedel Computer & Information Science University of Delaware Newark, DE 19711 Stephen Weiss Computer Science New West Hall 035A University of North Carolina Chapel Hill, NC 27514 Raymond S. Weitzman Linguistics California State University Fresno, CA 93740 Carl Wilhelm Welin Tavastgatan 1A, 1Tr S-117 20 Stockholm, SWEDEN Paul Weston 1421 Rose Drive Champaign, IL 61820 Kenneth Wexler School of Social Sciences University of California Irvine, CA 92717 Eric S. Wheeler 555 Thornton Road S. Oshawa, CANADA L1J 6W6 Lesley Whiffin 1535 Masters Circle, Apt.146 Delray Beach, FL 33445 John S. White Siemens Corporation 5500 Broken Sound BIvd NW Boca Raton, FL 33432 Peter J. Whitelock Centre for Computational Linguistics UMIST, PO Box 88 Manchester, M60 1QD, ENGLAND J.L. Whitton Psychiatry, Toronto Western Hospital, Edith Cavell Wing 339 Bathurst Street, Rm 1 B04 Toronto, Ont. CANADA M5T 2S8 Grace L. Wiedeman 7817 Winona Court Annandale, VA 22003 Gio Wiederhold Computer Science Stanford University Stanford, CA 94305 Ludwik Wierzbowski Instytut Filologii Polskiej Uniwersytet Gdanski Wita Stwosza 55 PL-80 308, Gdansk, POLAND Leonard E. Wilcox, Jr. 389 Park Avenue Rochester, NY 14607 Yorick A. Wilks Computer Science University of Essex Wivenhoe Park, Colchester Essex, CO4 3SQ, ENGLAND Gerd Willee Inst. fuer Kommunikationsforschung und Phonetik Poppelsdorfer Allee 47 D-5300 Bonn 1, W. GERMANY John S. Williams CPAS/ASG HQ7G15 CIA.kp off;.sk 0.2;.kp on;.bd 1 Washington, DC 20505 S. C. Williams 1606A Linscomb Austin, TX 78704 Kirk Wilson 686 Massachusetts Avenue Cambridge, MA 02139 Perkins Wilson 204 Tuckahoe BIvd Richmond, VA 23226 Terry Winograd Computer Science Stanford University Stanford, CA 94305 Mats Wiren Computer & Information Science Linkoeping Universitaet S-581 83 Linkoeping, SWEDEN A.P.M. Witkam Herenstraat 50 NL-2313 AL Leiden NETHERLANDS Kent Wittenburg 605 E. 43rd Austin, TX 78751 Richard Wojcik Comparative Literature and Languages Hofstra University Hempstead, NY 11550 John H. Wolfe 4565 Coronado Avenue San Diego, CA 92107 Stephen Wolff Ballistic Research Laboratory Aberdeen Proving Ground MD 21005 Douglas Wong Electrical Engineering and Computer Science Union College Schenectady, NY 12006 Maurice K. Wong Texas Instruments Central Research Laboratories PO Box 226015, MS238 Dallas, TX 75266 William A. Woods, Jr. Applied Expert Systems Five Cambridge Center Cambridge, MA 02142 I. David Woolf U.S. Embassy APO, NY 09667 Jerzy Woronczak Instytut Filologii Slowianskiej PI. Nankiera 15 PL-50 140 Wroclaw, POLAND Graham Wrightson Information Sciences Victoria University Private Bag Wellington, NEW ZEALAND James L. Wyatt Modern Languages & Linguistics Florida State University Tallahassee, FL 32306 David C. Wyland 4804 Tonino Drive San Jose, CA 95136 Ronald Yager 315 East 78th Street New York, NY 10021 Norair S. Yemenidjian 34 West Street Bernardsville, NJ 07924 Man-Kam Yip 27 Parker Hill Road Roxbury, MA 02120 Victor H. Yngve Graduate Library School University of Chicago 1100 East 57th Street Chicago, IL 60637 Sho Yoshida Electronics Kyushu University 36 Fukuoka 812. JAPAN Han Yong You Computer Science SUNY Buffalo 4226 Ridge Lea Road Amherst, NY 14226 Douglas A. Young Computer Science University of Manitoba Winnipeg, Manitoba CANADA R3T 2N2 J. E. Young Behavior and Communication Polytechnic of Wales Ponty Pridd, Mid Glamorgan CF37 1DL, WALES UK Robert Young Schlumberger- Doll Research PO Box 307 Ridgefield, CT 06877 Lotfi Zadeh Computer Science University of California Berkeley, CA 94720 Annie Zaenen Linguistics Morrill Hall Cornell University Ithaca, NY 14853 Elena & Antonio Zamora 106 Watch Hill Lane Gaithersburg, MD 20878 Antonio Zampolli Laboratorio di Linguistica Computazionale, CNR Via della Faggiola, 32 1-56100 Pisa, ITALY Piero Zanetti c/o Chancellerie Federale CH-3003 Berne, SWITZERLAND Maria Zarebina Instytut Filologii Polskiej WSP Podchorazych 2 PL-30 084 Krakow, POLAND Computational Linguistics, Volume 10, Number 1, January-March 1984"]},{"title":"75","paragraphs":["The FINITE STRING Newsletter 1983 ACL Membership List Michael Zarechnak 1308 Farragut, NW Washington, DC 20011 Gian Piero Zarri CNRS LISH 54, Boulevard Raspail F-75270 Paris cedex 06, FRANCE Paul Zeldin Bell Laboratories Whippany Road Whippany, NJ 07981 Alexander Zholkovsky 316 Eastwood Avenue Ithaca, NY 14850 V. A. Zvegintsev Lomonosovskij Pr. 33 Bldg. 2 82 SU-117192 Moscow, USSR Arnold M. Zwicky 63 W. Beaumont Road Columbus, OH 43214 Addresses Unknown Frank A. Adrian Robert J. Campbell Robert & Joanne Cape Jeff ConMin Chris Esposito Ann Grafstein & Alan Bailin John Hof Robert J.P. Ingria Donald G. Martin Bradford W. Miller Naoyuki Ozawa Darryl Richman Anne Robinson"]},{"title":"Institutional Members Defence Research Ctr Salisbury","paragraphs":["OIC PS 1888 O/N 34530 Periodical Section (24)Bldg 40 GPO Box 2151 Adelaide, SA, 5001 AUSTRALIA Australian National University Library (Chifley) ANU GPO Box 4 Canberrra, ACT 2601 AUSTRALIA National Library of Australia Preliminary Processing NS 965-70 Canberra, ACT 2600 AUSTRALIA The Librarian, CSIRO Division of Computing Research PO Box 1800 Canberra City, ACT 2601 AUSTRALIA University of Newcastle Auchmuty Library Newcastle, NSW 2306 AUSTRALIA MacQuarie University Library North Ryde, NSW 2113 AUSTRALIA University of Sydney Fisher Library, Serials Sydney, NSW 2006 AUSTRALIA University of Queensland Librarian-Serials Dept Main Library St. Lucia, Queensland 4067 AUSTRALIA Monash University Library Wellington Rd Clayton, Victoria 3168 AUSTRALIA Universitaet Linz Universitaets Bibliothek A-4040 Linz-Auhof, AUSTRIA CCE Bibl. JCL 1/45 Rue de la Loi, 200 B-1049 Brussels, BELGIUM E. Story-Scientia/PVBA 8 P. Van Duyseplein B-9000 Ghent, BELGIUM U niversiteitsbibliotheek Krediet 211, Postbus 13 B-2610 Wilrijk, BELGIUM University de Sao Paolo Biblioteca Inst. Matem E Estat Caixa Postal 20570 00508 Sao Paolo, BRASIL Banco Itau S/A c/o Departamento de Estudos Tecnicos RuM Libero Badaro 293 -9andar 01095 Sao Paolo SP, BRASIL University of Calgary University Library Periodicals Department Calgary, Alberta CANADA T2N 1N4 University of British Columbia Library Proc. Ctr-Serials Div. 2206 East MalI-Univ Campus Vancouver, British Columbia CANADA V6T 1Z8 University of Victoria McPherson Library, Serials PO Box 1800 Victoria, BC CANADA VSW 3H5 University of Manitoba Current Periodicals Elizabeth Dafoe Library Winnipeg, Manitoba CANADA R3T 2N2 Memorial Univ. Newfoundland Periodical Division St. Johns, Newfoundland CANADA A1B 3Y1 Acadia University Library Serials Department Wolfville, NS, CANADA BOP lX0 Defence Research Establishment Library PO Box 1012 Dartmouth, NS, CANADA B2Y 3Z7 York University Scott Library/Central Serials 4700 Keele Street Downsview, Ontario CANADA M3J 2R2 MITEL Corporation Department of Translation Monique Painchaud 360 Legget Drive Kanata, Ontario CANADA K2K 1X3 University of Western Ontario D.B. Weldon Library Periodicals, Order/Receiving London, Ontario CANADA N6A 3K7 University of Ottawa Morisset Library Current Serials Ottawa, Ontario CANADA K1N 9A5 University of Toronto Library, Serials Department Toronto, Ontario CANADA M5S 1A5 Bell-Northern Centre de L'lnformation Technologie 3 Place de Commerce-Isle Soeur Montreal, Que, CANADA H3E 1H6 Concordia University Libraries-Serials Acquisition 1455 DeMaisonneuve Boulevard Montreal, Que, CANADA H3Q 2P7 University of Montreal Bibliotheque S.H.S CP 6202, Succ. A Montreal, Quebec CANADA H3C 3T2 Universite Laval Bibliotheque Acquisitions Periodiques 500428 Quebec City, Quebec CANADA G1K 7P4 Universite de Sherbrooke Bibliotheque Generale (G) Sherbrooke, Quebec CANADA J1K 2R1 University of Saskatchewan Library Order Serials Department Saskatoon, Saskatchewan CANADA S7N 0W0 Resident Representative UN Development Program PR CPR/82/006--Rong Xiuggan United Nations Beijing, CHINA The Royal Library Christians Brygge 8 DK-1219 Copenhagen K, DENMARK Odense Universitet Bibliothek TSS-RH Campusvej 55 DK-5230 Odense, M, DENMARK Roskilde Universitet Bibliothek PO Box 258 DK-4000 Roskilde, DENMARK University of Lancaster Serials, University Library Bailrigg, Lancaster LA1 4YH ENGLAND University of Sussex Library, Periodicals Section Brighton BN1 9QL, ENGLAND Brighton Polytechnic Learning Resources-Periodicals Watts Bldg, Moulsecoomb Brighton BN2 4G J, ENGLAND Tees!de Polytechnic The Librarian Middlesbrough Cleveland TS1 3BA ENGLAND University of Exeter Computer Science, fl 2 Physics Stocker Road Exeter, Devon EX4 4QL ENGLAND City of London Polytechnic Serials Librarian Old Castle Street London E1 7NT, ENGLAND Imperial College of Sci &Tech Lyon Playfair Library Computing & Control Collection South Kensington London SW7 2AZ, ENGLAND Science Reference Library Holborn Branch 25, Southampton Bldgs London WC2 lAW, ENGLAND UMIST Centre for Computational Linguistics, Librarian PO Box 88 Manchester, M60 1QD, ENGLAND Open University The Librarian Walton Hall Milton Keynes MK7 6AA, ENGLAND Bodleian Library Foreign Accessions Department of Printed Books Oxford, OX1 3BG, ENGLAND International Computers, Ltd. Systems Strategy Centre Stevenage, Herts SG1 2DY ENGLAND University College of Swansea Librarian, Periodicals Dept. Singleton Park Swansea SA2 8PP, GREAT BRITAIN British Library Accessions Dept, Lending Div Boston Spa, Wetherby Yorkshire LS23 7BQ ENGLAND Helsingin Yliopisto Laskentakeskus Tokholmankatu 2 7 KRS SF-00250 Helsinki 25 FINLAND Kotimaisen Kielten Tutkimuskeskus/ATK Liisankatu 16 A 9 SF-00170 Helsinki 17, FINLAND S.A.R.L. ERL! 72 qua! des Carrieres F-94220 Chatenton, FRANCE CAP SOGETI Centre de","Recherche de Grenoble 6, Boulevard Jean Pain F-38000 Grenoble, FRANCE CI! Honeywell Bull Centre Scientifique BP 53, Vania Joloboff F-38041 Grenoble cedex FRANCE GETA Bibliotheque Bernard Vauquois BAT CETA Domaine Univ.BP 53 F-38041 Grenoble, cedex FRANCE CNET/TSS/DAP M. Angelleti Route de Tregastel, BP 40 F-22301 Lannion, Cedex, FRANCE 76 Computational Linguistics, Volume 10, Number 1, January-March 1984 The FINITE STRING Newsletter 1983 ACL Membership List CII Honeywell Bull Jacques Printz 68 Route de Versailles F-78430 Louveciennes, FRANCE Laboratoires de iarcoussis Route de Nozay F-91460 Marcoussis, FRANCE ATP International (CNRS) 4 rue du Roi de Sicile F-75004, Paris, FRANCE Centre de Documentation CNRS Sciences Humaine BP 14006 F-75260 Paris, cedex 06 FRANCE Universite de Poitiers Bibliotheque Universitaire Section Droit- Lettres BP 605 F-86022 Poitiers, cedex FRANCE IRISA Bibliotheque d'lnformatique Avenue du General Leclerc F-35042 Rennes, cedex FRANCE Universite de Paris VIII Vincennes - Bibliotheque 2 rue de la Liberte F-93526 Saint-Denis, cedex 2 FRANCE Univ de Toulouse de Mirail Langages et Systemes Informat 10981S rue Vauquelin F-31058 Toulouse Cedex FRANCE U niversitaetsbibliothek Alter Postweg 120 D-8900 Augsburg W. GERMANY U niversitaetsbibliothek Bielefeld Postfach 8620 D-4800 Bielefeld 1 W. GERMANY Inst Kommunikationsforsch u Phonetik Universitaet Bonn Poppelsdorger Allee 47 D-5300 Bonn, W. GERMANY Universitaetsbibliothek Zeitschriftenstelle Universitaetsstr. 1 D-4000 Duesseldorf 1 W. GERMANY Universitaet Erlangen-Nuernbeg RRZE (G. Goerz) Martensstr. 1 D-8520 Erlangen W. GERMANY Gesellschaft fuer Information und Dokumentation (GID) ANN Bibliothek Herriotstrasse 5 D-6000 Frankfurt 71, W.GERMANY J W Goethe Universitaet Fachbereich Informatik (20) Dantestrasse 9 D-6000 Frankfurt am Main W. GERMANY Stadt. Univ. Bibliothek Zeitschrifterstelle Boehenheimer Landstr. 134-138 D-6000 Frankfurt/Main W. GERMANY GID Informationszentrum Lyonerstrasse 44-48 PO Box 710370 D-6000 Frankfurt-Main 71 W. GERMANY Universitaet Hamburg Fachbereich Informatik Bibl. Rothenbaumchaussee 67/69 D-2000 Hamburg 13 W. GERMANY Institut f Sprachwissenschaft Universitaet Koeln Albertus Magnus Platz D-5000 Koeln 41, W. GERMANY Computer Gesenschaft Konstanz F. Wollenweber TA 2 Postfach 1112 D-7750 Konstanz, W. GERMANY Universitaat Konstanz Die Bibliothek AM Giessberg Postfach 55 60 D-7750 Konstanz, W. GERMANY Inst f Deutsche Sprache Bibliothek Friedrich-KarI-Strasse 12 D-6800 Mannheim 1 W. GERMANY Bayer Staatsbibliothek Muenchen, Erwerbungsabt Ludwigstrasse 16 D-8000 Muenchen 34 W. GERMANY Siemens AG ZT ZTI INF 1 Herrn Dr. Lang Postfach 83 09 55 D-8000 Muenchen 83 W. GERMANY Westfaelische Wilhelms Univ. Englisches Seminar Johannistrasse, 12-20 D-4400 Muenster W. GERMANY U niversitaetsbibliothek Heinrichstrasse 28-30 Postfach 4469 D-4500 Osnabrueck W. GERMANY Universitaet Regensburg U niversitaetsbibliot hek Postfach 409 D-8400 Regensburg 2, W. GERMANY Gesellschaft iathematik u Datenverarbeitung Bibliothek PF 12 40 Schloss Birlinghoven D-5205 St. Augustin 1 W. GERMANY Universitaets-Bibliothek Trier 072 Zeitschriften Erwerbung Postfach 3825 D-5500 Trier, W. GERMANY Universitaet Tuebingen Fachb. Neuphilologie Bibl. Wilhelmstrasse 50 D- 7400 Tuebingen W. GERMANY Gesamthochschulbibliothek Wuppertal 043 Zeitschriftenstelle Gaussstr. 20, Postfach 100127 D-5600 Wuppertal 1, W. GERMANY Chinese University, Hong Kong University Library Miss Kan, Lai-bing Shatin, N.T. HONG KONG Delhi University Central Library, Periodicals Delhi 110 007, INDIA Indian Institute of Technology Library Kharagpur 721 302. INDIA Central Institute of Indian Languages--The Librarian Manasagangotri Mysore, 570 006. INDIA National Institute for Higher Education Library Glasnevin Dublin 9, IRELAND University College Dublin Arts Library Belfield Dublin 4, IRELAND University of Haifa Library Periodicals Department Mount Carmel Haifa, ISRAEL National University Library, Periodicals PO Box 503 Jerusalem 91-004, ISRAEL Scuola Superiore Normale G.R. Romoli Strada Prov di Coppito, Kin0.3 1-67010 Coppito (AQ) ITALY ELSAG S.p.A. Elettronica San Giorgio Ufficio RRL Via Hermada, 6 1-16154 Genoa Sestri P, ITALY Istituto di Cibernetica Attn: Giovani degli Antoni Biblioteca Via Moretto da Brescia 9 1-20133 Milano, MI ITALY Istituto di Elettrotechnica ed Elett ronica-Politecnico Piazza Leonardo da Vinci n. 32 1-20133 Milano, ITALY Laboratorio di Linguistica Computazionale, CNR Via della Faggiola, 32 1-56100 Pisa, ITALY IBM Italia S. PA., Ricerca Scientifica, Centro Document. Attn: Sig. R.A. Bonelli Via Gorgione 105 1-00100 Roma, ITALY Istituto di Psicologia del CNR Via dei Monti Tiburtini 509 1-00157 Roma, ITALY Lab di Psicologia dell'eta Evolutiva, Fac di Magistero Via Tigor 22 1-34124 Trieste, ITALY Universita degli Studi di Udine, Ist. iatematica Info e Sistemistica Via Mantica 1 1-33100 Udine, ITALY Fukuoka University Toshokan (SNT) Nanakuma Fukuoka-shi Fukuoka 814 JAPAN Kyushu University 36C Kogakubu Denshi Hakozaki Fukuoka 812 JAPAN (FKK) Kyushu University 39F Soriko-Joho Kasuga 816 JAPAN (FKK) iitsubishi Electric Corp. Kamakura Works Library (HOHO-D) 325 Kamimachiya Kamakurashi 247 JAPAN NEC Corporation Central Research Lab (DIP) 4-1-1 Miyazaki Miyamae Kawasaki-shi 213 JAPAN Kyoto University (ASA) Ohgata- Keisanki Center Sakyo-ku Kyoto 606 JAPAN Kinokuniya Book Store Kyoto Office (Kyoto U Rms Ken) Fukoku Bid Shijyo Higashinotoin Shirnogyo-ku Kyoto 600 JAPAN (KIN) Kizawa-Ken Osaka University Faculty Engineering Science Machikaneyama Toyonaka Osaka 560 MZ JAPAN Osaka Daigaku Sanken-Lib 8-1 Mihogaoka, Ibaraki-shi Osaka 567 MZ JAPAN Yamaguchi University Kogakubu Library Tokiwadai Ube-Shi 755 MZ JAPAN Densoken Tosho(1) Midori Book Store-Tokyo Branch PO Box 5110 Tokue Int. 1 Tokyo JAPAN Densoken Tosho(2) Midori Book Store-Tokyo Branch PO Box 5110 Tokue Int. 1 Tokyo JAPAN Densoken Tosho(3) Midori Book Store-Tokyo Branch PO Box 5110 Tokue Int. 1 Tokyo JAPAN Electrical Communication Laboratory Library KSB Midoricho, Musashino-shi Tokyo 180 JAPAN Fuji Corporation Busicen Bldg 5F 5-29-7, Jingumae Shibuya-ku Tokyo 150 JAPAN Fuzoku Toshokan(DIP) Denki Tsushin Daigaku 1-5-1 Chofugaoka, Chofu-Shi Tokyo 182 JAPAN Kokkai-Toshokan Kagaku-JPT Nagata-cho Chiyoda- Ku Tokyo 100 JAPAN Nihon Univac Co. Ltd. Joho Center (KAI) 2-17-51 Akasaka, Minato-ku Tokyo 107 JAPAN Computational Linguistics, Volume 10, Number 1, January-March 1984"]},{"title":"77 The FINITE STRING Newsletter 1983 ACL Membership","paragraphs":["List Nippon IBM Company Ltd (1) JSI Library DAI 36 Kowa BIdg 5-19 3-Bancho Chiyoda-ku Tokyo 102 JAPAN (KIN) Ricoh Company Ltd. Gijutsuhonru- Shiryoshitsu 3-6, Naka-magome-1-chome Ohta-ku Tokyo 143 MZ JAPAN Waseda University Riko-Gakabu Toshoshitusu Ohkubo 3-chome, Shinjuku-ku Tokyo 160 JAPAN National Univ. of Malaysia Librarian PMK 78/122(T) Library-Serials-Acquisitions Bangi, Selangor MALAYSIA University of Malaya Cooperative Bookstore Ltd PO Box 1127 Jalan Pantai Bahru Kuala Lumpur, MALAYSIA Universiti Sains Malaysia Serials & Documents Division University Library Minden Penang, MALAYSIA El Colegio de Mexico Bibl. Daniel Cosio Villegas Adquisiciones/Apdo Post 20-671 Camino AI Ajusco No.20 Mexico 20 DF, MEXICO Library aathematisch Centrum PO Box 4079 NL-1009 AB Amsterdam NETHERLANDS Philips 23323501 IPO Bibliotheek HWP Postbus 218 NL-5600 MD, Eindhoven NETHERLANDS U niversiteitsbibliotheek SZ 110, Postbus 19185 NL-1000 GD Amsterdam NETHERLANDS Universiteitsbibliotheek SZ 291, Postbus 19185 NL-1000 GD Amsterdam NETHERLANDS Bibl, der Rijksuniversiteit te Groningen Dude Kijk in't Jatstraat 5 Postbus 559 Groningen, NETHERLANDS IWIS-TNO PO Box 297 NL-2501 BD The Hague NETHERLANDS Bibl.der Rijksuniversiteit"]},{"title":"Tijdsehriftenafdeling","paragraphs":["Postbus 9501 NL-2300 RA Leiden NETHERLANDS Rijksuniversiteit Centr Rekeninst Documentie Kamer Postbus 9512 NL-2300 RA Leiden, NETHERLANDS Max Planck Institute fuer Psycholinguistik Berg en Dalseweg 79 NL-6522 BC Nijmegen NETHERLANDS U niversieteitsbibliotheek 229 A 600 509 Erasmuslaan 36 NL-6526 GG Nijmegen NETHERLANDS Katholieke Hogeschool Bibliotheek Afd Tijdschriften Hogeschoollaan 225 Tilburg, NETHERLANDS Inst. v. Toegepaste Taalkunde en Computerlinguistiek Trans 14 NL-3512 JK Utrecht NETHERLANDS Summer Inst. of Linguistics Branch Library Box 415, Ukarumpa Via Lae Papua, NEW GUINEA University of Canterbury Library Private Bag Christchurch 1, NEW ZEALAND Institutt for Fonetikk og Lingvistikk Sydnesplass 9 N-5000 Bergen, NORWAY UB's Bibliotekstjeneste HF-EDB-tjensten Box 1009 - Blindern Oslo 3, NORWAY Univer. i Trondheim-De Kgl Norske Videnskabers Selskab Biblioteket Erling Skakkes gt 47 C N-7000 Trondheim, NORWAY BKWZ EKSPEDYCJA 7369/82 Wronia 23 PL-00 840 Warszawa, POLAND Warsaw University Institute of Informatics PKiN p.850 PL-00 901 Warszawa, POLAND Laboratorio Nacional de Engenharia Civil Avenida do Brasil 101 1799 Lisboa Codex PORTUGAL Universidade Nova de Lisboa Faculdade de Ciencias y Tecnologia Quinto do Cabeco-Olivais 1899 Lisboa PORTUGAL 3 Librarian, Department of Artificial Intelligence University of Edinburgh Edinburgh EHI 2QL, SCOTLAND National Univ. Singapore Central Library, Serials Dept Kent Ridge SINGAPORE 0511 Data Generics (PTY) Ltd Attn: Bryan Summers 7th Floor Tuition House 328 Smith Street, Durban 4001 REPUBLIC OF SOUTH AFRICA University of Stellenbosch Library Private Bag 5036 Stellenbosch 7600 REPUBLIC OF SOUTH AFRICA Universidad Autonoma Barcelona Edificio Rectorado Biblioteca General Bellaterra- Barcelona, SPAIN Goeteborgs Universitet Sprakdata Box 53261 S-400 16 Goeteborg 53, SWEDEN Linkoepings Universitets-Bibliotek Konto 50-3 S-581 83 Linkoping, SWEDEN University of Lund Linguistics Attn: Britt Nordbeck Helgonabacken 12 S-223 62 Lund, SWEDEN Kungl. Biblioteket Box 5039 S-102 41 Stockholm, SWEDEN Stockholms Universitet Institutionen foer Lingvistik S-106 91 Fack Stockholm 50 SWEDEN Umea University Library Periodical Department PO Box 718 S-901 10 Umea, SWEDEN Centrum for Datorlingvistik Sturegatan 13BV S-752 23 Uppsala, SWEDEN Uppsala Datacentral Box 2103 S-750 02 Uppsala 2, SWEDEN Uppsala University Center for Computational Linguistics, Box 256 S-751 01 Uppsala, SWEDEN Institut Dalle iolle ISSCO 54, route des Acacias CH-1227 Geneve, SWITZERLAND Universitaet Zurich Seminar fuer AIIgerneine Sprachwissenschaft Plattenstrasse 54 CH-8032 Zurich, SWITZERLAND Inst. Information Science Academia Sinica Nankang Taipei 115, TAIWAN Doc Dr Niluefer Tuncer Yueksek Oegretim (Dokuemantasyon Merkezi) Bilkent, Ankara, TURKEY University of Massachusetts Library, Serials Department Amherst, MA 01003 Williams College Library Williamstown, MA 01267 Worcester Polytechnic Inst. George C. Gordon Library Worcester, MA 01609 Wang Laboratories Corporate Library Mail Stop 1389 1 Industrial Avenue Lowell, MA 01851 Wang Institute Library Tyng Road Tyngsboro, MA 01879 China National Publications(6) Import Corp. Check In Service 15 Southwest Park Westwood, MA 02090 National Science & Technology Library & Information Center Check In Service 15 Southwest Park Westwood, MA 02090 Harvard College Library Serial Records Division Cambridge, MA 02138 LCS Reading Room MIT Room 113 545 Technology Square Cambridge, MA 02139 MIT Libraries Serial Journal Rm 14E210 Cambridge, MA 02139 GTE Laboratories, Inc. 40 Sylvan Road Waltham, MA 02254 Bolt Beranek and Newman Library 87 Fawcett Street Cambridge, MA 02238 Artificial Intelligence Corp. 200 Fifth Avenue Waltham, MA 02254 Brandeis University Gerstenzang Science Library Waltham, MA 02254 NUSC Technical Library Code 021312 Building 103 Newport, RI 02841 Brown University Rockefeller Library Serials Department, R016185 Providence, RI 02912 Dartmouth College Baker Library, Serials Section Hanover, NH 03755 University of New Hampshire Library Acquisitions Durham, NH 03824 University of Vermont Howe Library Guy W. Bailey Serials-Acquisitions Dept Burlington, VT 05405 SiS Industries 17-19 Washington Avenue Tenafly, NJ 07670 Bell Laboratories R. Canaday, 3C-303 055775 600 Mountain Avenue Murray Hill, NJ 07974 Bell Laboratories c/o J. Fostik, 2D-525 600 Mountain Avenue Murray Hill, NJ 07974 AT&T Business &Technical Research Center 10-4A1000 444 Hoes Lane Piscataway, NJ 08854 Rutgers-The State University Math Sciences Library Attn: Sylvia Walsh New Brunswick, NJ 08903 NYU Bobst Library TSD-Serials Dept 70 Washington Square New York, NY 10012"]},{"title":"78","paragraphs":["Computational Linguistics, Volume 10, Number 1, January-March 1984 The FINITE STRING Newsletter 1983 ACL Membership List Elsevier Publishing Alan Corneretto, Senior Editor 52 Vanderbilt New York, NY 10017 IBM Systems Research Institute Librarian 205 E. 42nd Street, 7th floor New York, NY 10017 New York Public Library, Div.P Grand Central Station PO Box 2240 New York, NY 10017 City University of New York Graduate School Library Serials 33 West 42nd Street New York, NY 10036 IBM Thomas J. Watson Research Center Library PO Box 218 Yorktown Heights, NY 10598 SUNY Stony Brook Serials Dept, Library Stony Brook, NY 11794 Rensselaer Polytechnic Inst. Library Serials Department Troy, NY 12180 SUNY Albany Library Procurement, Serials 1400 Washington Ave Albany, NY 12222 Vassar College Library Poughkeepsie, NY 12601 SUNY Buffalo Lockwood Memorial Library Serials Department Buffalo, NY 14260 University of Rochester Serials, Binding, Library River Station FSA Rochester, NY 14627 Cornell University Libraries Newspaper Department Ithaca, NY 14853 Carnegie-Mellon University Hunt Library Pittsburgh, PA 15213 Pennsylvania State Univ. Serial Records, Pattee Library University Park, PA 16802 Dickenson College Library, Periodical Department Carlisle, PA 17013 University of Pennsylvania Library, Serials Dept-CH 3420 Walnut Street Philadelphia, PA 19104 Sperry Univac Information Center E. Gresans PO Box 500, MS 1A-E2-112 Blue Bell, PA 19424 University of Delaware Library - Serials Department Newark, DE 19717 Howard University Library Acquisitions Dept Serials Room 105 Washington, DC 20059 Library, DCRT National Institutes of Health Bethesda, MD 20205 DMA/HTC MK for: D58000 P136 6500 Brooks Lane, Attn: SDSIM Washington, DC 20315 Librarian, Code 2622 Naval Research Laboratory Washington, DC 20375 US Department of Justice Drug Enforcement Administr. 1405 Eye Street, NW Washington, DC 20537 Engineering Library University of Maryland College Park, MD 20742 National Security Agency Attn: Lang Library Fort George G. Meade, MD 20755 Virginia Polytechnic Institute and State University Serials-Receiving Section Carol M. Newman Library Blacksburg, VA 24061 University of North Carolina Serials Department Wilson Library 024-A Chapel Hill, NC 27514 North Carolina State Univ. Acquisitions Dept (C) D.H. Hill Library PO Box 5007 Raleigh, NC 27650 Duke University Library Periodicals-Engineering Durham, NC 27706 Univ. of South Carolina Serials Department Thomas Cooper Library Columbia, SC 29208 Georgia Inst. of Technology Library 225 North Ave, NW Atlanta GA 30332 University of Georgia Library, Serials Athens, GA 30602 Florida State University R.M.Strozier Library, Serials Tallahassee, FL 32306 University of Alabama Mervyn Sterne Library University Station Birmingham, AL 35294 University of Tennessee Library, Serials Knoxville, TN 37996 University of Louisville Ekstrom Library Serials Control Unit Louisville, KY 40292 Ohio State University Library, Serials Division 1858 Nell Avenue Columbus, OH 43210 Bowling Green State University Science Library Math Sciences Bldg, Room 308 Bowling Green, OH 43403 University of Toledo Carlson Library, Serials Dept Toledo, OH 43606 Youngstown State University William F. Magg Library Serials 002300 410 Wick Avenue Youngstown, OH 44555 Mead Data Central Attn: Programming (WK Thomson) 9333 Springboro Pike Miamisburg, OH 45342 Ohio University Library, Acquisitions Athens, OH 45701 Indiana University (2) Library, Serials Bloomington, IN 47405 Indiana State University Library, Serials Terre Haute, IN 47809 Purdue University Libraries, Serials Unit 10022 PCF-Kardex West Lafayette, IN 47907 GMC Technical Center Research Laboratory Library Dock 7 13 Mile at Chicago Road Warren, MI 48090 University of Michigan General Library Ann Arbor, MI 48109 Wayne State University Purdy Library Serials Acquisition Department Detroit, MI 48202 Burroughs Corporation Attn: Alan M. Perlman Burroughs Place, Room 2F24 Detroit, MI 48232 Iowa State University Library Serials Department Ames, IA 50011 Grinnell College Academic Computing Attn: Thomas Moberg Grinnell, IA 50112 University of Northern Iowa Library (TS) Serials Section Cedar Falls, IA 50613 University of Iowa Libraries, Serials Dept Iowa City, IA 52242 University of Wisconsin Engineering Library 215 N. Randall Madison, Wl 53706 University of Minnesota Libraries, Serial Records Minneapolis, MN 55455 Roy C. Ingersoll Research Ctr Borg-Warner Corporation Des Plaines, IL 60018 Computer Science Library PO Box 3014 Northbrook, IL 60062 Northwestern University Library, Serials Evanston, IL 60201 Illinois Inst. Technology Computer Science Department (Eros Heraclitus) Chicago, IL 60616 University of Chicago Joseph Regenstein Library Serials Department 1100 East 57th Street Chicago, IL 60637 University of Illinois Library Serials-FAX 1408 W Gregory Drive Urbana, IL 61801 Southern Illinois University Morris Library Periodicals Recording Clerk Carbondale, IL 62901 University of Missouri, KC Library Serials Dept, Periodicals 5100 Rockhill Road Kansas City, MO 64110 University Missouri-Columbia Library, Serials Department Columbia, MO 65201 University of Kansas Libraries Periodicals, Serials Dept Lawrence, KS 66045 University of Nebraska Libraries Acquisition Dept. Lincoln, NE 68588 Tulane University Library Serials Section New Orleans, LA 70118 Univ. Southwestern Louisiana Dupre Library, Serials Dept 302 East Mary Boulevard Lafayette, LA 70504 Louisiana State University Library, Serials Department Baton Rouge, LA 70803 Summer Inst. of Linguistics Dallas Norman Library 7500 W. Camp Wisdom Road Dallas, TX 75236 Summer Inst. of Linguistics University of N. Dakota Branch Attn Librarian 7500 W. Camp Wisdom Road Dallas, TX 75236 East Texas State University Library Serials Commerce, TX 75428 North Texas State Univ. Library, 902929 Box 5188--NT Station Denton, TX 76203 Texas A & i University Library, Serials Record College Station, TX 77843 UNAM C 43801 B and P PO Box 5179 McCallen, TX 78502 University of Texas General Libraries Central Serials Record Austin, TX 78712 Denver Research Institute/SSRE Jennie Miller (2) University of Denver PO Box 10127 Denver, CO 80210 University of Colorado Library, Serials Department Boulder, CO 80309 Computational Linguistics, Volume 10, Number 1, January-March 1984"]},{"title":"79","paragraphs":["The FINITE STRING Newsletter 1983 ACL Membership List University of Utah Library Serials Order Division Salt Lake City, UT 84112 Sperry Univac Library H7 B2 c/o Phyllis Tadlock 322 No. 2200 West Salt Lake City, UT 84116 ALPS, Automatic Language Processing Systems 190 West 800 North Provo, UT 84601 Brigham Young University Harold Lee Library Serials Section Provo, UT 84602 Arizona State University Library Periodicals Tempe, AZ 85287 University of Arizona Library, Serials Department Tucson, AZ 85721 University of New Mexico General Library Serials Department Albuquerque, NM 87131 New Mexico Institute of Mining and Technology The Library, Serials Dept Socorro, NM 87801 New Mexico State University University Library Serials Department Box 3475 Las Cruces NM 88003 University of California Engineering & Math Sciences Library, Serials Section 8270 Boelter Hall Los Angeles, CA 90024 University of California University Research Library Serials Department Los Angeles, CA 90024 Xerox Corporation Technical Library, A3-25 701 S. Aviation Boulevard El Segundo, CA 90245 USC Information Sciences Inst. Library 4676 Admiralty Way Marina del Rey, CA 90291 University of California SD Serials Dept, Library C-075A La Jolla, CA 92093 NPRDC Library Building 322 271 Catalina BIvd San Diego, CA 92152 University of California Serials Department General Library PO Box 19557 Irvine, CA 92713 University of California SB Library, Serials Santa Barbara, CA 93106 SRI International Advanced InformationTechnology Applications Dept, Bldg G Attn: Boyd Fair Menlo Park, CA 94025 ATARI, Inc. Systems Research Library 1196 Borregas Sunnyvale, CA 94086 Kestrel Institute 1801 Page Mill Road Palo Alto, CA 94304 IBM Scientific Center Library 1530 Page Mill Road Palo Alto, CA 94304 Stanford University Library, Serials Division Stanford, CA 94305 Lawrence Livermore Laboratory Library, L-53 Box 5500 Livermore, CA 94550 Lawrence Livermore Nat'l Lab. L-300 User Service Division Box 808 Livermore, CA 94550 Cetus Corporation Attn: Library-CRL 1400 53rd Street Emeryville, CA 94608 Cognitive Science Program Institute of Human Learning University of California, T-4 Berkeley, CA 94720 University of California Newspaper Division 01 Main Library Berkeley, CA 94720 SORCIM Corporation Richard Frank 2310 Lundy Avenue San Jose, CA 95131 San Jose State University Serials Dept, Clark Library Washington Square San Jose, CA 95192 California State University Stanislaus Library Periodical Division 801 W. Monte Vista Avenue Turlock, CA 95380 University of Hawaii Library, Serials- Receiving-HL 2550 the Mall Honolulu, HI 96822 Portland State University Attention: Library Serials PO Box 1151 Portland, OR 97207 Oregon State University Kerr Library, Serials Dept Corvallis, OR 97331 University of Oregon Library, Serials Eugene, OR 97403 Washington State Univ. Science & Engineering Library Pullman, WA 99164 Gos Publichnaia NT Biblio 01 Sibirskoi Otdelenie an SSR Mezhnigoobmen ul Voskhod 15 Novosibirsk 200, USSR Institut Jozef Stefan Jamova 39 61001 Ljubljana, YUGOSLAVIA 80 Computational Linguistics, Volume 10, Number 1, January-March 1984"]}]}