{"sections":[{"title":"Book Review Language as a Cognitive Process Book Review The Textbook Problem: Winograd's Language as a Cognitive Process","paragraphs":["Winograd's three ambitious goals for Language as a Cognitive Process. Volume 1. Syntax (henceforth LCP1) were to provide (1) a textbook for beginning graduate students, (2) a practical guide for builders of natural language systems, and (3) a reference source for linguistics and computer science. These three goals are not easily reconciled within a single book, even one to be expanded to two volumes. With its comprehensive coverage of the literature and its evenhanded treatment of a variety of formalisms, LCPI is most successful as a reference volume. It is less successful as a practical guide for system builders who need programming examples because, despite numerous helpful suggestions, Winograd chose to present algorithms in his own special description language (DL), thus requiring students to translate these descriptions into some programming language in order to implement them. As a textbook, however, I believe LCP1 founders.","A reasonable textbook should present (i) material ordered in a sequence that leads the student naturally through subject matter that reflects (ii) the author's clearly expressed point of view and (iii) a coherent rationale for the selective coverage of the particular field. Chapters 2, 3, and 5 satisfy requirement (i) by marching steadily from the simpler to the more complex, from transition networks through context-free grammars and pars-ing to recursive transition networks, and finally ATNs. Chapter 1 satisfies the second of these ideals with a presentation of the \"computational paradigm\". Winograd's comparison of this with the \"generative paradigm\" offers the student a valuable perspective on the kinds of claims (modularity, communicative goals, knowledge representation, and the like) that computational models make about language comprehension.","The central problems lie with item (iii). In nearly every case where clarity and brevity would dictate that a detail be omitted or an alternative ignored, Winograd instead includes the additional material required for the nearly exhaustive coverage of a reference book. Two examples will illustrate. In Section 3.1 three approaches to assigning constituent structure (head and modifier, immediate constituent, and slot and filler) are treated equally even though the head and modifier method is not referred to elsewhere in LCP1. In Section 3.4 the samples of context-free non-deterministic recognition procedures include top-down backtracking, top-down parallel and bottom-up parallel algorithms with bottom-up backtracking left as an exercise. Because of such comprehensive coverage, using LCPI as a textbook is a bit like adopting The Handbook of Artificial Intelligence for an AI course or assigning Knuth's three-volume work The Art of Computer Programming for a course in algorithms.","Moreover, Winograd makes little attempt to distinguish required (or more important) from optional (or less important) information. That it is possible and useful to make such distinctions is illustrated by the organization of John Sowa's new AI text (Sowa 1983). Introductory material is presented in the first section of each chapter and the first page or two o,f subsequent sections so that when the material advances beyond one's level of interest a reader may skip to the next section without losing continuity.","As a linguist trained in generative grammar, I found Chapter 4, \"Transformational Grammar\", among the least satisfactory. Chomsky's linguistic theory has contributed much to our understanding of language as a cognitive process but little to the field of natural language processing or to the emergence of the computational paradigm. Given Winograd's computational stance, the rationale is weak for devoting an entire chapter plus an appendix (\"Current Directions in Transformation Grammar\") to major developments in generative linguistics from Syntactic Structures to trace theory. Linguistics students have far better sources to learn about the work of Chomsky and other generativists, and computer scientists, by and large, are indifferent. If the goals of LCP1 were less global, this material could have been greatly reduced without ill effect.","The purpose of Chapter 6 is not at all clear. Entitled \"Feature and Function Grammars\", the chapter contains an amorphous collection of grammatical formalisms whose common theme appears to be their emphasis on functional considerations. Most attention is given to Halliday's systematic grammar even though this approach has not figured importantly in computational work or contributed major insights to the cognitive perspective on language. Curiously, Winograd only mentions in passing the strong influence that systemic grammar had on SHRDLU's procedural semantics. Along with case grammar, brief descriptions of several newer approaches - lexical-functional grammar, generalized phrase structure grammar, and definite clause grammar - are tossed in almost as afterthoughts. 148 Computational Linguistics Volume 10, Number 2, April-June 1984 Book Review Language as a Cognitive Process","The first six chapters of LCP1 exemplify a recent trend in AI textbooks toward covering the inventory of principles, algorithms, and data structures that comprise the basic knowledge of the field (e.g., Rich 1983 and Winston 1984) rather than describing existing systems (e.g., Winston 1977 and Tennant 1981). Though admirable in many respects, this more theoretical orientation fails at times to provide the necessary links between the abstractions being taught and real world examples in a field whose most significant achievements lie in the success of its implemented systems. To counter this potential problem, Chapter 7, \"Computer Systems for Natural Language Parsing\", contains summaries of over fifty projects.","The main difficulty with LCP1 is that language as a cognitive process, by Winograd's own definition, is a concept too broad to fit within the confines of one book. In his March 1982 Preface Winograd wrote that this first of what was to become a two-volume text had its origins nearly ten years earlier in notes for a one-term course that he gradually expanded over the years into enough material for three terms. The division into separate volumes on syntax and semantics, whatever its pedagogical usefulness, is artificial, as Winograd himself recognizes, and belies, in practice if not in spirit, the necessary interaction between the two in natural language processing systems.","According to this preface, Winograd's views of language and cognition changed significantly while work-ing on LCP1. None of his newer ideas are incorporated in this text, however, despite the fact that he presented his more recent thinking as early as 1979 at the La Jolla Conference on Cognitive Science (Winograd 1980). Indeed, at La Jolla Winograd proposed a fundamental shift away from a focus on language as cognitive processing to a focus on language as that part of \"the domain of human action and interaction\", that is reflected in human discourse and advocated speech acts as the basis for a theory of \"language interaction\".","For a typical one-term introductory graduate level course there is a real need for a text that covers both syntax and semantics in a single volume. Volume 1 was useful as a text for only about 65% of my course. When students selected topics for term projects, almost all chose to investigate natural language systems or to explore issues in semantics.","Volume 2 will surely rival its predecessor in importance if the treatment of semantics and other aspects of meaning equals the coverage of syntax in Volume 1. Nonetheless, whatever its enduring value as a reference work, its everyday usefulness as a textbook is highly questionable, Nirenburg (1983) to the contrary notwithstanding."]},{"title":"Virginia Teller","paragraphs":["Computer Science Department Hunter College, CUNY New York, NY 10021","References","Barr, A.; Feigenbaum, E.; and Cohen, P. 1981-2 The Handbook of Artificial Intelligence. William Kaufmann, Los Altos, California.","Grishman, R. In preparation An hltroduction to Computational Linguistics.","Knuth, D. 1973-1981 The Art of Computer Programming. Three Volumes. Addison-Wesley, Reading, Massachusetts.","Nirenburg, S. 1983 Review of Language as a Cognitive Process. Volume 1. Syntax by T. Winograd. American Journal of Computational Linguistics 9( 1 ): 25-29.","Rich, E. 1983 Artificial Intelligence. McGraw-Hill, New York, New York.","Sowa, J. 1983 Conceptual Structures. Information Processing m Mind and Machine. Addison-Wesley, Reading, Massachusetts.","Tennant, H. 1981 Natural Language Processing. Petrocelli, Princeton, New Jersey.","Winston, P. 1977 Artificial Intelligence. First Edition. Addison-Wesley, Reading, Massachusetts.","Winston, P. 1984 Artificial Intelligence. Second Edition. Addison-Wesley, Reading, Massachusetts.","Winograd, T. 1980 What Does It Mean to Understand Language? Cognitive Science 4: 209-241. Also in Norman, D., Ed., Perspectives in Cognitive Science. Ablex, Norwood, New Jersey: 231-263.","Winograd, T. 1983 Language as a Cognitive Process. Volume 1. Syntax. Addison-Wesley, Reading, Massachuetts. Computational Linguistics Volume 10, Number 2, April-June 1984 149"]}]}