{"sections":[{"title":"INTERPRETING TEMPORAL ADVERBIALS* Chung Hee Hwang & Lenhart K. Schubert Department of Computer Science, University of Rochester Rochester, New York 14627-0226 Abstract","paragraphs":["We take for granted that sentences describe situations [2, 12]. One of the most important properties of situations are then their temporal locations, which are indicated by tense and aspect and temporal adverbials in the surface form. In [10, 22], we offered a formal theory for English tense and aspect and an algorithm that computes the temporal relationships between the situations implicitly introduced by a text. In the present paper, we propose a systematic approach to temporal adverbials, fully integrated with our tense-aspect theory and the inte~retive algorithms, using the Episodic Logic (EL) formalism [9, 11, 12, 211. 1. INTRODUCTION Previous theoretical work on temporal adverbials has mostly concentrated on adverbials specifying temporal locations (e.g., \"yesterday\"), durations (e.g., \"for a month\") and time spans (e.g., \"in three hours\"). It appears that interest in the first kind of adverbial originated from the desire to correct the erroneous analyses provided by Priorean tense logics, in particular, their treatment of the interaction between time adverbials and tense. The second and third kinds of adverbials were often considered in connection with the aspectual classes of the vPs or sentences those adverbials modify (e.g., durative adverbials may modify only stative sentences, whereas adverbials of time span may modify only accomplishment sentences). However, other kinds of temporal adverbials have received little attention, including ones specifying repetition: The engineer shut down the motor twice yesterday. The engine frequently broke down. The operator checked the level of oil every half hour. The inspector visits the lab every Monday. On our analysis, these sentences describe complex events, consisting of a sequence of subevents of specified types, and the given adverbials modify the structure of these complex events: the cardinality of component events (\"twice\"), the frequency or distribution pattern of component events (\"frequently,\" \"regularly,\" \"every half hour,\" etc.), and the temporal location of cyclic events that occur synchronously with other recurrent time frames or events (\"every Monday\" or \"every time the alarm went off''). Other issues that deserve further investigation are the interactions between multiple temporal adverbials, and various kinds of aspectual class shift due to aspectual class constraints on the use of adverbials (occurring singly or jointly with others). The following sentences illustrate these issues.","*This research was supported in part by NSF Research Grant IRI-9013160 and ONR/DARPA Research Contracts No. N00014-82-K-0193 and No. N00014-92-J-1512. The authors benefited from example sentences by Greg Carlson and Phil Harrison.","John ran for half an hour every morning for a month.","John stepped out of his office for fifteen minutes.","Mary is going to Boston for three days.","Mary won the competition for four years.","John saw Mary twice in two years. Our aim is to provide a uniform analysis for all kinds of temporal adverbials. Our approach is compositional in that the lexicon supplies meanings at the word level (or possibly at the morpheme level, e.g., for '-ly' adverbs), and the meanings of adverbials are computed from the lexical entries by our GPSG-like grammar rules. The grammar rules take care of aspectual compatibility of adverbials with the VPs they modify. The re-suiting indexical logical form is then \"deindexed\" (converted to an explicit, context-independent form) by a set of recursive rules. The resultant episodic logical form (ELF) is formally in-terpretable and lends itself to effective inference. We now consider the syntax and the semantics of temporal adverbials. We first show logical form representations of temporal adverbials, in both indexical and deindexed form, and how to obtain them from the surface structure, together with a brief discussion of semantics. Then, we discuss an extension of our system that accommodates aspectual class shifts to properly handle the interaction between temporal adverbials and aspectual classes.","2. SYNTAX AND SEMANTICS OF","TEMPORAL ADVERBIALS We first discuss the basic interpretive mechanism, using yesterday as an example, and then generalize to other types of temporal adverbials. 2.1. The Basic Mechanism","As indicated in the following fragment of a GPSG-like sentence","grammar, we treat all adverbial adjuncts as VP-adjuncts at the","level of syntax. 1 (Aspectual feature agreement is assumed, but","not discussed till section 3.) NP ~- Mary ; Mary V[lbar, past] ~ left ; <past leave> VP ~ V[lbar] ; V' VP ~ VP ADVL[post-VP] ; (ADVL\" VP') S ~---NPVP; [NP\" VP'] However, despite this surface syntax, the semantic rule (ADVL' VV), specifying functional application of the ADVL-translation to the VP-translation, may lead to either predicate modification or sentence modification at the level of immediate logical form. In particular, manner adverbials (e.g., with","lIn sentences like \"Yesterday Mary left,\" we treat the proposed ADVL as topicalized, i.e., as \"extracted\" from post-VP position. However, we may want to treat modal and attitude adverbials (as in \"Oddly, Mary left\") as sentence-modifying. This does not affect our discussion here. 138"]},{"title":"a brush, hastily,","paragraphs":["etc.) are uniformly interpreted as predicate modifiers at the level of immediate LF, while temporal (and locative) adverbials are all interpreted as sentence modifiers. How such sentence-modifier interpretations are formed from VP adjuncts is easily seen from rules such as the following: NP[def-time] ~"]},{"title":"yesterday ; Yesterday","paragraphs":["PP[post-VP] (-- NP[def-time] ; (during NP') ADVL (-- PP[e-mod, post-Ve] ; APZx((adv-e PP3 [x P]). (adv-e stands for 'episode-modifying adverbial'. 2 More on this later.) From these rules it is clear that the logical translation of"]},{"title":"yesterday, as an","paragraphs":["adverbial adjunct, is ZPZx((adv-e (during"]},{"title":"Yesterday))","paragraphs":["Ix P]). In the interpretation of a sentence such as \"Mary left yesterday,\" this A-abstract would be applied to predicate leave (initially paired with unscoped tense operator past), yielding lx((adv-e (during"]},{"title":"Yesterday))","paragraphs":["[x <past leave>]), and this in turn would be applied to term Mary (translating the NP"]},{"title":"Mary),","paragraphs":["yielding the formula ((adv-e (during"]},{"title":"Yesterday))","paragraphs":["[Mary <past leave>]). Here, (during"]},{"title":"Yesterday)","paragraphs":["is a 1-place predicate (the result of applying the 2-place predicate during to the indexical constant"]},{"title":"Yesterday,","paragraphs":["allowable in the\"curried function\" semantics of EL). adv-e maps this 1-place preedicate into a"]},{"title":"sentence","paragraphs":["modifier; i.e., (adv-e (during"]},{"title":"Yesterday))","paragraphs":["denotes a function from sentence meanings to sentence meanings. In the present case, the operand is the sentence [Mary <past leave>], written in the square-bracketed, infixed form that is the preferred sentence syntax in EL. 3 The above"]},{"title":"indexical","paragraphs":["(context-dependent) logical form is obtained quite directly as a byproduct of parsing, and is subsequently further processed-- first, by scoping of ambiguously scoped quantifiers, logical connectives, and tense operators, and then by applying a set of formal"]},{"title":"deindexing rules,","paragraphs":["which introduce explicit"]},{"title":"episodic variables","paragraphs":["into the LF, and temporally relate these based on tense operators, temporal adverbials, and context structures called"]},{"title":"tense trees. These","paragraphs":["tense trees, described in [10, 22], supply \"orienting relations\" between episodes introduced by different clauses, such as the relation that exists between successively reported events in a narrative. We should emphasize that our treatment of time adverbials is fully compatible and integrated with the treatment of tense, but we will neglect tense o~rators and tense trees herein as far as possible. We do need to mention, though, that tense operators are generally assumed to take wide scope over adverbials in the same clause. Thus, after scoping, we get","2Certain feature principles are assumed in the grammar--namely, certain versions of the head feature principle, the control agreement principle, and the subeategorization principle. Notice that in our system, features are treated as trees; e.g., the subtree rooted by feature mod-vp has daughters pre-vp and post-vp, and the subtree rooted by feature e-rood has daughters temp-loe, dur, time-span, freq, card, eyc-time, etc., where temp-loe in turn has daughters def-time, indef-time, etc.","3In general, ['r. n: 1:1 ... 'r~l] is an equivalent way of writing Or x, ... 'r.), Which is in turn equivalent to 6.- ((g lrl)x2) ... \"rn). See [9, 11]. (past ((adv-e (during"]},{"title":"Yesterday))","paragraphs":["[Mary leave])). Since the deindexing rules \"work their way inward\" on a given indexical LF, starting with the outermost operator, the past tense operator in the sentence under consideration will already have been deindexed when the adv-e construct is encountered. In fact we will have","(2e1: [el before ul ] [((adv-e (during"]},{"title":"Yesterday))","paragraphs":["[Mary leave]) T ** eli), where ul denotes the utterance event for the sentence concerned, and T denotes the current tense tree. Note that we use restricted quantitiers of form (Qa: • it0, where Q is a quantitier, a is a variable, and restriction • and matrix ~P are formulas. At this point the following deindexing rule for adv-e is brought to bear (we omit the second half of the rule, specifying the transformation of the tense tree T ; see [9, 11]): For lr a monadic predicate, and • a formula, adv-e: ((adv-e g) ~)r ~ [VlrT ̂~r-T] This rule essentially splits the formula into a conjunction of two subformulas: one for the adverbial itself, the other for the sentence modified by the adverbial, much as in Dowty's system [4, 5]. To provide an intuitive explanation of how this works, we need to mention the operators '.' and '**', which are central to EL. Roughly, [~ • 77] means that • is true in episode r I (or, 4~ describes rl), and [el, ** 7/] means that el,, and only O, is true in episode 71 (or, • characterizes 7/). (For details, see [9, 11, 12].) Now the expression \"nT on the RHS of the deindexing rule for adv-e is a sentential formula (formed from predicate ~T) which Can be read as \"~T is true of the current episode (i.e., the one at which vg T is evaluated).\" In view of this, the combination"]},{"title":"[Vnr","paragraphs":["̂~,~.r] ** 7/] is equivalent to [[[71 ~T] ̂@~.T] ** 71]. Note that nT is now predicated directly of episode 71. In the example above, we obtain","(3e1: [el before ud [[[el during"]},{"title":"Yesterdayr]","paragraphs":["A [Mary leave]] ** ed), and this leaves only"]},{"title":"Yesterdayr","paragraphs":["to be deindexed to a spdcific day (that is,"]},{"title":"(yesterday-rel-to uO).","paragraphs":["To make the semantics of ,v,,,., and'**' a little more precise, we mention two clauses from the truth-conditional semantics:","1. For • a formula, and rl a term, ~ • 7/]] s = 1 only"]},{"title":"if Actual (~rl~, s) and [[~n~ = 1 ;","paragraphs":["= 0 only"]},{"title":"ifNonactual(lrl],s)","paragraphs":["or IIO]] ~n] ~ 1, where these conditionals become biconditionals (iffs) for"]},{"title":"s an exhaustive","paragraphs":["(informationally maximal) situation.","2. For s e S, and lr a predicate over situations, l[V~ \"= I[~\"', i.e.,"]},{"title":"~lr~(s)(s),","paragraphs":["where S is the set of possible situations. Also, a few relevant axioms are (for lr, rr\" 1-place predicates, 71 a term, and • a formula): 139 [] 13~ ** 7/]","~-~ [[~ * 7/] A --1 (3e: [e proper-subep-of 7/] [* • e])] [] [\"re A \"re'] ~ VZe[[e re] A [e re']] [] [lYre ̂~] ** 77] ~ [[[7/re] A ~] ** 7/]"]},{"title":"2.2. Adverbials of Duration, Time-span, and Repetition","paragraphs":["Like adverbials of temporal location, durafive adverbials are also translated as (adv-e re). For instance, \"John slept for two hours\" becomes (with tense neglected) ((adv-e (lasts-for (K ((num 2) (plur hour))))) [John sleep]). Like during, lasts-for is a 2-place predicate. Here it has been applied to a term (K...), leaving a 1-place predicate. Just as in the case of (during Yesterday), the deindexed LF will contain a predication stating that the episode characterized by John sleeping lasts for two hours. (The details of the term (K...), denoting the abstract kind of quantity, two hours, need not concern us here. K as used here corresponds to K1 in [9, 11].) Time-span adverbials (as in \"John ran the race in two hours\") are treated in much the same way, using predicate in-span-of. The translation of cardinal and frequency adverbials involves the sentence-modifying construct (adv-f re). re is a predicate which applies to a collection of temporally separated episodes. It may describe the cardinality of the episodes or their frequency (i.e., their relative density), periodicity or distribution pattern. So, for instance, we have ((adv-f ((num 2) (plur episode))) [John see Movie3]) for \"John saw the movie twice,\" and ((adv-f ((attr frequen0 (plur episode))) [John call Mary]) for \"John called Mary frequently.\" (num is an operator that maps numbers into predicate modifiers, and plur ('plural') is a function that maps predicates applicable to individuals into predicates applicable to collections; cf., Link [13]. agtr ('at-tributive') is an operator that maps predicates into predicate modifiers.) Table 1 shows lexical rules and PP and ADVL rules handling large classes of frequency adverbials, including periodic ones such as every two hours and synchronized cyclic ones such as every spring. The deindexing rule for adv-f is as follows: For re a monadic predicate, and cb a formula, adv-f: ((adv-f re) ~)T ~ [\"rer ̂(mult On.T)] As illustrated in Table 1, re could take various forms, mult on the RHS side of the rule is a function that transforms sentence intensions, and is defined as follows.","For r 1 an episode, and ~ a formula,","O [(mult ~) ** 7/] [[7/(plur episode)] ̂ (Ve: [e member-of ri]","[[~ ** e] ̂~ (3e\" [[e\" ~ e] ̂[e\" member-of ~/] ̂","[e\" overlaps eli)])],"]},{"title":"Table 1: GPSG Fragment (Adverbials)","paragraphs":["% VP Adjunct Rules ADVL ~-- PP[e-mod, post-VP] ; APAx((adv-e PP') [x P]) ADVL <-- ADV[e-mod, mod-VP] ; APAx(ADV\" Ix P]) VP ~--- VP ADVL[mod-vp] ; (ADVL', VP') % Temporal ADV, PP Rules NP[def-fime] ~ yesterday; Yesterday PP[post-VP] ~-- NP[def-time] ; (during NP') e.g., yesterday\" = APAx((adv-e (during Yesterday)) [x P]) N[time-unit, plur] ~-- hours; (plur hour) ADJ[number, plur] ~--- two; (num 2) N[lbar, time-length] ~ ADJ[number] N[time-unit] ; (ADJ\" N') NP ~ N[lbar, time-length] ; (K N') P[dur] ~---for ; lasts-for P[span] ~-- in; in-span-of PP[e-mod, post-VP] ~ P NP[time-length] ; (P' NP') e.g.,for two hours\" = gPAx((adv-e (lasts-for","(K((num 2) (plur hour))))) Ix P]) e.g., in two hours\" = J!.PAx((adv-e (in-span-of","(K ((num 2) (plur hour))))) [x P]) ADV[card, post-VP] ~-- tw/ce; (adv-f ((num 2) (plur episode)))"]},{"title":"N.B.","paragraphs":["'adv-n' used in [9] is no longer used. ADV[freq, mod-VP] ~ frequently;","(adv-f ((attr frequent) (plur episode))) ADV[freq, mod-VP] ~- periodically;","(adv-f ((attr periodic) (plur episode))) ADV[freq, post-VP] ~--- Det[every] N[lbar, time-length] ;","(adv-f As[[s ((attr periodic) (plur episode))] ̂","[(period-of s) = (K N')]]) e.g., twice\" = APAx((adv-f ((nurn 2) (plur episode))) [x P]) e.g.,frequently\" = APgx((adv-f ((attr frequent) (plur episode))) [x P]) e.g., every two hours' = AP2x((adv-f 2s[[s ((attr periodic) (plur episode))] ̂","[(period-of s) = (K ((num 2) (plur hour)))]]) Ix P]) N[indef-time] ~--- spring; spring NP[cyc-time] ~--- Det[every] N[lbar, indef-firne] ; <Deg N'> PP[post-VP] ~-- NP[cyc-time] ; (during NP') ADV ~- PP[cyc-tinae, post-VP] ;","(adv-f 2s(3e [[e member-of s] ̂[e PP']])) e.g., every spring\"","= APgx((adv-f As(3e [[e member-of s] ̂[e during <V spring>]]))","Ix P]) Sentences (1)--(5) below illustrate the rules stated in Table 1. The (a)-parts are the English sentences, the (b)-parts their immediate indexical LFs, and the (c)-parts the deindexed ELFs. (1) should be fairly transparent at this point. (2c) says that \"some time before the utterance event, there was a 2 monthlong (multi-component) episode, that consists three episodes of type 'John date Mary'.\" (3c) reads similarly. (4c) reads as \"there was a 10 day-long episode that consists of periodically occurring subepisodes of type 'John take medicine', where the period was 4 hours.\" (5c) is understood as \"at the generic 140 present there is a collection of episodes of type 'Mary bake cake', such that during each Saturday within the time spanned by the collection, 4 there is such an episode.\" (We take verbs of creation such as bake as predicate modifiers.)","(1) a. John worked for three hours yesterday.","b. (past ((adv-e (during Yesterday))","((adv-e (lasts-for (K ((num 3) (plur hour))))) [John work])))","c. (3e1: [el before u,] [[[el during (yesterday-rel-to ul)] ̂ [el lasts-for (K ((hum 3) (plur hour)))] ̂ [John work]] ** eli)","(2) a. Mary visited Paris three times in two months.","b. (past ((adv-e (in-span-of (K ((num 2) (plur month))))) ((adv-f ((num 3) (plur episode))) [Mary visit Paris])))","c. (3e2:[e2 before u2] [[[e2 in-span-of (K ((hum 2) (plur month)))] ̂ [e2 ((num 3) (plur episode))] ̂ (mult [Mary visit Paris])] ** e2])","(3) a. John regularly dated Mary for two years.","b, (past ((adv-e (lasts-for (K ((num 2) (plur year)))))","((adv-f ((att~ regular) (plur episode))) [John date Mary])))","e. ~e3:[e3 before u3] [[[e3 lasts-for (K ((num 2) (plur year)))] ̂ [e3 ((attr regular) (plur episode))] A (mult [John date Mary])] ** e3])","(4) a, John took medicine every four hours for ten days.","b. (past ((adv-e (lasts-for (K ((num 10) (pinr day)))))","((adv-f As [[s ((attr periodic) (plur episode))] ̂","[(period-of s) = (K ((num 4) (plur hour)))]])","[John take (K medicine)])))","c. (3e4:[e4 before u4] [[[e4 lasts-for (K ((num 10) (plur day)))] [e4 ((aUr periodic) (plur episode))] ̂ [(period-of e4) = (K ((num 4) (plur hour)))] n (mult [John take (K medicine)])] ** e4])","(5) a. Mary bakes a cake every Saturday.","b. (gpres ((adv-f 2s(Vd: [d Saturday]","(3e [[e member-of s] A [e during d]])))","[Mary (bake cake)]))","c. (3es: [es gen-at us] [[(Vd: [d Saturday]","~e [[e member-of es] A [e during d]])) A (mult [Mary (bake cake)])] ** es]) We emphasize again that ELFs are completely deindexed, and so allow effective inference. EPILOG [20], the computer implementation of EL, makes inferences very efficiently, based on such ELFs and world knowledge, aided by a \"time specialist.\" For instance, given \"There is a train to Boston every two hours,\" \"A train left for Boston at 2:30,\" and appropriate axioms, EPILOG Can infer that the next train would be at 4:30. 5 4This constraint on the Saturdays under consideration is assumed to be","added by the deindexing process for time- or event-denoting nominals, but","has been omitted from (5c). 5The following kind of meaning postulates are assumed:","a. (Vs: [s ((attr periodic) (plur episode))]","(~n: [In number] ̂[n ~ 2]] Is ((hum n) (plur episode))])) A periodic collection of episodes has at least two component episodes. This kind of reasoning is very important in the TRAINS project [1], one of our target applications. We also have a tentative account of adverbials such as consecutively and alternately, and some non-PP adverbials, but cannot elaborate within the present space limitations.","3. AN EXTENSION: TEMPORAL ADVERBIALS AND ASPECTUAL CLASS SHIFTS So far, we have assumed aspectual category agreement between temporal adverbials and VPs they modify. We now discuss our aspectual class system and our approach to apparent aspectual class mismatch between vPs and adverbials, based on certain aspectual class transformations. We make use of two aspectual class feature hierarchies, stativeness and boundedness as below: 6 st at ivene s s boundedne s s"]},{"title":"i 'I I I I i","paragraphs":["factual star telic unbounded bounded Atemporal (or, unlocated) sentences whose truth value does not change over space and time are assigned the feature factual. Every tensed English sentence, e.g., \"Mary left before John arrived,\" in combination with a context, is considered factual. Untensed sentences may be stative or telic, depending on the type of the preedicate (i.e., achievement/accomplishment versus state/process predicates) and on the object and subject (e.g., count versus mass). Sentences describing states or processes are assigned the feature star, while those describing achievements or accomplishments are assigned the feature telie. By a co-occurrence restriction, factual formulas are unbounded, and telics are bounded. Statives are by default unbounded. Intuitively, a formula is bounded if the episode it characterizes terminates in a distinctiveresult state (result states are formally defined in [11].) This is a property we as-cribe to all telie episodes as well as to some stative episodes (such as an episode of John's being ill, at the end of which he","b. (Vk: [k kind-of-timelength] (Ve: [[e episode] ̂[[e lasts-for k]]","(3t: [[t time] a [(timelength-of 0 = k]] [e throughout t]))) An episode lasting for a certain length of time means there is a time of that length such that the temporal projections of the time and the episode are identical.","c. (Ve(Vs: [Is ((attr periodic) (plur episode))] ̂[s throughout e]] (Vp: [(period-of s)=p] (Vel: [el member-of s]","[[(3e2:[e2 irnmed-suecessor-in el s]","[(dist (begin-of el) (begin-of e2)) = p]) v","[(dist (begin-of e 1) (end-of e)) < p]] ̂","[(3e3:[e3 immed-predecessor-in el s]","[(dist (begin-of • 1) (begin-of e3)) = p]) v","[(dist (begin-of el) (begin-of e)) < p]]])))) A component episode of a sequence of episodes with periodp has an immediate predecessor/successor that is apart from it by p unless it is the firstllast element of the sequence. The distance between the first/last element and the begirdend point of the episode the sequence permeates is less than p. 6Our aspecmal class system resembles Passonneau's [18] in that it makes","use of two orthogonal feature hierarchies, although the actual division of fea-","tures is different from hers. 141 is not ill). Conversely, a formula is unbounded if the episode it characterizes does not terminate in a distinctive result state. For instance, was ill in \"John was ill when I saw him last week\" is unbounded as the sentence does not entail that John was not ill right after the described episode. However, when we say \"John was ill twice last year,\" we are talking about bounded \"ill\" episodes. 7","As has been discussed by many authors (e.g., in [3, 6, 15, 17,","26, 27]), vPs and temporal adverbials may not arbitrarily com-","bine. Normally, durative adverbials combine with unbounded","VPs; cardinal and frequency adverbials with bounded VPs; and","adverbials of time-span with telic VPs. Thus, for instance, Mary studied for an hour. s *Mary finished the homework for a second. Mary called John twice I repeatedly l every five minutes. Mary wrote the paper/n two weeks.","Note, however, that we also say Mary sneezed for Jive minutes. Mary stepped out of her office for ]fve minutes. Mary was ill twice [ repeatedlyl every two months. The latter group of sentences show that VPs often acquire an interpretation derived from their original, primitive meaning. More specifically, when \"stative\" adverbials are applied to telic VPs, usually iteration is implied, as in the first sentence. However, in the case of the second sentence, the preferred reading is one in which the adverbial specifies the duration of the resultant episode, i.e., \"the result state of Mary's stepping out of her office\" (i.e., her being outside of her office), rather than a reading involving iteration. Next, when cardinal or frequency adverbials (i.e., \"bounded\" adverbials) are applied to unbounded-stative VPs, those VPs are interpreted as bounded-statives. Thus, the third sentence above means that the kind of episode in which Mary becomes ill and then ceases to be ill occurred twice, repeatedly, etc. To be able to accommodate such phenomena, the syntactic parts of our grammar use stat and bounded as agreement features. The semantic parts introduce, as needed, operators for aspectual class transformation such as result-state, iter (iteration), bounded, etc. (In place of iter, we may some-times use a habitual operator, It.) Adverbials of temporal location like yesterday or last week may combine with either bounded or unbounded formulas (with unbounded ones, these imply a throughout reading; with bounded ones, a sometime during reading). For instance, in \"John left last month,\" the \"leaving\" episode took place sometime during last month, but in case of \"Mary was ill last month,\" Mary's \"ill\" episode may be either sometime during","7Semanticany, stativeness and boundedness play an important role with respect to the persistence of a formula. In general, stafive formulas are inward persistent (modulo granularity), and bounded formulas are outward persistent. (Polarized ones are exceptional, however.) See [11] for further discussion.","SHowever, *Mary resembled her mother for five years, even though \"re-sembling\" is a typical stafive VE This indicates that compatibility between predicates and adverbials involves more than just the aspeetual class compatibility; that is, pragmaties and world knowledge need to be considered. or throughout last month (corresponding to bounded and unbounded readings of the VP). Synchronized cyclic adverbials like every spring or every time I saw Mary may combine with bounded or unbounded formulas. Secondly, an application of certain temporal adverbials often induces shifts in the aspectual classes of the resultant VPs. Frequency adverbials transform bounded sentences into unbounded-stative ones, while durative adverbials normally yield bounded VPs and synchronized cyclic ones yield unbounded-statives. Thus,","John {{was ill twice} in three years}.","?John { {was ill twice} for three years}.","John { {was frequently ill} for three years}.","?John {{was frequently ill} in three years}.","John { {worked for five hours} three times} last week. We now rewrite the VP adjunct rules introduced earlier to accommodate the interaction between vPs and adverbials and possible shifts in aspectual classes. 9 We also show VP rules that perform aspectual class shifts. Note that aspectual class features (stat, bounded, etc.) are head features. VP <-- VP[stat, unbounded] ADVL[dur] ; (ADVL' VP') VP[bounded] ~ VP[stat, unbounded] ADVL[dur] ; (ADVL' VP') VP ~ VP[bounded] ADVL[span] ; (ADVL\" VP') VP ~ VP[bounded] ADVL[card] ; (ADVL\" VP') VP[stat, unbounded] ~ VP[bounded] ADVL[freq] ; (ADVL' VP') VP[stat, unbounded] ~ VP ADVL[cye-time] ; (ADVL' VP') VP[bounded] ~-- VP[stat, unbounded] ; (bounded VP') VP[stat, unbounded] ~-- VP[bounded] ; (iter VP') VP[stat, unbounded] ~ VP[telic] ; (result-state VP')","These rules allow transitions in aspectual class and VP-","adverbial combinations somewhat too liberally. We assume,","however, that undesirable transitions and combinations may be","ruled out on semantic grounds. We now show some additional","sentences and their initial translations (with tense neglected)","to illustrate the above rules.","(6) a. Mary was ill twice in December b. ((adv-e (during (in-time December)))","((adv-f ((num 2) (plur episode))) [Mary (bounded ill)]))","(7) a. Mary received an award for three years b. ((adv-e (lasts-for (X ((num 3) (plur year)))))","[Mary (iter 2x(3y: [y award] [x receive y]))])","(8) a. Mary became unconscious for five minutes b. ((adv-e (lasts-for (X ((num 5) (plur minute)))))","[Mary (result-state (become unconscious))])","(9) a. Nobody slept for eight hours for a week b. ((adv-e (lasts-for (K week))) (No x: [x person]","((adv-e (lasts-for (X ((hum 8) (plur hour))))) Ix sleep])))) e. ((adv-e (lasts-for (X week))) (No x: Ix person]","[x (iter Xy((adv-e (lasts-for (K ((hum 8) (plur hour)))))","[y sleep]))]))) d. (No x: [x person] ((adv-e (lasts-for (R week)))","[x (iter Ay((adv-e (lasts-for (K ((hum 8) (plur hour)))))","[y sleep]))])))","9Similar kinds of shift in aspeetual classes have previously been discussed in the literature; first in [24], and subsequently in [15, 23]. 142 Notice that (9) has at least three readings: first, during a certain week-long event, nobody had an 8-hour snooze; second, a situation in which nobody slept regularly for 8 hours persisted for a week1°; and third, there is no one who slept daily for 8 hours for a week. (9b), (9c) and (9d) provide these three readings (distinguished by the scope of the quantifier No and the adverbial for a week). Note now that in (9a), the inner durative adverbial for eight hours transforms the unbounded VP to a bounded one. Being another durative adverbial, however, the outer for a week requires that its argument be unbounded. This is not a problem as shown in ELFs (9b, c, d). That is, in (9b), the argument is a negated formula which is normally considered to be stative-unbounded, and in (9c) and (9d), the iter operator produces stative-unbounded formulas. 4. CONCLUSION Much theoretical work has been done on temporal adverbials (e.g., [4, 5, 7, 14, 16, 19]). There is also some computationally oriented work. For instance, H0bbs [8] provided simple rules for some temporal adverbials, including frequency ones. Moens and Steedman [15], among others, discussed the interaction of adverbials and aspectual categories. Our work goes further, in terms of (1) the scope of syntactic coverage, (2) interaction of adverbials with each other and with tense and aspect, (3) systematic (and compositional) transduction from syntax to logical form (with logical-form deindexing), (4) formal interpretability of the resulting logical forms, and (5) demonstrable use of the resulting logical forms for inference. Our initial focus in the analysis of temporal adverbials has been PP-adverbials. Remaining work includes the analysis of clausal adverbials. Also, interactions with negation and aspect (perfect and progressive) have not been completely worked out. Negations of statives are statives, but negations of bounded sentences may be either bounded or unbounded (cf., \"We haven't met for thre e years\" versus \"I have friends I haven't met in three years\"). The interaction between present perfect and multiple adverbials of temporal location also creates some subtle difficulties. E.g., in \"Mary has jogged {at dawn} {this month},\" the inner time adverbial modifies the \"jogging\" episode, while the outer one modifies the interval that contains the \"jogging\" episode as well as the utterance time. See [11] for some relevant points. Another issue that requires thought is adverbials involving implicit anaphoric referents. Consider, e.g., \"Shortly, Mary came in,\" \"John came back in ten minutes,\" and \"After three years, John proposed to Mary.\" These adverbials involve an implicit reference episode. Such implicit referents may often be identified from our tense trees, but at other times require inference. Another important remaining issue is the interaction between event nominals and frequency adjectives (along the lines of"]},{"title":"[25]).","paragraphs":["1°Here, iterated sleep is understood as daily sleep--something that must be determined by pragmaties."]},{"title":"References","paragraphs":["1. J. Allen and L. K. Schubert. The TRAINS Project. TR 382, U. of Rochester, 1991.","2. J. Barwise and J. Perry. Situations and Attitudes. MIT Press, Cambridge, MA, 1983.","3. O. Dahl. On the definition of the telic-atelic (bounded-nonbounded) distinction. Tense and Aspect (Syntax and Semantics, V.14), 79-90. Academic Press, New York. 1981.","4. D. Dowty. Word Meaning and Montague Grammar. Reidel, Dordreeht, 1979.","5. D. Dowty. Tense, time adverbs and compositional semantic theory. Linguistics and Philosophy, 5:23-55, 1982.","6. E. W. Hirtrichs. A Compositional Semantics for Aktionsarten andNP Reference in English. PhD thesis, Ohio State U., 1985.","7. E. W. Hinrichs. Tense, quantifiers, and contexts. Computational Linguistics, 14:3-14, 1988.","8. J. R. Hobbs. Ontological promiscuity. In Proc. 23rd Annual Meeting of the ACL, 61---69. Chicago, IL, July 8-12, 1985.","9. C.H.Hwang. A Logical Approachto Narrative Understanding. PhD thesis, U. of Alberta, Canada, 1992.","10. C. H. Hwang and L. K. Schubert. Tense trees as the \"fine smacture\" of discourse. In Proc. 30th Annual Meeting of the ACL, 232-240. Newark, DE, June 29-July 2, 1992.","11. C. H. Hwang andL. K. Schubert. Episodic Logic: A comprehensive semantic representation and knowledge representation for language understanding. In preparation.","12. C.H. Hwang and L. K. Schubert. Episodic Logic: A situational logic for natural language processing. In Situation Theory and its Applications, V. 3, CSLI, Stanford, CA, In print.","13. G. Link. The logical analysis of plurals and mass terms: A lattice-theoretical approach. In Meaning, Use, and Interpretation of Language (editors Bauerle, Schwarze, and yon Stechow), Walter de Gruyter, Germany. 302-323, 1983.","14. A. Mittwoch. Aspects of English aspect: On the interaction of perfect, progressive and durational phrases. Linguistics and Philosophy, 11:203-254, 1988.","15. M. Moens and M. Steedman. Temporal ontology and temporal reference. ComputationalLinguistics, 14:15-28, 1988.","16. F. Moltmann. Measure adverbials. Linguistics and Philosophy, 14:629-660, 1991.","17. A.P.D.Mourelatos. Events, processes and states. Tense and Aspect (Syntax and Semantics, V.14), 191-212. Academic Press, New York. 1981.","18. R. J. Passonneau. A computational model of the semantics of tense and aspect. Computational Linguistics, 14:44-60, 1988.","19. B. Riehards and F. Heny. Tense, aspect, and time adverbials. Linguistics and Philosophy, 5:59-154, 1982.","20. S. Schaeffer, C. H. Hwang, J. de Haan, and L. K. Schubert. The User's Guide to EPILOG (Prepared for Boeing Co.). 1991.","21. L. K. Schubert and C. H. Hwang. An Episodic knowledge representation for narrative texts. In KR '89, 444 458, Toronto, Canada, May 15-18, 1989.","22. L. K. Schubert and C. H. Hwang. Picking reference events from tense trees: A formal, irnplementable theory of English tense-aspect semantics. Proc. Speech and Natural Language, DARPA, 34-.-41, Hidden Valley, PA, June 24-27, 1990.","23. C. Smith. The Parameter of Aspect. Kluwer, Dordreeht, 1991.","24. M. J. Steedman. Reference to past time. In Speech, Place and Action, 125-157. John Wiley and Sons, New York, 1982.","25. G.T. Stump. The interpretation of frequency adjectives. Linguistics and Philosophy, 4:221-257, 1981.","26. Z. Vendier. Linguistics in Philosophy: Chapter 4, Verbs and Times. Ithaca, Cornell U. Pr., 1967.","27. H. 1. Verkuyl. Aspectual classes and aspectual composition. Linguistics and Philosophy, 12:39-94, 1989. 143"]}]}