{"sections":[{"title":"NATURAL LANGUAGE PLANNING DIALOGUE FOR INTELLIGENT APPLICATIONS James F. Allen and Len Schubert","paragraphs":["Department of Computer Science University of Rochester Rochester, NY 14627 PROJECT GOALS The goal of this project is to develop the underlying technologies for spoken dialogue systems that serve as interfaces to complex, state-of-the-art reasoning systems. Most current speech and natural language projects are focusing on applications that involve very little intelligent reasoning, such as data-base query and formfilling. However, the great promise for speech and natural language interfaces is in providing useful interfaces to complex AI reasoning systems such as planning systems and expert systems. We are developing a domain-independent general model of semantic representation together with an integrated plan-based representation both for problem solving in the domain and for managing the dialogue itself. The semantic representation is"]},{"title":"episodic logic,","paragraphs":["a rich representation language, based on the notion of episodes, that can representation of the meaning of a wide range of linguistic constructs. The plan-based model provides the necessary infrastructure needed to integrate syntactic and semantic processing, discourse structure, and domain reasoning to create an effective dialogue system. RECENT RESULTS 1) We developed a plan reasoning system that can handle a wide range of interpretation problems that arise in the TRAINS dialogs, including suggestions of courses of action, of objects to use in the plan, of goals, and of other constraints on the plan. In addition, it supports purpose clause qualifications on any of these suggestions. 2) We completed a new version of the discourse reasoner and tested it on some sample dialogs. The new system maintains what each agent believes, what each agent has suggested about the plan, and what parts of the plan have been agreed on so far. It can filter possible speech act interpretations using knowledge of the agents' beliefs and knowledge of the current plan. 3) We developed and implemented a scope disambiguation algorithm. Operators are assigned their scope depending on their syntactic, semantic and pragmatic properties in conjunction with reference and tense interpretation. This work includes a model of contextual reasoning appropriate for interpreting definite descriptions. 4) Chung Hee Hwang completed her doctoral dissertation: \"A Logical Approach to Narrative Understanding\", which fully specifies a general semantic representation for language, episodic logic. This work is especially notable for the breadth of its semantic coverage, including detailed analyses of tense constructs and of adverbial modification. 5) We completed the design of a system that, when presented with a word it has never seen before, creates a new lexical entry with meaning postulates that represent a partial semantic definition of the word by considering specific word formation processes (e.g., affixation, argument structure altemations, compounding etc.). 6) We set up a dialogue lab this year so that dialogues can be collected in a more controlled setting. With the dialogs collected so far, we are marking intonational features, annotating repairs, and producing an aligned transcription using specially developed tools built on top of the WAVES system. We are developing standards for annotating higher level discourse phenomena, such as segmentation, co-reference and speech act analysis.","PLANS FOR THE COMING YEAR 1) Complete a new domain plan reasoning system based on plan graphs and test it extensively on data from a wide range of TRAINS dialogues. 2) Develop new versions of each module in the TRAINS system to support incremental interpretation, so the system be based on intonational phrases rather than complete sentences. 3) Implement the lexical reasoning system described above to derive partial meanings of new words. 4) Complete annotation schemes for segmentation, co-reference, speech acts and discourse acts, and test by annotating several hours of dialogue. 5) Complete new versions of our work on scope disambiguation and reference, and on the dialogue reasoner. These will be described in two Ph.D. dissertations by David Traum and Massimo Poesio. 420"]}]}