{"sections":[{"title":"Lexico chems d Relted Dt Models:whe tdrds Meet Users ThorsteTrippe1 ,MichaeMaxwe2 ,GrevieCorbett3 ,CambePrice4 ,ChristopherMaig5 , StepheGrimes6 ,adSteveMora7","paragraphs":["1","Univeriä ielefeld, Germany; 2 Univeriy of Maryland, USA; 3","Univeriy of Surrey, Unied Kingdom; 4","SIL, Thailand;","5","Sanford Univeriy, USA; 6","Indiana Univeriy, USA; 7","Univeriy of Wahingon, USA","E-mail 1","hosen.ippel@uni-bielefeld.de, 2","maxwell@umiacs.umd.edu, 3","g.cobe@suey.ac.uk,","4","cambell_pince@sil.og, 5 manning@cs.sanfod.edu, 6","sgimes@indiana.edu, 7","siv@u.washingon.edu Abstrct Lexicon schemas and hei use ae discussed in his pape fom he pespecive of lexicogaphes and field linguiss. A vaiey of lexicon schemas have been developed, wih goals anging fom compuaional lexicogaphy (DATR) hough achiving (LIFT, TEI) o sandadizaion (LMF, FSR). A numbe of equiemens fo lexicon schemas ae given. The lexicon schemas ae inoduced and compaed o each ohe in ems of convesion and usabiliy fo his paicula use goup, using a common lexicon eny and poviding examples fo each schema unde consideaion. The fomas ae assessed and he final ecommendaion is given fo he poenial uses, namely o eques sandad compliance fom he developes of he ools used. This pape should fose a discussion beween auhos of sandads, lexicogaphes and field linguiss."]},{"title":"1. Itroductio","paragraphs":["This pape discusses equiemens of lexicogaphes and people woking wih lexicogaphic esouces on lexicon encodings and epesenaion schemas. The pape is he esul of a wokshop of a goup of lexicogaphes and lexicon heoiss meeing a Sanfod Univesiy in July 2007 o discuss which sandad fo lexicon encoding and epesenaion should be ecommended o people woking in lexicogaphy. I sas fom he assumpion ha hee is a lage vaiey of lexicon fomalisms used fo he inechange and achiving of lexical esouces. Many field wokes face a poblem of deciding which fomalism is appopiae fo hei use and which should be aken ino consideaion. These lexicogaphes have an in-ees in shaing esouces and achiving hem, and would comply wih a sandad if possible o enhance ineopeabiliy. In his pape we discuss he equiemens of lexicogaphes fo epesenaion schemas and evaluae which fomalisms would be appopiae and could be used. This pape should fose a discussion beween auhos of sandads, lexicogaphes and field linguiss."]},{"title":"2. Requiremets for Lexico chems d Descriptios","paragraphs":["Reviewing equiemens of field linguiss and lexicogaphes wih diffeen backgounds we wee able o ceae a lis of 19 equiemens, some of hem muually exclusive o ohes. Howeve, we believe ha by saing hese equiemens, i is possible o evaluae lexicon schemas and povide developes of lexicon sofwae wih a lis of equiemens of poenial uses."]},{"title":"2.1 Represettio 2.1.1 implicity of the Lexico chem:","paragraphs":["Lexicogaphes ae no compue pogammes hence he lexicon schema o be used should no be oo like a pogamming language. Jus as he ahe simple vesions of he hypeex makup language HTML have made he success of he wold wide web possible, a lexicon schema has o be easy enough o allow a fas undesand-ing of he basic conceps while allowing complex sucues fo advanced equiemens. This does no mean ha HTML should be he model fo a lexicon schema, bu"]},{"title":"3205 ","paragraphs":["ha a lexicogaphe wih lile pogamming backgound could use a specific lexicon schema. 2.1.2 Dt ctegory selectio: I seems o be impossible o fix all necessay lexical daa caegoies (such as noun gendes) fo all languages. A lexicon schema has o allow fo diffeen daa caegoies, as was discussed in he developmen of he new vesion of ISO 12620 (Daa caegoies fo use in he Teminology Makup Famewok). 2.1.3 Mke mbiguity explicit: Lexical ambiguiy such as homonymy and polysemy a-diionally has been an issue fo lexicogaphes. A lexicon model has o allow fo his kind of ambiguiy wihou imposing a disambiguaion fo example by enumeaion. Disambiguaion should be lef o he lexicogaphe o an applicaion."]},{"title":"2.2 tructure 2.2.1 Listig Lexicl Dt Ctegories:","paragraphs":["Each lexicon epesenaion needs o sae which lexical daa caegoies ae available, as well as he caegoizaion as mandaoy o opional. Pogams evaluaing he lexical daabase can use he lis fo he synacic evaluaion of he esouce. 2.2.2 Hierrchy of Lexicl Dt Ctegories: Many lexical daa caegoies ae no independen of each ohe, bu sand in a hieachical elaion. These hieachies should be povided fo, possibly wih efeences o onologies. 2.2.3 Explicit d Meigful tructure Ecodig: Fo soing, achiving and inechange of lexicon daa he inepeaion of he sucues is impoan. To allow his inechange, he sucue of he lexicon schema has o be clealy defined and descibed explicily. This becomes especially cucial in he fuue when inepeing ools may no be available any moe. 2.2.4 Iheritce: Lexical infomaion can ofen be inheied fom genealized paens and ules, fo example inflecional paadigm classes, ec. The lexicon schema should have he abiliy o epesen inheiance models. 2.2.5 Defiitio of Reltio to Grmmr: Lexicons and gammas ae elaed o each ohe; hey ineac in he sense ha he lexicon uses he lexical gammaical caegoies defined by he gamma. Gammaical implicaions should be made explici in he documenaion, which should be povided fo in he schema."]},{"title":"2.3 upported Iformtio Types 2.3.1 upport for Differet Writig ystems:","paragraphs":["Many applicaions suppo Unicode and claim ha hey ae enabled fo diffeen wiing sysems. Howeve, applicaions ofen do no offe full Unicode suppo fo changing wiing sysems and diecion, o hee is no fon wih he full se of chaaces needed. The lexicon schema should include ways of suppoing diffeen wiing sysems. 2.3.2 upport for Multiple Writig ystems: A poblem ha appeas aificial only a fis glance is he use of muliple wiing sysems in he same lexicon aicle. Lexicon aicles ae he kind of ex whee such a change can happen fequenly, fo example in mulilingual envionmens o wih languages wih moe han one wiing sysem. 2.3.3 Multimodl Dt d ig Lguge Represe­ ttio: Fo spoken language and fo sign language epesenaion he inclusion of mulimodal daa is obvious in a lexicon. This implies ha idiosyncaic anscipion sysems and audio and video daa have o be povided fo. 2.3.4 Depedecy Mgemet: Fo video fomas i is necessay o specify which video encoding pocedue (i.e. video codec) is used o inepe he signal. Anohe example of he dependency of a lexicon on exenal envionmens is he need fo a fon o specialized sofwae o inepe elaions modeled in a lexicon. Usually he daa is no useless if hose dependencies ae no me, bu uses should know ha hey have o expec complicaions."]},{"title":"3206 2.3.5 Iclude Refereces:","paragraphs":["A lexicon fomalism needs o allow efeence o maeial ouside of he esouce as such, e.g. bibliogaphy, geogaphic locaions, ec."]},{"title":"2.4 Coversio 2.4.1 Lossless Coversio:","paragraphs":["As hee ae diffeen lexicon schemas available aleady, a lexicon schema should sae in which way a lexicon can be conveed ino a diffeen foma. Tha also means ha a new lexicon schema has o be evaluaed by esing i agains lexical esouces and by showing ha hese esouces can be expessed by he schema. This also allows a use o ake example lexicon encodings o undesand he schema. The es of convesion can be demonsaed by conveing fom exising lexicon fomas ino he poposed schema and back. This convesion needs o be lossless, even ove muliple cycles. 2.4.2 Commo Formt: The lexicon sandad foma has o cove he coe o in-esecion of all ohe daa fomas. If hee is a lossless convesion, his is ivial, bu i is no o be expeced ha lossless convesion will be possible in all insances 2.4.3 Flt Iterchge tructure: A fla able sucue is he kind of sucue mos ofen used fo inechanging lexical daa, because i seems ha i is he easies o inepe and o map ono ohe sucues. While fla sucues appea o conadic he modeling of explici hieachies, i is in fac possible o map each hieachical sucues ono fla sucues."]},{"title":"2.5 Applicbility 2.5.1 Reuse of Existig tdrds:","paragraphs":["A lexicon schema should use and euse insiuional sandads such as ISO sandads and W3C sandads wheeve possible, e.g. fo mophosynacic feaues. 2.5.2 Existece of Applictios: An applicaion which enables he use of a lexicon schema fo linguiss who ae no pogammes o fose accepance of he schema. 2.5.3 upport for Existig Lexicos: Lexicon encoding schemas will be useless fo a use if he foma does no suppo he lexicon used o designed by a his use. Hence i has o be esed and applied o muliple exising, well known lexical fomas."]},{"title":"3. Chrcteriztio of Formlisms 3.1 DATR","paragraphs":["DATR is a pogamming language fo epesening lexical infomaion. I implemens muliple non-monoonic inheiance. DATR is he oldes lexicon fomalism looked a hee, inoduced by Evans and Gazda (1996). They descibe a modeling fomalism and allow he epesenaion of lexical knowledge in a ex oiened foma while also allowing he explici inheiance of infomaion fom absac o concee lexical enies. The moivaion fo his is ha he classificaion of a wod accod-ing o some caegoy implies a lo of addiional infomaion. Fo example, classifying an English wod as a nonexcepional noun also means ha he plual of his noun is ceaed by adding he affix -s o he unmaked singula sem. Because English is no a highly inflecing language, his may no seem o be a majo hing, bu fo highly inflecing languages his allows he ceaion of all possible wod foms based on his fom of genealiza-ion. Genealizaion is no esiced o mophology bu can also be applied o synacic oles, semanic epesenaion, ponunciaion, ec. A basic idea of DATR is o define models fo wods and es hem. Hence DATR defines heoies fo a given lexical iem, and he DATR inepee allows one checking if hose heoies ae in fac coec. Since DATR oiginaes fom he compuaional linguisic and NLP adi-ion, hee ae numeous implemenaions available, which in un means ha he DATR fomalism can be used and esed. Some implemenaions allow he use of models ha ae available in vaious encodings including Unicode, ASCII, ISO Lain 1, ec. The lexicon daa caegoies can be feely defined, if necessay even individually fo each lexicon eny. The heoies can be ceaed by a ex edio o wih an appopiae use ineface o geneaed by a pogam. This, howeve, poses one of he majo poblems of DATR in pacical, lexicogaphic pojecs wih uses no ovely familia wih"]},{"title":"3207","paragraphs":["compuaional pocesses. Though he heoies allow a wide flexibiliy of daa caegoies, he heoies hemselves do no pose any linguisically based esicions o daa model fo he individual lexicon enies. Exmple of DATR lexico etry with iheritce structures: The saing poin is he well undesood DATR synax, used fo he Russian wod omanized as 'komnaa'. In DATR he node label ‘Komnaa’ is puely mnemonic and no used afewads. A numbe o any ohe label could be subsiued. The individual lexical daa caegoies ae epesened in aibue value sucue such as <> == N_II, which in his case means ha by defaul all bis of infomaion no specified elsewhee ae o be inheied fom he node N_II, which is a paicula declension class of nouns. Fom ha node hee is a link o he node NOUN. Fom his pa of he eny we can infe he lexical caegoy, and since we know he mophological class we can infe almos all of he elevan inflecions fo six cases and wo numbes. These ae appended o he sem, which is given in he nex line. Tha line gives no indicaion of any sem iegulaiy, so all he foms ae aken o be he esul of concaenaing he sem plus a suffix. The eason ha we canno infe all he foms based on he infomaion in jus he fis hee lines of he eny is ha hee ae well-known synceisms in Russian based on animacy. The animacy mus be infeed fom he meaning, which is specified in he las line. Given ha infomaion, we can infe all welve foms of Russian nouns. Noe ha gende is no specified. Tha oo is infeed. Thee is no infomaion given abou sex, and so he gende is infeed fom he inflecional class nouns in N_II which ae no sex-diffeeniable ae feminine. komnaa <> == N_II <gloss> == oom <infl_oo> == komna <sem animacy> == inanimae."]},{"title":"3.2 Feture tructure Represettio (FR)","paragraphs":["Feaue Sucues ae fequenly used in synacic heoies and ohe conexs o epesen lexical infomaion in a hieachically sucued foma. The fomalism as such does no povide a fixed se of daa caegoies bu a way of unifying wo o moe epesenaions. One possible epesenaion in a feaue sucue fo a lexicon aicle would be he following"]},{"title":"〈 Komnata , [  Glo ' room' em [ animacy inanimate ] ] 〉","paragraphs":["The impoance fo language esouces is undelined by he exisence of an inenaional sandad fo Feaue Sucue Repesenaions (see ISO 24610-12006), which povides a nomaive way of encoding hieachical sucued daa in XML foma. The sandad as such ecommends he use of sandadized daa caegoies which ae o be povided by a daa caegoy eposioy (see ISO 126202007 fo a daf). The sucue as such does no equie he use of hese daa caegoies. FR represetig iheritce structures: <f name=\"komnata\"> <fs type=\"N_II\"> <f name=\"Gloss\"> <string>room</string> </f> <f name=\"infl_root\"> <string>komnat</string> </f> <f name=\"sem\"> <fs> <f name=\"animacy\"> <string>inanimate</string> </f> </fs> </f> </fs> </f>"]},{"title":"3.3 Lexicl Mrkup Frmework (LMF)","paragraphs":["The Lexical Makup Famewok (LMF, cuenly a daf inenaional sandad, ISO DIS 246132007) is a pojec of he Inenaional Oganizaion of Sandadizaion (ISO), Technical commiee 37, Subcommiee 4 on language esouces. Given he numbe of lexical esouces poduced in diffeen fields and by diffeen oganizaions, he need was fel o ceae a sandad o descibe, exchange and access eleconically available lexical in-"]},{"title":"3208","paragraphs":["fomaion. LMF inends o povide a ‘mea-model’ fo ceaing lexicon fomas, poviding componens o be combined o ceae a foma. Based on he componens used, he sucue of lexical esouces is supposed o be compaable and inechangeable. In his sense LMF is \"he odd one ou\" in his lis, in ha hee ae code snippes of XML which ae inended only as illusaions of how LMF would be applied. LMF is based on he assumpion ha a lexicon minimally conains a fom-sense pai. I allows inheiing sucues of daa caegoies, which also implies he suppo of onologies fo lexical daa caegoies. Howeve, inheiance of lexical popeies is no explicily inended. The daf includes a coe specificaion fo basic lexical enies, plus a numbe of annexes fo synacic infomaion, mophological infomaion (wih disinc models fo simple and complex mophologies), ‘phasal’ enies, ec. As a mea-model, i defines he sucues using UML, bu does no give a equied XML foma fo inechange."]},{"title":"Exmple of LMF implemettio: ","paragraphs":["<Lexicon> <feat att=\"language\" val=\"ru\"/> <LexicalEntry> <feat att=\"partOfSpeech\" val=\"NII\"/> <Lemma> <feat att=\"writtenForm\" val=\"komnata\"/> </Lemma> <Sense> <feat att=\"animacy\" val=\"inanimate\"/> </Sense> <WordForm> <feat att=\"writtenForm\" val=\"komnata\"/> <feat att=\"grammaticalNumber\" val=\"singular\"/> <feat att=\"case\" val=\"nom\"/> </WordForm> </LexicalEntry> </Lexicon> </LexicalResource>"]},{"title":"3.4 Lexico Iterchge FormT (LIFT)","paragraphs":["The Lexicon Inechange Foma (LIFT) as inoduced by Hosken (2007) follows a diffeen appoach fom DATR and LMF The focus is no on lexical popeies as inheiance, bu on he lexical daa as povided by ools fom a fieldwok siuaion. The oiginal moivaion was ha he Sandad Foma (SF), which is he daa foma of mos SIL ools fo field linguiss (such as he widely used Shoebox/Toolbox pogams), can conain sucues which ae only implici and mus be infeed based on he ode of lexical daa caegoies, such as daa caegoies ha ae only elevan if hee is a specific value in anohe daa caegoy. An example fo English would be he use of a daa caegoy (subjec) peson only if he wod is a veb. Similaly, eaing polysemy can be achieved in SF by epeaing goups of daa caegoies such as definition, uage exam­ ple; he epeiion of goups of caegoies hence implies ha he wod no only has moe han one meaning, bu also ha hose caegoies may depend on each ohe. In SF hee is no way of expessing his (because hee is no concep of a closing ag); in LIFT hee is. Addiionally LIFT suppos onologies, which allows he defining no only of hieachies of caegoies, bu also he definiion of a se of daa caegoies as such, ensuing ha consisency is achieved. The undelying sucue of LIFT enies also allows coss-efeences, i.e. links o ohe enies. Such coss-efeences ae saed explicily in SF files, bu hee is no guaanee ha he age of such a coss-efeence acually exiss (and failed coss-efeences can, and ypically do, aise in a numbe of ways). LIFT is ongoing wok which is no ye fully sable. Gammaical infomaion, fo example, is no ye sandadized. On he ohe hand, LIFT comes wih ools ha can be used in he fieldwok envionmen. One way of epesening he pevious example in LIFT is he following Exmple of LIFT etry: <entry id=\"komnata\" dateCreated=\"2008-04-01\"> <lexical-unit> <form lang=\"ru\"> <text>komnata</text> </form>"]},{"title":"3209","paragraphs":["</lexical-unit> <sense id=\"komnatasense\"> <gloss lang=\"en\"> <text>room</text> </gloss> <trait name=\"paradigm\" value=\"N_II\"></trait> <trait name=\"animacy\" value=\"unanimate\"></trait> <trait name=\"mor class\" </sense> </entry>"]},{"title":"3.5 Text Ecodig Iititive's Dictiory Formt","paragraphs":["The TEI encoding allows encoding dicionay aicles of he adiional pined kind in sucued, XML foma. To allow fo his, he lexical daa caegoies appea in a sucued way in each lexicon aicle. Some daa caegoies ae pedefined in he specificaion, while ohes can be inseed as values of feaues o be specified. Exmple of TEI etry: <eny xmllang=\"u\"> <fom ype=\"lemma\">Komnaa</fom> <gamGp> <gam ype=\"inheis\">N_II</gam> <gam ype=\"animacy\">inanimae </gam> </gamGp> <sense xmllang=\"en\"> <ci ype=\"anslaion\" xmllang=\"en\"> <quoe>oom</quoe> </ci> </sense> </eny>"]},{"title":"3.6 Tbles i Chrcter eprted Vlue (CV) Formt","paragraphs":["The simples fomalism mos associaed wih lexicons is ha of a simple able. In a able foma, each ow epesens a lexicon eny, and each column a lexical daa caegoy. Tables may be epesened in simple daabase pogams, o by means of Chaace Sepaaed Values (CSVs), in which a paicula chaace (ofen a comma o ab) is used o delimi fields. This is he lexicon foma wih he flaes leaning cuve, bu i does no suppo synacic checking, any fom of inheiance, onology suppo ec. All of his would have o be povided a he ime of lexicon sucue design and implied in he lexicon sucue. CSV fomas pose he same poblems ha oiginally saed he design of LIFT, namely ha dependencies beween daa caegoies ae no explicily given, and hieachies ae no pa of he design. Fuhemoe, i does no eadily suppo epeaing fields (such as muliple usage examples fo a single sense). In summay, while his foma, ogehe wih some so of pose descipion, is a simple fom fo humans o deal wih, is limiaions ae clea."]},{"title":"Exmple of comm seprted list etry:","paragraphs":["komnaa, N, II, fem, ‘oom’"]},{"title":"4. Coversio Betwee Differet Lexico Represettio Formts","paragraphs":["One way of invesigaing he expessive popeies of a lexicon epesenaion foma is o show wha needs o be done o conve one foma ino anohe. Possible opions in his case ae ha infomaion available in one foma can be expessed by anohe foma, eihe fully, wih addiional human logics, such as he inepeaion of hieachies of lexical daa caegoies o naming of caegoies, o ha some bi of infomaion is los on he way. Table 1 shows he maix of convesion fom one foma o anohe. All lexicon fomas lised hee ae exensible in some way in ode o povide addiional daa caegoies. Hence i is possible o epesen he lexical infomaion in all fomalisms, wih human inevenion even wihou loss of infomaion, hough sucual infomaion may be los on he way. The descibed daa fomas seem o be esiced in one way o anohe hey eihe do no allow defining daa caegoy dependencies o hieachies of caegoies wihin hei sucue (DATR in he daa caegoy names, CSV in he ode of daa caegoies) o hey do no model inheiance of lexical infomaion explicily (LMF, CSV, LIFT). Some ae open in espec of daa caegoies"]},{"title":"3210","paragraphs":["(DATR, CSV, FSR), allowing muliple use of he same caegoy wihin one elemen, while ohes have a coe se of daa caegoies and exensibiliy mechanisms (TEI, LIFT, LMF). The availabiliy of applicaions is anohe fom of evaluaion fo he daa fomas, and i poves o be he mos es-senial pa lexicogaphes and field wokes equie ools if hey ae o use a foma. The ex oiened fomalisms discussed hee can be edied in ex edios, bu his is no helpful fo he aveage use. Though XML based edios can validae and assis uses in he ceaion of lexical esouces, hese fomas as such ae no use oiened bu implemenaion oiened. CSV fomas can be expoed fom a speadshee pogam, while LIFT is"]},{"title":"Table 1: Convertion table for the different lexicon repreentation format","paragraphs":["DATR FSR LMF LIFT TEI CSV DATR - FSR - LMF - LIFT - TEI - CSV - Fom ↓ o → Naming convenions of DATR heoies used fo hieachies; inheiance sucues can be expessed Depends on he used daa caegoies; LMF equies a leas one fom popey. Depends on he use of daa caegoies; some daa caegoies pedefined in LIFT; ag mis-use possible Repesenaion of fields possible; inheiance ules labelled as some kind of gammaical ules, dange of ag abuse Full fom lexicon see DATR o FSR commen; fo inheiance lexicons simila bu inheiance no explici Types of feaue sucues efe o inheiance, feaue names o daa caegoies; lossless Depends on he used daa caegoies; LMF equies a leas one fom popey.","See DATR o","LIFT commenSee DATR o","TEI commenEach daa caegoy is one column; muliple occuences of same daa caegoy equies epeiion of columns Hieachy of daa caegoies epesenable in DATR caegoy names; else simple Hieachy of daa caegoies epesenable in FSR hieachy names; else simple Depends on he concee implemenaion of LMF; examples in LMF ae subjec o he same poblems as DATR convesion ino LIFT Depends on he concee implemenaion of LMF; examples in LMF ae subjec o he same poblems as DATR convesion ino TEI see LMF o FSR commen See FSR o DATR commen","See LMF o","FSR commenLIFT can be seen as one implemenaion of LMF Diffeen daa caegoy hieachies see LMF o FSR commen Hieachy of daa caegoies epesenable in DATR caegoy names o by absac enies; lossless","See LMF o","FSR commenTEI can be seen as one implemenaion of LMF Diffeen daa caegoy hieachies see LMF o FSR commen Each column is one daa caegoy in DATR, inheiance of DATR no used; lossless Simple binay sucue, lossless","See DATR o","LMF commenSee DATR o","LIFT commenSee DATR o","TEI commen"]},{"title":"3211","paragraphs":["buil in as expo foma in some SIL ools. Fo inseing daa, hese fomas seem o be mos elevan. Fo woking wih daa, DATR povides moe poweful inepeaion funcions wih he DATR infeence engines available (JDATR, ZDATR, ec.). The TEI foma is bes seen as a way of epesening pin dicionaies. LMF is a famewok only. Feaue Sucue Repesenaions ae used fo he inechange of lexical daa fo mophological and synacic heoies, bu a fon end fo inseing daa ouside of he ex edio o XML edio is cuenly unknown. Fomal models as he Lexicon Gaph Model (Tippel, 2006) o ohe moe geneal descipions (fo example discussed by Polguèe, 2006) ae no implemened fo woking in envionmens such as field wok, laboaoy lexicogaphy, ec."]},{"title":"5. ummry d Recommedtios for Users","paragraphs":["The lexicon schemas and sandads inoduced hee have he descipive powe fo encoding he equied lexical daa caegoies. Some schemas ae moe open owads new daa caegoies and do no disciminae agains hem, while ohes disinguish beween a coe se and ex-ensions. The eal poblem fo lexicogaphes and field linguiss is hence no he lexicon schema bu he applicaion woking wih hose schemas. Wih human inevenions convesion is possible, so i emains fo he use o ask sofwae vendos fo sandad compliance and open-ness fo daa caegoies wih efeence o esablished sandads o sandads o be esablished."]},{"title":"6. Ackowledgemets","paragraphs":["The auhos would like o hank he oganizes of he wokshop \"Towad he Ineopeabiliy of Language Resouces\" oganized a Sanfod Univesiy in July 2007 and which allowed he auhos o mee. The wokshop was sponsoed by The Naional Science Foundaion (USA), he Univesiy of Kansas, Easen Michigan Univesiy, and The Linguis Lis."]},{"title":"7. Bibliogrphy","paragraphs":["J. Cowhe, edio (1995). Oxfod Advanced Leane's Dicionay of Cuen English. Oxfod Univesiy Pess, Oxfod, fifh ediion. R. Evans and G. Gazda (1996). DATR A language fo lexical knowledge epesenaion. Compuaional Linguisics, 22167-216. M. Hosken (2007). Lexicon inechange foma A descipion. URL hp//lif-sandad.googlecode.com/files/lif_10.pdf, lookup 2008-03-31. ISO 24610-12006. Language esouce managemen -- feaue sucues - Pa 1 Feaue sucue epesenaion, Inenaional Sandad. ISO-DIS 126202007. Teminology and ohe conen and language esouces - daa caegoies - specificaion of daa caegoies and managemen of a daa caegoy egisy fo language esouces, Daf Inenaional Sandad. ISO-DIS 246132007. Language esouce managemen -- lexical makup famewok (LMF), Daf Inenaional Sandad. A. Polguèe (2006). Sucual popeies of Lexical Sysems Monolingual and Mulilingual Pespecives. Proceeding of the Workhop on Multilingual Lan­ guage Reource and nteroperability (COLING/ACL 2006), Sydney, 50-59 TEI P5. Dicionaies. In TE P5: Guideline for Elec­ tronic Text Encoding and nterchange. Feb. 2008. Sec-ion 9. T. Tippel (2006). The Lexicon Gaph Model A geneic Model fo mulimodal lexicon developmen. AQ-Velag, Saabücken."]},{"title":"3212","paragraphs":[]}]}