{"sections":[{"title":"MTriage\\b\\tWeb\\fenabled\\tSoftware\\tfor\\tthe\\tCreation,\\tMachine\\tTranslation,\\tand\\t Annotation\\tof\\tSmart\\tDocuments","paragraphs":["Reginal\\b\\tHo\\f\\fs\\t","Multilingual\\tComputing\\tBranch\\t Army\\tResearch\\tLa\\f\\t","A\\belphi,\\tMD\\t ho\\f\\fs@arl.army.mil\\t\\t ","Jamal\\tLaou\\bi\\t","A\\bvance\\b\\tResource\\tTechnology,\\tInc.\\t","1555\\tKing\\tStreet\\tSuite\\t400\\t\\t\\t","Alexan\\bria,\\tVA\\t jlaou\\bi@arl.army.mil","Clare\\tR.\\tVoss","Multilingual\\tComputing\\tBranch\\t Army\\tResearch\\tLa\\f\\t","A\\belphi,\\tMD voss@arl.army.mil","Abstract\\t Progress\\tin\\tthe\\tMachine\\tTranslation\\t(MT)\\tresearch\\tcommunity,\\tparticularly\\tfor\\tstatistical\\tapproaches,\\tis\\tintensely\\t\\bata-\\briven.\\t\\tAcquiring\\t source\\t language\\t \\bocuments\\t for\\t testing,\\t creating\\t training\\t \\batasets\\t for\\t customize\\b\\t MT\\t lexicons,\\t an\\b\\t \\fuil\\bing\\t parallel\\t corpora\\t for\\t MT\\t evaluation\\t require\\t translators\\t an\\b\\t non-native\\t speaking\\t analysts\\t to\\t han\\ble\\t large\\t \\bocument\\t collections.\\tThese\\t collections\\t are\\t further\\t complicate\\b\\t \\fy\\t \\bifferences\\t in\\t format,\\t enco\\bing,\\t source\\t me\\bia,\\t an\\b\\t access\\t to\\t meta\\bata\\t \\bescri\\fing\\t the\\t \\bocuments.\\t Automate\\b\\t tools\\t that\\t allow\\tlanguage\\tprofessionals\\tto\\tquickly\\tannotate,\\ttranslate,\\tan\\b\\tevaluate\\tforeign\\tlanguage\\t\\bocuments\\tare\\tessential\\tto\\timproving\\tMT\\tquality\\t an\\b\\t efficacy.\\t The\\t purpose\\t of\\t this\\t paper\\t is\\t present\\tour\\t research\\t approach\\t to\\t improving\\t MT\\t through\\t pre-processing\\t source\\t language\\t \\bocuments.\\tIn\\tparticular,\\twe\\twill\\t\\biscuss\\tthe\\t\\bevelopment\\tan\\b\\tuse\\tof\\tMTriage,\\tan\\tapplication\\tenvironment\\tthat\\tena\\fles\\tthe\\ttranslator\\tto\\t markup\\t\\bocuments\\twith\\tmeta\\bata\\tfor\\tMT\\tparameterization\\tan\\b\\trouting.\\tThe\\tuse\\tof\\tMTriage\\tas\\ta\\twe\\f-ena\\fle\\b\\tfront\\ten\\b\\tto\\tmultiple\\tMT\\t engines\\thas\\tleverage\\b\\tthe\\tcapa\\filities\\tof\\tour\\thuman\\ttranslators\\tfor\\tcreating\\tlexicons\\tfrom\\tNFW\\t(Not-Foun\\b-Wor\\b)\\tlists,\\twriting\\treference\\t translations,\\tan\\b\\tcreating\\tparallel\\tcorpora\\tfor\\tMT\\t\\bevelopment\\tan\\b\\tevaluation.\\t \\t"]},{"title":"1. Introduction\\t","paragraphs":["Our\\t organizational\\t focus\\t is\\t \\fasic\\t an\\b\\t applie\\b\\t research\\t in\\t automate\\b\\t machine\\t translation\\t of\\t foreign\\t language\\t \\bocuments,\\tsupplying\\tour\\tusers\\twith\\ttechniques\\tan\\b\\tcriteria\\t for\\t the\\t use\\t of\\t MT.\\t We\\t have\\t \\besigne\\b\\t em\\fe\\b\\be\\b\\t MT\\t systems,\\t such\\t as\\t FALCon\\t (Forwar\\b\\t Area\\t Language\\t Converter),\\t to\\t assist\\t the\\t non-linguist\\t in\\t han\\bling\\tforeign\\t language\\t texts.\\t (Fisher\\t &\\t Voss,\\t 1997)\\t The\\t pro\\flem\\t space\\t that\\t we\\t are\\t trying\\t to\\t a\\b\\bress\\t is:\\t given\\t multiple\\t availa\\fle\\t MT\\tengines\\tan\\b\\ta\\tlack\\tof\\tsufficient\\ttranslators,\\thow\\tcan\\twe\\t leverage\\t human\\t expertise\\t to\\t han\\ble\\t large\\t collections\\t of\\t foreign\\t language\\t \\bocuments?\\t Our\\t answer\\t is\\t to\\t i\\bentify\\t techniques\\tan\\b\\t\\besign\\ttools\\tto\\tcapture\\tthe\\tannotations\\tfrom\\t the\\tanalyst,\\tusing\\tthe\\tinformation\\tfor\\tselection\\tan\\b\\trouting\\t to\\tMT\\tservices.\\t\\t\\t"]},{"title":"2. Approach\\t","paragraphs":["One\\t aspect\\t of\\t HLT\\t (Human\\t Language\\t Technology)\\t research\\t here\\t at\\t ARL\\t involves\\t how\\t \\fest\\t to\\t evaluate\\t availa\\fle\\tor\\tconstructe\\b\\tMT\\tengines\\tagainst\\tuser\\tnee\\bs.\\tTo\\t keep\\t up-to-\\bate\\t with\\t the\\t status\\t of\\t evaluation\\t in\\t the\\t MT\\t community,\\t we\\t have\\t \\feen\\t involve\\b\\t in\\t the\\t annual\\t NIST\\t (National\\t Institute\\t of\\t Stan\\bar\\bs\\t an\\b\\t Technology)\\t Evaluation\\t process\\t an\\b\\t workshops.\\t \\t During\\t a\\t NIST\\t Evaluation,\\tparticipants\\tare\\tsupplie\\b\\twith\\ta\\tlarge\\t\\bataset\\tin\\t a\\t selecte\\b\\t foreign\\t language.\\t These\\t \\batasets\\t are\\t to\\t\\fe\\t translate\\b\\t using\\t availa\\fle\\t MT\\t engines\\t to\\t create\\t output\\t \\bocuments\\t for\\t scoring\\t through\\t automate\\b\\t metrics.\\t Each\\t organization\\t attempts\\t to\\t maximize\\t scores\\t through\\t configuration\\tof\\ttheir\\tMT\\tengines.\\t One\\tof\\tthe\\tmore\\tla\\for\\tintensive\\tparts\\tof\\tour\\tparticipation\\tin\\t the\\t NIST\\t Evaluation\\t was\\t analyzing\\t the\\t \\batasets.\\t (Voss\\t et\\t al,\\t2006)\\tThe\\tprimary\\tcontextual\\tinformation\\tsupplie\\b\\twith\\t the\\t \\bocuments\\t consiste\\b\\t of\\t several\\t \\besignate\\b\\t genres\\t for\\t \\finning\\t purposes.\\t Our\\t translator\\t create\\b\\t reference\\t translations\\t of\\t samples\\t from\\t the\\t \\bataset\\t to\\t i\\bentify\\t other\\t potentially\\t helpful\\t information.\\t Determining\\t configuration\\t parameters\\tfor\\tMT\\twas\\tan\\titerative,\\ttrial-an\\b-error\\tprocess.\\t This\\t was\\t particularly\\t the\\t case\\t when\\t multiple\\t MT\\t engines\\t were\\t availa\\fle;\\t \\fecause\\t the\\t training\\t corpora\\t for\\t our\\t statistical\\t MT\\t servers\\t were\\t necessarily\\t \\bifferent\\t than\\t the\\t NIST\\t input,\\t it\\t require\\b\\t sometimes\\t visual\\t inspections\\t of\\t multiple\\t MT\\t outputs\\t to\\t \\betect\\t sensitivity\\t to\\t changes\\t in\\t parameters\\tor\\tinput\\t\\bata.\\tIt\\twas\\tclear\\tthat\\twe\\tnee\\be\\b\\ta\\tway\\t to\\t automate\\t some\\t of\\t the\\t \\bata\\t analysis\\t process,\\t leveraging\\t the\\t time\\t an\\b\\t expertise\\t of\\t our\\t translator\\t to\\t han\\ble\\tlarge\\t collections\\tquickly.\\t\\t Our\\texperience\\twith\\tthe\\tNIST\\tEvaluation\\twas\\ta\\tcatalyst\\tfor\\t our\\tpre-processing\\tfor\\tMT\\t(or\\tpre-MT)\\tapproach.\\tWe\\tha\\b\\t some\\t success\\t with\\t enhancing\\t MT\\t \\fy\\t leveraging\\t linguistic\\t an\\b\\t contextual\\t knowle\\bge\\t to\\t route\\t \\bocuments\\t to\\t the\\t appropriate\\t MT\\t engines.\\t The\\t hypothesis\\t of\\t our\\t pre-MT\\t research\\tis\\tthat\\tthere\\tare\\tcharacteristics\\tof\\tforeign\\tlanguage\\t texts\\t that\\t can\\t \\fe\\t exploite\\b\\t to\\t improve\\t the\\t output\\t of\\t MT.\\t This\\tconcept\\tuses\\tthe\\tsoftware\\tengineering\\tmetaphor\\tof\\tan\\t MT\\t engine\\t as\\t a\\t \"\\flack\\t \\fox\",\\t focusing\\t on\\t improving\\t what\\t comes\\tout\\tof\\tthe\\t\\fox\\t\\fy\\tenhancing\\twhat\\tis\\tfe\\b\\tinto\\tit.\\tOur\\t research\\t metho\\b\\t is\\t to\\t iterate\\t through:\\t 1)\\t i\\bentifying\\t can\\bi\\bate\\t pre-MT\\t activities,\\t 2)\\t using\\t tools\\t to\\t gather,\\t annotate,\\t an\\b\\t construct\\t test\\t \\batasets\\t for\\t each\\t pre-MT,\\t 3)\\t \\befining\\tMT\\trouting\\tan\\b\\tconfiguration\\ttechniques\\tfrom\\tthe\\t annotations,\\t 4)\\t translating\\t using\\t multiple\\t engines,\\t an\\b\\t 5)\\t evaluating\\tthe\\toutput\\twith\\tautomate\\b\\tmetrics.\\t\\t\\t"]},{"title":"3337","paragraphs":["Our\\t research\\tfocus\\tfor\\tthis\\tyear’s\\tNIST\\tEvaluation\\twas\\tto\\t 1)\\t leverage\\t the\\t expertise\\t of\\t our\\t translators\\t for\\t analyzing\\t NFW\\tan\\b\\tname\\b\\tentity\\ttranslation\\tfor\\taugmenting\\tMT\\twith\\t new\\t lexicons,\\t an\\b\\t 2)\\t take\\t a\\bvantage\\t of\\t MTriage\\t as\\t a\\t general\\tpurpose\\ttool\\tfor\\taccessing\\tmultiple\\tMT\\tengines\\tas\\t we\\f\\tservices\\tfor\\tcreating\\tparallel\\ttext.\\t\\t\\t"]},{"title":"3. Tool\\tDevelopment\\t","paragraphs":["We\\trequire\\b\\ta\\ttool\\tto\\tsupport\\tpre-MT\\tactivities\\tthat\\tcoul\\b\\t serve\\t as\\t a\\t front-en\\b\\t to\\t multiple\\t MT\\t engines\\t as\\t well\\t as\\t a\\t mechanism\\t for\\t capturing\\t an\\b\\t recor\\bing\\t annotations\\t from\\t the\\t translator.\\t The\\t \\besira\\fle\\t features\\t for\\tthe\\ttool:\\t1)\\tWe\\fena\\fle\\b,\\t service\\t oriente\\b\\t architecture\\t (SOA)\\t tool\\t for\\t platform-in\\bepen\\bent\\t access\\t to\\t multiple\\t MT\\t engines,\\t 2)\\t capa\\filities\\t for\\t e\\biting/storing\\t annotations\\t of\\t source\\t \\bocuments,\\t an\\b\\t 3)\\t support\\t for\\t the\\t creation\\t of\\t reference\\t translations.\\t"]},{"title":"3.1 MTriage\\t(Machine\\tTranslation\\tInput\\t Annotation\\tand\\tGenre\\tEncoding)\\t","paragraphs":["The\\t MTriage\\t prototype\\t is\\t implemente\\b\\t as\\t a\\t JavaScript\\t client.\\t\\tThe\\tchoice\\tof\\tJavaScript\\tallowe\\b\\tfor\\trapi\\b,\\titerative\\t \\bevelopment\\t as\\t well\\t as\\t a\\t measure\\t of\\t platform\\t in\\bepen\\bence.\\t The\\t tool\\t coul\\b\\t \\fe\\t utilize\\b\\t in\\t any\\t stan\\bar\\b\\t we\\f\\t \\frowser.\\t Distri\\fution\\t an\\b\\t installation\\t of\\t the\\t latest\\t version\\t of\\t the\\t tool\\t was\\t very\\t straightforwar\\b\\t \\fecause\\t the\\t we\\f\\tfile\\tcontaining\\tthe\\tem\\fe\\b\\be\\b\\tMTriage\\tclient\\tcoul\\b\\t\\fe\\t easily\\te-maile\\b\\tto\\tthe\\tuser\\tfor\\ttesting\\tan\\b\\tanalysis.\\t\\t\\t The\\t other\\t major\\t \\besign\\t \\becision\\t for\\t creating\\t the\\t tool\\t as\\t a\\t we\\f-client\\t was\\t the\\t necessity\\t for\\t remote\\t access\\t to\\t several\\t availa\\fle\\tMT\\tengines.\\tEach\\tengine\\twas\\tset\\tup\\tas\\ta\\tremote\\t we\\f\\t service,\\t accessi\\fle\\t \\fy\\t SOAP\\t (Simple\\t O\\fject\\t Access\\t Protocol)\\t messages\\t across\\t the\\t network.\\t The\\t format\\t an\\b\\t metho\\b\\t signature\\t of\\t calls\\t to\\t the\\t remote\\t MT\\t services\\t were\\t \\bescri\\fe\\b\\t in\\t WSDL\\t (We\\f\\t Services\\t Definition\\t Language)\\t files\\t supplie\\b\\t to\\t \\beveloper.\\t Dynamic\\t configuration\\tof\\t the\\t MT\\tengines\\twas\\tma\\be\\tavaila\\fle\\tto\\tthe\\tuser\\t\\birectly\\tthrough\\t the\\tuser\\tinterface.\\t Location\\b \\t\\t (\\benote\\b\\t \\fy\\t the\\t num\\fere\\b\\t circle)\\t on\\t the\\t screenshot\\t of\\t MTriage\\t in\\t Figure\\t 2\\t on\\t page\\t 5,\\t shows\\tthe\\t location\\tof\\tthe\\ttext\\tinput\\tarea\\tfor\\tthe\\tsource\\t\\bocument.\\tThe\\t language\\t mapping\\t pull-\\bown\\t menu\\t a\\fove\\t the\\t input\\t area\\t allows\\tfor\\tthe\\tselection\\tof\\tlanguage\\tpairs\\tfor\\ttranslation.\\tIn\\t the\\texample\\tin\\tthe\\tfigure,\\tAra\\fic-to-English\\ttranslation\\twill\\t \\fe\\t performe\\b\\t on\\t the\\t Ara\\fic\\t script\\t from\\t the\\t source\\t input\\t area.\\t\\t Location\\b2\\tis\\ta\\tgrouping\\tof\\tsome\\tof\\tthe\\tannotations\\tthat\\tcan\\t \\fe\\tassociate\\b\\twith\\tthe\\ttext.\\t\\tThe\\ttype\\tof\\tfile\\tto\\t\\fe\\tprocesse\\b\\t (local\\t file,\\t online\\t \\bocument,\\t or\\t generate\\b\\t text)\\t can\\t \\fe\\t selecte\\b\\t as\\t well\\t as\\t a\\t lexicon\\t \\fy\\t choosing\\t an\\t appropriate\\t \\bomain.\\t The\\t \\bomain\\t selection\\t controls\\t \\bictionary\\t stacking\\t within\\tthe\\tcalle\\b\\tMT\\tengine.\\tThe\\tname\\b\\tentity\\toption\\tuses\\t pattern\\tmatching\\tto\\t\\betect\\thits\\tfrom\\ta\\tpre-\\besignate\\b\\tlist\\tof\\t unique\\t names.\\t These\\t i\\bentifie\\b\\t name\\b\\t entities,\\t their\\t location,\\tan\\b\\tappropriate\\ttranslations\\tare\\tannotate\\b.\\t\\t The\\tanalyst\\tcan\\tchoose\\tfrom\\tseveral\\tMT\\tengines\\t(as\\tshown\\t at\\tLocation\\b 3).\\t The\\t selection\\t of\\t the\\t MT\\t engines\\t is\\t colorco\\be\\b\\t to\\t in\\bicate\\t their\\t availa\\fility.\\t The\\t color\\t co\\bing\\t is\\t change\\b\\tupon\\tselection\\tof\\ta\\tlanguage\\tpair.\\t\\freen\\tin\\bicates\\t that\\tan\\tMT\\tengine\\tsupports\\tthe\\tlanguage\\tpair,\\tred\\tin\\bicates\\t that\\t the\\t MT\\t engine\\t cannot\\t process\\t the\\t language\\t pair,\\t an\\b\\t blue\\t\\benotes\\tthe\\tcurrently\\tselecte\\b\\tMT\\tengine.\\tA\\tuser\\tcan\\t enter\\tthe\\tfile\\tto\\t\\fe\\ttranslate\\b\\t\\birectly\\tin\\tthe\\tFile:\\ttext\\tfiel\\b\\t or\\t can\\t \\frowse\\t the\\t local\\t \\birectory\\t structure\\t to\\t select\\t a\\t file\\t for\\tuploa\\bing\\tinto\\tthe\\ttext\\tarea.\\t Location\\b 4\\t is\\t the\\t text\\t area\\t that\\t contains\\t the\\t results\\t of\\t the\\t automate\\b\\t translations.\\t Human\\t translations\\t are\\t entere\\b\\t \\birectly\\tin\\tthis\\ttext\\tarea\\tto\\tcreate\\treference\\ttranslations\\tfor\\t evaluation.\\t The\\t resulting\\t reference\\t translation\\t is\\tannotate\\b\\t with\\tthe\\ttranslator’s\\tname\\tan\\b\\texplicitly\\tconnecte\\b\\twith\\tthe\\t source\\t \\bocument.\\t Post-e\\bits\\t of\\t MT\\t output\\t can\\t also\\t \\fe\\t \\birectly\\tentere\\b\\tinto\\tthe\\ttarget\\tresults\\tarea,\\tan\\b\\tare\\t\\benote\\b\\t as\\tsuch\\twithin\\tthe\\tinternal\\tsmart\\t\\bocument.\\t The\\t translation\\t controls\\t an\\b\\t configuration\\t options\\tare\\t \\bepicte\\b\\t at\\tLocation\\b 5.\\t The\\t options\\t are\\t also\\t color-co\\be\\b\\t an\\b\\t are\\t MT-\\bepen\\bent.\\t Upon\\t selecting\\t an\\t MT\\tengine,\\tthe\\t configuration\\t options\\t are\\t color\\t co\\be\\b\\t appropriately\\t to\\t green\\t,\\t\\flue,\\tor\\tre\\b.\\tThe\\tuser\\tof\\tthe\\tMTriage\\ttool\\tcan\\ttoggle\\t transliteration\\t on\\t the\\t output\\t \\bata,\\t as\\t well\\t as\\t request\\t normalization\\tof\\tthe\\tsource\\t\\bata\\t\\fy\\tselecting\\tthese\\toptions.\\t An\\talgorithm\\twithin\\tthe\\ttool\\tfor\\tcalculating\\tthe\\tnum\\fer\\tof\\t NFWs\\t is\\t use\\b\\t to\\t \\bisplay\\t the\\t metric\\t \\birectly\\t on\\t the\\tuser\\t interface\\t after\\t translation.\\t The\\t algorithm\\t is\\t MT-specific,\\t \\fase\\b\\t on\\t the\\t presence\\t of\\t \\belimiters\\t or\\tother\\tnotations\\tthat\\t \\bistinguish\\tthe\\tNFWs\\tfrom\\tthe\\trest\\tof\\tthe\\ttext.\\tTranslating\\ta\\t \\bocument\\t with\\t the\\t \\befault\\t settings\\t is\\t \\bone\\t \\fy\\t pressing\\t the\\t Translate\\t \\futton.\\t Using\\t the\\tTranslateWithOptions\\b\\futton\\t causes\\t MTriage\\t to\\t parameterize\\t the\\t configuration\\t options\\t selecte\\b\\t\\fy\\tthe\\tuser.\\t Viewing\\t the\\t internal\\t smart\\t \\bocument\\t is\\t \\bone\\t \\fy\\t rightclicking\\ton\\tthe\\tuser\\tinterface\\tan\\b\\tchoosing\\tthat\\toption\\tfrom\\t a\\t pop-up\\t context\\t menu.\\t Exporting\\t the\\t internal\\t smart\\t \\bocument\\t to\\t multiple\\t parallel\\t text\\t files,\\t \\t creating\\t a\\t multilingual\\t Excel\\t sprea\\bsheet,\\t an\\b\\t saving\\t the\\t smart\\t \\bocument\\t in\\t XML\\t format\\t are\\t functions\\t that\\t are\\t also\\t accessi\\fle\\ton\\tthe\\tcontext\\tmenu.\\t"]},{"title":"3.2 Smart\\tDocument\\tSchema\\t","paragraphs":["The\\t annotations\\t ha\\b\\t to\\t \\fe\\t associate\\b\\t with\\t the\\t source\\t \\bocument\\tin\\ta\\tway\\tthat\\t\\bi\\b\\tnot\\tmo\\bify\\tthe\\toriginal\\tcontent.\\t Incorporating\\tmarkup\\t\\birectly\\twithin\\tthe\\ttext\\twoul\\b\\trequire\\t a\\b\\bitional\\t processing\\t to\\t strip\\t out\\t the\\t \\betails\\t prior\\t to\\t translation.\\t The\\t smart\\t \\bocument\\t approach\\t treats\\t the\\t \\bocument\\t as\\t an\\t o\\fject,\\t encapsulating\\t the\\t raw\\t input\\ttext\\t within\\tmeta\\bata\\tan\\b\\tannotations\\tthat\\t\\bescri\\fe\\tit.\\tUnlike\\tthe\\t"]},{"title":"3338","paragraphs":["Annotate\\ttool,\\twhich\\tuses\\tlinguistic\\tinformation\\tan\\b\\thi\\b\\ben\\t Markov\\tmo\\bels\\tfor\\tsyntactic\\tcorpus\\tannotations\\t(Brants\\t&\\t Plaehn,\\t 2000),\\t we\\t require\\b\\t a\\t static\\t structure\\t for\\t capturing\\t annotations\\twithin\\tthe\\t\\bocuments.\\t\\t \\t \\t Figure\\t1\\tSmart\\tDocument\\tSchema\\t \\t The\\tchoice\\tof\\tan\\tXML\\tschema\\tsupports\\tthe\\to\\fject-oriente\\b\\t view\\t of\\t the\\t \\bocument,\\t separating\\t the\\t semantically\\t useful\\t smart\\t \\bocument\\t structure\\t from\\t the\\t applications\\t that\\t take\\t a\\bvantage\\t of\\t the\\t meta\\bata.\\t Annotea,\\t a\\t RDF\\t stan\\bar\\b\\t \\bevelope\\b\\t \\fy\\t the\\t worl\\bwi\\be\\t we\\f\\t consortium\\t (W3C),\\t supports\\t we\\f\\t \\fase\\b\\t \\bocument\\t sharing\\t an\\b\\t colla\\foration\\t through\\t markup\\t tags,\\t \\fookmarks,\\t an\\b\\t annotations.\\t (Kahan\\t et\\tal,\\t2001)\\t\\tAn\\tXML\\tschema,\\tcalle\\b\\tWan\\baML,\\thas\\t\\feen\\t \\bevelope\\b\\tto\\tcapture\\tsingle\\tlanguage\\t\\bocument\\tannotations\\t for\\t the\\t purpose\\t of\\t forensic\\t han\\bwriting\\t analysis.\\t (Franke,\\t Guyon,\\t&\\tSchomaker,\\t2004)\\t\\tIn\\ta\\tsimilar\\tfashion,\\tour\\tsmart\\t \\bocument\\t schema\\t takes\\t a\\bvantage\\t of\\t the\\t extensi\\fility\\t an\\b\\t flexi\\fility\\tof\\ta\\tmarkup\\tlanguage\\tfor\\tannotations.\\tIt\\t\\biffers\\tin\\t that\\twe\\tare\\tnot\\tconstraining\\tour\\t\\bocuments\\twith\\trespect\\tto\\t genre\\t (we\\f\\t \\bocuments),\\t monolingual\\t text,\\t or\\t specific\\t application\\t (han\\bwriting\\t analysis).\\t The\\t use\\t of\\t XML\\t namespaces\\t will\\t allow\\t us\\t to\\t leverage\\t the\\t capa\\filities\\t in\\t these\\t other\\t languages,\\t focusing\\t our\\t efforts\\t on\\t capturing\\t annotations\\tfor\\tpre-processing\\tactivities.\\t Figure\\t 1\\t is\\t a\\t visual\\t representation\\t of\\t the\\t smart\\t \\bocument\\t XML\\tschema.\\tThe\\timportant\\tthing\\tto\\tnote\\ta\\fout\\tthe\\t\\besign\\t of\\t this\\t knowle\\bge\\t structure\\t is\\t that\\t it\\t \\bescri\\fes\\t a\\tsmart\\t \\bocument\\t as\\t containing\\t multiple\\t \\bocuments\\t an\\b\\t the\\t meta\\bata\\ta\\fout\\tthose\\t\\bocuments.\\tThe\\texpan\\be\\b\\tarea\\tof\\tthe\\t schema\\t(highlighte\\b\\tin\\tyellow)\\tshows\\tsome\\tof\\tthe\\tattri\\futes\\t a\\fout\\ta\\tsource\\t\\bocument\\tthat\\tcoul\\b\\t\\fe\\tattache\\b,\\tsuch\\tas\\tthe\\t locations\\t of\\t zones\\t an\\b\\t fiel\\bs\\t within\\t the\\t text,\\t the\\tgenre\\t of\\t the\\t \\bocument,\\t layout\\t features,\\t the\\t presence\\t of\\t mixe\\b\\t language\\t texts,\\t an\\b\\t so\\t on.\\t These\\t attri\\fute\\t annotations\\t can\\t \\fe\\tassigne\\b\\tto\\tthe\\t\\bocument\\tcomputationally,\\tthrough\\tuser\\t input,\\tor\\ta\\tcom\\fination\\tof\\t\\foth.\\tWe\\tplan\\tto\\texamine\\tthe\\tuse\\t of\\t machine\\t learning\\t for\\t \\befining\\t smart\\t \\bocuments\\t within\\t MTriage,\\t potentially\\t creating\\t feature\\t vectors\\t to\\t automate\\t annotations\\t for\\t large\\t \\batasets.\\t \\t One\\t of\\t the\\t primary\\t a\\bvantages\\t of\\t XML\\t as\\t knowle\\bge\\t format\\t for\\t smart\\t \\bocuments\\tis\\tthe\\ta\\fility\\tto\\tuse\\tXSL\\tfor\\ttransformations\\tof\\t the\\t \\bocuments,\\t supporting\\t multiple\\t MT\\t applications\\t in\\bepen\\bent\\tof\\tthe\\toriginal\\tsource\\tof\\tthe\\tmaterial.\\tFor\\tnow,\\t MTriage\\t constructs\\t the\\t internal\\t smart\\t \\bocuments,\\t \\fut\\tuses\\t em\\fe\\b\\be\\b\\t functions\\t to\\t generate\\t the\\t parallel\\t texts,\\t sprea\\bsheets,\\t an\\b\\t network\\t messages\\t for\\t the\\t MT\\t we\\f\\t services.\\t"]},{"title":"4. Building\\tCorpora\\twith\\tMTriage\\t","paragraphs":["The\\t MTriage\\t tool\\t is\\t \\feing\\t use\\b\\t to\\t \\fuil\\b\\t the\\t \\batasets\\t necessary\\tto\\tevaluate\\tthe\\tpre-MT\\tapproach.\\t\\t\\tIn\\tFigure\\t3\\ton\\t page\\t 6,\\t a\\t smart\\t\\bocument\\tcontaining\\tAra\\fic\\tsource\\ttext\\tis\\t encapsulate\\b\\twith\\ttranslate\\b\\tEnglish\\tresults\\t\\bocuments.\\tThe\\t meta\\bata\\tfor\\tthis\\tparticular\\t\\bocument\\tcontains\\ttokenization\\t information\\t that\\t was\\t generate\\b\\t \\fy\\t MTriage.\\t Between\\tthe\\t <tokens>\\t tags,\\t there\\t are\\t or\\bere\\b\\t pairs\\t of\\t num\\fers\\t representing\\tthe\\tlocation\\tan\\b\\tstring\\tlength\\t(respectively)\\tof\\t all\\t the\\t tokens\\t in\\t the\\t Ur\\bu\\t source\\t text.\\t Using\\t the\\t Unico\\be\\t representation\\t of\\t the\\t tokens,\\t it\\t is\\t possi\\fle\\t to\\t separate\\t the\\t tokens\\t into\\t su\\f-types.\\t The\\t<tokens>\\t tag\\t with\\t the\\t punctuation\\t type\\t attri\\fute\\t contains\\t or\\ber\\t pairs\\t where\\t the\\t first\\t value\\t is\\t the\\t \\betecte\\b\\t punctuation\\t character\\t an\\b\\t the\\t secon\\b\\t value\\t is\\t its\\t position\\t in\\t the\\t original\\t source\\t text.\\t\\t Using\\t the\\t same\\t metho\\b,\\t MTriage\\t can\\t i\\bentify\\t num\\fer\\t tokens\\t an\\b\\t potential\\t NFWs\\t as\\t tokens\\t that\\t are\\t using\\tan\\t alternate\\t script\\t that\\t the\\t primary\\t text.\\t The\\t automate\\b\\tscript\\t i\\bentification\\tof\\t“Ara\\fic”\\tis\\t\\fase\\b\\ton\\tthe\\tUnico\\be\\trange.\\t\\t There\\t is\\t an\\t automate\\b\\t translation\\t from\\tMTEngine5\\t within\\t the\\t smart\\t \\bocument.\\t The\\t NFW\\t count\\t for\\t this\\t particular\\t engine\\tcan\\t\\fe\\t\\betermine\\b,\\tsince\\tthe\\t\\fracket\\t“[]”\\t\\belimiter\\tis\\t use\\b\\taroun\\b\\tthe\\ttransliterate\\b\\ttext.\\tThe\\treference\\t\\bocument\\t create\\b\\t \\fy\\t our\\t translator\\t is\\t inclu\\be\\b\\t as\\t a\\t groun\\b\\t truth\\t English\\tversion\\tof\\tthe\\tAra\\fic\\ttext.\\tThe\\tvariant\\tattri\\fute\\ton\\t \\foth\\t non-source\\t \\bocuments\\t i\\bentify\\t them\\t as\\t translations\\t an\\b\\tinclu\\be\\tlanguage\\tpair\\tmapping\\tinformation.\\tAccor\\bing\\t to\\t our\\t translator,\\t the\\t capa\\fility\\t for\\t visual\\t inspections\\t of\\t parallel\\tMT\\toutputs\\talone\\thas\\tenhance\\b\\tthe\\t\\bata\\tgathering\\t an\\b\\tanalysis\\tprocess.\\t A\\tcase\\tstu\\by\\twhere\\tthe\\tusefulness\\tof\\tMTriage\\twas\\trecently\\t vali\\bate\\b\\t was\\t \\buring\\t ARL’s\\t participation\\t in\\t the\\t Ur\\bu\\t Language\\t Track\\t for\\t the\\t NIST\\t Evaluation.\\t We\\t focuse\\b\\ton\\t research\\t issues\\t of\\t augmenting\\t MT\\t engines\\t that\\t support\\t Ur\\bu-to-English\\t translation.\\t (Voss\\t et\\t al,\\t 2008)\\t Ur\\bu,\\t as\\t a\\t Less\\t Commonly\\t Taught\\t Language\\t (LTCL),\\t ha\\b\\t fewer\\t resources\\t availa\\fle\\t in\\t terms\\t of\\t \\foth\\t MT\\t engines\\t an\\b\\t parallel\\tcorpora\\tfor\\t\\fuil\\bing\\tengines.\\tBecause\\tMT\\tengines\\t are\\t fairly\\t static\\t with\\t respect\\t to\\t lexicon,\\t translators\\t encounter\\t increasing\\t num\\fers\\t of\\t NFWs\\t when\\t trying\\t to\\t process\\t large\\t \\batasets.\\t From\\t an\\t MT\\t stakehol\\ber\\t"]},{"title":"3339","paragraphs":["perspective,\\t there\\t is\\t the\\t question\\t of\\t how\\t much\\t \\bata\\t is\\t necessary\\t for\\t improving\\t their\\t existing\\t engines\\t an\\b\\thow\\t to\\t effectively\\t apply\\t the\\t \\bata.\\t To\\t answer\\t these\\t questions,\\t we\\t con\\bucte\\b\\t empirical\\t stu\\bies\\t with\\t the\\t NIST\\t evaluation\\t \\bataset.\\t The\\tMT\\tengines\\tthat\\tsupport\\tthe\\tUr\\bu-to-English\\tlanguage\\t pairs\\twere\\taccessi\\fle\\tthrough\\tMTriage.\\tThe\\ttranslators\\tan\\b\\t analysts\\twere\\ta\\fle\\tto\\tuse\\tthe\\ttool\\tfor\\ttranslating\\tportions\\tof\\t the\\t NIST\\t \\batasets\\t an\\b\\t specific\\t \\bata\\t gathering\\t tasks.\\t One\\t particular\\tuse\\tof\\tMTriage\\twas\\tin\\tharvesting\\tNFWs\\tto\\tcreate\\t lexicons\\t for\\t MT\\t engines.\\t Source\\t language\\t text\\t was\\t collecte\\b\\tfrom\\tthe\\tNIST\\tUr\\bu\\tresources\\tas\\twell\\tas\\tthrough\\t a\\t We\\f\\t scraping\\t application.\\t The\\t We\\f\\t scraper\\t analyze\\b\\t Ur\\bu\\t news\\t sites,\\t extracting\\t the\\t Ur\\bu\\ttext\\ton\\ta\\t\\baily\\t\\fasis.\\t Our\\tUr\\bu\\ttranslator\\tcoul\\b\\tthen\\tuse\\tMTriage\\tto\\ttranslate\\tthe\\t source\\ttext\\tagainst\\tthe\\tUr\\bu\\tMT\\tengines\\tto\\ti\\bentify\\twor\\bs\\t an\\b\\t phrases\\t that\\t were\\t not\\t part\\t of\\t the\\t engine’s\\t current\\t lexicon.\\t Figure\\t 4\\t on\\t page\\t 7\\t is\\t an\\t Excel\\t sprea\\bsheet\\t generate\\b\\t\\fy\\tMTriage\\tthat\\tshows\\tthe\\tMT\\toutput\\tas\\tparallel\\t text.\\tMTriage\\tuse\\b\\tthe\\tinternal\\tsmart\\t\\bocument\\tstructure\\tto\\t generate\\t a\\t sprea\\bsheet\\t with\\t the\\t original\\t source\\t language\\t text\\t an\\b\\t two\\t translations\\t using\\tMTEngine5.\\t MTriage\\t use\\b\\t meta\\bata\\t a\\fout\\t the\\tsource\\t\\bocument\\tto\\tset\\tthe\\tappropriate\\t text\\t \\birection,\\t in\\t this\\t instance,\\t right-to-left.\\t In\\t the\\t secon\\b\\t column\\t on\\t the\\t sheet,\\t the\\t translation\\t shows\\t NFWs\\t as\\t transliterate\\b\\tLatin\\tcharacters\\twithin\\t\\frackets.\\tTo\\tgenerate\\t the\\t thir\\b\\t column,\\t the\\t translator\\t turn\\t off\\t the\\t transliteration\\t option,\\t leaving\\t the\\t Ur\\bu\\t string\\t in\\t the\\t text.\\t Giving\\t the\\t translator\\tthe\\ta\\fility\\tto\\texamine\\tthe\\tnew\\twor\\b\\tin\\tits\\toriginal\\t context\\thelps\\twith\\twor\\b\\tsense\\t\\bisam\\figuation\\tan\\b\\tsupports\\t a\\tmore\\taccurate\\treference\\ttranslation\\tfor\\tthe\\tnew\\tlexicon.\\t We\\t constructe\\b\\t several\\t lexicons\\t using\\t this\\t technique\\t for\\t use\\t in\\t our\\t augmentation\\t experiments.\\t For\\t one\\t of\\t the\\t MT\\t engines,\\t we\\t converte\\b\\t the\\t lexicons\\t to\\t customize\\b\\t user\\t \\bictionaries\\t for\\t stacking\\t within\\t the\\t engine.\\t We\\t then\\t ran\\t a\\t series\\tof\\texperiments\\tof\\tthe\\tNIST\\tevaluation\\t\\bataset,\\tusing\\t MTriage\\t to\\t parameterize\\t the\\t selection\\t of\\t user\\t \\bictionary.\\t\\t We\\t evaluate\\b\\t the\\t MT\\t output\\t using\\t the\\t assesse\\b\\t BLEU\\t score\\t against\\t the\\t \\faseline\\t (no\\t custom\\t Ur\\bu\\t \\bictionary).\\t\\t There\\twas\\ta\\tslight\\tincrease\\tof\\tBLEU\\tscore\\tin\\tone\\tcase,\\t\\fut\\t it\\t was\\t too\\t small\\t an\\t increase\\t to\\t \\fe\\t statistically\\t significant.\\t The\\t other\\t scores\\t remaine\\b\\t a\\fout\\t the\\tsame\\tas\\tthe\\t\\faseline,\\t or\\t \\becrease\\b\\t \\fy\\t a\\t small\\t amount.\\t The\\t lack\\t of\\t major\\t improvement\\t coul\\b\\t \\fe\\t \\bue\\t to\\t the\\t sample\\t size\\t or\\t a\\t lack\\t of\\t sensitivity\\t to\\t this\\t type\\t of\\t augmentation\\t within\\t the\\t BLEU\\t automate\\b\\tmetric.\\t\\tThe\\tNFW\\tcount\\tfor\\tthe\\tevaluation\\t\\bata\\t \\bi\\b\\t improve,\\t however,\\t with\\t up\\t to\\t ten\\t percent\\t of\\t the\\t new\\t wor\\bs\\t \\feing\\t \\betecte\\b\\t \\fy\\t the\\t MT\\t engine.\\t It\\t woul\\b\\t \\fe\\t interesting\\tto\\tsee\\tif\\tthere\\tis\\ta\\tcorrespon\\bing\\tincrease\\tin\\tthe\\t measure\\tof\\teffectiveness\\tof\\tthe\\tMT\\toutput,\\ti.e.\\tthe\\tusa\\fility\\t of\\tthe\\tMT\\toutput\\tfor\\tspecific\\ttasks.\\t"]},{"title":"5. Future\\tWork\\t","paragraphs":["The\\t potential\\t improvement\\t on\\t MT\\t quality\\t through\\t annotation-\\briven\\t pre-processing\\t activities\\t seems\\t intuitive\\t an\\b\\t supporte\\b\\t anec\\botally\\t \\fy\\t our\\t efforts\\t so\\t far.\\t We\\t are\\t using\\t the\\t MTriage\\t tool\\t an\\b\\t smart\\t \\bocument\\t schema\\t in\\t an\\t empirical\\t stu\\by\\t with\\t automate\\b\\t metrics\\t to\\t vali\\bate\\tthis\\t improvement\\t statistically.\\t The\\t smart\\t \\bocument\\t format\\t is\\t \\feing\\t leverage\\b\\t to\\t support\\t other\\t MT\\t \\bata\\t requirements,\\t such\\t as\\t \\fuil\\bing\\t parallel\\t corpora\\t for\\t training\\t \\batasets,\\t segmentation\\t an\\b\\t alignment\\t of\\t source\\t \\bocuments,\\t an\\b\\t comparison\\t of\\t multiple\\t human\\t translations\\t to\\t calculate\\t inter-annotator\\t agreement.\\t Incorporating\\t a\\baptive\\t machine\\t learning\\t techniques,\\t as\\t \\bescri\\fe\\b\\t in\\t the\\t GATE\\t (General\\t Architecture\\t for\\t Text\\t Engineering)\\t (Cunningham\\t et\\t al,\\t 2002)\\t environment,\\t into\\t MTriage\\t is\\t \\feing\\t examine\\b\\t for\\t automate\\b\\t annotation\\t an\\b\\t information\\t extraction\\t on\\tlarge\\t \\bata\\tcollections.\\t"]},{"title":"6. References\\t","paragraphs":["Brants,\\t T.\\t an\\b\\t O.\\t Plaehn.\\t (2000)\\t Interactive\\t corpus\\t annotation.\\tIn\\tProceedings\\bof\\bthe\\bSecond\\bInternational\\b Conference\\b on\\b Language\\b Resources\\b and\\b Evaluation.\\t (LREC\\t’00).\\tAthens,\\tGreece.\\tMay\\t31\\t-\\tJune\\t2.\\t","Cunningham,\\t H.,\\t D.\\t Maynar\\b,\\t K.\\t Bontcheva,\\t V.\\t Ta\\flan.\\t (2002)\\t GATE:\\t A\\t Framework\\t an\\b\\t Graphical\\t Development\\t Environment\\t for\\t Ro\\fust\\t NLP\\t Tools\\t an\\b\\t Applications.\\t In\\tProceedings\\b of\\b the\\b 40th\\b Anniversary\\b Meeting\\b of\\b the\\b Association\\b for\\b Computational\\b Linguistics\\b(ACL'02).\\tPhila\\belphia,\\tJuly\\t2002.\\t","Fisher,\\t F.\\t an\\b\\tC.R.\\tVoss\\t(1997)\\tFALCon,\\tAn\\tMT\\tSystem\\t Support\\t Tool\\t for\\t Non-linguists.\\t In\\tProceedings\\b of\\b the\\b Advanced\\b Information\\b Processing\\b and\\b Analysis\\b Conference\\b(AIPA\\t97),\\tMcLean,\\tVA.\\t\\t","Franke,\\t K.,\\t L.\\t Guyon,\\t L.\\t Schomaker\\t (2004).\\t The\\t Wan\\baML\\t markup\\t language\\t for\\t \\bigital\\t \\bocument\\t annotation\\tIn\\b Proceedings\\b of\\b 9th\\b IWFHR,\\t Japan,\\t Los\\t Alamitos:\\tIEEE\\tComputer\\tSociety,\\tpp.\\t563-568.\\t","Kahan,\\t J.,\\t Koivunen,\\t M.-R.,\\t Pru\\b'Hommeaux,\\t E.,\\t an\\b\\t Swick,\\t R.\\t R.\\t (2001)\\t Annotea:\\t An\\t Open\\t RDF\\t Infrastructure\\t for\\t Share\\b\\t We\\f\\t Annotations.\\t In\\tThe\\b Tenth\\b Int’l\\b World\\b Wide\\b Web\\b Conference,\\t Hong\\t Kong,\\t May,\\tpp.\\t623-632\\t","Voss,\\t C.R,\\t J.\\t Laou\\bi,\\t S.\\t Lee,\\t J.\\t Micher,\\t C.\\t Tate.\\t (2006)\\t Five\\t Ara\\fic-English\\t MT\\t Engines:\\t Performance\\t on\\t Newswire\\t &\\t Military\\t Corpora.\\tIn\\b Proceedings\\b of\\b the\\b DARPA\\b TIDES/NIST\\b Workshop\\b on\\b Machine\\b Translation,\\tAlexan\\bria,\\tVA.\\t","Voss,\\t C.,\\t R.\\t Ho\\f\\fs,\\t J.\\t Micher,\\t J.\\t Laou\\bi,\\t M.\\t Aguirre,\\t R.\\t Chang,\\tG.\\tJahe\\b.\\t(2008)\\tAugmenting\\tUr\\bu-English\\tMT\\t Engines\\t at\\t ARL.\\t Presentation,\\t In\\tProceedings\\b of\\b the\\b NIST\\b Machine\\b Translation\\b Workshop,\\t Arlington,\\t VA."]},{"title":"3340  ","paragraphs":["\\t \\t Figure\\t2\\tMTriage\\tUser\\tInterface\\t"]},{"title":"3341    ","paragraphs":["\\t Figure\\t3\\tExample\\tSmart\\tDocument\\twith\\tAnnotations\\t        "]},{"title":"3342 ","paragraphs":["Source \\b\\tngu\\tge \\fext M\\fEngine5 M\\f Output M\\fEngine5 M\\f Output Urdu English English","’ؤ نRنC نc ا نc ں د ا‘ Expansion òf ISI in Uttar Pradesh ' Expansion òf ISI in Uttar Pradesh '  نRر ں ںد ہنR ہنC ےہر او ے ر روا اراد","نC ںو ت ہ نR ے ت ہ ےہ نRنC رنR ہاو ے ادنRہا نC نRہا ہو ےنC سا ۔ےہ ماا نRنC ےہ","ے ہنC ےنCنC رنR","،نR ف ا ل ۔ںہ ےے منR نCا روا رنR ،ننRا ،دنR نC ا نRہا ہ ہ ےنC اہ نC ا نc","۔ںہ ڈنRر Remember that police from state capital Lucknow and [bjnor] district in recent days has arrested to five alleged extremists on which prohibited extremist is allegation of being related with organization movement [aljhadalaslami]. Of arresting with three extremists Calcutta besides him are Lucknow [la-eeg-ee]. Mukhtar and Akbar Aziz Al Rahman, Naushad, known as gentleman, Jalaluddin is on police remand on the instructions of court special C B I of Lucknow at present this alleged extremist of name. Remember that police from state capital Lucknow and ر district in recent days has arrested to five alleged extremists on which prohibited extremist is allegation of being related with organization movement مادنRہا. Of arresting with three extremists Calcutta besides him are Lucknow ےے. Mukhtar and Akbar Aziz Al Rahman, Naushad, known as gentleman, Jalaluddin is on police remand on the instructions of court special C B I of Lucknow at present this alleged extremist of name. ","نRہا نا ہنC ےہ نRہنC نRنC ںا ہ ں د ہ روا ننRنCنR نC ںو","’ہاد ہد ‘ د ٹ نC ں منCو ل ٹنCاڈےنC نRر ۔ےہ نC ے نC ے داا نا ہنC نRنR ے ے رنR نC ںا سنR ا ۔ےہ د ٹ نC د ہد نCنR Secret service says that to these extremist is given training of 'terror [grdanh] àttacks in Pakistan and Bangladesh. General police Vikram Singh director of state told that these individuals have at least taken has assigned training of terrorism after across the border gone to one hundred fifty young men. Secret service says that to these extremist is given training of 'terror ہاد àttacks in Pakistan and Bangladesh. General police Vikram Singh director of state told that these individuals have at least taken has assigned training of terrorism after across the border gone to one hundred fifty young men.  Figure\\t4\\t\\tParallel\\tText\\tin\\tSprea\\bsheet\\tFormat\\t \\t \\t"]},{"title":"3343","paragraphs":[]}]}