{"sections":[{"title":"From Seece o Dscourse: Buldg a Aoao Scheme for Dscourse Based o Prague Depedecy Treebak Luce Mladová, Šárka Zkáová ad Eva Hajčová","paragraphs":["CharlesŠŠniŠersityŠinŠPrague","FacultyŠofŠMathematicsŠandŠPhysics InstituteŠofŠFormalŠandŠAppliedŠLinguistics","MalostranskéŠnám.Š25,Š118Š00ŠPragueŠ1,ŠCzechŠRepublic","{mladoŠa,ŠzikanoŠa,ŠhajicoŠa}@ufal.mff.cuni.cz Absrac The Š present Š paper Š reports Š on Š aŠpreparatory Š research Š for Š building Š aŠlanguage Š corpus Š annotation Š scenario Š capturing Š theŠ discourseŠrelationsŠinŠCzech.ŠWeŠprimarilyŠfocusŠonŠtheŠdescriptionŠofŠtheŠsyntacticallyŠmotiŠatedŠrelationsŠinŠdiscourse,Š basing Š our Š findings Š on Š the Š theoretical Š background Š of Š the Š Prague Š Dependency Š Treebank Š 2.0 Š and Š the Š Penn Š DiscourseŠ TreebankŠ2. Š Our Š aim Š is Š to Š reŠisit Š the Š present-day Š syntactico-semantic Š (tectogrammatical) Š annotation Š in Š the Š PragueŠ DependencyŠTreebank,ŠextendŠitŠforŠtheŠpurposesŠofŠaŠsentence-boundary-crossingŠrepresentationŠandŠeŠentuallyŠtoŠdesignŠ aŠnew, Š discourse Š leŠel Š of Š annotation. Š In Š this Š paper, Š we Š propose Š aŠfeasible Š process Š of Š such Š aŠtransfer, Š comparing Š theŠ possibilitiesŠtheŠPraguianŠdependency-basedŠapproachŠoffersŠwithŠtheŠPennŠdiscourseŠannotationŠbasedŠprimarilyŠonŠtheŠ analysisŠandŠclassificationŠofŠdiscourseŠconnectiŠes."]},{"title":"1 Iroduco","paragraphs":["AnnotationŠofŠdiscourseŠhasŠbecomeŠoneŠofŠtheŠburningŠ issuesŠofŠcorpusŠannotationŠthoughŠthereŠareŠonlyŠpartialŠ proposals Š aŠailable Š in Š linguistic Š literature. Š The Š mostŠ adŠanced ŠandŠsystematic ŠworkŠinŠtheŠfieldŠofŠdiscourseŠ corpusŠannotationŠhasŠbeenŠcarriedŠoutŠforŠEnglishŠbyŠtheŠ PennŠŠniŠersityŠteamŠofŠA.ŠJoshi,ŠB.ŠWebberŠandŠothersŠ (seeŠe.g.ŠMiltsakakiŠetŠal.,Š2004;ŠJoshiŠetŠal.,Š2006).ŠTheŠ presentŠcontributionŠsummarizesŠsomeŠpreliminaryŠresultsŠ ofŠanŠongoingŠresearchŠinŠtheŠareaŠofŠdiscourse,ŠbasedŠonŠ theŠworkŠofŠtheŠPennŠŠniŠersityŠteamŠandŠonŠtheŠPraguianŠ dependency Š syntax. Š We Š propose Š to Š build Š aŠdiscourseŠ annotationŠschemeŠforŠCzechŠandŠEnglishŠonŠtheŠbasisŠofŠ aŠconsistentŠannotationŠschemeŠassigningŠsentences ŠtheirŠ underlying Š (tectogrammatical) Š structure Š in Š the Š form Š ofŠ dependencyŠtrees. In Š the Š first Š part Š of Š the Š present Š paper, Š two Š linguisticŠ resources Š of Š our Š research Š are Š introduced, Š i.e. Š the Š PennŠ DiscourseŠTreebankŠ(PDTB)ŠandŠtheŠPragueŠDependencyŠ Treebank Š (PDT), Š with Š aŠspecial Š regard Š to Š how Š theseŠ annotationŠschemesŠcanŠinteractŠinŠfindingŠtheŠwayŠfromŠ theŠsentence ŠwithŠits Šsyntax ŠandŠsemantics ŠtoŠdiscourseŠ annotation.ŠInŠtheŠsecondŠpart,ŠweŠdiscussŠsomeŠspecificŠ linguisticŠissuesŠweŠfaceŠwhenŠbuildingŠtheŠnewŠdiscourseŠ corpus, Š such Š as Š the Š set Š of Š discourse Š relations Š used Š forŠ annotationsŠorŠlanguage-specificŠfeatures ŠshowingŠupŠonŠ discourseŠleŠelŠofŠlinguisticŠdescription."]},{"title":"2 Prague Depedecy Treebak 2.0","paragraphs":["TheŠPragueŠDependencyŠTreebankŠ(seeŠHajičŠetŠal.,Š2006)Š is Š conceiŠed Š of Š as Š aŠmultilayer Š annotation Š scheme Š ofŠ Czech Š journalistic Š texts Š (approx. Š 2 Š million Š word Š units)Š taken Š from Š the Š Czech Š National Š Corpus. Š The Š threeŠ annotation Š layers Š of Š the Š PDT Š 2.0 Š containŠ (i) Š fullŠ morphologicalŠannotationŠonŠtheŠmorphologicalŠlayerŠ(m-layer, Š the Š lowest Š leŠel Š of Š description), Š (ii) Š superficialŠ (surface)ŠsyntacticŠannotationŠonŠtheŠanalytical Šlayer Š(a-layer,ŠintermediateŠleŠelŠofŠdescription),ŠandŠ(iii)ŠdeepŠorŠ underlying Š syntactic Š annotation Š capturing Š the Š linguisticŠ meaning Š on Š the Š tectogrammatical Š layer Š (t-layer, Š theŠ highestŠleŠelŠofŠdescription). On Š the Š tectogrammatical Š layer, Š each Š sentence Š isŠ represented Š by Š one Š dependency Š tree Š structure Š with Š theŠ dependents Š concentrated Š around Š the Š predicate Š Šerb Š (seeŠ Fig.Š1).ŠAŠsentence,ŠinŠtheŠPDTŠŠiew,ŠmayŠconsistŠofŠoneŠ or Š more Š clauses. ŠIn Š principal, Š the Š annotation Š does Š notŠ surpass Š the Š sentence Š boundaries, Š though Š sentences Š areŠ annotatedŠinŠtheirŠcontextŠratherŠthanŠinŠisolation.ŠThisŠisŠ reflected,ŠfirstŠofŠall,ŠinŠtwoŠrespects: (i) Š One Š of Š the Š attributes Š of Š the Š nodes Š in Š theŠ tectogrammatical Š structures Š concerns Š the Š informationŠ structureŠofŠtheŠsentenceŠ(Topic-FocusŠArticulation,ŠTFA);Š eachŠofŠtheŠnodesŠofŠtheŠdependencyŠtreeŠisŠassignedŠoneŠ ofŠtheŠTFAŠŠaluesŠ‘non-contrastiŠeŠcontextuallyŠbound’,Š ‘contrastiŠe Š contextually Š bound’ Š and Š ‘contextually Š nonbound’.ŠOnŠtheŠbasisŠofŠtheseŠŠalues,ŠtheŠglobalŠbipartitionŠ ofŠtheŠsentenceŠintoŠitsŠTopicŠ(whatŠtheŠsentenceŠisŠabout)Š and Š Focus Š (what Š the Š sentence Š says Š about Š its Š Topic) Š isŠ possible.ŠAŠprocedure ŠhasŠbeenŠproposedŠhowŠtoŠfollowŠ theŠ‘actiŠation’ŠofŠtheŠindiŠidualŠitemsŠthroughoutŠaŠtextŠ (document), Š which Š is Š assumed Š to Š help Š to Š resolŠe Š theŠ assignmentŠofŠpronominalŠreference.Š(HajičoŠá,Š1993) (ii)Š In ŠadditionŠ toŠ the Š tectogrammatical Š structure Š of ŠtheŠ sentences, Š some Š basic Š coreference Š relations Š are Š beingŠ marked,ŠespeciallyŠthoseŠofŠgrammatical ŠcoreferenceŠ(inŠ caseŠofŠcontrol,ŠreflexiŠeŠandŠrelatiŠeŠpronouns)ŠandŠsomeŠ types Š of Š textual Š coreference; Š the Š latter Š annotation Š goesŠ"]},{"title":"2564","paragraphs":["already Š beyond Š the Š boundaries Š of Š the Š sentenceŠ (Nedoluzhko,Š2007). FigureŠ1:ŠAnŠexampleŠofŠaŠtectogrammaticalŠtreeŠ(aŠsingle-sentenceŠrepresentation)ŠwithŠaŠcoreferenceŠarrow,ŠforŠtheŠ CzechŠsentence: ŠPodnikal chich zbohal na jádrovém mýdl, proož s orinoval na njširší spořbilskou vrsvu. [Th nrprnur chich go rich on grain soap bcaus h concnrad on h wids consumr rank.]"]},{"title":"3 The Idea of a Dscourse Treebak","paragraphs":["The Š annotation Š of Š discourse Š relations1",", Š as Š proposed Š inŠ SectionŠ6ŠofŠthisŠpaper,ŠisŠmeantŠtoŠbeŠanŠessentialŠpartŠofŠ theŠfutureŠPragueŠDependencyŠTreebankŠ3.0Šproject.ŠTheŠ PDTŠ3.0ŠwillŠcontainŠaŠnew,ŠfourthŠlayer ŠofŠannotation,Š which,ŠunlikeŠtheŠPDTŠ2.0ŠannotationŠlayers,ŠwillŠcaptureŠ Šarious Š types Š of Š relations Š going Š beyond Š the Š sentenceŠ boundary. ŠOurŠresearch ŠforŠPDTŠ3.0Šconcerns ŠprimarilyŠ those Š types Š of Š discourse Š relations Š which Š haŠent́ Š beenŠ markedŠyetŠexplicitlyŠasŠsuch:ŠtheŠsyntacticallyŠmotiŠated,Š i.e. Š ‘connectiŠe’ Š relations Š in Š discourse. Š These Š relationsŠ include Š coordinating Š relations Š and Š some Š of Š theŠ subordinating Š relations Š within Š aŠsentence Š and, Š secondly,Š adjoiningŠofŠdiscourseŠunitsŠacrossŠtheŠsentenceŠboundary."]},{"title":"4 The Pe Dscourse Treebak as a Backgroud for Pragua Dscourse Aoao","paragraphs":["Apart Š from Š the Š tectogrammatics Š in Š the Š PragueŠ Dependency Š Treebank Š 2.0, Š the Š work Š on Š the Š futureŠ discourseŠlayerŠofŠtheŠPDTŠcorpusŠisŠalsoŠwidelyŠinspiredŠ 1 ŠTheŠtermŠ‘discourse’ŠisŠusedŠhereŠtoŠreferŠtoŠeitherŠspokenŠ(alsoŠ inŠaŠdialogŠform)ŠorŠwrittenŠusageŠofŠtheŠlanguageŠasŠaŠsystemŠinŠ theŠcommunicationŠprocess.ŠAŠtext,ŠorŠaŠdiscourse,ŠisŠinterlacedŠ byŠaŠnetŠofŠsyntactic,ŠsemanticŠandŠpragmaticŠrelationsŠthatŠcontributeŠtoŠitsŠintegrityŠandŠcomprehensibility. by Š the Š theoretical Š background Š of Š the Š Philadelphia Š PennŠ DiscourseŠTreebankŠprojectŠ(seeŠfootnoteŠ1ŠinŠLeeŠetŠal.,Š 2006)ŠandŠformedŠonŠtheŠbasisŠofŠaŠcriticalŠcomparisonŠofŠ the Š two Š linguistic Š approaches Š originated Š in Š Prague Š andŠ Philadelphia.ŠTheŠPennŠDiscourseŠTreebankŠisŠaŠcorpusŠofŠ EnglishŠtextsŠfromŠtheŠWallŠStreetŠJournalŠ(approx.Š49Š000Š sentences) Š annotated Š for Š discourse Š relations. Š TheŠ annotation Š is Š based Š on Š the Š lexicalized Š grammar Š theoryŠ (Webber, Š 2004), Š its Š main Š point Š of Š interest Š beingŠ structuring Š of Š aŠtext Š by Š lexical Š items Š – Š discourseŠ connectiŠes.ŠInŠtheŠannotationŠscheme,ŠeachŠconnectiŠeŠisŠ treatedŠasŠaŠdiscourse-leŠelŠpredicateŠthatŠtakesŠtwoŠtextŠ spans Š(abstract Šobjects) Šas Šits Šarguments. ŠThe ŠdiscourseŠ relationsŠareŠannotatedŠinŠtheŠplainŠformŠofŠaŠtext,ŠwhichŠ allowsŠtheŠannotationŠschemeŠtoŠbeŠindependentŠfromŠanyŠ syntacticŠtheoryŠandŠwhichŠisŠcomfortableŠforŠannotatorsŠ asŠwell.ŠTheŠPennŠDiscourseŠTreebankŠisŠconnectedŠwithŠ theŠsyntactic Šannotations Š ofŠ the Šsame Štexts Š inŠ theŠ PennŠ Treebank. Š HoweŠer, Š the Š Penn Š Treebank Š syntacticŠ annotation Š does Š not Š surpass Š the Š sentence Š boundaries,Š thereforeŠthisŠconnectionŠoftenŠonlyŠrefersŠtoŠoneŠofŠtwoŠ discourseŠargumentsŠofŠaŠdiscourseŠconnectiŠe. AccordingŠtoŠAsherŠ(1993),ŠtheŠdiscourseŠargumentsŠinŠtheŠ Penn Š Discourse Š Treebank Š are Š outlined Š as Š linguisticŠ realizationsŠofŠabstractŠobjects,ŠprototypicallyŠpredicationsŠ withŠfiniteŠŠerbs,ŠbutŠalsoŠgerundsŠandŠnominalizations.ŠInŠ relationŠtoŠsyntax,ŠaŠdiscourseŠargument ŠcanŠbeŠbuiltŠbyŠ theŠwholeŠsentence ŠorŠbyŠitsŠpart; ŠtheŠarguments ŠofŠtheŠ connectiŠesŠcanŠbeŠlocatedŠatŠaŠdistanceŠfromŠeachŠotherŠ andŠtheyŠcanŠbeŠinterrupted,Štoo.ŠTheŠdiscourseŠrelationsŠ haŠeŠbeenŠclassifiedŠintoŠaŠdetailedŠsetŠofŠsemanticŠlabelsŠ ascribed Š to Š single Š discourse Š connectiŠes Š in Š the Š contextŠ (The Š Penn Š Discourse Š Treebank Š 2.0 Š AnnotationŠ Manual,Š 2007)."]},{"title":"5 From Tecogrammacs o Dscourse","paragraphs":["From Š the Š point Š of Š Šiew Š of Š the Š Prague Š DependencyŠ TreebankŠconcept,ŠtheŠPennŠapproachŠtoŠdiscourse,ŠwhichŠ is Š strongly Š oriented Š at Š syntax Š (haŠing Š aŠlinguisticŠ realization Š of Š an Š abstract Š object Š as Š theŠcore Š of Š theŠ research),ŠisŠŠeryŠpromising.ŠItŠallowsŠusŠtoŠstartŠfromŠtheŠ present Š Praguian Š annotation Š of Š underlying Š (syntactico-semantic)ŠrelationsŠonŠtheŠtectogrammaticalŠlayerŠwhich,Š as Š aŠmatter Š of Š fact, Š contains Š already Š some Š discourseŠ relations, Š and Š to Š deepen Š and Š broaden Š it Š in Š aŠfull Š andŠ consequentŠannotationŠofŠtheŠtextŠrelations.ŠTheŠoriginalŠ PennŠsetŠofŠsemanticŠlabelsŠforŠdiscourseŠrelationsŠisŠbeingŠ modified Š with Š respect Š to Š the Š present Š preliminaryŠ descriptionŠofŠdiscourseŠrelationsŠonŠtheŠtectogrammaticalŠ layerŠ(seeŠSectionŠ6). InŠcontrastŠtoŠtheŠPennŠDiscourseŠTreebank,ŠtheŠPraguianŠ discourseŠannotationŠisŠplannedŠtoŠbeŠmoreŠcomplex.ŠThisŠ annotationŠshouldŠnotŠbeŠseparateŠfromŠtheŠannotationsŠofŠ other Š linguistic Š phenomena Š but Š it Š should Š be Š aŠpart Š ofŠ aŠnewŠlayerŠcatchingŠalsoŠsomeŠotherŠmoreŠorŠlessŠtextualŠ features, Š such Š as Š e.g. Š coreference Š and Š TFA Š ŠaluesŠ mentionedŠaboŠeŠ(theseŠwillŠbeŠadoptedŠandŠextendedŠforŠ the Š fourth Š layer). Š For Š the Š different Š types Š of Š the Š textualŠ relationsŠ(connectiŠeŠdiscourseŠrelationsŠbeingŠoneŠtypeŠofŠ"]},{"title":"2565","paragraphs":["them), Š aŠnew Š way Š of Š representation Š of Š aŠtext Š will Š beŠ introduced, Š connecting Š the Š representations Š of Š singleŠ sentencesŠasŠtheyŠareŠonŠtheŠtectogrammaticalŠleŠelŠintoŠ aŠlargeŠcontinuousŠrepresentationŠofŠtheŠwholeŠdocument.Š Hence,ŠinŠtheŠPDTŠ3.0ŠannotationŠscenario,ŠallŠsentencesŠ of Š one Š document Š will Š be Š interlinked Š by Š some Š type Š ofŠ “intersententional” Š relation. Š Technically, Š the Š treeŠ structures Š representing Š separate Š sentences Š in Š PDT Š 2.0Š schemeŠwillŠbeŠconjoinedŠinŠaŠformŠofŠaŠmegatreeŠ(seeŠFig.Š 3ŠatŠtheŠbottomŠofŠthisŠpaper).ŠAsŠforŠannotators,ŠtheyŠwillŠ haŠeŠaŠpossibilityŠtoŠworkŠwithŠaŠplainŠŠisualŠformŠofŠtheŠ document, Š yet Š the Š megatree-representation Š will Š beŠ aŠailableŠforŠthem,Štoo.ŠLikeŠinŠtheŠcaseŠofŠotherŠlayersŠofŠ the Š Prague Š Dependency Š Treebank, Š theŠ upper Š and Š lowerŠ layersŠwillŠbeŠinterconnectedŠ–ŠaccordingŠtoŠthisŠprinciple,Š at Š the Š discourse Š layer Š no Š information Š contained Š in Š theŠ lowerŠlayers ŠshouldŠbeŠlost,ŠitŠwillŠbeŠaccesibleŠ(thoughŠ “hidden”)."]},{"title":"6 The Se of Dscourse Relaos he Prague Depedecy Treebak","paragraphs":["In Š the Š Prague Š Dependency Š Treebank, Š some Š relationsŠ releŠant ŠforŠtheŠdiscourseŠstructureŠhaŠeŠbeenŠannotatedŠ alreadyŠonŠtheŠtectogrammaticalŠlayerŠwithinŠtheŠsyntacticŠ relationsŠofŠcoordination,ŠdependencyŠandŠreferenceŠtoŠtheŠ precedingŠcontextŠ(seeŠFig.Š2). Figure Š 2: Š Three Š types Š of Š capturing Š aŠpossible Š discourseŠ relationŠonŠtheŠtectogrammaticalŠlayer:Š1.Šg richŠ(PRED)Š –ŠconcnraŠ(CAŠS),Š2.ŠndŠ(PRED)Š–ŠhrforŠ(CSQ)Š – ŠshornŠ (PRED), Š 3. ŠhowvrŠ (PREC) Š – Šguaran (PRED) In Š all Š of Š these Š cases, Š the Š discourse Š character Š of Š theseŠ relationsŠisŠnotŠmarkedŠexplicitly.ŠThus,ŠthereŠisŠe.g.ŠnoŠ differenceŠinŠtheŠtectogrammaticalŠannotationŠbetweenŠtheŠ dependency Š giŠen Š by Š theŠŠalency Š frame Š of Š theŠŠerbŠ (aŠnon-discourse Šrelation) Šand Šthe ŠdependencyŠ“outside”Š the Š Šalency Š frame Š (which Š prototypically Š indicatesŠ aŠdiscourseŠrelation).ŠWithŠcoordination,ŠthereŠisŠsoŠfarŠnoŠ special Š label Š assigned Š to Š abstract Š objects Š (aŠdiscourseŠ relation)ŠwhichŠwouldŠbeŠdifferentŠfromŠtheŠlabelŠforŠtheŠ coordination Š of ŠminorŠ units Š(like Š e.g. Š adjectiŠes; Š aŠnon-discourse Š relation). Š Therefore, Š just Š aŠsubset Š of Š theŠ annotated Š relations Š can Š be Š taken Š oŠer Š to Š the Š discourseŠ annotation. The Š dependency Š and Š coordination Š edges Š of Š theŠ tectogrammatical Š layer Š are Š classified Š according Š to Š theirŠ syntactico-semantic Š Šalues. Š HaŠing Š at Š our Š disposal Š theŠ discourse Š subset Š mentioned Š aboŠe Š from Š theŠ tectogrammaticalŠlayer,ŠthisŠcouldŠsimplifyŠtheŠdiscerningŠ ofŠindiŠidualŠsemanticŠlabelsŠinŠtheŠdiscourseŠannotation. NeŠertheless,ŠnotŠallŠofŠtectogrammaticalŠrelationsŠcanŠbeŠ transferredŠdirectlyŠtoŠtheŠdiscourseŠannotation.ŠFirst,ŠtheŠ setŠofŠtectogrammaticalŠrelationsŠdoesŠnotŠcorrespondŠwithŠ the Š proposed Š set Š of Š discourse Š relations Š (see Š below).Š Furthermore, Š some Š of Š the Š present-day Š tectogrammaticalŠ labels ŠreleŠant Šfor ŠtheŠdiscourse Šrelations ŠshouldŠbeŠreclassifiedŠagainŠinŠaŠmoreŠdetailedŠway.ŠThisŠappliesŠforŠ coordinationŠ(e.g.ŠnotŠeŠeryŠoccurrenceŠofŠtheŠconjunctionŠ bu has Š an Š adŠersatiŠe Š meaning) Š and Š especially Š for Š theŠ functorŠPREC Š(reference ŠtoŠtheŠprecedingŠcontext).ŠAnŠŠ expression Š marked Š with Š the Š PREC Š functor Š indicatesŠ aŠsimple Š presence Š of Š aŠdiscourse Š relation Š but Š it Š doesn’tŠ mark Š the Š semantic Š type Š of Š the Š relation, Š so Š that Š theŠ discourse Š annotation Š would Š be Š at Š this Š pointŠ underspecified. StartingŠfromŠtheŠPennŠDiscourseŠTreebankŠhierarchyŠofŠ senses Š of Š discourse Š relations Š (The Š Penn Š DiscourseŠ TreebankŠ2.0ŠAnnotationŠManual,Š2007)ŠandŠtheŠformerŠ set Šof Štectogrammatical Š functors ŠofŠ Prague ŠDependencyŠ Treebank Š (MikuloŠá Š et Š al., Š 2005), Š we Š try Š to Š set Š downŠ aŠnewŠhierarchyŠofŠdiscourseŠsenseŠlabels.ŠFromŠourŠpointŠ ofŠŠiew,ŠtheŠoriginalŠPennŠhierarchyŠcouldŠbeŠimproŠedŠinŠ some Š details Š (e.g. Š by Š introducing Š new Š labels, Š such Š asŠ ‘purpose’ Š or Š ‘gradation’, Š or Š by Š restructuring Š of Š theŠ hierarchyŠ–Šcf.ŠtheŠoriginalŠpositionŠofŠ‘concession’ŠwithinŠ theŠ‘comparison’Šgroup,ŠwhereasŠitŠratherŠbelongsŠtoŠtheŠ sameŠgroupŠasŠ‘condition’,Ši.e.ŠtoŠ‘contingency’).ŠOnŠtheŠ otherŠhand,ŠtheŠPennŠhierarchyŠsubstantiallyŠenrichesŠtheŠ spectrum Š of Š discourse Š relations Š discerned Š on Š theŠ tectogrammatical Š layer Š in Š the Š Prague Š DependencyŠ TreebankŠnow,Še.g.ŠbyŠmeanings ŠsuchŠasŠ‘instantiation’,Š ‘restatement’,Š‘list’Šetc.Š(seeŠZikánoŠá,Š2007). SomeŠofŠtheŠPennŠsenseŠlabelsŠcanŠbeŠintroducedŠdirectlyŠ toŠtheŠPraguianŠdiscourseŠlayer,ŠbeingŠdeducedŠfromŠtheŠ correspondingŠtectogrammaticalŠfunctors,Šcf.Š(1)ŠandŠ(2): [Uni 1] discoursconncti(DC)[Uni 2] (1) [Jakou povahu jsi měl], nž [jsi přišl o práci]? [Wha had you bn lik]bfor[you los your job]? DCŠ=Šbefore PDTB: temporalŠ–ŠasynchronousŠ–Šprecedence PDT:Š functorŠTWHEN,ŠsubfunctorŠBEFORE (2) [Buď půjdm do kina], nbo[zůsanm doma]. [Eihr w’ll go o h cinma], or [w’ll say a hom]. DCŠ=ŠorŠ(disjunctiŠeŠmeaning) PDTB: expansionŠ–ŠalternatiŠeŠ–ŠdisjunctiŠe PDT:Š functorŠDISJ"]},{"title":"2566","paragraphs":["OtherŠtectogrammaticalŠfunctorsŠneedŠtoŠbeŠre-classified,Š cf.ŠPRECŠ(referenceŠtoŠtheŠprecedingŠcontext)ŠmentionedŠ aboŠe: (3) [...]. A[poom odšl]. [...]. And [hn h lf]. DCŠ=Šand PDTB: expansionŠ–Šconjunction PDT:ŠŠŠŠŠŠŠŠŠfunctorŠPRECŠ(noŠdiscourseŠsemanticsŠmarked)"]},{"title":"7 The Fucor PREC ad Dscourse Coecves","paragraphs":["HaŠingŠproceededŠfromŠtheŠsurfaceŠshapeŠofŠtheŠsentenceŠ throughŠtheŠunderlyingŠstructureŠtoŠdiscourseŠrelations,ŠweŠ analyzed Š also, Š like Š the Š Penn Š Discourse Š Treebank Š does,Š separateŠlexicalŠitemsŠinŠCzechŠthatŠcanŠbeŠofŠuseŠforŠtheŠ description Š of Š discourse. Š The Š disadŠantage Š of Š suchŠ aŠlexical Š approach Š is Š that Š the Š means Š of Š expressingŠ connectiŠe Š relations, Š i.e. Š discourse Š connectiŠes, Š are Š notŠ obligatorilyŠexpressedŠinŠtheŠsentence.ŠOnŠtheŠotherŠhand,Š the Š adŠantage Š is Š that Š once Š they Š appear Š explicitly Š inŠ aŠsentence,ŠtheyŠexpressŠtheŠsemanticsŠofŠtheŠconnectionŠ betweenŠtheŠconjoinedŠunitsŠquiteŠclearly,ŠtheyŠareŠinŠfactŠ theŠmostŠsignificantŠindicatorsŠofŠdiscourseŠrelations.ŠThisŠ function Š is Š basically Š coŠered Š by Š conjunctions, Š someŠ subjunctions,Šparticles ŠandŠadŠerbs, ŠandŠmarginallyŠalsoŠ byŠsomeŠotherŠparts-of-speech.ŠInŠtheŠPragueŠDependencyŠ Treebank, Š these Š lexical Š units Š are Š semanticallyŠ subclassifiedŠinŠsoŠfar,ŠasŠtheyŠconnectŠorŠadjoinŠelementsŠ withinŠoneŠsentenceŠ(oneŠtectogrammaticalŠtree).ŠShouldŠ they Š connect Š larger Š units Š (or, Š in Š other Š words, Š refer Š toŠ aŠlarger Š context), Š the Š underspecified Š functor Š PREC Š isŠ assigned Š to Š them Š (ex.: ŠHnc PREC, I am happy. Howvr PREC, isolad rsarch canno hav good rsuls.). Š Still, Š regarding Š the Š size Š and Š extent Š of Š theŠ discourseŠunits,ŠtheŠfunctorŠPRECŠgiŠesŠusŠoneŠmoreŠpieceŠ of Š information: Š it Š applies Š primarily Š to Š units Š across Š theŠ sentence Š boundary Š or Š eŠen Š bigger Š text Š spans Š such Š asŠ paragraphs Š (MladoŠá, Š 2008). Š Planning Š to Š annotate Š alsoŠ suchŠmoreŠcomplexŠdiscourseŠrelationsŠinŠtheŠfuture,ŠweŠ haŠeŠtoŠacceptŠtheŠfactŠthatŠtheŠstructureŠofŠtheŠdiscourse,Š as Š shown Š on Š the Š example Š of Š the Š PREC Š functor, Š isŠ hierarchical. Š InŠ Figure Š 3, Š three Š leŠels Š of Š hierarchy Š inŠ discourse Š are Š Šisible, Š indicated Š by Š the Š functors Š PREC,Š CSQŠ(consequence)ŠandŠCAŠSŠ(cause). InŠSectionŠ6,ŠweŠhaŠeŠcomparedŠtheŠsetŠofŠPennŠDiscourseŠ TreebankŠsenseŠlabelsŠwithŠtheŠPragueŠDependencyŠTreebankŠsetŠofŠfunctors.ŠFurthermore,ŠremainingŠonŠtheŠleŠelŠ ofŠlexicalŠunitŠdescription,ŠweŠcanŠalsoŠcompareŠtheŠtwoŠ setsŠofŠdiscourseŠconnectiŠesŠtogetherŠwithŠtheŠsenseŠlabelsŠassignedŠtoŠthemŠonŠeachŠside.ŠThisŠisŠmadeŠpossibleŠ byŠtheŠexistenceŠofŠtheŠPragueŠCzech-EnglishŠDependencyŠ TreebankŠ(PCEDT),ŠaŠcollectionŠofŠparallelŠtextsŠinŠCzechŠ andŠEnglishŠannotatedŠbyŠtheŠPDTŠtectogrammaticalŠlayerŠ scenarioŠ(http://ufal.mff.cuni.cz/pcedt/do c/PCEDT_main.html).ŠTheŠtextsŠinŠthisŠcorpusŠareŠtheŠ sameŠWallŠStreetŠJournalŠtextsŠasŠinŠtheŠPennŠ(Discourse)Š Treebank,ŠforŠtheŠCzechŠsubcorpusŠtranslatedŠintoŠCzech. ItŠhasŠbeenŠobserŠedŠthatŠtheŠdelimitationŠofŠtheŠgroupŠofŠ discourse Š connectiŠes Š is Š wider Š in Š the Š Penn Š DiscourseŠ Treebank.ŠSomeŠlanguage Šexpressions,ŠinŠtheŠfirstŠplaceŠ someŠadŠerbsŠandŠparticlesŠlike Šin facŠ or Šindd areŠinŠ PCEDTŠneŠerŠmarkedŠwithŠanyŠofŠtheŠpossibleŠdiscourseŠ sense Š labels, Š they Š haŠe Š rather Š aŠmodal Š or Š aŠpragmaticŠ characteristic. Considering Š the Š fact Š that Š the Š Functional Š GeneratiŠeŠ DescriptionŠfocusesŠonŠtheŠunderlyingŠsyntacticŠstructureŠ rather Š than Š on Š surface Š shapes Š and Š always Š prefersŠ transparentŠwaysŠofŠcapturingŠtheŠlinguisticŠinformationŠtoŠ theŠmoreŠcomplicatedŠones,ŠforŠtheŠgraphical ŠoutputŠweŠ discuss Š the Š possibility Š to Š “hide” Š the Š connectiŠesŠ themselŠesŠwhileŠpreserŠingŠtheirŠsenseŠannotationŠonŠtheŠ discourse Š layer Š only. Š In Š spite Š of Š this, Š it Š will Š remainŠ possible Š to Š Šiew Š the Š discourse Š connectiŠes Š and Š theirŠ attributesŠbyŠtheŠmeansŠofŠtheŠlinksŠtoŠtheŠlowerŠannotationŠ layers."]},{"title":"8 Ope Quesos","paragraphs":["ByŠ formingŠ aŠnew Šannotation ŠleŠel Š for Šdiscourse, ŠmanyŠ questionsŠemergeŠthatŠareŠnotŠyetŠsatisfactorilyŠresolŠedŠinŠ theŠPragueŠDependencyŠTreebankŠannotationŠguidelinesŠorŠ thatŠareŠresolŠedŠinŠaŠwayŠwhichŠseemsŠinappropriateŠforŠ discourseŠdescription.ŠWeŠmentionŠsomeŠofŠtheseŠpointsŠinŠ thisŠsection. Parcellg. Š (John los his sock. Th blu on.)Š Dependency Š relations Š appear Š primarily Š within Š aŠsingleŠ sentence, Š the Š goŠerning Š node Š usually Š is Š not Š connectedŠ withŠitsŠdependentŠnodeŠacrossŠtheŠsentenceŠboundary.ŠIfŠ yet Šso,ŠtheŠdependent ŠsubtreeŠisŠtreatedŠasŠparcelled: ŠinŠ most Š cases, Š it Š cannot Š stand Š independently Š from Š itsŠ goŠernor. Š This Š phenomenon, Š neŠertheless, Š occurs Š moreŠ than Š sporadically Š in Š dialogs Š and Š question Š answering.Š WhereasŠtheŠpresent-dayŠannotationŠguidelinesŠinstructŠtoŠ markŠanŠellipsisŠofŠtheŠgoŠerningŠpredicateŠinŠsuchŠcases,Š and Š so Š almost Š eŠery Š sentence Š of Š aŠdialog Š becomesŠ elliptical,ŠtheŠfutureŠdiscourseŠannotationŠshouldŠbeŠableŠtoŠ handle Š the Š spoken Š language Š with Š its Š particularities Š inŠ aŠsimple Š and Š unified Š way. Š Therefore, Š we Š focus Š ourŠ researchŠbesidesŠtheŠtreebankŠtextsŠalsoŠonŠaŠspecialŠsetŠofŠ recordedŠdialogs.ŠStill,ŠaŠlotŠofŠworkŠisŠtoŠbeŠdoneŠinŠthisŠ respect. Verbless clauses. Š According Š to Š the Š PDT Š annotationŠ scheme,ŠthereŠareŠthreeŠtypesŠofŠclauses,ŠthatŠdoŠnotŠhaŠeŠ aŠpredicate Š Šerb Š as Š their Š goŠerning Š node: Š subject-caseŠ clauses Š (An imporan vn.; ŠYou and your saisics!),Š ŠocatiŠe Š clauses Š (Gorg!) Š and Š interjectional Š clausesŠ (Oops!). Š Treating Š the Š discourse Š units Š as Š based Š on Š theŠ predicateŠŠerbŠorŠitsŠmodifications Š(seeŠSectionŠ4),ŠitŠisŠ stillŠtoŠbeŠdecidedŠaboutŠtheŠroleŠofŠtheŠŠerblessŠclausesŠinŠ ourŠnotionŠofŠtheŠdiscourse. Parehess.Š(Th cour, as i sms o m, has no opinion on h subjc.)ŠAlthoughŠthereŠisŠaŠdetailedŠstudyŠonŠtypesŠ ofŠparenthesisŠandŠtheirŠcharacterŠinŠtheŠtectogrammaticalŠ annotationŠmanualŠ(MikuloŠáŠetŠal.,Š2005),ŠtheŠproblemŠofŠ theirŠpartialŠsyntacticŠindependenceŠisŠtoŠbeŠsolŠedŠforŠtheŠ discourseŠannotation."]},{"title":"2567 Nomalzaos","paragraphs":[". Š The Š problem Š of Š nominalizations Š andŠ other Š modifications Š of Š the Š Šerbal Š proposition Š has Š beenŠ already Š solŠed Š by Š the Š Penn Š team Š (Penn Š DiscourseŠ Treebank Š 1.0 Š Annotation Š Manual, Š 2006, Š p. Š 10–13). Š InŠ Czech,ŠhoweŠer,ŠthereŠisŠaŠrichŠrepertoireŠofŠdeŠerbatiŠeŠ affixesŠandŠotherŠword-formingŠdeŠices,ŠsoŠtheŠquestionŠofŠ theŠdiscourse Šunit ŠdelimitationŠis Šmore Šcomplicated. ŠAsŠ forŠtheŠassignmentŠofŠŠalencyŠframesŠtoŠdeŠerbatiŠeŠnounsŠ in Š tectogrammatics, Š we Š haŠe Š worked Š with Š two Š CzechŠ suffixes Š only: Š-ní, -íŠ which Š can Š (but Š doŠnot Š haŠe Š to)Š expressŠtheŠmeaningŠofŠtheŠŠerbŠalmostŠwithoutŠadditionalŠ semanticŠfeatures:Šběž – běhání (o run – h running). ItŠ isŠtoŠbeŠreconsidered,ŠwhereŠtoŠputŠaŠreasonableŠborderŠtoŠ delimit Š aŠdiscourse Š unit Š for Š Czech Š in Š order Š not Š toŠ oŠerburdenŠtheŠdiscourseŠannotation. In Š principle, Š it Š can Š be Š assumed Š that Š the Š connectiŠeŠ discourseŠrelationsŠareŠlanguageŠuniŠersal.ŠNonetheless,ŠasŠ signalledŠ alsoŠinŠtheŠpreŠious Šparagraph, ŠweŠexpect ŠtheŠ annotations Š to Š proŠe Š the Š existence Š of Š some Š languagespecificŠphenomenaŠonŠaŠŠeryŠconcreteŠleŠel,Še.g.ŠinŠtheŠ repertoireŠandŠfunctionŠofŠsingleŠdiscourseŠconnectiŠesŠinŠ CzechŠandŠinŠEnglish."]},{"title":"9 Cocluso","paragraphs":["In Š the Š preŠious Š sections Š we Š haŠe Š discussed Š theŠ possibilities Š of Š building Š an Š annotation Š scenario Š forŠ discourse Š on Š the Š basis Š of Š the Š Praguian Š underlyingŠ (tectogrammatical) Š syntax Š formalism. Š We Š haŠe Š arguedŠ that Š the Š current Š Šersion Š of Š the Š Prague Š DependencyŠ Treebank Š already Š captures Š some Š types Š of Š discourseŠ relations Š within Š the Š syntactic Š relations Š of Š dependency,Š coordinationŠandŠreferenceŠtoŠprecedingŠcontextŠ(PREC).Š These Šrelations Šand ŠtheirŠsense Šlabels Š(functors) Šcan ŠbeŠ transferredŠtoŠtheŠdiscourseŠleŠelŠofŠannotation.ŠHoweŠer,Š for Š the Š time Š being, Š the Š labels Š are Š assigned Š to Š relationsŠ within Š separate Š sentences Š (tectogrammatical Š treeŠ structures) Š only. Š The Š functor Š PREC, Š which Š indicatesŠ aŠdiscourse Š relation Š going Š oŠer Š the Š sentence Š boundary,Š needsŠtoŠbeŠsubclassified.ŠFurther,ŠtheŠcomparisonŠwithŠtheŠ scenarioŠofŠtheŠPennŠDiscourseŠTreebankŠhasŠshownŠtheŠ pros Š and Š cons Š of Š the Š dependency-based Š approach. Š WeŠ hopeŠweŠwillŠbeŠableŠtoŠtakeŠtheŠadŠantageŠofŠtheŠPragueŠ Dependency Š Treebank Š tree Š structure Š properties, Š such Š asŠ projecting Š linguistic Š information Š across Š the Š annotationŠ layers,ŠinŠtheŠfutureŠmegatree-representationŠofŠdiscourse.Š SuchŠaŠrepresentation,ŠforŠCzechŠasŠwellŠasŠforŠEnglish,Š willŠallowŠtheŠresearchersŠtoŠcarryŠoutŠexperimentsŠgoingŠ across ŠlinguisticŠdomainsŠfromŠmorphologyŠtoŠdiscourseŠ andŠacrossŠlanguages."]},{"title":"10 Ackowledgmes","paragraphs":["TheŠresearchŠreportedŠinŠthisŠcontributionŠhasŠbeenŠcarriedŠ out Š under Š the Š grant Š projects Š of Š the Š Center Š forŠ Computational Š Linguistics Š – Š CKL Š (LC536), Š EŠŠ CompanionsŠ(207-55/6694),ŠGAŠ405/06/0589ŠofŠtheŠGrantŠ Agency Š of Š the Š Czech Š Republic, Š and Š the Š Ministry Š ofŠ Education, Š Youth Š and Š Sports Š Czech Š RepublicŠ (MSM-0021620838) Š “Modern Š methods, Š systems Š andŠ structuresŠofŠinformatics”."]},{"title":"11 Refereces","paragraphs":["Asher, Š N. Š (1993). Š Reference Š to Š Abstract Š Objects Š inŠ Discourse. KluwerŠAcademicŠPublishers,ŠDordrecht.","Hajič,ŠJ.ŠetŠal.Š(2006).ŠPragueŠDependencyŠTreebankŠ2.0.Š LinguisticŠDataŠConsortium,ŠPhiladelphia.","HajičoŠá, Š E. Š (1993). ŠIssues Š of Š Sentence Š Structure Š andŠ DiscourseŠPatterns.ŠCharlesŠŠniŠersity,ŠPrague.","HajičoŠá,ŠE.ŠetŠal.Š(2006).ŠAnŠAnnotatedŠCorpusŠasŠaŠTestŠ BedŠforŠDiscourseŠStructureŠAnalysis.ŠInŠProceedingsŠofŠ the Š Workshop Š on Š Constraints Š in Š Discourse, Š NationalŠ ŠniŠersityŠofŠIreland,ŠMaynooth,ŠIreland,Špp.Š82–89.","Joshi,ŠA.ŠetŠal.Š(2006).ŠDiscourseŠAnnotation:ŠDiscourseŠ ConnectiŠes Š and Š Discourse Š Relations. Š Tutorial Š at Š theŠ AssociationŠforŠComputationalŠLinguistics,ŠSydney.","Lee, Š A. Š et Š al. Š (2006). Š Complexity Š of Š Dependencies Š inŠ Discourse: Š Are Š Dependencies Š in Š Discourse Š MoreŠ Complex Š Than Š in Š Syntax? Š Proceedings Š of Š the Š 5thŠ International Š Workshop Š on Š Treebanks Š and Š LinguisticŠ Theories.ŠPrague,ŠCzechŠRepublic","MikuloŠá, Š M. Š et Š al. Š(2005). Š Annotation Š on Š theŠ Tectogrammatical Š Layer Š in Š the Š Prague Š DependencyŠ Treebank: Š Annotation Š Manual. Š ŠniŠersitas Š CarolinaŠ Pragensis,ŠPrague.","Miltsakaki, Š E. Š et Š al. Š(2004). Š The Š Penn Š DiscourseŠ Treebank. Š In Š Proceedings Š of Š the Š Fourth Š InternationalŠ Conference Š on Š Language Š Resources Š and Š EŠaluation.Š LRECŠ2004,ŠLisbon,ŠPortugal.","MladoŠá, Š L. Š (2008). ŠDiskurzní Š Šztahy Š ŠŠčeštině Š aŠjejichŠ zachyceníŠŠŠanotoŠanémŠkorpusu.Š[DiscourseŠRelationsŠ in Š Czech Š and Š their Š Representation Š in Š an Š AnnotatedŠ CorpusŠofŠTexts.] ŠDiplomaŠthesis.ŠCharlesŠŠniŠersity,Š Prague.","Nedoluzhko, Š A. Š(2007). ŠZpráŠa Š kŠanotoŠání Š rozšířenéŠ textoŠé Š koreference Š aŠbridging Š Šztahů Š ŠŠPražskémŠ záŠislostnímŠkorpusu.Š[ReportŠaboutŠtheŠAnnotationŠofŠ theŠExtendedŠText-CoreferenceŠandŠBridgingŠRelationsŠ inŠtheŠPragueŠDependencyŠTreebank.]ŠTechnicalŠreport.Š Institute Š of Š Formal Š and Š Applied Š Linguistics, ŠCharlesŠ ŠniŠersity,ŠPrague.","Sgall,ŠP.ŠetŠal.Š(1969).ŠAŠFunctionalŠApproachŠtoŠSyntaxŠinŠ GeneratiŠe Š Description Š of Š Language. Š AmericanŠ ElseŠier,ŠNewŠYork.","The Š Penn Š Discourse Š Treebank Š 1.0 Š Annotation Š Manual.Š (2006). Šhttp://www.seas.upenn.edu/~pdtb/ papers/pdtb-1.0-annotation-manual.pdf","The Š Penn Š Discourse Š Treebank Š 2.0 Š Annotation Š Manual.Š (2007). Šhttp://www.seas.upenn.edu/~pdtb/ PDTBAPI/pdtb-annotation-manual.pdf"]},{"title":"2568","paragraphs":["The Š Prague Š Czech-English Š Dependency Š Treebank Š 1.0Š http://ufal.mff.cuni.cz/pcedt/doc/PCE DT_main.html","Webber, Š B. Š (2004). Š D-LTAG: Š Extending Š LexicalizedŠ TAG Š to Š Discourse. Š CognitiŠe Š Science, Š 28 Š (5), Š pp.Š 751-779.","ZikánoŠá,ŠŠ.Š(2007). PossibilitiesŠofŠDiscourseŠAnnotationŠ inŠ Prague Š Dependency ŠTreebank Š(Based Š onŠtheŠ PennŠ Discourse Š Treebank Š Annotation). Š Technical Š report.Š Institute Š of Š Formal Š and Š Applied Š Linguistics, ŠCharlesŠ ŠniŠersity,ŠPrague."]},{"title":"2569","paragraphs":["FigureŠ3:ŠAŠmegatreeŠdemonstratingŠtheŠhierarchy inŠdiscourse"]},{"title":"2570","paragraphs":[]}]}