{"sections":[{"title":"Le Programme Compalex (COMPAraison LEXicale) Josué Ndamba - Jean Silence Bayamboussa","paragraphs":["B.P. 1486 Brazzaville – Congo","GRELI – CONGO, Brazzaville jondamba@yahoo.fr"]},{"title":"1. Introduction","paragraphs":["Le programme que nous présentons ici est un logiciel de dialectométrie. La dialectométrie peut être définie comme l’ensemble de « tous les procédés et méthodes qui mesurent les distances linguistiques entre les langues et dialectes d’une région donnée, sur la base de phénomènes linguistiques appartenant à cette région » (Möhlig, 1980 :27). Les méthodes varient en détails en fonction des réalités rencontrées sur le terrain ; mais il reste un dénominateur commun : la nécessité de quantifier les distances linguistiques entre des parlers d’une zone géographique. L’utilisation des listes lexicales (lexicostatistique) présente un avantage certain, notamment pour les pays africains où le fractionnement dialectal est assez important et les moyens de la recherche plutôt rares. C’est que avec peu de moyens et en peu de temps, on peut collecter les données d’une large zone, les comparer et se faire une idée relativement juste des rapports entre les parlers. Contrairement à la comparaison phonologique ou grammaticale pour laquelle il faut des études monographiques plus difficiles à mener."]},{"title":"2. Les logiciels similaires","paragraphs":["Les logiciels de comparaison lexicale qui existent à ce","jour présentent chacun un certain nombre d'avantages sur","les autres et beaucoup de limites. Les plus connus sont: 1/ Lexistat de Thilo C. Schadeberg (Leiden) 2/ Word Survey de John S. Wimbish (Texas) 3/ Three Computer Programs de W. Möhlig (Köln)","Lexistat a deux principaux avantages sur les autres. Le premier c'est qu'il peut travailler à partir des jugements de ressemblance introduits par le linguiste; ou à partir d'une matrice de pourcentages de ressemblance calculée par une autre méthode. Le deuxième avantage c'est qu'il trace automatiquement le diagramme de proximité des langues ou des dialectes étudiés.","La principale limite de ce programme réside dans le fait que les jugements de ressemblance à émettre pour chaque paire d'items sont d'une simplicité extrême. La seule alternative c'est de dire qu'il y a ou qu'il n'y a pas ressemblance entre les deux formes comparées. Ceci signifie que pour le calcul des pourcentages de ressemblance entre les parlers comparés, on prend uniquement en compte la ressemblance ou la non ressemblance entre les formes de deux parlers; mais on ne tient pas du tout compte du degré de ressemblance entre les deux formes. A titre d'exemple, pour quatre langues L1, L2, L3 et L4 ayant les formes suivantes pour l'item \"bouche\":","L1: munwa","L2: monya","L3: onu","L4: kulu","la ressemblance entre L1 et L2 est comptabilisée de façon identique que celle entre L1 et L3 ou celle entre L2 et L3. En l'occurrence on dira qu'il s'agit de la même série de ressemblance qui sera notée par le même indice 1. L4 sera considéré comme une série distincte qui sera noté 2. Cette conception, répétée sur une centaine de mots nous amènera à la fin de l'analyse à considérer que les pourcentages de ressemblance entre L1/L2, L1/L3 et L2/L3 sont très proche (par exemple 85, 83 et 80%). Or, de toute évidence, il y a plus de ressemblance pour l'item \"bouche\" entre L1/L2 qu'entre L1/L3. Cet algorithme de comparaison développé par Carrol & Dyen (1962) basé sur les \"séries de ressemblance\" présente un intérêt certain pour un travail historique, du fait que la méthode comparative cherche à identifier les correspondances phonétiques régulières. Mais dans une perspective dialectométrique synchronique où l'on cherche à déterminer le degré de proximité entre les parlers d'une zone, il est tout à fait insuffisant.","Le programme Word Survey, écrit en langage C, présente de nombreux avantages sur le premier. En plus de l'analyse lexicostatistique de base, il fournit une analyse phonostatistique qui donne la mesure de la divergence phonétique entre les dialectes. En outre, il permet une analyse Compass (Comparativist's Assistant) qui mesure la solidité des correspondances phonétiques et donne une indication sur la probabilité avec laquelle les mots regroupés en séries de ressemblance sont réellement apparentés. Enfin, il donne la possibilité de sortir facilement aussi bien des listes lexicales vierges pour les enquêtes de terrain que les listes déjà saisies dans un format pratique pour les comptes-rendus ou les rapports d'enquêtes.","Mais en ce qui concerne l'analyse lexicostatistique, on retrouve ici la même limite que pour le programme précédent. Word Survey compare simplement les codes des séries de ressemblance pour totaliser ensuite combien de fois chaque paire d'une liste lexicale partage une série de ressemblance avec les autres. En outre, le programme ne trace pas automatiquement le diagramme de proximité entre les parlers en présence.","Le programme de W. Möhlig constitue une première réponse à cette limite. En donnant la préférence à ce qu'il appelle le procédé qualitatif par rapport au procédé quantitatif des méthodes précédentes, il ajoute des degrés entre la divergence totale (non ressemblance entre deux formes) et l'identité totale:","- divergence partielle morphologique","- divergence partielle phonologique","- divergence partielle accumulée (morphologique + phonologique)","et il attribue des valeurs constantes à ces degrés. Ces valeurs vont de 100% pour l'identité totale à 0% pour la divergence totale; en passant par 75% (divergence partielle morphologique), 50% (divergence partielle phonologique) et 25% (divergence partielle accumulée).","S'il est vrai qu'un algorithme fondé sur ce modèle de comparaison représente un progrès certain sur celui des deux premiers programmes, il reste qu'il ne permet pas une comparaison très fiable dans le cadre d'une mesure du degré d'intelligibilité entre les parlers d'une zone, dans une optique strictement synchronique. A titre d'exemple, si le deux formes de L1 et L2 d'un item présentent deux divergences partielles phonologiques, elles seront comptabilisées de façon identique que deux formes qui présentent deux divergences morphologiques ou deux autres qui présentent deux divergences phonologiques et deux morphologiques. Par ailleurs la hiérarchisation des degrés proposée peut paraître arbitraire. Il n'est pas évident qu'une différence de préfixe, de suffixe ou d'extension dans les langues bantoues par exemple, soit moins importante pour l’intercompréhension qu'une différence phonologique. D'autant plus que souvent, le préfixe varie du fait d'un changement phonologique: par exemple un \"lo\" dans L1 devient \"du\" dans L2.","Un autre inconvénient majeur de ce programme, c'est que, bien qu’écrit en langage Visual Basic, donc compilé, il exige la d’une part la saisie des données dans un éditeur de texte externe au programme ; d’autre part la création d’un fichier pour chaque mot à comparer et un autre pour les formules qui permettront l’évaluation , et enfin un troisième pour la liste des noms de langues. D’où un nombre impressionnant de fichiers à créer ; ce qui rend le programme d’un maniement très lourd. Enfin, un inconvénient majeur commun à tous ces programmes, c'est qu'ils donnent en fin d'analyse une matrice de pourcentages de ressemblances qui sont considérés par l'analyste comme des chiffres réels. Or toute mesure statistique implique la probabilité et la prédiction. Quand nous disons que deux langues sont apparentées à 75%, cela signifie en réalité que le pourcentage de ressemblance réel se trouve quelque part dans une fourchette définie par une distribution statistique, et tournant autour de 75%. Un pourcentage lexicostatistique doit donc être considéré comme l'estimation d'une marge. Et si chaque pourcentage de ressemblance indique une marge plutôt qu'une valeur discrète, les marges représentant deux pourcentages de ressemblance peuvent se chevaucher. Or si la valeur de ce chevauchement est assez grande, on ne peut plus dire avec certitude que les deux chiffres représentant les pourcentages, bien qu'étant différents, représentent nécessairement des degrés de relation différents. Il est donc absolument nécessaire, avant de tirer des conclusions à partir d'une matrice, de réduire tous les pourcentages qui y sont, aux différences significatives. Nombreux sont les linguistes qui se sont penchés sur les facteurs qui obligent à considérer les pourcentages lexicostatistiques comme l'estimation d'une marge plutôt qu'une valeur précise: G. Simons (1977), Dyen (1963), Thomas & Haley (1962), etc. Ce problème est bien connu des statisticiens qui ont élaboré plusieurs tests (dont le Chi2) pour mesurer la signification de la différence entre deux pourcentages.","En résumé, on peut dire que tous les programmes de comparaison lexicale qui existent présentent un certain nombre de lacunes, dont les principales sont les suivantes:","1/ Tous sont fondés sur un algorithme de comparaison ou trop simpliste, ou pas assez affiné.","2/ La plupart d'entre eux ne tracent pas de façon automatique le diagramme de proximité des arbres en présence.","3/ Ils fonctionnent tous dans l'environnement DOS qui est de plus en plus abandonné, au profit de WINDOWS.","4/ Ils ne tiennent aucun compte des marges d'erreur entre les pourcentages de ressemblances donnés dans la matrice finale."]},{"title":"3. Le Programme COMPALEX","paragraphs":["Le programme compalex s'appuie sur le modèle proposé par F. Manzano (Université de Rennes), qui s'inspire des travaux dialectométriques de Henri Guiter. L'idée de départ c'est d'identifier non seulement les séries de ressemblance entre les items des parlers pris deux à deux, mais en outre, de calculer pour chaque paire de mots où la ressemblance est postulée, le pourcentage de sons qui se ressemblent. La formule de calcul est C = (n * 100) / N, où C représente le pourcentage de sons (et éventuellement de tons) que chaque mot d'un parler a en commun avec le même mot d'un autre parler; N le nombre total de sons (et éventuellement de tons) que le même mot présente dans les deux parlers; et n le nombre de sons (et éventuellement de tons) qui sont identiques dans les formes des deux parlers.","La somme de ces pourcentages pour l'ensemble d'une paire de listes, divisée par leur nombre, donne le pourcentage de ressemblance moyen entre ces deux parlers. C'est ce que Manzano appelle le Coefficient de Proximité Linguistique (CPL) qui lie deux parlers: CPL = (C1+C2+C3+Cx) / x; où x représente le nombre d'items de la liste de comparaison. Toutes ces moyennes nous donnent la matrice des pourcentages de ressemblances des parlers en présence.","Cette matrice de pourcentages sera à son tour traité, pour être réduite aux seules différences significatives. Ceci, à partir d'une table pré définie, établissant un degré de fiabilité évaluée à partir d'une estimation de la fiabilité des données linguistique et de la longueur des listes utilisées. Cette table sera construite sur le modèle de celle que propose G. Simons (1977 : 75-107).","Une fois la matrice de pourcentages réduite à ses différences significatives, le programme calcule le Coefficient linguistique de chaque parler par rapport aux autres parlers auxquels il a été comparé (c'est-à-dire la somme des CPL de chaque parler divisée par le nombre de CPL). Ensuite, il calcule la Moyenne de Proximité Linguistique qui rend compte de la variation linguistique totale au niveau de tous les parlers en présence. La formule de calcul est la suivante:","n","M = 1/n ∑ x i","i = 1 M = MPL x i = CPL de la matrice n = nombre de x i","A partir du CL et de la MPL, le programme peut procéder à la répartition des parlers de la zone considérée en deux groupes:","- les parlers pour lesquels le coefficient linguistique (CL) est supérieur à la moyenne de Proximité Linguistique (MPL)","- les parlers pour lesquels le CL est inférieur à la MPL.","Le calcul de l'Indice de Variation Linguistique (IVL) permet de mesurer l'homogénéité ou la variation qui existe au sein de chaque groupe de parler. La variance minimale étant 0, plus on s'éloigne de 0 plus il y a variation au sein du groupe de parlers; et plus l'indice est faible (proche de 0), plus il y a homogénéité au sein du groupe. Cette IVL est calculée suivant la formule:","n","IVL = 1/n ∑ (x i - M)2","i = 1 x i = CPL M = MPL n = nombre de CPL","Par la suite, le programme prendra chaque groupe de parlers et calculera ses CL et sa MPL et son IVL, pour faire une nouvelle répartition en sous-groupes, à partir des formules ci-dessus; jusqu'à aboutir à des communautés binaires. Il ne restera plus qu'à tracer le diagramme de proximité des parlers en présence. L’exécution du programme se fait en cinq étapes :","1. SAISIE DES DONNEES 1.1. saisie des noms des langues 1.2. saisie des Items 1.3. saisie des formes des différentes langues Sauvegarde","2. CALCUL DES TAUX DE RESSEMBLANCE 2.1. Calcul des Coefficients de Communauté","Linguistique (C) 2.2. Calcul des Coefficients de Proximité","Linguistique (CPL) 2.3. Matrice des Pourcentages de ressemblance Sauvegarde","3. REDUCTION DE LA MATRICE AUX","POURCENTAGES SIGNIFICATIFS 3.1. Arrondissement de tous les % décimaux aux","entiers les plus proches 3.2. Chargement de la Table des Pourcentages","Significatifs 3.3. Recherche des Groupes Significatifs 3.4. Matrice des Pourcentages significatifs Sauvegarde","4. SATURATION DE L'ESPACE DIALECTAL 4.1. Calcul des Coefficients Linguistiques (CL) 4.2. Calcul de la Moyenne de Proximité","Linguistique (MPL) 4.3. Calcul de l'Indice de Variation Linguistique","(IVL) 4.4. Répartition en Groupes Linguistiques 4.5. Subdivision de chaque groupe en sous-groupes","jusqu’aux communautés binaires Sauvegarde","5. DIAGRAMME DES RELATIONS DE PROXIMITE"]},{"title":"4. Conclusion","paragraphs":["Ce programme dont nous présentons ici pour la première fois la version bêta aidera, nous osons le croire, les linguistes qui travaillent sur des zones pour lesquelles les travaux sont rares et qui cherchent à pouvoir procéder à des regroupements des dialectes en langues, en vue de pouvoir standardiser les langues en présence. Les remarques des utilisateurs nous aideront à le corriger et à l’améliorer.","Nous tenons à remercier ici l’AUPELF – UREF qui a financé le projet, en nous intégrant comme Jeune Equipe de Recherche (JER 1002)."]},{"title":"5. Références","paragraphs":["Carrol J.B. & Dyen I. High Speed Computation of Lexicostatistical Indices, in Language 38, Baltimore, p. 274-278, 1962.","Dyen Isidore. The Lexicostatistically Determined Relationships of a Language Group; International Journal of American Linguististics, 28:153-161, 1962.","Möhlig Wilhelm J.G. La Dialectométrie : une méthode de classification synchronique en Afrique, (pp. 27-44) in Guarisma Gladys & Platiel Suzy, éditeurs, 1980, Dialectologie et comparatisme en Afrique noire, Actes des journées d’étude tenues au Centre de Recherche Pluridisciplinaire du CNRS, Ivry (France), 2-5 juin 1980, SELAF, 306 pages, Paris.","Möhlig Wilhelm J.G. Introduction à la dialectométrie synchronique; in Möhlig W.J.G. & Guarisma G.: La Méthode dialectométrique appliquée aux langues africaines. Dietrich, Reimer Verlag, Berlin; pp.15-26, 1986.","Sanders Arden. Guidelines for Conducting a Lexicostatistic Survey in Papua New Guinea; In Loving & Simons: Language variation and Survey techniques; Workpapers in Papua New Guinea Languages, vol. 21, Ukarumpa, Papua New Guinea, S.I.L., 75-107, 1977.","Simons Gary F. Tables of Significance for Lexicostatistics. In Loving & Simons: Language variation and Survey techniques; Workpapers in Papua New Guinea Languages, vol. 21, Ukarumpa, Papua New Guinea, S.I.L., 75-107, 1977.","Thomas David & Healey Alan. Some Philippine Language subgroupings : a lexicostatistical study, in Anthropological Linguistics, (9), Bloomington, pp. 21-33, 1962.","Wimbish John S.: Wordsurv, A Program for Analyzing Language Survey Word Lists; Occasional Publications in Academic Computing, Number 13. Summer Institute of Linguistics, Dallas, Texas, 1989."]}]}