{"sections":[{"title":"Lexicalised Systematic Polysemy in WordNet Wim Peters","paragraphs":["Department of Computer Science University of Sheffield","U.K. w.peters@dcs.shef.ac.uk"]},{"title":"Ivonne Peters","paragraphs":["Department of Computer Science University of Sheffield","U.K. ivonne@dcs.shef.ac.uk","Abstract This paper describes an attempt to gain more insight into the mechanisms that underlie lexicalised systematic polysemy. This phenomenon is interpreted as systematic sense combinations that are valid for more than one word. The hierarchical structure of WordNet is exploited to create a working definition of systematic polysemy and extract polysemic patterns at a level of generalisation that allows the identification of fine-grained semantic relations between the senses of the words participating in the systematic polysemic pattern."]},{"title":"1. Introduction 1.1 Defining Systematic Polysemy","paragraphs":["Systematic polysemy is defined by a set of word senses that are related in systematic and predictable ways. This relatedness is also described in terms of the Aristotelian tropes or figures of speech metonymy and synecdoche (Ross, 1924). Metonymy can be defined as a (semi-)productive lexical semantic relation between two referential concept types or classes that belong to incompatible or orthogonal types. It expresses semantic contiguity derived from world knowledge, i.e. the concepts are closely associated, and often has an inherent directionality from a base or prototypical sense to a derived sense. Synecdoche, often regarded as a subtype of metonymy, is based on a partwhole or whole-part relation between the compared concepts. Other more recent terms coined for this phenomenon are regular polysemy (Apresjan, 1973) sense extension (Copestake, 1995) and transfers of meaning (Nunberg, 1996). According to Apresjan, the semantic regularity it displays is a distinctive feature of metonymic transfers. On the other hand, irregular polysemy is more typical of metaphorical transfers which express a semantic similarity relation between two concepts that yields a conceptual mapping, a list of correspondences, between the source and target domains of a metaphor (Lakoff, 1993)."]},{"title":"1.2 Lexicalisation of Systematic Polysemy","paragraphs":["The ways in which metonymically related concepts are lexicalised vary from one language to another. Some languages may realise them by the same word, which leads to polysemy, other languages by means of linguistic processes such as derivation and compounding. An interesting observation is that there often is a one-to-one correspondence between different languages in their lexicalisation behaviour towards metonymy, in other words, metonymically related word senses are often translated by the same word in other languages (Seto, 1996). Apresjan uses this notion of concept lexicalisation as a criterion for distinguishing between regular and irregular polysemy: ’Polysemy of the word A with the meaning ai and aj is called regular if, in the given language, there exists at least one other word B with the meanings bi bj, which are semantically distinguished from each other in exactly the same way as ai and aj and if ai and bi, aj and bj are nonsynonymous. Polysemy is called irregular if the semantic distinction between ai and aj is not exemplified in any other word of the given language.' (Apresjan, 1973) In other words, systematic polysemy applies if at least two words share the same sense combination."]},{"title":"1.3 Examples of Systematic Polysemic Relations","paragraphs":["The issue of systematic polysemy has mostly been approached from a theoretical perspective. There is a limited set of default relations identified in the literature of which the following are a subset (Ostler & Atkins, 1991, Pustejovsky, 1995). Most of these relations have been arrived at by examination of a limited quantity of linguistic material (texts, dictionaries) or introspection. 1. container/containerful cup 2. animal/food lamb, chicken 3. animal/skin crocodile 4. plant/food banana 5. product/producer newspaper, Honda 6. substance/colour jade, amber 7. object/shape pyramid 8. language/people Spanish 9. music/dance waltz 10. figure/ground door/window 11. place/people city, New York"]},{"title":"1.4 Incorporation in the Lexicon","paragraphs":["Whether or not a particular word sense is lexicalised, i.e. incorporated in the lexicon, is determined by factors such as the frequency of occurrence of the sense in actual textual usage, and the level of convention that the similarity or contiguity relation has attained in language use. The consolidation of systematic polysemic relations into attested sense distinctions shifts and changes, reflecting various degrees of lexicalisation. The issue of lexicalisation requires lexicographic criteria that determine the inclusion of a particular sense in a dictionary entry. It is crucial for the relevance of the question whether systematic polysemic patterns should be represented within the lexicon as sense extensions by means of lexical rules (Copestake, 1996) or outside the lexicon by means of pragmatically defined meaning transfers (Nunberg, 1996). The boundary between lexical and pragmatic explanations of systematic polysemy is wholly determined by synchronic analysis of language in use on the one hand and lexicographic practice on the other. The latter represents the historical picture of the development of a word's senses and is heavily influenced by the type of resource it wants to produce. Dictionary users and size determine the choice between lumping and splitting word senses (Evens, 1988), (Kilgarriff, 1997), and no matter how fine-grained a dictionary’s inventory of senses is, it can never be exhaustive, nor can it fully cover the dynamic meaning potential of language."]},{"title":"2. Systematic polysemy in WordNet","paragraphs":["In general, dictionaries are not primarily directed towards encoding semantic regularities across the lexicon, but towards distinguishing senses that enable the user to interpret texts. WordNet with its dictionary-based sense distinctions forms no exception; the semantic encoding of WordNet is not aimed at the implementation of explicit patterns of systematic polysemy. However, a number of semantic regularities have been captured by the so-called ‘cousin’ relation, which is used to group concepts according to similarity of meaning. The relation is computed from a table of 88 concept pairs in WordNet1.5, and 220 in WordNet1.6. All their hyponymic concepts are assumed to be involved in the semantic relation. Exceptions are listed in a separate file. although several regularities have been observed, there is no explicit description of the semantic relations covered in these tables. Close inspection shows that these pairs implicitly signal a semantic relation which is not always metonymic. Moreover, the relations seem to have been identified ad hoc and there is no principled account of the reasons why exceptions to the observed regularity have been identified as such. Finally, very few concepts linked by the cousins relations are senses of the same word: in WordNet1.6 38 cousin pairs have only 1 word form in common that lexicalises both concepts, whereas 72 have none."]},{"title":"3. Detecting Systematic Polysemy in WordNet","paragraphs":["We have followed a data-driven methodology by exploiting the hierarchical structure of WordNet in order to find relations between word senses. The regularities that emerge from the automatic structural analysis can be considered indicative of systematic polysemic patterns. Two caveats are in place here. The first is that a high level of noise is to be expected because of false friends. The second is that the realisation of these relations in a resource will never be exhaustive for reasons mentioned above, and are therefore only partly attestable. We have operationalised Apresjan’s definition of regular or systematic polysemy (see section 1.2) for WordNet, and the following criteria apply: At least two words should share the same combination of senses representing the RP pattern; These words may or may not belong to the same synset; The synsets involved should belong to the same syntactic class."]},{"title":"3.1 Step 1: combinations of high-level concepts","paragraphs":["In our investigation, we examined a number of combinations of WordNet1.5 unique beginners (i.e. the top level nodes of individual branches within the WordNet taxonomy) that share the same word form as a hyponym at any level in the hierarchy. Examples of unique beginners are: artefact-1 a man-made object group-1 any number of entities (members)","considered as a unit The initial hypothesis was that combinations of these unique beginners yield systematic polysemous sense distinction patterns at a very general level of description. Previous work has been performed by Buitelaar (1998) who extracted 126 classes consisting of combinations of 35 high-level concepts in the WordNet hierarchy, including WordNet’s 24 unique beginners. These classes display various types of systematic polysemy from WordNet1.5. We have examined pair-wise combinations of unique beginners. The examples below lists a small subset of the words that occur as hyponyms of both artefact and group: institution-2 a building or complex of buildings where an organization for the promotion of some cause is situated institution-1 an organization founded for a specific purpose guard-3 a device designed to prevent injury guard-5 a group of men who escort and protect some important person menagerie-2 the facility where wild animals are housed for exhibition menagerie-1 a collection of live animals for study or display shower-1 a plumbing fixture that sprays water over you shower-5 a party held by friends to present gifts to a person type-6 a small block of metal bearing a raised character on one end; produces a printed character when inked and pressed on paper; “he dropped a case of type so they made him pick them up” type-3 (biol) the taxonomic group whose characteristics are used to define the next higher taxon unit-6 a combination of interrelated interacting elements designed to work as a coherent entity unit-2 an organization regarded as part of a larger social group Further investigation of the above examples shows some disadvantages of restricting systematic polysemy to combinations of high level concepts. Distinguishing systematic polysemic patterns on the basis of particular unique beginner combinations can lead to: (1) inappropriate instantiations of a pattern, as in the case","of shower and type, where there is no systematic","relation between the two senses. Where there seems","to be no meaning relation between the various senses of type, the relation between the two senses of shower is an isolated case of metaphorical transfer;","(2) the creation of groups that contain words that are not semantically similar, i.e. groups of these words are not homogenous in nature in the sense that they do not display the same metonymic relation. For instance, menagerie and guard seem to display a ‘facility/collection’ and a ‘group/device’ alternation respectively. Consequently, using high level concepts for the characterisation of systematic polysemy can block the identification of subgroups that are semantically more coherent."]},{"title":"3.2 Step 2: combinations of more specific concepts","paragraphs":["Taking into account the above-mentioned disadvantages of using of high level concepts, we subsequently identified combinations of hypernyms at a more specific level. In other words, we selected pair-wise combinations of nodes in the WordNet hierarchy that are preferably more specific than the unique beginners but still general enough to encompass several words and constitute semantically homogenous groups. These WordNet nodes or concepts that function as ‘conceptual signposts’ for the identification of systematic polysemic patterns have to meet the following criteria: (1) node pairs must function as a hypernym of at least","three words having at least one sense in both UB","branches. This is in fact a stronger constraint than the","one expressed in Apresjan’s definition cited above; (2) the distance of the word senses to the hypernym in","terms of node traversal in the WordNet taxonomy is","never greater than 4. This distance has mainly been","chosen to limit processing time and volume of output","data. Figure 1 on the next page is a graphical representation of the two WordNet branches headed by the unique beginners ‘artefact’ and ‘action’ covering the systematic polysemic pattern music – dance. ‘Rumba’, ‘Waltz’ and ‘Bolero’ are all within the maximum distance to the conceptual signposts ‘music’ and ‘dance’. Figure 1: The systematic polysemic pattern music - dance A manual examination of a number of UB combinations yielded the following subgroups. Table 1 to 4 list systematic polysemic patterns under different UB combinations"]},{"title":".","paragraphs":["Relation","Examples No of words","covered holdfast – control lock, clasp, clench 5 picture – painting etching, engraving, fresco 5 music – dance waltz, rumba, bolero 20","communication system –","broadcast radio, television, wireless 3 path – travelling crossing, walk, promenade 4 Table 1: UB pair Artefact - Action Relation Examples No of words","covered","publication-publisher paper, newspaper, magazine 3","musical composition – group of singers trio, quartet, suite 16 building – institution/association school, chamber, court 15 package/container – collection parcel, bundle, pack 5 music – arrangement/formation line, arrangement, chorus 3 construction – body of people house, body, camp 5 Table 2: UB pair Artefact – Group"]},{"title":"Unique Beginner 1 Artefact Unique Beginner 2 Action","paragraphs":["Music Dance"]},{"title":"Conceptual Signposts Bolero Bolero 3 3 1 Waltz 2 Waltz 1 1 3Rumba 2 Rumba 3 1 3 Distance","paragraphs":["Relation","Examples No of words","covered","supporting structure – theory framework, foundation, base 5","musical theme – idea theme, motif, strain 4","concrete obstruction - abstract","obstruction barrier, roadblock, hurdle 8 device - something having influence over somebody bait, lure, support 3 artistic work – idea design, motif, pattern 3","product – ability art, innovation, invention 3","concrete representation/creation - mental representation figure, model, scene 8 Table 3: UB pair Artefact – Cognition","Relation Examples No of words covered","musical composition – amount of items of the same kind trio, quartet, potpourri 9","long thin implement - unit of measure pole, rod, yard 3 container - quantity barrel, firkin, kettle 33 Table 4: UB pair Artefact - Measure"]},{"title":"4. Discussion 4.1 First evaluation","paragraphs":["The concept pairs that have been evaluated as valid show a low percentage of unsuccessful combinations. Around 10% of the members extracted on the basis of a particular conceptual signpost pair were considered as invalid instantiations of that pattern. The observed regular polysemic patterns correspond in a number of cases to relations attested in the literature (see list in section 1.3). This is particularly true for those sets containing a relatively large number of members, such as ‘music’ – ‘dance’ and ‘container’ – ‘quantity’. The methodology described in this paper has several drawbacks. First, only pair-wise combinations of unique beginners have been taken into account. Combinations of three or more are, in contrast to Buitelaar’s classification, only observable in an indirect way, by examining the overlap of sets that have members in common. For example, table 2 and 4 link musical composition, group of singers and amount of items of the same kind (as expressed by words such as ‘trio’ and ‘quartet’). The second disadvantage is that it is difficult to automate the fine-tuning of the extraction of suitable conceptual pairs derived automatically on the basis of the criteria described above. Several other criteria may be used for this purpose such as the level of the conceptual pair in the hierarchy. In this case there is a trade-off between generality and specificity: the more specific the conceptual pair, the more defined the semantic relation that holds between the concepts in the pair, but also the smaller the set. It may well happen in the latter case that a meaningful set is cut up into several very specific subsets that cause valuable generalisations to be lost. The best trade-off might be found by determining the most specific subsumer with the highest information content (Resnik, 1999) from the candidates produced by the technique described above. One final disadvantage is that imposing a node traversal limit of 4 between hyponymic concepts and conceptual pairs may be too much dependent on the assumption of a balanced hierarchy. In fact, the hierarchies in WordNet are far from balanced, and therefore expansion further downward may yield more candidates."]},{"title":"4.2 Productivity","paragraphs":["It seems plausible to generalise the systematic polysemic patterns over all members of the semantic class captured by the pattern, and postulate new, derived senses for words that only occur in the base sense of a pattern. This would lead to a significant systematic expansion of the semantic coverage of WordNet. For instance, any word with a ‘container’ sense could automatically be assigned a potential ‘quantity’ sense if that sense is lacking in WordNet. For example, this would be true for ‘amphora’ and ‘parcel’. The underlying assumption here is that there are many words sharing the same meaning extension potential other than the words whose list of senses in the dictionary explicitly reflects the regular polysemy patterns. This offers the possibility to enrich sense descriptions in the resource and license dynamic activation of metonymic patterns. However, there are several issues that need further attention. Firstly, we need to determine the base sense of a particular conceptual signpost pair. For example, where words that occur in an animal sense can theoretically occur in a food sense, the reverse implication does not hold. In other words, the animal sense is the primary or base sense of this combination. Furthermore, activation of the postulated sense might never happen because of lexical blocking such as usage of ‘pork’ instead of ‘pig’, pragmatic considerations such as poisonous food substances, lexical preference for derivational forms or the improbability of the context in which the postulated sense can be activated."]},{"title":"4.3 Metaphoric transformations","paragraphs":["Some of the unique beginner combinations reflect a metaphoric instead of a metonymic relation. Although these are generally not considered productive, the results from the evaluation indicate a dependency on a specific unique beginner pair, artefact-cognition. We seem to have stumbled on a metaphorical domain where properties of artificial structures are mapped onto cognitive skills. Different types of metaphorical transfer can be identified, such as ‘theory as a supporting structure for thought’ and ‘a melodic theme as pervasive idea’. The fact that this domain is particularly productive for metaphoric extension does seem to indicate that extensions like these can behave more or less regularly as soon as the a correspondence between two domains has been established."]},{"title":"4.4 Conclusion","paragraphs":["Concluding, we can state that mining a linguistic resource with semantic information in search for regularities in lexicalisation patterns can give insight into: - the level of encoded semantic regularity in the","resource; - the orientation of lexicographic practise towards this","phenomenon; - the number and nature of lexicalised metonymic","patterns; - the semantic potential of words that guides their","dynamic interpretation when used in new contexts; - the cognitive processes that underlie metonymic sense","extensions / metaphorical transformations and indeed","human cognition in general; - the taxonomic balance of the resource in terms of","chain length and choice of concept nodes. The resulting extended knowledge base, where semantic regularities of the sort described above have been recognised and postulated, will provide additional conceptual material for inferencing purposes."]},{"title":"References","paragraphs":["Apresjan, J. (1973). Regular Polysemy In: Linguistics 142: 5-32 Buitelaar, P (1998). Corelex: Systematic Polysemy and Underspecification, Ph.D., Department of Computer Science, Brandeis University, Boston, U.S.A. Copestake, A. and Briscoe, T. (1996), Semi-productive Polysemy and Sense Extension In: Pustejovsky, J. and Boguraev, B. (Eds.), Lexical Semantics, the Problem of Polysemy, Clarendon Press, Oxford Evens, M.W. (ed.) (1988). Relational Models of the Lexicon: Representing knowledge in semantic networks, Cambridge, CUP Kilgarriff, A. (1997), I Don’t Believe in Word Senses, In: Computers and the Humanities Special Issue on Word Sense Disambiguation Lakoff, George. 1993. The Contemporary Theory of Metaphor In: Andrew Ortony (ed.), Metaphor and Thought, second ed. New York: Cambridge University Press, pp. 202-251. Miller G.A, Beckwidth, R., Fellbaum, C., Gross, D. and Miller, K.J. (1990), Introduction to WordNet: An On-line Lexical Database, In: International Journal of Lexicography, Vol. 3, No.4, 235-244. Nunberg, G. (1996), Transfers of Meaning, In: Pustejovsky, J. and Boguraev, B. (Eds.), Lexical Semantics, the Problem of Polysemy, Clarendon Press, Oxford Ostler, N. and Atkins, B. (1991), Predictable Meaning Shift: Some Linguistic properties of Lexical Implication Rules, In: Pustejovsky, J., Bergler, S. (Eds.), Lexical Semantics and Knowledge Representation, ACL SIGLEX Workshop Berkeley, California Pustejovsky, J. (1995). The Generative Lexicon, MIT Press, Cambridge MA, U.S.A. Resnik, P. (1999), Semantic Similarity in a Taxonomy: An Information-Based Measure and its Application to Problems of Ambiguity in Natural Language, Journal of Artificial Intelligence Research 11, pp.95-130 Ross, W.D. (ed.) (1924), The Works of Aristotle, Oxford Clarendon Press Ken-ichi Seto (1996) On the Cognitive Triangle: the Relation of Metaphor, Metonymy and Synecdoche in: A. Burkhardt & N. Norrick, eds. Tropic Truth (working title). De Gruyter, Berlin - New York: 1996."]}]}