{"sections":[{"title":"Symmetric Pattern Matching Analysis for English Coordinate Structures Akitoshi Okumura and Kazunori Muraki NEC Corp. Information Technology Research Laboratories 4-1-1 Miyazaki, Miyamae-ku, Kawasaki, Kanagawa 216, JAPAN okumura@hum.cl.nec.co.jp Abstract","paragraphs":["The authors propose a model for analyzing English sentences including coordinate conjunctions such as \"and\", \"or\", \"but\" and the equivalent words. Syntactic analysis of the English coordinate sentences is one of the most difficult problems for machine translation (MT) systems. The problem is selecting, from all possible candidates, the correct syntactic structure formed by an individual coordinate conjunction, i.e. determining which constituents are coordinated by the conjunction. Typically, so many possible structures are produced that MT systems cannot select the correct one, even if the grammars allow to write the rules in the simple notations. This paper presents an English coordinate structure analysis model, which provides top-down scope information of the correct syntactic structure by taking advantage of the symmetric patterns of the parallelism. The model is based on a balance matching operation for two lists of the feature sets, which provides four effects: the reduction of analysis cost, the improvement of word disambiguation, the interpretation of ellipses, and robust analysis. This model was practically implemented and incorporated into the English-Japanese MT system, and provided about 75% accuracy in the practical translation use."]},{"title":"1 Introduction","paragraphs":["This paper presents a model for analyzing English sentences including coordinate conjunctions such as \"and\" , \"or\" , \"but\" and equivalent words.","Syntactic analysis of English coordinate sentences is one of the most difficult problems for machine translation (MT) systems. The problem is select-ing, from all possible candidates, the correct syntactic structure formed by an individual coordinate conjunction, i.e., determining which constituents are conjoined by the conjunction. Although the conjunction appears to have a simple function in the English language, it has been researched as a conjunct scope problem by both theoretical and computational linguists. Theoretically, it is possible to describe the syntactic and semantic constraints that govern the acceptability of a structure in which two constituents are conjoined by the conjunction(Lesmo and Torasso, 1985; Gazdar, 1981; Schachter, 1977). Computationally, it is possible to describe the grammar and heuristic rules for these constraints by ATN networks, logic grarnmars~ HPSG~ and categorical grammars(Kosy, 1986; Fong and Berwick, 1985; Huang, 1984; Boguraev et al., 1983; Blackwell, 1981; Niimi et al., 1986). However, it is not easy to apply these techniques to large-scale MT systems, because there exist a variety of conjoined patterns, many word ambiguities, some unknown words and ellipses of the words simultaneously, in real environments. Also, there may be several conjunctions and the equivalent words, such as commas, in a single sentence. Typically, the methods produce so many possible structures that MT systems cannot select the correct one, even if the grammars allow to write the rules in the simple notations.","Often, conjunctions might produce the reading difficulty even for the human readers. However, they also give the readers a kind of symmetry as a reading indication. They exhibit the tendency to conjoin the same kind of syntactic patterns, which has been called \"parallelism\" (Beaugrande and Dressier, 1981; Shinoda, 1981). In Japanese, the similarity is used for analyzing conjunctive structures and the method is found effective(Kurohashi and Nagao, 1992). While Japanese language has several coordinate conjunctions according to the syntactic levels (a noun phrase and a predicative clause), English coordinate conjunctions are used for any level of the structures. More robust methods are necessary for dealing with English conjunctive structures.","We propose here an English coordinate structure analysis model, which can determine the correct syntactic structure in real environments by taking advantage of the symmetric patterns of the parallelism. 41 The model is based on a balance matching operation for two lists of the feature sets. The lists represent the left-side and right-side structures of the coordinate conjunctions, including word ambiguities. The operation determines the most symmetric structure by comparing both sides of the conjunction.","First, the problems of the English coordinate sentences are explained. Second, it is mentioned that the parallelism can be effective information for top-down analysis of the sentences. Third, the balance matching analysis model is presented for solving the problems. This model, which was implemented in the PIVOT English-Japanese MT system with the dictionary of 100,000 words, has been working in the analysis module. Finally, the results in the MT system are reported together with the MT system configuration."]},{"title":"2 Problems of the conjunctions","paragraphs":["Coordinate conjunctions for MT systems present three difficulties(Kosy, 1986; Huang, 1983; Niimi et al., 1986; Okumura et ai., 1987).","1. Analysis cost: English coordinate conjunctions have a variety of linguistic functions. The conjunctions can syntactically conjoin any parts of speech; nouns, adjectives, verbs, etc., and all sorts of constituents; words, phrases and clauses. They produce so many possible structures that MT systems cannot select the correct one, even if some grammars provide the simple notations of the rules. The complexity of the rules impose a burden on the analysis process.","2. Ambiguities of the words: Most English words are ambiguous in their parts of speech ,such as Noun and Verb, Preposition and Conjunction, Auxiliary Verb and others, and Adjective and Noun. The complex rules governing the conjunctions make the word disambiguation more complicated, which results in the reduction of analysis precision.","3. Ellipses of the words: It is possible for a conjunct to contain \"gaps\" (elided elements) which are not allowed if the conjunction is removed. These gaps must be filled with elements from other conjunct for a proper interpretation, as in (1) and (1)'.","(1) NO.2 landing gear selector valves should be closed to the full position,and NO.3 to the hM£","(1)' NO.2 landing gear selector valves should be closed to the full position, and NO.3 [landing gear selector valves should be closed] to the half [position]."]},{"title":"3 Parallelism of the conjunctions","paragraphs":["3.1 Symmetric patterns of parallelism English coordinate conjunctions have a tendency to conjoin the same kinds of syntactic patterns. We identify three levels of symmetric pattern.","• Phrase(Clause) symmetric patterns: Phrase(Clause)-level symmetric patters such as [Verb-Phase AND Verb-Phase] in the conjunct scope of \"as well as \" in (2) and a series of commas in (3).","(2) Such coupling is desirable because it enables a development engineer to move easily within this hierarchy as well as to exploit the distinctive features of each system.","(3) The add operators cause POSTSCRIPT to pick up the top two numbers from the stack, remove them, add them, and leave the sum on the stack.","• Word symmetric patterns: Word-level symmetric patterns such as [Quantifier Preposition Abstract-Noun AND Quantifier Preposition Abstract-Noun] in the conjunct scope of the \"and\" in (4). Some patterns are represented by the semantic features such as [Instrument AND Instrument] about \"and1\" of (5).","(4) The container need not be large; if it is lOcm in diameter and 12cm in depth, that is enough.","(5) Inspect the cockpit indicators and1 levers for cracked glass and missing control knobs.","• Morphological symmetric patterns: Morphological symmetric patterns are recognized by the sorts of characters, uppercase or lowercase letters, as in (6) and (7) as well as an exactly same morphological pattern [CIC ... hatches AND CIC ..., hatches] in (8).","(6) An atomic bomb is a device for producing an explosively rapid neutron chain reaction in uranium-235 or plutonium-239 which is called a fissile material.","(7) Technical orders described in AFR 8-2 and PFR 7-2 are registered in the on-line file in the form of inspection workcards.","(8) There are CIC1 ditching2 hatches3 and CIC4 escape5 hatches6 in the compartment.","Some symmetric patterns may appear in combined form [Preposition Gerund Nominal-Phrase AND Preposition Gerund Nominal-Phrase] in (9).","(9) Radioisotopes have played an important part in1 developing effective insecticides in2 the country and in3 finding the best ways o£ applying them. 42 8.2 Analysis by {he symmetric patterns The symmetric patterns can be effective information for top-down analysis of the conjunct scope. For example, though (9) allows another counterpart (\"in2 the country\") as the conjoined phrase (\"in3 finding ...\"), the symmetric pattern information makes it easy to to select the correct counterpart of the phrase (\"in1 developing .... \" ). Also, where other examples syntactically allow other counterparts of the conjoined noun phrases, the symmetric pattern information enables easy selection. Often, the scope of each conjunct is explicitly demarcated with commas and morphological patterns, as in (3) and (8). The symmetric patterns can be also effective for word disambiguation. For example, (8) contains verb/noun ambiguities for"]},{"title":"escape5","paragraphs":["and"]},{"title":"hatches6.","paragraphs":["The symmetric patterning of"]},{"title":"ditching2 hatches3","paragraphs":["facilitates their disambiguation.","In the above example sentences, the words immediately following the conjunction play important roles for detecting the structures, because there is usually strong similarity between the starting words of each conjunct scope and the words following the conjunctions. However, the following examples also contain kinds of symmetric patterns, though the words following the conjunctions don't have similarity with the starting words of the conjunct scopes. (10) In 1985 the government offered offshore regis-","tration to the companies, and, in consequence,","in 1985 incorporation fees generated about two","million dollars. (11) The damage of the landing gear selector valve","caused the leakage of the hydraulic fluid, and","completely blockaded the return path. (12) Close the cockpit ditching hatches, and","the cabin pressure will be dumped to relieve the","air loads on the hatches.","In both (10) and (11), an adverbial modifier is inserted at the start of the second conjunct; this is a common pattern extension. In (12), there is no real parallelism: the first conjunct clause is an imperative, and the second its result."]},{"title":"4 Balance matching analysis model","paragraphs":["The balance matching analysis model determines the correct structure by taking advantage of the symmetric patterns. In this section, first, the representation of symmetric patterns is presented. Then the balance matching operation is presented. Finally, analysis by the balance matching is described. 4.1 The pattern representation The symmetric patterns are represented by a list of three feature sets; Phrase features, Word features, and Morphological features, based on the symmetric pattern levels.","* Phrase feature [¢]: Values are Predicative, Nominal, Nominal-Premodifier, Nominal-Postmodifier, Predicate-modifier. These values are assigned to all the constituents in the phrase. For example, all the words in \"the effective insecticides\" have"]},{"title":"¢.(Nominal)","paragraphs":["• Word feature [7]: This feature includes 120 values which subclasses of general parts of speech, according to their grammatical and semantic function. For example, some values are {NounInstrument}, {NounHuman}, {NounAction}, {PredicateStatic}, etc.","• Morphological feature [6]: The values shows the morphological attributes of the words, which are a pair of the word and the morphological type. For example, \"uranium-"]},{"title":"235\"","paragraphs":["is represented by"]},{"title":"&(uranium-235, alphabet_hyphen_arabic-n","paragraphs":["umbers) . Each word in the sentence is represented by the set of the three features. ¢ and 7 can include ambiguous values. The ith word-feature set Hi and the n-word sentence S~ are respectively represented as follows."]},{"title":"( ~i ) ~i -= {¢iI,''',¢im} = = {Ti,'\",Tin} (13) ,% Ai = 12} = (Wl,..-, w,) (14)","paragraphs":["When the conjunction is the ruth word of the n-word sentence, the left-side list S~ -1 and the right-side list S~n+l are respectively represented as follows. S7 '-1 = (Wx,'\", W~,-,) (15)","S~+i = (W.~+I,'\", W.) (16)","The goal of the balance matching is to find the most symmetric pair of 5~-1(I _< x < m) and ,$Ym+i(m < y ~ n), i.e., to find the values of x and y. 4.2 The balance matching operation By definition, the most symmetric pair shares the maximum number of the word-feature sets in the lists. The pair is detected by three operations: the intersection operation for two features, the matching operation for two word-feature sets, and the balancing operation for two lists. 4.2.1 The intersection operation","The intersection operation is one of the normal set operations for the features:","@,~_ 1. {uranium-235,alphabet_hyphen_arabicnumbers} V~ ~,~+l.{plutonium-239, alphabet_hyphen_arabicnumbers} - {alphabet-hyphen_arabic-numbers}","The mutual dependency information among the ¢ij and Vik is managed by bi-directional lists in the background. If all ¢ij dependent of Vik are disambiguated by the operation, 7ik are removed. 43 4.2.2 The matching"]},{"title":"operation","paragraphs":["The matching operation N for the the word-feature sets V, 142 is defined as follows:"]},{"title":"v~ n Wj = V~Wj","paragraphs":["= r~ n r;, (:7) A~ N A d The matching word-feature set V~lfl2j can exist, when"]},{"title":"¢i rl ¢.} ~ NULL","paragraphs":["or Fin F:. ¢"]},{"title":"NULL.","paragraphs":["•","21",".","•","Especially, as is mentioned m Sectmn 3.2, in most of the conjoined sentence, the word-feature sets of Win+l, which immediately follows the conjunction, play an important role for detecting the structure, because there is strong similarity between the starting word-feature set of the conjunct scope and 142m+1."]},{"title":"4.2.3 The balancing operation","paragraphs":["The balancing operation ® for the lists £~ ,T~' is defined as follows:"]},{"title":"£'~ ® n7 = {(V~Wj,\"', VkW,\"')IV • £i,W • nT,","paragraphs":["k > j, c1 = (v~,..., v,), ~7 = (w:,.-., w,)}","Every word-feature set in the list doesn't always match one of the other list. Some word-feature sets in £]' can find matching counterparts in 7£ T but others cannot. In (18),"]},{"title":"The:","paragraphs":["and"]},{"title":"operationsa re-","paragraphs":["spectively matches"]},{"title":"the1","paragraphs":["and"]},{"title":"results2.","paragraphs":["(18)"]},{"title":"The1 arithmetics operations3","paragraphs":["and"]},{"title":"the~ results2.","paragraphs":["Therefore, the balancing operation creates a set of the lists for exhausting all the possible combinations. The lists consist of the matching word-feature sets (12~I,Y~) which are selected to avoid crossing any existing lines when ~i and I4~ are connected by a line as in the following:","(v:, ,,,, v~, ,,,, vk, ,,,, v.~) /"]},{"title":"1 1 1","paragraphs":["\\ (:9) (w:, ,,,, w;, ,,,, w. ,,,, w.) For example,£ 3 ® 7~ is : C 3 = (V:, ])2, V3) ~2 = 0~Vl ' }/V2 ) Cl 3 @ \"Z~21 = {(Vl~/Vl), (Vl]/V2), (V2Wl),'(~22~V2), (~23~21), (V3~)2), (~)1~71, V2~V2), (Vl~)I, V3~V2),"]},{"title":"(v2w~,","paragraphs":["v3w2)}","(20) The balancing degree 8 for a list 2- is defined as fob lOWS: o~ ="]},{"title":"~_, wk.V'(k) z = (v~wj,..., v~w,,)","paragraphs":["dV'(¢) and Af(F) respectively represent the total number of the each feature in the list 2-. Af(A) is the total number of the values of A in the list 2\". Herein, wk is defined as a binary value (1.0 or 0.0) for simplifying the model. Through the analysis of 10,000 English conjunctive sentences in technical manuals, the structures could be divided into about 300 coordinate patterns, which are represented in the form of the word-feature sets. We manually assigned the weights to the features A, F and • according to the patterns, in order to select the correct structure. 4.3 Analysis by balance matching The n-word sentence including the conjunction as the ruth word is analyzed according to the following steps.","L Collect the word-feature set G(W): G(W) = {Wx[Wx n Wm+l #"]},{"title":"NULL}","paragraphs":["This step collects a set of the words similar to W,~+I. The collection considers some definite concord markers and boundary markers, such as \"and\", \"both\" , \"either\", commas, periods, and colons. In order to deal with the cases of (10),(11) and (12), the starting words of the clause I42 k are added to G(IA~) when a comma"]},{"title":"II.","paragraphs":["is preceded by Create the list"]},{"title":"H(£) = {Wjl i","paragraphs":["the conjunction. set H(£): _<j <m-l, Wi6G0d))}","n--m."]},{"title":"III.","paragraphs":["Create the list ~1 •"]},{"title":"~,.~'-\"' = {W,.+:, W~.+2,\"., W.} IV.","paragraphs":["To create the list set F(£7~) by the balancing operation. F(Cn) = {q ® nr-~lq 6 g(£)}","V. Select the list F(£7~)ma~ which has the highest balancing degree from all the possible lists in F(£7~).","For example, (9) are analyzed by the following steps. Here, for the easy understanding, the word-feature set and the list are represented by the simplified expression. (9) Radioisotopes have played an important part"]},{"title":"in1 developing effective insecticides in2 the country and in3 t~nding the best ways of applying them• I. G(W)","paragraphs":["= {in:, in2}"]},{"title":"II.","paragraphs":["H(£) = {(in1,"]},{"title":"developing, effective, insecticides, in, the, country), (in2, the, country)} III. Tt~ = (inn, finding, the, best, ways, of, applying, them) IV. F(CTt)","paragraphs":["= {...,"]},{"title":"(Preposition, Nominal), (Preposition, Gerund, Nominal)} V. F( E~ ) ..... = (Preposition, Gerund, Nominal) = (in1, developing, effective,..., in, the, country) 7\"4 = (in3, finding, the, best, ways, of, applying, them)","paragraphs":["The"]},{"title":"and5","paragraphs":["in (21) can be analyzed as the same way. 44 (21) Use extreme care when using cleaning solvents"]},{"title":"like1","paragraphs":["acetone and methyl ethyl ketone which are highly"]},{"title":"flammable2","paragraphs":["and shall be"]},{"title":"used3","paragraphs":["in areas"]},{"title":"with4","paragraphs":["adequate fire extinguishing devices"]},{"title":"and5 free6","paragraphs":["of ignition sources."]},{"title":"G(}/V) = {like1, flammable2, used3, with4, free6} f(~Tl)ma~ -- (NominalPostmodi fier) E. = (with4, adequate, fire, extinguishing, devices) n = (free6, of, ignition, sources)","paragraphs":["5 Empirical results on the MT system 5.1 MT configuration The model was incorporated as a balance matching module into the PIVOT English-Japanese MT system as shown in Figure.l(Muraki, 1986; Okumura et al., 1987; Okumura et al., 1991). The system works for a practical use together with the dictionary of 100,000 words.","The input sentences, represented by the list of the feature sets based on the results of the morphological analysis, are transferred to the balance matching module. The module produces the conjunct scope information as well as the results of the balance matching. The syntactic-semantic analysis module analyzes the sentences according to this top-down information. After the analysis, the conceptual analysis module creates an interlingua representation. From the interlingua, output sentences are generated(Muraki, 1986; Okumura et al., 1991). 5.2 Effects of the model When 15,000 conjunctive sentences in the technical reports and manuals were translated apart from the analyzed 10,000 sentences, the following effects are confirmed about the model.","1. Reduction of the analysis cost: This model provides the correct top-down information about the conjunct scopes for about 75~0 of the sentences, which result in the accurate and effective syntactic analysis. Most of the sentences had required backtracking for the analysis without the model. The backtracking is almost all suppressed by the model.","2. Improvement of the word disambiguation: The results of the balance matching improve word disambiguation and the inferences of the unknown words, because the ambiguities of each word are intersected by the counterparts of the symmetric list. The results provide top-down information for the analysis of the ambiguous words and unknown words, as in (8). Most of the sentences contained some word ambiguities and one sixth contained unknown words. By using the top-down information, the accuracy was twice better improved. . . Interpretation of the ellipses: The model makes it easy to interpret the elided elements, because the balance matching results can suggest the missing elements. In sentences such as (1), T~ is completely included £:. The differences of £: and 7~ complement the missing elements. Robust analysis: The model helps make the system robust because the balance matching operation is based on the three different kinds of features. In the MT domain of technical reports and manuals, there are some unknown words as well as some ambiguous words as in (6),(7) and (8). Robustness is achieved because the morphological features are considered as well as the other features. 5.3 Discussions To increase the accuracy, the model is improved from three points:","• Lexical disambiguation: The model is based on lexical information. Therefore, when many words provide too many feature ambiguities, the model cannot always determine a correct structure. In order to solve this problem, filtering rules are applied to the sentence before the balance matching operation. The rules are local constraint rules, which checks the two or three words before a focused word to remove some ambiguities of the focused word. The filtering rules improve the model.","• Weight optimization: The weights for each feature set are manually assigned based on 300 patterns. They should be more appropriately assigned as real values instead of binary values according to the domain and text styles. We have developed a learning method for the feature structures(Okumura et al., 1992). The method is applicable for determining the weights according to the input patterns.","• Semantic calculation: Some conjunctive structures should be analyzed by the more subdivided semantic features and semantic similarity calculation. We are introducing some semantic taxonomy and the semantic distance measurement algorithm(Knight, 1993; Okumura and Hovy, 1994; Resnik, 1993). 6 Conclusion The authors propose an English coordinate structure analysis model, which provides top-down scope information of the correct syntactic structure by taking advantage of the symmetric patterns of the parallelism.","This model was practically implemented and incorporated into the PIVOT English-Japanese MT system with the dictionary of 100,000 words. The model provided about 75% accuracy, which lead to 45 input sentences ) I morphological [_J syntactic-semantic"]},{"title":"I","paragraphs":["analysis I \"1 analysis I"]},{"title":"T [ balance matching module I","paragraphs":["output sentences )"]},{"title":"I conceptual ~interlingua ~","paragraphs":["sentence ' analysis generation Figure 1: A MT system configuration including the balance matching module robust analysis for the MT system, as well as helping make rule-based analysis effective. In the future, we plan to improve the model according to the \"above discussion, and also to extend the analysis to other conjunctions and prepositions. 7 Acknowledgments The authors thank Eduard Hovy and Kevin Knight of USC/ISI for their precious comments. References R.. Beaugrande and W. Dressier. 1981."]},{"title":"INTRO-D UCTION TO TEXT LING UISTICS.","paragraphs":["Longman Group Limited, Harlow, Essex.","S.A. Blackwell. 1981. Processing conjunctions in an atn parser. Technical report, University of Cambridge. Unpublished M.Phil. Dissertation.","B.K Boguraev, K. Sparck-Jones, and Y.(eds) Wilks, editors. 1983."]},{"title":"Recognizing Conjunctions within the ATN Framework.","paragraphs":["Ellis Horwood.","S. Fong and R.C. Berwick. 1985. New approaches to parsing conjunctions using prolog. In"]},{"title":"Proceedings of the 23rd A CL Conference,","paragraphs":["Chicago. G. Gazdar. 1981."]},{"title":"Unbounded Dependencies and Coordinate Structure.","paragraphs":["X. Huang. 1983. Dealing with conjunctions in a machine translation environment. In"]},{"title":"Proceedings of European A CL Conference.","paragraphs":["X. Huang. 1984. Dealing with conjunctions in a machine translation environment. In"]},{"title":"Proceeding of COLING84.","paragraphs":["Kevin Knight. 1993. Building a large ontology for machine translation. In"]},{"title":"Proceedings of the ARPA Human Language Technology Workshop,","paragraphs":["Princeton, New Jersey. AR.PA.","D. Kosy. 1986. Parsing conjunctions deterministically. In"]},{"title":"Proceedings of the 24th A CL Conference.","paragraphs":["S. Kurohashi and M. Nagao. 1992. Dynamic programming method for analyzing conjunctive structures in japanese. In"]},{"title":"Proceedings of COLING-#P,","paragraphs":["August.","L. Lesmo and P Torasso. 1985. Analysis of conjunctions in a rule-based parser. In"]},{"title":"Proceedings of the 23rd A CL Conference,","paragraphs":["Chicago.","K. Muraki. 1986. Venus: Two-phase machine translation system."]},{"title":"Future Generations Computer Systems 2.","paragraphs":["S. Niimi, Y. Suwa, J Tsujii., and .M Nagao. 1986. Coordinate sentences by mu-project english analysis grammar. In"]},{"title":"Proceedings of Information Processing Society of Japan.","paragraphs":["in Japanese.","A. Okumura and E. Hovy. 1994. Building a japanese dictionary associated with an ontology for machine translation. In"]},{"title":"ARPA Human Language Technology Workshop.","paragraphs":["A. Okumura, S. Kamei, and K. Muraki. 1987. English coordinate structure analysis. In"]},{"title":"Proceedings of Information Processing Society of Japan,","paragraphs":["September. in Japanese.","A. Okumura, K. Muraki, and S. Akamine. 1991. Multi-lingual sentence generation from the pivot interlingua. In"]},{"title":"Proceedings of MT SUMMIT III,","paragraphs":["July.","A. Okumura, K. Muraki, and K. Yamabana. 1992. A pattern-learning based, hybrid model for the syntactic analysis of structural relationships among japanese clauses. In"]},{"title":"Proceeding of Fourth International Conference on the Theoretical and Methodological Issues in Machine Translation,","paragraphs":["June.","P. Resnik. 1993. Semantic classes and syntactic ambiguity. In"]},{"title":"Proceedings of ARPA lILT Workshop.","paragraphs":["P. Schachter. 1977."]},{"title":"Constraints On Coordination. .","paragraphs":["Y. Shinoda. 1981."]},{"title":"TECHNICAL ENGLISH.","paragraphs":["Nagumodou, Tokyo Japan. in Japanese. 46"]}],"references":[],"cites":[{"style":0,"text":"Lesmo and Torasso, 1985","origin":{"pointer":"/sections/1/paragraphs/1","offset":704,"length":23},"authors":[{"last":"Lesmo"},{"last":"Torasso"}],"year":"1985","references":[]},{"style":0,"text":"Gazdar, 1981","origin":{"pointer":"/sections/1/paragraphs/1","offset":729,"length":12},"authors":[{"last":"Gazdar"}],"year":"1981","references":[]},{"style":0,"text":"Schachter, 1977","origin":{"pointer":"/sections/1/paragraphs/1","offset":743,"length":15},"authors":[{"last":"Schachter"}],"year":"1977","references":[]},{"style":0,"text":"Kosy, 1986","origin":{"pointer":"/sections/1/paragraphs/1","offset":924,"length":10},"authors":[{"last":"Kosy"}],"year":"1986","references":[]},{"style":0,"text":"Fong and Berwick, 1985","origin":{"pointer":"/sections/1/paragraphs/1","offset":936,"length":22},"authors":[{"last":"Fong"},{"last":"Berwick"}],"year":"1985","references":[]},{"style":0,"text":"Huang, 1984","origin":{"pointer":"/sections/1/paragraphs/1","offset":960,"length":11},"authors":[{"last":"Huang"}],"year":"1984","references":[]},{"style":0,"text":"Boguraev et al., 1983","origin":{"pointer":"/sections/1/paragraphs/1","offset":973,"length":21},"authors":[{"last":"Boguraev"},{"last":"al."}],"year":"1983","references":[]},{"style":0,"text":"Blackwell, 1981","origin":{"pointer":"/sections/1/paragraphs/1","offset":996,"length":15},"authors":[{"last":"Blackwell"}],"year":"1981","references":[]},{"style":0,"text":"Niimi et al., 1986","origin":{"pointer":"/sections/1/paragraphs/1","offset":1013,"length":18},"authors":[{"last":"Niimi"},{"last":"al."}],"year":"1986","references":[]},{"style":0,"text":"Beaugrande and Dressier, 1981","origin":{"pointer":"/sections/1/paragraphs/2","offset":276,"length":29},"authors":[{"last":"Beaugrande"},{"last":"Dressier"}],"year":"1981","references":[]},{"style":0,"text":"Shinoda, 1981","origin":{"pointer":"/sections/1/paragraphs/2","offset":307,"length":13},"authors":[{"last":"Shinoda"}],"year":"1981","references":[]},{"style":0,"text":"Kurohashi and Nagao, 1992","origin":{"pointer":"/sections/1/paragraphs/2","offset":430,"length":25},"authors":[{"last":"Kurohashi"},{"last":"Nagao"}],"year":"1992","references":[]},{"style":0,"text":"Kosy, 1986","origin":{"pointer":"/sections/2/paragraphs/0","offset":66,"length":10},"authors":[{"last":"Kosy"}],"year":"1986","references":[]},{"style":0,"text":"Huang, 1983","origin":{"pointer":"/sections/2/paragraphs/0","offset":78,"length":11},"authors":[{"last":"Huang"}],"year":"1983","references":[]},{"style":0,"text":"Niimi et al., 1986","origin":{"pointer":"/sections/2/paragraphs/0","offset":91,"length":18},"authors":[{"last":"Niimi"},{"last":"al."}],"year":"1986","references":[]},{"style":0,"text":"Muraki, 1986","origin":{"pointer":"/sections/42/paragraphs/0","offset":177,"length":12},"authors":[{"last":"Muraki"}],"year":"1986","references":[]},{"style":0,"text":"Okumura et al., 1987","origin":{"pointer":"/sections/42/paragraphs/0","offset":191,"length":20},"authors":[{"last":"Okumura"},{"last":"al."}],"year":"1987","references":[]},{"style":0,"text":"Okumura et al., 1991","origin":{"pointer":"/sections/42/paragraphs/0","offset":213,"length":20},"authors":[{"last":"Okumura"},{"last":"al."}],"year":"1991","references":[]},{"style":0,"text":"Muraki, 1986","origin":{"pointer":"/sections/42/paragraphs/1","offset":509,"length":12},"authors":[{"last":"Muraki"}],"year":"1986","references":[]},{"style":0,"text":"Okumura et al., 1991","origin":{"pointer":"/sections/42/paragraphs/1","offset":523,"length":20},"authors":[{"last":"Okumura"},{"last":"al."}],"year":"1991","references":[]},{"style":0,"text":"Okumura et al., 1992","origin":{"pointer":"/sections/42/paragraphs/5","offset":288,"length":20},"authors":[{"last":"Okumura"},{"last":"al."}],"year":"1992","references":[]},{"style":0,"text":"Knight, 1993","origin":{"pointer":"/sections/42/paragraphs/6","offset":239,"length":12},"authors":[{"last":"Knight"}],"year":"1993","references":[]},{"style":0,"text":"Okumura and Hovy, 1994","origin":{"pointer":"/sections/42/paragraphs/6","offset":253,"length":22},"authors":[{"last":"Okumura"},{"last":"Hovy"}],"year":"1994","references":[]},{"style":0,"text":"Resnik, 1993","origin":{"pointer":"/sections/42/paragraphs/6","offset":277,"length":12},"authors":[{"last":"Resnik"}],"year":"1993","references":[]}]}
