{"sections":[{"title":"A robust category guesser for Dutch medical language Peter","paragraphs":["Spyns Katholieke Universiteit Leuven University Hospital Gasthuisberg Division of Medical Informatics Herestraat 49, B-3000 Leuven"]},{"title":"peter©uz, kuleuven, ac. be Abstract","paragraphs":["In this paper, we want to describe the architecture and some of the implementation issues of a large scale category guesser for Dutch medical vocabulary. We Mso provide numerical data on the precision and coverage of this category guesser, which has to cover for the moment only the vocabulary of the cardiology domain. The category guesser uses non-morphologic information (endstring matching) as well as truly morphologic knowledge (inflection, derivation and compounding). Since we deal with a sublanguage some linguistic features are easier to handle (Grishman and Kittredge, 1986), (Sager et al., 1987). Subsequently we will describe in detail the differents parts which interact to successfully identify unknown medical words. 1 Introduction 1.1 NLP in medicine Medical patient reports consists mainly of free text, combined with results of various laboratories. While numerical data can easily be stored and processed for archiving and research purposes, free text is rather difficult to be treated by computer, although it contains the most relevant information. Several authors put forward the hypothesis that Natural Language Processing (NLP) and Knowledge Representation (KR) of medical discharge summaries have become the key-issues in the domMn of intelligent medical information processing (Baud et al., 1992), (Gabrieli and Speth, 1987), (McCray, 1991). However, only a few NLP-driven systems have actually been implemented (Friedman and Johnson, 1992) . For Dutch, a limited prototype has been developed (Spyns, 1991), (Spyns and Adriaens, 1992). A broader system covering a larger part of the Dutch grammar and medical vocabulary is currently under development•","150 This activity forms part of the MENELAS-project 1 • This project comprises a morphological, syntactic, semantic and pragmatic analysis of the medical sublanguage for Dutch, English and French (Spyns et al., 1992). The project also focuses on Knowledge Representation (by means of Conceptual Graphs) (Sowa, 1984), (Volot et al., 1993) and Production Systems (Bouaud and Zweigenbaum, 1992).","1.2 The Category Guesser for Dutch Medical Language This paper focuses on the morphological and lexical component of the system, which is a combination of a database application and a Prolog rule interpreter. This component is already functioning and is used continuously during the current extension of the coverage of the Dutch grammar (Spyns et al., 1993). The importance of morphologic analysis of medical vocabulary has been widely recognised (Wingert, 1985), (Wolff, 1984), (Dujols et al., 1991), (Pacak and Pratt, 1969) (Pacak and Pratt, 1978), (Norton, 1983)•","In the following sections, we will describe the different parts which interact to identify the word forms of a given sentence• The various stages of the analysis of the word forms are described• A major distinction can be made between forms \"known by the system\" (= stored in the dictionary cf. section 2) and unknown forms whose linguistic characteristics need to be computed and are hypothetical. The latter can be based on morphologic knowledge (section 3) or other heuristics (sections 4, 5 ~z 6). Each section is illustrated by an example or some implementation details. A schematic overview of the architecture of the category guesser is presented in section 7. The subsequent section (8) is devoted to the evaluation, which will guide the further elaboration of the here described category guesser. The paper ends with a conclusion and discussion (section 9).","1The MENELAS-project (AIM #2023) is financed by the Directorate General XIII of the European Community (Zweigenbaum and others, 1991). [lex:geprobeerd,nllu:geprobeerd,cat:n,nb:sing,pers:3] [lex:geprobeerd,nl~u:geprobeerd,cat:adj,adjtype:ord,adj~:no]"]},{"title":"[lex:geprobeerd,nllu:proberen,cat:v,pers:nil,nb:nil,tense:nil,vform:pastpart] [lex:geprobeerd,nllu:proberen,cat:adj,adjtype:papa,adj~:no] [~ex:gepr~beerd~n~u:gepr~beerden~ca~:v~pers:ni~nb:ni~tense:ni~vf~rm:pastpart] [lex:geprobeerd,nllu:geprobeerden,cat:adj,adjtype:papa,adj~:no] [lex:geprobeerd,nllu:geproberen,cat:adj ,adjtype:papa,adj~:no] [lex:geprobeerd,nllu:geprobeerden,cat:v,pers:1,nb:sing,tense:pres,vform:finite]","paragraphs":["Figure 1: Example of Cohort for \"geprobeerd\" 2 Full Form Dictionary The lexical database for Dutch was built using several resources: an existing electronic valency dictionary and a list of words extracted from a medical corpus (cardiology patient discharge summaries). The already existing electronic dictionary (resulting from the K.U. Leuven PROTON-project (Dehaspe and Van Langendonck, ) and the newly coded entries were converted and merged into a common representation in a relational database (Dehaspe, 1993).","It is intended to use the category guesser (cf. infra) as little as possible. To that extent, the dictionary is conceived as a full-form dictionary. Currently, there are some 100.000 full forms in the lexical database (which is some 8000 non inflected forms). However, since an exhaustive dictionary is an unrealistic assumption, a category guesser handles all the unknown word forms.","The unknown words trigger a set of rules to identify the surface form, to attribute syntactic categories to it, and to calculate the possible canonical form(s). The category guesser can also enhance the robustness of the larger NLP-system since misspelled words can receive, to a certain extent, correct syntactic features. To reach this aim, the category guesser combines morphologic (3) as well as non morphologic knowledge (sections 4 & 6). 3 Morphological Analysis 3.1 Preliminary Remarks The morphological analyser consists mainly of three sections, which correspond more or less to the three linguistic operations on words: inflection, derivation and compounding. However, from an implementational point of view, the boundaries between derivation and compounding are defined in a different way. The compounds, created by agglutination or combined by means of a hyphen are computationally treated as non-compounds. This implies that the same segmentation routine can be used for the computation of derivations and monolithical compounds (Spyns and De Wachter, 1995)."]},{"title":"151 3.2 Inflection","paragraphs":["The inflection analyser produces one or more bundles of morphosyntactic feature value pairs for each submitted surface form (= cohort). The generated feature bundles comprise, among other features, the surface form (lex), the supposed canonical form (nlAu) as well as its category (cat) 2 A reduced example of the cohort produced for \"geprobeerd\" (Eng.: \"tried\")follows (see figure 1).","The initial cohort will later on be reduced as much as possible (the ideal result in most cases being a single feature bundle). Therefore, a cascading priority system has been defined. The attribute \"mort\" expresses the quality of the analysis, possible values being segm, suffix, string or guess with segm > suffix > string > guess. More details on this will be given below.","Only the feature bundles of supposed nouns, verbs, adjectives and adverbs (i.e. the open categories) are admitted in the initial set of hazardous analyses or cohort. 3.3 Segmentation Derivation and monolithical compounding are used to try and identify as many as possible of the canonical forms computed by the inflectional analyser. The starting principle here is that the right part of the computed canonical form usually constitutes the grammatical head of the whole word. The whole word thus inherits the feature-bundle associated with its right part (Selkirk, 1982, p.150) 3","In opposition to William (Williams, 1983) & Selkirk (Selkirk, 1982), we do not allow inflectional suffixes to be heads. The right part can be found in the dictionary (monolithical compounding) or in a list of suffixes (derivation). In the current segmentation program, the major part of this list contains medical suffixes, which constitute a clearly definable","2v for verbs, adj for adjectives and n for noun; others are nb [sing or phr] for number, pers [1, 2, 3 or nil] for person.","3We are fully aware that linguistic reality is more complex: e.g. some derivations (f.i. Dutch diminutifs cf. (Ritchie et al., 1992)) are regarded as left headed. Maybe they should be treated computationally by the inflectional analyser. set that is fairly regular in its (morphological and syntactic) behaviour (Dujols et al., 1991). Below (see figure 2) one can find an extract of the suffix list. suffix ( [a, r, i, s], [cat : adj, nb: sing] ). suffix ( [a, a, 1], [cat : adj,nb : sing] ). suff ix ( [i, e] , [cat : n, nb: s in~ ). Figure 2: Examples of Suffixes with Feature Bundle","The computed canonical form is scanned and segmentated from right to left. All possible solutions are generated by a failure driven loop (no exclusive longest match principle). The segmentation routine which tries to identify a right part (head:dict or head:suffix) and then tries to recognize the remaining left part. If this succeeds, the segmentation is complete (morf:segm). Otherwise, it is only partial (morf: suffix).","At the moment, only noun noun compounds are treated. Many medical noun noun compounds combine a medical non head part with a non medical head part (fi. hartziekte- Eng.: heartdisease).","Only those feature bundles of the cohort are kept that are compatible (by means of graph-unification) with the feature bundle associated with the head part (suffix or dictionary entry). At this stage of filtering, the feature cat (syntactic category) plays a most prominent role."]},{"title":"4 Endstring Matching","paragraphs":["When nothing can be predicted by means of morphology, another heuristic will be applied to reduce the set of remaining possible morphological analyses. This stage will focus more on the general language words. It is based on a series of endstrings (not limited by morphological boundaries) which determine the category of a word. Only the open syntactic classes are taken into account (noun, verb, adjective and adverb). Some endstrings uniquely identify the category of a word while others are more equivocal. The latter are correlated with two or even three categories. The necessary linguistic knowledge to build a list of non-inflected endstrings and their associated category (or categories) was found in Lemmens (Lemmens, 1989). Some combinations of an endstring and its category are shown below (see figure"]},{"title":"3).","paragraphs":["When a computed lexical form is presented to the endstring matcher, the above mentioned list is checked to see if an endstring constitutes the endpart of the submitted word. In fact, the surface form as well as the hypothetical canonical form of the feature bundle are submitted to the endstring matcher. Only the categories resulting of both matching processes (= the intersection) are finally retained. Sub-152 end( [d, r, e, e ] -3, [v, adj], [eerd] ). end([1,e,e,il.3 , [adj ,n] , [ieel]). end([l,e,il-3 , [adj] , [iel]). end( [e ,m, s, i 1-3 , [n] , [isme] ) . Figure 3: Some endstring-category combinations sequently, the feature bundle(s) of the cohort containing the proposed syntactic category are extended with an extra featurevaluepair (morf:string). Below (see figure 4) the result of endstring matching applied to the verb \"geprobeerd\" (Eng.: \"tried\") is shown (rule with ending -eerd applies) 4","The inflection rules were able to produce a canonical form together with its category which the endstring matcher considers correct. This implies that the inflection rule was correctly triggered and applied. As a corollary, the other syntactic information in such a validated feature bundle (with morf:string) is supposed to be correct as well. However, many syntactic features are underspecified 5"]},{"title":"5 Default or Catch All Rule","paragraphs":["If none of the aforementioned cases apply, the computed canonical forms and its corresponding grammatical features are pure guesses. The complete cohort is retained and each of its feature bundles is extended with one extra feature morf: guess."]},{"title":"6 Final selection of the set of solutions","paragraphs":["After the stages mentioned above, only a subset of feature bundles of the cohort will contain the feature morf. All of these feature bundles contain morphosyntactic information that is validated by the mentioned heuristics (cf. supra) 6 This subset is retained and passed to the syntactic parser. When segmentations of both types (complete versus partial) are produced, the latter (morf:suffix) are discarded in favour of the former (morf:segm). In that case, endstring matching nor the catch all rule is applied."]},{"title":"7 Schematic Overview","paragraphs":["Below, one can find a more formal description and a schematic overview (see figure 5) of the category guesser.","4We assume of course that the verb does not appear in the dictionaries.","5The Syntactic analyser requires the presence of some linguistic features -- even when underspecified -- in the feature bundle.","SWhen the default rule applied, the subset will be identical to the complete cohort. Validation is a too strong word in this case."]},{"title":"[lex:geprobeerd,cat:adj,nllu:proberen,adjtype:papa,adj~:no,morf:string] [lex:geprobeerd,cat:adj ,nllu:geproberen,adjtype:papa,adj~:no,morf:string] [lex:geprobeerd,cat:v,nllu:proberen,vform:pastpart,vtype:main,morf:string] [lex:geprobeerd,cat:v,nllu:geproberen,vform:pastparZ,vtype:main,morf:string]","paragraphs":["Figure 4: Endstring Matching Applied to \"geprobeerd\" Input: Data : Functioh: [lex:W] the unknown surface form W FDAG: the linguistic information (feature bundle) associated with F FDAG = [nl_lu:W', cat:x, nb:y, ...] DDAG: the dictionary entry of a canonical form W' DDAG = [nl_lu:W', cat:x, frame:z, ... ] EDAG: the linguistic information (feature bundle) associated with an endmorpheme EDAG = [cat:x, head:dict,...] or EDAG = [cat:x, head:suffix,...] RDAG: the category provided by the endstringmatcher RDAG = [cat:x] ~\" : maps W to a hypothetical canonical form W' (inflection rule) H : unifies two feature bundles 81: segmentates W' in a left part (L) and endmorpheme (E)"]},{"title":"82:","paragraphs":["segmentates L in several morphemes (L1,..., L,) [lex:W]"]},{"title":"1","paragraphs":["no"]},{"title":", [ ?(F:","paragraphs":["[lex:W]--* [nl/u:W']) ] yes DAG= [lex:W] U FDAG","I ?((S,: W'--*LE) and (DAG U EDAG)) ] yes no DAG U EDAG = DAG'"]},{"title":"no \" I ?($2: L--~ L1,..., L,) [ !","paragraphs":["DAG' U [morf:suflix] yes I DAG' U [morf:segm] I ?(DAG"]},{"title":"U","paragraphs":["RDAG) I \" no yes DAG U [morf:guess] DAG U [morf:string] Figure 5: The High Level Algorithm"]},{"title":"153 8 Some Results and Statistics","paragraphs":["To examine the effectiveness of the category guesser, all the words from the corpus not appearing in the dictionary were submitted to the analyser. The to-tal number of unknown words was 2832. Manual categorisation revealed the presence of 679 adjectives, 2056 nouns, 82 verbs. The 2832 unique unknown forms lead to the generation of 6342 supposed analyses, which means that for every unknown form 2.4 possible canonical forms are retained. We consider the case when an unknown surface form receives more than two different categories as a guess. Guesses are always interpreted as bad. If the category guesser is not able to attribute a correct category, the result is regarded as bad. Once a correct category, even concurrently with an incorrect one, is assigned to the submitted word, the outcome is perceived as good. 7 As the main concern lies with the syntactic characteristics, we did not consider an erroneously calculated canonical form as a reason to reject the complete feature bundle. Manual examination of the results permits us to state that 83.4 % of the unknown forms are correctly identified. We consider the result as fairly good and are convinced that refinements can lead to an even better result. The linguistic coverage can be still be improved by adding rules in order to treat comparatives and superlatives."]},{"title":"9 Discussion","paragraphs":["A choice was to be made between keeping more potential analyses likely to be correct versus restrict-ing the cohort to one (or a limited set of) analysis which may be incorrect. As a general strategy, we prefer to restrict as early as possible the search space on all the levels of the language understanding system. Otherwise useless hypotheses will be propagated through the whole system causing a combinatorial explosion. However, this attitude can lead to the rejection of valid solutions and, in the worst case, can be responsible for a complete failure of the language understanding system.","A possible optimisation resides in the storage of the medical suffixes and endstrings in their inflected forms. They could be integrated in the already existing full form dictionary. In order to accelerate the decomposition phases, the morphemes or strings could be stored in reversed order.","These reorganisations of the data structures also influence the high level algorithm (cf. section 7). Since all the words, suffixes and endstrings would be stored in the database as full forms, the inflectional analyser (cf. section 3.2) would be merely needed for","7Sometimes the surface form alone does not permit an unequivocal categorization (f.i. in principle, a Dutch noun formally equals the first person singular present of a regular verb). the computation of a hypothetical canonical form and its syntactic characteristics when applying the catch all rule. This leads without any doubt to a faster execution of the category guesser as a whole. As a corollary, the overall architecture of the entire component becomes simpler and more homogeneous."]},{"title":"References","paragraphs":["R.H. Baud, A.-M. Rassinoux, and J.R. Scherrer. 1992. Natural language processing and semanti-cal representation of medical texts. Methods of Information in Medicine, 31:117- 125.","J. Bouaud and P. Zweigenbaum. 1992. A reconstruction of conceptual graphs on top of a production system. In Proceedings of the 7th Annual Workshop on Conceptual Graphs, Las Cruces.","L. Dehaspe and W. Van Langendonck. Automated valency dictionary of Dutch verbs, to appear.","L. Dehaspe. 1993. Menelas report on the building of the lexical database. Technical Report 93-002, K.U. Leuven- Dept. of Medical Informatics.","P. Dujols, P. Aubas, C. Baylon, and F. Gr4my. 1991. Morphosemantic analysis and translation of medical compound terms. Methods of Information in Medicine, 30:30 - 35.","C. Friedman and S.B. Johnson. 1992. Medical text processing: Past achievements, future directions. In M.J. Ball and M.F. Collen, editors, Aspects of the Computer-based Patient Record, pages 212 - 228. Springer - Verlag, Berlin.","E.R. Gabrieli and D.J. Speth. 1987. Computer processing of discharge summaries. In Proceedings of SCAMC 87, pages 137 - 140.","R. Grishman and R. Kittredge. 1986. Analyz-ing Language in Restricted Domains: Sublanguage Description and Processing. Lawrence Erlbaum Associates, Hillsdale, New Jersey.","M. Lemmens. 1989. A critical study of the defaulters in the Belgian METAL-system ©, and a design of a morphologically guided category guesser. Master's thesis, K.U.Leuven. [in Dutch].","A.T. McCray. 1991. Natural languageprocessing for intelligent information retrieval. In J.H. Nagel and W.M. Smith, editors, Proceedings of the Annual International Conference of the IEEE Engineering in Medicine and Biology, pages 1160 - 1161, Orlando.","M.G. Norton, L.M. & Pacak. 1983. Morphosemantic analysis of compound word forms denot-ing surgical procedures. Methods of Information in Medicine, 22(1):29 - 36.","M.G. Pacak and A.W. Pratt. 1969. Identifica-tion and transformation of terminal morphemes 154 in medical English (part 1)."]},{"title":"Methods of Information in Medicine,","paragraphs":["8(2):84 - 90.","M.G. Pacak and A.W. Pratt. 1978. Identifica-tion and transformation of terminal morphemes in medical English (part 2)."]},{"title":"Methods of Information in Medicine,","paragraphs":["17(2):95 - 100.","G.D. Ritchie, G.J. Russell, A.W. Black, and S.G. Pulman. 1992."]},{"title":"Computational Morphology: Practical Mechanisms for the English Lexicon.","paragraphs":["MIT Press. N. Sager, C. Friedman, and M. Lyman. 1987."]},{"title":"Medical Language Processing: Computer Management of Narrative Data.","paragraphs":["Addison Wesley, Reading, Massachussets. E. Selkirk. 1982."]},{"title":"The Syntax of Words.","paragraphs":["MIT Press. J.F. Sowa. 1984."]},{"title":"Conceptual Structures: Information Processing in Mind and Machine.","paragraphs":["Addison-Wesley, London.","P. Spyns and G. Adriaens. 1992. Applying and improving the restriction grammar approach for Dutch patient discharge summaries. In"]},{"title":"Proceedings of COLING 92,","paragraphs":["pages 1164 - 1168.","P. Spyns and L. De Wachter. 1995. Morphological analysis of Dutch medical compounds and derivations."]},{"title":"ITL Review of Applied Linguistics.","paragraphs":["to appear.","P. Spyns, P. Zweigenbaum, and J.L. Willems. 1992. Representation and extraction of information from patient discharge summaries by means of natural langage processing. In"]},{"title":"Proceedings of MIC92,","paragraphs":["Rotterdam. [in Dutch].","P. Spyns, L. Dehaspe, and J.L. Willems. 1993. The Menelas syntactic analysis component for Dutch. Delivrable report AIM-Menelas #6.","P. Spyns. 1991. A prototype of a semi-automated encoder for medical discharge summaries. Master's thesis, K.U. Leuven. [in Dutch].","F. Volot, P. Zweigenbaum, B. Bachimont, M. Ben Said, J. M., Bouaud, M. Fieschi, and J.F. Boisvieux. 1993. Structuration and acquisition of medical knowledge (using UMLS in the conceptual graph formalism). In"]},{"title":"Proceedings of SCAMC 93.","paragraphs":["E. Williams. 1983. On the notions 'lexically related' and 'head of a word'."]},{"title":"Linguistic Inquiry.","paragraphs":["F. Wingert. 1985. Morphologic analysis of compound words."]},{"title":"Methods of Information in Medicine,","paragraphs":["24:155- 162.","S. Wolff. 1984. The use of morphosemantic regular-ities in the medical vocabulary for automatic lexical coding."]},{"title":"Methods of Information in Medicine,","paragraphs":["23:195 - 203.","P. Zweigenbanm et at. 1991. AIM project #2023 technical annex: An access system for medical records using natural language, manuscript. 155"]}],"references":[{"authors":[{"first":"R.","middle":"H.","last":"Baud"},{"first":"A.","middle":"-M.","last":"Rassinoux"},{"first":"J.","middle":"R.","last":"Scherrer"}],"year":"1992","title":"Natural language processing and semanti-cal representation of medical texts","source":"R.H. Baud, A.-M. Rassinoux, and J.R. Scherrer. 1992. Natural language processing and semanti-cal representation of medical texts. Methods of Information in Medicine, 31:117- 125."},{"authors":[{"first":"J.","last":"Bouaud"},{"first":"P.","last":"Zweigenbaum"}],"year":"1992","title":"A reconstruction of conceptual graphs on top of a production system","source":"J. Bouaud and P. Zweigenbaum. 1992. A reconstruction of conceptual graphs on top of a production system. In Proceedings of the 7th Annual Workshop on Conceptual Graphs, Las Cruces."},{"authors":[],"source":"L. Dehaspe and W. Van Langendonck. Automated valency dictionary of Dutch verbs, to appear."},{"authors":[{"first":"L.","last":"Dehaspe"}],"year":"1993","title":"Menelas report on the building of the lexical database","source":"L. Dehaspe. 1993. Menelas report on the building of the lexical database. Technical Report 93-002, K.U. Leuven- Dept. of Medical Informatics."},{"authors":[{"first":"P.","last":"Dujols"},{"first":"P.","last":"Aubas"},{"first":"C.","last":"Baylon"},{"first":"F.","last":"Gr4my"}],"year":"1991","title":"Morphosemantic analysis and translation of medical compound terms","source":"P. Dujols, P. Aubas, C. Baylon, and F. Gr4my. 1991. Morphosemantic analysis and translation of medical compound terms. Methods of Information in Medicine, 30:30 - 35."},{"authors":[{"first":"C.","last":"Friedman"},{"first":"S.","middle":"B.","last":"Johnson"}],"year":"1992","title":"Medical text processing: Past achievements, future directions","source":"C. Friedman and S.B. Johnson. 1992. Medical text processing: Past achievements, future directions. In M.J. Ball and M.F. Collen, editors, Aspects of the Computer-based Patient Record, pages 212 - 228. Springer - Verlag, Berlin."},{"authors":[{"first":"E.","middle":"R.","last":"Gabrieli"},{"first":"D.","middle":"J.","last":"Speth"}],"year":"1987","title":"Computer processing of discharge summaries","source":"E.R. Gabrieli and D.J. Speth. 1987. Computer processing of discharge summaries. In Proceedings of SCAMC 87, pages 137 - 140."},{"authors":[{"first":"R.","last":"Grishman"},{"first":"R.","last":"Kittredge"}],"year":"1986","title":"Analyz-ing Language in Restricted Domains: Sublanguage Description and Processing","source":"R. Grishman and R. Kittredge. 1986. Analyz-ing Language in Restricted Domains: Sublanguage Description and Processing. Lawrence Erlbaum Associates, Hillsdale, New Jersey."},{"authors":[{"first":"M.","last":"Lemmens"}],"year":"1989","title":"A critical study of the defaulters in the Belgian METAL-system ©, and a design of a morphologically guided category guesser","source":"M. Lemmens. 1989. A critical study of the defaulters in the Belgian METAL-system ©, and a design of a morphologically guided category guesser. Master's thesis, K.U.Leuven. [in Dutch]."},{"authors":[{"first":"A.","middle":"T.","last":"McCray"}],"year":"1991","title":"Natural languageprocessing for intelligent information retrieval","source":"A.T. McCray. 1991. Natural languageprocessing for intelligent information retrieval. In J.H. Nagel and W.M. Smith, editors, Proceedings of the Annual International Conference of the IEEE Engineering in Medicine and Biology, pages 1160 - 1161, Orlando."},{"authors":[{"first":"M.","middle":"G.","last":"Norton"},{"first":"L.","last":"M."},{"last":"Pacak"}],"year":"1983","title":"Morphosemantic analysis of compound word forms denot-ing surgical procedures","source":"M.G. Norton, L.M. & Pacak. 1983. Morphosemantic analysis of compound word forms denot-ing surgical procedures. Methods of Information in Medicine, 22(1):29 - 36."},{"authors":[{"first":"M.","middle":"G.","last":"Pacak"},{"first":"A.","middle":"W.","last":"Pratt"}],"year":"1969","title":"Identifica-tion and transformation of terminal morphemes 154 in medical English (part 1)","source":"M.G. Pacak and A.W. Pratt. 1969. Identifica-tion and transformation of terminal morphemes 154 in medical English (part 1)."}],"cites":[{"style":0,"text":"Grishman and Kittredge, 1986","origin":{"pointer":"/sections/1/paragraphs/0","offset":556,"length":28},"authors":[{"last":"Grishman"},{"last":"Kittredge"}],"year":"1986","references":["/references/7"]},{"style":0,"text":"Sager et al., 1987","origin":{"pointer":"/sections/1/paragraphs/0","offset":588,"length":18},"authors":[{"last":"Sager"},{"last":"al."}],"year":"1987","references":[]},{"style":0,"text":"Baud et al., 1992","origin":{"pointer":"/sections/1/paragraphs/0","offset":1305,"length":17},"authors":[{"last":"Baud"},{"last":"al."}],"year":"1992","references":["/references/0"]},{"style":0,"text":"Gabrieli and Speth, 1987","origin":{"pointer":"/sections/1/paragraphs/0","offset":1326,"length":24},"authors":[{"last":"Gabrieli"},{"last":"Speth"}],"year":"1987","references":["/references/6"]},{"style":0,"text":"McCray, 1991","origin":{"pointer":"/sections/1/paragraphs/0","offset":1354,"length":12},"authors":[{"last":"McCray"}],"year":"1991","references":["/references/9"]},{"style":0,"text":"Friedman and Johnson, 1992","origin":{"pointer":"/sections/1/paragraphs/0","offset":1440,"length":26},"authors":[{"last":"Friedman"},{"last":"Johnson"}],"year":"1992","references":["/references/5"]},{"style":0,"text":"Spyns, 1991","origin":{"pointer":"/sections/1/paragraphs/0","offset":1521,"length":11},"authors":[{"last":"Spyns"}],"year":"1991","references":[]},{"style":0,"text":"Spyns and Adriaens, 1992","origin":{"pointer":"/sections/1/paragraphs/0","offset":1536,"length":24},"authors":[{"last":"Spyns"},{"last":"Adriaens"}],"year":"1992","references":[]},{"style":0,"text":"Spyns et al., 1992","origin":{"pointer":"/sections/1/paragraphs/1","offset":197,"length":18},"authors":[{"last":"Spyns"},{"last":"al."}],"year":"1992","references":[]},{"style":0,"text":"Sowa, 1984","origin":{"pointer":"/sections/1/paragraphs/1","offset":304,"length":10},"authors":[{"last":"Sowa"}],"year":"1984","references":[]},{"style":0,"text":"Volot et al., 1993","origin":{"pointer":"/sections/1/paragraphs/1","offset":318,"length":18},"authors":[{"last":"Volot"},{"last":"al."}],"year":"1993","references":[]},{"style":0,"text":"Bouaud and Zweigenbaum, 1992","origin":{"pointer":"/sections/1/paragraphs/1","offset":362,"length":28},"authors":[{"last":"Bouaud"},{"last":"Zweigenbaum"}],"year":"1992","references":["/references/1"]},{"style":0,"text":"Spyns et al., 1993","origin":{"pointer":"/sections/1/paragraphs/2","offset":339,"length":18},"authors":[{"last":"Spyns"},{"last":"al."}],"year":"1993","references":[]},{"style":0,"text":"Wingert, 1985","origin":{"pointer":"/sections/1/paragraphs/2","offset":449,"length":13},"authors":[{"last":"Wingert"}],"year":"1985","references":[]},{"style":0,"text":"Wolff, 1984","origin":{"pointer":"/sections/1/paragraphs/2","offset":466,"length":11},"authors":[{"last":"Wolff"}],"year":"1984","references":[]},{"style":0,"text":"Dujols et al., 1991","origin":{"pointer":"/sections/1/paragraphs/2","offset":481,"length":19},"authors":[{"last":"Dujols"},{"last":"al."}],"year":"1991","references":["/references/4"]},{"style":0,"text":"Pacak and Pratt, 1969","origin":{"pointer":"/sections/1/paragraphs/2","offset":504,"length":21},"authors":[{"last":"Pacak"},{"last":"Pratt"}],"year":"1969","references":["/references/11"]},{"style":0,"text":"Pacak and Pratt, 1978","origin":{"pointer":"/sections/1/paragraphs/2","offset":528,"length":21},"authors":[{"last":"Pacak"},{"last":"Pratt"}],"year":"1978","references":[]},{"style":0,"text":"Norton, 1983","origin":{"pointer":"/sections/1/paragraphs/2","offset":553,"length":12},"authors":[{"last":"Norton"}],"year":"1983","references":[]},{"style":0,"text":"Dehaspe, 1993","origin":{"pointer":"/sections/2/paragraphs/0","offset":501,"length":13},"authors":[{"last":"Dehaspe"}],"year":"1993","references":["/references/3"]},{"style":0,"text":"Wachter, 1995","origin":{"pointer":"/sections/2/paragraphs/2","offset":1056,"length":13},"authors":[{"last":"Wachter"}],"year":"1995","references":[]},{"style":0,"text":"Selkirk, 1982","origin":{"pointer":"/sections/3/paragraphs/2","offset":556,"length":13},"authors":[{"last":"Selkirk"}],"year":"1982","references":[]},{"style":0,"text":"Williams, 1983","origin":{"pointer":"/sections/3/paragraphs/3","offset":26,"length":14},"authors":[{"last":"Williams"}],"year":"1983","references":[]},{"style":0,"text":"Selkirk, 1982","origin":{"pointer":"/sections/3/paragraphs/3","offset":53,"length":13},"authors":[{"last":"Selkirk"}],"year":"1982","references":[]},{"style":0,"text":"Ritchie et al., 1992","origin":{"pointer":"/sections/3/paragraphs/5","offset":111,"length":20},"authors":[{"last":"Ritchie"},{"last":"al."}],"year":"1992","references":[]},{"style":0,"text":"Dujols et al., 1991","origin":{"pointer":"/sections/3/paragraphs/5","offset":313,"length":19},"authors":[{"last":"Dujols"},{"last":"al."}],"year":"1991","references":["/references/4"]},{"style":0,"text":"Lemmens, 1989","origin":{"pointer":"/sections/4/paragraphs/0","offset":719,"length":13},"authors":[{"last":"Lemmens"}],"year":"1989","references":["/references/8"]}]}
