{"sections":[{"title":"","paragraphs":["ITERATIg-E OPERATIONS Sae Yamada","Notre Dame Seishin University Ifuku-Ch5 2-16-9 700 Okayama, Japan ABSTRACT","We present in this article, as a part of aspectual operation system, a generation system of iterative expressions using a set of operators called iterative operators. In order to execute the iterative operations efficiently, we have classified previously propositions denoting a single occurrence of a single event into three groupes. The definition of a single event is given recursively. The classification has been carried out especially in consideration of the dura-tire / non-durative character of the denoted events and also in consideration of existence / non-existence of a culmination point (or a boundary) in the events. The operations concerned with iteration have either the effect of giving a boundary to an event ( in the case of a non-bounded event) or of extending an event through repetitions. The operators concerned are: N,F .. direct iterative operators; I,G .. boundary giving operators; I .. extending operator. There are direct and indirect operations: the direct ones change a non-repetitious proposition into a repetitious one directly, whereas the indirect ones change it indirectly. The indirect iteration is indicated with",". The scope of each operator is not uniquely definable, though the mutual relation of the operators can be given more or less explicitly. I INTRODUCTION","The system of the iterative operations, which makes a part of aspectual operation system, is based on the assump-tion that the general mechanism of repetition is language independent and can be reduced to a small number of operations, though language expressions of repetition are different from language to language. It must be noticed that even in one language there are usually several means to express repetitious events. We know that \"il lui cognait la t~te contre lemur\" and \"il lui a cogn~ deux ou trois fois la t~te contre lemur\", the examples given by W. Pollak, express the same event. We have also linguistic means for iterative expressions on all linguistic levels: morphological, syntactical, semantic, pragmatic etc. As the general form of repetition we use ~ = (~i~ in which ~ is the whole event, ~ia single occurrence of a single event and* an iteration indicator. For example: : (a series of) explosions took place","93: a single explosion took place : indefinit number of times ~i denotes actually a proposition describing a single event S i. ~ sign will be replaced later by a singIe or complex operator or operators, which operate(s) on ~i-We hope also to be able to give various expressions to the same event and for that purpose we are planning to have a set of interpretation rules. The language mainly concerned is Japanese, but in this article examples are given in French, in English or in German. 2 BASIC CONDITION OF THE ITERATION","The iterative aspect is one of sentential aspect and denotes plural occurrence of an event or an action. The iterative aspect concerns therefore the property of countability. The itera-tire operations give the iterative aspect to a proposition and are concerned with the plurality of occurrences of the event. As we distinguish count nouns (count terms) from non-count nouns (mass terms), we distinguish countable events from non-countable events, or more precisely, the events of which the number of occurrences is countable and those of which the number of occurrences is non-countable. 14 As a count noun has a clear boundary, a countable event also has to have a clear boundary. Countable events are for instance: he opens a window; he reads a book; he kicks a ball etc. Non-countable events are for instance: he swims; he sleeps deeply; he runs fast,etc. Only a countable event can be repeated: he opens three windows; he kicked the ball twice,etc. A n~n-countable event can't be repeated: ~he sleeps twice. The distinction of two kinds of events (and of two kinds of propositions), which also is called telic-atelic, cyclicnon-cyclic or bounded-non bounded distinction\" is therefore necessary for the execution of the iterative operations.","It must be useful to give here some remarks on the terminology. The terms such as 'iterative', 'repetitive', 'frequentative' and 'multiplica-tire' are used very often as synonyms. However there are some works which distinguish them one from the other The term repetitive is used sometimes to indicate only one repetition and the term iterative to indicate more than two repetitions. And sometimes the term iterative is used for one repetition and the term frequentative is used for several repetitions. We use both of the terms 'iterative' and 'repetitive'~ (hence 'iteration' and 'repetition'~as synonyms. In this article 'repetition' means, in most of cases, two or more occurrences of a same event. But in order to prevent a misunderstanding, we rather use the term 'iteration'. A 'proposition' denotes an event and it is a neutral expression in the sense that the tense, aspect and mode operators operate on it. 3 SOME PREVIOUS REMARKS ON ITERATION 3.1 Regular and irregular iteration","Two kinds of iterations are distinguished: regular and irregular iterations, i.e. the iterations which correspond to cardinal count adverbials and the iterations which correspond to frequency adverbials. A regular iteration is defined either by a regular frequency of the occurrence of the event, (called 'fixed frequency' by Stump), or by a constant length of intervals between occurrences.","(I) We ate supper at six o'clock every night last week. (Frequency) The busses started at five-minute intervals. (Interval) I These termes are used by Garey, Bull and Allen respectively. The extreme case of the regular iteration is called 'habitude'.","(2) En ~t~, elle se levait ~ quatre heure s. A regular frequency or a constant interval is indicated by the operator F. An irregular iteration is indicated either with a number of occurrences of an event or with irregular lengths of intervals between occurrences.","(3) Linda called you several times last night. (Frequency) Nous avons entendu le m~me bruit par intervalles. (Interval) Both the numerical indications and the indications of irregular intervals are given with the operator N. 3.2 Repeated constituent of the event","Considering the structure of a repeated event, we can distinguish several forms of repetitions, according as which constituent is affected. If we say,\"She changes her dress several times a day\", it is the object which is affected by the repetition. Using grammatical category-names we can indicate the repeated constituent as the following.","Simple repetition","(4) Subj (Pred)~: Mr. Wells is publishing a novel year by year; L'une apr~s l'autre le pilote v~rifia des chiffrea (Subj Pred~ : People walked across the lawn; Each boy in the room stood up and gave his name.","Complex repetition","(5)(Subj(Pred)~)*: Lorsqu'elle venait avec sa m~re, souvent celle-ci caressalt ce vieux pilier central... ((Subj Pred) ~ : Les habitants de ce quartier r~p~tent toujours:~Si nous avions un arr~t d'autobus pr%s d'ici.~ On the actual stage we have no such a detailed mechanism to be able to differentiate the repeated constituent. Nor do we consider the differentiation necessary. We treat all these repetitions as having the type (Subj Pred)~,(in a more general form ~), and we find no inconvenience doing so. 3.3 Repeated phase of the event","An event consists of several phases: the beginning, the middle, the end and eventually the result and the imminent phase, i.e. the phase directly preceding the beginning point. 15 As for the repetition is concerned only a phaseincluding a culmination point is capable of repetition, because the repetition presuppos~ that the event has a (real or hypothetical) boundary.","(6) (Inchoative)~: Lorsqu'il arrivait .., M~re et Mme van Daan se mettaient pleurer ~ chaque fois."]},{"title":"~","paragraphs":["Terminative~ : Une ~ une les villes talent englouties. (Imminent Phase)*: Trois fois ou quatre fois au cours de l'entretien le commissaire avait ~t~ sur le point de lui appliquer sa main sur la figure. (Hypothetical culmination point) (Resultative~ : Chaque fois que je vais chez elle, je trouve toute la maison bien nettoy~e. Like the distinction of the repeated constituent, the distinction of the repeated phase is not especially significative in the iterative operations. Besides, if necessary, we can treat each phase as an independent event: the beginning part ~' of the event ~ can be considered as an event. Thus, for the time being, the distinction of phases is also neglected in the iterative operations. 3.4 Homogeneous iteration and heterogeneous iteration A homogeneous iteration is an ordinary iteration of the type(~)~ and a heterogeneous iteration is what is called by Imbs 'la r~p~tition d'alternance'. It is not the iteration of a simple event but the iteration of two or more mutually related events. It has the form:"]},{"title":"(~'÷~' '...)~","paragraphs":["(7) J'allume et j'~teins une fois par minute. The most frequent case is the combination of two events, but the combination of three events is still possible:","(8) Depuis une heure il va ~ la fen~tre tousles trois minutes, s'arr~te un moment et revient encore. The combination of more than three events is not natural. 4 APPLICATION ORDER OF TENCE AND ASPECT OPERATOR","In the present article we are exclusively concerned with aspect operators and tense operators are not treated, though past tense sentenses are used as examples. We will be contented just to say that tense operators come after aspect operators in the operation order.","(9) I1 travaille. --- I1 se met enfin travailler. (Inchoative) --- I1 s'est nis enfin ~ travailler. (Inchoative + Past) CLASSIFICATION OF BASIC PROPOSITIONS","A sentential aspect is the sythesis of the aspectual meanings of all constituents of the sentence. For the efficient execution of iterative operations as well as all aspectual operations we have to classify previously propositions ~i denoting events S i. For this classification we take accoufit of durative/non-durative and bounded/non-bounded characters of events.","The distinguished propositions are: ~ = durative proposition; ~2 = accomplishment proposition; ~ = momentaneous (or non-durative) proposltion. This classication is basically identical with Verkuyl's. The criteria we have used and examples of propositions of each groupe are as the following. (For pragmatic reason, sentences are given instead of propositions.) Criteria","~I: the event is represented with an open interval; satisfies the additivity (or partitivity) condition; co-occurrence with durative adverbials such as a yea~ an hour .. Ok; co-occurrence with momentaneous adverbials such as in five minutes, at that moment .. No","~2: the event is represented with a closed interval; a culmination point (or a boundary) is included; if the culmination point is excluded, it satisfies the additivity condition, otherwise .. ~o","~: the event can be considered as a ~momentaneous one; co-occurrence with durative adverbials .. No; co-occur-","rence with momentaneous adverbials ..Ok I Cf. Verkuyl (80) p145. Verkuyl distinguishes durative VP, terminative VP and momentaneous VP. 16","Examples of expressions ~I: he sleeps, he sings, he walks ~2: he swims across the river, he reaches the top of the hill, he builds a sandcastle @3: he hits the ball, a bombe explodes, -he kicks at a ball This classification is necessary also for other aspectual operations. In order to show the varidity of the classification, we give an example of other aspectual operations: the inchoative operation. Inch is a boundary giving operator and gives the initial border to any proposition, but the meaning of Inch(@ i) is different according to @i-With ~[, which doesn't imply any boundarz Inch functions to give the initial boundary. ex. ~I it rains; Inch(~l) .. It begins to rain With @o, which implies an end point, inch fiEes the initial boundary. ex. @2 \"\" Bob builds a sandcastle; Inch(@2) .. Bob began to build a sandcastle. The length of the event is the time stretch, at the end of which Bob is supposed to complete the sandcastle. With @3 the condition is quite different. ~3, momentaneous proposition, implies no length (or no meaningful length) and the beginning point and the end point overlap each other. Inch(~3) gives automatical]y the iteration of the event and the initial boundary becoms the initial boundary of the prolonged event. ex. @3 \"\" he knocks (one time) on the door; Inch(@3) .. He began knocking (repeatedly) on the door. The function of the Inch is the same for all of three examples, but the meaning of the beginning is different one from another. The third case (that of ~3) is an example of the fact that a non-repetitious operator can produce certain repetitions. This is the repetitious effect of a non-repetitious operator, to which we will return later. 6 BASIC OPERATORS","An iterative operation is noted as Rj(~i), of which Rj is either a single operator or operators. As it was already said t a necessary condition of the iteration is that the event in question has a clear boundary. Thus the operators concerned with the iterative operations have either the effect of giving a certain boundary, (in the case of non-bounded event): B@i , or the effect of repetition. The following operators indicated with capital letters are not individual operators,but group names. An individual operator has for instance a form like N 2 or F1/w(eek). Operators N: operators indicating directly the number of repetitions F: operators indicating a frequency or regular intervals between occurrences I: operators indicating a temporal length; effect of prolonging and bordering B: boundary giving operators G: prolonging operators Examples of expressions N: two times, three times, several times F: every day, three times a week, several times a day I: for an hour, from one to three B: begin to, finish -ing, (teshimau..J) G: continue to, used tO, (te iru.. J) 7 OPERATIONS 7.1 Single operators N~F~I 7.1.1 Direct operations","The operation of N, F, repetitious operators, on ~2, ~3 give as the output N~2, N~ 3, F~2, F~. These are direct (explicit) repetitiofis operations, namely those which change a non-repetitious proposition into a repetitious one. The result of the operations is exactly what the operators indicate."]},{"title":"(lO)","paragraphs":["N~: He crossed the road twice. N~: He knocked on the door twice. F~2: He goes to Tokyo Station once","a week. F~3: It s~arkles every two minutes. 7.1.2 Indirect Operations","The operator I gives a temporal limit to a proposition. Usually it operates on ~I\" ex. ~I .. he walks; I~I .. he walks for two hours t7 It is not a proper repetitious operator. However, if the operator I operates on 92 or on 9x, a bounded proposition, it turns the proposition into that of repeated event. In this case, the iterative operation is effectuated indirectly. We call this iteration 'implicative iteration'.","ex. 92 -- John walks to the door; I .. for hours; I92 .. John walked to the door for hours. In order to differentiate this I92 from I91, we use the symbolXfor an implicative iteration: I(~92). (exactly~is~1 oral2)","~appears not only with the operator I, but also with N and F.","(11) N(~ 93): The top spun three times (= several times on three occasionsl).","F(~93): The bell rings three times a day. As we have already seen, other aspectual operators can also have the effet of repetition.","(12) Inch 93 = Inch(~ 93): It began to spin.","Term 93 = Term(~93): It stopped to beat. As for the strings N91 and F91, they don't satisfy the basic condition of the iteration, i.e. 91 has no boundary. With some special interpretation rules, however, we can interprete them as N92 and F92 respectively. ex. F91: ?He walks three times a week. --@ He walks from the house to the station three times every week (F92). 7.2 Complex operators of N,F,I 7.2.1 Direct Operations","The above operators N,F,I can be applied successively one after the other, but not every combination nor every application order is acceptable. F.I, I.F, F-N and N-I are acceptable, but N.F is not natural.","(13) F(I91): Ii y alla souvent pendant une quinzaine de jours; I .. 15 jours, F .. souvent, 91 .. il y alla (pour y rester)","N(I91): J'~tais ~ Tokyo en tout trois fols, chaque lois pendant quelques semaines;N .. trois fois; I .. I The distinction of the situation and the occasion is clear in Mourelatos. quelques semaines; 91 .. J'gtais Tokyo","I(F93): Ii prend le medicament trois lois par Sour pendant une semaine; I .. une semaine; F .. trois fois par jour; 93 .- il prend le medicament I~N gives in a certain operational order the same effect as a single operator F, but in other orde~ other effects. Using complex operators, we get the output I(F92), I(F93!, F(N92), F!N93), N(I91), F(I91), I(N92), I(N93). Combination of more than two operators are also possible. (14) II(F(I291)): Es hat heute ab und zu","eine Stunde lang geregnet; II heute","F .. ab und zu; 12 .. eine Stunde;","91 .. es regnete","Cf. Es hat heute eine Stunde lang ab","und zu geregnet.","II(F(I291)!: Toutes les fins de semaine en gte, on gtait toujours parti; II .. en gt~; F .. chaque semaine; !o -- pendant le week-end 91 -. on @~ait parti I","II(F(I291)): Ein Jahr fang hat Peter t~glich 3 Stunden lang trainiert; I1 .. ein Jahr; F .. t~glich; I2 .. d~ei Stunden; 91 .. Peter trainierte 7.3 Operators B and G 7.3.1 Direct Operations","Adding B, boundary giving operators, and G, prolonging operators, to the above operators, we can further extend the iterative operations. B is by it-self no repetitious operator. Its proper function is to give a boundary to a non-bounded proposition. One of the B-operators is Inch: Inch 91 .. he begins to write. Once a event gains a boundary, it can be repeated.","(15) N(B91): He began to write three times. Another application order of N and B gives another kind of output.","(16) B(N92): Bob began to build three sandcastles; N .. 3; B .. Inch; 92 -. Bob built a sandcastle I Example borrowed from Sankoff/Thibault. 'en ~te' can be also interpreted as F. In this case, we have two F-operators F I and F2: FI (F2(I~I)); FI .. en ~t~ = chaque ~t~; F2 .. chaque semaine. 18 The prolonging operators G is not a repetitious operator either. If G performs on ~I, it has only the effect of prolonging orextending the event•","(17) G~I: He is working; G .. ING; ~I -- he works 7.3.2 Indirect Operations","In some cases, the operation of B brings about repetitions, as we have seen with the operator Inch. It is done in the combination of B and ~3\"","(18) B~ = B(~3): She began to cough; it began to sparkle; I stopped his calling you.","B(I~ I) = B(F(I~I)): He began jogging of half an hour (= half an hour each day). G gives the effect of iteration too, if G is associated with a bounded propositio~ such as ~2, ~3' I~I\"","(19) G~ 2 =~2: He continues going to Tokyo Station; G .. Cont; ~2 .- he goes to Tokyo Station Combination of the operators F,G with other operators can also give similar effects•","(20) I(G~) = I(~ ~3): It was sparkling for an hour.","G(F(X ~)) = F(~ ~3): It continued to spark~ ~very two mlnutes. 7.4 Multiple Structure of Iteration","A repeated event, (which in fact has durative character like ~I), can again be given a boundary. And this renewed bou~ ded event can again be repeated• This makes a multiple iteration• The iteration can be explicit or implicative.","(21) G~2: Elle prend des legons de piano.","B(Z ~2): Elle a commenc~ ~ prendre des le$ons de piano.","N(B(X ~2)): A trois reprises elle a commenc~ ~ prendre des legons de piano. The following examples given by Freed have also a multiple iterative structure, 'a series of series' according to her terminology.","(22) N(~ ~3): She sneezes a lot. B(G(~3) : She began to cough (after years of smoking)• 7.5 Order of Operations","The scope of each operator is not unambiguously definable. However their mutual relation can be indicated more or less like the following•"]},{"title":"f • N~ • F~","paragraphs":["i • • B~ . G-- Figure I The direction of an arrow in the figure indicates the written order of two ooerators in a form. The order of application in the operation is therefore inverse. 8 EVENT AND BACKGROUND","It is often proposedto distinguish an event from its background (or its occasion)• The background is a time stretch in which the event takes place• From a pure theoretical viewpoint, the idea of the double structure of event-background is very helpful for analysis of ambiguous structures•","I ex. La toupie a tourn~ trois fois. In this expression, 'trois fois' can be either the number of occurrences of the event (i.e. number of spins of the top) or the number of occasions on which the top spun. With the iterative operators the difference can be given clearly: N~3 and N(~3)• In the former case, the top spun three times on one occasion and in the latter case, the top spun several times on three occasions. The operators N,F,I are related with both the event and the background. Graphically the difference can be indicated as the figure 2. 2 I This example is borrowed from Rohrer. 2 The first graph (hT~3) is also borrowed from Rohrer. t9 La toupie a tourn4 trois fois. La toupie a tourn~ trois foiso (= ~ trois occasions) La toupie a tourn~ pendant une minute."]},{"title":"N(Z ~3)","paragraphs":["N=3"]},{"title":"I(x ~3)","paragraphs":["~~' I& I minute Figure 2 Operationally, if we differentiate the background from the event on the level of iterative operations, the rules must be too complicated. For the time being the operators N,F, I are used regardless whether they operate on the event or on the occasion. 9 NAGATION OF THE ITERATIVE PROPOSITIONS","As for the negative cases of itera-tire operations, there are several possibilities. Either a negeted iterative proposition remains still iterative or it becomes a non-iterative proposition. In other words, the negation affects the whole proposition in the case of total negation, and affects just the number of repetitions or the frequency in the case of partial negation. In the former case the scope of the nagation is larger than that of the iteration, and in the latter case, the scope of the negation is smaller than that of the iteration.","(23) N@3:I1 est venu deux fois ~(N@5) or rather ~3:I1 n'est jamais venu. (Total negation)","(~N)@3:I1 n'est pas venu deux fois. (En effe%, il n'est venu qu'une lois.)","(Partial negation) N(~@3): I1 n'esz pas venu deux fois.","D4j~ deux fois il n'est pas venu. F~3:I1 sortait trois fois par","semalns. ~(F~3) or rather ~@3:I1 n'est jamais sorti. (Total negation)","(~F)@3:I1 ne sortait pas trois fois par semaine: en effet il ne sortait que deux fois par semaine. (partial negation)","F(~3): Trois jours par semaine, il ne sortait pas. It depends on which stage of the operations the negation is applied. 10 INTERPRETATION AND CONCORDANCE RULES","Several kinds of interpretation rules are in view. The interpretation rules of the first category are those which give adequate interpretations to N@I, F~ I etc, in consideration of the context on the pragmatic level. N@I gains usually an interpretation of N~2, and F~I that of F@2. For example, \"I walked three times this week\" can be interpreted as: \"I walke@ three times from the house to the station this week.\" The second interpretation rules are concordance rules, which connect diverse expressions with one same event. Different expressions in appearence or different means of expressions are interconnected by these rules. Eventually, the distinction of the background from the event can be effectuated by certain rules. REFERENCES","Bennett,M 1981: Of tense and Aspect: One Analysis; Syntax and Semantics vol 14 Tedeschi, Ph. & A. Zaenan (eds) 13-29","Carlson,L. 1981: Aspect and Quantifica-tion; Syntax and Semantics vol 14,31-64","Freed,A.F 1972: The S~mantics of English Aspectual Complementation,D.Reidel.","Imbs,P. 1960: L'emploi des temps verbaux en fran~ais moderns,Paris.","Mourelatos,A.P.D. 1981: Events, Processes and States; Syntax and Semantics vol 14 191-212.","Rohrer,Ch. 1980: L'analyse logique des temps du pass~ en frangais,comment on peut appliquer la distinction entre nom de mati~re et nom comptable aux temps","du verbe; 8th Coling Proceeding.","Stump,G.T. 1981: The Interpretation of Fr Frequency Adjectives; Linguistics and Philosophy 4, 221-257.","Verkuyl,H.J. 1980: On the proper Classifi. cation of Events and Verb Phrases; Theoretical Linguistics 7, 137-153","Yamada,S. 1981: Situationen, Begriffe und AusdrGcke des Aspekts; die Deutsche Literatur 66, 115-125.","Yamada,S.(to appear): Aspect. 20"]}]}