{"sections":[{"title":"SYSTEMIC GRAMMAR IN COMPUTATION: THE NIGEL CASE","paragraphs":["Christian M.I.M. Matthiessen, USC/Information Sciences Institute"]},{"title":"1 INTRODUCTION","paragraphs":["Computational linguistics needs grammars for several different tasks such as comprehension of text, machine translation, and text generation. 1 Clearly, any approach to grammar 2 has potentially something to offer computational linguistics, say for parsing or text generation (and, by the same token, there is a potential benefit from an application within computational linguistics for each approach, cf. [Fawcett 80]). However, it is equally clear that some approaches have much more to offer than others. Here I will take a look at Systemic Linguistics 3 in the service of computational linguistics tasks, concentrating on a 1This research was Supported by the Air Force Office of Scientific Research Contract NO. F49620-79.C.0181. The views, and conclusions contained in this document are those of the authors and should not be interpreted as necessarily representing the official policies or endorsements, either expressed or implied, of the Air Force Office of Scientific Research of the U.S. Government. I am very grateful to William Mann for many helpful comments on various versions of this paper; much of the discussion builds on work by him. f am also deeply indebted to Michael A.K. Hallida~'; I have profited from and drawn heavily on his insights about English grammar and semantics and the systemic framework. I am solely responsible for all errors. 2There are now in the early 80s a great number of grammatical mechanisms around -- witness for example the 1979 Milwaukee conference on current alternative approaches to syntax where around fourteen alternatives were presented (see [Moravcsik & Wirth 80]). a collecbon which is only a sample, leaving out many current approaches. The term grammar is used in its traditional sense in systemic linguistics: it subsumes both syntax and morphology. This use contrasts with the more recent one where grammar subsumes semantics, syntax, morphology, and phonology. 3There are few grammatical mechanisms that have been developed within a framework with as impressive a tradition as Systemic Linguistics and with as wide a scope. The systemic framework is not just a non.transformational alternative to Chomsky's transformational grammar. It is different from Chomskyan work at the level of framework, not only at-the level of mechanism and notation. Systemic linguists ask questions like \"How does communication succeed?\", \"What are the relations between context and language use?\". \"What can a speaker of English do grammatically to achieve a particular purpose?\". \"What are the options for expressing grammatically a particular range of meanings?\", \"What functions does language serve?\" and so on. These are questions that are crucial to the success ot for example a text generation system. One consequence of questions of this type has been in Systemic Linguistics that text as a communicative unit is taken to be the basic linguistic unit rather than the sentences that are used to express texts, see [Hasan 78] and [Hasan 79]. Obviously, this view has far-reaching effects on the .',)nception of grammar. The systemic conception of language draws on continental European work, the British tradition started by Firth, and American anthropological linguistics. It has much to offer at a time when communication is beginning to assert itself as a central organizing notion in linguistic research instead of the much more limited notion of (primarily syntactic) competence that received so much attention for a long time in the CoOs. but began to lose its ap~,arent attractiveness in the 70s. For discussion of systemic grammar, see e.g. [Ha!liday 69], [Halliday 76a]. [Hudson 76}. [Davey 79], [Berry 77], [Fawcett 80], and [Matthiessen 83]. large computational systemic grammar for text generation (Nigel) that is currently being developed. 1.1 What can systemic linguistics offer? The question I will try to answer in this paper is what systemic linguistics can offer computational linguistics. Since the answer is, I think, far too long for a short discussion, I will let a more specific question represent the general question here: What can systemic linguistic accounts of grammar and semantics offer computational linguistics in the area of text generation? This question excludes for example the use of systemic grammar in parsing -- see [Winograd 72] -- and the large systemic body of work on discourse organization (see in particular [Halliday & Hasan 76], [Hasan 78], [Hasan 79], [Halliday & Hasan 80], [Martin 83], and [Butler 83]). The text generation task raises a number of demands on the grammatical component, Very roughly and generally stated, they amount to generating in conformity with diverse needs, such as the need for denotational appropriateness and the need for fluent text. There is no published general solution to the problem of controlling the grammar to generate in conformity with diverse needs. The discussion here continues and elaborates parts of [Matthiessen 81], 1.2 Systemic functionalism as a contribution A cornerstone in systemic linguistics as developed by M.A.K. Halliday and others is systemic functionalism. 4 Grammar is to be investigated and interpreted in terms of the purposes it fulfills. Its organization is a function of these higher-level considerations. Apart from guiding research in systemic linguistics, this functionalism has been important in the design of systemic grammar. I will identify two design properties characteristic of systemic grammars that make them well suited to deal with the demands, better than grammars that are not designed to reflect the functionalism that the two ProPerties stem from. The two 4There are also strictly formal considerations having to do with the notation used. These have been more central in work on e.g. Lexical Functional Grammar, Functional Unification Grammar. and Generalized Phrase Structure Grammar. The results may or may not generalize to Systemic Grammar; that is a matter for future discussion. 155 properties have to do with the organization of grammar and with the process of sentence generation; they constitute factorings of the sentence generation task. One is a factoring into a process of controlled choice and a process of structure specification as a consequence of choices made. This factoring is due to the need to represent the organization of grammar in its role as a resource for communicative needs. The other is a {'actoring of the grammatical resources into domains that serve different purposes (what will be called the mete-functional factoring). I will use Nigel to illustrate how they work and what their value is in text generation Systems. I will also present a completely new addition to systemic grammar, the so-called chooser framework, developed in the context of the text generation task. 5 1.3 Organization of the discussion First, I will sketch the steps in the process of text generation so that the role grammar has to play can be identified (section 2). The rest of the paper illustrates how systemic functionalism enables grammar to cope with tasks its role in the text generation process entails. I will use the generation of a particular text realized by a single sentence, Had Sir Christopher Wren been going to build a cathedra/ ever since his youth?, as a way of illustrating and organizing the discussion."]},{"title":"2 THE TEXT GENERATION PROCESS","paragraphs":["In this presentation of text generation. I will follow an expository design by William Mann (see [Mann 83]). The model of text generation he gives an overview of is called Penman. It has been designed for monologue only, without for example any facilities for comprehension. However, although Penman cannot take part in a conversation, I will present an example that corresponds to a turn in a dialogue; Penman will be assigned the task of asking a question in this illustration. The reason for doing this is purely illustrative; the task of asking a question is a concise way of bringing out a number of features of the grammar, Assume that a need for a text has arisen. In a conversation about Sir Christopher Wren. the need arises to know whether there was a plan for him to build a cathedral sometime after the 5Functionalism in linguistics will hopefully be reconciled with goal reasoning as it has developed in computational linguistics and AI. The term function has two related meanings in current lingu=stics, in addition to its strictly mathematical sense. One is \"mete-function,'\" which can be defined as the purpose or goal -- effect considerations that defines a particular component of the grammar. The second meaning of function is what Halliday has calted \"micro-function\". This type is the one that figures in traditional grammar .- subject, object, etc. -- and more • ,c~,nt!,! in for example Relational Grammar, Case Grammar, and Lexical Functional Grammar Conceptually, micro-functions are very much like roles or slots used in semantic netS, (Micro vs. macro is here simply a distinction between small and big; meta means that the functions are on another plane, not part of the structure, in this way it is the same \"mete\" we find in for example \"mete-language\".) For an interesting discussion of the development of mete-functions and mi:ro-functions out of a set of macro-functions in early child language, see {Hal!iday 75}. For some discussion of functional grammar, see e.g. {Halliday 69]. [Halliday 74], [Fawcett 80], and [Dik 78]. time when he was still a youngster. The task of the text generator is to satisfy this need. (As we will see, one way of meeting this need is to ask Had Sir Christopher Wren been going to build a cathedral ever since his youth?,) Three processes, Acquisition, Planning, and Sentence generation, work in text generation towards meeting the need. 2.1 Steps in the text generation process Given the need for text, the text generator identifies the goals that the text should pursue and acquires the information necessary to pursue it. This process is supported by a knowledge base. The goal is roughly that the addressee recognize that the information desired has been requested; in this case, we want to find out whether Sir Chris had been going to build a cathedral or not. Next, there is a process of text planning. In response to the goal for the text and the information acquired, a plan to achieve the goal is created. The planning process uses a rhetoric of text organization to create the text plan. The plan consists of (among other things) conceptual loci (at least one), each of which corresponds roughly to, an independent clause. 6 In the present example, a text with one such locus is planned, a locus we can call CATHEDRAL-BUILDING. It is up to sentence generation to realize this plan, i.e., to find a wording for it. The process of sentence generation does this, relying on grammar as its resource. The remainder of the paper deals with this part of the text generation process. The grammar I will draw on for the rest of the discussion is the Nigel grammar, the systemic text generation grammar mentioned earlier. 7 2.2 The task for sentence generation The sentence generation process can start when there is a fully specified local plan for CATHEDRAL-BUILDING in the text plan for an independent clause. Such a plan includes among other things: . A pointer to the process aspect of CATHEDRAL. BUILDING, called BUILDING in our example. • A specification of the local speech act, here called BUILDING.QUESTION; see the discussion of Mood below. • A plan for temporal relations; cf. the discussion of Tense below. 6A traditional distinction between clause and sentence is maintained in systemic linguistics. A sentence can be defined simply as a complex of clauses, related by coordination or subordination. 7Although the text generation process can conveniently be factored into the three subproceasas identified above, these subproceases are not necessarily senally arranged. There is one additional process, a orocess of improvement. For instance, the quality of the output of sentence generation is evaluated and then, based on this evaluation, changes in the plan are proposed. 156 = -Possibly a specification of a specific conceptual context, defined temporally, spatially, in terms of purpose, or in some other way, to be indicated as a part of the organization of the text in terms of conceptual contexts. There is no such specification for the present example. • Possibly a specification of a conjunctive relation (like contrast, enumeration, temporal sequence, disjunction, and cause) to be expressed. There is no such specification for the present example. A list such as this represents expressive demands, all of which the grammar of the sentence generation process has to cope with, but it imposes no structuring or factoring of this process. The task of the grammar and its semantics is to impose an organization of and find a wording for the material relevant to the local plan. Consequently, it is quite helpful if the grammar of the sentence generation process is organized in such a way that the process can be decomposed into manageable subprocesses. In what follows, I shall show how there is a natural factoring of the sentence generation process that derives from the systemic organization of a grammar. As we will see, this factoring is due to the research programme (a consequence of systemic .~unctionalism) in systemic linguistics to uncover the functional • organization of grammar and semantics and to reflect it in systemic notation."]},{"title":"3 SYSTEMIC FACTORING OF SENTENCE GENERATION","paragraphs":["The design of systemic grammar is the result of a long-term effort to create a grammatical framework that reflects the functional organization of grammar. The important point to note here is that the organization of systemic grammar leads naturally to a factoring of the sentence generation process. In other words, the systemic factoring of the sentence generation process is due to the organization of systemic grammar, There are two simultaneous factorings that cross-cut: 1. The process of structure building is factored into two processes, each of which with its own notation: The process of choosing among grammatical alternatives (section 4.1) and the process of realizing, or reexpressing, a particular choice as a specification of a fragment of grammatical structure (section 4.2).","2. The statements of grammatical choice, realizations of choice, and resulting structure are factored into three fairly independent processes: an ideational process of representing the speaker's experience, an interpersonal process of specifying the interaction between speaker and hearer (in terms of speech act and role assignments), and a textual process of enabling the two other ~3rocesses. This is the meta-functional factoring; cf. section 5. The meta-functional factoring is possible because of the notations developed for choice and realization of choice into structure as a configuration of functions. Features originating in different meta-functions can be used to co,classify a grammatical unit and functions from different meta-functions can be conflated so that they apply to the same constituent in a structure."]},{"title":"4 FACTORING INTO CHOICE AND REALIZATION","paragraphs":["4.1 The process of choosing The separation of statements of grammatical choice alternatives from structure specifications allows the grammar to have choice as its central organizing principle. The systemic network notation has been developed to make statements 0f minimal grammatical choice points and statements about the inter-dependencies among these choice points possible. The process of choice is itself factored into two parts: (i) Grammatical choice: the statement of what the grammatical choice points and their interdependencies are -- the systemic network notation just mentioned -- and (ii) Semantic choice: statements about how to select among the options of the grammatical choice points -- a chooser semantics. 4.1.1 Grammatical choice Each choice point is represented by a system. A system is a disjunction of two or more options (represented by grammatical features like Declarative, Past. and Passive). 8 It has an entry condition, which is the condition under which the choice is available. As long as the condition has not been satisfied, no choice can be made. The condition is a Boolean combination of features (without negation, though) -- minimally a single feature. When the entry condition is satisfied, one of the feature options must be chosen. An example of a system is given below in Figure 1. Together the systems of the grammar constitute a network of systems: The features that are the output of one system are part of the entry conditions of other systems. The network as a whole represents the entire scope of the process of grammatical selection; the individual systems represent the decomposition of this process into minimal choice points. Below. in Figure 2, the network fragment for mood is presented; see section 6. 4.1.2 Semantic choice The process of purposefully choosing among the feature options of a system is represented by a chooser or choice expert. The grammar supplies us with linguistically justified control points, th'e 8In systemic grammar, a distinction is usually (and always in work by Halliday) maintained between features and functions like SUBJECT, ACTOR, and THEME. Features are the building blocks of the paradigmatic organization of grammar, i.e, of grammar as choice. Functions are the building blocks of the syntagmatic organization, i.e.. of grammatical structure. The distinction is not maintained in Martin Kay's Functional Unification Grammar (cf. [Kay 79]). 157 systems. Each system is assigned a chooser, which is a procedure composed of one or more steps leading to the determination of which grammatical feature to choose. Where is the information relevant to the determination of which option should be chosen located? As we have seen, in addition to the grammar component, our text generation system has a"]},{"title":"knowledge","paragraphs":["base and a text plan for the text to be generated. We can call these components and other possible sources of knowledge the environment of the grammar component. It is from this environment that a chooser demands the information it needs in order to be able to choose one of the features of its systems. It demands this information by presenting formal inquiries to the environment. 9 An inquiry is asked of one or more parameters. The parameters are variables like PROCESS, GOAL, TEMPOo, and POLARITY for which conceptual values are identified in the generation of every grammatical unit. As we will see presently in section 4.2, grammatical structure is a specification of grammatical functions and the variables correspond to those grammatical functions. The conceptual values are called hubs; they are concepts from which other concepts can be accessed. For instance, once a concept for a particular action has been identified, the participants in the action can be identified through the action concept. The inquiries are the only interaction between the choosers and the environment. 4.2 The realization"]},{"title":"process","paragraphs":["There is a separate notation for the realization process. Grammatical structure is defined in terms of relations that can hold between grammatical functions; grammatical structure is a configuration of functions like SUBJECT, PROCESS, ACTOR, and THEME. The relations (conflation, expansion, ordering; see below) are introduced by realization statements. In the realization process, a function structure is specified step by step: A small number of realization operators operate on one grammatical function, a combination of grammatical functions, t° or a grammatical function and a set of features, tl A realization statements consisting of an operator and one or more operands is associated with a particular grammatical feature in a system; when that feature is chosen, the realization statement can be activated. 9These formal inquiries have informal versions that are informal questions in English used for purposes of discussion and presentation. 10The realization operations include Insert. which inserts a function into the structure being built, Expand, which specifies a constituency relation between a function and one or more daughters, Order, which order two grammatical functions, and Conflate, which states that two functions, say SUBJECT and AGENT, describe the same constituent. Two functions are not ordered until it is clear that the ordering imposed is the final one. There is thus no need for movement h ~;formations. In fact. there are no transfo rmations at all: A realization is only stated at a point where it is clear that it represents the final state. 11This latteP category of realization operator serves to state how the functionally defined constituents of a particular structure, say clause structure or prepositional phrase structure, are to be expressed grammatically or lexically. We will meet the operator Classify which associates a texical feature with a function; this feature is a constraint on what lexecal items can realize the constituent that the function defines. Among the important properties of the realization process, we find: • The specification of structural presence (the insertion of a function into the structure being built) and the specification of constituency relations are separate from ordering specifications. For example, the specifications of the presence of FINITE, the finite verbal element of a clause, and SUBJECT are separate from specifications of their ordering. Either can be specified to follow the other and there is no need for a transformation to invert an original ordering. This follows the general tendency in the grammar towards factoring the realization (i.e., structure building) process into functionally motivated steps. It is typically the case that the presence of a function and its ordering with respect to other functions serve two different purposes• • There is a \"unification\" operator on functions, called Conflate, that enables the grammar to reconcile function structure fragments that are contributions from areas of the grammar serving different purposes. For example, SUBJECT is conflated with different functions depending on the voice of the clause -- ACTOR, GOAL, RECIPIENT, etc.. • Collections of features that determine how each constituent of e.g. clause structure is further specified can be built up step by step. The features are associated with functions. Whenever two functions are declared to describe the same constituent, i.e., are conflated, their feature collections are merged. For instance, the auxiliary had has that form in our example because it serves both the function TEMPO o which constrains it to be a past form and the function TEMPO~ which constrains it to be a form of the auxiliary have. Now I will show in some more detail how the sentence generation process is organized. I will use the example already introduced and structure the discussion around the meta. functional factoring of sentence generation. We will see examples of all the characteristics of the choice process and the realization process identified above."]},{"title":"5 META-FUNCTIONAL FACTORING","paragraphs":["To see how the multi-functional factoring works, we will return to our CATHEDRAL-BUILDING example and look at it first in an interpersonal perspective, then in an ideational perspective, and finally in a textual perspective. Different perspectives draw on different types of information in the environment. The final wording the grammar will give us is Had Sir Christopher Wren been going to build a cathedral ever since his youth?. We will consider the three meta-functions identified above; each corresponds to a different \"event\". There is the textual event itself, the event or process of creating a text for the addressee that enables the speaker to achieve his goals (the textual meta-function). In addition, we have (i) the speech event, an act of 158 speaking involving speaker and addressee (the interpersonal meta-function), and (ii) an event in the speaker's experience (real or imagined, recalled or projected) (s)he wants to represent (the ideational meta.function). 12 5.1 Interpersonal choices When they explore the part of the grammar that deals with the clause as interaction between speaker and hearer, choosers ask questions that have to do with some aspect of the speech act, such as: (i) Mood, i.e., a classification of the speech act: Is the speech act (BUILDING.QUESTION) a command? Is the speech act a question? I will use the mood area below to show in more detail how the grammar works; see section 6. (ii) Identity of speaker/hearer: What is the identity of the hearer? Is the hearer included in the proposition? Here there is no involvement of speaker/hearer. (iii) The polarity of the speech act: Is the speech act a positive assertion or a denial? For polarity in our example, see section 6.4. (iv) The sincerity of the act: Is the assurance of the speaker's sincerity to be expressed? Is a request for the bearer's sincerity to be expressed? Here we do not have a specification of a marking of sincerity. 5.2 Ideational choices Second, consider the exploration of the clause as a representation of our experience. Chooser questions here concern the structure and character of the conceptual situation we are to represent. (i) Transitivity, i.e., the organization of our experience as a process with one or more participants and possibly attendant circumstances: Here we choose to represent CATHEDRAL-BUILDING as an external process where one entity (SIR CHRIS) causes the building process, which effects, i.e., brings into existence, another entity (CATHEDRAL). The function structure generated by realization statements that re-express our choices as structure has as functional constituents ACTOR, PRocEss, and GOAL, all of which carry hub associations. ACTOR is associated with SIR CHRIS, PROCESS with BUILDING, and GOAL with CATHEDRAL. In the final wording of the clause, Sir Christopher Wren is the ACTOR of the clause, built the PROCESS, ~nd this cathedral is the GOAL. (ii) Tense, i.e., the organization of our experience in terms of time relations: How is the event from our experience (here the CATHEDRAL.BUILDING event) to be related temporally to the speech event? This intricate question will be further examined in section 7 below. 5.3 Textual choices Finally, let us look at the clause as a message, the textual perspective. (i) Voice: Of two particular ideationally identified 12These two events may overlap in various ways. of course, as in so.called performative sentences. concepts, SIR CHRIS associated with ACTOR and CATHEDRAL with GOAL, which is conceptually closer the the topic of the paragraph being created? Is the causer of the event to be mentioned? In our example, the concept WREN is the paragraph topic and we get an active clause with a ¢onflation of ACTOR and SUBJECT, i.e., ACTOR/SUBJECT. (ii) Theme: For a particular ideational function, we ask if it serve as a conceptual context for the rest of the clause? For example, it is determined that CATHEDRAL is not to serve this function. Similarly, for interpersonal functions. Here, the conceptual context in relation to which the remainder is interpreted is FINITE, an indication that the clause expresses a question about polarity. The different strands of functional reasoning hinted at above are , unified into one structure as I will show below in section 8. Meanwhile, mood and tense will serve as representatives of the full range of choices sketched in this section."]},{"title":"6 INTERPERSONAL CHOICES: MOOD","paragraphs":["Mood is the interpersonal part of clause grammar that expresses the role the speaker adopts and the role (s)he gives to the addressee in terms of speech act. I will present the choice organization of mood first, then the structural effects of different choices, and finally I will show how mood selections can be controlled. 6.1 Mood choices In English there is a grammatical choice for clauses between imperative ones and indicative ones. This choice of the mood of a clause is represented by the mood system; the two options that constitute the choice are represented by the features Imperativ~ and Indicative. Only clauses with a finite verb select for mood; infinitival and gerundial ones do not. This fact is captured through the entry condition of the system, which says that if the clause is Finite. the mood system can be entered. A diagrammatic representation of the system is given in Figure 1."]},{"title":"Finite Indicative i Imperative KEY TO GRAPHIC NOTATION Entry condition: \"Finite\" Feature options: \"Indicative\" and \"Indicative\"","paragraphs":["Figure 1: The moodsysteminEnglish £59 The feature Indicative is the entry condition to the system of IndicativeMood where the options are Declarativ@ and Interroaativ¢. There is an additional step. The feature Interroaative is the input to the system InterrogativeType where the options are Whlnterroaative and Polaritv-lnterroaative. This network is represented diagrammatically in Figure 2. The boxes under the features in the diagram contain realization statements. Our example can be represented as a path through the network for mood. The features Indicative, Interroaative, and Polaritv-lnterroqativ@ are selected in that order. Each feature has structural consequences; the functional structure is built step by step. 6.2 Realizations and the structure of mood The structural realization of mood is in the MOO0 constituent, a function which embodies the mood or speechact aspect of the clause. The internal structure of MOO0 expresses the mood selection of the clause. 13 The two principal daughters are SUBJECT and FINITE, the finite verbal element of the clause. In 1 I"]},{"title":"}","paragraphs":["I"]},{"title":"I","paragraphs":["o 0 0 E E E f-F-"]},{"title":"E","paragraphs":["131ndicative clauses typically have a SUBJECT in English. whereas imperative ones do not. Consequently, there is a realization statement which says \"insert SUBJECT\" if the clause is !n,dicativ e. This means that the grammatical function SUBJECT iS inserted into the grammatical structure being built. There is no need to delete SUBJECT in imperative clauses; the function is never inserted unless it is actually expressed. Declarativ~ clauses, SUBJECT precedes FINITE; in Polaritv-lnterrooative clauses, FINITE precedes SUBJECT, aS in our example. In our example, the mood structure will be as diagrammed in Figure 3. The constituent organization is the result of the application of (Expand MOOD SUBJECT) and (Expand MOOD FINITE).","MOOD ....................."]},{"title":"I I","paragraphs":["FINITE SUBJECT Had Sir Christopher Figure 3: Mood structure in polarity interrogative 6.3 Semantic mood choices Each system in the mood network is controlled by a chooser. For instance, the mood chooser of the mood system in Figure 1 above, asks questions that identify information about the speech act of the clause to be generated. Basically, if the intention is to command, the chooser chooses the feature Imoerativ~, otherwise the feature Indicative. For our mood system the chooser interaction with the environment proceeds as follows: ENVIRONMENT CHOOSER It is not a Is the illocutionary point of the surface level speech act represented by BUILDING-QUESTION (MOOD) a command, i.e. a request by the speaker of an action by the hearer? command. Then Ichoose feature Indicative. This is of course an informal dramatized representation of what goes on, but the dialogue illustrates the interaction between environment and chooser: The chooser presents a inquiry to the environment, the environment responds, and the chooser chooses a feature in conformity with the response. The inquiry above requests a classification of a hub, called BUILDING-QUESTION in the example. The BUILDING-QUESTION hub is associated with the grammatical (micro-)function MOOD. Two additional inquiries establish that BUILDING-QUESTION should be expressed by an Interrooative clause and that this is a Polaritv-lnterroaative. 160 6.4 A note on polarity The choice of mood determines how we choose polarity in English. In Polarity-interroaativE clauses, the choice between Positive, as in Had Sir Christopher Wren been going to build a .cathedral, and Neqative., as in Hadn't Sir Christopher Wren been going to build a cathedral?, is a choice that has to do with the bias in the reader's assumptions about which situation (s)he thinks obtains. In our example, an unbiased question is intended and Positive is chosen. The realization of the choice is that the function FINITE is prohibited from being realized by a verb with the feature negative; it is outclassified for that feature: (Outclassify FINITE negative). We can symbolize this by associating \".negative\" with FINITE. Notice that this realization constitutes a constraint on how the constituent described by FINITE can be expressed. As we will see in section 7, other constraints on the constituent come from another part of the grammar (the functions TEMPO o and TEMPO~)."]},{"title":"7 IDEATIONAL CHOICES: TENSE","paragraphs":["Independent of and parallel with the grammar of mood is the grammar of tense. The two parts of the grammar originate from two different meta-functions, the interpersonal one and the ideational one. 14 7.1 Grammar of tense In English Indicative (;louses (cf. the previous section), if they are non.modal, there is always a specification of at least one relation of precedence between two times, one of which is the time of speaking. This is the system of primary tense, whose options are Pas__jt vs. Present vs. Future.. The realizations of these features are stated in terms of the tense function TEMPO 0. If Pa~t is chosen, the realization is (Classify TEMPO 0 past); if Future is chosen, the realization is (Classify TEMPO o will). In the latter case, TEMPO o iS a separate constituent, as in will build; in the former case TEMPO o iS fused, i.e. conflated, with whatever verbal function follows to the right when Future is chosen -- as in built. In English, the primary present tense is morphologically unmarked. It is possible to generate a more elaborate temporal verbal structure, with more than one tense function: TEMPO o TEMPo t TEMPO z will have ("]},{"title":"jump","paragraphs":[")ed This is possible because the grammar of tense does not just contain the system of primary tense, but also, in principle, indefinitely many systems of secondary tense (see especially 14Note, however, that the full resources of tense are only at work in Indicative clauses. For example, we cannot (in English) request of an addressee the past execution of an action. [Halliday 76b]). It is possible to iterate over tense options just as it is possible to iterate over tense operators in some tense logics. (Cf. will have been going to leave and FPFp where p is a proposition and F and P are tense operators.) The iteration defines tenses of different orders, starting, with first order (or primary) tense, then second order tense, third order tense, and so on. 7.2 Tense choosers Each selection of Past, Present or Future corresponds to a specification of a precedence relation between two times, T x and Ty. These times are concepts in Nigel's environment. The task of each tense chooser is to establish what the current times to be related are, i.e., a current T x and Ty pair, and what relationship obtains between them. This exploration proceeds in a step by step fashion, guided by the grammar. In our example, there are four times: the time of speaking, called NOW, a time prior to that which falls within the period of Sir Chris's life under discussion, call it MATURE.TIME, a time prior to that which falls within the period of his youth, call it YOUTH-TIME, and the time of the building of a cathedral, call it BUILDING-TIME. The temporal relations are represented in Figure 4."]},{"title":"~MAI URE_TIN E ~~NOW YOUTH-TIME ~____..~","paragraphs":["ING-T IME Figure 4: Temporal relations The tense functions receive hub associations. First, TEMPO o and .TEMPO~ are identified as NOW and MATURE-TIME respectively, then the following dialogue ensues: ENVIRONMENT CHOOSER ......................................... Yes, it does. Does MATURE-TIME (TEMPO1) precede NOW (TEMPO0)? Then I choose Past. This procedure illustrates the selection of primary or first order tense. This type of activity is repeated for the pair MATURE-TIME (TEMPO1) and YOUTH-TIME (TEMPO2) where the choice is a secor~d order Pa~t and for the pair YOUTH-TIME (TEMPO2) and BUILDING-TIME (TEMPO3) where the choice is a third order F~Jture. As a result, we get three orders of tense. (i), (ii), and (iii), the realizations of which are: 161 (i) Pa$1~ (Classify TEMPO 0 past)","(ii) Pa@~ (Classify TEMPO I have) (Classify TEMPO 3 enparticiple)","(iii) Fui~ure (Classify TEMPO 2 be going) (Classify TEMPO 3 to-infinitive) To sum up: Both the process of choosing tense and the process of specifying a tense structure are factored into steps that correspond to minimal temporal relations. The tense functions are ordered as a collection of tense functions: the sequence is iconic with the order of tense; increase in order of tense corresponds to the left to right sequenc e of tense functions. Since there are no more tense selections and no voice auxiliary, TEMPO 3 is conflated with PROCESS: (Conflate TEMPO 3 PROCESS) is activated."]},{"title":"8 RECONCILIATION OF THE META-FUNCTIONS: STRUCTURAL RESULT","paragraphs":["8.1 Conflation of FINITE and TEMPO o The two function structure fragments we have generated are (MOOD FINITE SUBJECT) and TEMPOc/TEMPO ~ TEMPO 2 TEMPO 3. Typically FINITE and TEMPO o conflate and the two fragments combine into the structure in Figure 5. Similarly, as already indicated, we have a conflation of TEMPO 3 with PROCESS. The latter function is a transitivity function and carries feature information about the transitivity type of the verb (i.e, constrains build in transitivity), symbolized by the feature transitive. Each one of the functions carries constraining feature information. As the figure indicates, there are two consequences of the conflation of FINITE with TEMPOo: 1. Feature constraints derived from independent choices are merged and co-constrain the final expression. In other words, for polarity reasons, had appears as had rather than hadn't, and for tense reasons, it appears in this form rather than for example has, have, wi//, or was. 2. The final sequence is a result of two independent ordering specifications, viz. the mood specification that FINITE comes before SUBJECT and the tense specification of the ordering of tense auxiliaries. In other words, as a tense auxiliary, had precedes been going to build, and as the finite element of the clause, it precedes the subject. 8.2 Other contributions to resultant clause structure Other aspects of the final structure come from transitivity, voice, theme etc. (as we have seen in section 5): -From transitivity we get AcToR, PROCESS, and GOAL with feature specifications. -From voice we get the conflation of SUBJECT with ACTOR. • From theme we get the conflation of THEME with FINITE. TO sum up: Depending on the perspective we lay on the clause, the phrase Sir Christopher Wren will be SUBJECT (interpersonal perspective) or ACTOR (ideational perspective). We say that these functions are conflated (symbolized SUBJECT/ACTOR). The conflation is the result of bringing independent lines of reasoning together. It is an operation that can only be performed on functions, not on categories like NP, N, and VP. The resultant structure is given in Figure 6 (associated features are left out). Note that had, Sir Chris, etc. are not the result of equally many functions. Some constituent play a role only in one component (e.g. tense: be going) whereas others realized more than one function (Sir Chris, for example). One important property of these conflations is that they could have been otherwise, if the choosers had received different responses fromthe environment and thus had made different choices. For instance, we could have SUBJECT/GOAL and get the clause Had a cathedra/ been going to be built by Sir Christopher Wren. Or, with a MODAL displacing TEMPO o in the conflation with FINITE: MODAL/FINITE followed by TEMPO c as in may have (instead of had). FINITE SUBJECT -negative","................................................................ TEMPO0/ TEMPO2 TEMPO3 past be going to-infinitive TEMPO1 have","................................................................","PROCESS","transitive","......................... . ........................................ had Sir Chris been going to build Figure 5: Mood and tense structures combined 162 Had"]},{"title":"Sir Chris","paragraphs":["I"]},{"title":"been going J to build I a cathedral I I I","paragraphs":["............................................................"]},{"title":"FINITE I SUBJECT J","paragraphs":["............................................................"]},{"title":"TEMPO0 I","paragraphs":["I I I"]},{"title":"TEMPO1 J I TEMPO2 l TEMPO3 I J ACTOR I J PROCESS I GOAL","paragraphs":["............................................................"]},{"title":"THEME I","paragraphs":["............................................................ Figure 6: Clause structure 8.3 A note on the development of the function constituents The structure presented above represents clause structure; the terminal functions are functions of the clause. It is the solution to the problems that the clause has evolved to solve. For the development of each constituent, we have to go to go either to lexicon or (back) to grammar. The verbal have lexical features associated with them and these features serve as constraints on what lexical items can be used. The ACTOR constituent and the GOAL constituent have to go through another round of development in the grammar, in the nominal group part of the grammar. Although I have not shown them, features are also associated with these two constituents. These features are grammatical and will serve as constraints on choices in the nominal group part of the network. This process is discussed in e.g. [Matthiessen 83]."]},{"title":"9 CONCLUSION","paragraphs":["The first concise presentation of systemic suggestions was published when what came to be called ACL was being formed. Now, roughly twenty years later, with the first meeting of the European chapter of ACL we can look back on substantial achievements in both computational linguistics and systemic hnguistics, some of them in co-operation. However, the most exciting developments are current and future. We can see the most ambitious applications of systemic linguistics to computational tasks to date. And we can see the growing interest in text generation, a task in the context of which systemic linguistics seems to have much to offer. Here I have.pointed to some properties and designs that come from the systemic tradition and which I think are of interest for the text generation task. Systemic linguists have done and are still doing pioneer work on text organization, turning up insights that will most certainly be important to the design of text generators. However, here.I have concentrated on contributions in the area of grammar and choosers for grammar with a view to showing how they help us fulfill the demands place on a grammar in a text generator. I have focused on the factoring of the sentence generation process that systemic grammar supports."]},{"title":"References","paragraphs":["[Berry 77] Berry, M., Introduction to Systemic Linguistics, B. T. Batsford, Ltd., London, 1977.","[Butler 83] Butler, C., \"Discourse Systems and Structures and their Place within an Overall Systemic Model,\" in Benson, J. & Greaves, W. (ed.), Systemic Perspectives on Discourse: Selected Theoretical Papers from the 9th International Systemic Workshop, Ablex, 1983.","[Davey 79] Davey, A., Discourse Production, Edinburgh University Press, Edinburgh, 1979. [Dik 78] Dik, S., Functional Grammar, North Holland, 1978.","[Fawcett 80] Fawcett, R. P., Exeter Linguistic Studies. Volume 3: Cognitive Linguistics and Social Interaction, Julius Groos Verlag Heidelberg and Exeter University, 1980.","[Halliday 69] Halliday, M.A.K., \"Options and functions in the English clause,\" Brno Studies in English 8, 1969, 81-88.","[Halliday 74] M.A.K. Halliday, \"The place of 'Functional Sentence Perspective' in the system of linguistic description,\" in F. Danes (ed.), Papers on Functional Sentence Perspective, Academia, 1974.","[Halliday 75] M.A.K. Halliday, Learning How to Mean. Edward Arnold, 1975.","[Halliday 76a] Halliday, M. A. K., System and Function in Language, Oxford University Press, London, 1976.","[Ha!liday 76b] Halliday, M.A.K., \"The English verbal group,\" in Kress, G. (ed.), Halliday: System and Function in Language, Oxford University Press, 1976. Originally circulated in 1966","[Halliday & Hasan 76] Halliday, M. A. K., and R. Hasan, Cohesion in English, Longman, London, 1976. English Language Series, Title No. 9.","[Halliday & Hasan 80] Halliday, M.A.K. & Hasan, R., Text and context, Sofia, 1980.","[Hasan 78] R. Hasan, \"Text in the Systemic-Functional Model,\" in W. Dressier (ed.), Current Trends in Text Linguistics, de Gruyter, 1978.","[Hasan 79] R. Hasan, \"On the Notion of Text,\" in J. Petoefi (ed.), Text vs. Sentence (Papers in Text Linguistics, volume 20), Helmut Buske Verlag, 1979. 163"]},{"title":"[Hudson 76] Hudson, R. A.,","paragraphs":["Arguments for a Non-Transformational Grammar,"]},{"title":"University of Chicago Press, Chicago, 1976. [Kay 79] Kay, M., Functional Grammar, 1979. Xerox Parc, Palo Alto [Mann 8,3] Mann, William C.,","paragraphs":["An Overview of the Penman Text Generation System,"]},{"title":"USC Information Sciences Institute, Marina del Rey, CA 90291., Technical Report RR-83-114, 1983. To appear in the 1983 AAAI Proceedings. [Martin 83] Martin, J., \"Process and Text: Two Aspects of Human Semiosis,\" in Benson, J. & Greaves, W. (ed.),","paragraphs":["Systemic Perspectives on Discourse: Se/ected Theoretica/ Paoers from the 9th /nternationa/ Systemic Workshop,"]},{"title":"Ablex, 1983. [Matthiessen 81] Matthiessen, C. M. I. M., \"A grammar and a lexicon for a.text-production system,\" in","paragraphs":["The Nineteenth Annual Meeting of the Association for Computational Linguistics,"]},{"title":"Sperry Univac, 1981. [Matthiessen 83] Matthiessen, C., \"The systemic framework in text generation: Nigel,\" in W. Greaves & J. Benson (eds.),","paragraphs":["Systemic Perspectives on Discourse,"]},{"title":"Ablex, 1983. [Moravcsik & Wirth 80] E. Moravcsik & J. Wirth (eds.),","paragraphs":["Syntax and Semantics, volume 13: Current Approaches to Syntax,"]},{"title":"Academic Press, 1980. [Winograd 72] T. Winograd,","paragraphs":["Understanding Natural Language,"]},{"title":"Academic Press, 1972.","paragraphs":["164"]}]}