{"sections":[{"title":"Dragon Systems,","paragraphs":["Inc. 90 Bridge Street"]},{"title":"Newton, MA","paragraphs":["02158","Tel. (617) 965-5200, FAX (617) 527-0372 ARPANET DRAGON@A.isi.edu Principal Investigators: Janet M. Baker and James K. Baker Objectives: Dragon Systems is developing and building high performance, computationallyefficient interactive speech workstations, to sup'port adaptive speech recognition of large vocabulary, natural language speech input in real-time. These systems are based on the results of the multi-knowledge source (MKS) algorithm architecture and multi-processor accelerator hardware studies previously undertaken by Dragon under DARPA auspices, and on Dragon's separately developed speech recognition systems (VoiceScribe, DragonWriter, and DragonDictate) and related work. A highly interactive user interface is being further extended to facilitate system ease-of-use as well as performance and throughput. The integration of a full application interface will enable system testing under realistic operational conditions. Extensive testiqg will be conducted with users of these capabilities and their associated user / application / communication interfaces, in a series of challenging interactive performance tasks. The overall objective is to provide advanced speech recognition capabilities for operating environments in which the user has a demanding real-time task. Accomplishments in past 2 years: 1. Demonstrated technical feasibility for multi2processor hardware architecture to support continuous"]},{"title":"speech","paragraphs":["recognition algorithms in a workstation. 2. Designed flexible multi-knowledge source algorithm architecture to accommodate disparate knowledge sources in a consistent framework. 3. Extended \"McNemar's Test\" to achieve greater sensitivity in significance measures of comparative recognition tests. 4. Collected discrete and continuous speech database for Resource Management task (991 words) with 7 speakers (about 50 K words total) in a moderate noise environment. 5. Conducted tests and evaluated results on discrete RM database with DragonWriter-1000 speech recognition system (includes 1 peripheral board and software) running in a 386-based MS.DOS personal computer. Plans for next 1 + years: During the initial phase of the present 3-year program, Dragon's continuous speech recognition algorithms will be ported into a multi-processor hardware and MKS software architecture hosted in an 80n86 (n>2) workstation. Dragon's on-line adaptive acoustic and language modelling algorithms will also be ported onto this platform as well as user and application interfaces. The primary performance task selected for demonstration and test-bed purposes is \"Interactive Transcription\". A user's speech will be transcribed interactively into text in real-time, through an application interface into a word-processing program for on-line report generation and document creation. It will also incorporate appropriate error correction and editing capabilities. Testing and the further development of evaluation methodologies will proceed in parallel. 143"]}]}