{"sections":[{"title":"Optimizing Story Link Detection is not Equivalent to Optimizing New Event Detection Ayman Farahat PARC 3333 Coyote Hill Rd Palo Alto, CA 94304 farahat@parc.com Francine Chen PARC 3333 Coyote Hill Rd Palo Alto, CA 94304 fchen@parc.com Thorsten Brants PARC 3333 Coyote Hill Rd Palo Alto, CA 94304 thorsten@brants.net Abstract","paragraphs":["Link detection has been regarded as a core technology for the Topic Detection and Tracking tasks of new event detection. In this paper we formulate story link detection and new event detection as information retrieval task and hypothesize on the impact of precision and recall on both systems. Motivated by these arguments, we introduce a number of new performance enhancing techniques including part of speech tagging, new similarity measures and expanded stop lists. Experimental results validate our hypothesis."]},{"title":"1 Introduction","paragraphs":["Topic Detection and Tracking (TDT) research is sponsored by the DARPA Translingual Information Detection, Extraction, and Summarization (TIDES) program. The research has five tasks related to organizing streams of data such as newswire and broadcast news (Wayne, 2000): story segmentation, topic tracking, topic detection, new event detection (NED), and link detection (LNK). A link detection system detects whether two stories are “link ed”, or discuss the same event. A story about a plane crash and another story about the funeral of the crash victims are considered to be linked. In contrast, a story about hurricane Andrew and a story about hurricane Agnes are not linked because they are two different events. A new event detection system detects when a story discusses a previously unseen or “not linked” event. Link detection is considered to be a core technology for new event detection and the other tasks.","Several groups are performing research in the TDT tasks of link detection and new event detection. Based on their findings, we incorporated a number of their ideas into our baseline system. CMU (Yang et al., 1998) and UMass (Allan et al., 2000a) found that for new event detection it was better to compare a new story against all previously seen stories than to cluster previously seen stories and compare a new story against the clusters. CMU (Carbonell et al., 2001) found that NED results could be improved by developing separate models for different news sources to that could capture idiosyncrasies of different sources, which we also extended to link detection. UMass reported on adapting a tracking system for NED detection (Allan et al., 2000b). Allan et. al , (Allan et al., 2000b) developed a NED system based upon a tracking technology and showed that to achieve high-quality firststory detection, tracking effectiveness must improve to a degree that experience suggests is unlikely. In this paper, while we reach a similar conclusion as (Allan et al., 2000b) for LNK and NED systems , we give specificdirections for improving each system separately. We compare the link detection and new event detection tasks and discuss ways in which we have observed that techniques developed for one task do not always perform similarly for the other task."]},{"title":"2 Common Processing and Models","paragraphs":["This section describes those parts of the processing steps and the models that are the same for New Event Detection and for Link Detection. 2.1 Pre-Processing For pre-processing, we tokenize the data, recognize abbreviations, normalize abbreviations, remove stop-words, replace spelled-out numbers by digits, add part-of-speech tags, replace the tokens by their stems, and then generate term-frequency vectors. 2.2 Incremental TF-IDF Model Our similarity calculations of documents are based on an incremental TF-IDF model. In a TF-IDF model, the frequency of a term in a document (TF) is weighted by the inverse document frequency (IDF). In the incremental model, document frequencies are not static but change in time steps",". At","time , a new set of test documents","is added to","the model by updating the frequencies        (1) where   denote the document frequencies in the","newly added set of documents",". The initial docu-","ment frequencies ","are generated from a (possibly emtpy) training set. In a static TF-IDF model, new words (i.e., those words, that did not occur in the training set) are ignored in further computations. An incremental TF-IDF model uses the new vocabulary in similarity calculations. This is an advantage because new events often contain new vocabulary.","Very low frequency terms ","tend to be uninfor-","mative. We therefore set a threshold",". Only terms","with   "," are used at time",". We use  . 2.3 Term Weighting The document frequencies as described in the previous section are used to calculate weights for the terms  in the documents ",". At time , we use   ","    "," ","  "," (2) where","","is the total number of documents at time  .   ","is a normalization value such that either the weights sum to 1 (if we use Hellinger distance, KL-divergence, or Clarity-based distance), or their squares sum to 1 (if we use cosine distance). 2.4 Similarity Calculation The vectors consisting of normalized term weights   are used to calculate the similarity between two documents ","and",". In our current implementa-tion, we use the the Clarity metric which was introduced by (Croft et al., 2001; Lavrenko et al., 2002) and gets its name from the distance to general English, which is called Clarity. We used a symmetric version that is computed as:","","           (3)                (4) where “  ” is the Kullback-Leibler divergence, ","is the probability distribution of words for “general English” as derived from the training corpus. The idea behind this metric is that we want to give credit to similar pairs of documents that are very different from general English, and we want to discount similar pairs of documents that are close to general English (which can be interpreted as being the noise). The motivation for using the clarity metric will given in section 6.1.","Another metric is Hellinger distance     "," ","         ","(5) Other possible similarity metrics are the cosine distance, the Kullback-Leibler divergence, or the symmetric form of it, Jensen-Shannon distance. 2.5 Source-SpecificTF-IDF Model Documents in the stream of news stories may stem from different sources, e.g., there are 20 different sources in the data for TDT 2002 (ABC News, Associated Press, New York Times, etc). Each source might use the vocabulary differently. For example, the names of the sources, names of shows, or names of news anchors are much more frequent in their own source than in the other ones. In order to reflect the source-specific differences we do not build one incremental TF-IDF model, but as many as we have different sources and use frequencies","  ","(6)","for source at time",". The frequencies are updated","according to equation (1), but only using those doc-","uments in  that are from the same source",". As a consequence, a term like “CNN” receives a high document frequency (thus low weight) in the model for the source CNN and a low document frequency (thus high weight) in the New York Times model.","Instead of the overall document frequencies    , we now use the source specific","     when calculating the term weights in equation (2). Sources","for which no training data is available (i.e., no data to generate","  ","is available) might be initialized in two different ways: 1. Use an empty model:","    "," for all  ;","2. Identify one or more other but similar sources  ","for which training data is available and use","  ","  ","    ",""," (7) 2.6 Source-Pair-SpecificNormalization Due to stylistic differences between various sources, e.g., news paper vs. broadcast news, translation errors, and automatic speech recognition errors (Allan et al., 1999), the similarity measures for both on-topic and off-topic pairs will in general depend on the source pair. Errors due to these differences can be reduced by using thresholds conditioned on the sources (Carbonell et al., 2001), or, as we do, by normalizing the similarity values based on similarities for the source pairs found in the story history."]},{"title":"3 New Event Detection","paragraphs":["In order to decide whether a new document","that is added to the collection at time","describes a new event, it is individually compared to all previous documents ","using the steps described in section 2. We identify the document   with highest similarity:","   ","","        "," (8)","The value","   ","   ","         ","is used to determine whether a document","is about a new event and at the same time is an indication of the confidence in our decision. If the score exceeds a threshold ",", then there is no sufficiently similar previous","document, thus","describes a new event (decision","YES). If the score is smaller than  , then  ","is suf-","ficiently similar, thus","describes an old event (de-","cision NO). The threshold  can be determined by using labeled training data and calculating similarity scores for document pairs on the same event and on different events."]},{"title":"4 Link Detection","paragraphs":["In order to decide whether a pair of stories ","and"," are linked, we identify a set of similarity metrics","that capture the similarity between the two documents using Clarity and Hellinger metrics:   ","","     ","        "," (9) The value    ","is used to determine whether sto-","ries “q” and “d” are linked. If the similarity exceeds","a threshold","","we the two stories are sufficiently","similar (decision YES). If the similarity is smaller","than ","we the two stories are sufficiently differ-","ent (decision NO). The Threshold","","can be deter-","mined using labeled training data."]},{"title":"5 Evaluation","paragraphs":["All TDT systems are evaluated by calculating a Detection Cost:  ","   ","   ","     ","        ","   ",""," (10)","where   and","","are the costs of a miss and","a false alarm. They are set to 1 and 0.1, respec-","tively, for all tasks.    and ","","are the condi-","tional probabilities of a miss and a false alarm in the","system output. ","","  ","and    ","","","a the a priori","target and non-target probabilities. They are set to","0.02 and 0.98 for LNK and NED. The detection cost","is normalized such that a perfect system scores 0,","and a random baseline scores 1:   ","     ","  "," min   ","     ","     ","  ","","  (11) TDT evaluates all systems with a topic-weighted method: error probabilities are accumulated separately for each topic and then averaged. This is motivated by the different sizes of the topics.","The evaluation yields two costs: the detection cost is the cost when using the actual decisions made by the system; the minimum detection cost is the cost when using the confidence scores that each system has to emit with each decision and selecting the optimal threshold based on the score.","In the TDT-2002 evaluation, our Link Detection system was the best of three systems, yield-ing   ","     ","     and","     ","            ",". Our New Event Detection system was ranked second of four with costs of ","                and","      ","     ","      ."]},{"title":"6 Differences between LNK and NED","paragraphs":["In this section, we draw on Information retrieval tools to analyze LNK and NED tasks. Motivated by the results of this analysis, we compare a number of techniques in the LNK and NED tasks in particular we compare the utility of two similarity measures, part-of-speech tagging, stop wording, and normalizing abbreviations and numerals. The comparisons were performed on corpora developed for TDT, including TDT2 and TDT3. 6.1 Information Retrieval and TDT The conditions for false alarms and misses are reversed for LNK and NED tasks. In the LNK task, incorrectly flagging two stories as being on the same event is considered a false alarm. In contrast in the NED task, incorrectly flagging two stories as being on the same event will cause the true first story to be missed. Conversely, in LNK incorrectly labeling two stories that are on the same event as not linked is a miss, but in the NED task, incorrectly labeling two stories on the same event as not linked can result in a false alarm where a story is incorrectly identified as a new event.","The detection cost in Eqn.10 which assigns a higher cost to false alarm",""," ","   ","         ","  ","","","    ",". A LNK system wants to minimize false alarms and to do this it should identify stories as being linked only if they are linked, which translates to high precision. In contrast a NED system, will minimize false alarms by identifying all stories that are linked which translates to high recall. Motivated by this discussion, we investigated the use of number of precision and recall enhancing techniques with the LNK and NED system. We investigated the use of the Clarity metric (Lavrenko et al., 2002) which was shown to correlate positively with precision. We investigated the","0","0.1","0.2","0.3","0.4 0.5","0.6","0.7","0.8","0.9","10 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1 Similarity CDF LNK − Clarity vs. Hellinger Clarity on−topic Clarity off−topic Hellinger on−topic Hellinger off−topic Figure 1: CDF for Clarity and Hellinger similarity on the LNK task for on-topic and off-topic pairs. use of part-of-speech tagging which was shown by Allan and Raghavan (Allan and Raghavan, 2002) to improve query clarity. In section 6.2.1 we will show how POS helps recall. We also investigated the use of expanded stop-list which improves precision. We also investigated normalizing abbreviations and transforming spelled out numbers into numbers. On the one hand the enhanced processing list includes most of the term in the ASR stop-list and remov-ing these terms will improve precision. On the other hand normalizing these terms will have the same effect as stemming a recall enhancing device (Xu and Croft, 1998) , (Kraaij and Pohlmann, 1996). In addition to these techniques, we also investigated the use of different similarity measures. 6.2 Similarity Measures The systems developed for TDT primarily use cosine similarity as the similarity measure. We have developed systems based on cosine similarity (Chen et al., 2003). In work on text segmentation, (Brants et al., 2002) observed that the system performance was much better when the Hellinger measure was used instead. In this work, we decided to use the clarity metric, a precision enhancing device (Croft et al., 2001). For both our LNK and NED systems, we compared the performance of the systems using each of the similarity measures separately. Table 1 shows that for LNK, the system based on Clarity similarity performed better the system based on Hellinger similarity; in contrast, for NED, the system based on 0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 10 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1 Similarity CDF NED Hellinger vs. Clarity Hellinger on topic Hellinger off topic Clarity on topic Clarity off topic Figure 2: CDF for Clarity and Hellinger similarity on the NED task for on-topic and off-topic pairs. Table 1: Effect of different similarity measures on topic-weighted minimum normalized detection costs for LNK and NED on the TDT 2002 dry run data. System Clarity Hellinger","% Chg LNK 0.3054 0.3777 -0.0597 -19.2 NED 0.8419 0.5873 +0.2546 +30.24 Hellinger similarity performed better.","Figure 1 shows the cumulative density function for the Hellinger and Clarity similarities for on-topic (about the same event) and off-topic (about different events) pairs for the LNK task. While there are a number of statistics to measure the overall difference between tow cumulative distribution functions, we used the Kolmogorov-Smirnov distance (K-S distance; the largest difference between two cumulative distributions) for two reasons. First, the K-S distance is invariant under re-parametrization. Second, the significance of the K-S distance in case of the null hypothesis (data sets are drawn from same distribution) can be calculated (Press et al., 1993). The K-S distance between the on-topic and off-topic similarities is larger for Clarity similarity (cf. table 2), indicating that it is the better metric for LNK.","Figure 2 shows the cumulative distribution functions for Hellinger and Clarity similarities in the NED task. The plot is based on pairs that contain the current story and its most similar story in the story history. When the most similar story is on the same event (approx. 75% of the cases), its similarity is part Table 2: K-S distance between on-topic and off-topic story pairs.","Clarity Hellinger Change (%) LNK 0.7680 0.7251   ","  "," (       ) NED 0.5353 0.6055","     "," (    ","   ) Table 3: Effect of using part-of-speech on minimum normalized detection costs for LNK and NED on the TDT 2002 dry run data. System  PoS ","PoS Change (%) LNK 0.3054 0.4224 -0.117 (      %) NED 0.6403 0.5873 +0.0530 (","    %) of the on-topic distribution, otherwise (approx. 25% of the cases) it is plotted as off-topic. The K-S distance between the Hellinger on-topic and off-topic CDFs is larger than those for Clarity (cf. table 2). For both NED and LNK, we can reject the null hypothesis for both metrics with over 99.99 % confidence.","To get the high precision required for LNK system, we need to have a large separation between the on-topic and off-topic distributions. Examining Figure 1 and Table 2 , indicates that the Clarity metric has a larger separation than the Hellinger metric. At high recall required by NED system (low CDF values for on-topic), there is a greater separation with the Hellinger metric. For example, at 10% recall, the Hellinger metric has 71 % false alarm rate as compared to 75 % for the Clarity metric. 6.2.1 Part-of-Speech (PoS) Tagging","We explored the idea that noting the part-of-speech of the terms in a document may help to reduce confusion among some of the senses of a word. During pre-processing, we tagged the terms as one of five categories: adjective, noun, proper nouns, verb, or other. A “tagged term” was then created by combining the stem and part-of-speech. For example, ‘N train’ represents the term ‘train’ when used as a noun, and ‘V train’ represents the term ‘train’ when used as a verb. We then ran our NED and LNK systems using the tagged terms. The systems were tested in the Dry Run 2002 TDT data. A comparison of the performance of the systems when part-of-speech is used against a baseline sys-Table 4: Comparison of using an “ASR stop-list” and “enhanced preprocessing” for handling ASR differences.","No ASR stop ASR stop","Std Preproc Std Preproc LNK 0.3153 0.3054 NED 0.6062 0.6407 tem when part-of-speech is not used is shown in Table 3. For Story Link Detection, performance decreases by 38.3%, while for New Event Detection, performance improves by 8.3%. Since POS tagging helps differentiates between the different senses of the same root, it also reduces the number of matching terms between two documents. In the LNK task for example, the total number of matches drops from 177,550 to 151,132. This has the effect of placing a higher weight on terms that match, i.e. terms that have the same sense and for the TDT corpus will increase recall and decrease. Consider for example matching “food server to “food service” and “ja va server”. When using POS both terms will have the same similarity to the query and the use of POS will retrieve the relevant documents but will also retrieve other documents that share the same sense. 6.2.2 Stop Words","A large portion of the documents in the TDT collection has been automatically transcribed using Automatic Speech Recognition (ASR) systems which can achieve over 95% accuracies. However, some of the words not recognized by the ASR tend to be very informative words that can significantlyimpact the detection performance (Allan et al., 1999). Furthermore, there are systematic differences between ASR and manually transcribed text, e.g., numbers are often spelled out thus “30” will be spelled out “thirty”. Another situation where ASR is different from transcribed text is abbreviations, e.g. ASR system will recognize ‘CNN” as three separate tokens “C”, “N”, and “N”.","In order to account for these differences, we identifiedthe set of tokens that are problematic for ASR. Our approach was to identify a parallel corpus of manually and automatically transcribed documents, the TDT2 corpus, and then use a statistical approach (Dunning, 1993) to identify tokens with significantly Table 5: Impact of recall and precision enhancing devices. Device Impact LNK NED ASR stop precision +3.1% -5.5 % POS recall -38.8 % 8.3 % Clarity precision +19 % -30 % different distributions in the two corpora. We compiled the problematic ASR terms into an “ASR stop-list”. This list was primarily composed of spelled-out numbers, numerals and a few other terms. Table 4 shows the topic-weighted minimum detection costs for LNK and NED on the TDT 2002 dry run data. The table shows results for standard pre-processing without an ASR stop-list and with and ASR stop-list. For Link Detection, the ASR stop-list improves results, while the same list decreases performance for New Event Detection.","In (Chen et al., 2003) we investigated normalizing abbreviations and transforming spelled-out numbers into numerals, “enhanced preprocessing”, and then compared this approach with using an “ASR stop-list”. 6.2.3 Impact of Recall and Precision","The previous two sections examined the impact of four different techniques on the performance of LNK and NED systems. The Part-of-speech is a recall enhancing devices while the ASR stop-list is a precision enhancing device. The enhanced preprocessing improves precision and recall. The results which are summarized in Table 5 indicate that precision enhancing devices improved the performance of the LNK task while recall enhancing devices improved the NED task. 6.3 Final Remarks on Differences In the extreme case, a perfect link detection system performs perfectly on the NED task. We gave empirical evidence that there is not necessarily such a correlation at lower accuracies. These findingsare in accordance with the results reported in (Allan et al., 2000b) for topic tracking and firststory detection.","To test the impact of the cost function on the performance of LNK and NED systems, we repeated the evaluation with"," ","and ","","both set to 1,","and we found that the difference between the two re-Table 6: Topic-weighted minimum normalized detection cost for NED when using parameter settings that are best for NED (1) and those that are best for LNK (2). Columns (3) and (4) show the detection costs using uniform costs for misses and false alarms.","(1) (2) (3) (4) Metric Hel Cla Hel Cla POS","","",""," ASR stop","","","","","  ","0.1 0.1 1 1","      ","  ","0.5873 0.8419 0.8268 0.9498","% change – +30.24% – +14.73% sults decreases from 30.24% to 14.73%. The result indicates that the setting (Hel,  PoS, ","ASRstop) is better at recall (identifying same-event stories), while (Clarity,  PoS, ","ASRstop) is better at precision (identifying different-event stories).","In addition to the different costs assigned to","misses and false alarms, there is a difference in the","number of positives and negatives in the data set (the","TDT cost function uses","","","","","    ","). This might explain part of the remaining difference of 14.73%.","Another view on the differences is that a NED system must perform very well on the higher penalized first stories when it does not have any training data for the new event, event though it may perform worse on follow-up stories. A LNK system, however, can afford to perform worse on the firststory if it compensates by performing well on follow-up stories (because here not flagged follow-up stories are considered misses and thus higher penalized than in NED). This view explains the benefitsof using part-of-speech information and the negative effect of the ASR stop-list on NED : different part-of-speech tags help discriminate new events from old events; removing words by using the ASR stoplist makes it harder to discriminate new events. We conjecture that the Hellinger metric helps improve recall, and in a study similar to (Allan et al., 2000b) we plan to further evaluate the impact of the Hellinger metric on a closed collection e.g. TREC."]},{"title":"7 Conclusions and Future Work","paragraphs":["We have compared the effect of several techniques on the performance of a story link detection system and a new event detection system. Although many of the processing techniques used by our systems are the same, a number of core technologies affect the performance of the LNK and NED systems differently. The Clarity similarity measure was more effective for LNK, Hellinger similarity measure was more effective for NED, part-of-speech was more useful for NED, and stop-list adjustment was more useful for LNK. These differences may be due in part to a reversal in the tasks: a miss in LNK means the system does not flag two stories as being on the same event when they actually are, while a miss in NED means the system does flag two stories as being on the same event when actually they are not. In future work, we plan to evaluate the impact of the Hellinger metric on recall. In addition, we plan to use Anaphora resolution which was shown to improve recall (Pirkola and Jrvelin, 1996) to enhance the NED system."]},{"title":"References","paragraphs":["James Allan and Hema Raghavan. 2002. Using part-of-speech patterns to reduce query ambiguity. In ACM SIGIR2002, Tampere, Finland.","James Allan, Hubert Jin, Martin Rajman, Charles Wayne, and et. al. 1999. Topic-based novelty detection. Summer workshop final report, Center for Language and Speech Processing, Johns Hopkins University.","J. Allan, V. Lavrenko, D. Malin, and R. Swan. 2000a. Detections, bounds, and timelines: Umass and tdt-3. In Proceedings of Topic Detection and Tracking Workshop (TDT-3), Vienna, VA.","James Allan, Victor Lavrenko, and Hubert Jin. 2000b. First story detection in TDT is hard. In CIKM, pages 374–381.","Thorsten Brants, Francine Chen, and Ioannis Tsochantaridis. 2002. Topic-based document segmentation with probabilistic latent semantic analysis. In International Conference on Information and Knowledge Management (CIKM), McLean, VA.","Jaime Carbonell, Yiming Yang, Ralf Brown, Chun Jin, and Jian Zhang. 2001. Cmu tdt report. Slides at the TDT-2001 meeting, CMU.","Francine Chen, Ayman Farahat, and Thorsten Brants. 2003. Story link detection and new event detection are asymmetric. In Proceedings of NAACL-HLT-2002, Edmonton, AL.","W. Bruce Croft, Stephen Cronen-Townsend, and Victor Larvrenko. 2001. Relevance feedback and personalization: A language modeling perspective. In DE-LOS Workshop: Personalisation and Recommender Systems in Digital Libraries.","Ted E. Dunning. 1993. Accurate methods for the statistics of surprise and coincidence. Computational Linguistics, 19(1):61–74.","Wessel Kraaij and Renee Pohlmann. 1996. Viewing stemming as recall enhancement. In ACM SIGIR1996.","Victor Lavrenko, James Allan, Edward DeGuzman, Daniel LaFlamme, Veera Pollard, and Stephen Thomas. 2002. Relevance models for topic detection and tracking. In Proceedings of HLT-2002, San Diego, CA.","A. Pirkola and K. Jrvelin. 1996. The effect of anaphora and ellipsis resolution on proximity searching in a text database. Information Processing and Management, 32(2):199–216.","William H. Press, Saul A. Teukolsky, William Vetterling, and Brian Flannery. 1993. Numerical Recipes. Cambridge Unv. Press.","Charles Wayne. 2000. Multilingual topic detection and tracking: Successful research enabled by corpora and evaluation. In Language Resources and Evaluation Conference (LREC), pages 1487–1494, Athens, Greece.","Jinxi Xu and W. Bruce Croft. 1998. Corpus-based stemming using cooccurrence of word variants. ACM Transactions on Information Systems, 16(1):61–81.","Yiming Yang, Tom Pierce, and Jaime Carbonell. 1998. A study on retrospective and on-line event detection. In Proceedings of SIGIR-98, Melbourne, Australia."]}],"references":[{"authors":[{"first":"James","last":"Allan"},{"first":"Hema","last":"Raghavan"}],"year":"2002","title":"Using part-of-speech patterns to reduce query ambiguity","source":"James Allan and Hema Raghavan. 2002. Using part-of-speech patterns to reduce query ambiguity. In ACM SIGIR2002, Tampere, Finland."},{"authors":[{"first":"James","last":"Allan"},{"first":"Hubert","last":"Jin"},{"first":"Martin","last":"Rajman"},{"first":"Charles","last":"Wayne"},{"first":".","last":"al"}],"year":"1999","title":"Topic-based novelty detection","source":"James Allan, Hubert Jin, Martin Rajman, Charles Wayne, and et. al. 1999. Topic-based novelty detection. Summer workshop final report, Center for Language and Speech Processing, Johns Hopkins University."},{"authors":[{"first":"J.","last":"Allan"},{"first":"V.","last":"Lavrenko"},{"first":"D.","last":"Malin"},{"first":"R.","last":"Swan"}],"year":"2000a","title":"Detections, bounds, and timelines: Umass and tdt-3","source":"J. Allan, V. Lavrenko, D. Malin, and R. Swan. 2000a. Detections, bounds, and timelines: Umass and tdt-3. In Proceedings of Topic Detection and Tracking Workshop (TDT-3), Vienna, VA."},{"authors":[{"first":"James","last":"Allan"},{"first":"Victor","last":"Lavrenko"},{"first":"Hubert","last":"Jin"}],"year":"2000b","title":"First story detection in TDT is hard","source":"James Allan, Victor Lavrenko, and Hubert Jin. 2000b. First story detection in TDT is hard. In CIKM, pages 374–381."},{"authors":[{"first":"Thorsten","last":"Brants"},{"first":"Francine","last":"Chen"},{"first":"Ioannis","last":"Tsochantaridis"}],"year":"2002","title":"Topic-based document segmentation with probabilistic latent semantic analysis","source":"Thorsten Brants, Francine Chen, and Ioannis Tsochantaridis. 2002. Topic-based document segmentation with probabilistic latent semantic analysis. In International Conference on Information and Knowledge Management (CIKM), McLean, VA."},{"authors":[{"first":"Jaime","last":"Carbonell"},{"first":"Yiming","last":"Yang"},{"first":"Ralf","last":"Brown"},{"first":"Chun","last":"Jin"},{"first":"Jian","last":"Zhang"}],"year":"2001","title":"Cmu tdt report","source":"Jaime Carbonell, Yiming Yang, Ralf Brown, Chun Jin, and Jian Zhang. 2001. Cmu tdt report. Slides at the TDT-2001 meeting, CMU."},{"authors":[{"first":"Francine","last":"Chen"},{"first":"Ayman","last":"Farahat"},{"first":"Thorsten","last":"Brants"}],"year":"2003","title":"Story link detection and new event detection are asymmetric","source":"Francine Chen, Ayman Farahat, and Thorsten Brants. 2003. Story link detection and new event detection are asymmetric. In Proceedings of NAACL-HLT-2002, Edmonton, AL."},{"authors":[{"first":"W.","middle":"Bruce","last":"Croft"},{"first":"Stephen","last":"Cronen-Townsend"},{"first":"Victor","last":"Larvrenko"}],"year":"2001","title":"Relevance feedback and personalization: A language modeling perspective","source":"W. Bruce Croft, Stephen Cronen-Townsend, and Victor Larvrenko. 2001. Relevance feedback and personalization: A language modeling perspective. In DE-LOS Workshop: Personalisation and Recommender Systems in Digital Libraries."},{"authors":[{"first":"Ted","middle":"E.","last":"Dunning"}],"year":"1993","title":"Accurate methods for the statistics of surprise and coincidence","source":"Ted E. Dunning. 1993. Accurate methods for the statistics of surprise and coincidence. Computational Linguistics, 19(1):61–74."},{"authors":[{"first":"Wessel","last":"Kraaij"},{"first":"Renee","last":"Pohlmann"}],"year":"1996","title":"Viewing stemming as recall enhancement","source":"Wessel Kraaij and Renee Pohlmann. 1996. Viewing stemming as recall enhancement. In ACM SIGIR1996."},{"authors":[{"first":"Victor","last":"Lavrenko"},{"first":"James","last":"Allan"},{"first":"Edward","last":"DeGuzman"},{"first":"Daniel","last":"LaFlamme"},{"first":"Veera","last":"Pollard"},{"first":"Stephen","last":"Thomas"}],"year":"2002","title":"Relevance models for topic detection and tracking","source":"Victor Lavrenko, James Allan, Edward DeGuzman, Daniel LaFlamme, Veera Pollard, and Stephen Thomas. 2002. Relevance models for topic detection and tracking. In Proceedings of HLT-2002, San Diego, CA."},{"authors":[{"first":"A.","last":"Pirkola"},{"first":"K.","last":"Jrvelin"}],"year":"1996","title":"The effect of anaphora and ellipsis resolution on proximity searching in a text database","source":"A. Pirkola and K. Jrvelin. 1996. The effect of anaphora and ellipsis resolution on proximity searching in a text database. Information Processing and Management, 32(2):199–216."},{"authors":[{"first":"William","middle":"H.","last":"Press"},{"first":"Saul","middle":"A.","last":"Teukolsky"},{"first":"William","last":"Vetterling"},{"first":"Brian","last":"Flannery"}],"year":"1993","title":"Numerical Recipes","source":"William H. Press, Saul A. Teukolsky, William Vetterling, and Brian Flannery. 1993. Numerical Recipes. Cambridge Unv. Press."},{"authors":[{"first":"Charles","last":"Wayne"}],"year":"2000","title":"Multilingual topic detection and tracking: Successful research enabled by corpora and evaluation","source":"Charles Wayne. 2000. Multilingual topic detection and tracking: Successful research enabled by corpora and evaluation. In Language Resources and Evaluation Conference (LREC), pages 1487–1494, Athens, Greece."},{"authors":[{"first":"Jinxi","last":"Xu"},{"first":"W.","middle":"Bruce","last":"Croft"}],"year":"1998","title":"Corpus-based stemming using cooccurrence of word variants","source":"Jinxi Xu and W. Bruce Croft. 1998. Corpus-based stemming using cooccurrence of word variants. ACM Transactions on Information Systems, 16(1):61–81."},{"authors":[{"first":"Yiming","last":"Yang"},{"first":"Tom","last":"Pierce"},{"first":"Jaime","last":"Carbonell"}],"year":"1998","title":"A study on retrospective and on-line event detection","source":"Yiming Yang, Tom Pierce, and Jaime Carbonell. 1998. A study on retrospective and on-line event detection. In Proceedings of SIGIR-98, Melbourne, Australia."}],"cites":[{"style":0,"text":"Wayne, 2000","origin":{"pointer":"/sections/1/paragraphs/0","offset":256,"length":11},"authors":[{"last":"Wayne"}],"year":"2000","references":["/references/13"]},{"style":0,"text":"Yang et al., 1998","origin":{"pointer":"/sections/1/paragraphs/1","offset":195,"length":17},"authors":[{"last":"Yang"},{"last":"al."}],"year":"1998","references":["/references/15"]},{"style":0,"text":"Allan et al., 2000a","origin":{"pointer":"/sections/1/paragraphs/1","offset":225,"length":19},"authors":[{"last":"Allan"},{"last":"al."}],"year":"2000a","references":["/references/2"]},{"style":0,"text":"Carbonell et al., 2001","origin":{"pointer":"/sections/1/paragraphs/1","offset":445,"length":22},"authors":[{"last":"Carbonell"},{"last":"al."}],"year":"2001","references":["/references/5"]},{"style":0,"text":"Allan et al., 2000b","origin":{"pointer":"/sections/1/paragraphs/1","offset":732,"length":19},"authors":[{"last":"Allan"},{"last":"al."}],"year":"2000b","references":["/references/3"]},{"style":0,"text":"Allan et al., 2000b","origin":{"pointer":"/sections/1/paragraphs/1","offset":770,"length":19},"authors":[{"last":"Allan"},{"last":"al."}],"year":"2000b","references":["/references/3"]},{"style":0,"text":"Allan et al., 2000b","origin":{"pointer":"/sections/1/paragraphs/1","offset":1050,"length":19},"authors":[{"last":"Allan"},{"last":"al."}],"year":"2000b","references":["/references/3"]},{"style":0,"text":"Croft et al., 2001","origin":{"pointer":"/sections/2/paragraphs/25","offset":89,"length":18},"authors":[{"last":"Croft"},{"last":"al."}],"year":"2001","references":["/references/7"]},{"style":0,"text":"Lavrenko et al., 2002","origin":{"pointer":"/sections/2/paragraphs/25","offset":109,"length":21},"authors":[{"last":"Lavrenko"},{"last":"al."}],"year":"2002","references":["/references/10"]},{"style":0,"text":"Allan et al., 1999","origin":{"pointer":"/sections/2/paragraphs/53","offset":195,"length":18},"authors":[{"last":"Allan"},{"last":"al."}],"year":"1999","references":["/references/1"]},{"style":0,"text":"Carbonell et al., 2001","origin":{"pointer":"/sections/2/paragraphs/53","offset":416,"length":22},"authors":[{"last":"Carbonell"},{"last":"al."}],"year":"2001","references":["/references/5"]},{"style":0,"text":"Lavrenko et al., 2002","origin":{"pointer":"/sections/6/paragraphs/10","offset":479,"length":21},"authors":[{"last":"Lavrenko"},{"last":"al."}],"year":"2002","references":["/references/10"]},{"style":0,"text":"Allan and Raghavan, 2002","origin":{"pointer":"/sections/6/paragraphs/20","offset":328,"length":24},"authors":[{"last":"Allan"},{"last":"Raghavan"}],"year":"2002","references":["/references/0"]},{"style":0,"text":"Xu and Croft, 1998","origin":{"pointer":"/sections/6/paragraphs/20","offset":856,"length":18},"authors":[{"last":"Xu"},{"last":"Croft"}],"year":"1998","references":["/references/14"]},{"style":0,"text":"Kraaij and Pohlmann, 1996","origin":{"pointer":"/sections/6/paragraphs/20","offset":879,"length":25},"authors":[{"last":"Kraaij"},{"last":"Pohlmann"}],"year":"1996","references":["/references/9"]},{"style":0,"text":"Chen et al., 2003","origin":{"pointer":"/sections/6/paragraphs/20","offset":1170,"length":17},"authors":[{"last":"Chen"},{"last":"al."}],"year":"2003","references":["/references/6"]},{"style":0,"text":"Brants et al., 2002","origin":{"pointer":"/sections/6/paragraphs/20","offset":1221,"length":19},"authors":[{"last":"Brants"},{"last":"al."}],"year":"2002","references":["/references/4"]},{"style":0,"text":"Croft et al., 2001","origin":{"pointer":"/sections/6/paragraphs/20","offset":1422,"length":18},"authors":[{"last":"Croft"},{"last":"al."}],"year":"2001","references":["/references/7"]},{"style":0,"text":"Press et al., 1993","origin":{"pointer":"/sections/6/paragraphs/22","offset":645,"length":18},"authors":[{"last":"Press"},{"last":"al."}],"year":"1993","references":["/references/12"]},{"style":0,"text":"Allan et al., 1999","origin":{"pointer":"/sections/6/paragraphs/36","offset":321,"length":18},"authors":[{"last":"Allan"},{"last":"al."}],"year":"1999","references":["/references/1"]},{"style":0,"text":"Dunning, 1993","origin":{"pointer":"/sections/6/paragraphs/37","offset":258,"length":13},"authors":[{"last":"Dunning"}],"year":"1993","references":["/references/8"]},{"style":0,"text":"Chen et al., 2003","origin":{"pointer":"/sections/6/paragraphs/38","offset":4,"length":17},"authors":[{"last":"Chen"},{"last":"al."}],"year":"2003","references":["/references/6"]},{"style":0,"text":"Allan et al., 2000b","origin":{"pointer":"/sections/6/paragraphs/39","offset":744,"length":19},"authors":[{"last":"Allan"},{"last":"al."}],"year":"2000b","references":["/references/3"]},{"style":0,"text":"Allan et al., 2000b","origin":{"pointer":"/sections/6/paragraphs/73","offset":833,"length":19},"authors":[{"last":"Allan"},{"last":"al."}],"year":"2000b","references":["/references/3"]},{"style":0,"text":"Pirkola and Jrvelin, 1996","origin":{"pointer":"/sections/7/paragraphs/0","offset":964,"length":25},"authors":[{"last":"Pirkola"},{"last":"Jrvelin"}],"year":"1996","references":["/references/11"]}]}
