{"sections":[{"title":"Second Conference of the European Chapter of the Association for Computational Linguistics Proceedings of the Conference 27-29 March 1985 University of Geneva Geneva, Switzerland Published by the Association for Computational Linguistics","paragraphs":["\\"]},{"title":"~;)1985, Association ['or Computational Linguistics Order copies of this and other ACL proceedings from: Donald E. Walker (ACL) Bell Communications Research 445 South Street MRE 2A379 Morristown, NJ 07960, USA PREFACE","paragraphs":["It was a great pleasure to be able to act as hosts for the Second Conference of the European Chapter of the Association for Computational Linguistics. Most of the credit for the success of the conference must go to those who submitted papers. There were almost twice as many as we were able to accept, thus allowing us to arrange a programme which, in its variety and quality, reflected the wide-ranging interests of European scholars in the field, although drawing upon the international computational linguistic community for its composition. The success of this meeting, and of its predecessor in Pisa, confirms that the establishment of a European Chapter to act in concert with its American-based older brother was indeed worthwhile. The growing membership and the large attendance at the Conference show that the Chapter is serving one of its purposes in stimulating research in the area.","Thanks are due to all those who contributed to the success of the meeting: to the members of the programme committee, whose job was by no means trivial, since each member took individual responsibility for a specific area of the programme; to the referees; and to all those who helped with the organisation. Special thanks should go to Mike Rosner and to Martine Vermeire, for all the energy and enthusiasm they put in to seeing that the practical arrangements went smoothly; to Kirsten Falkedal for her invaluable help in arranging the programme; and to Don Walker and Eva Hajicova for holding our hands when we needed them to. Finally, let me repeat that the most important support comes from the members of the association, whose enthusiasm has ensured that the European Chapter has grown from conception to a living and flourishing organisation in so short a time. May it continue to flourish. Maghi King Chair, Conference Committee"]},{"title":"ACKNOWLEDGEMENTS","paragraphs":["The ACL European Chapter and Istituto Dalle Molle Per gli Studi Semantici e Cognitivi, the host organization, wish to express their sincere thanks to Le Conseil d'Etat de la R6publique et Canton de Gen~ve, Le Conseil Administratif de la Ville de Gen~ve, L'Universit~ de Gen~ve, Le Centre Universitaire d'Informatique, and L'Office du Tourisme de Gen~ve. Appreciation is also extended to Union de Banques Suisses, Academic Press (London), Cambridge University Press, Elsevier Science Publishers, Kluwer Publishing, North Holland Publishing, and Springer Verlag."]},{"title":"ACL EL OPEAN C\"HAFTER OFFICIALS","paragraphs":["Clm~. Secretary:. Treasure~.","Adwisory Committee: Nominating Committee:. Eva Hajicova, Charles University Harry Somers, University of Manchester Michael Rosner, ISSCO Hubert Lehmann, IBM Heidelberg Remko L Scha, Bolt Beranek and Newman Benny Brodda, University of Stockholm Giacomo Ferrari, University of Pisa Gerald Gazdar, University of Sussex Peter Hellwig, University of Heidelberg Bente Maegaard, University of Copenhagen Chair:. Programm~ CommiZtee:. Local Arrangem~gs:."]},{"title":"CONFERENCE ORGANITATION","paragraphs":["Margaret King, ISSCO Leonard Bolc, Warsaw University FL Borer, Tel Aviv Jaime CarbonelL Carnegie-Mellon University Kimmo Koskenniemk University of Helsinki Juergen Krause, University of Regensburg Jan Landsbergen, Philips Laboratories Bente Maegaarck University of Copenhagen Stephen Pulman, University of Cambridge Jonathan Slocum, Microelectronics and Computer Technology Corporation Oliviero Stock. University of Rome Michael Rosner G. Adorni L Batori E. T. Briscoe hi. Calzolari NL Colombetti (3, Guida A. K. Joshi E. FL Klein H. Lchmann D, Parisi A. Sagvall Hein J. Slocum (3. J. van der Steen"]},{"title":"REFEREES","paragraphs":["G. Allen D. Arnold B. Boguraev D. ~ Bree R Brodda H. Bunt A. Cappelli T. Christaller L Des Tombe J. Friedman F.. Hajicova P. Hellwig G. Kallgren G. Kempen S. Krauwer T. L Kwee L Lesmo S. Machova S. Pulman G.D. Ritchie H. Schnelle B. Sigurd IC Sparck Jones J.I. TaR W. yon Hahn W. Wahlster ~v"]},{"title":"TABLE QF CONTENTS","paragraphs":["Natural Languages"]},{"title":"and","paragraphs":["the"]},{"title":"Chomsky Hierarchy","paragraphs":["Andras Kornai","How Does Natural Language Quantify? Michael Hess","Distributives, Quanti flers and a Multiplicity of Events Lesley Stirling 16","Montagovian De ftnite Clause Grammar IL I. Bainbridge 25","The Speci fu:ation of Time Meaning for Machine Translation Frank van Eynde, Louis des Tombe, Fons Maes","An ATN Treatment W H-Movement Hans Haugeneder","SAU M ER: Sentence Analysis Using Metarules Fred Popowich 35 41 48","Effective Parsing with Generalised Phrase Structure Grarrvnar Allan Ramsay 57","An Evaluation of METAL.\" the LRC Machine Translation System Jonathan Slocum, Winfield S. Bennett, Lesley Whiffm, Edda Norcroes","A Two-Way Approach to Structural Transfer in MT Rebecca Root 62","Various Representations of Text Proposed for Eurotra Christian Boitet, Nelson Verastegui, Daniel Bachut 73","Natural Language Processing and the Automatic Acquisition of Knowledge: A Simulative Approach Danilo Fum 79","Right Attachment and Preference Semant~s Yorick Wilk~ 89","How to Restrict Ambiguity of Discourse Barbara Dunin-Keplicz","Language-Based Environme~ for Natural Language Parsing A. Lehtola, H. Jappinen, E. Nelimarkka","Parametrized Abstract Objects for Linguistic Information Processing Helene Bestougeff, Gerard Ligozat","On the Representation of Query Term Relations by Soft Boolean Operators Gerard Salton 93 98 107 116","The Resolution of Local Syntactic Ambiguity by the Human Sentence Processing Mechanism Gerry Altmann","A Parser That Doesn't S. G. Pulman 123 128","Parsing Di ff~lties & Phonological Processing in Ital~ Rodol.fo Delmonte 136 ' 70","Design and Implementation of a Lexical Data Base Eric Wehrli .............","\"Lexifani$\" A Lexical Analyzer of Modern Greek Yannis Ko~ Yanis Maistros","A Probabilistic Approach to Grammatical Analysis of Written English by Computer Andrew David Beale","A Probabilistic Parser Roger Garside, Fanny Leech","Towards a Dictio,tary Support Environment for Real Time Parsing Hiyan Alshawi, Bran Boguraev, Ted Briscoe","Towards A New Type of Morphemic Analysis Eva Koktova 146 154 159 166 171 179","A Computational Theory of Prose Style for Natural Language Generation David D. McDonald, James D. Pustejovsky","An English Generator for a Case-Labelled Dependency Representation John Irving Tait 187 194 Augmented Dependency Grammar: A Simple Interface between the Grammar Rule and the Knowledge","Kazunori Muraki, Shunji lchiyama, Yasutomo Fukumochi 198","A Natural Language Interface Using a World Model Yoshio Izumida, Hir~hi IshJkawa, Toshiaki Yoshino, Tadashi Hoshiai, Akifumi Makinouch Interpreting Singular"]},{"title":"Definite","paragraphs":["Descriptions in"]},{"title":"Database Queries","paragraphs":["Genevieve Berry-Roche","Non Standard Uses of If D. ~ Bree, IL A. Smit","Using a Text Model for Analysis and Generation E. FimbeL I-L Groscot, J. M. LanceL N. Simonin","The Simulation of Stress Patterns in Synthetic Speech - A Two-Level Problem Timothy J. Gillott","Automated Speech Recognition: A Frwnework for Research Anne Johnstone, Gerry Altmann","A Rule-Based Approach to Evaluating Importance in DestTiptive Texts Danilo Fum, Giovanni Guida, Carlo Tas~o","A Problem Solving Approach to Generating Text from Systemic Grammars Terry Patten ,","GEMS: A Model of Sentence Production Domenico Parisi, Al~ndra Giorgi","Towards an Automatic Identification of Topic and Focus Eva Hajicova, Petr Sgall","User Modelling, Dialog Structure, and Dialog Strategy in Ham-Arts Katharina Morik","The Structure of Communicative Context of Dialogue Interaction A. S~ Narin'yanL O. P. Simonova 205\" 213 218 226 232 239 244 251 258 263 268 274 vi"]},{"title":"AUTHOR 12N'DEX","paragraphs":["Hiyan Alshawi Gerry Altman Daniel Bachut IL L Bainbridge Andrew David Beale Winfield Bennett Genevieve Berry-Rogghe Helene Bestougeff Bran Boguraev Christian Boitet D. S. Bree Ted Briscoe Rodolfo Delmonte Louis des Tombe Barbara Dunin-Keplicz E. Fimbel Yasutomo Fukumochi Danilo Fum Roger Garside Timothy Gillott Alessandra Giorgi FL Groscot Giovanni Guida Eva Hajicova Hans Haugeneder Michael Hess Tadashi Hoshiai Shunji lchiyama Hiroshi Ishikawa Yoshio Izumida H. Jappinen Anne Johnstone Eva Koktova Andras Kornai YannJs Kotsanis",". 171","123, 239 73 25 159 62 213 107 171 73 218 171 136 35 93 226 198","79, 244 166 232 258 226 244 263 41 205 198 205 205 98 239 179 154 J. M. Lancel Fanny Leech A. Lehtola Gerard Ligozat Akifumi M~inouchi Forts Maes Yanis Maistros David D. McDonald Katharina Morik Kazunori Muraki A. S. Narin'yani E. Nelimarkka Edda Norcrom Domenico Parisi Terry Patten Fred Popowich","G. Pulman James D. Pustejovsky Allan Ramsay Rebecca Root Gerard Salton Petr Sgall N. Simonin O. P. Simonova Jonathan SIocum R. A. Smit Lesley Stifling John Irving Tait Carlo Tasso Frank van Eynde Nelson Verastegui Eric Wehrli Lesley Whiffin Yorik Wilks Toshiak Yoshino 226 166 98 107 205 35 154 187 268 198 274 98 62 258 251 48 128 187 57 70 116 263 226 274 62 218 16 194 244 35 73 146 62 89 205 vii"]}]}