{"sections":[{"title":"","paragraphs":["THE ~ OF OOM~K/NICATIVE CONYEXr OF DIALOGUE INTERACTION A.S. Narin'yani, O.P. Sim~nova AI Laboratory, Cc~ter Center,","Siberian Division of the USSR Ac.Sci., Novosibirsk 630090, USSR ABSTRACT we propose a draft scheme of the model formalizing the structure of o~ut~tnicative context in dialogue interaction. The relationships between the interact-ing partners are considered as system of three automata representing the partners of the dialogue and enviror~ent. The o~l,nunicative cc~tence of the partners is defined by - the set M of all propositions reflecting the possible states of the three automata within the model; -","the set K of \"contracts\" representing all kinds of htm~nn-to-htm%an relationships (social, in-"]},{"title":"terpersonal, professional, etc.) which include","paragraphs":["fixation of particular roles for the partz~-rs; -","the set T of possible topics related to given \"contract \" The authors believe the system of the notions presented may be used as a basis for forming the communicative component in the dialogue system. I. INTRODUCIDRY Pd~4ARKS The elaboration of advanced user-computer dialogue systems requires the cc~m%mication la~ to be investigated and formalized. This d~n of research has not yet been officially acknowledged as a part of computational linguistics. HzDwever, developing the formal models of speech interaction requires to take into account not only linguistic but c~catire competence also. That is necessary for creat-ing natural-language systems as ~ii as any cc~licated systam of \"natural\" dialogue, and especially important in view of constructing new generation computers intended for mass non-programming users. We propose here a draft scheme of the model formalizing the structure of c~,~nicative context in dialogue interaction. The relationships between the in-teracting partners are considered as a system of three automata. TWo of them represent the agents of the dialogue and the third one is a model of the world including the envirorm~_nt of interaction and other agents if they participate. The autcrnaton-agent is the central con~ponent of the communicative competence model. We divide m~nory of each agent into extracommunicative and cut~t~nicative parts. The latter directly concerns with the relationships between the agents in projection onto the interaction process. Two restrictions have been accepted to simplify the model. (a) C~i,u~nicative ccrmpetences of both the agents, i.e. their beliefs about ccr~munication laws and actual state of their relations are identical just up to current communicative act (CA) because the contents of the act (including the cc~cative contents) at the moment of its producing is known to"]},{"title":"the speaker only.","paragraphs":["(b) Receiver extracts from CA just the same information the speaker implies. 2. INITIAL N317/)NS We shall introduce necessary notions and notations. Let {M} be a set of all propositions reflecting the possible states of the three automata within the model, and M be a memory representing the agents' mutually coordinated beliefs about the world. State of M at moment z (i.e. M ) is a consistent subset of propositions from {~}, each of which being characterized by index of certainty. The machinery of interaction between the agents is dcatinated by a systE~a of c o n t r a c t s. Here contracts represent all kinds of human-to-human relationships (social, interpersonal, business, etc.) For example, \"chief-subordinate\", \"official-client\", \"friends\", \"married couple\", \"patron-ward\", etc.","Contractis_represented with a tuple","k, X, Y. Cond, Cond-Act, Cond-Des, T,","where","k is a name of contract;","and Y are roles of partners X and Y in the","contract;","Cor~, Cond-Act and Cond-Des are consistent","subsets of propositions from {M}, called general","conditions, conditions of activation and conditions","of desactivation of the contract, respectively;","T is a set of interact/on topics related to","given contract. The interaction between the agents is realized by"]},{"title":"means of communicative acts (CA), in particular,","paragraphs":["of speech acts. Every CA is characterized with roles (author-receiver), aim, topic and value of phase function indicating the relation between CA and the topic (CA can be initiating, continuing, closing and re-initiating in respect to its topic). A subsequence of coherent cL~municative acts connected with the sane topic is called a t-i n t e r a c t-i ng. Discourse is considered as a system of ~a-bedded t-interactings. The simplest t-interacting"]},{"title":"274","paragraphs":["may consist of a single CA which simultaD~ously initiates and closes its own topic (for example, CA requiring no reaction fran the receiver). Topic is represented here by the following tuple","t, X, Y, Cond, Aim, Scr, Cnsq, where","t is a name of topic;","X, Y and Cond have the same meaning as for","contract in the above definition;","Scr is a set of s c r i p t s of t-interactings which realize the topic t (a script is either a single CA being the simplest t-interact-ing mentioned above or a chain of correlated ~m-bedded subtopics, respectively); the scripts in Scr may he just listed or/and specified by means of a formal generative procedure;","Cnsq is a set of all possible consequences of closing t, i.e. a set of modifications of the m~nory M resulting fran t-interactings which realize the potential scripts of Scr;","Aim is a subset of Cnsq which conventionally is considered as the aim of agent initiating the topic t. Initiating some topic t the agent chooses sane script from Scr he plans to realize; in general case a script allows several possible continuations at every intermediate point of its realization, one of these continuations corresponds to the script the agent plans to realize at the given moment.","3. OCX4~%~CATIVE CONTEXT Thus the ccm~micative competence of the agents is defined by the set {M} of propositions, the set {K} of contracts and the set {T} of topics possible for X and Y. To demonstrate the functioning of our model we shall consider the component of M related directly to the process of ccm-n~/nication. This component being called Ccrnmunicative Context (CC), includes: -","a set Tr of current topics, i.e. the topics initiated before a nu,ent T and not closed yet, to each topic t H T current script of its realization is put in correspondence. The topics belonging to TT are hierarchically embedded so that the topic t is embedded into the topic t' (or t' is on higher level than t) if t is initiated according to the current script of t'; a current topic/script which CA,:_ 1 belongs to,will be referred as actual topic/script; - a set K T of contracts being in the activated state for the agent at the moment r; -","a subset +KtC K T of contracts related to the topics included--in TT; i.e. the contracts immediately related to the contents of the interaction. The transformation of K T is defined by the following rules (for each k 6 K) ; (a) if Cond-Act (MT) and k E K r is true, then the contract k is included into KT+I; (b) if (k E KT)&(COndk(MT)=false), i.e. conditions of the contract k are not fulfilled, the contract k is excluded from KT+ 1 ; (c) if Cond-DeSk(Mr)~k E K T is true, the contract k is excluded from KT+I; it does not mean that Cond-Des k (M T ) - NO Cond k (M T ) takes place. The rules (a) and (b) require Cond-Actk(MT)- -Cond k (M~). For the contracts in K a system of relations can be defined, for example: contracts kl and k2 are mutually incompatible if COndk1&Condk2=false; kl is ~ n c o m p at i b 1 e with k2 if (k2 6'KTVCondk2(~)) -","(Cond-DeSkl (M~)V NO Condkl);kl implies k2 if (CondklV Cond-ACtkl)- Cona-ACtk2 or k16Kt~Cond- -ACtk2 (M T). The main scheme of the considered machinery of communication can be described as follows. A current state M~ causes agent (X) to set scme goal; X fonts a plan to achieve the goal and begins to realize it. Some step of X's plan demands to involve the partner Y: to perform definite action or to accept sane proposition as valid or to provide in-formation needed, etc. To get this result is the aim of X at the given step of this plan. To gain the aim, X should choose an appropriate topic (one of the topics with this aim). In the simplest case it is possible to use just the next topic t in the script of the higher level topic with an aim being more general in the X's plan than the current one. In this situation initiating the sub-topic t produces minimal modification of CC (which is adding t to T) and does not modify the set K of the activated contracts and its subset +K. In more complex cases to initiate an approprite topic t it is necessary to include in +K one of contracts from K/+K or even to activate sc~e new contract k', i.e. to include k' in K. Clos-ing a current topic t may produce sane consequences ~ C~sqt with the corresponding modification of M which can lead to - the end of c~,,~unication, -","a new goal for X and/or Y, - moving to the next subgoal in the current plan. In the next section we shall consider the spectrum of possible situations related with realization of current CA. 4. MODELLING THE PROCESS Each current act CA r may be initiating, continuing or closing with respect to embedding topic t belonging to T T . The initiation of the topic t by CA~ may correspond to three different types of situations: \"normal order\", \"interruption with return\", and \"interruption without return\". (a) Normal order covers the following situations: - the previous act CAT- 1 has closed the topic t\" and the topic t is the next in the script the topic t' belongs to; if t' closes simultaneously several consecutively embedded topics, then t is the next topic of the script of the lowest unclosed topic; - CAT- 1 has closed one of the highest-level topics belonging to TT- I, then (i) t belongs to one of the contracts frcm +Kr_ I or (ii) the contract k has been activated, but not included into +Kr_ I (i.e. k 6 K./+K~), or (iii) t activates a new contract k E~ } and includes it into K T and +K T (that is possible if the initiation of t"]},{"title":"275","paragraphs":["nt munent z leads to fulfillment Cond-Act k (Mw) ; (b) Interruption with return covers the following situations: the topic of the act CAT- 1 b~s nob been closed yet, but t is another topic of the same or another contract; if a change of topic is marked by \"interruption with return\", then this \"deviation\" is necessary either (i) for continuing the interzzA0ted topic (return after some previous interruption), or (ii) for the realization of the high-priority aim related to the new topic t; (c) interruption without return covers the situations described in (b) but without the \"return\" mark as well as the following situation: the topic of the act CA~_ 1 is not closed and t is the next topic of the same or higher-level script; the interlnlption withot~t retttr~% us1~lly means by default that the interrupted topic is considered to be closed with success or failure depending on the interrupted and new topics). The act CA~ ccntinued actual tepic t may be realized in situations related to the normal order or to the return after interruption. (a) normal order means that CA~ continues the topic of the previous act CA~_ 1 ; (b) return after interruption means that CA~ continues the topic remained to be unclosed ur~ \"the interruption with return\". The topic t being closed by the act CAT, some or all modifications listed in Cnsqt take place in the m~r~ry M. These m:~ifications reflected in MT+ 1 can cause the following situations: (a) KT+I = K T , i .e. no contracts are activated or desactivated, the current script of the actual topic and higher-level topics are not alternated; (b) KT+I = KT, but one/some of the current scripts are alternated; (c) contract k is closed (i.e. Cond-Desk(M~+l) = truth) ; (d) other contracts are cloud and/or activated. The work presented is the part of the integral project on the lanquage interaction model being elaborated in our laboratory. The authors believe the system of the notions presented may be used as a basis for forming the communicative comp3nent in the dialogue systems including the natural-language interfaces."]},{"title":"~CES","paragraphs":["I. Dijk, Teun A.van. Text and Context. Explorations in the semantics and pragmatics of discourse. L.-N.Y., 1977;","2. Narin'yani, A.S., Gaft, R.I., Debrenr~, M., Pershina, E.L. Cu,uLunicative Interaction and the Functions of Speech Acts. - to appear in \"Linguistics, AI and Language Understanding\".","3. Perret, H. Context of Understanding. Pragmatic and beyond. 1980. VIII.","4. Svend, Erik Olsen. Psychology interaction and pragmatic linguistics. - In: Pragmalinguistics, The Hague, 1979."]},{"title":"276","paragraphs":[]}]}