{"sections":[{"title":"","paragraphs":["BY ILI~jI~ SEMANTIC CL~k%</IFICATtONS IN TIE LEXI(XIN Eler~ V.P/ff)USTIEYA and Ekaterina VoRAKHILINA","Institute of\" ~-' c, ooientifll~ and Technical Inf'ormation,","Academy of Sciences of' the USSR [~ievicha 20a 125315 Moscow Abstract","In this paper we investigate general principles of constructing semantic classifications that yield useful predictions combinatory options Several semantic Russian words are concernin~ of words.","classes of","discussed,","implemented in an expert system","named \"Lex i co~raphe r\", the","\"Lexicographer\" is supposed to provide its users with all kind of information concerning some 15.000 most common Russian words. Alon~ with morphological, syntactic infor.~tion conventional system information","and semantic usually stored in dictionaries, the should contain about referential characteristics of words and about restraints in combinability with other words in syntactic constructions of different types. In its final version \"Lexicographer\" should provide the users with all sorts of bibliographical information system beinff conceived as an aid both in the area of natural language processin~ arid in traditional lexicography. Semantic Features proposed regulate co-occurence of verbs with their non-obli?atory dependents - such as Modifiers of place or time; Instrumental and Benefactive objects and the like. ( concern i n~ both i nd i v i dual words and semantic classes of words) and with concordances made on the bas i s of a suffi c i ent ly re presentat i ve corpus of Russian texts.","One of the basic components of the system is its"]},{"title":"lexicon;","paragraphs":["the lexicon contains information not only about individual lexer~s, but also about sen~ntic and syntactic classes of lexemes. Thus, for nominal lexe~es such features are ~iven as: \"NATURAL CLASS\", \"ARTEFACT\", \"MASS TERM\", \"SET\", \"BODY PART\" and the like.","For predicates the lexicon i yes the values of such I 2.31 features as Vendlerian classes (STATE, ACT IV ITY,"]},{"title":"ACCOMPL I SHMENT, ACH I EVEIvENT),","paragraphs":["of. [I]; NONCONTROLLED possibility subordinate","[g], etc. It is argued that cases combinability of CONTROLLED vs. action [2, p. 32]; off having a indirect question in many a. word can be predicted on the basis off the semantic class(es) it belongs to. Thus, semar~tic classifications will be the main","topic off our exposition. It turned out that altogether different approaches ar'e required for semantic classifications off predicates and For lexemes with non predicative neaning. In this paper we give central attention to the predicative zone off the lexicon. Semantics of verbs has been studied intensely in recent year's, of. works by Ch. Fillmore [3], Z. Vendler [i], L. Karttunen [3]. it was a long tradition for linguists to lay the strongest emphasis on the se,emtic properties verbs. Our ~oal will be to attract individual","off separate in this paper attention to those semantic properties of verbs that affect their combinability and still are common to more or less numerous","verb classes. Thus, combinability of verbs with subordinated noun phrases or adverbials designating place, time~ re&~on~ purpose~ Instrun~nt and other parameters of the situation denoted by a predicate (taken together with its arguments) was usually. assumed to be non-restricted. This is definitely not the case, and the problem deserves special attention. There are some well known important observations made in this area. Thus, as is known, one of the Vendlerian classes - accomplishment verbs - is singled out by the fact that some verbs combine with a special kind of time adverbials, such as in two hours; these adverbials designate a period of ti~re dur'in~ which went on and finally","inFerent limit. In what follows the process reached its we shall demonstrate several sen~nt ic cl&sses of Russian verbs with the correspond i ng rules of sen~nt i c co- ocourence restraints. We ar,~ue that the restr.ai nts d i soussed are semantic in their nature; thus, it is natural to suppose, that some analogous or. co~nate r-estrai nts would hold For corresponding sel~ntic classes of verbs in other\" languages. CF. the look by A. Wierzhbioka [8] where the author strives for selm%ntic explar,ations in ~r,a~zr in a broad sense of the word, namely, tries to find semantic mot i vat i on for every co-occurrence restriction in the cho ice of morphemes or grammat i cal construct ions. 1. There ar'e classes of J.ooatiorl JYl tJ.rr~ riOT' ih :gp~-~CO i:~ boss i b 1 e. One off such c].&sses is c;onstituted by the so-called we i~ht\", B;tIa~egb \"to possess\", ~HaTb • 1:0 know • , Hafffe,ffTZ-,c~z ' to hope • , nO~}{~Tb • to rerrember\" etc. (Stab:re states are opposed t:.o the so--cal led"]},{"title":"temporary","paragraphs":["states of. such pr.edicates ~eoea~TbC~ • to make Fun • , Ob~Tb E.oao~,¢ • to be hungry • , rmaB~ • drunk • etc for which localization i.n time is possible. Another\" cl,._~s with the s,m~e combinatorial properties is constituted by causative verbs denoting\" situations that ~ive states a~s their, results, cf. pa- ~O~aT~ \"to cause j oy • , o~opqaTb • to grieve\", pe~oMeH~oP, aTb \"to reoo~t~llend\" , 8St'PITh \" to l:rk:%ke an[ry\" etc. Note especial ly verbs denot ins changes in social state such as OS;flOBeTb : to","become, a widow'. Verbs of these semm]t ic cl~¢sses do not a].low of place or' time adver'bials (of all tirre adverbials only those cooccur, with such verbs that denote super-lon~ intervals, such as pa~e \"before\", B MOJIO~[OOTH \" in the youth\", l{oa~a-TO \" long a~o', cf. [5]).","In order to explanation restraints of","~ive semantic oF '' ~ '~ CO-OCOUr~.r~c~","a verb it is sometin~s necessary to use a more exact classification of time modifier's. Thus, the ve~'b ...o o~uUI With ~fl°l J.dv~t bJ.~il expr'essing exact t ir~ (~OH oi~o~J.- Z#a;/i ~ 14. ~:~0), [hough for other, Perfect ive verbs in Russian such trod i Fi c,~at- i on usual 1V. i s not precluded (0~ npza~e~ .B I4.30), o~t. different iat ion oF exact t i ~e arid e~r~rac i n%\" t i ~. i h [ 5] o T~ L. ver'b OFiOS/~aTb i ;_-, hot unique in its serr~]tic c, lass, cF. su.~-\" c' - verbs as- yc:neTb. • to be in ti,e •, OTCTaT~, aaTs~yrrbc~ ( 21o~at{ 8aTSHyaOzO, aa,lfep~aTbC,~, COXpSH~fTbOS arid so[0e other's. ~.°° There is aJ-~ interest_ in~ dist.inction that has r, et~ined unnoticed up till"]},{"title":"now,","paragraphs":["nm~ely, a distir~t.ion'r' - between c:oncr.~.t~._ .. _ and non-concrete verbs. A verb is ¢x~r~,-ete if it designates (in a proper context) a sit.uation that is supposed to go throufi'h a series of phases in its natural development each of which can be fi'iven a detailed descr~p.ion. Indeed, for a situation described by a verb de;waTb •to run • or, peaaTz~ •to cut\" (both of them concrete) it is always possible to say, for every fixed ~on~nt, what the"]},{"title":"subject","paragraphs":["involved in the situation is doing at this moment. On the other hand, there are verbs that p~esent the situation in such a way that they emphasize the final result of the action described while the rrea~s used in order to achieve this result remain in the shadow; and tt~is semantic feature characteristic of\" their use ~'~d understanding\" 233 must be reflected in the ir lexicographic representation. We call such verbs r~-~rete. Thus, OTOMOTMTb means \" to reven~e oneself for\" an evil committed eaz'lier\" ; but the means used in order to attain this goal are irrelevant. As a consequence, no concrete phases can be discerned in the action denoted by this verb: the verb OTO~CT~Crb does not express \"an unfolding a~t ion\", even when used in the Imperfective. The same is true for the verb ncnop-T~ \"to spoil\", which is also non-concrete: ~c no pTzT~ means \"to deprive of the possibility of normal functioning'; but the way in which this deprivation is fulfilled is irrelevant for the meartin~ of the wor'd~ so it+ has no phases, it does not denote a developin[ process. Non-concrete verbs very often are aspectual ly defective; namely, they either have no Imperfective or, bein~ used in the Imperfect ive, they lack Progressive meaning. Thus, amon~ the verbs that, accordin~ to Ju. Apresjan [7] belong to the class of the so-called momentary verbs (achievements in Vendler' s terminology) and thus lack a Pro~r.essive meaninff there is a major group of verbs that owe the i r momentar i hess to non -concreteness; cf. noSe;~TaT~ \"to win\", \"to succeed' ; aaOTM8aTb, 8aOTaBaTb ; PIBMeHSTb < po1[PIHe> ; sapywaTh rlpaBZgIO \"to violate the r'ule\" ; o~xoT~fPb 8al~OH \" to 234 4 violate f\"+~. ...... + _ +t t.. J.,LI, W , H~+t~+~6ti+,~Tb < TO-S,.'<D+~e~b t,o fai ], ; paas+agm2v~ <Tc~I,~Hy> ; C,rie/qOSaTb <OOB6~TX> \" [.O fo]. low the adv ice\" :, Co}epWaTL, spex \"to sin', et.c. (1) a. Oe~a~ c .d?a~e~oM \"r'm~ with a tor'ch <in his herod> ; b. *MOT~Ia c nOpT(.lSeaeM <B py~_.> \"r'eveng'ed hi rr~e 1F bag\" < in his with a r tal l,.J ;- ( 2] a. F;~oOt4JI qaObI MOJIOTP~DM \"broke the watc, h with the hammer\" ; y~ap~a naam-J~ \"hit. with a st t,.k ; .~icrlop'z!4Ji <qaObl> MO~OTI-ff~M \"spoiled the wa,tc-h with a ha~rer'\" ; ~ocmppdH3/ nad~o# \"reveng'ed himself with a st. i ok\". 3. Not every predicate can c,jooccur' with such a c,,ot~mo~t- - tvoe. of verb-complement as Benefac-tive (expressed in Russian with the help of the proposition ~[Jzs \"for'). Thus, it is impossible to say ~dO~TbO~ ,~dZS I<O~O-Jn4dO \"to be aZr.aid for' stub,' *'Sa~CTbc~-' smb ~.rl~ l-eoso-JII4~o 't.o swe~\" for' - ' etc. These restrictions are easily deducibly from serremtic decompos i t ion of the Benefact ive construction: X P ~a~ Y = \"X did P having\" in mind to provide Y with the result of P'. It, follows from this decomposition that a predicate for which this construction is possible must denote art action that is both a contr, olled one and ar~ action havin~\" some_, definite result. Th i s i s ~hy Uene fach i re complement cannot co-occur with the verb dOaTbCa, de not i n~ non-control led state, or with the verb ~wi~cTbca, denotin[ an action with no result. It is a well-known fan~t that verbs denotin~ non-controlled act ions normally do not co-occur with a modifier of purpose; thus, such quest ion m-~ *Sa~e~ ~]~OT c~ea? ~a~eM Mope ~,y~}fT? ~e deviant (questions about the cause of such states are normal: flov, e~y H]IeT cries? l-lo~e~v Mope"]},{"title":"Thus,","paragraphs":["if the diction~'y contains informat ion about the feature CONTROL, then the behavior of a verb with :respech to a modifier of\" purpose becomes pred i ctabl e. (3) *flO~eMy OH a~aem? .Ik)qe~y OH do~eeT? .Ilo~e~y OH MOgm~O~","(4) Ilor~eMy Tb! CTOMmD ? llo[[eMy Tbl MOJtql,IIff~ ? Predicates in (3) denote states that are cal led determinate i n [6]: these states develop in t i 1~ accord ins\" to the i r owr~ laws~ ~-~cl it. is impossible f'or the subjecst to chan~e his state of his own accord, And this se~nt.ic feature \"\" \" expia~ ns t.he d ifferenc, e between (S) awl (4), Summary It is customary to think that co-ooourence possibilities are determined only by individual properties of words: dependencies that do not correspond to predicate-argument relations are not semantically ~tivated, Our research shows that. there are no syntactic relationships without semantic back~roundin~, though serr~%ic features of words that r,e~utate co-occurence ew, e not always easy to discover,. Re f'e r' e n c e s 1,. Vendler Z. Verbs and times. - Philosophical reviews, 1957, v. 64, p. 143-160. 2. Dik S. Functional ~rammar. . -Amsterdam etc: C., 1978. Karttunen L. constructions complement Langu~es, 80. 4. Fi 1 lmore NorthHolland P. La lo~ique des an~laises a predicatif. - 1978, N 30, p. 86-Ch. How to know . . whether you' re comi rL8 or ~_oins:, - In: Essays on deixis, / Ed. by Rauh G, Tubins-en: Naz, r, 1983. - p. 219-£27. Wierzbicka A. The sel~nt.ics of ~rammar: A~ster'dam, etc. : Jho~n Senjamins, 1988. IIa~ty~eBa E, B, I~ aeMaHTH~eoKo~,] F~acc~Ka~H B!DeMeHHb~X ~eTep-MHHaHTOB rlpe£Jlo~tieHH£, - B I<H, ; HANK: CHCTeMa I~ ~yHKI~HOHHpoBa-HHe. 16: Hay~a, 1988. 5\" 235"]},{"title":"7. Ha~y~eBa E.B. ~mO~Ma ~H","paragraphs":["OnOOOOHOCTB HO~HaTB KOCBeH-HBlfl Bo~poc H3 ceMaHTHEH O~oBa~ - B KH.: 8HaH~e H MHeH~e. ~: IIayKa, 1988, c. 33-46, 8. Pax~Ha E.B. Ke~ ~ np~HHa."]},{"title":"P~npoeH ~S~KOSHaHHa, 1.989, N6. 9. AnPec~H ~ ~. P~aro~bl MOMeH-","paragraphs":["Ta~HOrO ~e~CTB~ R nep@opMa-THB~ B pyccKoM aa~e. - B KH.:","Pyc~cTH~a cero~H~. ~: HayKa, OR"]},{"title":"~,~6 6","paragraphs":[]}]}