{"sections":[{"title":"","paragraphs":["SOME RE~h~RXS ON CASE RELATIONS","JGrgen Kunze","Zentrallnstltut fGr Sprachwissenschaft","Akademle der Wissensch~ften der DDR Prenzlauer Promenade 149-152","Berlin","DDR-1100","ABSTRACT","The topic of the paper is the problem how to define case relations by semantic predicates. A general principle is out-lined, which renders it possible to \"calculate\" case relations for a given representation of a (verb-)sememe by means of expressions. This principle is based on an assignment of case relations to primitive predicates and modification rules for nested expressions. Contrary to the traditional case grammar it turns out ~ha~ one needs mixed case relations, especially for two reasons: Arguments occur at \"too different\" places in an expression or arguments ~iave combined case relations. The consequence is that case relations don't form a set of isolated elements but a structured system. I. Introduction","The paper is not intended for defending case relations in general. I want to s~e~ch only some problems connected with the definition of case relations ~ud will demonstrate consequences, which seem partly a oit \"unconventional\".","I will not enter into the terminological discussion on deep cases, case relations etc. and subsume all these variants under the label \"case relation\". This is justified by the obvious fact that there are more proposals and systems than authors. So one will not overcome this chaos by neat terminological distinc-tions. It is rather typical for publica-tions on deep cases that proposals are presented without sufficient motivation or justification (e. g. Nilsen 1973).","It has turned out tha~ in the matter of case relations as a field of linguistic and fundamental research intuition and language competence cannot show the right way how to solve the problems of defining them. This is my first conclusion from the general scene. Without doubt it is inevitable to work out some principles on the basis of which case relations may be defined. This would enable us - to discuss a rather \"clear\" object","(some principles instead of tens (or","hundreds) of proposals), - to evaluate and compare existing pro-","posals, - to connect case relations with other","essential notions. Quite another question is \"What are case relations good for?\". One cannot ignore the fact that a lot of serious objections against case relations have been advanced, covering a whole range from \"they are redundant\" till \"the swamp of lacking plausible (or even formal) definitions\" resulting in the conclusion that case relations are useless especially for computational linguistics (Mellema 1974, Luckhardt 1985). On the other hand many authors are advocates pro case relations, even in MT (e. g. Nagao 1986, Somers 1986). Here the character of case relations as a link (or pivot) is stressed - between surface and deep level or between","nguages. For sucA situations one can","cept the use of case relations without exact definitions having an experimental system as a touchstone.","Case rela~ion~ are considered here as names or labels of arguments in semantic"]},{"title":"~","paragraphs":["redicates used for the description of verb-)sememes. This is only one side of the coin! The second important aspect are the means by which deep cases are expressed at the surface (grammatical cases, prepositions, linear order, ...). They have to be taken into account as well, and only both aspects together will yield an adequate picture. 2. Case relations and semantic predicates","One possibility to grasp the whole problem seems to be the definition of case relations on the basis of semantic predicates. Sememes (of vero-lexemes) are represented by expressions containing primitive semantic predicates. The following expression may be assigned to a verb like \"to convey\": (a conveys b from c to d) (1) MOVE-ACTION(a,b,c,d)","=ACAUSE(a,CHANGE-POSITION(b,c,d)) (cf. Allen 1984). I will not discuss the question whether ACAUSE (= \"agent causation\") and CH~GE-POSITTON are indeed"]},{"title":"302","paragraphs":["primitive predicates. I consider them here as that. Furthermore one may discuss whether (5) sufficiently describes the meaning of \"to convey\".","The idea of extracting case relations from representations lige (1) can be bases on the following principles: (A) For each primitlve predicate P there","is an assignment of exactly one case","relation to every argument place~:","zi(P) = r~ (i-th argument of P h~s","case relation ri) (B) There are modification rules for case","relations which render it possible to","\"calculate\" the case relations for","nested expressions. (A) means e. g. that for a primitive predicate like CHANGE-POSITION w know the case relations of the argument places b, c and d: (2) zi(C~JdIGE-POSITION ) = r i for 1 ~ i ~ 3 In this sense one can state without doubt (3) Zl(ACAUSE) = agent (~) z3(CHANGE-POSTTION) = goal (B) may be interpreted in the following way: If we know - MOVE-ACtION has the form given in (1), - the value of z2(ACAUSE), - second place of ACAUSE is filled in by","CHA2~E-POSITION, - the value of Zl(CHANGE-POSITION), then we know -","the value of z2(EOVE-ACTION ), i. e. the","case relation of b in the whole expres-","sion (1). Formally this may be expressed by a four-place \"modification mapping\" m: (5) zg(MOVE-ACTION) =","m~ACAUSE, z2(ACAUSE), CHANGE-POSIT!ON,","z I (CHANGE-POSITION) ) One may speculate whether all four arguments are indeed necessary, they are surely no~. A similar idea is presented in Thiel 1982 (p. 84 ff.), where the mechanism of modification is applied, tOO.","A general scheme for (B) is the following: Assume one has"]},{"title":"(6) .., s(...,x,...),...)","paragraphs":["where x is the j-th argument in Q, S(...) the k-th argument in R and x the 1-th argument in S. Then zg(Q) is a function of R, Zk(R), S an~ Zl(S ). Thiel's proposal, namely zj(Q) = m(R, Zl(S)), would cause some dlfficulties, if R is a many place predicate and there are in R arguments S' and S\" with z I, (S')=Zl,, (S\") (cf. the FEED-example below). Thiel himself excludes this case explicitely.","The principles (A) and (B) form a recursive scheme: (A) provides the results for certain predicates, (B) renders it"]},{"title":"~","paragraphs":["ossible to determine the results for verb-)sememes in general.","At arj rage one would get a nice for-malism for calculating case frames if (A) and (B) are fulfilled. Unfortunately, there are some additional problems I will deal with below. But at first T take an example : (7) SET(a, b, c)","= ACAUSE( a, BECOI~[E ( SIT( b, c) ) ) (8) z2(SIT)= locative","By a simplification of the general scheme (four-place function m as in (5)) to the special variant one would obtain for (7-8):"]},{"title":"(9) z~(S~.T)","paragraphs":["= ~m(A CAUSE, m( BECO},~, 1 o cati re) )","= m(ACAUSE,dlrective) = directive","There are arguments for the assumotion that BECOI~ (and not ACAUSE) modifies locative to dieective (or goal): The description of \"to get to a place\" contains the expression (10) BEC01~(BE(b,c)) (as in (7)) Here one has the s~ae modification of locative to directive. This is in accordance with Thiel 1982.","Instead of (7) one coulc take another expression, e. g. by using the predicate ECAUSE (event causation) with the interpretation that \"an activity of a causes BECO~ (S! T( b, c ) )\" :"]},{"title":"(lq) SE~(a,b,c)","paragraphs":["= ECAUSE(ACT(a), BECOICE(SIT(b, c))) Here the application of (A) and (B) is not quite the same, one has here instead of (12) Zl(SET ) = Zl(ACAUSE ) for (7) a modification (13) zI(SET) = m(ECAUSE, z~(ACT))","m(ECAUSE, a~entiv)","= \"causator\" ?","These simple examples illustrate some connections between the formal definition of case relatior.s and semantic predicates. 3. Ex~pected complications","Now ! turn so some :~upleasant questions that depress a bit the hope in this elega~ut solution. But they are disagreeable only if one"]},{"title":"303 -","paragraphs":["maintains the principle \"one instance"]},{"title":"~","paragraphs":["er simple clause\" for case relations","cf. Fillmore 1968, Starosta 1981) and -","considers case relations as a rather","small set without internal structure. For a verb li~e \"to swim\" in a sentence\" like \"a swims from b to c\" it is reasonable to assume a representation (1@) SWIM(a) g CHANGE-POSITION(a,b,c) What wo ao if in this example (or another of the same type) one detects that (15) Zl(SWIM) @ Zl(CHANGE-POSITION)? Secondly, one needs new rules for h~dling an example like (16) ASCERTAIN(a,b)","= ACAUSE(a,BECO~(KNOW(a,b))) where a appears twice and at two rather different places. One surely cannot assume that Zl(ACAUSE) is the same relation as (17) m( ACAUSE, m( BEC0~{E, z I (~NOW) ) ) if one makes the same simplification am for (7). Another question appears in (18) FEED( a, b, c) = ACAUSE( a, EAT( b, c) ) This time one has two agents (a and b).","The next question is due to reflexive verbs. If we ta~e German examples, we have e. g. (19) Er w~scht sich $ Er w~scat ihn as in English, too (himself ¢ him). Here the case relation of \"Er\" should be a mixture between agent ~n~something like experiencer or patiens (cf. Thiel 1982, p. 10@ f.). The second components may not be left out because of the reflexive verbs proper in German as \"sich ft[rchten\" (to be afraid, \"sich sch~me~' (~o be ashamed). Here the appropriate case relation is not agent: A \"semantic paraphrase\" for these verbs is \"Etwas macht mich f~rchten\" (Something makes me afraid) etc. In my opinion there is no sharp boundary oetween the two types of reflexive verbs: Such a critical case is e. g. \"sich aufregen\" (to ge~ excited).","The fifth question is connected with \"plastered up\" case relations. It does not make sense to discuss whether one has in (20) either the case relation instrumental or locative (cf. Thiel 1982, p. 10@ f.): (20) I warmed ~he foot on the stove. The same applies for temporal and causal relations in other examples. @. Some conclusions","From the questions and lacking answers one may draw some conclusions: !. If one defines case relations by means of semantic predicates as explained above, one needs in addition at least one of these two things: -","a two-place relation \" ~ \" within the","set of case relations in order to com-","pare them according to their \"specl-","ficness\": For certain pairs of case","relations rl,r 2 one has then \"r I ~ rp\"","with the meaning \"r I is equal to or -","more specific than ro\" (cf. the SWIM","example). In this sense one may say","that e. g. objective is \"the semantical","most neutral case\" (Cook 1971), i. e.","one could establish case relations that","are more specific than the case rela-","tion objective. - a two-place operation \" @ \" for mixing","case relations: For certain pairs of","case relations r~,r 2 there is a case","relation r with ~ = r I • r 2 (cf. the","example (20)). So the set of all case relations becomes a structured system: Every case relation stands no longer for itself alone. II. One cannot derive case relations from semantic predicates without presupposing a synonymy relation between sememes: If one assumes that uhe twJo sentences (21) John sells Jim a car. (22) Jim buys a car from John. are synonymous, i. e. (23) SELL(a,b,c) and (24) BUY(b,a,c) have the same representation, then the case relations have to be tae same:"]},{"title":"(25) Zl(S~) = z2(BUY) (of a)","paragraphs":["z2(SELL) Zl(BUY) (of b) If one admits that (21) and (22) are not synonymous one ma~, have different case relations.","This aspect is in a sense independent of the approach proposed here: The same question may be put without reference to semantic predicates. One needs such a synonymy relation at any rate for case relations. Obviously the different intuitive use of the synonymy is one reason for the rather chaotic situation. I!T. A aiscussion of (23-2@) and (18) shows furthermore that a relation or operation mentioned in T. provides the means for a distinction of different agents as John and Jim in (21-22) or the two agents in (18): Tn the latter case b is an \"influenced agent\". This has to be expressed precisely by the modification rules. 304 References","Allen, J. F. 198@ Towards a General Theory of Action and Time. In: Artificial Intelligence 23: 123-154.","Cook, W. A. 1971 Improvements in Case Grammar. In: Language and Linguists, Working Paper Nr. 2, Georgetown University, Washing$on D. C.","Fillmore, Ch. 1968 The case for case. In: Bach, E., Harms, R. T., Eds., Universals in Linguistin Theory, Holt, Rinehart and Winston, New York: 1-88.","Fillmore, Ch. 1977 The case for case reopened. In: Cole, P., Sadoc~, J. M., Eds., Syntax and Semantics 8: Grammatical Relations, Academic Press, New York: 59-82.","Koch, W. 1978 Kasus - Kognition - Kausaliter. Lunder germanistiscae For-schungen 47, C~ Gleerup, Lurid.","Luckhardt, H.-D. 1985 Valenz und Tiefen- ~asus in der maschinellen $0ersetzung. CL-Report No @, Sonderforscaungsbereich 100, Teilprojekt A2, Universit~t des Saarlandes, SaarbrGc~en.","~ellema, P. 197@ A Brief Against Case Grammar. In: Foundations of Language 11 : 39-76.","Nagao, M. 1986 Current Status and Future Trends in Hachine Translation. In: Future Generations Computer Systems 2(1986): 77-82.","Nilsen, D. L. F. 1973 The Instrumental Case in English. Mouton, The Hague.","Somers, H. L. 1986 The need for MT-oriented versions of Case and Valency in MT. In: Proceedings COLING-86: 118-123.","Starosta, St. 1981 Die \"l-Pro-Sent\"-LSsung. In: Pleines, J. Ed., Bei~r~ge zum Stand der Kasus~heorie, Gunter Narr, TGbingen: 45-1@7.","Thiel, M. 1982 Zur Verwendung der Kasusgramzatik im faktenorientierten Information Retrieval yon Textdaten. Spracae und Information, vol. 2, Niemeyer, TGbingen.","Address of the author:","Prof. Dr. Jttrgen Kunze","Z~ ft~r Sprachwissenschaft der AdW der DDR","Prenzlauer Promenade I@9-152","Berlin","DDR-qlO0"]},{"title":"305","paragraphs":[]}]}