{"sections":[{"title":"Qualitative and Quantitative Models of Speech Translation Hiyan Alshawi AT,~T Bell Laboratories 600 Mountain Avenue Murray Hill, NJ 07974, USA hiyan@research, at t.com Abstract","paragraphs":["This paper compares a qualitative reasoning model of translation with a quantitative statistical model. We consider these models within the context of two hypothetical speech translation systems, starting with a logic-based design and pointing out which of its characteristics are best preserved or eliminated in moving to the second, quantitative design. The quantitative language and translation models are based on relations between lexical heads of phrases. Statistical parameters for structural dependency, lexical transfer, and linear order are used to select a set of implicit relations between words in a source utterance, a corresponding set of relations between target language words, and the most likely translation of the original utterance. 1."]},{"title":"Introduction","paragraphs":["In recent years there has been a resurgence of interest in statistical approaches to natural language processing. Such approaches are not new, witness the statistical approach to machine translation suggested by Weaver (1955), but the current level of interest is largely due to the success of applying hidden Markov models and N-gram language models in speech recognition. This success was directly measurable in terms of word recognition error rates, prompting language processing researchers to seek corresponding improvements in performance and robustness. A speech translation system, which by necessity combines speech and language technology, is a natural place to consider combining the statistical and conventional approaches and much of this paper describes probabilistic models of structural language analysis and translation. Our aim will be to provide an overall model for translation with the best of both worlds. Various factors will lead us to conclude that a lexicalist statistical model with dependency relations is well suited to this goal.","As well as this quantitative approach, we will consider a constraint/logic based approach and try to distinguish characteristics that we wish to preserve from those that are best replaced by statistical models. Although perhaps implicit in many conventional approaches to translation, a characterization in logical terms of what is being done is rarely given, so we will attempt to make that explicit here, more or less from first principh's.","Before proceeding, I will first examine some fashiouable distinctions in section 2 in order to clarify the issues involved in comparing these approaches. I will attempt to argue that the important distinction is not so much a rational-empirical or symbolic-statistical distinction but rather a qualitative-quantitative one. This is followed by discussion of the logic-based model in section 3, the overall quantitative model in section 4, monolingual models in section 5, translation models in section 6, and some conclusions in section 7. We concentrate throughout on what information about language and translation is coded and how it is express('d as logical constraints or statistical parameters. Although important, we will say little about search algorithms, rule acquisition, or parameter estimation. 2."]},{"title":"Qualitative and Quantitative Models","paragraphs":["One contrast often taken for granted is the identifica-tion of a 'statistical-symbolic' distinction in language processing as an instance of the empirical vs. rational debate. I believe this contrast has been exaggerated though historically it has had some validity ill terms of accepted practice. Rule based approaches have be-come more empirical in a number of ways: First, a more empirical approach is being adopted to grammar development whereby the rule set is modified according to its performance against corpora of natural text (e.g. Taylor, Grovel and Briscoe 1989). Second, there is a class of techniques for learning rules from text, a recent example being Brill 1993. Conversely, it is possible to imagine building a language model in which all probabilities are estimated according to intuition without reference to any real data, giving a probabilistic mod~,l that is not empirical.","Most language processing labeled as statistical involves associating real-number valued parameters to configurations of symbols. This is not surprising given that natural language, at least in written form, is explicitly symbolic. Presumably, classifying a system as symbolic must refer to a different set of (internal) symbols, but even this does not rule out many statistical systrrrls modeling events involving nonterminal categories and word senses. Given that the notion of a symbol, let. alone an 'internal symbol', is itself a slippery one, it may he unwise to build our theories of language, or even tl,. way we classify different theories, on this notion.","Instead, it would seem that the real contrast driving the shift towards statistics in language processing is a contrast between"]},{"title":"qualitative","paragraphs":["systems dealing exclusively with combinatoric constraints, and"]},{"title":"quantitative","paragraphs":["systems that involve computing numerical functions. This bears dir~.ctly on the problems of brittleness and complexity that discrete approaches to language processing share wll,ll, for example, reasoning systems based on traditional logical inference. It relates to the inadequacy of the dominant theories in linguistics to capture 'shades' of meaning or degrees of acceptability which are often recognized by people outside the field as important inherent properties of natural language. The qualitative-quantitative distinction can also be seen as underlying the difference between classification systems based on I'cature specifications, as used in unification formalisms (Shicber 1986), and clustering based on a variable degr~,e of granularity (e.g. Pereira, Tishby and Lee 1993).","It seems unlikely that these continuously variable as-"]},{"title":"pcct:s","paragraphs":["of fluent natural language can be captured by a purely combinatoric model. This naturally leads to the qtwstion of how best to introduce quantitative model-i,g into language processing. It is not, of course, nec- ,,ssary for the quantities of a quantitative model to be probabilities. For example, we may wish to define real-valued functions on parse trees that reflect the extent to which the trees conform to, .say, minimal attachment and parallelism between conjuncts. Such functions have been used in tandem with statistical functions in experiments on disambiguation (for instance Alshawi and (',a.rter 1994). Another example is connection strengths i, m~ural network approaches to language processing, th,mgh it. has been shown that certain networks are ~,tfectively computing probabilities (Richard and Lippmann 1991).","Nevertheless, probability theory does offer a coherent and relatively well understood framework for select-ing between uncertain alternatives, making it a natural choice for quantitative language processing. The case f.r probability theory is strengthened by a well devel- ,,p-d empirical methodology in the form of statistical I,:~ramet.ccr estimation. There is also the strong connec-l i,,n between probability theory and the formal theory .1\" i.formation and communication, a connection that has been exploited in speech recognition, for example I~qing tim concept of entropy to provide a motivated way ,.f measuring the complexity of a recognition problem (.h'lim'k et ai. 1992).","I\",v,'n if probability t|wory remains, as it currently is, th,, m~.l.llod of clloicc in making language processing qu.ntitative, this still h~aw:s the fieht wide open in terms .,f carving up languag~ processing into an appropriate set ,,f ,,wmts tbr probability theory to work with. For translation, a very direct apprgach using parameters based on surface positions of words in source and target sentences was adopted in the Candide system (Brown et at. 1990). However, this does not capture important structural properties of natural language. Nor does it take into account generalizations about translation that are independent of the exact word order in source and target sentences. Such generalizations are, of course, central to qualitative structural approaches to translation (e.g. Isabelle and Macklovitch 1986, Alshawi et at. 1992).","The aim of the quantitative language and translation models presented in sections 5 and 6 is to employ proba~ bilistic parameters that reflect linguistic structure without discarding rich lexical information or making the models too complex to train automatically. In terms of a traditional classification, this would be seen as a 'hybrid symbolic-statistical' system because it deals with linguistic structure. From our perspective, it can be seen as a quantitative version of the logic-based model because both models attempt to capture similar information (about the organization of words into phrases and relations holding between these phrases or their referents), though the tools of modeling are substantially different."]},{"title":"3. Dissecting a Logic-Based System We now consider a hypothetical speech translation system in which the language processing components follow a conventional qualitative transfer design. Although hypothetical, this design and its components are similar to those used in existing database query (Rayner and Alshawi 1992) and translation systems (Alshawi et al 1992). More recent versions of these systems have been gradually taking on a more quantitative flavor,","paragraphs":["particularly with respect to choosing between alternative analyses, but our hypothetical system will be more purist in its qualitative approach.","The overall design is as follows. We assume that a speech recognition subsystem delivers a list of text strings corresponding to transcriptions of an input utterance. These recognition hypotheses are passed to a parser which applies a logic-based grammar and lexicon to produce a set of logical forms, specifically formulas in first order logic corresponding to possible interpretations of the utterance. The logical forms are filtered by contextual and word-sense constraints, and one of them is passed to the translation component. The translation relation is expressed by a set of first order axioms which are used by a theorem prover to derive a target language logical form that is equivalent (in some context) to the source logical form. A grammar for tile target language is then applied to the target form, generating a syntax tree whose fringe is passed to a speech synthesizer.","\"Faking the various components in turn, we make a note of undesirable properties that might be improved by quantitative modeling."]},{"title":"2","paragraphs":["Analysis and Generation A grammar, expressed as a set of syntactic rules (axioms)"]},{"title":"Gsv,","paragraphs":["and a set of semantic rules (axioms)Gsem is used to support a relation"]},{"title":"form","paragraphs":["holding between strings s and logical forms ¢ expressed in first order logic:"]},{"title":"a.y. u a,.m f o m( s,","paragraphs":["¢). \" The relation"]},{"title":"form","paragraphs":["is many-to-many, associating a string with linguistically possible logical form interpretations. In the analysis direction, we are given s and search for logical forms ¢, while in generation we search for strings s given ¢.","For analysis and generation, we are treating strings s and logical forms ¢ as object level entities. In interpretation and translation, we will move down from this meta-level reasoning to reasoning with the logical forms as propositions.","The list of text strings handed by the recognize/to the parser can be assumed to be ordered in accordance with some acoustic scoring scheme internal to the recognizer. The magnitude of the scores is ignored by our qualitative language processor; it simply processes the hypotheses one at a time until it finds one for which it can produce a complete logical form interpretation that passes grammatical and interpretation constraints, at which point it discards the remaining hypotheses. Clearly, discarding the acoustic score and taking the first hypothesis that satisfies the constraints may lead to an interpretation that is less plausible than one derivable from a hypothesis further down in the recognition list. But there is no point in processing these later hypotheses since we will be forced, to select one interpretation essentially at random, Syntax The syntactic rules in Gsv. relate 'category' predicates co, ct, c2 holding of a string and two spanning substrings (we limit the rules here to two daughters for simplicity): c0(s0) A"]},{"title":"daughters(so, sl, s2)","paragraphs":["el(st) A"]},{"title":"cz(s2) A (so = concat(st, s2))","paragraphs":["(Here, and subsequently, variables like so and st are implicitly universally quantified.) G~v,~ also includes lexical axioms for particular strings w consisting of single words: el(w), ... For a feature-based grammar, these rules can include conjuncts constraining the values, al,a~,..., of discrete-valued functions f on the strings:"]},{"title":"f(w) = al, f(so)","paragraphs":["= f(St).","The main problem here is that such grammars have no notion of a degree of grammatical acceptability - a sentence is either grammatical or ungrammatical. For small grammars this means that perfectly acceptable strings are often rejected; for large grammars we got a vast number of alternative trees so the chance of seh'ct-ing the correct tree for simple Nell{.CllCes C;tll gel. worso ~Lg the gralnmar cow'rago increas,,s. '['hcre is also tl,. problem of requiring increasingly comph,x feature sets to describe idiosyncrasies in the lexicon. Semantics Semantic grammar axioms belonging to Gsem specify a 'composition' function g for deriving a logical form for a phrase from those for its subphrasos:"]},{"title":"form(so, g(¢t, ¢2)) daughters(so, st,","paragraphs":["s2)Acj (st)Ac2(s2)Acl~(s0)"]},{"title":"A form(sl,","paragraphs":["el) A"]},{"title":"form(s2,","paragraphs":["¢2) The interpretation rules for strings l)ottom out ill a set of lexical semantic rules associating words with predicates"]},{"title":"(pl,P2,...)","paragraphs":["corresponding to 'word senses'. For a particular word and syntactic category, there will bo a (small, possibly empty) finite set of such word sense predicates: el(w) ~"]},{"title":"form(w,p~) cdiw) ~ form(w,pim).","paragraphs":["First order logic was assunmd as the semantic representation language because it comes with well understood, if not very practieM, inferential machinery for constraint solving. However, applying this machinory requires making logical forms fine grained to a degroe often not warranted by the information the speaker of an utterance intended to convey. An example of this is explicit scoping which leads (again) to large numlmrs of alternatives which the qualitative model has difliculty choosing between. Also, many natural language sentences cannot be expressed in first order logic without resort to elaborate formulas requiring complex semantic composition rules. These rules can be simplilied by using a higher order logic but at the expense of cw.n less practical inferential machinery.","In applying the grammar in generation we are faced with the problem of balancing over and under-generation by tweaking grammatical constraints, there being no way to prefer fully grammatical target sentences over more marginal ones. Qualitative approaches to grammar tend to emphasize the ability to capl, uro generalizations as the main measure of success in linguistic modeling. This might explain why producing appropriate lexical collocations is rarely addressed seriously in these models, even though lexical collocations are important for fluent generation. '/'he study of collocations for generation fits in more naturally with sl.a-tistical techniques, as illustrated by Smajda and McKeown (1990). Interpretation In the logic-based model, interpretation is the process of identifying from the possible interpretations ~ of s for 3 which form(s, qt) hold, ones that are consistent with the ,',,m~,xt of interpretation. We can state this as follows: /f U.~'U A ~ O. Ih.r,., we haw~ separated the context into a contingent s,,I ,ff contextual propositions S and a set R of (mono-l i ngual) 'meaning postulates', or selectional restrictions, that constrain the word sense predicates in all contexts. .1 is a set of assumptions sufficient to support the in-I,'rl)n'lation ¢ given S and R. In other words, this is h,~crl)rctal, ion as abduction' (Itobbs et al. 1988), since ~!)(i,('lion, not deduction, is needed to arrive at the :~>.'d H II I~tiOIIS ,4.","'l'h(\" ,host common types of meaning postulates in R art, t h,,s~\" for restriction, hyponymy, and disjointness, , \\l,l'<:.~sed a.'~ follows: HI (.l'l, X2) ~ p2(x! ) restriction; t,:¢(x) --* p3(x) hyponymy; -~(pa(x) A p4(x)) disjointness. Although there are compilation techniques (e.g. Mellish 19~) which allow sclectional constraints stated in this fashion to be implemented efficiently, the scheme i~ I,rol)lematic iu other respects. To start with, the as-s~t~ttl~l ion of a small set of senses for a word is at best ;~wkward because it is difficult to arrive at an optimal gra,ularity for sense distinctions. Disambiguation with s,qcctionai restrictions expressed as meaning postulates is also prol)lematic because it is virtually impossible to ,levis, a set of postulates that will always filter all but ,,t,, alt.crnative. We are thus forced to under-filter and make an arbitrary choice between remaining alternatives. Logic based translation In hoth the quantitative and qualitative models we take a t ransfi~r approach to translation. We do not depend .!~ im.('rlingual symbols, but instead map a representa-I i,:)n with constants associated with the source language inlx) a corresponding expression with constants from the l ar~ct language. For the qualitative model, the operahh, notion of correspondence is based on logical equivahql('e and the constants are source word sense predicates I'1, t\"-' .... and target sense predicates ql, q2, ....","More specifically, we will say the translation relation hH we~,n a source logical form Cs and a target logical i;,r~t 6t holds if we have /~ u .'~' u A' ~ (q~., ~ ~,) wh,.n, I~ is a s~.t of monolingual and bilingual mean-I J;:. i,t).~l.ulal.es, and ,S' is ;t set of formulas characterizing I.h*' ~'lli'l','llt COllt~xt. .'l I is a s,,t of assumptions that in,h=,h's I.h,' assunlptions A which SUl)ported ~bs. ilere I,ili,,~ual me;ruing i~osl.ulal.~.s a.re first order axioms rehll.ing source and target sense predicates. A typical I,ilin~ual posl.ulate Ibr translal.ing between Pl an(I ql ii~it~;lil h,, of th,. for,n: p5(~1) ~ (p1(~1, z2) ~ ql(zl, z2)).","The need for the assumptions A' arises when a source language word is vaguer that its possible translations in the target language, so different choices of target words will correspond to translations under different assumptions. For example, the condition ps(xl) above might be proved from the input logical form, or it might need to be assumed.","In the general case, finding solutions (i.e. A', ~bt pairs) for the abductive schema is an undecidable theorem proving problem. This can be alleviated by placing restrictions on the form of meaning postulates and input formulas and using heuristic search methods. Although such an approach was applied with some success in a limited-domain system translating logical forms into database queries (Rayner and Alshawi 1992), it is likely to be impractical for language translation with tens of thousands of sense predicates and related axioms.","Setting aside the intractability issue, this approach does not offer a principled way of choosing between alternative solutions proposed by the prover. One would like to prefer solutions with 'minimal' sets of assumptions, but it is difficult to find motivated definitions for this minimization in a purely qualitative framework. 4. Quantitative Model Components Moving to a Quantitative Model In moving to a quantitative architecture, we propose to retain many of the basic characteristics of the qualitative model:","• A transfer organization with analysis, transfer, and generation components.","• Monolingual models that can be used for both analysis and generation.","• Translation models that exclusively code contrastive (cross-linguistic) information.","• Hierarchical phrases capturing recursive linguistic structure.","Instead of feature based syntax trees and first-order logical forms we will adopt a simpler, monostratal representation that is more closely related to those found in dependency grammars (e.g. Hudson 1984). Dependency representations have been used in large scale qualitative machine translation systems, notably by McCord (1988). The notion of a lexical 'head' of a phrase is central to these representations because they concentrate on relations between such lexical heads. In our case, the dependency representation is monostratal in that the relations may include ones normally classified as belonging to syntax, semantics or l)ragmatics.","One salient property of our language model is that it is strongly lexical: it consists of statistical parameters associated with relations between lexical items and the number and ordering of dependents of lexical heads. This lexical anchoring facilitates statistical training and 4 sensitivity to lexical variation and collocations. In order to gain the benefits of probabilistic modeling, we replace the task of developing large rule sets with the task of estimating large numbers of statistical parameters for the monolingual and translation models. This gives rise to a new cost trade-off in human annotation/judgement versus barely tractable fully automatic training. It also necessitates further research on lexical similarity and clustering (e.g. Pereira, Tishby and Lee 1993, Dagan, Marcus and Markovitch 1993) to improve parameter estimation from sparse data. Translation via Lexical Relation Graphs The model associates phrases with"]},{"title":"relation graphs. A","paragraphs":["relation graph is a directed labeled graph consisting of a set of"]},{"title":"relation edges.","paragraphs":["Each edge has the form of an atomic proposition"]},{"title":"~(wi, w~)","paragraphs":["where r is a relation symbol, wi is the lexical head of a phrase and wj is the lexical head of another phrase (typically a subphrase of the phrase headed by w~). The nodes wi and wj are word occurrences representable by a word and an index, the indices uniquely identifying particular occurrences of the words in a discourse or corpus. The set of relation symbols is open ended, but the first argument of the relation is always interpreted as the"]},{"title":"head","paragraphs":["and the second as the"]},{"title":"dependent","paragraphs":["with respect to this relation. The relations in the models for the sour~:e and target languages need not be the same, or even overlap. To keep the language models simple, we will mainly restrict ourselves here to dependency graphs that are trees with unordered siblings. In particular, phrases will always be contiguous strings of words and dependents will always be heads of subphrases.","Ignoring algorithmic issues relating to compactly representing and efficiently searching the space of alternative hypotheses, the overall design of the quantitative system is as follows. The speech recognizer produces a set of word-position hypotheses (perhaps in the form of a word lattice) corresponding to a set of string hypotheses for the input. The source language model is used to compute a set of possible relation graphs, with associated probabilities, for each string hypothesis. A probabilistic graph translation model then provides, for each source relation graph, the probabilities of deriving corresponding graphs with word occurrences from the target language. These target graphs include all the words of possible translations of the utterance hypotheses but do not specify the surface order of these words. Probabilities for different possible word orderings are computed according to ordering parameters which form part of the target language model.","In the following section we explain how the probabilities for these various processing stages are combined to select the most likely target word sequence. This word sequence can then be handed to the speech synthesizer. For tighter integration between getmraliovt aml sy,,tl,~', sis, information about the derivation of I.Iw l,arg,'l uI I,erance can also I)c passed to the syuthesizcr. Integrated Statistical Model The probabilities associated with phrases in the abov,, description are computed according to the statistical models for analysis, translation, and generation. In this section we show the relationship between these models to arrive at an overall statistical model of sp,,,.,\" h translation. We are not considering training ismws in this paper, though a number of now familiar techniques ranging from methods for maximum likelihood estimation to direct estimation using fully annotated data are applicable.","The objects involved in the overall model are as Jbllows (we omit target speech synthesis under the, assumption that it proceeds deterministically from a target language word string): • A0: (acoustic evidence for) source language"]},{"title":"spe~'ch","paragraphs":["• Wo: source language word string • Wz: target language word string • C0: source language relation graph • Ct: target language relation graph","Given a spoken input in the source language, we wish to find a target language string that is the most likely translation of the input. We are thus interestc.d in the conditional probability of We given A,. This conditional probability can be expressed as follows (of. Chang and Su 1993):"]},{"title":"P(WdA,) = ~W,,C,,Ct P(WolAo) P(C, IW,, A,) P(CdCo, W,, A°) PCWd(:,, C,, W.,, ,4, ).","paragraphs":["We now apply some simplifying independence .s-sumptions concerning relation graphs. Specifically. that their derivation from word strings is independent of acoustic information; that their translation is independent of the original words and acoustics involved; and that target word string generation from target relation edges is independent of the source language represent, a-tions. The extent to which these (Markovian) assumptions hold depend on the extent to which relation edges represent all the relevant information for translation. In particular it means they should express aspects of surface relevant to meaning, such as topicalization, as well as predicate argument structure. In any case, the simplifying assumptions give the following:"]},{"title":"P(W~IA, ) _~ ~w.,c.,c, P( W, IA, ) P(C01W,) P( Ct lCo ) P( Wt I£ :, ).","paragraphs":["This can be rewritten with two applications of Bay,,~"]},{"title":"5","paragraphs":["I'llh':"]},{"title":"v\"","paragraphs":["L.,W.. ,C~,('t"]},{"title":"P( A, IW,) ( I / P(A.,)) P(WolC,) P(C,) P(C~IC, ) P(W, ICt).","paragraphs":["Since A, is given,"]},{"title":"lIP(A,)","paragraphs":["is a constant which can be ignored in finding the maximum of"]},{"title":"P(Wt]As).","paragraphs":["Determining Wt that maximizes"]},{"title":"P(WdA, )","paragraphs":["therefore involves the following factors: * I'(A, I W, ): source language acoustics • /'([.V, IC,): source language generation ."]},{"title":"I'(C.,):","paragraphs":["source content relations"]},{"title":"• /'(('tiCs):","paragraphs":["source to target transfer"]},{"title":"• I'(IVtlC't","paragraphs":["): target language generation Wc a.,~ume that the speech recognizer provides acous-","tic scores proportional to"]},{"title":"P(A, IW, )","paragraphs":["(or logs thereof). Sud~ scores are normally computed by speech recogni-l i,,n systems, although they are usually also multiplied by w,,rd-based language model probabilities"]},{"title":"P(W,)","paragraphs":["which we do not require in this application context. ()ur approach to language modeling, which covers the corn.cat analysis and language generation factors, is pre- :~,,uted in section 5 and the transfer probabilities fall umh,r the translation model of section 6.","Finally note thai. by another application of Bayes ,-,d,, w,, can replace the two factors"]},{"title":"P(C,)P(CdC,)","paragraphs":["by"]},{"title":"I'(Ct)l'(C, lCt}","paragraphs":["without changing other parts of the model. Tiffs latter fornmlation allows us to apply constraints imposed by the target language model to ill-t,'r inappropriate possibilities suggested by analysis and tra.sfi~r. In some respects this is similar to Dagan and Itai's (I 994) approach to word sense disambiguation using statistical associations in a second language. 5. Language Models Language Production Model ~).r bmguage model can be viewed in terms of a probabihstic generative process based on the choice of lexical \"heads\" of phrases and the recursive generation of sub- ;,bra~es and their ordering. For this purpose, we can de- (ira, tho head word of a phrase to be the word that most strongly influences the way the phrase may be combiucd with other phrases. This notion has been central to a number of approaches to grammar for some time, including theories like dependency grammar (Hudson I!~7(;, 1990) and HPSG (Pollard and Sag 1987). More ;,'~,.t,l.ly, the statistical properties of associations be-Iw,.,'n words, and more particularly heads of phrases, JL:t.~ J~,~'~,l|lql, all a.el.iw; area of research (e.g. Chang, l,uo, aml Su 1992; Ilindlc and R.ooth 1993).","'l'h,' language model factors the statistical derivation ,,f a .~'ul.ence with word string W as follows: I'(ll) = ~,:"]},{"title":"P(C) P(WIC)","paragraphs":["where C ranges over relation graphs. The content model, P(C), and generation model,"]},{"title":"P(WIC),","paragraphs":["are components of the overall statistical model for spoken language translation given earlier. This decomposition of"]},{"title":"P(W)","paragraphs":["can be viewed as first deciding on the content of a sentence, formulated as a set of relation edges according to a statistical model for"]},{"title":"P(C),","paragraphs":["and then deciding on word order according to"]},{"title":"P(WIC ).","paragraphs":["Of course, this decomposition simplifies the realities of language production in that real language is always generated in the context of some situation S (real or imaginary), so a more comprehensive model would be concerned with"]},{"title":"P(CIS),","paragraphs":["i.e. language production in context. This is less important, however, in the translation setting since we produce Ct in the context of a source relation graph C, and we assume the availability of a model for"]},{"title":"P(CtlC,). Content Derivation Model","paragraphs":["The model for deriving the relation graph of a phrase is taken to consist of choosing a lexical head h0 for the phrase (what the phrase is 'about') followed by a series of 'node expansion' steps. An expansion step takes a node and chooses a possibly empty set of edges (relation labels and ending nodes) starting from that node. Here we consider only the case of relation graphs that are trees with unordered siblings.","To start with, let us take the simplified case where a head word h has no optional or duplicated dependents (i.e. exactly one for each relation). There will be a set of edges"]},{"title":"E(h) = {rl(h,","paragraphs":["wl),"]},{"title":"r~(h, w2) ... r~(h,","paragraphs":["wk)} corresponding to the local tree rooted at h with dependent nodes Wl...wk. The set of relation edges for the entire derivation is the union of these local edge sets.","To determine the probability of deriving a relation graph C for a phrase headed by h0 we make use of parameters ('dependency parameters')"]},{"title":"P(r(h,w)lh, r)","paragraphs":["for the probability, given a node h and a relation r, that w is an r-dependent of h. Under the assumption that the dependents of a head are chosen independently from each other, the probability of deriving C is:"]},{"title":"P(C) = P(Top(ho)) I~Ir(h.~)¢c P(r(h,","paragraphs":["w)lh, r) where"]},{"title":"P(Top(ho))","paragraphs":["is the probability of choosing h0 to start the derivation.","If we now remove the assumption made earlier that there is exactly one r-dependent of a head, we need to elaborate the derivation model to include choosing the number of such dependents. We model this by parameters"]},{"title":"P(N(r,n)lh) 6","paragraphs":["that is, the I)rol)aifility that head h h+~ n r-dep(m(lents. We will r,ffer t,o t,|lis I)robability ;m a '(let, all parameter'. Our previous assmnption amounted to stating that this was always 1 for n = 1 or for n = 0. Detail parameters allow us to model, for example, the number of adjectival modifiers of a noun or the 'degree' to which a particular argument of a verb is optional. The probability of an expansion of h giving rise to local edges E(h) is now: P(E(h)lh) ="]},{"title":"Fir P(N(r, nr)lh)","paragraphs":["k(nr)"]},{"title":"I]l<i<r~ P(r(h, w[)lh , r).","paragraphs":["where r ranges over the set of relation labels and h has nr r-dependents"]},{"title":"w~... w nP . k(nr)","paragraphs":["is a combinatorie constant for taking account of the fact that we are not distinguishing permutations of the dependents (e.g. there are n,.! permutations of the r-dependents of h if these dependents are all distinct).","So if h0 is the root of a tree C, we have"]},{"title":"P(C) = P(Top(ho)) rIheh~aa,(c) P(Ec(h)lh)","paragraphs":["where"]},{"title":"heads(C)","paragraphs":["is thc set of nodes in C and"]},{"title":"Ec(h)","paragraphs":["is the set of edges headed by h in C.","The above formulation is only an approximation for relation graphs that are not trees because the independence assumptions which allow the dependency parameters to be simply multiplied together no longer hold for the general case. Dependency graphs with cycles do arise as the most natural analyses of certain linguistic constructions, but calculating their probabilities on a node by node basis as above may still provide probability estimates that are accurate enough for practical purposes. Generation Model We now return to the generation model"]},{"title":"P(WIC).","paragraphs":["As mentioned earlier, since C includes the words in W and a set of relations between them, the generation model is concerned only with surface order. One possibility is to use 'bi-relation' parameters for the probability that an ri-dependent immediately follows an u-dependent. This approach is problematic for oui: overall statistical model because such parameters are not independent from the 'detail' parameters specifying the number of r-dependents of a head.","We therefore adopt the use of 'sequencing' parameters, these being probabilities of particular orderings of dependents given that the multiset of dependency relations is known. We let the identity relation e stand for the head itself. Specifically, we have parameters"]},{"title":"P(slM(s))","paragraphs":["where s is a sequence of relation labels including an occurrence of e and"]},{"title":"M(s)","paragraphs":["is the multiset for this sequence. For a head h in a relation graph C, let"]},{"title":"swch","paragraphs":["be the sequence of dependent relations induced by a particular word string W generated from C. We now have"]},{"title":"s>(WlC)","paragraphs":["="]},{"title":"I-Ih~w(Il.","paragraphs":["~-~--~ ) l'(.sw < \"h I M ( ~'w < \"h )) where"]},{"title":"It","paragraphs":["ranges over all the heads in (;, aud m. is I.h<' number of occurrences of r in sW(:h, assuming that all orderings of nr-dependents are equally likely. We can thus use these sequencing parameters directly in our overall model.","To summarize, our monolingual models are specifi,'d by: * topmost head parameters"]},{"title":"P(Top(h))","paragraphs":["* dependency parameters"]},{"title":"P(r(h,","paragraphs":["w)lh, r) + detail parameters"]},{"title":"P(N(r, n)lh )","paragraphs":["* sequencing parameters"]},{"title":"P(s[M(s))","paragraphs":["The overall model splits the contributions of ('ollt~mt"]},{"title":"P(C)","paragraphs":["and ordering"]},{"title":"P(WIC ).","paragraphs":["However, we may also want a model for P(W), for example for pruning spec(:h recognition hypotheses. Combining our content ;rod ordering models we get:"]},{"title":"P(W) = Z P(C) P(WIC) c = ~C P(Top(hc)) H P(swc'hlh) hEW H","paragraphs":["P(r(h, w)lh, ,') r(h,w)eE¢(h) The parameters P(slh ) can be derived by combining sequencing parameters with the detail parameters for h.","6. Translation Model Mapping Relation Graphs As already mentioned, the translation model delines mappings between relation graphs"]},{"title":"C.,","paragraphs":["for the source language and"]},{"title":"Ct","paragraphs":["for the target language. A direct (though incomplete)justification of translation via n.- lation graphs may be based on a simple referential view of natural language semantics. Thus nominals and their modifiers pick out entities in a (real or imaginary) world, verbs and their modifiers refer to actions or events in which the entities participate in roles in-dicated by the edge relations. Under this view, the purpose of the translation mapping is to determhm a target language relation graph that provides the best approximation to the referential function induced by the source relation graph. We call this approximating referential equivalence.","This referential view of semantics is not adequate for taking account of much of the complexity of natural language including many aspects of quantification, distributivity and modality. This means it cannot capture some of the subtleties that a theory based on logical equivalence might be expected to. On the other hand, when we proposed a logic based approach as our qualitative model, we had to restrict it to a simple first order 7 logic anyway for computational reasons, and even then it did not appear to be practical. Thus using the more impow~rished lexical relations representation may not tw costing us much in practice.","One aspect of the representation that is particularly useful in the translation application is its convenience for partial and/or incremental representation of content we can refine the representation by the addition of furthor edges. A fully specified denotation of the meaning of a s,mtence is rarely required for translation, and as w,~ pointed out when discussing logic representations, a c~mq~lete specification may not have been intended by th,, slwaker. Although we have not provided a denotatio.al semantics for sets of relation edges, we anticipate that this will be possible along the lines developed in m(motonic semantics (Alshawi and Crouch 1992). Translation Parameters '1'o bc practical, a model for"]},{"title":"P(CtIC,)","paragraphs":["needs to decompose the source and target graphs C~ and"]},{"title":"Ct","paragraphs":["into subgraphs small enough that subgraph translation parameters can be estimated. We do this with the help of 'node a.lignment relations' between the nodes of these graphs. 'l'lmse alignment relations are similar in some respects to the alignments used by Brown et al. (1990) in their surface translation model. The translation probability is then the sum of probabilities over different alignments"]},{"title":".t: I'(C, ICo) = ~s P(C. flC,).","paragraphs":["There are different ways to model"]},{"title":"P(Ct,.tIC,)","paragraphs":["corresp(mding to different kinds of alignment relations and different independence assumptions about the translation mapping.","l\"or our quantitative design, we adopt a simple model in which lexical and relation (structural) probabilities are assumed to be independent. In this model the alignnlent relations are functions from the word occurrence ~lodes of"]},{"title":"Ct","paragraphs":["to the word occurrences of C~. The idea is that"]},{"title":".t(,j) = wi","paragraphs":["means that the source word occur-"]},{"title":"r('ncc wi","paragraphs":["'gave rise' to the target word occurrence vj. 'l'lw inverse relation .t-1 need not be a function, allow-ing different numbers of words in the source and target sentences.","We decompose"]},{"title":"P(C~,.tIC,)","paragraphs":["into 'lexical' and 'structural' probabilities as follows:"]},{"title":"I'(Ct, fie,) = P(N,, IIN,)P(EtINt, .t, C,)","paragraphs":["where Nt and N, are the node sets for"]},{"title":"Ct","paragraphs":["and C0 respectiw.ly, and"]},{"title":"Et","paragraphs":["is the set of edges for the target graph. The lirst factor"]},{"title":"P(Nt, .fiN,)","paragraphs":["is the lexical component it~ ~.hat it does not take into account any of the relations in I.he source graph C.,. This lexical component is the pro,luct of alignment probabilities for each node of N,:"]},{"title":"PCN,, fiN, ) = H wiEN. \"?}lwd.","paragraphs":["That is, the probability that .I' maps exactly the (possibly empty) subset {vi*... v~} of Nt to wi. These sets are assumed to be disjoint for different source graph nodes, so we can replace the factors in the above product with parameters:"]},{"title":"P(MIw)","paragraphs":["where w is a source language word and M is a multiset of target language words. We will derive a target set of edges Et of Ct by k derivation steps which partition the set of source edges E, into subgraphs St ... Sk. These subgraphs give rise to disjoint sets of relation edges T1 ... Tk which together form Et. The structural component of our translation model will be the sum of derivation probabilities for such an edge set Et.","For simplicity, we assume here that the source graph C, is a tree. This is consistent with our earlier assumptions about the source language model. We take our partitions of the source graph to be the edge sets for local trees. This ensures that the the partitioning is deterministic so the probability of a derivation is the product of the probabilities of derivation steps. More complex models with larger partitions rooted at a node are possible but these require additional parameters for partitioning. For the simple model it remains to specify derivation step probabilities.","The probability of a derivation step is given by parameters of the form:"]},{"title":"P(T, qS,', .td","paragraphs":["where S~ and T[ are unlabeled graphs and ffi is a node alignment function from T[ to S~. Unlabeled graphs are just like our relation edge graphs except that the nodes are not labeled with words (the edges still have relation labels). To apply a derivation step we need a notion of graph matching that respects edge labels: g is an isomorphism (modulo node labels) from a graph G to a graph H if g is a one-one and onto function from the nodes of G to the nodes of H such that"]},{"title":"r(a, b) e V","paragraphs":["iff"]},{"title":"r(g(a), g(b)) • H.","paragraphs":["The derivation step with parameter"]},{"title":"P(T[IS~,f~ )","paragraphs":["is applicable to the source edges St, under the alignment f, giving rise to the target edges Ti if (i) there is an isomorphism hi from S~ to Si (ii) there is an isomorphism gi from ~ to T~' (iii) for any node v of Ti it must be the case that"]},{"title":"hi(fi(gi(v))) -- f(v).","paragraphs":["This last condition ensures that the target graph partitions join up in a way that is compatible with the node alignrn,:nt f,","Tile factoring of the translation model into these lexical and structural components means that it will overgenerate because these aspects are not independent in translation between real natural languages. It 8 is therefore appropriate to filter translation hypotheses by re.scoring according to the version of the overall statistical model that included the factors"]},{"title":"P(Ct)P(ColCt)","paragraphs":["so that the target language model constrains the out-put of the translation model. Of course, in this case we need to model the translation relation in the 'reverse' direction. This can be done in a parallel fashion to the forward direction described above."]},{"title":"7. Conclusions","paragraphs":["Our qualitative and quantitative models have a similar overall structure and there are clear parallels between the factoring of logical constraints and statistical parameters, for example monolingual postulates and dependency parameters, bilingual postulates and translation parameters. The parallelism would have been closer if we had adopted ID/LP style rules (Gazdar et al. 1985) in the qualitative model. However, we argued in section 3 that our qualitative model suffered from lack of robustness, from having only the crudest means for choosing between competing hypotheses, and from being computationally intractable for large vocabularies.","The quantitative model is in a much better position to cope with these problems. It is less brittle because statistical associations have replaced constraints (featural, selectional, etc.) that must be satisfied exactly. The probabilistic models give us a systematic and well motivated way of ranking alternative hypotheses. Computationally, the quantitative model lets us escape from the undecidability of logic-based reasoning. Because this model is highly lexical, we can hope that the input words will allow effective pruning by limiting the number of search paths having significantly high probabilities.","We retained some of the basic assumptions about the structure of language when moving to the quantitative model. In particular, we preserved the notion of hierarchical phrase structure. Relations motivated by dependency grammar made it possible to do this without giving up sensitivity to lexical collocations which underpin simple statistical models like N-grams. The quantitative model also reduced overall complexity in terms of the sets of symbols used. In addition to words, it only required symbols for dependency relations, whereas the qualitative model required symbol sets for linguistic categories and features, and a set of word sense symbols. Despite their apparent importance to translation, the quantitative system can avoid the use of word sense symbols (and the problems of granularity they give rise to) by exploiting statistical associations between words in the target language to filter implicit sense choices.","Finally, here is a summary of our reasons for combining statistical methods with dependency representations in our language and translation models: • inherent lexical sensitivity of dependency representa-","tions, facilitating parameter estimation;","* quantitative preference based on probabilistic derivation and translation;","• incremental and/or partial speeilication of tlw ~',~tltent of utterances, particularly useful in I, ranslatiou;","• decomposition of complex utterances through rccursive linguistic structure. These factors suggest that dependency grammar will play an increasingly important role as language processing systems seek to combine both structural and colloeational information."]},{"title":"Acknowledgements","paragraphs":["I am grateful to Fernando Pereira, Mike Riley, and hlo Dagan for valuable discussions on the issues addressed in this paper. Fernando Pereira and !do Dagan also provided helpful comments on a draft of the paper. References","Alshawi, H., D. Carter, B. Gamback and M. Rayner. 1992. \"Swedish-English QLF Translation\". In H. AIshawl (ed.)"]},{"title":"The Core Language Engine,","paragraphs":["Cambridge, Mass.: MIT Press.","Alshawi, H. and R. Crouch. 1992. \"Monotonic Semantic Interpretation\"."]},{"title":"Proceedings of the 30th Annual Meeting of the Association for Computational Linguistics,","paragraphs":["Newark, Delaware.","Alshawi, H. and D. Carter. 1994. \"Training and Seal-ing Preference Functions for Disambiguation\". To appear in"]},{"title":"Computational Linguistics.","paragraphs":["Brill, E. 1993. \"Automatic Grammar Induction and Parsing Free Text: A Transformation-Based Ap-"]},{"title":"proach\".Proceedings of the 31st Annual Meeting of the Association for Computational Linguistics, 259","paragraphs":["265.","Brown, P., J. Cocke, S. Della Pietra, V. Della Pietra, F. Jelinek, J. Lafferty, R. Mercer and P. Rossin. 1990. \"A Statistical Approach to Machine TranslatioJl\"."]},{"title":"Computational Linguistics","paragraphs":["16:79-85.","Chang, J., Y. Lua, and K. Su. 1992. \"GPSM: A Generalized Probabilistic Semantic Model for Ambiguity Resolution\"."]},{"title":"Proceedings of the 30th Annual Meeting of the Association for Computational Linguistics,","paragraphs":["177-192.","Chang, J., K. Su. 1993. \"A Corpus-Based Statistics-Oriented Transfer and Generation Model for Machine Translation\"."]},{"title":"Proceedings of the 5th International Conference on Theoretical and Methodological Issues in Machine Translation.","paragraphs":["Dagan I. and A. Itai. 1994. \"Word Sense Disambiguation Using a Second Language Monolingual Corpus\". To appear in"]},{"title":"Computational Linguistics. 9","paragraphs":["l)agan, 1., S. Marcus and S. Markoviteh. 1993. \"Contextual Word Similarity and Estimation from Sparse Data\". Proceedings of the 31st meeting of the Associatio~ for Computational Linouistics, ACL, 164-171.","(;azdar, G., E. Klein, G.K. Pullum, and I.A.Sag. 1985. Generalised Phrase Structure Grammar. Oxford: Blackwell.","Ilindle, D. and M. Rooth. 1993. \"Structural Ambiguity and Lexical Relations\". Computational Linguistics 19:103-120.","Ilobbs, J.R., M. Stickel, P. Martin and D. Edwards. 1988. \"Interpretation as Abduction\", Proceedings of the 26th Annual Meeting of the Association for Computational Linguistics, Buffalo, New York, 95-103.","Itudson, R.A. 1984. Word Grammar. Oxford: Blackwoll.","Isah~,llo, P. and E. Macklovitch. 1986. \"Transfer and MT Modularity\", Eleventh International Conference on Computational Linguistics, Bonn, 115-117.",".Iclinek, F., R.L. Mercer and S. Roukos. 1992. \"Principles of Lexieal Language Modeling for Speech Recognition\". In S. Furui and M.M. Sondhi (eds.), Advances in Speech Signal Processing, New York: Marcol Dekker Inc.","M,:llish, C.S. 1988. \"Implementing Systemic Classification by Unification\". Computational Linguistics 14:40-51. McCord, M. 1988. \"A Multi-Target Machine Translation System\". Proceedings of the International Conference on Fifth Generation Computer Systems, '[bkyo, Japan, 1141-1149.","I'ereira, F., N. Tishby and L. Lee. 1993. \"Distributional Clustering of English Words\". Proceedings of the 31st meeting of the Association for Computatzonal Linguistics, ACL, 183-190.","I'oll~trd, C.J. and I.A. Sag. 1987. Information Based ,';yntax and Semantics: Volume I ~ Fundamentals. CSI,I Lecture Notes, Number 13. Center for the Study of Language and Information, Stanford, California.","llayner, M. and H. Alshawi. 1992. \"Deriving Database Queries from Logical Forms by Abductive Definition Expansion\". Proceedings of the Third Conference on Applied Natural Language Processing, Trento, Italy.","i{ichard, M.D. and R.P. Lippmann. 1991. \"Neural Network Classiliers Estimate Bayesian a posteriori Prob- ;d,ilili~.s\". Neural Computation 3:461-483.","Shi,.l~,,r, S.M. 1986. An Introduction to Unification-Ilascd Approaches to Grammar. CSLI Lecture Notes, Number 4. Center for the Study of Language and I i~ form ation, Stanford, California.","Smajda, F. and K. McKeown. 1990. \"Automatically Extracting and Representing Collocations for Language Generation\". In"]},{"title":"Proceedings of the $Sth Annual Meeting of the Association for Computational Linguistics, Pittsburgh. Taylor, L., C. Grover, sad E.J. Briscoe. 1989. \"The Syntactic Regularity of English Noun Phrases\". Proceeedings of the 4th European ACL Conference, 256-263. Weaver, W. 1955. \"Translation\". In W. Locke and A. Booth (eds.), Machine Translation of Languages, Cambridge, Mass.: MIT Press.","paragraphs":["10"]}]}