{"sections":[{"title":"","paragraphs":["PIETER A.M. SEUREN, HENK P. SCHOTEL: SEMANTIC SYNTAX AT WORK Nijmegen University, Dept. of General Linguistics MAINE, JUNE '94 SEMANTIC SYNTAX (SeSyn) is a direct continuation of work done in the '60s and '70s under the name of GENERATIVE SEMANTICS. The main component of SeSyn is a rule system (the syntax) which transforms the Semantic Analysis (SA) of any given sentence into a Surface Structure (SS) of that sentence. The SAs represent meanings in a higher order Predicate Calculus, according to a small set of context-free Formation Rules and a Lexicon. SA-trees have simple branchings and deep S-embeddings. They are input to the Transformation Rules, which deliver a corresponding SS. The Transformation Rules fall into two classes, the rules of the Cycle, and those of the Postcycle. The cyclic rules start with the most deeply embedded S and end with the top-S. They are mostly lexicon-driven: predicates are lexically marked for the cyclic rules they induce. The largely structure-driven postcyclic rules apply in linear order as defined by the grammar. The output is near-surface: it is meant to link up with a morphology module, to be complemented with a phonology module. Schotel has implemented the rule system for English in Prolog. The following diagram shows the place of SeSyn in the wider context of a cognitive (\"text-level\") discourse-semantics: K~ Parser o n N Incrementation w ~ rules --I r I'~ e d DD g e b","/ Discourse Semantic Analysis Grammar Surface Structure a eS / Domain The generation of English sentences will be demonstrated, with emphasis on the auxiliary system, (including tense, adverb placement, negation, the modals) and the complementation system. It is claimed that the theory of SeSyn makes for a subtler and more precise coverage of the facts of the languages treated than any other grammar system on either the theoretical or the computer linguistics market. It moreover appears that language-specific differences amount largely to different postcyclic rule orderings, to different parameter settings in otherwise identical rules, to different lexical inductions of cyclic rules, or to different positions in the formation rules. When more grammars of different • languages are available a partial parametrization of the general theory should be feasible: the phenomena, in particular those relating to the Posteycle, do not offer a realistic hope for complete parametrization. SeSyn rule systems exist for English, French, German, Dutch. In these languages they deal principally with the auxiliary system (including tense, adverb placement, negation, the modals) and sentential complementation. Hardly any attention has been paid so far to the internal structure of NPs. The SeSyn grammar for French also contains, a precise treatment of the clitic clusters. The Dutch grammar contains rules for verbal end clusters. Extensions are in an advanced stage of preparation for quantification phenomena, conjunction reduction. Application to Turkish is envisaged within a year. 240"]}]}