{"sections":[{"title":"Formal redundancy and consistency checking rules for the lexical database WordNet TM 1.5 Dietrich H. Fischer, GMD-IPSI Abstract","paragraphs":["In a manually built-up semantic net in which not the concept definitions automatically determine the position of the concepts in the net, but rather the links coded by the lexicographers, the formal properties of the encoded attributes and relations provide necessary but not sufficient conditions to support maintenance of internal consistency and avoidance of redundancy. According to our experience the potential of this methodology has not yet been fully exploited due to lack of understanding of applicable formal rules, or due to inflexibility of available software tools. Based on a more comprehensive in-quiry performed on the lexical database WordNet TM 1.5, this paper presents a selection of pertinent checking rules and the results of their application to WordNet 1.5. Transferable in-sights are: 1. Semantic relations which are closely related but differing in a checkable property, should be differentiated. 2. Inferable relations - such as the transitive closure of a hierarchical relation or semantic relations induced by lexical ones - need to be taken into account when checking real relations, i.e. directly stored relations. 3. A semantic net needs proper representation of lexical gaps. A disjunctive hypernym, implemented as a set of hypernyms, is considered harmful."]},{"title":"I Introduction","paragraphs":["When building large-scale lexical/semantic resources, subsequent - or better, simultaneous - validation of content is essential. Basic validation includes formal redundancy and consistency checks. Taking WordNet 1.5 as an example, we illustrate the development and application of such rules. The computational environment for this enquiry is TerminologyFramework, an object-oriented generic tool developed to represent and consistently maintain concept-oriented dictionaries of different types, including WordNet [Fischer et al., 1996]. Into this system, the content of WordNet 1.5 was downloaded from the \"dict/data.*\"-files; some checks were performed during download as part of the operational semantics of our relation definitions, but most of the checks were simulated a-posteriori by database queries. The main aim of the enquiry is not to produce an error report on WordNet 1.5, but to develop a methodology of redundancy and consistency checks for re-use. Therefore, not only WordNet 1.5 has been checked, but our ideas have been developed and checked for validity and relevance using WordNet 1.5. Compared to the thesauri we had previously modeled and downloaded, WordNet 1.5 offers a richer set of semantic and lexical relations which give rise to new questions of redundancy or consistency (cf. [Fischer, 1993]). The more relations introduced into a manually built up net, the more dependencies are created which hold each other in check; once they are explicated, formulated as guidelines and implemented, they can be used to support internal consistency - a necessary, but not sufficient condition for the correctness of a semantic net.","In the following - after having characterized in general the status of formal checks in semantic nets of the WordNet-type - we present and comment a series of constellations which shall give exemplary insight into the topic."]},{"title":"How to read the pictures in this paper","paragraphs":["All pictures in this paper are snapshots from the screen, and clippings from a window of TerminologyFramework's graphical browser [M6hr and Rostek, 1993]. The original, and hence uncorrected WordNet 1.5 data is shown as a graph where a node may represent a concept (i.e. synset, named by its first synset-element) or occasionally a term, i.e. synset element linked to its concept by the designation relation which is shown by its inverse from the concept side and is thus labeled term. Terms are represented in TerminologyFramework as unique objects having the synset element word/phrase as their possibly homographic name, and a system-generated and maintained homograph counter number which is stored separated from the name string as another term attribute. A term node label is distinguished from a concept label by a lowercase prefix indicating the part of speech (hence N for noun concepts / n for noun terms, V for verb concepts / v for verb terms). A concept's label body takes its content from its first synset element which is also transformed on download into a term with this label 22 body. We do not present examples from the adjectives and adverbs which are also contained in the database."]},{"title":"2 Formal checks versus checks based on concept definitions","paragraphs":["We suggest that Woods and Schmolze [1992] implicitly also critize semantic nets of the WordNet-type when they characterize \"typical frame-based representation systems\" by stating that in these systems the semantics of manually linking concepts by"]},{"title":"is-a","paragraphs":["or"]},{"title":"a-kmd-of","paragraphs":["relations is \"strictly operational - defined by how they work and what they cause to happen.\" Then they continue: \"There is no external criterion of correctness to which these decisions should adhere\" (p. 135).","We wonder what would be an"]},{"title":"external","paragraphs":["criterion of correctness even in a system of terminological logic, or is there a criterion which checks the adequacy of a manually supplied logic concept definition? In any case, we would call the criteria which are based on the reasoning of the system"]},{"title":"internal","paragraphs":["ones. However, in the framework of a KL-ONE-type system they can be necessary"]},{"title":"and","paragraphs":["sufficient - relying on a set of undefined concepts, axioms, and a logic calculus - while in a manually built-up thesaurus or semantic net of the WordNet-type only necessary conditions of correctness can be checked. Note that Woods and Schmolze [1992] assume that something \"happens\" when the lexicographer draws a semantic link; they do not criticize - as we do - that sometimes nothing happens or not enough happens","which differentiates this type of link from some other, except that they have different labels. Then linking","would be nothing but connecting nodes. Our aim is to","dig out and apply rules which approximate the intended","semantics of the links, or to populate the inventory of","those checks which are based on formal properties of the","used relations and attributes and their logical dependen-","cies, thus constituting their operational semantics. They"]},{"title":"are","paragraphs":["not based - as in a terminological logic system - on an \"understanding\" of the individual concept definitions. Therefore we call"]},{"title":"them formal.","paragraphs":["WordNet concept definitions are given by glosses in natural language - not referring explicitly to the net itself, thus not making use of its disambiguated polysems. These glosses are attached to the concepts, but sometimes they are not available and sometimes they are intermixed with or replaced by usage examples. Checks may be conceived which are based on an understanding of these definitions whether the reader of the glosses is a human reader or a program, based on linguistics. However, sometimes the glosses are faulty and the link structure is correct, and sometimes the contrary is true; thus they could hold each other in check, as long as they are independent of each other.","We continue these notes on formal versus content based checks at the end of this paper (see section 5) by presenting three examples, contrasting both types of checks when we already have explicated the formal ones we then can refer to."]},{"title":"3 Checks to avoid redundancy","paragraphs":["From the results presented in the following, one can infer that redundancy-free data was the aim of the WordNet lexicographers, but apparently if by insertions redundant data was generated this occasionally was missed, if the redundant data was out of sight of the human checker or the checking program, i.e. distant by some hierarchical levels from the point of update."]},{"title":"3.1 Short cuts in the generic hierarchy","paragraphs":["Figure 1 shows a short cut, spanning four levels of the hyponymy hierarchy from noun concept"]},{"title":"hptd","paragraphs":["to noun concept"]},{"title":"triglycerzde.","paragraphs":["Because of the"]},{"title":"transitivity of the generic hierarchy relation","paragraphs":["this link is redundantly stored in WordNet 1.5. Note however, that the short cut, so obvious in this picture, will probably be hidden to the eye, even in a hierarchical line print-out, when all hyponyms of"]},{"title":"hpid, od [2], animal oil,","paragraphs":["and"]},{"title":"glycerlde","paragraphs":["would be displayed. The numbers of hyponyms from"]},{"title":"lipid","paragraphs":["down to"]},{"title":"glycertde","paragraphs":["are 4, 32, 29 and 1 respectively. Note that '2' in the label"]},{"title":"N. od [2]","paragraphs":["is the homograph counter number, generated by TerminologyFramework. This number need not be identical with the sense number shown by WordNet's read-only browser.","The database contained only 11 short cuts with respect to the hyponym / hypernym hierarchy for noun concepts and 2 short cuts with respect to the troponym / troponymOf hierarchy for verb concepts.","Note however, that the result of the redundancy check is valid if and only if the premises are valid: If one of the non-redundant hyponym links is wrong, and has to be removed the link diagnosed as redundant may be correct and non-redundant. For the cases of redundancy mentioned here the premises apparently were correct. N: II HYPON'YlVl 'N: oll [2]"]},{"title":"1","paragraphs":["H~ON'CM N: animal od"]},{"title":"I","paragraphs":["~-rCPONVM N: glycende HYPON\"YIvl N: tngt 31d IHYPONYM tcerlde Figure 1 A short cut in the generic noun hierarchy 23 3.2 Are short cuts in the meronymic","hierarchy redundancies? Short cuts in the meronymic hierarchy - as represented in Wordnet 1.5 by the semantic relations part/partOf, member/group, and ingredient/substance - have also been supervised by the system on download. 73 short cuts were detected, all in the part/partOf hierarchy However these can be judged a-priori to be redundancies if and only if transitivity holds for the part/partOf relation, and this depends on definitions (not given by WordNet) and actual usage.","A preliminary result of our analysis is: 1. The lexicographers implicitly made heavy use of transitivity, otherwise the data would be highly incomplete; in other words, if transitivity of the partOf-relation had not been presupposed there should be many more short cuts. 2. By an occasional distorted use of the partOf-relation applied to individual concepts transitivity was invalidated; this pertains to cases of the type: \"The Alps are part of Yugoslavia; the Alps are part of France, ere .... \" With respect to generic concepts (not individual ones, as the Alps) there is also an acceptable example of an implicit exclusive disjunctive partOf-value-set. These disjunctive partOf-value-sets invalidate transitivity and inheritance of meronymic relationships through generic relationships. These cases have to be singled out, separated into a special relationship or simply corrected by introducing e.g. the concept French Jlps etc.; then for the rest transitivity holds and short cut checking and checking for redundancy by inheritance is meaningful.","Meronymy in WordNet needs the space of another paper, see also [Bloksma et al., 1996], and [Prlss, 1996]. 3.3 Redundancy by implication of","different semantic relations On the class of verb concepts two semantic relations are defined which are not logically independent: Troponymy (i.e. hypernymy on verbs) and entailment. Example: hmp is a troponym of (or a special way to perform) walk, and snore is an entailment of sleep, if simulated snoring is not snoring. It is stated in Fellbaum's WordNet paper ([Miller et al., 1993]) that \"Troponymy is a particular kind of entailment, in that every troponym V 1 of a more general verb V2 also entails V2\" (p. 47).","Accordingly, the database does not include a verb V 1 which is a direct troponym of a verb V2 and directly entails V2, because the latter link would be redundant. However, because of the assumed transitivity of troponymy, the database stores only direct troponym links (2 exceptions, see above subsection 3.1), and taking this into account, the rule should be formulated more exphcitly: If a verb concept V1 is a direct or indtrect troponym of V2, then V1 entails V2. As a formula: (V1 troponymOf* V2) => (V1 entailment* V2). (Here the star operator designates the transitive closures of the relations it is applied to.) Hence the check must look for non-empty overlaps of these two virtual relations. Resuit: The database included 15 redundant direct entailments; one is shown in Figure 2.","Figure 2 also includes an overlap with redirect entailment (from massage [2] via rub [1] to touch [7]); this however vanishes if the redundant direct link (from rub [1] to touch [7J) is removed, but what is to do, if the troponym chain from manipulate [2] to rub [1] would not exist in the database? The constellation then would not be tractable by automatic update. The database in-eludes another three indirect redundant entailments of this type.","With hindsight and foresight we are emphasizing the following: The logic of the generic subsumption demands that every instance of a subeoncept is also an instance of its superconcepts, otherwise the logic, supposed to be started from, is changed. From this follows that poly-hypernymy has to be treated with care: Multiple superconcepts to be implicitly combined by or (disjunction) and not by and (conjunction) invalidate \"that every troponym V 1 of a more general verb V2 also entails V2\" (see below Figure 12 and Figure 13).","+ ,:V touch [7] 'rake physical - / ~ \"~ : contnctwlth, come",", ,~\" \\ Omss'-,.~Incontactwm: + \" \"rl~:tOPOltPa'~ \\ \"Touda.,he stone for",", / + ~ .\" goodltek+'She","' , ' ~ never toudled her","Â£V handle [2] ~ husband'; \"The two ' l , \\ Ixildlnosalrnost","mOP+NYM '+ \" . \\toum-",",, .\" , ' r ENTAILMENT \\ t = V mampulete [2] : \\ \"","gloss I \"rROPON~,lvl ,","'hold ,omathl.g I \"~'~,~ , .., - ~ rno~/e ~/er","In one's handy i v gu=oe [lJ ~ something","imdmc'.~a' [ gloss ~ ~ with","I . .\" ~. ~ pressure'","TROPONYM wr example, pllsS TROPONVM \\ Â¢"]},{"title":"l-","paragraphs":["Â°~'=\" ~ \\/ I V rub [1]","I ENTAILMENT / ~ ,","V massage [2] \"\"'gloss..... ' 'usuaJly for medicinal or relmmtlon purposes\" Figure 2 The entailment hnk from rub i7] to touch [7] is redundant However the entailment hnk from massage [2] to rub [1] is not redundant, - or could massage [2] be a troponym of rub [1].9 May a troponym of x also be an entailment of x? It has been pointed out in this subsection that a troponym t of x also entails x. Therefore, if in addition x entails t, then x and t are equivalent, logically. It follows that - if such a constellation occurs, and the premises are valid - the concepts t and x should be merged.","The database contains exactly three constellations of the type in question. They are shown in Figure 3 and in Figure 4 which contains two cases (the pair exhale [1] / breathe [1] and the pair inhale [1] / breathe l\"1]). 24",", ', r * ;' ,,,, ...... ' _,___ :.._,.~...~ v: care for [1] \" , ,. 1 =,,, . . \", :, V. t reat[ ]~_term.~:..:L..,,,::vtreat;q ~ ., ', ',. + [ , ', ' , rpr0dde treatrnerrt for\" '","~,-.~I\"ROPONVM : - '-\" ,:~.a ,L~,rr~.rL~,L';~. - \" ' \" \"",", i = ~1 l, |~ t,a -re. ~2 e*ltJ .r Ii.jLIi~. ~ - Â¢ .",". '.:~ ,: - , ..... . . ,~ .\",~L.t:v. dispense [1] , ,",", ', ........... ..,..,_.,...mrro-TS:-T.,~.. ~ , ~,,;. : - V: administer [1] -.--..r.term.:j..:.. j \"~ , ': ..... \"","' \"-'-~tmgr~ t %.'' \"-----'~ \"~ .,~'~v: aammlstert/j \"~ , ~ ' 0 S = J i1\" I ,*- - '-',','t~';,i'> '' :~ .~, -'-.~,-~'\",'ofhledlcafJons\" , ~ ~' Â• =.,.Hi, H?. [ ,,-~-;r-], ~'t.0., ,,.~?'~- -, , r,\". . .,\"-~-'- t. \",-'J l ' -~:; \".~\" \",.'.;~.'~, ~,-',, ;. . , ,' :',' ENTAILMENT :r1~,..OPO.:~:;~,l~. ',~ ,?!'!:\" ; o ~. J,,,\" , ,' - , ~' ~'~=3,.,.~ ~.: ~,',- - -, : ' ] ~ : I- ' ' ~, '~.%~:~:dr~.JL~ '~ : ,' -\"J\" -,\" '. , ~, \";,.',\" ~ I /' \".\" ~$'~:~-~.~,~'~\"='\"'-~\".-, \" \""]},{"title":".t :: ', \"","paragraphs":["r' ~ . ,~ ,I'-~.,,.;;~\" ;~,\" ,.'~.\"~- ',,,, , . V: give [22] ,..~.,......_,lerm.~.L:,~.,.~,ff, v ' hive r221 = .-~- ~ \" .... Â° .... -","-","gloss. ,,-!,:\" ~.~..~, ,,,.'~ ,'~ ~'~ r' .\" :, ' ,', ,, ' 'as of t,.re~itr0ents or proi~esses:,: , ,..,,, , .' , . \"= ,~,~. ~..,.. , ' ,~, , '' ShagaveNmRrst,,~.ki. I '. - :. ,, :, .,, ' . gavehl.rh~dI.u~ ,~ ,,,'. :-', ~ ,- , ;,': , ',,,' , , , , , ,\"u \"- \"\"-;~7-~: ~',: >-'~' \" \" Figure 3 Are admzn~ster [I] and gtve [22] equtvalent? According to our view the premises in Figure 4 are not valid: exhale [1] and mhale [1] are not troponyms of breathe [1], because breathing needs exhaling and in-haling; both troponym links should be removed. On the other hand, for the constellation in Figure 3 we would assume that the synsets {administer, dispense} and {give, apply} should be merged.","? ,, , ,","',' ' ~ ~o.~;'(~] .... o .... , ,., ,","\"~ \"'\" -- \"\" ~ ' ~ tMl~t\" ' v take a breath , , , '1~ olr inla; term - ~ .... , , ' ' ' ' \"I'Tt~P(~NYM ENTAIl,R\" EI'/'I'NI~F ~ I * '\" ' \"~ breathe ,n ''' ~\" \" \" Iomt ~ . ..... hede [1]","..;, , ~., ~ ~,.--., ., %. ./~T~-'~\" ~. ,",",~ Iv exhnle[1 \"~,.-,tllrfrr~,~ \"' , ' \" ~:, , %'-~ ~'..~.~n~._~,,v draw n mr",". .~, , . _j~rrfl~,_,~V exhale [1] ,, . ' ~V inhale 1]-,...i~,.Â•L","v exp,re [11\"7- tm~--/'/~ Irk ' \" ~ I ~ \"----Inh~e ~eep~","...... .,=4\"Lm m /-/ - . ~ '","."]},{"title":"/t '","paragraphs":["youlltthl ENTAILMEWr ' \"~ ' Â• ... . I, t' \" =--\"e \" ' /' 'IROPONYM%~ , wmglt\", / 1ROPON'~M ........ 7ROPOI~,1:1'1:~O1~ \"'\" '':' , / ',","I ~. it ,~, t -~~\\v.~,,=o[~]"]},{"title":",' ,:, '/, I ,Â°\"ff '', \\,,,/, , \\\\N","paragraphs":[", ' ENT~IJvEN'r f , ,V.sneeze ~\" ~ ' ~/.~ ' V snort[3]",", , - ~. t 'V snort","[1] It V puff [7/] V hLIf [2] tlwheh m t, tate a sn~'tl~9 \" ~ , 's~:k In er udm, u ol alr~ \"draw' kdtant enlmled sound ~ V blmv[l) a deep brmh'~ drew on a o~e's nose' e0duJ~g hmf 'e~ale herd:","I Figure 4 exhale [1], tnhale[/], breathe [1], and their enwronment","3.4 Redundancy by inheritance via troponymy We did not exemplify what is meant by redundancy caused by inheritance via the generic and meronymic relations for nouns (of. subsection 3.2). Instead we show an example for inheritance via troponymy, see Figure 5.","- . . r- .. ,\" 2\" ',- ,;' veil Bd, lravelt0ward :,: : - .', \"lzt,~or~tnl;'o=m]now., r:,.. ~7,,:,~ ~r~oh~6~:,~,. -- . -',~-'c~~;=;~+~'--,,~+i\"\" ~:, ;J.~':.,7.~:.:+:'+ +.' , , Â¢ 2.- a ~-aj.~,. 3,,. p -~- . - \"k-~ - i k- ~\" s - .Â¢- - , - =\" ..... \" \"'~- , \"= -;'~'.'-~, \" ,~' .... '-\" \" ~come[6] \", ; ..... '- -\" ~'~V Ixng~]~.Z~r~NI:.~ILMEI~ ~.-l~Vcome~\"52~'~. - ~:!.~ :~ \" v.fe~Pl 't~,m~; | ' \" - :~' :; '~ r '/~L~=..-~-,~: -'-,,v=mo~t3} :vbnng121 .... \" .... , ..,d .,=,. ...... ~ _\" ..... .~:-- :ENTAItMEN '~'. '=~-'\"l \" ; -\""]},{"title":"i :: ii: - ;","paragraphs":["- '\" : : \"q;V~ngaong\"r'-%~.; \", ,'-:1\"-~':~'\"-'\" \"- -:Z \"~ -~_ ,, .... t~[tb~, - . - . ..... , , :.: , V 10ring around [. v txlng ~lt~pg \" :. ' - \" : ' ' -'~.. ~.'.r ~tv bnng with - \" Figure 5 A redundant entazlment link from brmg along to come"]},{"title":"[6]","paragraphs":["Nine concepts qualify with redundant inherited entadmerit links, however five of them also qualify as redundant by implication. (see above subsection 3.3). One example of the rest (4 concepts) is shown in Figure 5. The database contains some further redundancies by inheritance via troponymy.","3.5 Redundancy by synecdoche versus auto-relationships Our trainee students, in their search for synonyms of a concept c, tended to take designations of some superconcept of c -whether the superconcept already exists in the thesaurus or not - and added them as synonyms of c because these words are also used to denote the concept c. The examples given then may be related to the phenomenon of synecdoche: According to the OED synecdoche is a rhetorical \"figure by which a more comprehensive term is used for a less comprehensive term and vice versa, a whole for a part or a part for a whole, genus for species or species for genus\". While such a synecdochical use of designations, carefully applied in discourse does not lead to polysemy, it would lead to an absurd overload of polysems in a dictionary, if the principle would be transferred to it, even if reduced to inherttance of designations, i.e. top-down, not bottom up, and along the generic relation only. 25 ' 'a tool with a sharp, point and euttJng edges","* ' for making holes In hard materials (usually '","'a motor-driven tool\". , \"",",. , ~ rotating ~apicfly or by repe~ed blows)\"","' gloss \" ~. ,' gloss .. -- ' \" N', powertool ~- :: .... iN', drill [3], ' \"~rm~ . .,-- ,N.,;,,-','/-,-:.:-"]},{"title":"---- 'I' '","paragraphs":["; : .: . I -i .",". T",".","~","\"",",","r\"","\"Z","~j,\"",".-~","-","\"= -.' \" , -' ~N'p~erdnl*:.-:-t,~'~n:po~erdnJI -' I .."]},{"title":":","paragraphs":["' \" - ' *-\" ,:, enlesaxe","'-: \"-'- : I '-=G~oss~?: o' .:' ', , . z- , :","I","I","I",". I","~",".","~1","Â¢","fv\"","-11-1",".","I","~",",, , .' I . - apowerto~forrnaIdng I .","Â• \" \" J..h.'POl~C, tl~! \"holes In her'Â¢l'mitl~rlills; , I , i - , 'i ,, :',r, O~(-.~ J 3' ' -\"1 \",","_ ' , ,'-:: ,N. drlll[,:l]::~.~LTr~rn~7.~n, drdl[4 l r-:.~ ... :?. , :","\"~ \" -.. , '.- ,,.~ ~ ,' ,. gloss :\" n: electrlc drill _',.'~ , ',.'","',","a .","_r-","Â¢","'","~",",\"","-","L.",".",": \", \",.>..~.: ;:?'a rotatllng ddli pofvered by an~elearlc rnot fir ~ . - ~ \".i Figure 6 Redundancy by synecdoche or an auto-relationship9 An interactive or batch check may look for direct or indirect superconcept-subeoncept pairs which have as-signed terms with identical names, thus giving rise to homographs. However, the interactive check's action part should be a warning and not a roll back, otherwise the system would exclude that polysems can be arranged in a generic hierarchy as superconcept and subconcept. Fellbaum [1996] calls this an \"Autorelation\" (in German). A good example from WordNet is the noun"]},{"title":"drink","paragraphs":["in the sense of"]},{"title":"beverage (drmk[2J),,","paragraphs":["and in the sense of"]},{"title":"alcol~ohc beverage (drink [3~.","paragraphs":["However, what about the","example shown in Figure 6? Is the assignment of term"]},{"title":"drill","paragraphs":["as a synonym of"]},{"title":"electric drdl","paragraphs":["avoidable redundancy leading to avoidable homography, or not? If not, why was"]},{"title":"drill","paragraphs":["not also a synonym of"]},{"title":"power drdl?","paragraphs":["If yes or no, and even if we confine ourselves to a synchronic view of language, what would be a working guideline which delineates the assumed good example"]},{"title":"drmk","paragraphs":["from the alleged not so","good one (Figure 6)? In the bilingual"]},{"title":"DUDEN OXFORD","paragraphs":["we find as a translation of"]},{"title":"drill","paragraphs":["into German not only the general meaning"]},{"title":"Bohrer","paragraphs":["(WordNet:"]},{"title":"drdl [3]),","paragraphs":["but also"]},{"title":"Bohrmaschme","paragraphs":["(WordNet:"]},{"title":"power drdl)","paragraphs":["in the context"]},{"title":"(Carpentry, Butldmg).","paragraphs":["Given that the concept or meaning unit is context independent, this may bring to mind that not only translation needs context, but also synset membership.","The database contains only 23 noun homographs selected by the mentioned check. These homographs belong to 21 pairs of noun concepts. Five of them are singled out due to the type of mistake which is shown below in Figure 15: A hyponym link has been coded where a meronymic one would have been correct. The corresponding number of verb homographs is 283, and they belong to 336 pairs of verb concepts, among them five cases which are synecdochical or auto-related triplets.","A similar type of questionable synecdoche pertains to cases such as"]},{"title":"{drumhead, head},","paragraphs":["a synset which is a hyponym of"]},{"title":"membrane,","paragraphs":["but also creates a new sense of"]},{"title":"head","paragraphs":["(total number of senses: 24)."]},{"title":"4 Consistency checks obtained for semantic relations which are induced by lexical relations","paragraphs":["When asking for possible checks not yet performed for WordNet's term-term relations (lexical relations) we became aware of their interference with the concept-concept relations (semantic relations). This enquiry is well supported in TerminologyFramework by its easy-to-handle facility to define virtual (i.e. inferable or computable) relations on top of real or virtual relations.","4.1 Exclusivity of hypernymy and antosemy The WordNet antonymy relation is a lexical relation, i.e. a relation between synset elements of different synsets [Miller"]},{"title":"et aL,","paragraphs":["1993]. Therefore it was modeled in TerminologyFramework as a term-term.relation. With regards to concepts, two concepts can be defined to be"]},{"title":"opposed","paragraphs":["if at least two of their terms are antonyms. TerminologyFramework implements the"]},{"title":"opposed","paragraphs":["relation (synonymously:"]},{"title":"antosemy)","paragraphs":["as a"]},{"title":"vtrtual,","paragraphs":["i.e. computable concept-concept relation (see Fischer et al. 1996). We say that the semantic relation antosemy"]},{"title":"is mdueedby","paragraphs":["the lexical relation antonymy.","Antosemy relationships and hypernymy or hyponymy relationships are exclusive to each other, i.e. both relationships cannot hold in conjunction between any pair of concepts. This rule may be based on the feature model of concepts: If we assume a concept representation by features, then hypernymy entails inclusion of all features of the superconcept, and this cannot be compatible with an antosemy between superconcept and subconcept, which may, for example, be based on a meta-antosemy relation between features.","For a cheek of this rule the overlap of two"]},{"title":"virtual","paragraphs":["relations has to be determined: antosemy and the transitive closure of hypernymy or troponymy. The number of antosemy relationships is about 800 for nouns, and about 500 for verbs; there was no overlap with direct or indirect hypernymy, and in only two cases there was a non-empty overlap with indirect troponymy. These two violations of the exclusion rule are shown in Figure 7.","Note that there is no overlap with direct troponymy, but with indirect or inferable troponymy. What is wrong with this counter-example? The troponym link from"]},{"title":"prove [1]","paragraphs":["to"]},{"title":"negate l\"1]","paragraphs":["is an error, and it may have its origin in a fallacy:"]},{"title":"To prove by negation","paragraphs":["is a troponym of"]},{"title":"to prove,","paragraphs":["but this is different from"]},{"title":"to negate","paragraphs":["in the sense of"]},{"title":"to show to be false.","paragraphs":["In other words, one may prove A by showing that the"]},{"title":"negatton of A","paragraphs":["is false, but the point is, that the"]},{"title":"negation of A","paragraphs":["is another object than A, i.e. the object to be proved has changed, and indeed, it cannot reasonably be maintained that to negate A is a special way to prove A 26 The two violations of the exclusion rule Figure 7"]},{"title":"4.2 About binary and n-ary (n > 2) antonymy and antosemy in WordNet","paragraphs":["WordNet 1.5 permits cardinality > 1 for antonymy, however a cardinality check of antonymy is blind with respect to fundamental semantic differences of which the cardinality check for the induced relation, the antosemy relation, is more sensitive. We explain this by the following examples from,WordNet 1.5:","The verb term trust [1]is an antonym of the verb terra mistrust and of the verb term distrust [1], and both - as variants - are synonyms of each other. Thus, the cardinality of the antonym set of trust [1] is 2. However, because these two antonyms are synonyms, the value set of the induced antosemy relation of the concept belong-ing to trust [1] has cardinality I. Therefore we say that trust [I] has no genuine multi-value antonymy or, synonymously, it has binary antonymy - although its antonym set has cardinality 2.","On the other hand, there are cases (one is presented in Figure 8 below) where the induced relationship has cardinality 2 and the basic antonym relationship has cardinality 2: In Figure 8 the term ~,. artse [3] has genuine multi-value antonymy or (in this case) ternary antonymy. However, not all cases of cardinality 2 of antosemy are caused by deliberate ternary antonymy. Cardinality 2 may also be caused by an error of a type we try to describe in the next subsection. WordNet does not differentiate between binary and n-ary opposition (n > 2), or, basically, between binary and n-ary antonymy (n > 2), and due to this implicit merging of relations, the lexicographers intentions cannot be automatically checked by a simple cardinality test for antosemy; i.e. we do not know which of the cases of cardinality 2 of antosemy are inconsistent or not. The comparatively low number of these cases (about 200, but only 40 for nouns and verbs) allows for intellectual perusal. ~,,,~',..~lJ~slt[4] ~'-~.~\"l'~ ~'~'.7,=\"- ~1 ~,\"~'-'\" ,\" ~v:.ller41 ~: Fngure 8 An interesting vmlation oftransitiwty However, if n-ary antonymy is admitted the law of transitivity is at stake. We singled out all cases where the transitivity rule for antosemy was not fulfilled, resulting in 29 connection components or 85 involved concepts. All these constellations seem to need correction. The corrections we would suggest are: Cutting of an antonym link, or a merging or a splitting of concepts, and all these cases belong to the type characterized in the next subsection. There was just one case, shown in Figure 8, where we first thought that an antonym link was forgotten (between v: sit down [2] and v' he down ), and this was caused by the fact that the database contains the following transitive complete group: he [2], stt [1], stand [3] are antonyms of each other (see Figure 13). Coming across other perhaps more harmful cases (see below Figure 12 and Figure 13) of a concept which is to be represented as a disjunction of concepts and itself a lexical gap, we now suggest that the constellation of Figure 8 was intended to say: arzse [3] is an antosem of the one concept sit down [2] or he down. However, if this single-valued binary relationship is split here into two binary ones linked to the components of the disjunction, then all antonym value sets must be interpreted as disjunctmns, and transitivity need not hold for n-ary antosemy with n > 2. On the other hand, the antonym value set of trust [1] is to be interpreted as a conjunction. If the example of Figure 8 is interpreted in this 27 way, we also loose simple symmetry of antosemy: From the mere fact that the antosem of stt down [2] is artse [3] one can no longer infer that the antosem of arise [3] is sit down [2]","4.3 Commutativity of synonymy and antonymy is equivalent to maximal cardinality 1 for antosemy t Fzgure 9 A case which qualifies as a wolatmn of transitivity of antosemy. Was the constellation shown in Figure 9 intended as ternary antosemy? Is the case equivalent to Figure 8? We do not think so, and this may be backed also by the fact (not shown in this figure) that V. sedate is a top concept while V\" de-energize is not. The constellation shown in Figure 9 may be characterized by another law which is pertinent here if we may assume that binary antosemy was intended. It is an abstraction from one possible correction of the constellation: The antonyms of the synonyms v: energue and v: smnulate [1] should be synonyms, i.e.v, de-energize and v: sedate should be synonyms, and in order to achieve that, the concepts V. deenergtze and V sedate need to be merged.","Abstracting, the rule postulated for binary antonymy is: For each set of synonyms S the set of antonyms of the elements of S must again be a set of synonyms or it is empty. By \"a set of synonyms\" we mean a set of elements which are defined as synonyms. If we would in-terpret \"a set of synonyms\" as a synset then the rule reads: For each synset S the set of the antonyms of the elements of S must be a Subset of another synset, the subset may even be empty or be the whole synset. Transforming the rule into a formula, would help to better see that the rule is a kind of law of commutativity between antonymy and synonymy. Another paraphrase of this rule is that binary antonymy is a structure-preserving or homomorphic mapping with respect to synonymy.","There is a simple checking rule for this because the rule is equivalent to maximal cardinality 1 of antosemy. However, this would help for future checking only if WordNet is modified and updated so that binary and n-ary (n >2) antonymy would be different lexical relations. Note that the value sets of binary antonymy need not have maximal cardinality 1, although this is true for binary antosemy. 4.4 Commutativity of antosemy and","hypernymy / troponymy The commutativity rule for antosemy and hypernymy or troponymy - as a heuristw rule - has already been suggested by Fischer et al. It may be justified by feature inheritance. Formally the heuristic rule of commutativity states: For each concept c: If antosem(c) is not empty, then the equation hypernyrn (antosem(c)) = antosem (hypernym(c)) or set inclusion in one direction or the other should hold. Applying the rule on the WordNet data has resulted in 91 noun concept and 260 verb concepts fulfilling neither strong (equality) nor weak (set inclusion) commutativity. These cases have not yet been evaluated by a native speaker, but we suggest that they deserve revision. An example is shown in Figure 10. ' ;1- : ' '"]},{"title":"i ': 1- : : ~,: t,~\" ' N","paragraphs":["nghteousness ~ , . ~ppo~ld, , ~N unnghteousness v","N honoral~leness.~.-..opposetl,--J.-N d=shonorab/eness, . ,, N dJshonor[1] , l '~ : _ \"'aLOS~' - -\"GLOSSl :","\" I \" , ~-. .... ,',-,~ -I-:","Hwo~ .~equ=~,,~ ,, ~.~\" Vta,OmM- \"","\" t ~ des~oroÂ¢ ,;,,, honorÂ£r + L .-~ .,","'l ' \" r~,='\" , ' +, +:' I,~t,,~,r~,,, +: I Â• N fidel*ty[2] 4, ;ppoNÂ¢l . ,;, ~N' infidelrty ~ tccPO~ - ' .'~,. ~ t.ta,oNvfl","\"N loyalty[2] ~ ~posed ~ N dtsloyalty -=.",", Figure 10 Four of 91 noun concepts fulfilhng nezther weak nor strong commutatwity of antosemy and hypernymy\" The four concepts are honorableness /dtshonorableness, and fidehty [2] / mfidehty. For morahty [1] and immorahty [2] weak commutativity holds 28 4.5 Disjunctive hypernyms -","or may antosems share hyponyms? If we rely on monotonic feature inheritance the above question needs a negative answer. All the more the empiricist may be interested in convincing counter-examples. These are the results of the respective database search:","For noun concepts (after we have corrected that irresponsibility was an antonym of itself) there is exactly one hit, shown in Figure 11. .,"]},{"title":"..%","paragraphs":["' a',,, - . % \" ~r~ r ~ ~, ' I~ lit~ml y- -, - , :%.:N assetiZ] ~\" .., \";~'~. ~.. \"'~...':I~II Iilli01hty[~] \".-.\" \" \"j . -'~i~t' ;' ~S~ve . -: A-.': , ~ , ~ \"- ,~ : .... -=~ r. \"\"n'p*~Vo~,o~on . , -\"- .... # ~I01~,~; cred'lt~ ~1-\" \"~- -'Â¢' \" Â¢\":\",7-ff~.; \".~.'.. \"- \" \"n flnencmlobltgatlon- -,ll.i~lle.ll~,--_ l'i !./J . ~'.,-. ~,' 2,,~ N oeOt[l : j,~ .......... ~ , =, .~.~.'~.lTt~.-~'{,,~-~ ....-,I,-j.r.. I'. '-~: \" .F '.=--\" ~r'r,~- -2\"'n ,nde~edness [1] ; ~ \" . -~:. ,<~. ='.. . .,~--~, . :~ - , .-.,. ~ . ., ~, ..- -.~_ .\"","f n11~ll~, Z ,:'\" N ctedlt line [2] ~.\"',: if\" \". ,o HYPON~. \"~ llOWld\" \" : ' :",",~. \"P~.-':\"--' I T\".; ..'-;-, \" \" LI '? \",-'~-...: ,:..","\"~'==d~d\"~- \" v\"~... ~-'\" -. '-~ 'Y,';'- '. 'thepm,,,~ \" ,",": \"","h .\" :\"- ',' ,~,~.~,~y,f ,',. :, --,r.,;,,y# -,., >. _~,',, ~'-'~'7\"-'-~ \"\"~a~, )' \" \" ~, \" ,:. ."]},{"title":"!:;.","paragraphs":["~_~,~ ',,, ,-'-,IN home eqmy cfedlt [ - I.~. ~ .N installment wedlt = ,, ' ', ,","IUIt~",".,","-","J-",",","~",".I","'~","-",".22,","I","-","-","~",".",",.","e","-..","',-.'-~', -t2 \",:e~. .... '.\" .\"' -'-.~ ~ ,,\" -~-: =, \" :\" , ,","~ , ~,,,'*~ \"., -I-, ,' ~, ,-7,':\" ~,,', t ' ,' \"\" , - ..",". :.-~-.:.,, ,~.~' ,.= .~.~.~,=~.,t ..... .' ::,,:, -':-=,3' .I, =\\,',': .... ~ :' ,: \" \" . , : ':' \"\" r: \" - ' - ~ \" Figure I l Special credits represented as oxymora (Webster' \"a figure of speech in which opposite or contradictory ideas or terms are combmed\")9 Or\" Can a credit which has become a real debt be accepted as an asset entry? If that meaning of credit exists, where credit [7] (an offer) has been transformed into a debt by drawmg on the offer, should it not be differentiated from credtt [7]? For verb concepts - if we subtract the two cases produced by the error treated in subsection 4.1 - the check detects exactly six pairs or two constellations shown in Figure 12 and Figure 13.","In Figure 12 the verb concept smuggle is a troponym, directly shared by export and by import [2]. Although the gloss says that smuggle is a troponym of transport, we may perhaps redefine: \"export or import illegally\". However, if someone is smuggling it cannot be inferred that he is exporting illegally, nor that he is importing illegally, only the disjunction can be inferred. The semantics of the generic subsumption is that every instance of a subconcept is also an instance of its superconcept, otherwise the subsumption is not justified. Therefore smuggle is a troponym of a concept export or import (or yet transport?). The stored troponym links have to be removed. Note also that otherwise transitivity of troponymy would be invalidated and short cuts could no longer be deemed a priori to be redundant.",", r ',,vseliabroad, t \" \" \"- \"~ ..... , t.t-,'l'~: ~ .... , .: ~i~. .term .,'r ,-.:' ,~, \". . Aerrrl :--.-.. ~' \" , =\" --;'-~\\,\"1 \"-\"~r :\",~r\"\"'~ \" ~1.,I .~,1 ~ \"~.~'- \" ~-~'7\"~\" ;'%'~V' export :'\" '~p'poseil '~' V, IrrlportlZ] ~'.~ ~\" :~ \"~ \".,","4..--., .... ~. ~ ~ ~'~-, o-.: -~ ,;~ -, .,: ~ ' ',4.. ~--~ :v transfer abroad ,,- ~ '~ - ' %, +,.' , ~- ~'l~'ln\" ir~fr~l~'abrbed; \" - '-~'~- \"', c \"~-o E'~.-.-,~.~X--2. - -.;--̂' ~\" \" \" \" \"~'\"':' i; Y ,';', ' -, 41 '- :I ,,:'. r-:.,~ ~'.~'~'..\\~ :i~::.,', ~Â°.~-~ .. o .~].~!,:~ ,- ~. :. -~,r'---\" :,-, .- :a~-\"~lOIl'-\" tarrn, ;j : '-'- -tz-~ ~T - \" , : .,,, Â¢:,:. ::...~ .~:. transport l)legally\"~ ..~-~ smuggle [2] ,.., ,,,, = \"T4,d~-\". ,']~ Figure 12 The \"disjunctive hypernym\", Implemented in a way which is harmful: smuggle [2] should be a troponym of a concept export or tmport [2]","From this diagnosis we are led to the question what was the general practice in WordNet with respect to multiple direct superconcepts? The database contains 558 noun and only 25 verb concepts with more than one direct superconcept. Among them, of course, also those found by the short cut check (see subsection 3.1), and for them the value set of superconcepts implicitly is a conjunction. Apparently this was aimed at for all nouns, but we saw a case where the hypernym relation implicitly was substituted by ts-used-for and this made up an or. For the verbs we see far more ands than ors, among the latter also undifferentiated verbs which are troponyms, e.g. of both change [1] (\"undergo a change\") and of change [3] (\"cause to change\"); el. also below section 5.","\",L~\"Wlhatt/tti' [, .', ..... ~ ~,t'- \"' \" - --. \"'\"\" \" . _.-_..' ~ ~.- ., '~-,-. .-,:-.. -, ,: ,-i~e,ylng, be v ~uma~a~,m~: --'~ Â• - - , \" ' - - .",": .- ,, ..-,.' . -. .... \".':j\" : \". :'. '- ~ro~ian; be - Â• ~', , ., , \"'~ ~posea ; , d \"\" \"' .... ' \"\"",", p~rrdrman~l-,~ .>-I\"~.~- '\" . '-, ~ :-\".,,k'- ,\" /e \"' ....; , ,","', \"","\"","gloel","\"","\" ', .I;- -' ,~ \"","~",",~","-","\"..' ,-, \"",".....",",.~.","'","Â• .'%r' ,p. --. .... .,-,m.i. ,. _- ,.r ~.,,, ,-. \"?~a-\"~ \"","'-V: stand [3] ~l'='oppoiad \"71,,~V: Sit [1] :,,,,,~,,,,:op'p.~.ed ~,~,,~v: ,,;"]},{"title":"tel","paragraphs":["' - ~ : \"TFIOPONY M TROPONVM TROPOI~I ~': ' Y'.,","Â•, ,., - , sprawl [1] ~ oss \" 'sit or Irffwlt!i -, Â• . ,..,,..v ,r:- --' :-~one'sllml~ ~ \"",". :- , , .: .S, TF~OPON'YM ' - r spread, q~' - ,. \", V: spread-eagle [3] .-- -. '=7., \"stahd with arms and legs Ipread out' ' ;' \" ' \" ' Figure 13 Beyond details to correct we want the reader to see that again subsumption is of the type of the harmfully implemented disjunctwe hypernym. 29","5 Continued: Formal versus content based checking At the end of section 2 we promised to present three examples which illustrate the difference and the limits of formal checks in contrast to checks based on concept definitions; here they are:","Figure 14 shows an example which was retrieved by the check described in subsection 4.4: Neither weak nor strong commutativity holds for the concept pair N. employee and N: employer, and the formal rule suggests that their direct superconcept should be opposed. However, reading the gloss of N. employer the human reader (or the program analysing the gloss) may infer that the superconcepts need revision: The gloss logically demands the existence of a concept person or firm which does not exist in the database, although Fellbaum [1996] argues to consider lexical gaps; however, if one would propose that an add+tional hypernym link to N. firm might help, that would be an error of the type discussed in subsection 4.5. Another unfortunate decision would be to create two polysems: 1. An employer who is person, 2. an employer who is a firm. Bloksma et al criticized that WordNet practice.","The second example, shown in Figure 15, was among the 21 noun pairs which were retrieved by the check for generic synecdoche or generic auto-relationship. This topic was treated above, see subsection 3.5. The concept pair we present here is satmwood [1] and satinwood [2], linked by a hyponym link. Because supereoncept and subconcept are both designated by the same word, thus creating homography, they were detected by the check which relates to generic synecdoche. However, this example is neither a case of generic auto-relationship nor is it a case of avoidable generic synecdoche: The hyponym link between satinwood [1] and satmwood [2] must be replaced by a substance link, also available in WordNet. No formal check could prevent the lexicographer to select the wrong link type unless the synecdoche checker would lie in wait and catch this special case because of name equality. Asking for a check which would be adequate in more generality, we draw the reader's attentmn to the two superconcept chains which - before they end up in a common ancestor - are headed by hfe form and object [1], in the sense of the negation of life form (see glosses). Assuming that there exist entities which have aspects of a life form as well as aspects of not being a life form, we may be interested whether WordNet refleets this non-Boolean logic view. In fact, in Wordnet 1.5 we find 15,087 subconcepts of object [1], and 13,806 subconcepts of ltfeform, and only 6 concepts in the overlap, among them, of course satmwood [2]. In 4 of these 6 cases the same error occurred, and in the other 2 cases the hyponym link was mistaken for a member link, also available in WordNet. WordNet does not encode plain logical incompatibility, to express disjointness of hierarchies, but what about antosemy? Was it by chance that life form did not get the term ammate object which then might associate the used term mammate object as an antonym? Then we would be led back to the check of subsection 4.5: May antosems share hyponyms? . ' + '\" \" ; N: person [1] \" , \""]},{"title":"/I \" , . ~","paragraphs":["\",.-~ ..... ,..~., :..- Â°,- :\" . ~ I.i~POPlf~4 \" ~ ,' I..I'~: + ' .:~. ~ '"]},{"title":"+ \\ .....","paragraphs":[":\" \"~\"':++ \"'+~.,',.\" 5,\",, '+- ~ .... '","\" .N,,nonworker+..oppo~ed_~N:womr~ ] ~\" -,.~\" ,N,,leader[2].,~-.,r~r_t.Jt,7.yN,,follower[1]+: '- \" \"-: - : '\": ': .:,:' .' +m,. ..-:/,' ' -:+ :.--'.- , - . \" \" \" . , \" +2 ~ P -*L \"' : ~,t\" t~ .1 - - + ' ~ Â• 2 '-; +',,~+i+e .,- \", '.~ :-, ,~N:empkr/ee+.~,~,N em,d~r, .~ +, :'.'. \" I ~\" +\", \"! '.',,, \" + ++ +--:+':C:,;,,g'+'~';-PP'\":~-+r+'~'~' +~.~,.,:,+v::~,+;.,++ '.,'-:';+.\"- : ++~-: ~-~t0SS,~::~.+:;+~.o:, .+~: k- Ot0s~,+'~ - ' :..;+ ~. ; - \" , ~+ * r + - +.,, .-.t,. Â¢i;i .-r a -+-k:, %+-;) ++:',;l--',~-':+'Â°J:. :..,:'++:' ?~-++ -, : .., = -,:- +",".. - ,.., ~-.~,mpe~og.~ <...,; ,~-++. ~,... ~t~r+l~ .~', Â•, .~+ , - -\"+ = - ~.~.. n -\"+\" - - +- : - ' +. + *+_ -... Figure 14 The posmon of employer in the net does not reflect tts gloss. t ' ~' \" ' \" , -+-- - -'7+-'._ ,~ -- , , - ,. .~* ; +- \" '-.: +-+'. \"~'~'\"NentJty 7 \" . ., . - . -n tnanlrrlateo~eet.\" '~ - ~\" - ,f'- ~ ' +. ,, .","', .~-',' ',+\"\"+-t~:_.\" IPÂ¢I~ON~'MP ~ I'IWON~M \" \" te(In~ \"n Iangthtng ~ '\" \"+-n.obje=[1] ~...+ :\" ~ + :=7 Â° j.%k- '+fo\"~.~.,.n organ,sm[1] . \" - ~ \"\" \" \" .+.tllrll~r'l oqectLlJ ~ - . \" 9N ifemiim . . \" n physcalo~ect ;',,..+'+++ L '' , +' -' \"\" r\" ~\"tllll'll% . ' -","- I + :., -.;, ,+\"+z-,I- =.~ .\" ..... N plunt[ll \":' ' *lnyP~4ngently' \" ,,.. r ,- .Nsubstance[l]-/; +~ , , . . ~ - '- - . - -\"","\" \"-:-+\"\":\"':i, ',I - -+,,,. ,,t.m,6m~+ _, ........","'","11\" +","1+","+~","1 + \"","+","IN","vasm+ plant ' \"",", . -, :,+N mmen~ \" . .t: ' L \"' -\" +,","..... , h, I - I-lYPOI, Md' , .","'. ...-, ;: ~Po~ ;\" ,.\" + . . ,",".... \"-\"\" T . ,+' + \"N, woody plant \" \" .. ;. -\"I~ ptant material .... ,, I -' , , HvPOnI~R +'~.' \". '' .~'\" ;'\" ~ \"\" \"Ntree[l] +' ~','-' , + \"~\" \"+':' 2 + J~N, wood[4] G '., I ' ~r~Chtoroxylonswmtenm \""]},{"title":"+o.,\\","paragraphs":[". I , . , ,. ,","I iN satmwood[1].rlmra~n satmwoodtree .","-/i \"Z \\'-\" \" - - 'mel~nlm:,m= \" ?.~ n saur~ood[11","HYPOP~M Â¢oss ,. tlohllleil , ~","\" ~ Indlm~l wdh , lhlbBJ'kofl~H~\" +' ' ;N s~r~.,lood[2 ] X99~II31111~IdkJSU'DUS + -",".. +.","V -tom '+","'hmd Wllowtd~ wooa of e snllnwomt ~e ht~'~llny ', '","lustlm'~tlledforlklec~lma~,~podtlmdtol31s' n'sat~muood[2] r . L Figure 15 How could this type of false hnk selection between sattnwood [1] and satmwood [2] be prevented9 We would term it a formal check when for a given generic relation of a concept class the system is asked to retrieve all top concepts (or the direct subconcepts of a possible unifying root), and especially select those which are isolated, i.e. which of these do not have subconcepts themselves. With respect to this check the troponymy hierarchy of WordNet's verb concepts has 573 30 top verbs, however it is surprising to find that 236 of them are isolated. Now, we already have reached the limits of formal checking because formal checking cannot tell us whether all this was intended or is acceptable, and if not, what to do. A human reader of the glosses may infer that this or that top concept should be subsumed under a more general one, or may have already existing or not existing subconeepts."]},{"title":"6 Conclusion","paragraphs":["To our knowledge, the WordNet lexicographers were not supported by dynamic checking on update, or by an easy-to-use database query language for batch-checking, nor by a graphical browser/editor for visual feedback. WordNet's database set-up program, the \"grinder\", obviously controls consistency, however we are not in-formed about this. According to TerminologyFramework's error report on download, the \"grinder\" did not faultlessly perform range-checking because it allowed a few semantic (synset-to-synset) pointers where they should be lexical ones (synset-element to synset-element), and in very few cases it missed that a synset-element should not be an antonym of itself (irreflexivity of antonymy), and that a synset should not be a hyponym of itself (irreflexivity, as an entailment of aeyelycity of the generic relation). Beyond these few slips we found more interesting examples of errors or of redundancies which were not detected by chance, but by triggers (created by TerminologyFramework from the specification of the operational semantics of the relations) or mostly by queries to the database, guided by our methodological interest.","A practical lesson is that the design of dictionary relations should be such that they are tractable by formal checking, and this is severely impeded if different relations are merged of which one has the checkable property p and another lacks it; the merged relation has then lost the checkable property p. Examples from WordNet 1.5 are meronymy (which is treated in this paper only by a short note) and antonymy. Another point we had to struggle with was WordNet's treatment of disjunctive hypernyms, especially when they are lexical gaps. The topic of implicit logical junctors in value sets of WordNet's generic and meronymic relations was also treated by Bloksma"]},{"title":"et al.,","paragraphs":["but the therapy they propose we could not get to like.","This paper does not contain a complete list of checking rules for WordNet 1.5: Whenever we tried to evaluate a rule we got hints for another rule, and we have not yet taken into account all WordNet relations and attributes. Of course, there are important and less important relations, but note, if one takes only the important ones, or the most important relation, the generic relation, then"]},{"title":"formal","paragraphs":["checking in this type of semantic net is very limited. In any case, formal checking is only a kind of syntax checking, the next step after spelling checking, but 100 new pennies will make up an Euro. Some of our concrete diagnoses may be wrong, or fall short, or become obsolete by a new release, but the questions to be posed for this type of semantic net remain."]},{"title":"Acknowledgments","paragraphs":["I am indebted to Melina Alexa and John Bateman for encouraging this work, and to them both and Wiebke Mt~hr, Renato Reinau, Lothar Rostek, and Ingrid Schmidt for valuable help to improve this paper."]},{"title":"References","paragraphs":["[Bloksma"]},{"title":"et al.,","paragraphs":["1996] Laura Bloksma, Pedro Luis Dlez-Orzas, and Pick Vossen. User Requirements and Functional Specification of the EuroWordNet project. Deliverable D001, WP1, LE2-4003, Version 4, Draft, May 14, 1996. [Fellbaum, 1996] Christiane Fellbaum. WordNet: Ein semantisches Netz als Bedeutungstheorie. In"]},{"title":"Bedeutung, Konzepte, Bedeutungskonzepte. Theorle und Anwendung in Lmgutstik und Psychologte,","paragraphs":["pages 211-230. Joachim Grabowski, Gisela Harras and Theo Herrmann, editors. Westdeutscher Verlag, Opladen, 1996. [Fischer, 1993] Dietrich H. Fischer. Consistency Rules and Triggers for Multilingual Terminology. In"]},{"title":"TKE'93 Terminology and Knowledge Engineering,","paragraphs":["pages 333-342. Klaus-Dirk Schmitz, editor. INDEKS-Verlag, Frankfurt/M., 1993. [Fischer"]},{"title":"et aL,","paragraphs":["1996] Dietrich H. Fischer, Wiebke M6hr, and Lothar Rostek. A Modular, Object-oriented and Generic Approach for Building Terminology Maintenance Systems. In"]},{"title":"TKE'96. Terminology and Knowledge Engmeermg,","paragraphs":["pages 245-258. Christian Galinski and Klaus-Dirk Schmitz, editors. INDEKS-Verlag, Frankfurt/M., 1996. [Miller"]},{"title":"et al,","paragraphs":["1993] George A. Miller,. Richard Beck-with, Christiane Fellbaum, Derek Gross, Katherine Miller, and Randee Tengi. Five Papers on WordNet TM. CSL Report 43, Cognitive Science Laboratory, Princeton University, July 1990, Revised August 1993. [M6hr and Rostek, 1993] Wiebke M6hr and Lothar Rostek. TEDI: An Object-oriented Terminology Editor. In"]},{"title":"TKE'93 Terminology and Knowledge Engmeermg,","paragraphs":["pages 363-374. Klaus-Dirk Schmitz, editor. INDEKS-Verlag, Frankfurt/M., 1993. [Priss, 1996] Uta Priss. Relational Concept Analysis: Semantic Structures in Dictionaries and Lexical Data-bases. Thesis, TH Darmstadt, October 1996 http://php.indiana.edu/-upriss/papers/cdissi.ps [Woods and Schmolze, 1992] William A. Woods and James G. Schmolze. The KL-ONE family. In"]},{"title":"Semantw Networks m Artoqcial Intelhgence, Part 1","paragraphs":["Fritz Lehman, editor. Computer&Mathematics, 23(2-5): 133-177, 1992. 31"]}]}
