{"sections":[{"title":"Proceedings of the Australasian Language Technology Summer School (ALTSS) and Australasian Language Technology Workshop (ALTW) 2003 University of Melbourne, Australia - December 8-12, 2003 Editors: Catherine Bow and Baden Hughes  Australasian Language Technology Association ISBN: 0-9751687-1-1  ","paragraphs":["Copyright © 2003 Australasian Language Technology Association and the Individual Authors. Preface Table of Contents Acknowledgements Updates Proceedings of ALTSS/ALTW, Melbourne, December 2003"]},{"title":"Preface","paragraphs":["The Australasian Language Technology Association is proud to present its inaugural Summer School and Workshop. The Summer School consists of eight intensive courses and eight standalone lectures presented by experts in the field, and targetted at postgraduate students and researchers from academia and industry. The Workshop, chaired by Alistair Knott and Dominique Estival, provides a forum for the presentation and discussion of new research in language technology. On Wednesday evening, the Language Technology Forum will promote language technology to the wider community, as a field which is addressing fundamental questions in cognitive science and generating important new social applications. At a time when the field of language technology is experiencing unprecedented growth in Asia, Europe and North America, it is encouraging to see a healthy community taking shape in Australasia. The isolation of our region, its linguistic diversity, and its rapid uptake of new technologies, present important challenges and opportunities. With timely cooperation in research and training, such as the events on offer this week, the language technology community will continue to expand. Major goals will be to develop more natural human-machine interfaces, and more efficient ways to access the information contained in large collections of text and speech. Progress in these areas will lay the groundwork for new applications which address the challenges and opportunities of our region and, more generally, support the multilingual information society of the future. On behalf of the ALTA Executive Committee, I would like to thank all the speakers, sponsors, editors, and participants for making this week a success. Associate Professor Steven Bird Department of Computer Science and Software Engineering, University of Melbourne President, Australasian Language Technology Association Index Table of Contents Acknowledgements Proceedings of ALTSS/ALTW, Melbourne, December 2003"]},{"title":"Acknowledgements","paragraphs":["We would like to acknowledge the following people and organisations without which this event would not have been possible: the presenters of courses and lectures, all of whom volunteered their time; the ALTA Executive for their support and advice on the organisation of the event; Alistair Knott and Dominique Estival for their organisation of Australasian Language Technology Workshop; Bronwen Hewitt and Jen Westphal at the University of Melbourne Conference Management for logistical support; the Department of Computer Science and Software Engineering at the University of Melbourne for administrative support; Professor Rao Kotagiri for his personal endorsement and support of opportunities for postgraduate research training through events such as this; the University of Melbourne for hosting the event; Defence Science and Technology Organisation (DSTO) for their generous sponsorship of the Australasian Language Technology Workshop. Appen Pty Ltd for their generous sponsorship of the Australasian Language Technology Summer School. Index Preface Table of Contents"]},{"title":"Proceedings of the Australasian Language Technology Workshop","paragraphs":["Volume 1, Melbourne, December 2003 Online Edition ISSN 1834-7037"]},{"title":"Workshop Papers","paragraphs":["R Schwitter (Macquarie) Incremental chart parsing with predictive hints R Dale (Macquarie) 'One'-anaphora and the case for discourse-driven referring expression generation T Matsumoto, D Powers and G Jarrad (Flinders/CSIRO) Application of search algorithms to natural language processing J-E Roh and J-H Lee (Pohang Uni) An empirical study for generating zero pronoun in Korean based on Cost-based centering model M-Y Kim and J-H Lee (Pohang Uni) S-clause segmentation for efficient syntactic analysis using decision trees A Knott and P Vlugter (Otago) Syntactic disambiguation using presupposition resolution T Baldwin and L van den Beek (Stanford / Groningen) The Ins and Outs of Dutch noun countability classification B Hughes, S Bird and C Bow (Melbourne) Encoding and presenting interlinear text using XML technologies R Munro (Sydney Uni) A queueing-theory model of word frequency distributions J Yaghi, M Titchener, and S Yagi (Auckland/Sharjah) T-code compression for Arabic computational morphology T Cohn (University of Melbourne) Performance metrics for word sense disambiguation S Wan, M Dras, C Paris and R Dale (Macquarie / CSIRO) Straight to the point: Discovering themes for summary generation Y-J Chung and J-H Lee (Pohang Uni) Resolving Sense Ambiguity of Korean Nouns Based on Concept Co-occurrence Information D Molla (Macquarie) Towards semantic-based overlap measures for question-answering T Gaustad (Univ of Groningen) The importance of high-quality input for WSD: an application-oriented comparison of part-of-speech taggers I-S Kang and J-H Lee (Pohang Uni) Conceptual Schema Approach to Natural Language Database Access O Carr and D Estival (DSTO) Document classification in structured military messages M Herke-Couchman and C Whitelaw (Sydney) Identifying interpersonal distance using systemic features Index Preface Table of Contents Acknowledgements"]}]}