{"sections":[{"title":"","paragraphs":["Language, Information and Computation(PACLIC 11),1996, 403-413"]},{"title":"Internally Headed Relative Clause Constructions in Korean","paragraphs":["Yong-Beom Kim Kwangwoon University","ybkim@daisy.kwangwoon.ac.kr Abstract","This paper attempts to analyze some grammatical aspects of the so called internally-headed relative clause construction in Korean. This paper proposes that the meaning of the external head kes is underspecified in the sense that its semantic content is filled in by co-indexing it to the internal head under appropriate conditions. This paper also argues that interpretation of"]},{"title":"kes","paragraphs":["is determined by the verb following it. Dealing also with the pragmatics of the construction, this paper argues that the crucial characteristics of the construction in question resides in pragmatics rather than in semantics. 1. Introduction","This paper deals with some semantic and pragmatic aspects of the so called internally-headed relative clause (IHRC, hereafter) construction in Korean, as is exemplified in (1), although we also touch on problems related to its syntax:","(1)a. totwuk-i ton-ul kaci-ko unhayng-ul nao-nun kes-ul cheyphohayssta. thief-nom money-ul carry-and bank-acc leave-mod thing-acc arrested '(Someone) arrested the thief who was carrying money and leaving the bank' b. totwuk-i ton-ul\\tkaci-ko unhayng-ul nao-nun] kes-ul ppayasassta.","deprived '(Someone) took away money which the thief carried leaving the bank' This construction has some peculiar properties. First, it has a external syntactic head which is void of semantic contents and there is an so called internal head which determines the semantic value of the whole construction.","Second, as pointed out by Park (1994), there is no one-to-one correspondence between externally- and internally-headed constructions, as shown in (2). What makes (2a) grammatical and (2b) otherwise?","(2)a. sinsenhan sikumchi-lul salm-un kes fresh\\tspinach-Acc boiled-ref thing qthe outcome) of boiling fresh spinach' 403","b. *sinsenhan salm-un sikumchi fresh boiled spinach 'boiled fresh spinach'","Third, there are many cases where the IHRC is not obtained as argued in S.-E. Jhang(1991) and Park:","(3) a. *toywuk-i pangeyse nao-n \\tkes-i\\ttomangchessta. thief\\troom-from come-out-rel thing-Nom fled 'The thief that came out of the room fled' b. *Emma-ka\\tai-eykey wuywu-lul cwu-n\\tkes-ul\\tttalyessta \\t","Mom-Nom baby-dat milk-acc give-rel\\tthing-Nom hit (Someone) hit the baby the Mom gave milk to Jhang claims that the grammaticality of the IHRC construction is sensitive to the case particle.","Fourth, there are apparent pragmatic differences between the external and internal constructions in questions as exemplified in (4):","(4)a. Kyenchal-un totwukcilha-nun manhun haksayngtul-ul\\tkyothongbep police -Top steal-rel\\tmany\\tstudents-Acc\\ttraffic rule wuipan-ulo capassta. violation-for arrested 'The police attrested many students who (habitually) steals things in violation of traffic rules' b. !Kyenchal-un manhun haksayngtul-i totwukcilha-nun kes-ul kyothongbep \\t police -Top many students-Nom steal-rel\\tthing-Acc traffic rule wuipan-ulo capassta. violation-for arrested 'The police arrested many students in the act of stealing things in violation of traffic rules' (4a) is pragmatically sound but (4b) is not. What makes these differences? Can it be attributed to syntax, semantics or pragmatics?","This paper will address these issues that are raised in this section. In Section 2, recent papers and articles are reviewed from various points of grammatical aspects. The reviewed papers include Jhang (1991), Park (1994), Jung (1995), and Shin (1995) as well as some foreign authors. In Section 3, I will propose my own analysis of its syntax and semantics assuming HPSG 404 framework. In Section 4, we will provide a pragmatic account of this construction in question.","This paper proposes, assuming a HPSG framework, that the meaning of the external head kes"]},{"title":"is","paragraphs":["a very underspecified in the sense that it has not much CONTENT value in the Attribute Value Matrix. In this paper kes"]},{"title":"is","paragraphs":["analyzed as the external head of the construction that shares features with the internal elements of the complement just as an ordinary head complement structure does. In the same vein, this paper argues that interpretation of"]},{"title":"kes","paragraphs":["is largely dependent on the verb following it. As for semantic, it is argued that the entity is seen as either a set of properties or a set of (atomic) situations involving an entity in question. 2. Previous Analyses This paper rejects Jhang's view that the distribution of IHRC constructions is regulated by a kind of accessibility hierarchy of underlying Case. Jhang posits an accessibility hierarchy to deal with some ungrammatical constructions such as (3). She argues that the accessibility of the IHRC can be postulated depending on the grammatical function of the construction itself within the matrix clause and on the underlying case of the argument NP that is relativized. In (5) we summarize her observations:","(5)a. Subject IHRC: only subject of an unaccusative verb, the subject of","passives, and the direct object are accessible b. Object IHRC: subjects and objects are accessible to be the head in the","object IHRC. c. Adjunct IHRC: adjunct IHRCs are limited to the instrumental case and by-agent. According to this conclusion, (3a) is not acceptable because the IHRC is a subject in the matrix clause and the relativized NP is not unaccusative, nor the subject of passives, nor the direct object clause-internally, while (3b) is ungrammatical since it violates one of the stipulation in (5b). But there seem to be numerous counter-examples such as (6) evidencing that (5) may not be correct.","(6)a. Koyangi-ka pang-eyse nol-ten\\tkes-i (iss-ess-nun-tey) cwuk-essta. cat -Nom room-in\\tplay-rel thing-Nom (existed but)\\tdied 'The cat playing in the room died'","b. Nay-ka aki-eykey wuywu-lul cwuko iss-nun kes-ul teyliko kassta. I-Nom baby-Dat milk-Acc is-giving-rel\\tthing-Acc took-away '(Someone) took away the baby that I was giving milk to' 405","c. John-i Mary-ka tol-ul\\ttenci-n\\tkes-ey mac-ass-ta.","Nom\\tNom stone-Acc threw-rel thing-by was-hit. 'John was hit by the stone that Mary threw' The examples in (6) do not fit into Jhang's observation and there are many other data that give evidence against the postulation in (5).","Park (1994) deals with the syntax and semantics of the construction in question. This paper accepts the syntactic portion of his analysis but rejects his semantic treatment which relies on some kind of inference. Park proposed that the so called IHRC is not a relative clause construction but an head-complement construction. Park argues that 'kes' is a head in the complement-head structure. One of his reasons is that sentences containing 'kes' is rendered ungrammatical if the adnominal word string is omitted, whereas if it were a modification structure, it would be grammatical without the adnominal string. This paper argues, however, 'kes' is inherently a dependent word since in an apparent modification structure, 'kes' needs a preceding adnominal string it as shown in (7).","(7) Ppalkan kes-ul\\tkacye wala. red\\tthing-Acc fetch come 'Bring a red one' No one would deny that 'ppalkan' in (7) is a modifier and 'kes' is a modified element, but this sentence would be ungrammatical without 'ppalkan'. So Park's argument involving omissibility is not that strong.","Park also proposes that the primary meaning of the construction in question is the meaning of 'action' and that the 'entity reading' comes as a pragmatic consequence of 'action reading'. That is, if someone sees an action (or situation) he also sees some entity in the action. So the entity reading is a pragmatic derivative of the action reading. However, there are cases where this kind of inference is not obtained. For instance, pwutcczpta does not seem to have an action reading, so it cannot provide a basis of the inference for an entity reading. 3. Syntax and Semantics of IHRCs This paper argues that what is known as internally headed relative clause construction is not a modification structure but a complement structure on the ground that there is a semantic difference between the two structures. Consider • •","(8)a. ppalkan kes-ul\\tkacye wala. (=7) red\\tthing-Acc fetch come 'Bring a red one' (8) 406","b. nwun-i ppalkan kes-ul\\tpoala. eye-Nom red\\tthing-Acc look-at 1) 'Look at the one whose eyes are red' 2) '(You should) see that (its) eyes are red' (8a) is a modification structure and has one reading: on the other hand, (8b) has two readings and it seems to be due to two different structures. If it is to be used in a discourse, (8a) needs a contextually prominent referent which may be a set of individuals, since there should be a set intersecting with red in order to get set corresponding to the meaning of the modified phrase. Likewise, (8b), on the first reading, requires the same kind of semantic entity as is required in (8a). So the whole phrase headed by 'kes' must take on a nominal meaning which is anaphoric in its nature. However, the second reading of (8b) does not presuppose such kind of semantic referent. Instead, it has to do with some kind of situation or state of affairs. In this case the meaning of 'kes' does not seem to contain any anaphoric element in it. This situation is similar to English noun complement structure introduced by 'that' which is originally a deictic element.","Shin (1995) also deals with the IHRC construction, but his 'modification' approach does not provide a satisfactory mechanism to assign an appropriate interpretation to"]},{"title":"kes","paragraphs":["among multiple candidates. For example he could not answer the question: why does"]},{"title":"kes","paragraphs":["structure-share with"]},{"title":"totwuk","paragraphs":["but not with"]},{"title":"urzhayng","paragraphs":["or"]},{"title":"ton","paragraphs":["in (1). The way Shin(1994) approaches this construction is to coindex the SYNSEM value of the external nominal head, the MOD value of the relative clause and the SYNSEM value of the internal head. This paper argues that interpretation of"]},{"title":"kes","paragraphs":["is largely dependent on the verb following it; that is, noun"]},{"title":"kes","paragraphs":["should receive an interpretation which varies according to the matrix verb. In this paper I assume that verbs in this case have more specific meaning contents specified in the feature matrix and that those contents should structure-share with the appropriate item that appears in the AVM of the complement noun phrase. This paper also assumes that the adnominal clause can be interpreted as denoting a set of state of affairs as many other types of sentential complements are. In order to achieve this effect, instead of co-indexing the SYNSEM value, we propose to co-index the psoa value (originating from the verb) with some subdomain of the content value of the internal head. Of the content value of"]},{"title":"kes,","paragraphs":["the value of INDEX is not token-identical to the one in the restriction value since the meaning content of the noun is empty and is filled in later to be co-indexed with the value of INDEX. This approach enables us to get various readings of"]},{"title":"kes","paragraphs":["in (1) The crucial parts of the AVM is shown in (9): 407 (9) a. kes PHON /kes/ CAT [ HEAD noun SUBCAT < S:"]},{"title":">","paragraphs":["SYNSEM LOCAL CONTENT INDEX H RESTR 0 u ([11) b. John-i\\tton-ul\\thwumchi-n kes CAT\\t"]},{"title":"I","paragraphs":["HEAD noun] SUBCAT < > RESTR INDEX REL kes","SOA-ARG rE STEALER 133","STOLEN","RELN hwumchita  LOCAL CONTENT where 11 is token identical to or or"]},{"title":"c. ppayasta","paragraphs":["LOCAL CAT"]},{"title":"r","paragraphs":["HEAD"]},{"title":"verb L","paragraphs":["SUBCAT <NP[Nomtg NP[Acch PPLE>1"]},{"title":"crr","paragraphs":["RELATION"]},{"title":"ppayasta depriver deprived-of EI deprived\\t","paragraphs":["El This approach accounts for the syntactic part of the construction as well as some of its semantic aspects. That is, the tendency that the interpretation of"]},{"title":"kes","paragraphs":["is dependent on the following verb is captured within this approach. There is, however, a remaining problem to be taken care of. The question is why 408 there is acceptability difference as observable in (3) and (4), as well as in (2)? 4. Pragmatics of IHRCs","In this section, this paper claims that one of the most distinctive characteristics of the IHRC construction resides in the pragmatics of the construction, contra Jung's (1995) characterization that IHRC is an attributive use case of relative clause. In the following I will give further elaboration to Kuroda's Relevancy Condition which has been postulated to account for Japanese IHRC construction."]},{"title":"(10) Kuroda's Relevancy Condition","paragraphs":["For a pivot-independent RC to be acceptable, it is necessary that it be interpreted pragmatically in such a way as to be directly relevant to the pragmatic content of its matrix clause In particular, this paper will investigate into pragmatic constraints that are needed to give an explicit account of the pragmatic usage. Consider (11):","(11) a. Mary-nun emma-eykeylo ka-nun aki-tul-lul\\tcap-ass-ta.","Top Mom-to\\tgo-ref baby-Pl-Acc catch-Pas-Dcl 'Mary caught the babies going to their mothers'","b. Mary-nun emma-eykeylo aki-tul-i \\tka-nun kes-lul\\tcap-ass-ta.","Top Mom-to\\tbaby-PI-Nom go-rel thing-Acc catch-Pas-Dcl 'Mary caught the babies while they are going to their mothers' In the ordinary relative clause like (11a), the primary function of the modifier is to reduce the size of the set denoted by the head noun. The reduced set is usually obtained by intersecting the two sets corresponding to the head noun and the modifier. The purpose of using the ordinary modifier is to distinguish intended referents from a larger set. So (11a) could be an answer to (12):","(12) Mary-ka etten aki-tul-ul\\tcap-ass-nya?","Nom which baby-Pl-Acc catch-Pst-Ques 'Which babies did Mary catch?' (11b), on the other hand, cannot be an answer to (12). What kind of 409 interrogative sentence would need (lib) as an answer? (12) certainly is not. Probably, (13) could be one of the possible utterances for (11b).","(13) Mary-nun ipen hayngsa-eyse mwusun yekhal-ul mat-ass-ci?","top this event-in\\twhat role-Acc assume-PST-Ques What role did Mary have in this event? (11a) can also be a response to (13), but (lib) cannot be a reply to (12). Why does there arise such difference? In uttering (lib) the speaker seems to implicate that there is some meaningful relation between [babies's going to their mom] and (Mary's catching the babies]. That is, given (13) and (11b) we can obtain the following inference:","(14) Aki-tul-i emma-eykeylo ka-ass-ki ttaymwuney Mary-ka cap-ass-ta.","pl-Nom Mom-to went-because\\t-Nom catch-Pas-Dcl 'Mary caught the babies because they were going to their mothers' More fundamental reason could be that the babies going to their mother might create disorder spoiling in the formal event. However, in (11a), this relation is not easily seen, but is construable indirectly through some background knowledge. Let's consider some more data:","(15)a. John-un tosekwan-eyse kogpwuha-nun tongsayng-ul maycwu","Top library-in\\tstydy-rel\\tbrother-Acc every-week conglo-eyse mannan-ta. Chong-ro-on meet 'Every week on Chongro John meet his younger brother who studies in the library'","b. John-un tongsayng-i tosekwan-eyse kongpw-uha-nun kes-ul Top brother-Nom library-in\\tstudy-ref thing-Acc maecwu (*conglo-eyse) mannan-ta. every-week Chongro-on 'Every week (*on Chongro) John meet his younger brother who studies in the library'","The contrast between the above two sentences tells that younger brother's studying in the library has some close temporal and spatial relations 410 with John's meeting his brother. Why are these two events related to each other so closely compared with the ones in (15a)? If the two events are in a meaningful relation, they should be temporally or spatially in a specific configuration. We can make a same kind of observation with (16):","(16)a. Kyengchal-un totwukcilha-nun manhun\\thaksayng-ul kyotongpep Police-Top\\tsteal-rel\\tmany\\tstudents-Acc traffic law wipan-ulo\\tcap- as s-ta. violation-for arrest-Pst","'The police arrested many students who (habitually) steals things for violating traffic laws'","b.! Kyengchal-un manhun haksayng-i totwukcilha-nun kes-ul kyotongpep","Police-Top many students-Nom steal-rel \\tthing-Acc traffic law wipan-ulo\\tcap-ass-ta. violation-for arrest-Pst","'The police arrested many students who (habitually) steals things for violating traffic laws' (16a) is acceptable if the students are habitual thiefs and accidently violated the traffic law and were caught by the police. So there is no significant relation between the act of stealing and that of being caught. However, (16b) has externally headed relative clause construction, and I argue that there should be significant relation between the two acts. So (16b) forces us to establish a meaningful relation between the students' stealing things and the police's arresting the students for violating traffic law, which is nonsensical in the real world.","If we persue this line of investigation, we can also state that there should be some temporal or spatial overlapping between two individual events involving IHRC. For instance, if John meets his brother in the act of the latter's studying in the library, the temporal and spatial locations of the two events should overlap according to our background knowledge. So we not only get the contrast in (15) but in (17):","(17)a. John-un tosekwan-eyse mayil pam nuckey kogpwuha-nun tongsayng-ul","Top library-in every night late study-rel b\\tbrother-Acc onul achim-ey mannass-ta. today morning-in met","'This morning John met his brother who studies in the library late every night' 411","b. !John-un tongsayng-i tosekwan-eyse mayil pam nuckey kongpwuha-nun Top brother-Nom library-in\\tevery night late\\tstudy-rel kes-ul\\tonul achim-ey mannass-ta. thing-Acc today morning-in met 'This morning John met his younger brother who studies in the library late every night' However, if the two events can be ordered temporally apart from each other and can still be meaningful, we can use separate adverbs as shown in (18):","(18) Mary-nun sakwa-ka ecey pam-ey tellecin kes-ul \\tonul achim-ey","Top apple-Nom yesterday night-at fell-rel thing-Acc today morning-in cwuessta. picked-up 'This morning Mary picked up the apples that fell last night (from the tree)' Now, how are the examples in (2) and (3) are explained within this approach? As for the data in(2) this approach has no obligation to provide any specific account for them, because (2a) is guaranteed on its own and (2b) is ruled out independently. As foe the sentences in (3), I will say that (3b) is rather acceptable than not; (3a) can also be improved if it is given enough contextual information. For instance, imagine a situation where may thieves intruded into a house and many are caught on the spot and only one that came out of a room fled. 5. Conclusion","Now, what do I mean by significance in the relation between two events or actions? My conjecture is that significance can be identified as a kind of background knowledge, or recurring regularities that is observed as relevant among events occurring in the real world. This information could be incorporated into the AVM in an appropriate way, for which I have no enough space to discuss it in full detail. Other problems related to the IHRC are too numerous to cover in this short paper. We need to give more rigorous treatment to the semantics and pragmatics of the construction although this paper's proposal that the most crucial characteristics of the IHRC lies in establishing pragmatic relevancy rather than intersecting sets of individuals is to be maintained. 412 References Chang, Seog-Jin. 1993."]},{"title":"Cengbo Kiban Hankwuke Mwunpep, (Normation-based Korean Grammar)","paragraphs":["Seoul: Enewa Cengbo. Cole, Peter. 1987. Internally Headed Relative Clauses."]},{"title":"Natural Language and Linguistic Theory","paragraphs":["5, 277 -302 Jhang, Sea-eun. 1991. Internally Headed Relative Clause in Korean."]},{"title":"Harvard Studies in Korean Linguistics","paragraphs":["IV, 269-280. Seoul: Hanshin Publishing Company.","Jung, Yunsun. 1995. Internally Headed Relative Clauses in Korean."]},{"title":"Harvard Studies in Korean Linguistics","paragraphs":["VI, 235-248. Seoul: Hanshin Publishing Company.","Hong, Ki-Sun and Yong-Beom Kim 1996, A Survey of Non-Chomskyan Approaches to Korean Syntax. Paper presented at the 7th ICKL meeting, Griffith University, Birsbane, Australia.","Kuroda, S. Y. 1976. Headed Relative Clauses in Modern Japanese and the Relevancy Condition."]},{"title":"Proceedings of the Second Annual Society (BLS)","paragraphs":["II, 269-279. Park, Byun-Soo. 1994. Relative Clauses Reconsidered."]},{"title":"Proceedings of the 1994 Kyoto Conference: A Festshrift for Professor Akira Ikeya,","paragraphs":["eds. A. Ishikawa and Y. Nitta.","Pollard, Carl and Ivan A. Sag. 1993."]},{"title":"Head-Driven Phrase Structure Grammar.","paragraphs":["Chicago: University of Chicago Press/ Stanford: CLSI, Stanford University.","Shin, Hyo-Pil. 1995."]},{"title":"The Syntax and Semantics of Korean Relative Constructions.","paragraphs":["PhD Dissertation, Seoul National University. 413"]}]}