{"sections":[{"title":"Language, Information and Computation(PACLIC 11)1996, 109-118 Ambiguous (((Par(t)(it))((ion))(s))(in)) Thai Text Doug Cooper Center for Research in Computational Linguistics, Bangkok doug@nwg.nectec.or.th http://seasrc.th.net Abstract","paragraphs":["Despite the importance of segmentation to a variety of software applications, almost nothing is known about the characteristics or distribution of ambiguous partitions (eg. to Pend vs. top_end) in Thai text. By using special-purpose code to investigate a large (-400K word) text corpus, we were able to extract 36,267 such sequences, involving 9,253 distinct examples. Of these, a little more than two-fifths involved genuinely ambiguous partitions. We classify partitioning problems into distinct categories, report on many of their statistical and lexical characteristics, and describe heuristics for choosing the correct partition that do not depend on the availability of a large segmented corpus."]},{"title":"1. Introduction Thai writing does not use spaces to segment text into words. While open text contains many obvious","paragraphs":["separation"]},{"title":"points (bigdog","paragraphs":["vs."]},{"title":"big dog), and a smaller group of questionable","paragraphs":["bind"]},{"title":"points that are usually permissible either way (toolbox vs. toolbox), there is inevitably a residue of ambiguous","paragraphs":["partition"]},{"title":"points (to_pend vs. top_end) for which computer segmentation is essentially random. This causes difficulty for many software applications: line-breaking, spell-checking, machine-assisted translation, text-to-speech, optical character recognition, full-text indexing, corpus-based dictionaries, etc. Yet despite the importance of segmentation, little is known about the characteristics of ambiguous partitions in Thai, or its orthographic cousins Khmer, Lao, and Burmese. Work has been slow and progress poor due to a lack of formal, concrete analysis. We know the problem's gross characteristics, and the general direction of solutions, but there are few theories to guide the way or allow comparison of research results. This paper describes experiments carried out on a 2 megabyte (roughly 400,000 word) Thai corpus. We collected nearly ten thousand distinct alternative segmentations of at least two words in length. Of these, a little more than two-fifths involved genuinely ambiguous partitions. We classify partitioning problems into distinct categories, report on statistical and lexical characteristics of ambiguous partitions, and describe heuristics for disambiguating that do not depend on the availability of a large segmented corpus. Our results make several contributions to understanding Thai text segmentation. First, we categorize breakpoints in a way that distinguishes between choices that are and are not semantically significant, and show how to collect them automatically and consistently. Second, we find that ambiguous instances are fairly rare (roughly 5% of word break opportunities), and have a pronounced Zipfian distribution — a relatively small number of circumstances produce a great deal of ambiguity; and show ways of collecting low-frequency items that exhibit the same behavior. Third, we find that contrary to the canonical examples, resolving ambiguity does not usually depend on knowing or understanding the context it occurs in. Finally, we suggest new methods — stop nodes, go collocates, and analysis of hidden 'swing strings' — to aid in automated disambiguation. 2. Prior Work","paragraphs":["There is extensive literature on text segmentation for Asian languages; those for Chinese are typical (Wu 1993, Chiang 1992, Chang 1993). Approaches"]},{"title":"to","paragraphs":["segmenting Thai text are surveyed in (Vonvgipanond 1993, Sornlertlamvanich 1993, Wuwongse 1993). In 109 general, dictionary-based maximal matching is followed; the segmentation that contains the fewest words is selected"]},{"title":"as","paragraphs":["correct. See (Haas 1942, 1946, 1964, Noss 1964, Luksaneeyanawin 1984, Vongvipanond 1992) for discussion of underlying linguistic issues.","While Chinese and other languages continue to make incremental improvements (eg. Maosong 1995), the literature on more advanced approaches in segmenting Thai is nearly non-existent; a notable exception describes a Viterbi-based approach to using statistical information derived from grammatical tags (Pornprasertsakun 1994), but even with restricted input grammar, results were poor. More recently (Kawtrakul 1995, 1996) combines various statistical and grammar-based methods; these tend to depend on a training corpus, and report testing only on a relatively small (-200 sentences) dataset.","Aside from frequent citation of canonical examples of ambiguous partitions, we could find no English or Thai-language literature that specifically addressed the partitioning problem, or attempted to classify different kinds of ambiguity in any way. Moreover, the large text corpora needed for more sophisticated approaches to the problem are not available; even the text corpus we used is relatively small, and contains a considerable amount of highly specialized text (eg. government documents, textbooks)."]},{"title":"3. Methodology","paragraphs":["Our 2 megabyte test sample consisted of 42 selections of hand-segmented, grammatically tagged Thai text (LINKS). The original text was split into some 415,844 words over 53,242 lines, leaving 362,602 potential error points. We removed spaces and tags, then replaced English text, numbers, and punctuation (unambiguous breakpoints) with newlines. A dictionary-based method resegmented the text, generating all possible parse trees in the process. We intentionally used a very large word list — over 70,000 entries, including all words from the text sample — to maximize opportunities for ambiguous partitions, and to ensure that every sentence would be segmentable.","Finally, special-purpose software selected outcomes that involved alternative partitions at least two words long. Given the string topend, we would select top end / to_pend as an ambiguous partition. However, given toolbox, we would not choose toolbox / toolbox as alternatives. With a few notable exceptions"]},{"title":"co","paragraphs":["s nam dii ="]},{"title":"good water","paragraphs":["vs. lig ndrndii ="]},{"title":"bile),","paragraphs":["these are not open to ambiguous interpretation unless the context is at least three words long (which gives the central word the opportunity of binding either left, right, or not at all). Moreover, the exocentric exceptions should be found in any ordinary dictionary, while very, very large numbers of unambiguous compounds are an inescapable artifact of any large corpus-based word list.","This procedure described above produced some 36,267 candidate sequences, of which 9,253 were distinct (available on-line, along with most of the derived data dis-Class Type Ambiguous Example Lexical Partition yes motrii = Inn nil I nn nn ii Contextual Partition yes f1111BillaU si *11)11141 'au 1 Arun illau Contextual Bind maybe 11141f1 .• 1(141A I 'ill lfl (good talker or the artisan said) Two-way Bind no tztTs4\\t=\\tfist tTa4 I"]},{"title":"fi","paragraphs":["f \\t9:484 One-way Bind no niildau - Mild + au Table 1 Kinds of segmentation decisions. Usually, the go/no go choice Can a newline be in-serted here? is applied in strictly local terms to guide classification; it changes the local meaning of partitions, but not that of binds. Contextual binds, in contrast, are only potentially ambiguous when considered in a larger context; eg. for translation. Because they have both meanings when written either way, it is not clear that these are segmentation decisions at all. 110"]},{"title":"cussed here, at the Southeast Asian Language Data Archives, http://seasrc.th. net/sealda). We investigated three groups in detail: the most frequent 5%, 5% selected at random from the remainder, and 5% taken at random from single-appearance entries. 4. Categorizing Segmentation Decisions Our first concern was to distinguish between segmentation points that affected subsequent applications of the text, and those that did not. We derived two basic classes from the data: partitions that did affect sentence semantics, and binds, which did not. Alternative partitions involve two distinct sequences of words or compounds. They fall into two roughly equal classes: lexical partitions involving isolated letters, and contextual partitions involving full words or affixes. Excepting intentional pun-like constructions, proper partitions (in context) can always be chosen correctly and consistently. Binds, in contrast, tend to involve alternative ways of considering serial constructions. While the meaning of binds is not ambiguous, it is difficult to label segmentation decisions as correct or not because the alternatives do not affect semantics. Our basic test for class membership was whether inserting a newline affected local semantics. We intentionally ignored a transitional class of contextually ambiguous binds, in which an affix binds to its neighbor, but still permits a newline to be inserted. We ignore these in the present analysis because they are essentially 'phantom' segmentations whose existence depends on the needs of subsequent applications. In summary: — Lexically ambiguous partitions break on sub-word boundaries, and yield alternative sequences of entirely different words. =\\tnil\\tnn more than = more+than","paragraphs":["I"]},{"title":"*come hug (says) that — Contextually ambiguous partitions break on word or affix boundaries. They typi cally involve affixes that can bind either left or right, or exocentric compounds. =\\tati I trim ildhl need (n) = *memory+to be nominalizer+ must — Two-way binds occur when a central affix binds to either its left or right neighbor without significantly affecting the meaning of the phrase, eg: fis ezeia4 = 'ht.; 4e4","paragraphs":["I"]},{"title":"ti az404 which will have to = which will+must which+will have to — One-way binds, which were not produced by our selection method, but were inferred from the data, are typically endocentric comeound constructions whose meaning is easily derived from their constituents; eg.","paragraphs":["f11"]},{"title":"e","paragraphs":["/M11"]},{"title":"kham sdon, or overlapping words; terms that have similar meanings but different origins or euphonic sounds:","paragraphs":["Most frequent 5% Random 5% (excluding most frequent) 5% (from singles) Actual, top 5% Estimated in text","Sample size 460 460 460 Lexical 95 = 21% 115 = 25% 113 = 24.5% 4,335 2.5% Contextual\\t_ 95 = 21% 97 = 21% 97 = 21% 4,667 2.5% Table 2. Distribution of ambiguous partitions. The top 5% of the sample accounts for just over half of the actual appearances in the corpus; we estimate frequency in the corpus by doubling the actual counts, then dividing by the number of decision points (-363K)."]},{"title":"mfridiu =\\t+ au wealth = wealth (Pali/Sanskrit)+wealth (Thai) — Contextually ambiguous binds were also inferred. For example, verbs like 'hi (go) and )J1 (come) have common meanings, but are also used as auxiliaries that indicate the manner, duration, intensity, tense, etc. of other verbs. However, in writing and in most applications, a newline may be inserted between each word without changing sentence semantics, or losing the information required to bind them correctly if a later application (like translation) requires it: 111 Idea = A111111113 I T111 UJIW) eat+go+already = ate it all up I ate, and then left Assigning terms to specific categories was not overly difficult. Only three of the lexically ambiguous terms were not easily classed; ie. it was not obvious whether a term was a new word or an exocentric compound. In 36 cases that appeared to be contextually ambiguous, it was not entirely clear whether a phrase involved true contextual ambiguity or merely two-way binding. Nevertheless, in almost all cases it is possible to avoid inserting a space or line-break incorrectly. These are somewhat subtle points, eg: 1114f111 fitlill means the way of doing + education, while 1114 1111M1111 means the way + of educating; the latter alternative is more generally correct in writing. 5. Discussion Distribution The 36,267 candidate sequences demonstrated a strongly Zipfian distribution: 85 distinct forms (<1%) accounted for 25% of the candidates, 50% of the appearances were accounted for by just under 5% of the distinct forms, and well over half of the distinct forms appeared just once each. Actual counts of the partition types are summarized in table 2; figure 3 gives an idea of the implications of the numbers. Situations in which incorrect partitioning changed the meaning of the sentence were far less common than generally thought. Estimates based on the percentage of forms in the three groups we investigated in detail, and on projection of the actual counts of the most frequent forms, both indicate that lexically and contextually ambiguous partitions probably account for about 5% (± 2.5%) of the total space insertions. The small number of truly ambiguous partitions indicates that performance of segmentation algorithms must be measured in isolation, focusing specifically on their ability to resolve semantically significant partitions. Minor differences in counting even insig-","paragraphs":["1000 - 100 4 — — — Number of appearances \\tCumulative % of total 10-","1•","\\t","1","\\t","•","\\t","1","\\t I \\t a","\\t","I","\\t","a","\\t","I","\\t","a","\\t","i'0","1 400 800 1200 1600 2000 2400 2800 3200 3600 4000 4400 4800 5200 5600 6000 6400 6800 7200 7600 8000 8400 8800 9200"]},{"title":"Figure 3 A","paragraphs":["relatively small number of distinct candidates account for a large number of potentially ambiguous partitions. The most frequent candidate appears 365 times; the top 452 account for half of the total in the text, and about 5,500 appear just once. This strongly Zipfian distribution implies that while it is impossible to anticipate all ambiguous partitions, dealing with the most common is a worthwhile investment of time. 0.8 0.6 0.4 0.2 112 nificant one-way binds can overwhelm count statistics; a major improvement in dealing with true ambiguity may be masked by trivial differences in reporting methods. See (Sproat 1994, Wu 1994, Cooper 1996) for more on the reporting problem.","Their distribution also implies that, contrary to the usual analytical and statistical approaches, brute-force methods can give good results. In this case, Zipf s law makes statistics work for us: dealing with a fraction of forms solves a majority of potential errors. Moreover, given the lack of context dependency (see below) required for disambiguation, we are able to gather precisely the data we need — ambiguous partitions — from unsegmented text, and need not depend on segmented corpora.","One cautionary note involves the very large dictionary we used to spot potential ambiguity. While detection of lexically ambiguous partitions does not appear to be significantly affected by the addition of lexical phrases and compounds to the segmentation word list, arguments can be made that contextually ambiguous partitions are both over-and under-reported; we continue to investigate. Context Dependency in Disambiguation Our next concern was finding the degree to which correct resolution of ambiguous partitions depends on context. If recognizing the right partition is not context sensitive, then"]},{"title":"a)","paragraphs":["partitions can be decided wholesale, and"]},{"title":"b)","paragraphs":["correct outcomes can be saved for future reuse. In general, this was the case. As noted above, we examined some 15% of the sample term-by-term. Of 323 lexically ambiguous partitions, all could be disambiguated correctly without reference to the surrounding text; in 9 cases neither alternative was right.","Of the contextually ambiguous partitions, less than 20% (51 items) could not be disambiguated in isolation. Frequently, one phrase appeared in various combinations; eg. Type Forms Correct Partition Incorrect Partition Meaning L 365 nil uivirs nilui mrs service vs. blackbird fight divide C 362 nvalnewsti nriAn au lm training vs. baked umbrella C 339 111141i1Ju mull !nu conducting vs. diving hill L 261 min nii In nn -ii more than vs. come b 'bird says C 214 mufnuffig 11141fil WI , economic direction vs. nonsense L 218 mi lauumin4 nilauu ull 04 changing vs. changing flat down C 188 nil mniu 1111041]U investing vs. go down capital C 186 ors ricenniiiivnii niiiimui limy flu development vs. develop servant ... C 176 iiiii miiii iiiimli ii officer vs. boss face at C 170 nliu iiiiDu mutt' IN need vs. memory is C 164 fi'l filinum ciloil rilu flu's conductor vs. black body hill task L 159 nu, U11,1 ni la 114 constructing vs. b 'bird taste neglect C? 136 mi &nil nilin) nil management vs. set up task L 132 nil nitvii ruin' it vii doing vs. case scrape to do C 125 nil ilia rdp nrillTu 1114 improving vs. changing to season L 122 MI nu Mlfl It replacing (frag) vs. case sweep L 107 milieu iniu au certainly vs. solid not L 96 fill nu M in au teaching vs. b 'bird taste not L 89 yitiu *"]},{"title":"I","paragraphs":["yin Un"]},{"title":"a","paragraphs":["attitude vs. ten seven blame L 86 MI thiaiu niid.iialt, supporting vs. sending diverge edge Table 4 L(exical) and C(contextual) ambiguity. Assignment of categories posed little difficulty, and the correct partition could almost always be selected without reference to the underlying text. Despite their frequency, not all of these examples are common in ordinary text; the first three terms (service, training, conducting) obviously reflect specialized subject matter. 113 ii+iN"]},{"title":"with various affixes. It is possible the most likely partition actually occurs in all cases; but we did not cross-check the original text in this study. It is also worth noting that contextually ambiguous partitions are less critical for some common segmenting applications (eg. text-to-speech, indexing) in which a word-by-word split is satisfactory. Maximal Matching This strategy is based on the premise that the segmentation that","paragraphs":["produces the fewest words is probably correct. In our three test sets, maximal matching was"]},{"title":"always correct when it could be applied; ie. when the alternatives had different numbers of words (see table 5). This was generally the case with lexically ambiguous partitions (about 90% were asymmetrical), but far less so with contextually ambiguous partitions (just over half were asymmetrical). Intuitively, this makes sense, because contextually ambiguous partitions frequently involve the left-right binding of a single word; hence, both sides have the same number of words. Stop Nodes and Go Collocates We hypothesized that we would find a class of words that appeared frequently within trial segmentations, but would never (or almost never) be correct. This is based on an analysis of letters and words whose orthographic characteristics make them exceptionally prone to causing ambiguous partitions. For example,","paragraphs":["n,"]},{"title":"the third","paragraphs":["most"]},{"title":"frequent consonant in typical Thai text, is by far the most common first letter in dictionary entries (partly because it is one of the few letters that start consonant clusters). Because it is one of eight 'regular' final consonants, it is a common final letter. A typical dictionary word list (18,151 entries) contained 2,064 words beginning with","paragraphs":["fl"]},{"title":"(11.4%) and 1,194 words ending with fl (6.6%). Thus, words that end or begin with","paragraphs":["fl"]},{"title":"have a high affinity for joining their neighbors to produce lexically ambiguous partitions (eg. in symmetrical examples of types 1 and 2 below, we found 70 different forms accounting for 453 actual entries). For example, the first case below involves only common words; the second and third rely on words","paragraphs":["Om"]},{"title":"and","paragraphs":["nn)"]},{"title":"that are progressively less so — in fact, they never occur in the text at all. =\\t (many)+(says) that","paragraphs":["I"]},{"title":"*come+(more) than","paragraphs":["uenii = uen 71"]},{"title":".","paragraphs":["ue flat\\t"]},{"title":"says that","paragraphs":["I"]},{"title":"*madcap+(more) than e","paragraphs":["3J1fifli1 = 3J1t1 fill\\tnn 71"]},{"title":"many+more than","paragraphs":["I"]},{"title":"*come+cuddle+(says) that By comparing the 7,420 distinct words that appeared among all trial partitions to the actual hand-segmented word list, we were able to identify a set of stop nodes that in-variably flagged the wrong partition for our data set. Figure 6 shows the most frequent of the 2,383 terms that did appear within trial partitions, but which were never found in the original text. Overall, these terms fell into three classes:","paragraphs":["Maximal matching . . . Sample Fails Succeeds Inapplicable Lexically ambiguous partitions 323 0 292 31 (10%) Contextually ambiguous partitions 289 0 162 127 (44%) Includes both binds and two-way partitions"]},{"title":"Symmetrical (inn am / in nu)","paragraphs":["Asymmetrical (min trim Forms (9,253) 5,138 (55%) Total (36,267) 23,239 (64%) 13,028 (36%)4,115 (45%) Table 5 Maximal matching can only be applied if the trial partitions are asymmetrical. In the sample we inspected term-by-term, it always worked when applicable. However, nearly half of the contextually ambiguous partitions could not be dealt with this way, and a clear majority of potential partitions in the actual text were symmetrical as well. We suspect that to some extent, this may be an artifact of the very large dictionary we used to generate candidates. 114"]},{"title":"— Artifacts and combining forms. These terms are in the dictionary, but essentially never appear as standalone words, eg.","paragraphs":["Ill"]},{"title":"is defined as 'King' but is invariably used to mean 'royal' in combining forms. — Obsolete and learned words. Often seldom-used historical terms, eg.","paragraphs":["64,"]},{"title":"'prince.' — Ordinary words. Everyday words that simply happened to be absent from our sample, eg. 41, 'tusk.' The first and second groups suggest a new approach to building dictionaries for segmentation: mark such words as 'present,' but do not allow them to be produced as the result of ambiguous partitions. In other words, allow the terms to be recognized as actual words, which of course they are, but reject them whenever they appear as one alternative of an ambiguous partition: they are stop nodes, not stop words. The third group holds great interest for further work, because we anticipate that any calculated frequency statistics will tend to exclude them, even if they are correct. Table 7 shows a sample of such words that do actually appear in the text sample. In forthcoming work, we test our ability to spot correct appearances of these low frequency terms by a forced training technique that relies on collocates found in dictionary entries. This approach relies on the fact that in Thai, many words have collocates that are predictable, even though finding them in open text may require a prohibitively large segmented corpus. For nouns, these include classifiers, for verbs, these include prepositions, completative verbs (eg. you look and see), and other secondary verbs, and for adjectives, these include restricted modifiers and intensifiers. We treat these terms as 'go collocates' — neighbors that indicate a low-probability word is likely to be correct.","paragraphs":["Word Meaning Forms Total Word Meaning Total _","Forms ir,\\t. scrape _","\\t","201 943 in royal (pref) 878 223 11If royal (pref) 223 878 Ilir, to affix 565 202 AU replace (pref) 152 809 se scrape 943 201 I start 138 745 d dented 307 181 iCiu hill 49 742 84 prince 586 _","\\t","163 NJ bake 89 686 nu replace (pref) 809 152 84","prince 163 586"]},{"title":"3","paragraphs":["start 745 138 i ll","servant 87 579 U8 rhino horn 224 130 'du to affix 202 565 41 tusk 467 124 nrsiii doing 60 522 Ull fingernail 458 116 mite setting up 84 516 au bake 686 89 filitiiiifiu conducting 67 515 iiii servant 579 87 41 tusk 124 467 nil& setting up 516 84 In fingernail 116 458 4fl greedy 438 82 fl1Ifi1 diving 25 440 tilt compliment 135 68 flfl cuddle 51 439 ornimilu conducting","515 67 40 greedy 82 438 ni arm (royal) 222 60 Afii black body 27 328"]},{"title":"nrsvii","paragraphs":["doing 522 60","miitil • win •","56 322 ti to speak 152 58","d dented 181 307"]},{"title":"na","paragraphs":["a clump 138 56 Table 6 Frequent trial partitions that do not appear in the text, by total (left) and by number of forms (right). Many, NA not all, of these terms always mark an incorrect partition. They can be thought of as stop nodes that can be listed in the dictionary as 'present,' but should not be chosen when they appear as one alternative of an ambiguous partition. 115 Hidden Terms One of the more powerful tools in our arsenal is the ability to focus at-tention on the ambiguous partitions that appear most frequently. We considered the possibility that some common contextually ambiguous partitions might be 'hidden' by being embedded within longer strings. As a result, they might not be noticed as being exceptionally frequent, or general rules for resolving them might not be applied.","For example, 41, which means"]},{"title":"know","paragraphs":["or"]},{"title":"remember as a","paragraphs":["standalone term, appears in every possible alternative: it may be prefixed or suffixed, show up in endocentric or exocentric compounds, or simply appear coincidentally in the middle of another word.","We found candidates in this class by writing code that selected only symmetric patterns of the following form, restricting the interior string to 2-15 characters: \\t stringl+string2 string3\\tstringl string2+string3","Our data set contained a total of 4,806 patterns of this form, representing 21,833 actual entries. The central 'swing string' consisted of 807 distinct terms; of these, 707 were ordinary words, 94 were compounds that did not appear in a basic dictionary word list, 4 were transcribed foreign words, and 2 were fragments.","We are interested in symmetric partitions because they contain the difficult cases that cannot be resolved by maximal matching. As shown in table 8, those terms that appear in the largest number of forms are dominated by grammatical affixes; primarily nominalizers nm) and auxiliary verbs"]},{"title":"elm,","paragraphs":["in). Ordering by actual counts (of the full phrases, not just the swing strings) introduces terms that are more text-dependent, or which are essentially artifacts of the large dictionary we used for partitioning.","Our analysis of this data is still underway. Nevertheless, we can see in table 9 that a particular phenomenon is responsible for many of the contextually ambiguous partitions","Term Meaning Forms Total Real Term Meaning Forms Total Real","fll","blackbird 200 1541 1 in","paint 32 65 1","131","to smoke 135 1082 1 qn dung, origin 23 63 2","th4 roast 241 580 1 mai yard 13 55 1","min","case 52 390 2 di clf. boat, plane 11 46 1","18'","taste 32 359 1 till","interest 12 31 1","Oil","chest 129 303 1 fii advance t'word 13 31 1","48","to bend 128 300 1 1 hole 16 29 1","ml flat 24 298 2 um breast 11 21 1","YID","strength 21 235 1 IND to open 13 15 1","111fll","meter 57 183 2 11","app'x two yards 11 14 1","till *","below 56 160 3"]},{"title":"a","paragraphs":["emphasis part. 19 32 2 11 tea 34 152 1 ifil4","structure 76 227 8 U1 content 49 139 1 no raise up 18 35 2 inn","","foreign 25 123 1 831","hold in mouth 18 42 2 im edge 20 120 2 piau to 9 16 1 81","uncle 51 116 3 fill steal 9 38 1 111","to deviate 47 110 1 ii blame 35 171 4 luini about 10 miles 21 98 1 84 protect 17 36 2 ill black 44 96 3 mu","pattern 17 65 2 411 grope in water 25 94 1 11 grease 16 100 2 Table 7 Relatively rare words that are common as trial partitions. We think that it is very likely that they have predictable collocates (classifiers, auxiliary verbs) that can be found in dictionary entries, and hence do not require large text corpora. 116"]},{"title":"— the intersection of two or more of the high-frequency terms in a single phrase, for example, nliu,","paragraphs":["41,"]},{"title":"and","paragraphs":["1§1.1."]},{"title":"In effect, all the potential alignments of bindings seem to occur — the 22 examples consist of only 25 words. While all of these terms have very high individual and collocational frequencies, we would argue that some of the lexical phrases are more tightly bound than 'others. In future work, we investigate whether we can define transitive orderings that can be applied to novel circumstances. For example, we list these in order of increasing likelihood:","paragraphs":["41 -4 i1ViEf1\\t--+ )1R) -3"]},{"title":"innu\\tditOu\\t","paragraphs":["1hti1"]},{"title":"6. Conclusions and Further Work In recent years work on segmentation for Thai has focused on analytical methods involving statistical and grammatical analysis of large, segmented text corpora. But while this may hold promise for the long run, at present we have neither the text corpus, nor the grammatical understanding of Thai, nor sufficient understanding of the segmentation problem itself to make objectively measureable progress. The analysis presented here argues that segmentation has distinct and separable as-pects, and that both performance and our ability to measure performance can be improved by focusing on specific aspects of the problem. In particular, we find that ambiguous partitions — which we feel are the most critical, because they affect the text's meaning — can be isolated and attacked independently, using methods that do not depend on having large text corpora at our disposal. This paper has been primarily descriptive. We look forward to working with different dictionaries and texts to test both our analysis, and the new methods we propose.","paragraphs":["Ordered by # of forms Ordered by actual counts Ordered by actual/forms Term Forms Actual Term Forms Actual Term Forms Actual Ratio fl11 1011 2871 nil 1011 2871 nil 1 214 214.0 its 142 569 IN 121 593 tilu 1 124 124.0"]},{"title":"ti'l","paragraphs":["131 501 CI 142 569 fil 4 475 118.7 IN 121 593 K1 131 501 fimilu 3 311 103.6 111111 102 327 gr 46 480 au 1 81 81.0 14 90 301 fii 4 475 win 1 74 74.0 41U 75 424 Tii 45 465 Ilya 2 146 73.0 lit 69 197 41U 75 424 nit 1 64 64.0 7114 68 354 111 62 423 aim 1 41 41.0 ii 64 210 ffi 20 384 ilhiri","114","6 244 40.7 1T 62 423 T114 68 354 3 120 40.0 NO 51 154"]},{"title":"tiliu","paragraphs":["102 327 'um 3 117 39.0 211 48 150 filaiu 3 311 414 2 77 38.5 gr, 46 480 Iii 90 301 ilia 1 38 38.0 vii 45 465 di .15 244 ilizulo 2 74 37.0 Ku 37 61 ima 6 244 vu 2 72 36.0 ri 36 150 rut 19 243 Ink 2 71 35.5 a 32 102 04 17 238 Han 1 35 35.0 nil 30 104 Milli 7 220 Kau 1 33 33.0"]},{"title":"cis","paragraphs":["29 60 Ifli 1 214 IIn _\\t4 131 32.7"]},{"title":"Table 8","paragraphs":["The 'swing strings' of symmetrical alternatives. Ordering by forms highlights affixes; ordering by counts reflects the subject matter. The count/form ratio is very text-dependent; it suggests where to look for context-independent ambiguity. 117","Term Correct Incorrect Term Correct Incorrect 1 41 f11111 iiliffl cniuti No 3 ii"]},{"title":"iti","paragraphs":["14??"]},{"title":"I","paragraphs":["CV?? 1"]},{"title":"ti","paragraphs":["Am"]},{"title":"tilv","paragraphs":["fillUill lo 39"]},{"title":"ts","paragraphs":["ihr,iii 11"]},{"title":"ihz tit","paragraphs":["1 II elm limas, comb Ian 5 iii Ihrtill ihr, tilg 1 41 filiu iiim 11111141 U4 6 iii tin di& jnih No 1"]},{"title":"ll un","paragraphs":["41iT4"]},{"title":"Jflih O' 1","paragraphs":["tit%"]},{"title":"lis","paragraphs":["41141f11111 lietiiNoi"]},{"title":"film","paragraphs":["11111 iilUlU11t44?1 41 1764111 MTh Tio4 4111tifl 1 41U1U"]},{"title":"nrutiulu","paragraphs":["I1i14 ? 1 ill"]},{"title":"thriii","paragraphs":["14 ihr."]},{"title":"thifi\" 44","paragraphs":["ihulu"]},{"title":"Inv Culuillu","paragraphs":["Itill41U1U Am 1 41 ilizii 484"]},{"title":"g","paragraphs":["ir. 41484 2 tlulutiin"]},{"title":"nruihuluitriu inn? Lai Culuicluuln? 1 ti","paragraphs":["tllzti"]},{"title":"Mu","paragraphs":["thr,"]},{"title":"tuflu 1","paragraphs":["tutlu"]},{"title":"Thu","paragraphs":["41Itlu4184"]},{"title":"Toutuilu","paragraphs":["464 12 41 1111U41 m ifn A 3131 'Amain 4"]},{"title":"ii.au frnmtau g","paragraphs":["r,"]},{"title":"aliu taut::","paragraphs":["170"]},{"title":"4i","paragraphs":["Aliu ti-du"]},{"title":"eliudi Mu 6 tau wriutau 484 film","paragraphs":["41111ut184 Table 9 Extracting and ordering the hidden 'swing strings' is invaluable for understanding low-probability cases that have similar characteristics, but are not identical. For example, ihan is always the correct partition; it appears in five different forms. Note that all of these are symmetrical, so maximal matching cannot be applied."]},{"title":"7. Acknowledgements","paragraphs":["We"]},{"title":"gratefully acknowledge Namfon Buntua's assistance in classifying, disambiguating, and translating the ambiguous partitions, and the kind permission of Wantanee Phantachat of the NECTEC Linguistics and Knowledge Science Lab for use of their corpus. 8. References","paragraphs":["Chang, C.H, and Chen, C.D. 1993. SEG-TAG: A Chinese Word Segmentation and Part-Of-Speech Tagging System. In","Proceedings of Natural Language Processing Pacific Rim Symposium 319-327, Fukoka, Japan. Chiang, T.H, Chang, T.S., Lin, M.Y, and Su, K.Y. 1992. Statistical Models for Word Segmentation and Unknown Word","Resolution. In Proceedings ofROCLING V, 121-146, Taipei, Taiwan. Cooper, Doug. 1993. Compared to What? Measuring the Performance of Thai Segmentation Algorithms. Technical Re-","port 9, Center for Research in Computational Linguistics, Bangkok. Haas, Mary. 1964 Thai-English Student's Dictionary. Stanford University Press. Haas, Mary. 1946 Techniques of Intensifying in Thai. Word, Vol. 2. Haas, Mary.1942 Types of Reduplication in Thai. In Studies in Linguistics, Vol 1, 1:1-4. Kawtrakul, Asanee, et al 1996. A Gradual Refinement Model for a Robust Thai Morphological Analyzer. In COLING-96:","16th International Conference on Computational Linguistics, Copenhagen, Denmark. Kawtrakul, Asanee, et al. 1995. A Lexicon Model for Writing Production Assistant System. In Proceedings of the Sympo-","sium on Natural Language Processing in Thailand '95, Kasetsart University, Thailand.. Luksaneeyanawin, Sudaporn. 1984 Some Semantic Functions of Reduplicatives in Thai. In Selected Papers from the","First Int. Symposium on Language and Linguistics (Pan Asiatic Linguistics), Chiang Mai University. LINKS 1996 Tagged Text Corpus (unpublished). Language and Knowledge Science (LINKS) Laboratory, Bangkok. Maosong, S., and T'sou, B.K. 1995. Ambiguity Resolution in Chinese Word Segmentation. In Proceedings of the 10th","Pacific Asia Conference on Language, Information, and Computation, City University of Hong Kong. Noss, Richard B. Thai Reference Grammar. Foreign Service Institute, State Dept., Washington D.C. Pornprasertsakul, Ampai. 1994 Thai Syntactic Analysis PhD Thesis, Asian Institute of Technology, Sornlertlamvanich, Virach. 1993. Word Segmentation for Thai in a Machine Translation System. National Electronics","and Computer Technology Center (in Thai). Sproat, Richard, Chilin Shih, William Gail, and Nancy Chang. 1994. A Stochiastic Word Segmentation Algorithm for a","Mandarin Text-to-Speech System. In Proceedings of the 32nd Annual Conference of the Association for Computa-","tional Linguistics, 66-72, Las Cruces, New Mexico. Vongvipanond, Peansiri E 1992. Lexicological Significance of Semantic Doublets in Thai. In Papers on Tai Languages,","Linguistics, and Literatures, Northern Illinois University. Vongvipanond, Peansiri E. 1993. Linguistic Problems in Computer Processing of the Thai Language. In Proceedings of","the Symposium on Natural Language Processing in Thailand, Chulalongkorn University. Wu, Dekai and Fung, Pascal. 1994. Improving Chinese Tokenization with Linguistic Filters on Statistical Lexical Acquisi-","tion. ANLP. Wu, Z, Tseng, G. 1993. Chinese Text Segmentation for Text Retrieval: Achievements and Problems. Journal of the","American Society for Information Science, 532-542. Wuwongse, Vitas and Pornprasertsakul, Ampai. 1993. Thai Syntax Parsing. In Proceedings of the Symposium on Natu-","ral Language Processing in Thailand, Chulalongkorn University. 118"]}]}