{"sections":[{"title":"March 1994 CODE 5530 Computational Volume 20, Number 1 L ng st cs Donald E. Walker: A Remembrance Articles","paragraphs":["Computing with Features as Formulae A Hierarchical Stochastic Model for Automatic Prediction of Prosodic Boundary Location One-Level Phonology: Autosegmental Representations and Rules as Finite Automata An Alternative Conception of Tree-Adjoining Derivation"]},{"title":"Book Reviews","paragraphs":["Computational Models of American Speech M. Margaret Withgott and Francine R. Chen Generating Referring Expressions Robert Dale Computational Linguistics and Formal Semantics Michael Rosner and Roderick Johnson (editors) Expressibility and the Problem of Efficient Text Planning Marie Meteer Explanation and Interaction: The Computer Generation of Explanatory Dialogues Alison Cawsey Contributions to Quantitative Linguistics Reinhard K6hler and Burghard B. Rieger (editors) The Digital Word: Text-Based Computing in the Humanities George P. Landow and Paul Delany (editors) Subsymbolic Natural Language Processing: An Integrated Model of Scripts, Lexicon, and Memory Risto Miikkulainen The Logical Approach to Syntax: Foundations, Specifications, and Implementations of Theories of Government and Binding Edward P. Stabler, Jr. Briefly Noted Barbara Grosz and Jerry R. Hobbs iii Mark Johnson M. Ostendorf and N. Veilleux Steven Bird and T. Mark EUison Yves Schabes and Stuart M. Shieber 1 27 55 91 Reviewed by Judith Markowitz 125 Reviewed by Donia Scott 128 Reviewed by John Nerbonne 131 Reviewed by Ruslan Mitkov 137 Reviewed by Sandra Carberry 139 Reviewed by Carlo Minnaja 141 Reviewed by Mark Olsen 143 Reviewed by Lawrence A. Bookrnan 146 Reviewed by Robert J. Kuhns 150 154 Published Quarterly by the MIT Press for the Association for Computational Linguistics"]},{"title":"Computational Linguistics SSN 0891-2017 Editor","paragraphs":["1983-93 James E Allen University of Rochester Computer Science Department Rochester, NY 14627, USA (+1 716) 275-5288 acl@cs.rochester.edu","Editor 1993-Julia Hirschberg AT&T Bell Laboratories 600 Mountain Avenue, 2D-450 Murray Hill, NJ 07974, USA (+1 908) 582-7496 acl@research.att.com","Managing Editor tDonald E. Walker Bellcore 445 South Street, MRE 2A379 Morristown, NJ 07960, USA (+1 201) 829-4312 walker@bellcore.com","Associate Editor Robert C. Berwick Massachusetts Institute of Technology Artificial Intelligence Laboratory Cambridge, MA 02139, USA (+1 617) 253-8918 berwick@ai.mit.edu","Book Review Editor Graeme Hirst University of Toronto Computer Science Department Toronto, CANADA M5S 1A4 (+1 416) 978-8747 gh@cs.toronto.edu","The FINITE STRING Editor Ralph M. Weischedel BBN Systems & Technologies 10 Moulton Street Cambridge, MA 02138, USA (+1 617) 873-3496 weischedel@bbn.com","Squibs and Discussions Co-Editors James Pustejovsky Brandeis University Computer Science, Ford Hall Waltham, MA 02254, USA (+1 617) 736-2709 jamesp@cs.brandeis.edu Robert J. P. Ingria BBN Systems & Technologies 10 Moulton Street Cambridge, MA 02138, USA \" (+1 617) 873-3582 ingria@bbn.com","Editorial Board Members","1992-94: Jared Bernstein, Entropic Research Laboratory Edward J. Briscoe, University of Cambridge Sandra Carberry, University of Delaware Robert Dale, Microsoft Institute for Advanced Software Technology Mary Dalrymple, Xerox-Palo Alto Research Center Pierre Isabelle, CITI Yuji Matsumoto, Nara Institute of Science and Technology John Nerbonne, Rijksuniversiteit Groningen K. Vijay-Shanker, University of Delaware","1993-95: Steven Bird, University of Edinburgh Bernard Lang, INRIA David D. Lewis, AT&T Bell Laboratories Kathleen F. McCoy, University of Delaware Rebecca L. Passonneau, Columbia University Graham Russell, ISSCO Yves Schabes, Mitsubishi Electric Research Laboratory","1994-96: Hiyan Alshawi, AT&T Bell Laboratories Mark Johnson, Brown University John Lafferty, IBM/TJ Watson Research Center Lori Levin, Carnegie Mellon University Johanna Moore, University of Pittsburgh Stephen Pulman, SRI Cambridge~Cambridge University Mats Rooth, Universitat Tiibingen Keh-Yih Su, National Tsing Hua University David Weir, University of Sussex March 1994"]},{"title":"CODE 5530","paragraphs":["Volume 20, Number 1"]},{"title":"Computational Linguistics","paragraphs":["Donald E. Walker: A Remembrance"]},{"title":"Articles","paragraphs":["Computing with Features as Formulae A Hierarchical Stochastic Model for Automatic Prediction of Prosodic Boundary Location One-Level Phonology: Autosegmental Representations and Rules as Finite Automata An Alternative Conception of Tree-Adjoining Derivation Book"]},{"title":"Reviews","paragraphs":["Computational Models of American Speech M. Margaret Withgott and Francine R. Chen Generating Referring Expressions Robert Dale Computational Linguistics and Formal Semantics Michael Rosner and Roderick Johnson (editors) Expressibility and the Problem of Efficient Text Planning Marie Meteer Explanation and Interaction: The Computer Generation of Explanatory Dialogues Alison Cawsey Contributions to Quantitative Linguistics Reinhard K6hler and Burghard B. Rieger (editors) The Digital Word: Text-Based Computing in the Humanities George P. Landow and Paul Delany (editors) Subsymbolic Natural Language Processing: An Integrated Model of Scripts, Lexicon, and Memory Risto Miikkulainen The Logical Approach to Syntax: Foundations, Specifications, and Implementations of Theories of Government and Binding Edward P. Stabler, Jr. Barbara Grosz and Jerry R. Hobbs iii Mark Johnson 1 M. Ostendorf and N. Veilleux 27 Steven Bird and T. Mark Ellison 55 Yves Schabes and Stuart M. Shieber 91 Reviewed by Judith Markowitz 125 Reviewed by Donia Scott 128 Reviewed by John Nerbonne 131 Reviewed by Ruslan Mitkov 137 Reviewed by Sandra Carberry 139 Reviewed by Carlo Minnaja 141 Reviewed by Mark Olsen 143 Reviewed by Lawrence A. Bookman 146 Reviewed by Robert J. Kuhns 150 Briefly Noted 154 Copyright Q1994 by the Association for Computational Linguistics. Permission to photocopy articles for internal or personal use, or the internal or personal use of specific clients, is granted by the copyright owner for users registered with the Copyright Clearance Center (CCC) Transactional Reporting Service, provided that the fee of $3.00 per article-copy is paid directly to CCC, 222 Rosewood Drive, Danvers, MA 01923. The fee code for users of the Transactional Reporting Service is 0891-2017/94 $3.00. For those organizations that have been granted a photocopy license with CCC, a separate system of payment has been arranged. Such permission requests and other permission inquiries should be addressed to the Managing Editor at the address given on the inside front cover of this issue. Computational Linguistics is abstracted and/or indexed in the following publications: Annual Review of Information Science and Technology, Computer Abstracts, Computing Reviews, Current Contents: Social and Behavioral Sciences, Engineering Index, Knowledge Engineering Review, Language and Language Behavior Abstracts, Linguistic Abstracts, Linguistic Bibliography, Science Abstracts (INSPEC Section C), and Social Sciences Citation Index. Volume 14 and subsequent volumes of Computational Linguistics are available on microfilm through University Microfilms International, 300 North Zeeb Road, Ann Arbor, MI 48106, USA. Send advertising and mailing list inquiries to Marketing Manager, MIT Press Journals, 55 Hayward Street, Cambridge, MA 02142; (617) 253-2866; e-mail: journals-info@mit.edu. Individual Subscriptions to"]},{"title":"Computational","paragraphs":["Linguistics are available only with membership in the Association for Computational Linguistics (ACL). Annual Membership Dues are as follows: regular, $40.00; student -- taking a full-time program of courses and not earning a regular income, $25.00; retired, $25.00; joint -- for couples receiving one subscription, $50.00. A membership application together with an order form for back issues and conference proceedings is included at the end of this issue. Send membership applications and address changes to Betty Walker (ACL), Be]lcore, 445 South Street, MRE 2A379, Morristown, NJ 07960, USA; acl@bellcore.com. However, note that it is also possible to pay by credit card (both by e-mail and by postal mail) and through banks in Switzerland and Japan. Institutional Subscriptions are $84.00. Outside the U.S. add $14.00 postage handling. Canadian subscribers also add 7% GST. Single copies of current and back issues are $22.00. Outside U.S. add $5.00 per issue for postage and handling. Canadians add additional 7% GST. Send institutional subscription orders and address changes to MIT Press Journals, 55 Hayward Street, Cambridge, MA 02142; (617) 253-2889; e-mail: journals-orders@mit.edu. To be honored free of charge, claims for missing copies must be made immediately upon receipt of the next published issue. Prices subject to change without notice. Institutions should order back issues before 1988 and all proceedings from the ACL at the address above."]},{"title":"Donald E. Walker: A Remembrance Barbara Grosz and Jerry R. Hobbs","paragraphs":["Don Walker had a vision of how natural language technology could help solve people's problems. He knew the challenges were great and would require the efforts of many people. He had a genius for bringing those people together.","In preparing this column, we asked a number of people who had known Don over the years to send us reminiscences. Though each person's story differed, a striking commonality emerged. It is remarkable how often Don was present at the key juncture in people's careers, and, in his understated, soft-spoken, low-key way, he did just the right thing for them. What Don did almost always involved bringing people together.","There is a story by Jorge Luis Borges in which someone travels all over India attempting to discover the nature of a very wise man, through the subtle but profound influence he had had on the people he met. Reading the reminiscences of Don and seeing the impact he had on people's lives reminded us of that story.","Don organized research teams. He was often instrumental in matching people with positions in laboratories located far from his own as well as in groups he managed. Several people attribute to Don significant help in starting their careers or in finding the funding that supported their most productive period of research. He often gave essential advice or provided the key opportunity that led to a fruitful new direction in someone's career. Don knew who was doing everything, how to get in touch with them, and how to facilitate the appropriate actions that matched the person with the opportunity.","We were both a part of the natural language group that Don built at SRI in the 1970s, a group that continues today, in our opinion, as one of the premier natural language research groups in the world. He gave one of us (Barbara Grosz) her first AI job, even though she had yet to pick a thesis topic, let alone finish a Ph.D. In doing so, he took a risk of a magnitude that she fully appreciated only years later when she was hiring research associates. It was not a unique gamble; Don was often credited with identifying good people before their reputations were widely established.","The other of us (Jerry Hobbs) met Don at the ACL conference in Boston in 1975. Don greeted him so enthusiastically that he applied for a job at SRI. Little did he know that Don greeted everyone that way.","Don was a wonderful group leader, not least because he so thoroughly integrated the personal and professional. Don appreciated and cared about the whole person of each one of us, and nurtured us. We were as much family as research group. We worked hard and we argued hard, but we appreciated one another and were truly a team. We bonded closer in crises in a way few groups achieve. Don knew his people and led us to work together through the best and the worst. He demonstrated that one need not compromise personal warmth or care for individuals to have a top-rate research group. He also continued to provide guidance for members of his group even after they were in different labs. He often worked behind the scenes in many places and at many crucial junctures to make sure that their work was recognized. Don would never admit to these efforts, but he smiled in a certain way when asked. Asking was the closest one could come to saying thanks, and the smile the only sign that he'd welcomed the appreciation.","Don not only brought people together; he brought disciplines together. In forming (~) 1994 Association for Computational Linguistics Computational Linguistics Volume 20, Number 1 the SRI natural language group, he built up an interdisciplinary group of researchers long before \"cognitive science\" was a phrase, and long before the need for interdisciplinary approaches to the study of language was taken for granted. He firmly believed that interdisciplinary work was the only way to go; to succeed at building the kind of computer systems they were after, AI researchers would have to be informed by linguistics, philosophy, psychology, and sociology. He constructed an environment that freed us to concentrate on our research, and he communicated to us his own excitement and enthusiasm for what could be done in this new interdisciplinary, unpredictable field where human language and computers meet.","Don played a central role in the organization and operation of the Association for Computational Linguistics (ACL), the International Conference on Computational Linguistics (Coling), the International Joint Conference on Artificial Intelligence (IJCAI), and the American Association for Artificial Intelligence (AAAI). Expressing a theme that appeared again and again in the reminiscences, Wolfgang Wahlster, Conference Chair of IJCAI-93, said, \"Don guided me like a father through the complex IJCAI world.\" This feeling is one we share, and we are sure every ACL and IJCAI official through the years has felt the same way.","When Don took over from Hood Roberts as Secretary-Treasurer of ACL, the organization was relatively small. It grew, and Don's job grew with it, in size and complexity. Over the years, ACL officials have had a glimmer of how many concerns Don had to deal with and how much he did, and they have been vaguely aware that there were all sorts of other things he was managing behind the scenes. But only now have the scale and variety of these responsibilities become apparent. In a report about her recent visit to Don and Betty's house in Bernardsville, Karen Sparck Jones said, \"Betty told me that in looking for houses when they moved to New Jersey one of the important considerations was that there had to be a good big basement for the ACL office. Sitting in it and talking with Don and Betty about the gritty details of ACUs finances was a direct encounter with what running something like ACL has implied for Don and thus how much he has contributed to building it up to the first-class society it is.\" Evident in all this is not only that Don did an enormous amount of work keeping the ACL show on the road and improving its act all the time, but also that he had continual concern and respect for all the different parties in the ACL and for the ACL's wider interests in the community and, especially, the international community.","Don was Program Chair of the first IJCAI and General Chair of the next IJCAI. He organized IJCAI as it is today--an independent body governed by trustees who come from the international AI community. Over the years, Don provided the continuity and organization that led to the present IJCAI success. He was Secretary-Treasurer of IJCAI for many years and was the one who provided guidance to the Executive and Trustees committees from the start. Recently, the Principles of Knowledge Representation and Reasoning conference, incorporated last March, adopted a governing structure that closely mirrored IJCAI's. It is no small tribute to Don that a structure he formulated more than twenty years ago is being copied today.","A listing of Don's service roles does not make apparent the depth of Don's contribution, for that goes far beyond the day-to-day management he often provided. Don's service mattered so much because it was always in the interests of a larger goal that he cared passionately about. When he participated in the organization of a new conference or the founding of an organization, it was not for its own sake (or because he didn't already have enough irons in the fire), but because he thought it was necessary to further an important research goal. The goals, as well as the conferences and organizations, were always integrative. IJCAI brings together researchers from around the world and across the fields of AI; Don constantly reminded the Trustees and Advisory iv Barbara Grosz and Jerry R. Hobbs Donald Walker: A Remembrance Board of the importance of safeguarding both dimensions of its diversity. Coling is likewise international, and, with much guidance from Don, ACL has also evolved into an international body. Having helped to foster the now-flourishing European Chapter of the ACL, he looked toward a Chapter on the Pacific Rim. Don was always inclusive, never exclusive.","Don brought people together in other ways. He organized a fund and talked to the right people to give Eastern Europeans the right to visit their colleagues abroad. Petr Sgall remembers his first long personal conversation with Don at the romantic, medieval Hungarian castle of Visegrad. \"Our conversation touched perhaps every-thing from text retrieval to topical issues of world politics, but Don's main concern was to find maximally effective ways of overcoming the disadvantages of researchers in Communist countries. I then saw that Don's effort towards this aim were of much larger dimensions than what I could imagine. Don's conception of international cooperation went far beyond generous support for individual stays. For example, thanks to his initiative, such valuable sources of information as the journal"]},{"title":"Computational Linguistics","paragraphs":["reaches dozens of colleagues who, due to the unfavorable conditions in their countries, would not otherwise be able to get it.\"","The computational linguistics community in Eastern Europe benefitted greatly from Don's efforts toward their integration into the international research community, especially the initiation of the international fund which gave them all the advantages of ACL membership. Eva Haji~ov~ recalls, \"When Don called me at the beginning of 1982 from California ... and asked me whether such an action would be good for us, I just could not believe my ears. It lasted a while before I realized the depth of his offer and became able to express our gratitude and to think of the technicalities.\"","In tribute to Don's efforts to include as many people as possible in the computational linguistics endeavor he found so exciting, and his and Betty's longstanding contributions to the ACL, the ACL Executive Committee established the Don and Betty Walker Student Fund. 1 This fund enables students to attend ACL meetings. His legacy will live on, bringing together people who never had the good fortune to know him.","In recent years, Don's research and his organizational efforts took a new turn. Corpus-based natural-language processing, which at present may be the fastest-growing and most exciting area of computational linguistics, owes a particular debt to Don's vision and leadership. He recognized the importance of working on"]},{"title":"real","paragraphs":["natural-language corpora and other linguistic knowledge resources before that was in vogue, and he developed and sustained successful efforts to organize the collection and an-notation of databases for corpus-based research. In particular, he played crucial leadership roles in the ACL Data Collection Initiative, which has now made available a variety of corpora to the international research community, and in the Text Encoding Initiative, which has brought together international organizations concerned with textual research to create a standard for encoding machine-readable text. Through the Text Encoding Initiative, Don became interested in humanities computing and its approaches to working with large textual databases. He soon realized how much that community and computational linguistics could benefit from interaction with each other and in his characteristic way went on to foster those interactions. His influence and support can also be seen in the European Corpus Initiative, the Linguistic Data Consortium, and the Consortium for Lexical Research, all of which are actively con-1 Don did not know about this fund until it was announced at the 1993 ACL Meeting; he was extremely pleased that the ACL chose this way to honor him. Contributions to this fund can be sent to the Association for Computational Linguistics, c/o Judith Klavans, Box 105, Hastings-on-Hudson, New York 10706. V Computational Linguistics Volume 20, Number 1 tributing to the variety and quantity of corpora and lexical resources available to the research community in naturaManguage and speech processing, linguistics and the humanities. All of this was in the service of a long-term vision he referred to as \"The Ecology of Language\", that is, the attempt to characterize the contexts in which people use language, and thus in which natural language technology can be made useful to people. This theme is reflective of his aims during his whole career.","The delight that Don took in his work and in the people he worked with was infectious. Many times he would try to share that delight with friends who were strangers to the field. His face would light up; his hands would orchestrate his attempts to make them understand the wonder of it all. Often he would search in vain for a word that could convey how he felt about the field, the people, and the ideas, and he would end up saying something like \"It's just so ... so ...\" and fall back with a sigh to \"elegant\", or \"amazing\", extending his hands as if to shape the elusive message.","The ancient Chinese reserved a special place in heaven for people who built bridges. Don Walker built bridges. Acknowledgments","This remembrance is a composite of the reminiscences of a number of people, in-cluding Robert Amsler, Woody Bledsoe, Eva Haji~ov~i, Susan Hockey, Alistair Holden, Fernando Pereira, Jane Robinson, Karen Sparck Jones, and Wolfgang Wahlster. vi"]}]}