{"sections":[{"title":"","paragraphs":["Book Reviews"]},{"title":"Contributions to Quantitative Linguistics Reinhard K6hler and Burghard B. Rieger (editors)","paragraphs":["(University of Trier) Dordrecht: Kluwer Academic Publishers, 1993, xii + 436 pp. Hardbound, ISBN 0-7923-2197-9, $158.00, £111.00, Dfl 270.00"]},{"title":"Reviewed by Carlo Minnaja University of Padua","paragraphs":["Quantitative linguistics (QL) is a branch of science that is not as new as is usually supposed. Its actual beginning was in the early 1930s, and the discipline developed mainly in Eastern Europe. Like computational linguistics, QL deals with linguistic phenomena from a mathematical point of view: QL employs mathematical analysis, probability theory and stochastic processes, and differential equations to model and understand phenomena of language and communication. The mathematical theories of QL are more developed as theories than merely tools to compute. The introduction of quantitative models actually gave a new impetus to an in-depth understanding of the nature of linguistic entities. An interesting comparison could be made between deterministic and stochastic rules, when it comes to investigating linguistic phenomena: the first are just special cases of the second ones, and QL is searching for universal and invariable laws that govern linguistic processes. But sometimes we must allow that searching is not the same as finding: some proposed laws are only tentative, still far away from a consistent theory.","This important branch of studies collected a number of specialists over the decades; but only recently did they find the opportunity to join in the International Quantitative Linguistics Conference, the first of which was held at the University of Trier, Germany, in September 1991, with 120 participants from 16 countries. This volume collects 22 papers accepted and presented, in addition to four general lectures given by invited speakers, and it provides a representative overview of the state of the art. The topical sections are eight in number, and cover a large spectrum of interests: from phonetics to statistics, from modeling to dialectology, as well as reports and projects of different kinds. The organization of the book is very good, as an effort was made to present all contributions through the same structure: introduction, results, conclusions, and open problems.","The book is completely in English, but, as usual among linguists, the references don't quote only books written in English, and a large panorama of books in different languages is offered: after English, German is far ahead of the other languages as second.","Single contributions cannot be mentioned here individually; but at least three of them deserve special attention. First, Mildred Shaw and Brian Gaines propose a very interesting methodology in analyzing terminological and conceptual differences, with practical examples on a Macintosh computer. This contribution is very exhaustive and summarizes the whole theory of distinctions and their representation; it could have been offered in a CL conference as well. Second is H. Goebl's paper about dialectometry, i.e., distances among dialects, where the extremely careful analysis goes together with several suggestive color maps of the regions in Northern Italy where different 141 Computational Linguistics Volume 20, Number 1 dialects are spoken. Third, another aspect which is very rarely studied is the repair of mistakes that a speaker makes while speaking: the type of repair usually gives much more information than the plain correct sentence, as we can guess from the paper by U. Schade and U. Laubenstein.","Some other topics are well known, such as the problem of evaluating word length, or the systems for phoneme-to-grapheme conversion, or the probabilistic scaling of texts, but the contributions in this book succeed in adding still a little bit more, especially when dealing with an extinct language. A couple of papers are nearly entirely devoted to statistical tables, a subject I judge not that fascinating, but which still has its fans.","Unlike other conference proceedings, which are usually devoted to the specialists of the field, this volume can be understood also by researchers in neighboring disciplines: the main lectures, perhaps except one, deal with very general topics, and the mathematical tools are really easy, even from the point of view of a nonmathematician: the question of minimization in synergetic linguistics, for instance, should deserve a treatment--and this could be a fruitful idea for young researchers--through more refined techniques, even borrowed from CL. The most difficult differential equation is of the first order with constant coefficients, so solutions are straightforward, even for linguists. Carlo Mirtnaja is full professor in Applied Mathematics at the International Academy of Sciences, San Marino, and teaches at the Department of Mathematics, University of Padua. He has published many papers in mathematical models for linguistics. Minnaja's address is: Dipartimento di Matematica Pura ed Applicata, Via Belzoni 7, 1-35131 Padova, Italy; e-mail: minnaja@pdmatl.unipd.it. 142"]}]}