{"sections":[{"title":"Tracking Point of View in Narrative","paragraphs":["Janyce M. Wiebe* New Mexico State University Third-person fictional narrative text is composed not only of passages that objectively narrate events, but also of passages that present characters\" thoughts, perceptions, and inner states. Such passages take a character's"]},{"title":"psychological point","paragraphs":["of view. A language understander must determine the current psychological point of view in order to distinguish the beliefs of the characters from the facts of the story, to correctly attribute beliefs and other attitudes to their sources, and to understand the discourse relations among sentences. Tracking the psychological point of view is not a trivial problem, because many sentences are not explicitly marked for point of view, and whether the point of view of a sentence is objective or that of a character (and if the latter, which character it is) often depends on the context in which the sentence appears. Tracking the psychological point of view is the problem addressed in this work. The approach is to seek, by extensive examinations of naturally occurring narrative, regularities in the ways that authors manipulate point of view, and to develop an algorithm that tracks point of view on the basis of the regularities found. This paper presents this algorithm, gives demonstrations of an implemented system, and describes the results of some preliminary empirical studies, which lend support to the algorithm."]},{"title":"1. Introduction","paragraphs":["Imagine that a language understander encounters the following passage while reading a novel: (1) HHe [Sandy] wanted to talk to Dennys. 1'2How were they going to be able to get home from this strange desert land into which they had been cast and which was heaven knew where in all the countless solar systems in all the countless galaxies? [UEngle, Many Waters, p. 91] In this passage, the author is not objectively narrating events or describing the fictional world, but is presenting the thoughts and emotions of a character. It is to Sandy that the land is strange, and it is Sandy's uncertainty that is expressed by the question and the expression 'heaven knew where.' Unless the language understander realizes these things, it hasn't fully understood the passage.","Passages such as (1) take a character's psychological point of view and are composed of subjective sentences--sentences that present the thoughts, perceptions, and inner states of characters in the story. Notice that nothing in (1.2) explicitly specifies that the sentence is Sandy's thought. In general, only a"]},{"title":"narrative parenthetical,","paragraphs":["such as 'Dennys thought' in (2), serves to explicitly indicate both that a sentence is subjective and who its"]},{"title":"subjective character","paragraphs":["is. * Department of Computer Science, New Mexico State University, Box 30001/Dept. CS, Las Cruces, NM 88003-0001. E-mail: wiebe@nmsu.edu. (~) 1994 Association for Computational Linguistics Computational Linguistics Volume 20, Number 2 (2) Certainly, Dennys thought, anything would be better than this horriblesmelling place full of horrible little people. [UEngle, Many Waters, p. 25] In all other cases, one must rely on less direct sources of information to determine the psychological point of view.","This paper presents an algorithm for recognizing subjective sentences and identifying their subjective characters in third-person fictional narrative text. The algorithm is based on regularities, found by extensive examination of naturally occurring text (i.e., published novels and short stories) in the ways that authors manipulate point of view. It has been implemented, and some preliminary empirical studies, which lend support to the algorithm, have also been performed.","The algorithm is described in the body of the paper and is given in full in Appendix A. Sections 2-5 give background information and describe my approach to the problem. Sections 6 and 7 present an overview of the algorithm, specifying the input and output of the basic components and identifying the components focused on in this work. Sections 8-10 present the bulk of the algorithm, addressing the problem of identifying subjective characters before the problem of recognizing subjective sentences. Section 11 describes the algorithm's treatment of sentences about private-state actions, such as sighing and looking. Sections 12-14 conclude the paper with a summary of tests of the algorithm and discussions of the relationship between tracking point of view and anaphora resolution and of directions for future research. The algorithm is given in Appendix A, demonstrations of its implementation are given in Appendix B, and the results of a test of the algorithm are given in Appendix C. 2. Point of View 2.1 Introduction In face-to-face conversation, an utterance is understood with respect to the situation in which the conversation takes place (Barwise and Perry 1983). Thus, deictic expressions such as 'now,' 'here,' 'come,' 'go,' and 'just ahead' derive their meanings from the time and place of the utterance (Fillmore 1975; Lyons 1977). In fictional narrative text, however, spatial and temporal deictic terms are clearly not understood with respect to the time and place of the author's writing nor of the reader's reading. Rather, they are understood with respect to a \"here\" and \"now\" within the story (Hamburger 1973; Kuroda 1976; Banfield 1982; Bruder et al. 1986; Rapaport et al. 1989a, 1989b). Thus, the reader must track the spatial and temporal points of view with respect to which objects and events are described (Uspensky 1973).","Knowing who the speaker is another situational component needed to understand conversation. Most obviously, the speaker is needed as the referent of first-person pronouns, but in addition she is the source of beliefs, emotions, evaluations, etc., expressed by her utterances. But in third-person narrative text, sentences can express a character's beliefs, emotions, etc., even when he or she is referred to in the third person. Thus, an additional deictic component, corresponding to the speaker in conversation, is needed to understand third-person narrative: the psychological point of view (Uspensky 1973).","Although Various points of view often 'coincide in third-person narrative text, they need not. For example, a passage may take a character's spatial and temporal points of view without taking the psychological point of view of any character (Uspensky 1973). It is the psychological point of view we are concerned with in this paper. 234 Janyce M. Wiebe Tracking Point of View in Narrative"]},{"title":"2.2 Subjective Sentences","paragraphs":["Following Ann Banfield (1982), a literary theorist who analyzes point of view linguistically, we shall call sentences that take a character's psychological point of view (hereafter, simply point of view or POV) subjective, in contrast to sentences that"]},{"title":"objectively","paragraphs":["narrate events or describe the fictional world. Subjective sentences present"]},{"title":"private states","paragraphs":["of characters--states of an experiencer holding an attitude, optionally toward an object. Varieties of private states include intellectual ones, such as someone believing, wondering, or knowing something; emotive ones, such as someone hating something or being afraid; and perceptual ones, such as someone seeing or hearing something. Thus, private states are states that are not open to objective observation or verification (Quirk et al. 1985). To refer to a private state p and its components, we shall write: PS"]},{"title":"(p, experiencer, attitude, object)","paragraphs":["where"]},{"title":"experiencer","paragraphs":["is the person in state p, and"]},{"title":"attitude","paragraphs":["is know, believe, see, or whatever sort of private state p is. Notice that \"attitude\" is being used as a general covering term, referring to a class of which the propositional attitudes are only a subclass.","We shall limit our scope in this paper mainly to two classes of subjective sentences, one containing those Banfield calls \"represented thoughts\" and \"represented perceptions,\" and the other containing those I call \"private-state reports.\" We will not consider"]},{"title":"represented speech","paragraphs":["at all (Jespersen 1924; Banfield 1982), because of its complexity, and only toward the end of the paper (Section 11) will we consider a variant of private-state reports: subjective sentences about"]},{"title":"private-state actions.","paragraphs":["Even restricting one's attention to the two classes mentioned above, there are many syntactic, semantic, and pragmatic features according to which one could characterize subjective sentences. Below I propose a view of subjective sentences that is useful for the specific purpose of tracking POV. For characterizations that include further and alternative distinctions, see, for example, the following works in literary theory and linguistics: Dole~el 1973; Uspensky 1973; Fillmore 1974; Cohn 1978; Banfield 1982; Caenepeel 1989; Galbraith 1990; Li 1991.","A private state is part of the meaning of any kind of subjective sentence. However, a represented thought or represented perception without a narrative parenthetical explicitly mentions only the object of the private state; the attitude and experiencer are implicit. On the other hand, a private-state report explicitly mentions the experiencer, the attitude, and, optionally, the object of a private state p; in addition, with the private-state report, p is not the object of some other private state with an implicit experiencer and attitude. Consider the following sentences: 3.1 Zoe was angry at Joe. 3.2 Where was he? Sentence (3.2) is a represented thought. It mentions the object of a private state p whose experiencer, Zoe, and attitude,"]},{"title":"wonder","paragraphs":["or a similar attitude, are implicit: \"Where was he?\" ps(p,"]},{"title":"experiencer, attitude, object)","paragraphs":["235 Computational Linguistics Volume 20, Number 2 Sentence (3.1) mentions the experiencer, attitude, and object of a private state Pl: \" Zoe was angry at Joe.\" PS(pl,"]},{"title":"experiencer 1, attitude1, object1)","paragraphs":["Under a private-state"]},{"title":"report","paragraphs":["interpretation of (3.1), Pl is not itself the object of some other private state.","We shall call the character whose psychological point of view is taken by a subjective sentence the subjective character (SC) of that sentence. The SC is the subject of a narrative parenthetical, when one is present; the implicit experiencer, when the sentence is a represented thought or represented perception without a narrative parenthetical; and the explicit experiencer, when the sentence is a private-state report.","In addition to private-state terms such as 'know' and 'see,' subjective sentences can contain subjective elements, linguistic elements that express attitudes of the SC (this aspect of subjective sentences is noted in many studies of POV; the term \"subjective element\" is attributable to Banfield 1982). An example appears in the following passage (throughout this paper, sentences in cited passages are indented to reflect paragraphing in the original texts). (4) 4.1,What are you doing in here?\" 42Suddenly she [Zoe] was furious","with him [Joe]. 4\"3\"Spying, of course.\" 4\"4\"Well of all dumb things! 4'5I thought you ran away.\" 46joe","Bunch was awful. [Oneal,"]},{"title":"War Work,","paragraphs":["p. 130] The adjective \"awful\" in (4.6) is a subjective element, expressing Zoe's evaluation of Joe (that he is awful). Notice that (4.6) is a represented"]},{"title":"thought--Zoe thought","paragraphs":["is implicit-- and (4.2) is a private-state report, reporting Zoe's private state of being furious with Joe.","As will be specified shortly in Section 6, the output of the algorithm is the POV of a sentence, not a representation of its meaning. One interesting issue not addressed in this paper is how one might represent the difference between, for example, \"John wondered where he was\" and \" 'Where was he?' John wondered.\"","But one distinction that is crucial for tracking POV is the distinction between the interpretation of a sentence as either objective or subjective, and the kinds of states of affairs that the sentence is about. The former is a pragmatic issue, concerning the"]},{"title":"use","paragraphs":["of a sentence to present objective or subjective information about the fictional world (Kuroda 1976). The latter is a semantic issue, concerning the word senses of lexical items in the sentence. For instance, (5) below can be used to objectively narrate a past action or to portray a character's thought of one. In either case, the sentence is about an action. (5) Gus had taken them back to town. Now consider (6): (6) Gus had a cornish hen. Whether the word sense of 'had' in (6) is a state or an action (eating) is a separate question from whether the sentence is objective or subjective (similarly, Hirst [1987] 236 Janyce M. Wiebe Tracking Point of View in Narrative suggests that lexical ambiguity is orthogonal to speech act ambiguity in conversation). As specified in Secti6n 6.1, the type of state of affairs that each clause is about is part of the input to the algorithm.","In addition to being objective or a character's subjective sentence, a sentence may express the attitudes of an overt narrator (Chatman 1978). But this paper will focus only on texts without overt narrators. In addition, we will not consider passages with irony and humor that do not originate with a character, or passages that are written in the style of an epic, parable, or folktale. As well, we will not try to account for fiction that is experimental in its manipulation of POV. Finally, we will only consider narrative sentences in which the tenses are \"shifted\" (Jespersen 1924); that is, in which the simple past is used for the narrative present, and the past perfective is used for the narrative past. Note that it is not difficult to find published third-person texts that satisfy these criteria. 3. Importance of Tracking Point of View The importance to narrative understanding of recognizing characters' intentions has long been recognized in AI (see, for example, Wilensky [1983] and Dyer [1983]). To perform plan recognition, the reader must, among other things, realize when character's intentions are being communicated; this may involve realizing that a particular sentence is subjective rather than objective. In (7), a represented thought communicates a character's intentions: (7)","71He [Jeff] could see her walking the other way. 72If he wanted to avoid notice, he would have to act with the same deliberate manner as all the robots around him. 7'3He lengthened his stride and gave chase without otherwise altering his body language. [Wu,"]},{"title":"Cyborg,","paragraphs":["p. 71] Sentence (7.2) is not a purely narrative sentence informing the reader that if Jeff wants to avoid notice, he must change the way he is walking. Rather, (7.2) is Jeff's thought expressing his goal to avoid notice, and also his belief about how to achieve it. Understanding this is necessary for the reader to perceive the intentionality behind the action described in (7.3).","In addition to being important for plan recognition, tracking POV is necessary to distinguish what is true in the fictional world from what is believed by the characters. While objective sentences are unquestionably true in the fictional world, subjective sentences reflect the subjective character'S beliefs, which may be false in the fictional world (Uspensky 1973; Kuroda 1976; Cohn 1978; Banfield 1982). A striking example is the following: (8) This was David's boy. [Bridgers,"]},{"title":"All Together Now,","paragraphs":["p. 91] Sentence (8) is actually about a female character named \"Casey.\" However, it is the represented thought of a character who believes that Casey is a boy, and reflects this false belief about her.","Beliefs and intentions are just two of many types of attitudes communicated by subjective sentences (see Dyer [1983] for a processing model of how various attitudes can be related to goals). The algorithm for tracking POV presented in this paper is intended to be just one part of an overall narrative-understanding system. Identifying which attitudes are being presented and incorporating them into a representation of 237 Computational Linguistics Volume 20, Number 2 the meaning of the text is beyond the scope of this work. But to accomplish such tasks, the system must recognize when attitudes are being presented in the first place and identify the character whose attitudes they are; these are the tasks involved in tracking the psychological POV.","POV also has important implications for discourse processing. Discussion of this topic is deferred until Section 14.","Sentences that present 1 the attitudes of someone who is not the writer appear in genres other than third-person fictional narrative text, such as newspaper articles and textbooks (Banfield 1982), even if we might prefer another term than \"represented thought\" for such sentences. Thus, the problem of tracking POV arises for these other genres as well. Following is a passage from The New York Times (1990) that contains a \"represented thought\": Looking at the more severely affected countries, experts are wondering where the saturation point will be. Where will the infection rate level off as most of those engaging in riskier behavior fall prey: 30 percent? 40 percent? The second sentence presents something that the experts are wondering; 30 and 40 percent are the experts' guesses, not those of the writer.","Third-person fictional narrative text is the focus of this work primarily because it contains so many prototypical instances of sentences that present attitudes of someone who is not the writer. Further, by restricting the types of texts considered (see Section 2.2 above), it is possible to constrain the problem to choosing among an objective POV and the points of view of the characters. In genres such as soft news and editorials, for example, the writer may present his or her own attitudes; when attitudes of the writer, the speaker, or a narrator may be presented, the problem is less constrained. Hamburger (1973), Kuroda (1973), Banfield (1982), Galbraith (1990), and Wiebe (1991) address this issue more fully. Finally, there is a great deal of previous work to build upon, in linguistics and especially literary theory, investigating POV in novels and short stories. 4. Approach Reasoning about whether a sentence is objective or the subjective sentence of this or that character is certainly part of tracking POV (Fillmore 1974). But it is reasonable to hypothesize that, in the face of all of the inferential possibilities, discourse expectations too are involved in tracking POV; that is, in the absence of an explicit indication of POV, readers are intended to assume that POV is being manipulated in one of the usual ways, and to try to interpret the sentence accordingly. (Similar suggestions have been made by Carberry [1989] with respect to resolving intersentential ellipsis and by Sidner [1983] with respect to pronoun resolution.) We can view the text as composed of maximal blocks of objective sentences (objective contexts) and maximal blocks of subjective sentences that have the same subjective character (subjective contexts). Fur-1 My wording in this paper often attributes agency to sentences. I might say, for example, that a sentence states something, communicates something, initiates a new POV, or refers to someone. Sidner (1983) and Webber (1983) object specifically to using a noun phrase as the agent of the verb 'refer,' since it is the writer who is doing the referring, not the noun phrase. I do not disagree---my wording is for convenience only. 238 Janyce M. Wiebe Tracking Point of View in Narrative ther, we can view the process of tracking POV as recognizing the following discourse operations: . . . Sentence s continues the current POV: s and the previous sentence are either both objective or both subjective sentences of the same character. Sentence s resumes y's POV: s is a subjective sentence of y and is preceded by an objective context, which is in turn preceded by a subjective context of the same character y. Sentence s initiates y's POV: s is a subjective sentence of y and either s is the first subjective sentence of a scene, or the SC of the previous subjective sentence is a different character z. The approach taken in this work is to seek, by extensive examination of naturally occurring narratives, regularities in the ways that authors initiate, resume, and continue a character's point of view, and to develop an algorithm that tracks point of view on the basis of the regularities found. Given certain combinations of sentence features (e.g., tense, aspect, lexical items that potentially express subjectivity, the types of states of affairs that the sentence is about, and the identities of the actors or experiencers of those states of affairs), and of the current context (e.g., whether the previous sentence was subjective or objective, whether a paragraph break separates the current and previous sentences, and the identity of the SC of the previous subjective sentence, if there was one), particular point-of-view operations can be expected. A simple example: a sentence that (1) is about an action, (2) is in the past progressive, and (3) follows, without a paragraph break, the subjective sentence of a character c, usually continues c's POV.","The examination of texts mentioned above was not a formal empirical investigation, so the algorithm should be viewed as a hypothesis that can be subjected to such tests. However, I examined passages from over forty novels and short stories to identify the regularities upon which the algorithm is based, and strictly adhered to the practice of considering only naturally occurring examples in developing the algorithm. Further, some preliminary empirical tests of the algorithm have been performed (see Section 12), among them psychological experiments of specific aspects of the algorithm. The results of these experiments are positive. I describe them as \"preliminary\" so as not to suggest that the entire algorithm has already been subjected to psychological experimentation. 5. Previous Work There are literary theorists and linguists who investigate linguistic aspects of subjective sentences. The present work greatly benefited from their investigations, most directly from Dole~el (1973), Uspensky (1973), Kuroda (1973, 1976), Fillmore (1974), Cohn (1978), and especially Banfield (1982). However, the relevant work in the above fields is descriptive only; it describes characteristics of subjective sentences, but does not address the problem of"]},{"title":"tracking","paragraphs":["POV. An exception is work on POV and aspect that shows that aspect is only a context-sensitive marker of subjectivity (Ehrlich [1987, 1990] and Caenepeel [1989]; see Section 9).","In AI, Nakhimovsky (1988) suggests a discourse-processing approach to tracking POV, but does not develop it in any depth. Also, Reiser (1981) simply suggests that POV may be established by syntactic clues, and by including \"more episodes and internal information\" about a character (p. 209). 239 Computational Linguistics Volume 20, Number 2","con text ~ l{ }, { }, { }, presubjective-nonactive /","loop","if ~SENTENCE(ITEM( text, i) ) then","context ~- NEW-CONTEXT' (ITEM(text, i), context) else","interpretation ~ POV (FEATURES(ITEM( text, i) ),context)","context ~ NEw-CONTEXT(interpretation, context) end if i~i+l","end loop n ~e.nl~ce","~ N / Figure 1 Overview.","A great deal of work in AI has involved inferring speaker and hearer attitudes in conversation (such as work in plan recognition in conversation--see, e.g., Allen and Perrault [1980]; in user modeling--see, e.g., the papers in the special issue of Computational Linguistics on user modeling 1988; and in dynamically constructing nested-belief environments during understanding--see, e.g., Wilks and Bien [1983]) and character's attitudes in stories (see, e.g., Wilensky [1983] and Dyer [1983]). Such beliefs might be about what agents who are mentioned in the discourse believe, but the question is not addressed as to whether an utterance itself presents what is actually the object of an agent's attitude, where that agent is not mentioned in the sentence.","In summary, there is no previous detailed investigation of the problem of tracking the psychological POV. 6. Overview of the Algorithm The algorithm will be developed in detail in subsequent sections. This section provides an overview, giving the input and output of the basic components. While this involves using some terms before they are defined, it will provide the reader with a framework in which to understand the material that follows. As well, it will enable me to clarify the focus of the work and to state exactly what has been implemented.","Figure I gives the algorithm at the highest level and a corresponding flow-diagram. Of the functions shown in Figure 1, it is functions POV, NEW-CONTEXT, and NEW-CON-- 240 Janyce M. Wiebe Tracking Point of View in Narrative TEXT' that are addressed in this work. Functions ITEM and FEATURES, preprocessing functions, represent a subset of the other tasks performed by an overall NLU system. The remainder of this section gives the input/output mappings of all five functions."]},{"title":"6.1 The Preprocessing Functions","paragraphs":["• Function ITEM maps the text and the current position in the text into the input item at that position, i.e., the paragraph break, scene break (see Section 8.2.1), or sentence (see Section 6.3.2) that is at the current position: ITEM : Text x Position --+ Inputltem. This function is not implemented in the system, so a facility is provided that enables the user to input the current input item. • Function FEATURES maps a sentence (see Section 6.3.2) into a set of features: FEATURES : Sentence ~ FeatureSet. A FeatureSet consists of the following (some of the features will be expanded upon in later sections, as indicated; for extensive detail, see Wiebe [1990]): . . . The"]},{"title":"potential subjective elements","paragraphs":["in the sentence, if any. The potential subjective elements form a large class that includes lexical items used with particular meanings, tense, aspect, and certain syntactic properties (see Section 9.2). The type of state of affairs that each clause is about. For example, the main clause of the following is about a private state and the subordinated clause is about an action: John wondered whether Mary opened the door. Note that each of the following is about a private state: Mary was afraid of the dark. The darkness made Mary afraid. Wiebe (1990) gives a list of private-state terms, noting which syntactic roles the experiencer fills in various clause structures (this material is drawn from Quirk et al. [1985]). Section 6.3.1 gives the categorization of states of affairs used in this work. An indication of whether or not the head noun of the subject of the main clause is a private-state noun (e.g., 'pain' and 'astonishment') and, if it is, the state of affairs that that noun is about. Examples of sentences with such private-state nouns are: (10) The feeling went away. (11) The pain increased. (12) His astonishment grew.","4. The experiencers and actors (i.e., particular case fillers [Fillmore 1968]) of the states of affairs of items (2) and (3). Because a single action might have more than one actor, and a single state might have more than one experiencer, each of these is a set. If an experiencer or actor is not mentioned in the sentence (as is the case for the subject nouns in (10) and (11)), then that experiencer or actor is the empty set. 241 Computational Linguistics Volume 20, Number 2 . . An indication of whether or not the sentence contains a narrative parenthetical, and, if it does, the identity (or identities) of the individual(s) referred to by the subject of the parenthetical. Some other syntactic information not included above. Function FEATURES involves the resolution of syntactic, semantic, and discourse/pragmatic ambiguities that are outside the scope of this work (see Section 14 for a discussion of interactions between point of view and discourse processing). While the implemented system demonstrated in Appendix B takes actual sentences as input, it does not truly implement FEATURES, but is successful in computing the FeatureSet of a sentence only for sentences that fall within its limited coverage. There is another version of the system that queries the user for the information returned by function FEATURES, to enable the algorithm to be tested on unlimited text, without concern for problems not addressed in this work. It is this system that is used in the test of the algorithm presented in Appendix C and to support the psychological experiments mentioned in Sections 8.3.1, 9.3, and 12. 6.2 The Central Functions • Function POV, which is implemented, maps a FeatureSet and a Context into an Interpretation: POV : FeatureSet x Context ~ Interpretation. A Context and an Interpretation are as follows. A Context consists of (1) the identity of the SC of the last subjective sentence that appeared in the text, if there was one, (2) the identity of the last active character (defined in Section 8.2.2), if there was one, (3) the identities of any characters whose points of view were taken earlier in the text, and (4) the current text situation (defined just below in Section 6.3.4):","Context = {LastSC, LastActiveCharacter, PreviousSCs, TextS ituation ) An Interpretation is either that the sentence is the subjective sentence of a particular character, or that the sentence is objective and has a particular active character (ActiveCharacter is the empty set for objective sentences without active characters):","Interpretation E {{objective, ActiveCharacter} ] ActiveCharacter C Characters} U {{subjective, SC} i SC c Characters}. • Functions NEW-CONTEXT and NEW-CONTEXT' return the Context of the next input item, the former for the case in which the current item is a sentence; the latter for the case in which the current item is a scene or paragraph break: NEW-CONTEXT : Interpretation x Context --+ Context. NEW-CONTEXT' : {paragraph break, scene break} x Context ~ Context. These functions are also implemented; algorithms for them follow trivially from the definitions of an interpretation and of a context and its components. 242 Janyce M. Wiebe Tracking Point of View in Narrative"]},{"title":"The Context","paragraphs":["of the i th input item in text"]},{"title":"t, ci,","paragraphs":["is ({}, {}, {}, presubjective-nonactive) NEW-CONTEXT'(ITEM(t, i -- 1)~"]},{"title":"ci-1) Ci NEW-CONTEXT(","paragraphs":["POV(FEATURES(ITEM(t, i -- 1)),"]},{"title":"ci-1)~","paragraphs":["Ci-1) ifi=l ifi>l& ~SENTENCE (ITEM (t, i-- 1)) ifi>l& SENTENCE (ITEM (t, i -- 1)) where \"presubjective-nonactive\" is the text situation of the first item in a text, and"]},{"title":"SENTENCE(X)","paragraphs":["is true iff x is a sentence. To refer to the components of a context, we shall use the functions LAST-SC-OF, LAST-ACTIVE-CHARACTER-OF, PREVIOUS-SCS-OF, and"]},{"title":"TEXT-SITUATION-OF,","paragraphs":["which map a context C to the"]},{"title":"LastSC, LastActiveCharacter, PreviousSCs,","paragraphs":["and"]},{"title":"TextSituation","paragraphs":["of C, respectively. In the above definitions,"]},{"title":"LastSC, LastActiveCharacter, SC,","paragraphs":["and"]},{"title":"ActiveCharacter","paragraphs":["are sets, and"]},{"title":"PreviousSCs","paragraphs":["is a set of sets. This is because a subjective sentence can represent the shared psychological POV of more than one physical character (Banfield 1982). For example: (13) 13\"1Leaning out of the window side by side the two women watched the man'...132Now he threw away his cigarette. 133They watched him. 134What would he do next? [Woolf,"]},{"title":"The Years,","paragraphs":["p. 103; cited by Banfield 1982, p. 96] Sentence (13.4) is a represented thought whose SC is more than one physical character. 6.3 States of Affairs, Sentences, and Contexts: Some Further Details 6.3.1 States of Affairs. The following are the range of state-of-affairs types that can be included in a"]},{"title":"FeatureSet.","paragraphs":["For more refined categorizations for the purpose of analyzing tense and aspect, see, for example, Reichenbach (1947) and the papers in the special issue of"]},{"title":"Computational Linguistics","paragraphs":["on tense and aspect in 1988. . 2. 3. 4. private-state actions, such as looking and sighing (see Section 11); other kinds of actions; private states; and nonprivate states, such as being six feet tall. The rough part of this categorization is the boundary between the second and fourth items. We shall assume that function FEATURES classifies only clear instances of nonprivate states as such, and that states of affairs that fall between the categories of action and nonprivate state, such as processes, are classified as actions.","In quoted speech, there are states of affairs on two levels: those spoken of and the action of speaking itself. The regularities on which the algorithm is based involve the latter. Thus, the contents of the quoted string are not considered, and, even if a discourse parenthetical does not actually appear, the sentence is viewed as one whose main clause is about a communicative action (a subtype of (2)above); that is, as one whose main verb phrase contains a communicative verb with a quoted string as object. We return to this point in Section 9.5. 243 Computational Linguistics Volume 20, Number 2 6.3.2 Sentences. We shall call any Inputltem that is not a scene or paragraph break a \"sentence,\" although such an Inputltem is sometimes smaller than an actual sentence, sometimes larger. The former occurs for compound sentences and the latter occurs for sentences of quoted speech.","Suppose that a compound sentence with conjuncts c1,..., Cn starts at position i in text t. Then, ITEM(t,/) = cl, ..., ITEM(t,i+n-1) = Cn. We shall call each ci a \"sentence.\"","In the case of quoted speech, everything enclosed within a single pair of quotes, together with the accompanying discourse parenthetical, if there is one, counts as a single Inputltem that we shall call a \"sentence.\" For example, (4.4) and (4.5) together compose a single Inputltem (a single \"sentence\"). Since the algorithm does not consider the contents of quoted strings (see Section 6.3.1), there is no reason for each constituent sentence of a quoted string to be a separate Inputltem.","From this point forward, numbering within cited passages is as follows: each Inputltem that is not a paragraph or scene break is given a separate number.","Now that the units of input have been specified, the following can be noted. In this work, if any part of a sentential Inputltem s is subjective, then s as a whole is considered to be subjective. This makes the algorithm easier to understand. Enabling it to report which part of s is subjective, if relevant, would involve straightforward refinements of the text situations, of interpretations, and of some conditional steps of the algorithm into subcases. 6.3.3 Choosing a State of Affairs. Out of the states of affairs included in a FeatureSet for a sentential input item s, the algorithm chooses just one to consider. Specifically, the algorithm for POV uses the following function: CHOSEN-STATE-OF-AFFAIRS : FeatureSet -, StateOfAffairs. As we shall see in Section 8, private states are particularly important to consider, because if a sentence that is about a private state is interpreted to be a private-state report, then the SC of the sentence is the experiencer of the private state. A subordinated clause can report a character's private state; an example is \"thinking ...\" in the following sentence (as it appears in the novel): When he [Call] got within fifteen miles of Lonesome Dove he cut west, thinking they would be holding the herd in that direction. [McMurtry, Lonesome Dove, p. 181]","Following is the specification of CHOSEN-STATE-OF-AFFAIRS. Let Cmain be the main clause of s; let Cl,C2,... ,Cn be the other n clauses of s; and let hn be the head noun of the subject of Cmain. Further, let SOamain be the state of affairs that Cmain is about; let SOahn be the state of affairs that hn is about (but if hn is not about a state of affairs--for example, if it is a proper noun--then let sOahn be nil); and let soai (1 K i < n) be the state of affairs that ci is about. Then, the result of"]},{"title":"CHOSEN-STATE-OF-AFFAIRS(FEATURES(S))","paragraphs":["is as follows:","If SOamain is a private state then","the result is sOamain","else if SOahn is a private state then","the result is soahn","else if 3 soai (1 < i < n) such that soai is a private state, and ci is not","subordinated to another clause Ck such that SOak is a private state then 244 Janyce M. Wiebe Tracking Point of View in Narrative Table 1 Choosing a state of affairs: examples. s: \"Japheth turned the book over in a puzzled manner.\" Chosen: SOamain S: \"The pain increased.\" Chosen : SOahn S: \"The pain angered him.\" Chosen: SOamain S: \"When he got within fifteen miles of Lonesome Dove he cut west, thinking they","would be holding the herd in that direction.\" Chosen: soai, where ci = \"thinking they would be holding the herd in that direction\" s: \" 'Rosie's just saying that. She doesn't really care,' Zoe said.\" (sentence (15.3)). Chosen: SOamainn, which is the action of Zoe saying the quoted string. s: \"What are you doing in here?\" (sentence (4.1)). Chosen: SOamain, which, as s appears in the novel, is Zoe saying the quoted string.","That Zoe is the speaker is in FEATURES(s) (see items (2) and (4)","of section 6.1 and the end of section 6.3.1).","the result is $oai (if there is more than one such soai, one is randomly chosen) else the result is SOamain. Table 1 gives some examples.","Note that private-state terms appearing in certain types of constituents cannot be used to report private states. An example is a manner adverbial (Quirk et al. 1985), such as the italicized portion of \"Japheth turned the book over in a puzzled manner.\" (There are others addressed in Wiebe [1990], but because of space limitations, we shall ignore them in this paper.) The phrase \"in a puzzled manner\" does not report a private state, but rather describes the manner in which something is done. The state of affairs chosen for this sentence is simply the main-clause action.","To facilitate discussion, a sentential Inputltem of which the state of affairs chosen for consideration is of type X will be called an \"X sentence,\" for example, \"action sentence\" and \"private-state sentence.\" 6.3.4 The Text Situations. Following are the text situations (recall that a text situation is part of the context, defined in Section 6.2). 2 To make it easier to understand them, definitions are given in both English and diagrams. Each diagram shows what appears between the start of the current scene, represented by \"start-of-scene,\" and the current position, represented by a diamond (c~). The start of the current scene is either a scene break or the very beginning of the text. The symbol \"¶\" represents a paragraph break; \"objective-sentence\" and \"subjective-sentence\" represent objective and subjective sentences, respectively; \"sentence\" alone represents either a subjective or objective sentence; the symbol \"*\" means 0 or more occurrences, \"÷\" means 1 or more occurrences, and \"...\" represents any number of paragraph breaks and sentences (but not scene breaks, since only what has appeared since the start of the current scene is shown). A scene is assumed to always begin with a paragraph break. 2 1 am indebted to Stuart C. Shapiro for suggesting the names. 245 Computational Linguistics Volume 20, Number 2 . . . . . . ."]},{"title":"presubjective-nonactive:","paragraphs":["a subjective sentence has not appeared so far in the current scene, and a sentence with an"]},{"title":"active character","paragraphs":["(defined in Section 8.2.2) has not appeared so far in the current paragraph. start-of-scene ¶ (objective-sentence + ¶)\" objective-sentence ~ o None has an active character"]},{"title":"presubjective-active:","paragraphs":["a subjective sentence has not appeared so far in the current scene, but a sentence with an active character"]},{"title":"has","paragraphs":["appeared earlier in the current paragraph. start-of-scene ¶ (objective-sentence + ¶)~ objective-sentence +, * At least one has an active character"]},{"title":"continuing-subjective:","paragraphs":["the current sentence follows a subjective sentence without a paragraph break. start-of-scene ... ¶ sentence ~ subjective-sentence o"]},{"title":"broken-subjective:","paragraphs":["the current sentence follows a subjective sentence, but"]},{"title":"after","paragraphs":["a paragraph break. start-of-scene ... subjective-sentence ¶ o"]},{"title":"interrupted-subjective:","paragraphs":["the current sentence follows an objective","sentence, but an earlier sentence in the current paragraph is subjective.","start-of-scene . .. ¶ sentence\" subjective-sentence sentence ~","objective-sentence o"]},{"title":"postsubjective-nonactive:","paragraphs":["a subjective sentence has appeared in the current scene, and an objective sentence and a paragraph break have appeared since the last subjective sentence. However, a sentence with an active character does not appear earlier in the current paragraph. start-of-scene ... subjective-sentence ... objective-sentence ¶ o -or-","start-of-scene ... subjective-sentence ... ¶ objective-sentence +, * Y None has an active character"]},{"title":"postsubjective-active:","paragraphs":["like the postsubjective-nonactive situation, except that a sentence with an active character does appear earlier in the current paragraph. start-of-scene ... subjective-sentence ... ¶ objective-sentence +, * At least one has an active character"]},{"title":"7. Focus of This Work","paragraphs":["Algorithms for the preprocessing functions are not given in this paper, and algorithms for NEW-CONTEXT and NEW-CONTEXT' are given in Appendix A. The remainder of 246 Janyce M. Wiebe Tracking Point of View in Narrative this paper develops an algorithm for function POV, which at the highest level is the following: POV"]},{"title":"(featureSet~ context) if","paragraphs":["SENTENCE-IS-SUBJECTIVE"]},{"title":"(featureSet~ context) then","paragraphs":["§9 return/subjective~ IDENTIFY-SC"]},{"title":"(featureSet~ context)I §8 else return/objective~","paragraphs":["ACTIVE-CHARACTER-OF"]},{"title":"(featureSet~ context ) l §8 end","paragraphs":["if Active characters are discussed in the section about identifying the SC (Section 8), because the raison d'etre of the active-character component of an interpretation is that the active character of an objective sentence may become the"]},{"title":"LastActiveCharacter","paragraphs":["of a later context,"]},{"title":"contexti,","paragraphs":["and as such, may become the SC of a subjective sentence that is"]},{"title":"processed in contexti. 8. Identifying the Subjective Character 8.1 Introduction","paragraphs":["The SC of a subjective sentence can always be identified from the sentence itself if the sentence has a narrative parenthetical, such as 'Dennys thought' in (2), and can sometimes be so identified if the sentence is about a private state. When the SC is not identifiable from the sentence, she is often a previously mentioned character. Thus, as the text is processed, any algorithm for tracking POV must keep track of characters who are likely to become the SC of a later subjective sentence. I call such characters expected subjective characters. The algorithm presented in this paper considers two possibilities: the last subjective character and the last active character of the current context. Each is an expected subjective character only in certain text situations. The idea of keeping track of entities evoked in the text in order to interpret later sentences is attributable to work on anaphora resolution (e.g., Sidner [1983] and Grosz, Joshi, and Weinstein [1983]). Active characters are based specifically on Sidner's actor focus, but while Sidner's actor focus is \"whoever is currently the agent in the sentence\" (p. 282), many sentences with agents do not have active characters, as we shall see in Section 8.2.2.","In some cases, the SC of a subjective sentence is not identifiable when the sentence appears, but may be identifiable after later sentences are processed. The algorithm, as presented in Wiebe (1990), handles one such case. Because of space limitations, however, this aspect of the algorithm is not presented in this paper, but is only briefly described (in Section 8.2.4).","Here is a high-level algorithm for identifying the SC (comments are preceded by 'O/o'): IDENTIFY-SC"]},{"title":"(featureSet~ context) % IDENTIFY-SC(featureSet~ context) C Characters;","paragraphs":["the empty set indicates failure. if"]},{"title":"IDENTIFY-SC-FROM-THE-SENTENCE(featureSet~ context) ~","paragraphs":["{} then return IDENTIFY-SC-FROM-THE-SENTENCE"]},{"title":"(featureSeL context) else","paragraphs":["if LAST-SC-IS-AN-EXPECTED-SC"]},{"title":"(context) and LAST-ACTIVE-CHARACTER-IS-AN-EXPECTED-SC (context ) then return CHOOSE-AN-EXPECTED-SC (featureSet~ context) else","paragraphs":["if"]},{"title":"LAST-SC-IS-AN-EXPECTED-SC(context) then return LAST-SC-OF( context)","paragraphs":["247 Computational Linguistics Volume 20, Number 2 else if"]},{"title":"LAST-ACTIVE-CHARACTER-IS-AN-EXPECTED-SC(context) then","paragraphs":["return"]},{"title":"LAST-ACTIVE-CHARACTER-OF(context) else return","paragraphs":["{} end if The following subsections refine and illustrate the above algorithm. We first consider identifying the SC based on expected subjective characters (in Section 8.2), and then identifying the SC from the sentence (in Section 8.3). 8.2 Identifying the SC from the Context In this section, we consider cases in which the SC of a subjective sentence cannot be identified from the sentence itself. We first consider the last subjective character (Section 8.2.1), then the last active character (Section 8.2.2), and then the cases in which both (Section 8.2.3) or neither (Section 8.2.4) are expected subjective characters. 8.2.1 The Last Subjective Character. An SC who is not identifiable from the sentence itself is most often the last subjective character. In this case, the current sentence is continuing a character's POV, if the previous sentence was also subjective, or resuming one, if objective sentences have appeared since the last subjective sentence. Sentence (1.2) above illustrates the former, and passage (15) illustrates the latter:","(15)","15\"lZoe would have liked to punch her. lS'2She could not understand","why her parents didn't know Rosie was a phony. 15\"3\"Rosie's just saying that. She doesn't really care,\" Zoe said. 15\"4\"I do too!\" cried Rosie. lS'S\"Phony!\" Zoe yelled. lS6\"That will be enough.\" 157Their father stood up. 15\"8\"You may","take your plate to the kitchen.\" 15\"9\"What about Rosie!\" Zoe yelled. 15\"1°\"I will worry about Rosie.\" ls'nThere was no use arguing. [Oneal,"]},{"title":"War Work,","paragraphs":["p. 40; italics in original] Sentences (15.1), (15.2), and (15.11) are Zoe's subjective sentences. Sentence (15.11) expresses Zoe's judgment that there is no use in arguing, resuming Zoe's point of view: it has the same SC as the last subjective sentence, (15.2), and is separated from (15.2) by objective sentences (15.3)-(15.10).","If there has not been a subjective sentence so far in the text, then the last subjective character, which is the empty set in this case, clearly should not be an expected subjective character. Moreover, drastic spatial and temporal discontinuities can block the continuation or resumption of a character's psychological POV. This paper considers one such kind of discontinuity, a scene break. The condition under which the last subjective character of"]},{"title":"contexti","paragraphs":["is an expected subjective character is when a subjective sentence has appeared in the current scene. That is, LAST-SC-IS-AN-EXPECTED-SC"]},{"title":"(contexti)","paragraphs":["is true iff"]},{"title":"TEXT-SITUATION-OF(contexti) ~","paragraphs":["{presubjective-nonactive, presubjective-active}.","A scene break is a break from one parallel story-line to another. Almeida (1987)","analyzes parallel story-lines as forming separate narrative-lines, which are stretches","of narrative that are controlled by single now-points. The following passage illustrates 248 Janyce M. Wiebe Tracking Point of View in Narrative the situation in which a scene break blocks the resumption of a character's point of view: (16) 16\"1Moving fast, in the dark.","16'2He'd lost Cherry. 16\"3He'd lost the hammer. 16\"4She must've slid back down into Factory when the guy fired his first shot. 16SLast shot, if he'd been under that box when it came down ... [Mixture of subjective sentences of the same character and quoted speech] [Chapter break] 16\"6What kind of place was this, anyway? 167Things had gotten to a point where Mona couldn't get any comfort out of imagining Lanette's advice. [Gibson, Mona Lisa Overdrive, pp. 275-276; ellipsis in original] As passage (16) appears in the novel, the SC of all of the subjective sentences before the chapter break is the character Slick, and a scene break occurs at the chapter break. While the sentence following the break is subjective, the SC of that sentence should not be identified to be the last subjective character, Slick. 8.2.2 The Last Active Character. A SC who is not identifiable from the sentence itself may also be the actor of an action that a previous objective sentence is about (but less commonly than the last subjective character). Since this character need not be the SC of the last subjective sentence, this is a way for the author to initiate a new point of view. Following is an example (by this point in the novel, both Jake and Augustus have been the SC of previous subjective sentences): (17) 17.1 Jake felt sour. 17\"2He wished again that circumstances hadn't prompted him to come back. 173He had already spent one full night on horseback, 174and now the boys were expecting him to spend another, all on account of a bunch of livestock he had no interest in in the first place."]},{"title":"17\"5\"I","paragraphs":["don't know as I'm coming,\" he said."]},{"title":"17'6\"I","paragraphs":["just got here. If I'd known you boys did nothing but chase horses around all night, I don't know that I would have come.\"","177\"Why, Jake, you lazy bean,\" Augustus said, 17\"Sand walked off. 179jake had a stubborn streak in him, 171°and once it was activated even Call could seldom do much with him. [McMurtry, Lonesome Dove, p. 162] As this passage appears in the novel, (17.1)-(17.4) are the subjective sentences of Jake, and (17.9)-(17.10) are the subjective sentences of Augustus, the actor of an action that a previous objective sentence was about (sentence (17.8)). However, it is Jake who is the last subjective character, so Augustus's point of view is being initiated, not merely resumed or continued.","The situation I observed in which POV shifts to an actor (who is not also the last subjective character) is one in which the actor was the SC of some previous subjective 249 Computational Linguistics Volume 20, Number 2 sentence in the text, and the sentence about his or her action is focused by the text. The precise situation is captured by the following specifications of what an active character is, what the last active character is, and of the text situations in which the last active character is expected.","Suppose that os is an objective sentence that is Inputltemj. Saying that os has an active character means that POV(FEATURES(0S), contextj) = /objective, ac I, where ac is not the empty set. This is the case iff: os is about an action that is actually performed in the current scene by ac (more precisely, when the state of affairs chosen for consideration is such an action), and","ii. acc PREVIOUS-SCS-OF (contextj). That is, ac is in the set of characters who have been the SC of some previous subjective sentence in the text (possibly before the current scene). The algorithm for POV determines whether an action meets the conditions in (i) by looking at such things as the tense, aspect, and mood of os (the features the algorithm considers are in FEATURES(0s)). First, to guarantee that the action is not performed earlier or later than the current moment in the story, the main verb phrase of os must be in the simple past. Also, to be about a specific action, os cannot be habitual. So, the main verb phrase cannot be accompanied by an adverbial such as at times, usually, rarely, or on weekends. 3 Finally, to be about an action that actually occurs, the main clause of the sentence must not contain modal auxiliary verbs such as could, going to, had better, have to, might, should, or must, modal adverbs such as likely, maybe, perhaps, or possibly, and it must not be negated. If the action is quoted speech, then these restrictions apply to the discourse parenthetical.","Now we turn to the last active character. In contexti, LAST-ACT1VE-CHARACTER-OF(contexti) is the empty set if no sentences with active characters have appeared; otherwise, it is the active character of the last sentence that had one.","The last active character is an expected subjective character only when a subjective sentence has not appeared earlier in the current paragraph, and there is an earlier sentence in the current paragraph that has an active character. That is, LAST-ACTIVE-CHARACTER-IS-AN-EXPECTED-SC (contexti) is true iff TEXT-SITUATION-OF(contexti) E {presubjective-active, postsubjective-active }. 8.2.3 When There Are Two Expected Subjective Characters. When the last active character and the last subjective character are both expected subjective characters (which, as the reader may have noticed, is when the current text situation is post-subjective-active), the algorithm chooses the last active character in most cases, since he or she is more highly focused by the text. In fact, there is only one case in which the algorithm chooses the last subjective character: when the sentence is about the last active character (specifically, when the last active character is the experiencer or actor of the state of affairs chosen for consideration). Following is the algorithm for function CHOOSE-AN-EXPECTED-SC introduced in Section 8.1 above. The only new function is EXPERIENCER-OR-ACTOR-OF, which maps a state of affairs soa and a feature set f into 3 The fact that a sentence r is habitual is part of FEATURES(r). The system demonstrated in Appendix B relies on adverbials to decide whether or not a sentence is habitual. However, an adverbial is not necessary for a simple-past narrative sentence to be habitual. 250 Janyce M. Wiebe Tracking Point of View in Narrative the actor or experiencer of"]},{"title":"soa","paragraphs":["(if"]},{"title":"soa","paragraphs":["or its actor or experiencer is not in f, the result is the empty set). CHOOSE-AN-EXPECTED-SC(featureSet,"]},{"title":"context)","paragraphs":["if EXPERIENCER-OR-ACTOR-OF (CHOSEN-STATE-OF-AFFAIRS"]},{"title":"~eatureSet),featureSet)","paragraphs":["= LAST-ACTIVE-CHARACTER-OF"]},{"title":"(context) then return","paragraphs":["LAST-SC-OF"]},{"title":"(context)","paragraphs":["else return LAST-ACTIVE-CHARACTER-OF"]},{"title":"(context) end","paragraphs":["if The criterion for choosing the last subjective character is correct for the situation in which the last"]},{"title":"subjective","paragraphs":["character's attention is directed toward the last"]},{"title":"active","paragraphs":["character, and the sentence represents the last"]},{"title":"subjective","paragraphs":["character's reflection about or observation of the other. It is incorrect, however, if the sentence is the last"]},{"title":"active","paragraphs":["character's self-reflection or self-perception; this heuristic relies on the relative infrequency of subjective sentences about oneself.","Consider subjective sentence (15.11). When this sentence is encountered, only the last subjective character (Zoe) is expected, because the sentence is at the beginning of a new paragraph. The algorithm correctly identifies her to be the subjective character. Now consider (17.9), which is also subjective. When it is encountered, not only is the last subjective character expected (Jake), but so is the last active character (Augustus): Augustus is the active character of (17.7)-(17.8), because he has been the SC of previous subjective sentences and (17.7)-(17.8) are objective sentences about his current actions; and, when (17.9) is encountered, the last active character is expected, since (17.8) (but no subjective sentences) appeared earlier in the current paragraph. The algorithm correctly identifies the SC to be Augustus (the last active character), rather than Jake (the last subjective character), because the criterion for choosing the last"]},{"title":"subjective","paragraphs":["character is not satisfied: the sentence is not about the last active character. Competition also arises in the following passage, but this time it is the last subjective character who should be chosen. When the passage is encountered, Lorena is the last subjective character: (18)","ls'l\"I never tolt on you, Lorie,\" he [Lippy] said. 18'2He looked like he might cry too. 183you'll just have to cry, she [Lorena] thought. [McMurtry,"]},{"title":"Lonesome Dove,","paragraphs":["p. 218] By this point in the novel, Lippy has been a subjective character. Thus, since (18.1) is about his current action, he is the active character of (18.1). After (18.1), Lippy, as the last active character, is expected, because (18.1) is an objective sentence that begins a new paragraph. Sentence (18.2) is subjective because the evidential 'looked like' appears. Competition is (correctly) resolved in favor of the last subjective character (Lorena), because the sentence is about the last active character (Lippy). 8.2.4 When There Are No Expected Subjective Characters. If no character is expected, then the algorithm fails to identify the SC at this point in the text. This eventuality is rare, relative to others: it can arise only upon the first subjective sentence of a scene (otherwise, the last subjective character would be expected) and only in the absence of one of the things that are usually used to initiate a character's point of view (such as 251 Computational Linguistics Volume 20, Number 2 a narrative parenthetical or private-state report, discussed in Section 8.3). An example of this is (16.6), and another is (19.1), which is the beginning of a novel: (19)","19\"1Captain Scalawag's treasure! 19\"2It was the first thing Pete thought of when he woke up. [Lorimer,"]},{"title":"The Mystery of the Missing Treasure,","paragraphs":["p. 1] In a case such as (19.1), it is not possible to identify the SC without reading further in the text. In a case such as (16.6), however, it might be possible to do so. That is, a reader might be able to infer who the SC is from clues in the sentence, such as indications of place, or facts that only a certain character knows. This process is not addressed in this work. However, the author could have made identifying the SC easier by using, for example, a narrative parenthetical or private-state report (see Section 8.3); by not including one of these, the author is deliberately demanding some extra work from the reader.","The algorithm as presented in Wiebe (1990) can identify the SC after later sentences are processed in the case where a later sentence contains a narrative parenthetical or is a private-state report. As illustrations, (16.7) is a private-state report whose SC, Mona, is the SC of (16.6), and (19.2) is a private-state report whose SC, Pete, is the SC of (19.1). 8.3 Identifying the SC from the Sentence We now turn to cases in which the SC is identifiable from the sentence itself (that is, cases in which"]},{"title":"IDENTIFY-SC-FROM-THE-SENTENCE(featureSet, context) ~","paragraphs":["{}; see Section 8.1). In these cases, the SC of sentence s is chosen from among certain characters in FEATURES(s). Such a character need not be the last subjective character; when she is not, s initiates her POV. Thus, the cases discussed in this section--i.e., uses of sentences with certain features in particular contexts--are ways to initiate a character's POV.","The straightforward case is when s contains a narrative parenthetical, such as sentence (2). The SC is always the subject of the parenthetical.","The less straightforward case is when s is a private-state sentence. Dole~el (1973), Cohn (1978), and Banfield (1982) all note that a private-state sentence is a way to initiate a character's POV. In the framework presented in this paper, the SC may be the experiencer of the private state, even if she is not the last subjective character. An example occurs in (20):","(20) 2°a\"Drown me?\" Augustus said."]},{"title":"2°'2\"Why","paragraphs":["if anybody had tried it, those girls would have clawed them to shreds.\" 2°'3He knew Call was mad, 2°'4but wasn't much inclined to humor him. 2°'5It was his dinner table as much as Call's, 2°'6and if Call didn't like the conversation he could go to bed."]},{"title":"2°'7Call","paragraphs":["knew there was no point in arguing. 2°'8That was what Augustus wanted: argument. 2°9He didn't really care what the question was, 2°'1°and it made no great difference to him which side he was on. 2°'nHe just plain loved to argue. [McMurtry,"]},{"title":"Lonesome Dove,","paragraphs":["p. 16] Sentences (20.3)-(20.6) are Augustus's subjective sentences and (20.7)-(20.11) are Call's. Thus, (20.7) initiates a new POV. It is a private-state sentence and the SC, Call, is the experiencer of the private state. But passage (20) also shows that the SC of a private-252 Janyce M. Wiebe Tracking Point of View in Narrative state sentence need not be the experiencer. In (20.6), for example, \"Call didn't like the conversation\" is about a private state (Call not liking the conversation), but the SC of the sentence is Augustus, not Call. In the following subsections, we will consider factors that can indicate that it is"]},{"title":"not","paragraphs":["the experiencer who is the SC of a private-state sentence. 8.3.1 Textual Continuity. POV does not typically shift from one character to another without a paragraph break. Thus, the absence of a paragraph break suggests that a shift has not occurred. Consider the following schema, in which a subjective sentence S, whose SC is X, is followed, without a paragraph break, by a private-state sentence P whose experiencer is a different character Y:","¶ sentence* subjective-sentence-S private-state-sentence-P SC = X experiencer = Y Character Y is the experiencer of the private state that P is about. If Y were also the SC of P, then a shift would have occurred, from X's POV to Y's POV, without a paragraph break. The fact that no paragraph break appears--that is, that P is in the continuing-subjective situation--suggests that P continues X's POV rather than initiating Y's. When a private-state sentence appears in the continuing-subjective situation, therefore, the algorithm identifies the SC to be the last SC rather than the experiencer of the private state.","The question of whether there is a psychological link between paragraph breaks and tracking POV has not been previously investigated. Stark (1987, 1988) performed psychological experiments that showed that there is a significant correlation between paragraph breaks and discourse discontinuities, but the sorts of discontinuities she investigated did not include changes in POV. Nakhimovsky and Rapaport (1988) suggest that in narrative, paragraph breaks accompany changes in POV, but they did not investigate this hypothesis experimentally. In fact, we have performed psychological experiments (Bruder and Wiebe 1990 and in press) that did establish such a link. Specifically, through manipulation of paragraph breaks in naturally occurring passages, the experiments showed that readers' interpretations of private-state sentences are influenced by paragraph breaks as we predicted on the basis of the algorithm. 8.3.2 Subjective Elements. Private-state sentences are pragmatically ambiguous as to whether they are private-state reports or represented thoughts. 4 Consider sentence"]},{"title":"(21):","paragraphs":["(21) John knew Mary had the key. Sentence (21) is about a private state: \"John knew Mary had the key.\""]},{"title":"ps(pl,experiencerl, attitude1, objectl)","paragraphs":["4 A private-state sentence may also be objective. An example is a simple-past sentence with a negated factive term and a propositional object, such as \"John did not know that Mary was in the next room.\" This sentence cannot be John's subjective sentence; it is either objective or the subjective sentence of someone else. Because of space limitations, how the algorithm recognizes and processes such sentences is not discussed in this paper; see Wiebe and Rapaport (1988) and Wiebe (1990). 253 Computational Linguistics Volume 20, Number 2 Under a private-state"]},{"title":"report","paragraphs":["interpretation of (21), pl is not itself the object of some other private state. But under a represented thought interpretation of (21), pl"]},{"title":"is","paragraphs":["the object of some other private state"]},{"title":"P2,","paragraphs":["the experiencer and attitude of which are implicit:"]},{"title":"ps","paragraphs":["(P2,"]},{"title":"experiencer2, attitude2,","paragraphs":["\"John knew Mary had the key.\""]},{"title":"object2 = pl )","paragraphs":["To my knowledge, this ambiguity in the interpretation of private-state sentences and its importance in tracking POV have not been previously discussed in linguistics or literary theory. For example, Cohn (1978) says that represented thoughts can be distinguished from private-state reports by \"the absence of mental verbs\" in the former (p. 104).","The SC of a private-state report is always the experiencer of the private state. So, if some oracle were to inform you that (21) is a private-state report, you would then know that the SC is the experiencer of the private state (John). On the other hand, if the oracle were to inform you that (21) is a represented thought, you could not then identify the SC just by looking at the sentence alone. In fact, it is true of any represented thought without a narrative parenthetical, private-state sentence or otherwise, that you cannot identify the SC from the sentence itself. This is so regardless of whether or not the SC happens to be referred to in the sentence. Consider the following two sentences, which are represented thoughts from different pages of a short story (\"The Garden Party\" by Katharine Mansfield): (22) Why couldn't she? (23) What nice eyes he had, small, but such a dark blue! As these sentences appear in the story, the SC of (22) happens to be the referent of \"she\" (corresponding to the conversational utterance, \"Why can't I?'), but the SC of (23) is not mentioned in the sentence at all. Even though you know that (22) and (23) are represented thoughts, you need to consider the context to identify their SCs. Thus, if a private-state sentence s contains some indication that s is a represented thought, then the SC cannot be identified from s itself, and, as discussed in Section 8.2, the expected subjective characters should be considered.","Subjective elements indicate that a sentence is a represented thought (this statement is qualified later in this section and in Section 10). Subjective elements are linguistic elements that express emotions, uncertainty, evaluations, and other kinds of subjectivity (Banfield 1982) (they are discussed in detail in Section 9). Examples are evaluative terms such as 'the old bag' (Banfield 1982) and evidentials such as 'evidently' and 'apparently' (Dole~el 1973).","In the following passage, a subjective element indicates that the SC of a private-state sentence is not the experiencer of the private state. At the start of the passage, Sandy and Dennys are (collectively) the last subjective character: (24)","24\"1Japheth, evidently realizing that they were no longer behind him, turned around 242and jogged back toward them, seemingly cool and unwinded. [UEngle,"]},{"title":"Many Waters,","paragraphs":["p. 24] The subjective element 'evidently' in (24.1) indicates that the sentence is"]},{"title":"not","paragraphs":["a private-state report. That is, (24.1) is not a report that Japheth realizes that they are no longer 254 Janyce M. Wiebe Tracking Point of View in Narrative behind him. Rather, Sandy and Dennys (the collective SC) ascribe this private state to him.","However,"]},{"title":"subordinated","paragraphs":["subjective elements, those within the scope of the private-state term, can appear in private-state reports. (This is one reason why I define private-state reports to be subjective.) Thus, they cannot be used to distinguish private-state reports from represented thoughts, and so cannot be used as evidence that the SC of a private-state sentence is not the experiencer. For example:","(25) 25'1Ugh! she [the girl] thought."]},{"title":"25\"2How","paragraphs":["could the poor thing have married him in the first place?","25\"3johnnie Martin could not believe that he was seeing that old bag's black eyes sparkling with disgust and unsheathed contempt at him. [Caldwell, No One Hears But Him, pp. 98-99] Sentence (25.3) is a private-state report and the experiencer is the SC (Johnnie Martin); this is so even though (25.3) contains the subjective element 'old bag' and even though there is an expected subjective character (the girl) when it is encountered. Because 'old bag' appears within the scope of the private-state term 'believe,' it is not considered in identifying the SC. On the other hand, the subjective element 'evidently' in (24.1) is not in the scope of 'realizing' (i.e., it is nonsubordinated); thus, it can be used as evidence that the SC is not the experiencer of the private state.","If a private-state sentence does not have a nonsubordinated subjective element and does not appear in the continuing-subjective situation, then the algorithm identifies the SC to be the experiencer. 8.3.3"]},{"title":"Broadening and Narrowing","paragraphs":["of POV. Recall that an experiencer, actor, SC, or expected subjective character may be more than one physical character (recall that these entities are represented as sets). A"]},{"title":"broadening","paragraphs":["of point of view occurs when a new subjective character is a superset of the old subjective character, and a"]},{"title":"narrowing","paragraphs":["occurs when a new one is a subset of the old one. One situation in which such changes occur is when the experiencer of a private-state report is such a subset or superset. One addition to the algorithm as described so far is needed to allow for this situation: for a private-state sentence in the continuing-subjective situation (without subjective elements that can be considered), if the experiencer is a superset or subset of the last subjective character, then it is the experiencer who the algorithm chooses to be the SC, rather than the last subjective character. For example: (26)"]},{"title":"26\"1In","paragraphs":["the clear late afternoon light they [Call and Augustus] could see all the way back to Lonesome Dove and the river and Mexico. 26\"2Augustus regretted not tying a jug to his saddle---~63he would have liked to sit on the little hill and drink for an hour. [McMurtry, Lonesome Dove, p. 241] As this passage appears in the novel, (26.1) is the subjective sentence of both Call and Augustus, but (26.2) is the subjective sentence only of Augustus; thus, point of view narrows upon (26.2). The above rule precludes the reading of a sentence such as (26.2) as the represented thought of the last subjective character (i.e., Call and Augustus in passage (26)). However, no examples of such a reading were found in the texts examined; note that the rule applies only if there are no subjective elements that can be considered in the sentence. 255 Computational Linguistics Volume 20, Number 2 8.3.4 Unspecified Experiencers. Consider the following passage: (27) 27'lFor the first time in his life, Sandy had a flash of gratitude that Dennys was not with him.","27'2Then anxiety surfaced. 27\"3\"Deunys--\" [UEngle,"]},{"title":"Many Waters,","paragraphs":["p. 91 Sentence (27.2) is a private-state sentence; specifically, CHOSEN-STATE-OF-AFFAIRS(FEATURES (27.2)) ="]},{"title":"ps,","paragraphs":["where"]},{"title":"ps","paragraphs":["is the private state that the private-state noun \"anxiety\" is about (see Section 6.3.3). Both the experiencer of"]},{"title":"ps","paragraphs":["and the SC of (27.2) happen to be the same character (Sandy). However, the SC of (27.2) cannot be identified from the sentence itself, because the experiencer of"]},{"title":"ps","paragraphs":["is not mentioned in the sentence. (I call such experiencers unspecified experiencers; note that EXPERIENCER-OR-ACTOR-OF(ps,FEATURES(27.2)) = {}.) Thus, for a private-state sentence with an unspecified experiencer, IDENTIFY-SC-FROM-THE-SENTENCE returns the empty set, and the algorithm goes on to consider expected subjective characters. In (27), for example, the algorithm correctly identifies the SC of (27.2) to be Sandy, the last subjective character. 8.3.5 Summary. Following is the algorithm for function IDENTIFY-SC-FROM-THE-SENTENCE (introduced in Section 8.1). One of the arguments is a feature set,"]},{"title":"featureSet;","paragraphs":["we will use s to refer to the sentence"]},{"title":"thatfeatureSet","paragraphs":["is a feature set of (i.e., FEATURES(S) ="]},{"title":"featureSet).","paragraphs":["With the exception of calls to previously mentioned functions, statements are given in English. Further, two cases discussed later (in Sections 10 and 11) are not included (the complete version is given in Appendix A). IDENTIFY-SC-FROM-THE-SENTENCE"]},{"title":"(featureSet, context) soa ~","paragraphs":["CHOSEN-STATE-OF-AFFAIRS"]},{"title":"(featureSet)","paragraphs":["if s contains a narrative parenthetical then","return the subject of the narrative parenthetical else if"]},{"title":"1 (soa","paragraphs":["is a private state ) and 2 % not an unspecified experiencer"]},{"title":"(EXPERIENCER-OR-ACTOR-OF(soa, featureSet) #","paragraphs":["{}) and 3 (There are no nonsubordinated subjective elements in the sentence) and 4: (a)"]},{"title":"((TEXT-SITUATION-OF(context) #","paragraphs":["continuing-subjective) or"]},{"title":"(b):","paragraphs":["(i)"]},{"title":"((TEXT-SITUATION-OF(context)","paragraphs":["= continuing-subjective) and","(ii): % broadening or narrowing of POV (1)"]},{"title":"( (EXPERIENCER-OR-ACTOR-OF(soa) C","paragraphs":["LAST-SC-OF"]},{"title":"(context) or","paragraphs":["(2) (EXPERIENCER-OR-ACTOR-OF"]},{"title":"(soa) D","paragraphs":["LAST-SC-OF"]},{"title":"(context)))) then return EXPERIENCER-OR-ACTOR-OF(soa) else return","paragraphs":["{} end if","end if 256 Janyce M. Wiebe Tracking Point of View in Narrative"]},{"title":"9. Recognizing Subjective Sentences 9.1 Introduction","paragraphs":["We now turn to deciding whether or not a sentence is subjective in the first place. Authors could unambiguously mark each subjective sentence as subjective, by including a narrative parenthetical in each, for example. But suppose that a sentence S that the author intends to be subjective appears in the continuing-subjective situation:","(i) ¶ sentence\" subjective-sentence sentence-S sentence * ¶ SC = X A character's POV very often continues at least until the end of the paragraph. So, in schema (i), S and any sentences after S until the paragraph break will very often be subjective sentences of X. Thus, the reader has a strong expectation that X's POV will continue, so a weak hint that S is subjective is sufficient for the reader to recognize that it is.","Now consider a text situation in which there has been a subjective sentence in the scene, but objective sentences and paragraph breaks have appeared since then:"]},{"title":"(ii)","paragraphs":["start-of-scene ... subjective-sentence (objective-sentence + ¶)+ sentence-S SC = X In S's context in schema f/i), X is an expected subjective character. The reader expects X's POV to be resumed, but not as strongly as the reader expects X's POV to be continued in schema (i), since the local context of"]},{"title":"S in (ii)","paragraphs":["is not subjective as it is in (i). An unambiguous indication that S is subjective is not necessary, but a stronger hint should be included than is sufficient in (i).","The main sorts of \"hints\" of subjectivity that the algorithm considers are linguistic elements that potentially express subjectivity"]},{"title":"(potential subjective elements).","paragraphs":["Some of these are weaker hints than others, and many are usually subjective only in certain text situations. The algorithm, which, recall, tracks point of view on the basis of regularities, uses the text situation to decide whether an instance of one is indeed subjective.","\"Subjective element\" is the term I use for an instance of a potential subjective element that actually is subjective in the context of use. This term is borrowed from Banfield (1982), but redefined; Banfield uses it to refer only to linguistic elements that are"]},{"title":"always","paragraphs":["subjective.","Section 9.2 identifies a number of potential subjective elements, and Section 9.3","specifies how the algorithm uses them and other information to recognize subjective","sentences."]},{"title":"9.2 Potential Subjective Elements","paragraphs":["Previous work in linguistics and literary theory noted the presence in subjective sentences of many (but not all) of the potential subjective elements considered by the algorithm. However, with the exception of two of the elements, the perfective and progressive aspects (see below), previous work did not address the problem that many of the elements are only potentially subjective, and can also appear in objective sentences. Further, Wiebe (1990) contains an extensive, detailed catalogue of the potential subjective elements (specified mainly in terms of syntactic and semantic categories presented in Quirk et al. [1985]); such a catalog did not previously exist.","Most of the potential subjective elements are lexical. But it is not words and phrases themselves that are potential subjective elements, but rather words and phrases used 257 Computational Linguistics Volume 20, Number 2 Table 2 Some potential subjective elements. 1 Exclamations, such as (25.1), and direct questions, such as (25.2)","2 Elements that express evaluation or judgement 2.1 Adjectives such as 'awful' in (4.6) and 'poor' in (25.2) 2.2 Nouns such as 'old bag' in (25.3) 2.3 Adverbs such as \"oddly' and 'incredibly' 2.4 Auxiliary verbs and phrases that express judgments of obligation, such as","'had better', 'ought to', 'should', and 'be supposed to' 2.5 Adverbs such as 'scarcely' and 'hardly' (when used as minimizer subjuncts","(Quirk et al. 1985)), as in \"She could hardly be expected to live there\"","3 Elements that express a lack of knowledge 3.1 Subordinators such as 'whoever' and 'whatever', when used in reference to","particular individuals, as in \"Whatever it was, it had flown by quickly\" 3.2 Adjectival phrases such as 'some kind of', when used in reference to particular","individuals, as in \"The object in her hand was some kind of weapon\" with particular meanings. For example, 'poor' is a potential subjective element only with its evaluative meaning, as in \"Poor John was sick,\" but not with its nonevaluative meaning, as in \"John was poor\" (Banfield 1982; the evaluative meaning of 'poor' is one of the elements that Banfield argues is always subjective).","Tables 2 and 3 list some potential subjective elements, giving very brief characterizations. For further details, see Wiebe (1990). All of the citations in Tables 2 and 3 are with respect to the linguistic categories of the elements. Some of those who discuss the appearance of the elements in subjective sentences are as follows: Banfield (1982) discusses (1), (2.1)-(2.3), (4), (5), and (12); Dole~el (1973) discusses (1), (2.1)-(2.3), (5), (6.1), (6.2), and (8); Brinton (1980) discusses (9) (she shows that a simile can be a marker of represented perception) and (12); Ehrlich (1990) discusses (11), and Ehrlich (1987) discusses (12).","The past perfective is potentially subjective simply because a character can reflect on what occurred (or might have occurred) in the past. However, as discussed by Ehrlich (1990) and many others, the narrative past may be expressed by the simple-past tense in the midst of a subjective context; detecting simple-past references to the past is not addressed in this work. 9.3 Recognizing Subjective Sentences Subjective elements are important for recognizing represented thoughts and perceptions, not private-state reports (recall, in fact, that a nonsubordinated subjective element is evidence that a private-state sentence is not a report). That is, they are important for recognizing subjective sentences whose subjective characters are to be identified from the context, rather than from the sentence itself.","My examination of novels and short stories suggests the following (we are currently performing psychological experiments investigating the aspects of the algorithm discussed in this section): (1) Two potential subjective elements, the past perfective and 258 Janyce M. Wiebe Tracking Point of View in Narrative Table 3 Some potential subjective elements (continued). 4 Sentence fragments, such as (30.6) 5 Kinship terms, such as 'Dad' and 'Aunt Margaret'","6 Evidentials, which, in the broadest sense, qualify the information conveyed by a statement (Chafe 1986)","6.1 Evidentials that express certainty or uncertainty, such as 'surely' and 'might'","6.2 Evidentials that express certainty or uncertainty and also that one's knowledge is based partly on evidence. Examples are 'evidently', 'seemingly', 'must have', 'appear to be', 'as if', 'as though', and 'look', as in \"He looked like he might cry\"","6.3 Hedges, e.g., adverbs such as 'more or less' and 'sort of' when used as modifiers of adjectives and adverbs, as in \"It was more or less green\", or as adverbials (Quirk et al. 1985), as in \"The man more or less held a large stretch of the border\"","6.4 Evidentials that address expectations 6.4.1 Signal that expectations have been met, such as 'of course' (when used as","an emphasizer subjunct (Quirk et al. 1985)) as in \"John of course sat down\" 6.4.2 Signal that expectations have not been met. Examples are adverbs such as","'just', 'merely', and 'only' (when used as attitude diminishers","(Quirk et al. 1985)), as in \"He just sat and drank\" (it was expected that","he would do something \"more\" than sit and drink)","7 Adverbials that are conjuncts, which connect units of discourse (Quirk et al. 1985) (i.e., cue phrases; Reichman 1985, Grosz and Sidner 1986, Cohen 1987). Examples are 'first', 'in addition', 'for instance', 'on the other hand', 'after all', 'anyway', and 'yet' as in \"Yet, they were the pride of the family\" 8 Conditional clauses 9 Comparative 'like', as in \"They followed her like acolytes behind a goddess\" 10 Habitual sentences, such as \"Gus himself often joked about it\" 11 The past perfective, but only in the main verb phrase 12 The progressive, but only in the main verb phrase the progressive, can typically serve only to continue a character's POV and only within a paragraph (see Ehrlich [1987] for an analysis of why this is so for the progressive); (2) stronger ones can continue a character's POV after a paragraph break, or resume a character's POV within a paragraph; (3) still stronger ones, such as evidentials and sentence fragments, can resume the last subjective character's POV or initiate the last active character's just as long as they are expected subjective characters; and (4) the strongest subjective elements, such as exclamations and questions, are always subjective, even when there is not an expected subjective character to whom to attribute the 259 Computational Linguistics Volume 20, Number 2 sentence. The sets of text situations corresponding to (1)-(4) are:"]},{"title":"lts","paragraphs":["2ts 3ts"]},{"title":"4ts","paragraphs":["{continuing-subjective} {broken-subjective, interrupted-subjective} {presubjective-active, postsubjective-nonactive, postsubjective-active} {presubjective-nonactive} Expectations for a subjective sentence are strongest in situation (lts) and weakest in situation (4ts), so the algorithm takes even the weakest potential subjective elements to be subjective in (lts), but only the strongest ones to be subjective in (4ts). In general, each potential subjective element pse is associated with a set of text situations t such that the algorithm interprets pse to be subjective iff the current text situation is in t. There is an its (1 < i < 4) such that t contains the situations in lts through its but not those in its + 1 through 4ts. We shall say that pse is associated at the highest level with the situations in its.","In addition to potential subjective elements, there is another source of information the algorithm considers: the type of state of affairs the sentence is about. First, private-state action sentences can be subjective; see Section 11. Second, private-state sentences are usually subjective (we are not considering objective private-state sentences in this paper; see Wiebe [1990] and footnote 4). Third, a nonprivate-state sentence in the continuing-subjective situation usually continues the subjective context. For example: (28)","28.1Lorena didn't like it that Gus acted like Jake wasn't much. 282He had a reputation for being a cool man in a fight. [McMurtry, Lonesome Dove, p. 190] Sentence (28.1) is Lorena's subjective sentence, and (28.2), a nonprivate-state sentence, continues her subjective context. In the continuing-subjective situation, therefore, the algorithm interprets a nonprivate-state sentence to be subjective) 9.4 Examples and Discussion Consider the following passage: (29) 29\"1Call had heard from someone that she had been raised rich, in the East, with servants to comb her hair and help her into her shoes when she got up. 29'2It might just have been a story--293it was hard for him to imagine a grownup who would need to be helped into their own shoes--39\"4but if even part of it was true she had come a long way down. 29\"5Ned Spettle had never got around to putting a floor in the 5 Notice that there are three things that are taken as evidence that a sentence is subjective only in the continuing-subjective situation: being a nonprivate-state sentence, being in the perfective, and being in the progressive. Caenepeel (1989), in work done simultaneously, analyzed aspect and perspective linguistically, and reached similar conclusions with respect to these three types of evidence. Caenepeel suggests that states appearing in what I call the continuing-subjective situation continue the current POV. Her notion of state includes sentences in the perfective and progressive aspects, regardless of the type of state of affairs that the sentence is about. It might be desirable to revise this aspect of the algorithm on the basis of her work, which focused on aspect, to arrive at a more general treatment of these three kinds of evidence in this situation. 260 Janyce M. Wiebe Tracking Point of View in Narrative shack of a house he built. 29\"6His wife was rearing eight children on the bare dirt."]},{"title":"29'7He","paragraphs":["had heard it said that Ned had never got over the war, which might have explained it. [McMurtry, Lonesome Dove, p. 176] All of these sentences are Call's subjective sentences. Thus, the text situation is continuing-subjective after each of them. Sentences (29.1), (29.3), and (29.7) are Call's private-state reports, and (29.2) and (29.4) contain potential subjective elements that are associated with other situations--and not merely the continuing-subjective one ('might' in (29.2) and 'if even' in (29.4)). The interesting sentences are (29.5) and (29.6), since they contain potential subjective elements that are associated only with the continuing-subjective situation (the past perfective in (29.5) and the progressive in (29.6)). (These sentences express Call's reasons for his belief, expressed in (29.4), that \"she had come a long way down.\")","In the following passage, a subjective element appears in a situation other than continuing-subjective. The situation is continuing-subjective at the beginning, and Sandy is the last subjective character. (30) 3°'1The eyes were an incredibly bright blue, like the sea with sunlight touching the waves.","3°2Lemech greeted him respectfully. 3°'3\"Adnarel, we thank you.\" 3°'4Then he said to Sandy, \"The seraph will be able to help you. Seraphim know much about healing.\"","3°SSo this was a seraph. 3°'6Tall, even taller than the twins. [UEngle, Many Waters, p. 39] Sentence (30.1) continues Sandy's subjective context, because it contains the subjective elements 'incredibly' and comparative 'like.' Sentences (30.2)-(30.4) are objective, and a paragraph break appears before (30.5), so the situation at the beginning of (30.5) is postsubjective-nonactive (one of the situations in (3ts)) and the last subjective character, Sandy, is an expected subjective character. The algorithm is able to recognize that (30.5) is Sandy's subjective sentence, because it contains 'so' used as a conjunct, which is subjective as long as there is an expected subjective character.","Consider passage (19) (reprinted here); recall that it is the beginning of a novel, so there isn't an expected subjective character when it is encountered. (19) 19\"1Captain Scalawag's treasure! 192It was the first thing Pete thought of when he woke up. [Lorimer, The Mystery of the Missing Treasure, p. 1] Since an exclamation is subjective in any situation, the algorithm is able to recognize that (19.1) is subjective.","In the following passage, in contrast, potential subjective elements that are not necessarily subjective appear when there isn't an expected subjective character. This passage is of the type that Banfield has characterized as having an empty center (Banfield 1987); 6 it describes perceptions and impressions that one would have if observing 6 Banfield (1987) extends the definition of subjective sentences given in Banfield (1982) to include these kinds of sentences; our interest is to recognize character's subjective sentences (for the reasons given in Section 3), so we adopt the earlier definition. 261 Computational Linguistics Volume 20, Number 2 the scene, but no character is present to whom to attribute them. There is an expected subjective character at the beginning of the passage, but a scene break appears after the third sentence. (The blank lines after (31.3) and (31.12) appear in the original. The sentences following '--' are a kind of unuttered quoted speech.)","(31) 31\"l\"We're coming,\" Oholibamah said."]},{"title":"31\"2arid","paragraphs":["they hurried toward the central section of the oasis, where Noah's vineyards were, and his grazing grounds, and his tents."]},{"title":"31'3And","paragraphs":["where Dennys was waiting for them.","314The moon set, its path whiter than the desert sands dwindling into shadow. 31SThe stars moved in their joyous dance across the sky. 31\"6The horizon was dark with that deep darkness which comes just before the dawn."]},{"title":"31\"7A","paragraphs":["vulture flew down, seemingly out of nowhere, stretching its naked neck, settling its dark features.","31'B--Vultures are underestimated. Without us, disease would wipe out all life. We clean up garbage, feces, dead bodies of man and beast. We are not appreciated."]},{"title":"31'9No","paragraphs":["sound was heard 3H°and yet the words seemed scratched upon the air."]},{"title":"3111The","paragraphs":["twelve oddly assorted creatt~es began to position themselves","into a circle. 31\"12The nephilim.","31'13Oholibamah lay in Japheth's arms on a large, flat stone a short walk into the desert. [UEngle,"]},{"title":"Many Waters,","paragraphs":["pp. 118-119] There are scene breaks after (31.3) and after (31.12). Between the breaks, there are no private-state sentences or narrative parentheticals, and, since none of the creatures in the scene has been the SC, there are no sentences with active characters (this is true for the elided sentences as well). Thus, if none of the potential subjective elements are subjective, then there are no expected subjective characters from (31.4) to (31.12). There are strong potential subjective elements that would be subjective if there were an expected subjective character--'seemingly' in (31.7), 'sound' in (31.9), 'yet' used as a conjunct and 'seemed' in (31.10), 'oddly' in (31.11), and a sentence fragment in (31.12). However, since these are associated at the highest level with the situations in"]},{"title":"(3ts),","paragraphs":["and not with the presubjective-nonactive situation, the algorithm correctly does not interpret them to be subjective.","There are three things to note about passages such as (31). First, the potential for an overt narrator to appear is strong when there isn't an expected subjective character and a strong element such as 'seemingly' appears; my restriction to texts that do not have overt narrators allows the algorithm to exclude this possibility from consideration. Second, the algorithm does not revise its decision as to whether a sentence is subjective in light of later sentences. However, one could imagine a sentence within passage (31) that might cause the reader to decide that earlier sentences were actually subjective. For example, the following sentence, inserted after (31.10), would suggest this: \"Dennys was mystified by the spectacle.\" The algorithm would interpret this sentence to be 262 Janyce M. Wiebe Tracking Point of View in Narrative subjective; this would affect its interpretation of the"]},{"title":"remainder","paragraphs":["of the passage--the algorithm would interpret the potential subjective elements in (31.11) and (31.12) to be subjective--but it would not affect its interpretation of earlier sentences. Third, to be conservative, only Banfield's emotive and evaluative subjective elements, which must be understood to express someone's emotions or evaluations, are associated with the presubjective-nonactive situation (4ts). As mentioned in Section 8.2.4, the number of sentences that appear in this situation is relatively small, and, of those that do, many are private-state reports or have narrative parentheticals. It may be that some of the potential subjective elements associated at the highest level with the situations in (3ts) should also be associated with the one in (4ts); the appearance of the relevant kind of subjective sentence in this situation was too rare in the texts examined to decide this.","Because there are 34 classes of potential subjective elements, the majority of which have multiple members (Wiebe 1990), a significant number of each potential subjective element in each situation was not found. The association of elements with text situations is based on the examples that were found, and, for the ones that did not appear very often in the texts examined, on my judgments as to which of the ones that did appear often are closest to them in strength. Psychological experiments (with Gail Bruder) of this aspect of the algorithm are underway. We plan to revise the association of potential subjective elements with text situations as needed in light of the results."]},{"title":"9.5 Quoted Speech","paragraphs":["In quoted speech, there are two points of view: the point of view taken by the quoted string--the speaker's--and the one taken by the discourse parenthetical, which may be objective or a character's. 7 It is the point of view taken by the discourse parenthetical that concerns us here: the speaker's point of view is not directly presented by a quoted string, as the subjective character's is by a subjective sentence, but is conveyed indirectly through a communicative act. Quoted speech is a major way of communicating the beliefs, intentions, etc., of characters who are not to become the SC; merely the fact that what a character says expresses her point of view should not lead the reader to anticipate later subjective sentences of that character, as the reader does after a subjective sentence.","Therefore, the algorithm considers subjective elements that appear in discourse parentheticals, but not those within quoted strings. For example: (32) \"I'll talk to Amy,\" Daddy said, \"and make sure she behaves herself.\" [Sachs,"]},{"title":"Amy and Laura,","paragraphs":["p. 100] The subjective element 'Daddy' in the discourse parenthetical is attributed to an expected subjective character, Laura. In contrast, the algorithm interprets the following sentence from passage (20) to be objective, even though there is a question in the quoted string: \"Drown me?\" Augustus said. 7 See Banfield (1982) for a principled account of the relationship between the points of view of a quoted string and its discourse parenthetical. 263 Computational Linguistics Volume 20, Number 2 10. A Return to Private-State Sentences In contrast to what was implied in Section 8.3.2, there are some subjective elements that do not suggest that a private-state sentence is a represented thought, even when they are nonsubordinated. First, Cohn (1978) shows that private-state reports 8 do not always report private states experienced specifically at the current moment in the story, but instead have \"almost unlimited temporal flexibility\" (p. 34). One consequence of this is that private-state reports can be habitual. Second, Cohn (1978) also shows that private-state reports can employ simile. 9 Thus, comparative 'like' can appear nonsubordinated in private-state reports. For example: (33) His [Sandy's] head began to swell, to be filled with hot air like a balloon, so that he was afraid he was going to float off into the sky. [UEngle,"]},{"title":"Many Waters,","paragraphs":["p. 27] Finally, some intensifier adverbs, when nonsubordinated in a private-state report, simply indicate the degree to which the private state is experienced. An example is 'hardly,' as in: (34) Sandy, his flannel shift still draped over his head, was hardly aware that he was supporting his brother. [UEngle,"]},{"title":"Many Waters,","paragraphs":["p. 27] Sentence (34), as it appears in the novel, is Sandy's private-state report.","Given these observations, we need to revise the algorithm as presented so far: the algorithm does not consider the above types of subjective elements when it decides who the SC of a private-state sentence is, even when they are nonsubordinated to the private-state term. 11. Private-State-Action Sentences A private-state action is an action from which a private state can be inferred. Examples are looking, glancing, sighing, frowning, smiling, and shivering. In contrast to a private-state report such as \"She was unhappy,\" the sentence \"She frowned\" narrates a private-state action from which unhappiness or displeasure can be inferred, but does not directly report the character's private state. 1° In a given context, the private state that can be inferred may or may not be significant for tracking point of view. It is significant in the following passage: (35)","35\"lZoe looked at the notebook. 352On the first page Joe had written WAR WORK in large block letters in red and blue crayon. 35\"3On the next page he had written the date 35\"4and under it all about seeing Miss Lavatier's boyfriend. [Oneal,"]},{"title":"War Work,","paragraphs":["p. 47] 8 Cohn's term for a private-state report is psycho-narration. 9 Cohn's term for such reports is psycho-analogy. 10 Brinton (1980) notes that perceptions may be reported from an \"outer perspective\" with terms such as 'gaze' and 'look' or from an \"inner perspective\" with terms such as 'see' and 'hear\" (p. 370-371), but she does not address the significance of this difference for tracking point of view. 264 Janyce M. Wiebe Tracking Point of View in Narrative As this passage appears in the novel, (35.2)-(35.4) continue the subjective context established by (35.1)--they are subjective sentences presenting what Zoe sees. Interpreting (35.1) to be subjective, the algorithm is able to recognize that (35.2)-(35.4) are also subjective, because the past perfective is a subjective element in the continuing-subjective situation, and it is able to determine that the SC is Zoe, because she is the last subjective character. On the other hand, a private-state action sentence might not be the subjective sentence of the actor; an example is (36.1): (36)","36'1japheth looked at them. 36\"2\"You are flushed. And wet.\" 36\"3He himself did not seem to feel the intense heat. [UEngle, Many Waters, p. 20] As this passage appears in the novel, (36.3) is the subjective sentence of the last subjective character, Sandy and Dennys. If (36.1) were Japheth's subjective sentence, then it would be to Japheth that the subjective element 'seem' in (36.3) would be attributed, rather than to Sandy and Dennys.","Like quoted speech, a private-state-action sentence is a way to communicate something about the consciousness of a character who is not to become the SC. The reader infers from (36.1) that Japheth sees the people he is looking at; however, there are no subsequent subjective sentences about what he sees, such as the sentences in (35) that show what Zoe sees.","The first decision to be made when one encounters a private-state-action sentence is whether it should be treated as a private-state sentence or as an action sentence. Whether the sentence is subjective and, if so, who the SC is then depend upon the factors already presented.","The algorithm's treatment of these sorts of sentences is based on the observation that a more direct appeal to a character's consciousness, such as a private-state report or a narrative parenthetical, is usually used to establish a character as an SC for the first time. Thus, the actor of a private-state-action sentence that is the actor's subjective sentence has usually been the SC before. While consistency in the interpretation of a passage with this sort of sentence must be supported by other factors, this regularity is a strong one in the texts examined.","Thus, if the actor has been a SC, then the algorithm treats a private-state-action sentence s as it would have treated a private-state sentence in the same context; otherwise, it treats s as it would have treated an action sentence in the same context (see Wiebe [1990] for illustrations of the various consequences of treating s one way or the other). 12. Tests of the Algorithm This section summarizes the tests of the algorithm that have been performed.","First, the algorithm was hand-simulated on over 700 pages (roughly 17,500 sentential input items) from 7 novels that represent a range in the number of different subjective characters they contain. Given the large amount of data and the preprocessing requirements of running the algorithm, the purpose of this test was not to compile statistical measures, but rather to find out what kinds of exceptions occur. Generally, point of view is manipulated in these novels as expected by the algorithm. Of the exceptions, many can be attributed to problems that are specifically not addressed in this work, such as how the spatial and temporal points of view affect the psychological one (discussed in the next section), how point of view is manipulated in 265 Computational Linguistics Volume 20, Number 2 relatively rare situations, such as the very beginning of a novel, and what constitutes a \"significant\" subjective context for the purpose of interpreting private-state-action sentences (discussed in Appendix C). (The classes of errors and examples of them are given in Wiebe [1990].)","In order to obtain more specific numeric results, the algorithm was tested, and results tabulated, for a more modest amount of text (32 pages with 900 sentential input items). The results are positive, and are given in Appendix C. Fully testing the algorithm would require a much larger corpus, in which a significant number of each of the possibilities arises. Such testing would be a major endeavor in itself.","Finally, as mentioned in Section 8.3.1, we have performed psychological experiments that showed that readers' interpretations of private-state sentences are affected by paragraph breaks as we predicted on the basis of the algorithm (Bruder and Wiebe 1990 and in press). We are continuing this line of research with psychological experiments of other aspects of the algorithm. 13. Relation to Anaphora Resolution A question likely to arise in the reader's mind is how tracking POV and anaphora resolution are related. Anaphora resolution is necessary for tracking POV (the actors and experiencers of states of affairs must be known; see item (4) of Section 6.1). But it is certainly not sufficient, and an additional mechanism is needed. A case that clearly illustrates this is a private-state sentence in which the experiencer is referred to with a pronoun, such as: (37) He hated holidays. Resolving the pronoun is not sufficient for identifying the SC of (37), since the SC may or may not be the referent of 'he' (see Section 8.3.2).","However, the pipeline architecture of the algorithm is not realistic. Almost certainly, POV affects anaphora resolution, and also recognizing the discourse structure of the text. Specific issues I am exploring are discussed in the next section. 14. Directions for Future Research and Conclusion One direction for future research is investigating the interactions of different points of view. A large class of exceptions to the algorithm can be attributed to interactions between the spatial and temporal points of view and the psychological one. For example, there are spatial and temporal discontinuities other than scene breaks after which a character should no longer be expected: the current \"here\" and \"now\" in the story may shift away from the character, or the character may leave the scene while the \"here\" and \"now\" remain unchanged. These situations must be distinguished from the situation, occurring with represented thoughts, in which there is a \"projected here\" and a \"projected now\" of events that are being thought about, and from the situation in represented perception in which there is a \"projected here\" of events being perceived (Bruder et al. 1986; Rapaport et al. 1989a, 1989b).","An important area of future research is investigating interactions among tracking POV, recognizing discourse structure, and anaphora resolution. I am currently focusing on discourse structure within subjective contexts. We can view a subjective context as presenting a sequence of private states, where the experiencers and attitudes of some are only implicit (in the case of represented thoughts). In addition to discourse relations among sentences as wholes, there can be discourse relations among"]},{"title":"objects","paragraphs":["of 266 Janyce M. Wiebe Tracking Point of View in Narrative private states, even a hierarchical structure involving several such objects. As a concrete example, the contrast signaled by the cue-phrase 'but' appearing in a represented thought may be between a represented thought and the"]},{"title":"object","paragraphs":["of a previous private-state report. One example of a potential effect on pronoun resolution: if a sentence s is to be interpreted as a represented thought, and is to be incorporated into a discourse-segment structure among previous private-state objects, then pronouns in s can be resolved against the focus space(s) corresponding to the private-state-object segments (as in Grosz and Sidner's [1986] theory). Of course, determining whether or not s is to be so interpreted is a difficult problem. But such interactions among POV, discourse structure, and anaphora resolution might be usefully cast as constraints, with evidence regarding interpretation with respect to one limiting the options to be pursued for the others.","The psychological POV is related to other pragmatic and discourse phenomena. Subjective contexts are paragraph-level analogs of opaque contexts in belief reports (Wiebe [1991] specifically addresses this issue). In addition, the discourse phenomena identified by Fauconnier (1985) are similar to the psychological point of view. Just as a private-state report can begin a discourse segment in which subsequent sentences are understood to continue a character's point of view, an adverbial such as \"in 1969\" can begin a discourse segment in which subsequent sentences are understood to refer to events that occurred in 1969, even though the date is not subsequently mentioned. Or, consider discussing someone else's work, say Smith's, in a research paper or text-book. After an initial reference to Smith's work, you may go on to describe his or her theory without explicitly saying in each sentence that you are doing so (with a locution such as \"Smith shows that,\" \"In Smith's theory, .... In Smith's algorithm,\" or \"According to Smith\") (William J. Rapaport, personal communication). Along with subjective contexts, an NLU system must be able to recognize such discourse phenomena in order to recover information implicitly communicated in the discourse. A detailed investigation of one of them suggests directions for investigating the others. The one investigated here, subjective contexts in particular kinds of texts, is a good one to investigate because it is possible to constrain the problem, because there are so many prototypical instances in those kinds of texts, and because there is a great deal of previous work in linguistics and literary theory to build upon.","In conclusion, this paper presented an algorithm for tracking the psychological point of view in third-person fictional narrative text. The algorithm is based on regularities, found by extensive examination of naturally occurring narratives, in the ways that authors manipulate point of view. The algorithm has been implemented, preliminary empirical studies have been performed, which support the algorithm, and psychological experimentation is continuing. This is the first detailed computational approach to the problem of tracking the psychological point of view. Acknowledgments I wish to thank the members of the SUNY Buffalo Graduate Group in Cognitive Science and the SNePS Research Group for many discussions and ideas, and William J. Rapaport, Graeme Hirst, Peter Heeman, Russ Greiner, the anonymous reviewers, and especially Diane Horton for helpful comments on earlier drafts of this paper. This research was supported in part by National Science Foundation grants IST-8504713 and IRI-8610517, and the preparation of this paper was supported in part by the Natural Sciences and Engineering Research Council of Canada. References Allen, James F., and Perrault, C. Raymond (1980). \"Analyzing intention in utterances.\""]},{"title":"Artij~'cial Intelligence","paragraphs":["15, 143-178.","Almeida, Michael J. (1987). \"Reasoning about the temporal structure of narratives.\" Technical report 87-10, SUNY 267 Computational Linguistics Volume 20, Number 2 Buffalo Department of Computer Science.","Banfield, Ann (1982). Unspeakable Sentences: Narration and Representation in the Language of Fiction. Routledge & Kegan Paul.","Banfield, Ann (1987). \"Describing the unobserved.\" In The Linguistics of Writing, edited by Nigel Fabb, 265-285. Methuen.","Barwise, Jon, and Perry, John (1983). Situations and Attitudes. MIT Press.","Brinton, Laurel (1980). \"'Represented perception': A study in narrative style.\" Poetics 9, 363-381.","Bruder, Gail A., and Wiebe, Janyce M. (1990). \"A psychological test of an algorithm for recognizing subjectivity in narrative text.\" In Proceedings, 12th Annual Conference of the Cognitive Science Society. 947-952.","Bruder, Gail A., and Wiebe, Janyce M. (in press). \"Recognizing subjectivity and identifying subjective characters in third-person fictional narrative.\" In Deixis in Narrative: A Cognitive Science Perspective, edited by Judy Duchan and Gail Bruder. Lawrence Erlbaum.","Bruder, Gail A.; Duchan, Judith F.; Rapaport, William J.; Segal, Erwin M.; Shapiro, Stuart C.; and Zubin, David A. (1986). \"Deictic centers in narrative: An interdisciplinary cognitive-science project.\" Technical report 86-20, SUNY Buffalo Department of Computer Science.","Caenepeel, Mimo (1989). Aspect, temporal ordering, and perspective in narrative fiction. Doctoral dissertation, University of Edinburgh.","Carberry, Sandra (1989). \"A pragmatics-based approach to ellipsis resolution.\" Computational Linguistics 15(2), 75-96.","Chafe, Wallace (1986). \"Evidentiality in English conversation and academic writing.\" In Evidentiality: The Linguistic Coding of Epistemology, edited by Wallace Chafe and Johanna Nichols, 261-272. Ablex.","Chatman, Seymour (1978). Story and Discourse: Narrative Structure in Fiction and Film. Cornell University Press.","Chun, Soon Ae (1987). \"SNePS implementation of possessive phrases.\" SNeRG technical note 19, SUNY Buffalo Department of Computer Science.","Cohen, Robin (1987). \"Analyzing the structure of argumentative discourse.\" Computational Linguistics 13, 11-24.","Cohn, Dorrit (1978). Transparent Minds: Narrative Modes for Representing Consciousness in Fiction. Princeton University Press.","Computational Linguistics, Special Issue on","Tense and Aspect. 1988, 14(2).","Computational Linguistics, Special Issue on","User Modeling. 1988, 14(3).","Dole~el, Lubomir (1973). Narrative Modes in Czech Literature. University of Toronto Press.","Dyer, Michael G. (1983). In-Depth Understanding: A Computer Model of Integrated Processing for Narrative Comprehension. MIT Press.","Ehrlich, Susan (1987). \"Aspect, foregrounding and point of view.\" Text 7(4), 363-376.","Ehrlich, Susan (1990). \"Referential linking and the interpretation of tense.\" Journal of Pragmatics 14, 57-75.","Fauconnier, Gilles (1985). Mental Spaces: Aspects of Meaning Construction in Natural Language. MIT Press.","Fillmore, Charles (1968). \"The case for case.\" In Universals in Linguistic Theory, edited by E. Bach and R. T. Harms, 1-90. Holt.","Fillmore, Charles (1974). \"Pragmatics and the description of discourse.\" In Berkeley Studies in Syntax and Semantics I, edited by Charles Fillmore, George Lakoff, and Robin Lakoff, V1-V21. University of California Department of Linguistics and Institute of Human Learning.","Fillmore, Charles (1975). Santa Cruz Lectures on Deixis. Indiana University Linguistics Club.","Galbraith, Mary (1990). Subjectivity in the Novel. Ph.D. dissertation, SUNY Buffalo Department of English.","Grosz, Barbara J., and Sidner, Candace L. (1986). \"Attention, intentions, and the structure of discourse.\" Computational Linguistics 12(3), 175-204.","Grosz, Barbara J.; Joshi, Aravind K; and Weinstein, Scott (1983). \"Providing a unified account of definite noun phrases in discourse.\" In Proceedings, 21st Annual Meeting of the Association for Computational Linguistics. 44-50.","Hamburger, Kate (1973). The Logic of Literature, translated by M. J. Rose. Indiana University Press.","Hirst, Graeme (1987). Semantic Interpretation and the Resolution of Ambiguity. Cambridge University Press.","Jespersen, Otto (1924). The Philosophy of Grammar. George Allen & Unwin.","Kuroda, S.-Y. (1973). \"Where epistemology, style and grammar meet: A case study from the Japanese.\" In A Festschrift for Morris Halle, edited by P. Kiparsky and S. Anderson, 377-391. Holt, Rinehart & Winston.","Kuroda, S.-Y. (1976). \"Reflections on the foundations of narrative theory--from a 268 Janyce M. Wiebe Tracking Point of View in Narrative linguistic point of view.\" In Pragmatics of Language and Literature, edited by T. A. van Dijk, 107-140. North-Holland.","Li, Naicong (1987). \"Pronoun resolution in SNePS.\" SNeRG technical note 18, SUNY Buffalo Department of Computer Science.","Li, Naicong (1991). Perspective-taking in Mandarin discourse. Doctoral dissertation, SUNY Buffalo.","Lyons, John (1977). Semantics, vol. 2. Cambridge University Press.","Nakhimovsky, Alexander (1988). \"Aspect, aspectual class, and the temporal structure of narrative.\" Computational Linguistics 14(2), 29-43.","Nakhimovsky, Alexander, and Rapaport, William J. (1988). \"Discontinuities in narratives.\" In Proceedings, 12th International Conference on Computational Linguistics. 465-470.","New York Times (16 Sept 1990). AIDS in Africa: A killer rages on, by Eric Eckholm.","Peters, Sandra L., and Shapiro, Stuart C. (1987a). \"A representation for natural category systems.\" In Proceedings, 9th Annual Conference of the Cognitive Science Society. 379-390.","Peters, Sandra L., and Shapiro, Stuart C. (1987b). \"A representation for natural categorysystems.\" In Proceedings, lOth International Joint Conference on Artificial Intelligence. 140-146.","Peters, Sandra L.; Shapiro, Stuart C.; and Rapaport, William J. (1988). \"Flexible natural language processing and roschian category theory.\" In Proceedings, lOth Annual Conference of the Cognitive Science Society. 125-131.","Quirk, Randolph; Greenbaum, Sidney; Leech, Geoffrey; and Svartvik, Jan (1985). A Comprehensive Grammar of the English Language. Longman.","Rapaport, William J. (1986). \"Logical foundations for belief representation.\" Cognitive Science 10, 371-422.","Rapaport, William J.; Segal, Erwin M.; Shapiro, Stuart C.; Zubin, David A.; Bruder, Gail A.; Duchan, Judith E; Almeida, Michael J.; Daniels, Joyce H.; Galbraith, Mary; Wiebe, Janyce M.; and Yuhan, Albert H. (1989a). \"Deictic centers and the cognitive structure of narrative comprehension.\" Technical report 89-01, SUNY Buffalo Department of Computer Science. Rapaport, William J.; Segal, Erwin M.; Shapiro, Stuart C.; Zubin, David A.; Bruder, Gail A.; Duchan, Judith F.; and Mark, David M. (1989b). \"Cognitive and computer systems for understanding narrative text.\" Technical report 89-07, SUNY Buffalo Department of Computer Science.","Reichenbach, Hans (1947). Elements of Symbolic Logic. Macmillan.","Reichman, Rachel (1985). Getting Computers to Talk Like You and Me. MIT Press.","Reiser, Brian J. (1981). \"Character tracking and the understanding of narratives. In Proceedings, 7th International Joint Conference on Artificial Intelligence, vol. 1. 209-211.","Shapiro, Stuart C. (1979). \"The SNePS semantic network processing system.\" In Associative Networks, edited by N. V. Findler, 179-203. Academic.","Shapiro, Stuart C. (1982). \"Generalized augmented transition network grammars for generation from semantic networks.\" American Journal of Computational Linguistics 8, 12-25.","Shapiro, Stuart C., and Rapaport, William J. (1987). \"SNePS considered as a fully intensional propositional semantic network.\" In The Knowledge Frontier, edited by N. Cercone and G. McCalla, 262-315. Springer-Verlag.","Sidner, Candace L. (1983). \"Focusing in the comprehension of definite anaphora.\" In Computational Models of Discourse, edited by Michael Brady and Robert Berwick, 267-330. MIT Press.","Stark, Heather A. (1987). Keeping track of characters in narrative. Doctoral dissertation, Department of Psychology, Stanford University.","Stark, Heather A. (1988). \"What do paragraph markings do?\" Discourse Processes 11, 275-303.","Uspensky, Boris (1973). A Poetics of Composition. University of California Press.","Webber, Bonnie L. (1983). \"So what can we talk about now?\" In Computational Models of Discourse, edited by Michael Brady and Robert Berwick, 331-371. MIT Press.","Wiebe, Janyce M. (1990). Recognizing subjective sentences: A computational investigation of narrative text. Doctoral dissertation, SUNY Buffalo Department of Computer Science. Also published as Technical report 90-03.","Wiebe, Janyce M. (1991). \"References in narrative text.\" No~s (Special Issue on Cognitive Science and AI) 25(4), 457-486. Wiebe, Janyce M., and Rapaport, William J. (1988). \"A computational theory of perspective and reference in narrative.\" In Proceedings, 26th Annual Meeting of the Association for Computational Linguistics. 131-138. Wilensky, Robert (1983). Planning and Understanding. Addison-Wesley. 269 Computational Linguistics Volume 20, Number 2","Wilks, Yorick, and Bien, Janusz (1983). \"Beliefs, points of view, and multiple environments.\" Cognitive Science 7, 95-119. Texts Cited Adler, Carole S. (1987). The Magic of the Glits.","Macmillan. Bridgers, Sue Ellen (1979). All Together Now.","Knopf. Caldwell, Taylor (1966). No One Hears But","Him. Doubleday. Gibson, William (1988). Mona Lisa Overdrive.","Bantam. UEngle, Madeleine (1986). Many Waters.","Dell Publishing. Lorimer, Janet (1987). The Mystery of the","Missing Treasure: Scholastic. McMurtry, Larry (1985). Lonesome Dove.","Simon & Schuster. Oneal, Zibby (1971). War Work. Viking Press. Sachs, Marilyn (1966). Amy and Laura.","Doubleday. Wootf, Virginia (1972). The Years. Hogarth","Press. Wu, William (1987). Cyborg. Ace Books. 270 Janyce M. Wiebe Tracking Point of View in Narrative Appendix A: The Algorithm A.1 Introduction The following aspects of the algorithm as it is presented in Wiebe (1990) are not addressed in this paper or included in the version of the algorithm given below. . . . 4. . . In addition to the state-of-affairs types listed in Section 6.3.1, there is an additional one, a seeming state. For example, \"The man seemed tired to John\" is about a seeming state. Such states are treated as private states. The types of constituents, mentioned in Section 6.3.3, in which private-state terms are not considered by the algorithm when choosing a state of affairs to consider. The example given in Section 6.3.3 was a manner adverbial. Objective private-state sentences (see footnote 4). When the SC cannot be identified when the sentence appears, identifying it after later sentences are processed (in Section 8.2.4). A listing of all of the potential subjective element categories (Section 9.2) and the text situations with which each is associated (Section 9.3). A listing of all of the subjective elements that are not considered when they appear in private-state sentences (Section 10). This appendix is organized as follows. The preprocessing functions and operations on their ranges are specified in section A.2; intermediate-level functions are given in A.3; and the high-level functions are given in A.4.","Function names are given in capital letters; parameter and variable names are given in italics; and comments are preceded by percent signs. The type of result returned by a function is given in the function heading following a colon. Preconditions are preceded by Given.","Only specifications are given for the functions in A.2. These consist of preconditions, preceded by Given, and a specification of the result, preceded by Returns. A.2 Preprocessing Functions • Function Item and type-predicates on input items. ITEM(t, i): input item Returns: The input item at position i in text t."]},{"title":"SENTENCE(item):","paragraphs":["Boolean Returns: true iff input item"]},{"title":"item","paragraphs":["is a sentence."]},{"title":"PARAGRAPH-BREAK(item):","paragraphs":["Boolean Returns: true iff input item"]},{"title":"item","paragraphs":["is a paragraph break."]},{"title":"SCENE-BREAK(item):","paragraphs":["Boolean Returns: true iff input item"]},{"title":"item","paragraphs":["is a scene break. • Function Features and operations on feature sets. FEATURE(S): feature set Returns: The feature set for sentence s. 271 Computational Linguistics Volume 20, Number 2 Following are the operations on feature sets, however they may be implemented. • Item (1) of Section 6.1."]},{"title":"POTENTIAL-SUBJECTIVE-ELEMENTS(featureSet):","paragraphs":["set of potential subjective elements Returns: the set of potential subjective elements in"]},{"title":"featureSet. TYPE-OF-PSE(pse, featureSet):","paragraphs":["potential subjective element type (e.g., habitual, comparative-'like') Given:"]},{"title":"pse E POTENTIAL-SUBJECTWE-ELEMENTS(featureSet) Returns:","paragraphs":["The type of potential subjective element that"]},{"title":"pse","paragraphs":["is. • Item (2) of Section 6.1. CLAUSES"]},{"title":"(featureSet):","paragraphs":["set of clauses Returns: the set of clauses in"]},{"title":"ffeatureSet. SUBORDINATING-CLAUSES(clause, featureSet):","paragraphs":["set of clauses Given: clause E Clauses (featureSet) Returns: The set of clauses to which"]},{"title":"clause","paragraphs":["is syntactically subordinated. STATES-OF-AFFAIRS"]},{"title":"(featureSet):","paragraphs":["set of states of affairs Returns: the set of states of affairs in"]},{"title":"featureSet.","paragraphs":["TYPE-OF-SOA"]},{"title":"(soa, featureSet):","paragraphs":["one of private-state-action, action, private-state, nonprivate-state Given:"]},{"title":"soa E STATES-OF-AFFAIRS(featureSet) Returns:","paragraphs":["The type of state of affairs that"]},{"title":"soa","paragraphs":["is. SOA-OF-CLAUSE"]},{"title":"(clause, featureSet):","paragraphs":["state of affairs Given:"]},{"title":"clause E CLAUSES(featureSet) Returns:","paragraphs":["The state of affairs that"]},{"title":"clause","paragraphs":["is about • Item (3) of Section 6.1. These are the only functions that access information about the head noun of the subject of the main clause. A feature set must contain an indication as to whether or not this noun is about a private state, and, if this indication is true, the feature set must contain the state of affairs that this noun is about. But if this indication is false, even if the noun is about another kind of state of affairs, the feature set need not contain that state of affairs."]},{"title":"SO Ahn-IS-ABOUT-A-PRIVATE-STATE(featureSet ) :","paragraphs":["Boolean Returns: True iff the head noun of the subject of the main clause is about a private state."]},{"title":"SOAhn(featureSet):","paragraphs":["state of affairs Returns: if"]},{"title":"SOAhn-IS-ABOUT-A-PRIVATE-STATE(featureSet),","paragraphs":["then returns the member of STATES-OF-AFFAIRS (featureSet) that the head noun of the subject of the main clause is about. Otherwise, returns nil. • Item (4) in Section 6.1. EXPERIENCER-OR-ACTOR-OF"]},{"title":"(soa, featureSet):","paragraphs":["set of characters Returns: {}, if"]},{"title":"soa ~ STATES-OF-AFFAIRS(featureSet).","paragraphs":["272 Janyce M. Wiebe Tracking Point of View in Narrative Otherwise, returns the experiencer or actor of soa (possibly the empty set). • Item (5) in Section 6.1. NARRATIVE-PARENTHETICAL (featureSet): Boolean Returns: true iff the sentence contains a narrative parenthetical. SUBJECT-OF-NARRATIVE-PARENTHETICAL(.featureSet): set of characters Given: NARRATIVE-PARENTHETICAL ~featureSet) Returns: The subject of the narrative parenthetical in the sentence. • Item (6) in Section 6.1. IS-IN-THE-SIMPLE-P AST( clause, featureSet ): Boolean This is a pattern for other functions used by ACTIVE-CHARACTER-OF in A.4. Given: clause E Clauses (featureSet) Returns: True iff the main verb phrase of clause is in the simple past.","IS-PSE-SUBORDINATED-TO-SOA (pse, soa, featureSet): Boolean","Given: pse E POTENTIAL-SUBJECTIVE-ELEMENTS ~featureSet) and soa E STATES-OF-AFFAIRSIfeatureSet )","Returns: False, if soa = SOAhn(featureSet). Otherwise, let clause be the clause in CLAUSES(featureSet) such that SOA-OF-CLAUSE(clause, featureSet) = soa, and let l be the lexical item(s) according to which it was determined that clause is about soa. Then, returns true iff pse is syntactically subordinated to I. A.3 Intermediate-Level Functions These functions are used in many of the higher-level ones given in A.4. • Context-Access Functions. Recall the context-access functions LAST-SC-OF, LAST-ACTIVE-CHARACTER-OF, PREVIOUS-SCS-OF, and TEXT-SITUATION-OF, introduced in Section 6.2. Only the first is given here; the others are the obvious similar ones.","LAST-SC-OF","(context = IlastSC, lastActiveCharacter, previousSCs, textSituation} ):","set of characters","return lastSC • Function To-Be-Treated-As-A-Private-State. TO-BE-TREATED-AS-A-PRlVATE-STATE(SOa, featureSet, context): Boolean Given: soa E STATES-OF-AFFAIRS(featureSet) and TYPE-OF-SOA(soa,featureSet) =","private-state-action return true iff EXPERIENCER-OR-ACTOR-OF(soa,featureSet) C","PREVIOUS-SCs-OF(context) • Function Chosen-State-Of-Affairs and auxiliary functions. CHOSEN-STATE-OF-AFFAIRS~featureSet, context): state of affairs % Let s be the sentence such that FEATURES(S) = featureSet. Then, % CHOSEN-STATE-OF-AFFAIRS(featureSet) is the state of affairs that % the algorithm will consider for s. 273 Computational Linguistics Volume 20, Number 2 % The specification in Section 6.3.3 does not mention private-state actions % because they are not discussed until the end of the paper. However, they are included here. SOamain ~ SO A-OF-CLA USE(MAIN-CLA USE(featureSet ),"]},{"title":"featureSet )","paragraphs":["if"]},{"title":"1 (TYPE-OF-SOA(SOamain, featureSet)","paragraphs":["= private-state) or 2: (a)"]},{"title":"((TYPE-OF-SOA(SOamain, featureSet)","paragraphs":["= private-state-action) and (b)"]},{"title":"(TO-BE-TREATED-AS-A-PRIVATE-STATE(SOamain, featureSet, context))) then return","paragraphs":["SOamain else if"]},{"title":"SOAhn-Is-About-A-Private-State(featureSet) then","paragraphs":["return SOAhn"]},{"title":"(featureSet) else","paragraphs":["if"]},{"title":"CANDIDATE-SUBORDINATED-CLAUSES(featureSet, context)","paragraphs":["~ { } then return"]},{"title":"SOA-OF-CLAUSE(ONE-OF","paragraphs":["( CANDID ATE-SUBORDINATED-CLA USES( featureSet ,"]},{"title":"context)), featureSet)","paragraphs":["else return SOamain end if MAIN-CLAUSE"]},{"title":"(featureSet):","paragraphs":["clause return the clause c such that"]},{"title":"c E CLAUSES(featureSet)","paragraphs":["and"]},{"title":"Subordinating-Clauses (c, featureSet)","paragraphs":["= {}."]},{"title":"CANDIDATE-SUBORDINATED-CLAUSES (featureSet, context):","paragraphs":["set of clauses","return the set of all c such that 1 (c c CLAUSES"]},{"title":"(featureSet)) and","paragraphs":["2 (c # MAIN-CLAUSE"]},{"title":"(featureSet)) and","paragraphs":["4:"]},{"title":"(a) ((TYPE-OF-SOA (SOA-OF-CLAUSE(c, featureSet),featureSet)","paragraphs":["= private-state) or (b):"]},{"title":"(i) ((TYPE-OF-SOA (SOA-OF-CLAUSE","paragraphs":["(c,"]},{"title":"featureSet), featureSet)","paragraphs":["= private-state-action) and","(ii) (TO-BE-TREATED-AS-A-PRIVATE-STATE (SOA-OF-CLAUSE"]},{"title":"(c, featureSet), featureSet, context)))) and","paragraphs":["5: there does not exist a c' such that (c' c"]},{"title":"CLAUSES(featureSet)) and","paragraphs":["(TYPE-OF-SOA (SOA-OF-CLAUSE"]},{"title":"(c', featureSet), featureSet) C","paragraphs":["{private-state, private-state-action}) and"]},{"title":"(C' E SUBORDINATING-CLAUSES","paragraphs":["(C,"]},{"title":"featureSet)) A.4 High-Level Functions","paragraphs":["TRACK-POV (a procedure) % Interpretations and contexts are defined in Section 6."]},{"title":"i~1 context ~--","paragraphs":["({}, {}, {}, presubjective-nonactive/","loop if ~SENTENCE (ITEM (text,"]},{"title":"i)) then context ~","paragraphs":["NEW-CONTEXT'"]},{"title":"(ITEM(text,","paragraphs":["i),"]},{"title":"context)","paragraphs":["else"]},{"title":"interpretation ~-- PO V (FEATURES(ITEM( text,i) ),context)","paragraphs":["274 Janyce M. Wiebe Tracking Point of View in Narrative","context ~- NEW-CONTEXT(interpretation, context) end if i~i+l","end loop","NEW-CONTEXT (interpretation = (value, character), context = (lastSC, lastActiveCharacter, previousSCs, textSituationl ): context","if value = subjective then ISCnew ~-- character pSCne w ~ character U previousSCs laCnew ~-- lastActiveCharacter tSnew ~ continuing-subjective else","if character # {} then lacnew ~-- character else","laCnew ~ lastActiveCharacter end if ]SCnew ~ lastSC pSC ne w ~ previousSCs if character # {} and textSituation = presubjective-nonactive then","tSnew ~- presubjective-active else if character ~ (} and textSituation C {postsubjective-nonactive, broken-subjective} then","tSnew ~ postsubjective-active else if character = {} and textSituation = broken-subjective then","tSnew ~-- postsubjective-nonactive else if textSituation = continuing-subjective then","tSn~w ~ interrupted-subjective else tSnew ~-- textSituation end if","end if","return ( ISCnew, lacnew, pSCne w, tSnew) NEW-CONTEXT /","(break,","context = (lastSC, lastActiveCharacter, previousSCs if break = scene-break then","tSnew ~-- presubjective-nonactive else if textSituation -- presubjective-active then","tSnew ~ presubjective-nonactive else if textSituation = continuing-subjective then","tSnew ~- broken-subjective else if textSituation = interrupted-subjective then","tSne w ~ postsubjective-nonactive else if textSituation = postsubjective-active then","tSnew ~-- postsubjective-nonactive else tSnew +-- textSituation end if return (lastSC, lastActiveCharacter, previousSCs, ts,~ew) textSituationl ): context 275 Computational Linguistics Volume 20, Number 2"]},{"title":"POV (featureSet, context): Interpretation","paragraphs":["if SENTENCE-IS-SUBJECTIVE"]},{"title":"~featureSet, context)","paragraphs":["then return / subjective, IDENTIFY-SC"]},{"title":"(featureSet, context) I","paragraphs":["else return / objective, ACTIVE-CHARACTER-OF"]},{"title":"(featureSet, context) I","paragraphs":["end if"]},{"title":"SENTENCE-IS-SUBJECTIVEIfeatureSet, context):","paragraphs":["Boolean"]},{"title":"soa ~-- CHOSEN-STATE-OF-AFFAIRS(featureSet, context)","paragraphs":["return"]},{"title":"1 (NARRATIVE-PARENTHETICAL(featureSet)) or 2 (SUBJECTIVE-ELEMENTS(featureSet, context) #","paragraphs":["{})) or"]},{"title":"3 (TYpE-OF-SOA(soa, featureSet)","paragraphs":["= private-state) or 4: (a)"]},{"title":"((TYPE-OF-SOA(soa, ffeatureSet)","paragraphs":["= private-state-action) and (b)"]},{"title":"(TO-BE-TREATED-AS-A-PRIVATE-STATE(soa, featureSet, context))","paragraphs":["or 5: (a)"]},{"title":"((TYPE-OF-SOA(soa, featureSet)","paragraphs":["= nonprivate-state) and"]},{"title":"(b) (TEXT-SITUATION-OF(context)","paragraphs":["= continuing-subjective))"]},{"title":"SUBJECTIVE-ELEMENTS~eatureSet, context):","paragraphs":["set of potential subjective elements % As specified in Section A.1, the potential subjective element categories and the % text situations with which they are associated are not listed in this paper. return"]},{"title":"{pse [ pse","paragraphs":["E POTENTIAL-SUBJECTIVE-ELEMENTS"]},{"title":"(featureSet)","paragraphs":["and"]},{"title":"pse","paragraphs":["is associated with"]},{"title":"TEXT-SITUATION-OF(context)}","paragraphs":["else else else end IDENTIFY-SC"]},{"title":"~featureSet, context):","paragraphs":["set of characters if IDENTIFY-SC-FROM-THE-SENTENCE"]},{"title":"(featureSet~ context) ~","paragraphs":["{} then return IDENTIFY-SC-FROM-THE-SENTENCE"]},{"title":"(featureSet, context)","paragraphs":["else if LAST-SC-IS-AN-EXPECTED-SC"]},{"title":"(context)","paragraphs":["and LAST-ACTIVE-CHARACTER-IS-AN-EXPECTED-SC"]},{"title":"(context)","paragraphs":["then return CHOOSE-AN-EXPECTED-SC"]},{"title":"(featureSet~ context)","paragraphs":["if LAST-SC-IS-AN-EXPECTED-SC"]},{"title":"(context)","paragraphs":["then return"]},{"title":"LAST-SC-OF( context)","paragraphs":["if LAST-ACTIVE-CHARACTER-IS-AN-EXPECTED-SC"]},{"title":"(context)","paragraphs":["then return"]},{"title":"LAST-ACTIVE-CHARACTER-OF(context)","paragraphs":["return {} if IDENTIFY-SC-FROM-THE-SENTENCE"]},{"title":"(featureSet, context):","paragraphs":["set of characters"]},{"title":"soa","paragraphs":["~ CHOSEN-STATE-OF-AFFAIRS"]},{"title":"(featureSet, context)","paragraphs":["if"]},{"title":"NARRATIVE-PARENTHETICAL~featureSet)","paragraphs":["then return"]},{"title":"SUBJECT-OF-NARRATIVE-PARENTHETICAL(featureSet)","paragraphs":["else if"]},{"title":"1 (EXPERIENCER-OR-ACTOR-OF(soa,featureSet) #","paragraphs":["{}) and"]},{"title":"2 (SUBJECTIVE-ELEMENTS-TO-CONSIDER(soa, featureSet, context)","paragraphs":["= {}) and 3: (a)"]},{"title":"((TYPE-OF-SOA(soa,featureSet)","paragraphs":["= private-state) or 276 Janyce M. Wiebe Tracking Point of View in Narrative 4:"]},{"title":"(b):","paragraphs":["(i)"]},{"title":"((TYPE-OF-SOA(soa, featureSet)","paragraphs":["= private-state-action) and (ii)"]},{"title":"(TO-BE-TREATED-AS-A-PRIVATE-STATE(soa, featureSet, context)))) and","paragraphs":["(a)"]},{"title":"((TEXT-SITUATION-OF(context) ~","paragraphs":["continuing-subjective) or"]},{"title":"(b):","paragraphs":["(i)"]},{"title":"((TEXT-SITUATION-OF(context)","paragraphs":["= continuing-subjective) and (ii): (1)"]},{"title":"( (EXPERIENCER-OR-ACTOR-OF(soa) C LAST-SC-OF(context) or","paragraphs":["(2)"]},{"title":"(EXPERIENCER-OR-ACTOR-OF(soa) D LAST-SC-OF(context) ) ) ) then return EXPER1ENCER-OR-ACTOR-OF(soa )","paragraphs":["else return {} end if"]},{"title":"LAST-SC-IS-AN-EXPECTED-SC(context):","paragraphs":["Boolean If"]},{"title":"TEXT-SITUATION-OF(context) ~","paragraphs":["{presubjective-nonactive, presubjective-active} then return true","else return false"]},{"title":"LAST-ACTIVE-CHARACTER-IS-AN-EXPECTED-SC(context):","paragraphs":["Boolean If"]},{"title":"TEXT-SITUATION-OF(context) E","paragraphs":["{presubjective-active, postsubjective-active} then","return true","else return false","end if"]},{"title":"CHOOSE-AN-EXPECTED-SC(featureSet, context):","paragraphs":["set of characters if"]},{"title":"EXPERIENCER-OR-A CTOR-OF( CHOSEN-STA TE-OF-AFFAIRS(featureSet ), featureSet ) = LAST-ACTIVE-CHARACTER-OF(context) then return LaST-SC-OF(context)","paragraphs":["else return LAST-ACTIVE-CHARACTER-OF"]},{"title":"(context) end","paragraphs":["if"]},{"title":"SUBJECTWE-ELEMENTS-TO-CONSIDER(soa, featureSet, context):","paragraphs":["set of potential subjective elements return"]},{"title":"{pse I pse E SUBJECTIVE-ELEMENTS (featureSet, context) and IS-PSE-SUBORDINATED-TO-SOA(pse, soa, featureSet) and TYPE-OF-PSE(pse, featureSet)","paragraphs":["{habitual, comparative-'like', 'as'-followed-by-modifier, some kinds of intensifier adverbs.} } % See Section 10 and item (6) of A.1. ACTIVE-CHARACTER-OF"]},{"title":"(featureSet, context):","paragraphs":["set of characters"]},{"title":"soa ~ CHOSEN-STATE-OF-AFFAIRS(featureSet, context)","paragraphs":["if"]},{"title":"(TYPE-OF-SOA(soa, featureSet)","paragraphs":["= action) and"]},{"title":"(EXPERIENCER-OR-ACTOR-OF(soa, featureSet) _C_","paragraphs":["Previous-SCs-Of (context)) and"]},{"title":"(IS-IN-THE-SIMPLE-PAST(CLAUSE-OF(soa, featureSet), featureSet) )","paragraphs":["and % the remaining conjuncts of this conditional are in English, so as not to list many % obvious functions. IS-IN-THE-SIMPLE-PAST is a model for the ones implied by the English statements. (The main verb phrase is not negated, is not habitual, and does not contain a modal auxiliary verb or adverb such as those listed in Section 8.2.2) 277 Computational Linguistics Volume 20, Number 2 then return"]},{"title":"EXPERIENCER-OR-ACTOR-OF(soa,featureSet) else return","paragraphs":["{} end if Appendix B: Implementation and Demonstrations Implementation The algorithm has been implemented in two systems. Both implement functions POV, NEw-CONTEXT, and NEW-CONTEXT', and neither implements function ITEM. The system demonstrated here takes actual sentences as input, so has a component for performing function FEATURES. However, it does not truly implement FEATURES, but is successful in computing the"]},{"title":"FeatureSet","paragraphs":["of a sentence only for sentences that fall within its limited coverage. It requires many actual sentences of a text to be simplified.","The other version of the system queries the user for the information returned by function FEATURES, to enable the algorithm to be tested on unlimited text, without concern for problems not addressed in this work.","Both systems are implemented using the SNePS knowledge representation and reasoning system (Shapiro 1979; Shapiro and Rapaport 1987) and an ATN grammar (Shapiro 1982). The grammar of the system demonstrated here is an extension of others developed at the State University of New York at Buffalo, and includeS pieces of programs written by Soon Ae Chun (Chun 1987), Zuzana Dobes, Naicong Li (Li 1987), Sandra Peters (Peters and Shapiro 1987a, 1987b; Peters, Shapiro, and Rapaport 1988), William J. Rapaport (Rapaport 1986), and Stuart C. Shapiro (Shapiro 1982; Shapiro and Rapaport 1987). Demonstrations In the following, input to the system is preceded by a colon, comments are preceded by percent signs, and all other lines are the system's output. To save space, extraneous messages have been deleted, such as those concerned with entering and exiting the system. Sentences of quoted speech are input simply as 'Quoted_speech' followed by a discourse parenthetical, since the algorithm does not consider the contents of the quoted string.","The system is first demonstrated on the following passage; when the passage is encountered in the novel, the situation is postsubjecfive-nonactive and the last subjective character is Sandy and Dennys. Japheth looked at Sandy and Dennys anxiously. \"Sun-sickness can be dangerous.\" He reached up to touch Dennys's cheek. Shook his head. \"You're cold and clammy. Bad sign.\" He put his hand against his forehead. Appeared to be thinking deeply. [UEngle,"]},{"title":"Many Waters,","paragraphs":["p. 241 : Initialize situation to postsubj-nonactive. The situation is now postsubj-nonactive : Initialize last_subj_char to Sandy and Dennys. Dennys and Sandy is the last_subj_char"]},{"title":"% The situation and last subjective character arefirst initialized.","paragraphs":[": Japheth looked at Sandy and Dennys anxiously. At the beginning of this sentence: 278 Janyce M. Wiebe Tracking Point of View in Narrative","The situation is postsubj-nonactive","Expected subjective character:","Dennys and Sandy, the last_subjchar Perc action of Japheth treated as an action: Actor has not been the subjchar The sentence is not subjective The situation is still postsubj-nonactive % The s~te ofaffai~ that the algorithm considers ~ the perceptual action (~erc-action') %thatthe main clauseisabout, a kind ofprivate-stateaction. % Note that even though \"anxiously\" is a private-state term, it isn't considered % by the system because it is being used as a manner adverbial. : Quoted speech Japheth said. At the beginning of this sentence:","The situation is postsubj-nonactive","Expected subjective character:","Dennys and Sandy, the last subj char The sentence is not subjective The situation is still postsubj-nonactive : He reached up to touch Dennys's cheek. At the beginning of this sentence:","The situation is postsubj-nonactive","Expected subjective character:","Dennys and Sandy, the last subj_char The sentence is not subjective The situation is still postsubj-nonactive : Shook his head. At the beginning of this sentence:","The situation is postsubj-nonactive","Expected subjective character:","Dennys and Sandy, the last subj char Potential subjective element considered:","sentence_fragment It is a subjective element Subjective context established by this feature:","sentence_fragment The subj_char is Dennys and Sandy The situation is now continuing-subj % Th~ utterance ~ a sentence fragment, a potentml su~ective element. In the situat~n % in which it appea~ (postsu~ective-nonactive), it is a subjective element. : Quoted_speech he said. At the beginning of this sentence:","The situation is continuing-subj","Expected subjective character:","Dennys and Sandy, the last_subj_char The sentence is not subjective Objective sentence in continuing-subj situation: 279 Computational Linguistics Volume 20, Number 2 situation is now interrupted-subj : He put his hand against his forehead. At the beginning of this sentence:","The situation is interrupted-subj","Expected subjective character:","Dennys and Sandy, the last subj char The sentence is not subjective The situation is still interrupted-subj : Appeared to be thinking deeply. At the beginning of this sentence:","The situation is interrupted-subj","Expected subjective character:","Dennys and Sandy, the last subj_char Potential subjective elements considered:","sentence fragment","progressive","seeming verb Of these, the following are subjective elements:","sentence_fragment","seeming_verb Subjective context established by these features:","sentence_fragment","seeming verb The subj char is Dennys and Sandy The situation is now continuing-subj % Even though the sentence ~ a private-state sentence that is not in the % continuing-su~ective situation, the system ident~es the su~ective % character to be the last su~ective characteG because non-subordinated % su~ective elements appear (note that the prog~ssive aspect is not a % su~ective element in this situation).","The next demonstration is on a slightly simplified version of (25.2)-(25.3). (When it is encountered, the last subjective character is the girl.) How could the poor thing have married him?","Johnnie Martin could not believe that he was seeing that old bag's black eyes sparkling with disgust. : Initialize situation to continuing-subj. The situation is now continuing-sub3 : Initialize last_subj char to the girl. the girl is the last subj char",": How could the poor thing have married him?","At the beginning of this sentence: The situation is continuing-subj Expected subjective character:","the girl, the last subj_char 280 Janyce M. Wiebe Tracking Point of View in Narrative Potential subjective elements considered:","question","past_perfective","eval_adjective All of these are subjective elements Subjective context continued by these features:","question","eval adjective","past_perfective The subj_char is the girl The situation is still continuing-subj % The systems abb~v~tionfor an evaluative adjective is ~val~djective'. % The evaluative adjective in th~ sentence is Moor'.",": Paragraph.","Before the paragraph break: The situation is continuing-subj Expected subjective character:","the girl, the last_subj_char","After the paragraph break: The situation is broken-subj The last_subjchar is still an expected subjective character","%'Paragraph'indicatesthata paragraph b~akoccu~ atth~ point. : Johnnie Martin could not believe that he was seeing the old bag's black","eyes sparkling with disgust. At the beginning of this sentence:","The situation is broken-subj","Expected subjective character:","the girl, the last subj char Potential subjective elements not considered:","percept_term","attitude_noun Subjective context established by this feature:","private_state of Idohnnie Martini The subj_char is IJohnnie Martinl The situation is now continuing-subj % The system does not consider the perceptual term ('sparkling') or the attitude noun % ('old bag9 because they are subordinated to the private-state term.","In the following passage, competition arises that is resolved in favor of the last subjective character: Newt had always missed having a father, but the fact that Sean spoke so coldly of his put the matter in a different light. Perhaps he was not so unlucky, after all. He was riding around the herd when Jake Spoon trotted past on his way to Lonesome Dove. \"Going to town, Jake?\" Newt asked. \"Yes, I think I will,\" Jake said. He didn't stop to pass the time; in a second, he was out of sight in the shadows. It made Newt's spirits 281 Computational Linguistics Volume 20, Number 2 fall a little, for Jake had seldom said two words to him since he came back. [McMurtry,"]},{"title":"Lonesome Dove,","paragraphs":["p. 200] The system will be demonstrated on a slightly modified version of the critical part of this passage (Newt is the last subjective character at the beginning): Newt was riding around the herd when Jake Spoon went by on","his way to Lonesome Dove. \"Going to town, Jake?\" Newt asked. \"Yes, I think I will,\" Jake said. He didn't stop to pass the time. In","a second he was out of sight in the shadows. : Previous_subj_char Jake. Jake has been the subj_char"]},{"title":"%Fi~t, thesystem hasto beinformedthatJakehasbeen thesubjectivecharacten","paragraphs":[": Initialize situation to broken-sub3. The situation is now broken-subj : Initialize last_subj_char Newt. Newt is the last_subj_char : Newt was riding around the herd when Jake went by on his way to","Lonesome Dove. At the beginning of this sentence:","The situation is broken-subj","Expected subjective character:","Newt, the last subj char Potential subjective element considered:","progressive It is not a subjective element Newt is the active_char of this sentence The sentence is not subjective Sentence with an active char in broken-subj situation:","situation is now postsubj-active"]},{"title":"% The prog~ssive aspect is a su~ective element on~ in the continuing-su~ective situation.","paragraphs":[": Paragraph.","Before the paragraph break: The situation is postsubj-active Expected subjective characters:","Newt, the last subj char","Newt, the last_active_char","After the paragraph break: The situation is postsubj-nonactive The last_active_char is no longer an expected subjective character The last_subj_char is still an expected subjective character : Ouoted_speech Newt asked. At the beginning of this sentence: 282 Janyce M. Wiebe Tracking Point of View in Narrative The situation is postsubj-nonactive Expected subjective character:","Newt, the last subj char","Newt is the active_char of this sentence","The sentence is not subjective","Sentence with an active_char in postsubj-nonactive situation: situation is now postsubj-active",": Paragraph.","Before the paragraph break: The situation is postsubj-active Expected subjective characters:","Newt, the last_subj_char","Newt, the last_active_char","After the paragraph break: The situation is postsubj-nonactive The last active_char is no longer an expected subjective character The last_subj_char is still an expected subjective character : Quoted_speech Jake said. At the beginning of this sentence:","The situation is postsubj-nonactive","Expected subjective character:","Newt, the last_subj char Jake is the active_char of this sentence The sentence is not subjective Sentence with an active_char in postsubj-nonactive situation:","situation is now postsubj-active : He did not stop to pass the time. At the beginning of this sentence: The situation is postsubj-active Expected subjective characters:","Newt, the last subj char","Jake, the last active_char The sentence is not subjective The situation is still postsubj-active",": In a second he was out of sight in the shadows.","At the beginning of this sentence: The situation is postsubj-active Expected subjective characters:","Newt, the last subj char","Jake, the last_active_char","Potential subjective element considered: perceptterm","It is a subjective element","Competition between the last_subjchar and the last_active_char Choosing the last subj_char because the sentence is about the last_active_char","Subjective context established by this feature: 283 Computational Linguistics Volume 20, Number 2","perceptterm The subj_char is Newt The situation is now continuing-subj % The pe~ept term in this sentence ~ \"sight'. Appendix C: A Test of the Algorithm C.1 Introduction To give an idea of the success rate of the algorithm, this appendix presents the results of a test of the algorithm on 450 sentential input items (exclusive of paragraph and scene breaks) from each of two novels, Lonesome Dove by Larry McMurtry and The Magic of the Glits by Carole S. Adler. Lonesome Dove is an adult novel that has many subjective characters, and The Magic of the Glits is a childrens' novel that has one main subjective character. The input items are those of the complete sentences of every fifth page of these novels, starting in Lonesome Dove with page 176 and ending with page 236 (13 pages total), and starting in The Magic of the Glits with page 1 and ending with page 86 (18 pages total). (For each book, the first part of an additional page was used to make the number of input items exactly equal to 450.) Page 176 in Lonesome Dove is the beginning of a chapter in the middle of the novel. The reason I started in the middle of the novel is that earlier pages were considered during the development of the algorithm.","The system used in this study implements only POV, NEW-CONTEXT, and NEW-CONTEXT'. The results of ITEM and FEATURES are supplied by me. What is being tested in this study is POV--NEW-CONTEXT and NEW-CONTEXT' are not in question, since their mappings follow from the definitions of an interpretation and of a context and its components. What POV is judged against is function H, which is based on my judgements. It maps a sentence into the correct interpretation of the sentence: H : sentence ~ interpretation. Sometimes, either a subjective or objective interpretation of a sentence would be reasonable. For these sentences, I accept the algorithm's interpretation--assuming that s is such a sentence, and c is the context in which s appears, I take H(s) to be POV(FEATURES(S), C). There are fewer than 20 such sentences in the passages from Lonesome Dove and fewer than 30 in the passages from The Magic of the Glits. One goal of our current and planned psychological experiments is to identify the types of situations in which there are significant individual differences among subjects' interpretations.","We will also distinguish between primary and secondary errors, primary errors being the more severe. The algorithm's interpretation of a sentence is a primary error when its interpretation is incorrect given the actual context of the sentence, which is computed from the correct interpretations of all previous sentences. A secondary error is one that results only from previous errors. In this case, the algorithm's interpretation is correct given the actual context, but incorrect given the context computed by the algorithm. The definition of the context computed by the algorithm is given in Section 6.2; the definition of the actual context of the i th input item, aci, is the same, except that H takes the place of POV: aci : ({}, {}, {}, presubjecfive-nonactive> NEW-CONTEXT'(ITEM (t, i -- 1), ci-1) NEW-CONTEXT(H(ITEM (t, i -- 1)), aci-1) if/= 1 if i > 1 & ~SENTENCE (ITEM (t, i -- 1)) if i > 1 & SENTENCE (ITEM (t, i-- 1)) 284 Janyce M. Wiebe Tracking Point of View in Narrative Table 4 Results for Lonesome Dove by interpretation.","Interpretation Actual Instances Primary Errors Incorrect Interpretations (subjective,x / 271/450 (60%) 20/271 (7%) 13 objective","7 (subjective,y), y # x objective 179/450 (40%) 7/179 (4%) 7 (subjective,x / objective, other than 54/450 (12%) 7/54 (13%) 7 (subjective,x) simple quoted speech Table 5 Results for Lonesome Dove by point-of-view operation. Point-of-View Actual Instances Primary Errors Incorrect Interpretations","Operation","continuation 215/450 (48%) 11/215 (5%) 1 initiation","10 objective","resumption 20/450 (4%) 0/20 (0%) --","initiation 36/450 (8%) 9/36 (25%) 5 resumptions","1 initiation","3 objective objective 179/450 (40%) 7/179 (4%) 4 continuations","3 resumptions objective, other than 54/450 (12%) 7/54 (13%) 4 continuations simple quoted speech 3 resumptions C.2 Results Lonesome Dove. We now present the results of the study, beginning with Lonesome Dove. Out of the 450 input items, the algorithm committed 27 primary errors (6%) and 28 secondary errors (6%). We will first give a breakdown of the primary errors according to interpretation in Table 4, and then one according to point-of-view operation in Table 5. Note that many of the input items, 125 of them (28%), are simple items of quoted speech (i.e., they do not have potential subjective elements in the discourse parenthetical, or subordinated clauses outside the quoted string that have private-state terms, private-state-action terms, or potential subjective elements).","Consider Table 4. The first row, for example, should be understood as follows: out of the 271 actual subjective sentences, the algorithm committed 20 primary errors. It interpreted 13 subjective sentences to be objective, and 7 to be the subjective sentence of the wrong subjective character.","Now consider Table 5. The first row, for example, should be understood as follows: out of the 215 items that actually continue a character's point of view, the algorithm committed 11 primary errors. It interpreted 1 of them to be an initiation and 10 to be objective. Notice that the last column of the row for initiations includes an initiation. This means that for one actual initiation, the algorithm was correct that a character's point of view was initiated, but incorrect as to the identity of that character. 285 Computational Linguistics Volume 20, Number 2 Table 6 Results for The Magic of the Glits by interpretation.","Interpretation Actual Instances Primary Errors Incorrect Interpretations (subjective,x / 125/450 (28%) 12/125 (10%) 10 objective","2 (subjective,y/, y # x objective 325/450 (72%) 22/325 (7%) 22 (subjective,x) objective, other than 97/450 (22%) 22/97 (23%) 22 (subjective,x) simple quoted speech Table 7 Results for The Magic of the Glits by point-of-view operation. Point-of-View Actual Instances Primary Errors Incorrect Interpretations","Operation","continuation 79/450 (18%) 4/79 (5%) 4 objective","resumption 41/450 (9%) 7/41 (17%) 2 initiations","5 objective","initiation 5/450 (1%) 1/5 (20%) 1 objective","objective 325/450 (72%) 22/325 (7%) 4 continuations","9 resumptions","9 initiations","objective, other than 97/450 (22%) 22/97 (23%) 4 continuations simple quoted speech 9 resumptions","9 initiations The Magic of the Glits. In The Magic of the Glits, out of the 450 input items, the algorithm committed 34 primary errors (8%) and 21 secondary errors (5%). There are 228 items that are simple quoted speech (51%). Tables 6 and 7 present the kinds of results for this novel that were given above in Tables 4 and 5 for Lonesome Dove.","A particular weakness of the algorithm on novels such as The Magic of the Glits is responsible for a number of the primary errors given in the last two rows of Tables 6 and 7. The salient feature of the novel is that it has two main characters, Jeremy and Lynette, but primarily takes the psychological point of view only of Jeremy. The problem with the algorithm is that very minor subjective contexts of Lynette affect the interpretations of later sentences about her private-state actions--they are treated as private-state sentences, while they should be treated as action sentences.","When a novel primarily takes an external view of a character (Uspensky 1973), descriptions of behavior, quoted speech, and private-state-action sentences are the primary means employed to communicate things about his or her consciousness. However, if a character appears often enough, some reports of that character's private states are bound to appear to explain his or her actions. According to the algorithm as presented in this paper, once a character is the SC of any subjective sentence, all later private-state actions of that character are treated as private states rather than as actions (see Section 11). As suggested in Wiebe (1990), however, this criterion is too weak--what should be required for a private-state action to be treated as a private 286 Janyce M. Wiebe Tracking Point of View in Narrative Table 8 Revised results for The Magic of the Glits by point-of-view operation.","Point-of-View Actual Instances Primary Errors Incorrect Interpretations","Operation continuation 79/450 (18%) 4/79 (5%) 4 objective resumption 41/450 (9%) 7/41 (17%) 2 initiations","5 objective initiation 5/450 (1%) 1/5 (20%) 1 objective objective 325/450 (72%) 10/325 (3%) 1 continuation","9 resumptions objective, other than 97/450 (22%) 10/97 (10%) 1 continuation simple quoted speech 9 resumptions state is that there be a previous subjective context of the actor that is \"significant.\" Some possible, but perhaps arbitrary, definitions of a \"significant\" subjective context are that it contain a represented thought, that it contain a potential subjective element that is indeed subjective, or that it be at least two input items in length. The only reason that one of these heuristics has not been incorporated into the algorithm is that an examination of texts broad enough to choose among them (or to suggest another) has not yet been performed. For The Magic of the Glits, any such heuristic would suffice. In the entire novel (not only in the passages tested), there are a total of 10 subjective sentences attributed to Lynette. All are private-state reports, none has a subjective element, and no two of them appear together. In addition, 5 of them include some description of Lynette's behavior, and, of the remaining 5, 4 are the subjective sentence of Jeremy and Lynette together, not of Lynette alone. If one of the above heuristics were employed, then there would be 12 fewer primary errors and 14 fewer secondary errors. Whether or not one of these heuristics is employed does not affect the results given above for Lonesome Dove.","Assuming one of the above heuristics, the results for The Magic of the Glits would be as follows. Out of the 450 input items, the algorithm would commit 22 primary errors (5%) and 7 secondary errors (2%). Table 8 shows the primary errors broken down according to point-of-view operation, assuming that one of the heuristics discussed above is employed. Notice that the differences between Tables 7 and 8 appear in the last two rows. 287"]}]}