{"sections":[{"title":"Commentary on Bird and Klein John Coleman 1","paragraphs":["(Oxford University) Bird and Klein show us how various phonological constructs--feature geometry, the prosodic hierarchy, well-formedness constraints on strings of segments, templatic/autosegmental phonology, morphology-phonology interactions, and vowel-zero alternations-may be treated in a rigorous fashion using the the formal resources of HPSG. To the incautious critic (or the skeptical phonologist) it may seem that they have given us merely a new notation in which to express conventional phonological analyses, such as Tranel's analysis of French schwa epenthesis or Goldsmith's textbook examples of Sierra Miwok.","A central principle of Bird and Klein's approach that takes it beyond notation is Phonological Compositionality and the related concept of monotonicity, mentioned almost in passing in Section 3.3. Among the consequences of monotonicity are: (1) feature values may not be altered; (2) segments or other structural material may not be removed (i.e. delinking and restructuring, such as resyllabification, are prohibited); and (3) constraints are not extrinsically ordered; in fact, extrinsic rule ordering is in-expressible.","An accommodation with orthodox generative phonology with regard to (1) may be found by employing underspecification, translating feature-changing rules into feature-filling constraints. Objections to extrinsic ordering have been raised at various times before, and many phonologists would like to be rid of it, so Bird and Klein's proposals regarding (3) are welcome. Many phonologists find (2) very unpalatable, however, despite the fact that Bird and Klein's example of French schwa insertion is also potentially applicable to some putative cases of deletion. A deletion rule operative in Welsh mutation, which removes /g/ from the lexical representation of"]},{"title":"gardd","paragraphs":["in some environments, but leaves it present in the citation form, could be treated in HPSG phonology as consonant-zero alternation on a par with French schwa. This alternation is only treated as deletion because it is the noncitation form that lacks the initial consonant.","Other apparent cases of deletion are more awkward for declarative approaches. In English trisyllabic shortening (e.g."]},{"title":"profane --* profanity)","paragraphs":["and"]},{"title":"-ic","paragraphs":["shortening (e.g."]},{"title":"t6ne t6nicity),","paragraphs":["orthodox analysis deletes a vowel slot and association lines incident to it. To treat these as instances of vowel-zero alternation would appear to require the representation of the stem to be sensitive to the presence of a very particular set of suffixes"]},{"title":"(-ic, -ity,","paragraphs":["etc.). HPSG phonology might either analyze these using different CV templates, like Sierra Miwok allomorphy, or reject the bisegmental analysis of phonological length, by treating shortening as the addition of a \"shortness\" feature (e.g. trisyllabic-shortening(V) --* I-long]). I do not expect either of these proposals to be popular. In any case, reconstructing morphophonological rules such as the above in declarative style will not satisfy some critics, for whom any suggestion of languagespecific rules is anathema. References Halle, M., and Mohanan, K. P. (1985). \"Segmental phonology of modern English.\""]},{"title":"Linguistic Inquiry","paragraphs":["16(1), 57-116. 1 Oxford University Phonetics Laboratory, 41 Wellington Square, Oxford OX1 2JF, U.K. 492"]}]}