{"sections":[{"title":"Commentary on Kaplan and Kay Graeme Ritchie I","paragraphs":["(University of Edinburgh) To appreciate this article fully, it is essential to understand the historical context into which it fits, and which it has to some extent created. Although formally published for the first time here, it is already an extremely influential and classic piece of work.","Finite-state machines, in one form or another, have been used for the description of natural language since the early 1950s, with the extension to transducers appearing in the 1960s. After Chomsky's stern condemnation of the adequacy of finite-state machines for describing sentence structures, they virtually disappeared from mainstream theoretical linguistics. Within computer science, they continued to be a standard for-malism, although transducers were not accorded the same detailed algebraic attention as simple automata.","Phonologists, meanwhile, were inventing a variety of rule mechanisms that were (with rare exceptions) only partly formalized. Superficially, most of these systems (as typified by those of Chomsky and Halle) appeared to have little to do with finite-state machines. Indeed, their notations tended to suggest that the rules had much more than finite-state power.","Kaplan and Kay have integrated these two streams of work--algebraic treatment of automata in computer science, and phonologically-motivated formalisms within linguistics--and their results should feed back productively into both subfields. The framework they have established allows the comparison of different competing formalisms in a rigorous manner, and permits the exploration of the formal limitations or capabilities of rule notations that were previously more like expository devices than formally defined systems.","What may not be clear to the casual reader is that this work has been developed over many years, and early versions of it have already escaped into the computational linguistics community in less prominent forums. In this way it has already affected the course of research into phonological/morphological formalisms. Perhaps the most notable (and in its turn, influential) development has been Koskenniemi's two-level morphology, which has been successfully applied to the morphology of a very wide number of languages. Koskenniemi's ideas are a direct development of Kaplan and Kay's, as explained in Section 7 of the paper here.","The theory of regular relations and finite-state transducers should not be viewed as a mere re-formalisation of 1960s linguistics. As well as its relevance to the two-level model, Kaplan and Kay suggest that it may also throw light on the formal properties of autosegmental phonology. Although the ideas were first circulated about 15 years ago, they are still of central relevance to computational phonology today. References Chomsky, N. (1957). Syntactic Structures. Mouton. Koskenniemi, K. (1984). \"A general computational model for word-form recognition and production.\" In Proceedings, l Oth International Conference on Computational Linguistics/22nd Annual Meeting of the ACL. 178-181. Stanford, CA.","Chomsky, N., and Halle, M. (1968). The Sound Pattern of English. Harper and Row. 1 Department of Artificial Intelligence, University of Edinburgh, Edinburgh EH1 1HN, Scotland. 380"]}]}