{"sections":[{"title":"On the Semantics of Japanese Particles wa and mo and Their Interaction with Quantifiers","paragraphs":["Ryoya Okabe Sophia University","r_okabe©sophia.ac.jp Abstract In this paper, two Japanese particles wa and mo are taken up. Wa is known as a topic marker and mo is a correspondent of English particles too and also. After reviewing several studies that claim topics and particles like too and also evoke alternatives, a formal semantic system with structured meanings is constructed for wa and mo, incorporating the insights of the previous studies. The proposed semantics of wa and mo, then, is applied to adverbial quantifier constructions and an attempt is made to derive the special implicatures added by the particles by means of their semantic properties and pragmatic inferences. 1 Introduction: Japanese Particles and Adverbial Quantifiers This paper concerns the semantics of two Japanese particles wa and mo and tries to derive the special meanings they show when attached to adverbial quantifiers.","It is well-known, since (Kuno, 1973) pointed it out, that wa has thematic and contrastive uses. Thematic wa marks the topic of a sentence. Topics, as discussed in the literature, must be some entity that the participants in the conversation are or may easily be aware of. Taroo in (la), for instance, may probably be an acquaintance of both participants. (1b) is felicitous because the sentence is about whales in general and generic nouns can count as an well-established entity.","(1) a. Taroo-wa\\tkita. Taroo-TOP came S̀peaking of Taroo, he came.'","b. Kujira-wa\\thonyuu-doobutu da. whale-TOP mammal\\tis Ẁhales are mammals.'","The other particle mo, which is also much discussed in the Japanese literature and quite interesting, is the counterpart of English adverbials such as too, also, or either which assert there are other objects that satisfy a certain property that is already known to be true of something else.","(2) Taroo-ga\\tkita.\\tJiroo-mo\\tkita. Taroo-NOM came Jiroo-TOO came 'Taroo came. And Jiroo came, too.' The second sentence of (2), for example, presupposes that there is someone who came, which is confirmed by the presence of the first sentence, and asserts that, in addition to this person, Jiroo did the same thing. I will call the phrase to which mo is attached an additive, and this particle may be referred to as an additive marker. 235","These two particles, along with several others, display quite intriguing characteristics when attached to numerical phrases such as san-nin \"three (people)\", go-hon \"five (long objects)\", etc. which are used adverbially, namely, as so-called floating quantifiers.","(3) a. Gakusei-wa\\tsan-nin-wa\\tkita. students-TOP three (people)-TOP came Àt least three students came.' \\t","b. Gakusei-wa\\tsan-nin-mo\\tkita. students-TOP three (people)-TOO came Às many as three students came.' San-nin-wa in (3a), for example, hints that there may be more students who came than the speaker knows, and hence may be interpreted as \"at least three (people).\" San-nin-mo, on the other hand, indicates the number in question (namely, three in this case) is beyond expectation, and therefore may be translated into \"as many as three (people).\" That is, wa adds an implication that the number is minimum, and mo implies that the number is excessive with respect to a certain standard. I will call these implications added by these particles minimum and excessiveness implicatures, respectively.","Contrast these with wa and mo attached to nominal phrases. Quantifiers can also be used as nominal phrases that refer to a certain group of people. When wa and mo are attached to nominal quantifiers, they need not add the implicatures mentioned above.","(4) a. San-nin-wa\\tkita. three (people)-TOP came T̀he three people came.' \\t","b. San-nin-mo\\tkita. three (people)-TOO came T̀he three people came, too.' In these examples, it seems that the noun phrase san-nin should be taken to be definite and refer to three contextually known and identifiable people.","Even in these cases, however, similar implicatures could be added, probably when the noun is emphasized. If we stress san-nin in (4a), it appears to suggest, though not necessarily, that the speaker does not know whether those three are the only people who came.","If we stress san-nin in (4b), on the other hand, the sentence may suggest that the three people were not supposed to come, although what is not expected is not the number, but the people themselves.","Given that similar, though not exactly the same, implicatures are induced by wa and mo whether they are attached to adverbial quantifiers or nominal phrases, it is desirable to unite their functions as topic and additive markers with their minimum and excessiveness implicatures.","The paper is organized as follows. In the following two sections, we will briefly review several semantic analyses of topics and additive markers in English. In section (4), we will then formalize semantics of wa and mo amalgamating the systems reviewed in the previous sections. Finally, in section (5), we will take up adverbial quantifiers and see if the proposed semantics can deal with the minimum and excessiveness implicatures."]},{"title":"2 Boring's Semantics of Sentential Topics","paragraphs":["In this section, we will review (Biiring, 1997)'s semantics of sentential topics (S-Topics), which utilizes alternative semantics that was developed by (Rooth, 1985).","In (Rooth, 1985), each expression receives two types of interpretation: the first type is the ordinary value which represents the expression's meaning and the second is the focus value 236 which is a set of alternatives to it. The focus value of an expression is sensitive, as the term itself suggests, to whether or not the expression is (or includes) the focus. The ordinary value of John, for example, may be represented as j, the individual named John independently of its focushood. If the phrase is not in focus, its focus value will be {j}, the set which consists only of its ordinary value, while the focus value may be, say, lj,b, t, .1 if it is focused - the set that comprises all the alternatives to j (including j itself). (5) [John]p likes Mary a. ordinary value: like(j, m) b. focus value: {like(j, m), like(b, m), like(t, m), ...} (6) John likes [Mary]F a. ordinary value: like(j,m) b. focus value: flike(j,m),like(j,n),like(j, e), ...} The sentences in (5) and (6), which differ only in the placement of focus, have different focus values while they share the ordinary value. The focus value of (5) contains alternative propositions to its ordinary meaning, (5a), obtained by replacing the focused element, j, by its alternaives. Likewise, the focus value of (6) contains alternative propositions although these alternatives are obtained by replacing m, not j, which corresponds to the focused expression.","With these focus values, (Biirin.g, 1997) defines the Context Condition which must be satisfied by the context so the sentence must be appropriate in it.","(7) Context Condition S can be uttered given context (CG,DT) if [SY = DT and there is no sentence S' such that Ply C Pity and [StG = DT. In this definition, a context is taken to be a pair of the Common Ground (CG) and the Discourse Topic (DT). CG is, following (Stalnaker, 1978), the knowledge shared by the participants in the conversation, which is represented as a set of possible worlds. DT is a set of propositions, that is, a set of sets of possible worlds, which determines the appropriateness of an utterance.","There is an additional condition that must be mentioned to understand the Context Condition. DT is supposed to contain only propositions informative and compatible with respect to CG. Since [Sr is included in [SY, i.e. DT, ISâ° must also be informative and compatible.'","Biiring, then, multiplies semantic objects by adding the third type of value which he calls topic value in order to account for several phenomena that involve S-Topics. The following are the examples given in (Biiring, 1997).","(9) a. Do you think that Fritz would buy this suit? b. Well [1]7, certainly [wouldn't]F.","(10) a. What did the pop stars wear? b. The [female] T pop stars wore [caftans]F.","(11) a. Did your wife kiss other men? b. [MAT wife [didn't] F kiss other men. l Informataivity and compatibility with respect to CG are defined in (Biking, 1997) as follows.","(8) a. Informativity: p is informative with respect to CG if CG fl p CG. b. Compatibility: p is compatible with respect to CG if CG fl p 0. 237","The topic value of a topic phrase is a set of sets each of which consists of one alternative to its ordinary value. For example, I[John] T"]},{"title":"I","paragraphs":["t is {{i}, {b}, {t}, ...}. The topic value of a non-topic phrase, on the other hand, is the set whose only member is its focus value. Thus [like [Mary] F]t = {[like [Mary] F ] f } = {{like(m),like(n),like(e)}}. The topic value of the whole sentence fJohnJT likes [MaryJF may be (12).","(12) {{like(j, m), like(j, n), like(j, e)}, {like(b, m), like(b, n), like(b, e)}, {like(t, m), like(t, n), like(t, e)}, ...} Given a new kind of semantic value, Boring revises his Context Condition accordingly.","(13) Context Condition S can be uttered given context (CG,DT) if DT E [Sit (and there is no sentence S' such that"]},{"title":"Env","paragraphs":["C ISItir and DT E EST). He further states that S-Topics are connected with a certain implicature which says that the topic value of a sentence contains some disputable question (i.e. a set of propositions).","(14) A set of proposition Q is disputable given a Common Ground CG, DISP(Q,CG), iff there are propositions p E Q such that p is informative and non-absurd with respect to CG, i.e. iff 3p E"]},{"title":"n","paragraphs":["C G OSzp"]},{"title":"nCGOC","paragraphs":["Gi","(15) Impicature connected with S-Topic in a sentence A: 3q[q E EAr&DISP(q,CG"]},{"title":"n [A]°)]","paragraphs":["In (9), for example, the question forms DT, {buy(f,thnh),-ibuy(f,thnh)}, which is contained in the topic value of the answer. The answer is counted appropriate because the Context Condition is met though it does not provide a direct answer to the question."]},{"title":"3 Semantics of Additive Markers","paragraphs":["In this section, we will review two analyses of English additive markers such as too and also, namely, those of (Karttunen and Peters, 1979) and (Krifka, 1991). Though the main topics of these analyses are not additive markers, but other focus sensitive operators like only or even, they are a great help in constructing a semantics of wa and mo in the next section. Both analyses seem to take the English additive markers to be focus sensitive operators."]},{"title":"3.1 (Karttunen. and Peters, 1979)","paragraphs":["(Karttunen and Peters, 1979), in accounting for the conventional implicatures of certain lexical items, especially that of even, extend (Montague, 1974)'s system by providing two kinds of semantic expressions to each English phrase. The first one is the ordinary denotation of the phrase and is called extension expression. The other is what represents the implicature the phrase has and is called implicature expression.","The extension expression of a complex phrase may be calculated by conjoining the extension expressions of the constituent phrases in a way that is defined by rules, as customarily done in Montague semantics. The implicature expression, on the other hand, is obtained by, roughly speaking, applying the functor's implicature expression to the extension expression of the argument, and conjoining it with the implicature expression of the argument with the conjunction operator A.2","Although their exemplification mainly concerns even, they also touches upon too. Too RULES, which they do not elaborate on, might look like the following. I will somewhat simplify the rule for the sake of readability.","2 More precisely, (Karttunen and Peters, 1979) introduces a third kind of meaning. Like, for example, is associated with liken besides the extensional expression and the implicature expression. The third kind of expression is needed to deal with the projection problem and determines whether to inherit the presupposition of a complement. 238","(16) a. [Too RULE]: If a is a T-phrase and is a t-phrase containing an occurrence of HEn (hen , shen or itn), then Ftoo,n(a ) 0) is a t-phrase and derived from by replacing the first occurrence of HEn and each of subsequent occurrences by the corresponding unsubscripted pronoun whose gender matches the gender of a and by a and adding too at the end. [Translation]: (ae (n0e ); ffai (in0e ) A in0e(a)] A tooi (A ae, in 01])","b. tool = AP[AQ[Q()y3x[qx} A -1\\i x = j} A P(y)i) In their system, a focused noun phrase is \"quantified in,\" and at the same time too is introduced \"syncategorematically\" just as the quantifier every . Thus toot has access to the interpretations of both the focused phrase and and the rest of the sentence. The sentence in (17) in which John is focused yields the meanings in (17a) and (17b) (17) Polinjp drinks too. a. extensional expression: drink:(j) b. implicational expression: 34* {x} A\\t= j] A drink:(v x)] The implicature espression says that there is some contextually determined entity x who is not John and who drinks. 3.2 (Krifka, 1991) The other analysis is the structured semantics advocated in (Krifka, 1991) and (Krifka, 1995), in which focus induces division of meaning into the background part and the focus part. [John]p drinks, for example, is interpreted as (AX.X(Ax.drink(x)),J), the first coordinate is the background which corresponds to the unfocused part of the sentence. The second coordinate is the focus part which is the interpretation of the focus John.","The particle also, whose meaning is defined in (18), is then fed with this structured meaning to yield the following interpretation for the whole sentence. (18) also((a, 0)) :4-+ Av[a(0)&3X[X 13&X Aci(X)(v)}] (19) J(Ax.drink(x)) A 3X[X c:$JA X JA X(Ax.drink(x))] Thus the meaning of John drinks, too is that John drinks and there is some Alternative of John who drinks.","It should be noted, however, that in this analysis the semantic contribution that also makes is incorporated as a part of the assertion, not a presupposition. 4 Formalization of Semantics of Wa and Mo 4.1 Triplet Interpretations for Japanese We have briefly seen three analyses of English topics and additive markers. The last two of them were based on structured meanings although they are defined in different ways. (Krifka, 1991) divides the meaning into the background part and the focus part, while (Karttunen and Peters, 1979)'s meaning consists of the extensional expression and the implicational one.","In this section, We will attempt to apply the analyses to the Japanese particles wa and mo.","Recall that too and also are treated as focus sensitive operators. At this point, it may be worth pointing that the phrase to which wa or mo is attached need not bear stress, and thus need not be the focus. Therefore both the following two information structures are possible.","(20) a. Taroo-wa\\tkonakattano? Taroo-TOP didn't-come D̀idn't Taroo come?' 239","b. [Taroo-mo]T [kita.]p Taroo-TOO came T̀aro° came, too.'","(21) a. Hokani dare-ga\\tkitano? besides who-NOM came Ẁho else came?'","b. [Taroo-mo] F [kita]T Taroo-TOO came T̀aro° came, too.' As can be seen from the discourse given above, the contexts in which these two structures are appropriate seem to be different. Nonetheless, both sentences share the truth conditional meaning and the presupposition. They say that Taroo came and presuppose that there is someone else who came.","To correctly analyze (20b), then, we have to take into consideration alternatives of both the mo-marked phrase and the focus phrase, which certainly will complicate the calculation. Further, as we have seen in section 2, the topics also induce alternatives. We could add the fourth type of semantics objects to Biiring's theory, say additive value, which gives the alternatives of mo-attached phrases. Such a proliferation of semantic objects, however, is obviously undesirable given the possibility of other Japanese particles such as dake, sae and the like that might induce alternatives.","We can, instead, take the sentence in (20b) as a case of \"multiple foci\" although the term \"foci\" might be a little misleading because topics and additives are also intended to be covered by this term. So let us dub the phenomena \"multiple alternates\".","(Krifka, 1991) elaborates on various multiple focus constructions within structured semantics and therefore we might readily adapt his system so that topics and additives could be included. In light of presuppositions, however, I think the adaptation need some elaboration because topics and additives, both of which bear presuppositions, interact with each other within a sentence and there seems to be no place for projection of presuppositions in Krifka's theory unless we make some revisions.","Therefore I propose a hybrid analysis of (Krifka, 1991) and (Karttunen and Peters, 1979). The meaning of a phrase is divided into two parts. The first is its literal meaning, which corresponds to the extensional expression of (Karttunen and Peters, 1979) and the second is implicational meaning. The fisrt of these, which I will call the assertion value, is further divided into the background and focus as in (Krifka, 1991), The second also consists of two types of implicatures. The first type is so-called presuppositions, propositions that are taken for granted by the participants and decide the appropriateness of an utterance. I will call this type of meaning of a phrase presupposition value. The other type is conventional implicatures associated with lexical items that, unlike presuppositions need not be satisfied before the utterance but simply are added to CG. This type of meaning will be call implicature value","Thus a phrase is associated with three semantic concepts, assertions, presuppositions and implicatures. In terms of informational structure, the background of the assertion and the presupposition together form the conditions on the prior context. And the focus part and the implicatures constitute the new information the utterance contributes to CG.","Further I assume all assertion values are divided into the background and the focus regardless of their focushood. To ensure this, let me introduce a null focus, represented as e, which occupies the focus part of the meaning of a phrase with no focus. I assume that e is of a special type E and has the following properties. (22) Properties of e 240 a. a(s) = a b. a•e=e•a=a","e is the only entity of type E. So a variable of type e also complies with the above rules. The three semantic values mentioned above are represented by 0 a ,"]},{"title":"op","paragraphs":["and z , respectively. The interpretation of a phrase is the triple of these values. [al p is an entity of the same type as its assertion value and Ear is a set of entities, likewise, of the same type. The presupposition value of a sentence, therefore, is a proposition, while its implicature value is a set of propositions. The propositions in the implicature value, as I said above, must be informative with respect to CG. For simplicity, I assume that proper nouns like Taroo do not carry any presuppositions and any implicatures. 3 The interpretation for Hanako can be obtained by replacing the individual constant t by h.","(23) a. [Taroo}J","a = (AP(e)A.P(t), e) b. ITaroor = T ((e)A)A c. ETarooll i = 0","For the same reason, the verb butts is also taken to carry no presuppositions and no implications.","(24) a. [buttal a = (AyAx.hit(x, y), e) b. [buttajP = T(e)((e)t) c. [butta] z = 0","We now turn to the definition of functional application. Recall that the assertion value of a phrase is divided into two parts. So we must first define functional application between assertion values. This is defined in (25) taken from (Krifka, 1991). Unlike Krifka's system, we need only to give one definition because every assertion value is invariably structured and conform to this rule (with the help of the 6-convention defined in (22).) An example is given in (26). (25) Assertion Application: (aA ,f3B )((7c, D )) = (AX B • YD[a(X)(7(Y))], 5)","(26) (AT .T , (AP(e)A.P(h), e))((AyAx.hit(x, y), e)) = (AX((e)A A) • Ye [AT.T (X) (Ay Ax .hit(x , y)(17,))], (AP(e)A.P(h), e) • e)"]},{"title":"=","paragraphs":["(AX((e) A)A [X (AyAx.hit(x, y))1, (AP(e)A.P(h), 6))","We then have to define functional application for triplet interpretations. The assertion value of the resultant phrase is obtained by the assertion rule we have just seen. The rule for determination of the presupposition value is adapted from (Karttunen and Peters, 1979). To put it in a general form, I will follow (Krifka, 1995) in using t7 for a (possibly null) sequence of terms of appropriate types and numbers.4","Several modifications should be made to Karttunen and Peters's original definition. In (Karttunen and Peters, 1979), the implicature expression of the functor is fed with the extensional value of the argument. I will instead assume only the background of the argument is passed on to the presupposition value of the functor. 5 This is what the first half of the presupposition","3 1 will occasionally put subscripts to variables and other expressions to clarify their types where it seems to be preferable. T(A)B is the null presupposition of type (A)B and can be defined inductively as AX A .TB , where Tt is the tautology. Further, I will take generalized quantifiers to be of a polymorphic type ((e)A)A with A ranging over (e)t, (e)((e)t) and so on in order for the rules to be written in general forms so as to save space.","4 In many of the examples that follow, 27 is used in a form like P(x)(i1), where P is of a type that ends in t (i.e. (...)((. t))), x is its first argument and il represents all the other arguments. Hence P(x)(11) may be assumed to be of type t.","5 I suppose this is plausible in view of the differences in informational status of the background and focus; The meaning conveyed by the focus, that is, a piece of new information, should not be smuggled into the presupposition, a part of the old information. 241 value in (27) states. BG((a, 13)) = a and FC((a, 0)) = j3. Suppose, for example, the functor presupposes AX(e)A .3ne)A)A[Y P•dd aa A Y aa A Y (X)] and the assertion value of the argument is (AX((e) A) A[X(AyAx.hit(x, y))], (AP(e)A.P(h), E)) (=(26)). Then, on the assumption that the argument presupposes nothing, the presupposition of the whole phrase might be like (28), which says that some proper alternative of aa hit some alternative of Hanako.","(27) Functional Application: (aa , aP , ai )(A)B((laa /i8P ,/3i)A) = (aa(3a), AiIPX[[aP(merge(BG((3a ))(X))](17)AX kid merge(FC (fla ))1A3W(A)B {W aa AW (i3P)(M, {7(merge (Pa ))(017 E ai l U {Ati3W(A)B[WN aa A W (8) MI5 E\\t(X is of the same type as FC (Pa).)","(28) 3Z(e)A [AX(e)A3Y- ((e)A)A[Y aa A Y aa A Y (X)](BGPX((e)A)A[X (AyAx.hit(x, O)], (AP(e)A.P(h), e)))(Z))) AZkid merge(FC (t1---((e)A)A{X(AyAx.hit(x,y))], (AP(e)A•P(h), a))))] = 3Z(e)A [AX( W\",e)A--- ‘ (e)A)A[Y aa A Y aa A Y (X)](AX((e)A)A[X (AyAx.hit(x,y))}(Z)) A","it:is merge((AP(e)A -P(h), 6))] = 3z[AX(e)A .3/7((e)A)A[Y aa A Y aa A Y (X)](Z (AyAx.hit(x,Y))) A Z N AP(e)A.P(h)] = 3z[3Y((e)A)A [Y aa A Y aa A Y (Z (AyAx.hit(x, y)))] A Z AP(e)A.P(h)] Merge is just a minor modification which is necessitated to convert structured assertion values to ordinary (unstructured) value. Its definition is given in the appendix.6 4.2 The Interpretation of Focus and the Particles I will treat focus feature F and the particles wa and mo as an independent phrase whose interpretation is a function from triplet interpretation to triplet interpretation. The interpretations of these are given below. (29) Focus: [F1((a a , aP , ai )) ((AT.T, aa ) , aP, ai U fetal)","(30) Topic: [waj((aa , aP, ai ))\\t(aa , Ax(e)AAilaP (x)(t7 A 3Y((e)A)A [11\"\\taa A 0y(x)(6) 0-T(x)(i)111, az U fAX(e)AAnYi(e)A)A[Y N a a A 0 ( x) (OM","(31) Additive: Emoll(aa ,aP , az )) = (aa , AX(e)AAillaP (X)V A 3Yi(e)Am[Ir N aa A y\\taa A Y (X )(27)11, ai) Several comments are in order. Focus turns the assertion value of its argument into the focus part by pairing it with the null background AT .T , and also put it in the implicature value at the same time. Then this value will be passed on to higher phrases via functional application, and its variables may be eventually bound by existential quantifier. This has the effect of making aa in (29) entirely new information. See the examples below.","Next, wa introduces both a presupposition and an implicature. 0 in the definition is to be read epistemically, as the dual of 'it is known that.' I tentatively assume 'it is known that' may be defined as 'it follows from CG that.' Then, OP means that it does not follow from CG that","Read in this way, the presupposition in (30) says that there is some alternative X such that we do not know whether X Y-ed or not. I take this to be what roughly corresponds to (Baring, 1997)'s DT.","6 Yet another modification is the latter half of the presupposition value, BW(A)B [W aa A W(,&)01]. This corresponds to like h mentioned in footnote (2). Since we will not deal with sentential complements, the presupposition of the argument may simply be inherited. The type of a presupposition, however, accords with that of the assertion value, so its inheritance involves a slight modification to it. In (Karttunen and Peters, 1979), likeh is defined as AP V P[P{P}]. According to this definition, likeh feeds a dummy variable to the implicature expression and immediately binds it with an existential quantifier. In my definition, by contrast, the implicature value is fed to a dummy variable. One reason I chose this definition is its simplicity. I do not know at the moment whether this will make a substantial difference.","The implicature value, on the other hand, says that there still is some X, even after the assertion is made, such that it does not follow from CG that X did not Y. Note that, assuming an ordinary semantics of modal logic, 0-.1' is compatible with This means that even if 0---T(X) is true, it may still be possible that it is known that X did not Y. However, 0--.P is a weaker proposition than q -4' and asserting a weaker proposition often implicates the negation of a stronger one as 'some...' implicates 'not all. . .2 Thus I suppose that 0--T(X) pragmatically implies -0--,Y(X), that is, 0-Y(X). This corresponds to the residual topic of Biiring.","Lastly, mo only introduces one presupposition to the effect that there is some alternative X, which is different from a a , who Y-ed. The reason may be fairly clear.","With these definitions, we can now analyze sentences such as (32) and (33). I will only list the results and leave detailed derivations to the appendix.","(32) .[Taroo-wa] T [Hanako-o] F\\tbutta. Taroo-TOP Hanako-ACC hit 'Taroo hit Hanako.' a. [(32)J\" = (AY/%--- k(e)A)A.[Y(AyAx.hit(x, y))(t)], (AP(e)A.P(h), 6)) b. [(32)JP = 3X((e)A)A[aK(e)A)ArY N AP(e)A.P(t) A OY (X (AyAx .hit(x , y)) A","0--T (X (Ay Ax shit(x , y))}} A X AP(e)A.P(h)] c. 1(32)j i\\t-1311;L-- k (e)AM[Y AP(e)A•P(t) A X (Ax.hit(x, h))],","3X((e)A)APY((e)A)A[Y AP(e)A .P (t) A Y P(e)A .P (t) A 0--.17 (X (Ay Ax .hit(x , y))]] A N AP(e)A.P(h)]}","(33) [Taroo-mo] F Hanako-o\\tbutta Taroo-TOO Hanako-ACC hit 'Taroo hit Hanako, too.' a. [(33)1a = ()IX ((e)A)A [X (Ax.hit(x, h))}, (AP((e)A)A-P(t), e)) b. [(33)P = 317((e)A)AlY P4.1 AP((e)A)A•P(t) A Y AP((e)A)A-P(t) A 17 (Ax.hit(x , h))] c. [(33)i2 = { hit(t, h)} 5 Adverbial Quantifiers In this section, I will try to derive the minimum and excessiveness implicatures of wa and mo with their semantic definitions explicated in the previous section. To fulfill this purpose, we must define the meaning of adverberbial quantifiers beforehand. As I mentioned earlier, Japanese quantifiers may be used both as a noun phrase and as an adverbial. What we are concerned with in this paper is adverbial ones and therefore the former usages will be ignored.","I include so-call plural objects in the domain of individuals which are formed from singular entities with the sum operator. Numbers such as 3 and 16 are taken to be predicates over individuals which count the number of the singular objects. Thus I assume that the domain of individuals is organized into a join semilattice like the ones developed by (Ojeda, 1993), (Moltmann, 1997), and (Link, 1998).","Adverbial quantifiers are interpreted, following the customs of the Montague semantics, as functions from predicates to predicates, that is, those of type ((e)t)((e)t). The adverbial quantifier Sannin \"three (people)\", for example, is translated into the following. 3(x) in this definition is intended to mean the number of singular individuals that fall under x is three. (34) (AP(e)t Axe [P(x) A 3(x)], T We should have added to this definition the condition that x must be human to ensure the quantifier can be applied to only human beings. Since this condition does not affect the argument that follows, I will omit such conditions on types of objects for convenience. ((e)t)((e)t), 0) 243","The noun phrase gakusei (\"students\") are interpreted as a existential generalized quantifier with no presuppositions and implicatures. (35) (AP(e)AA113xe [students(x) A P(x)(ii)], T((e)A)441 0) (36) is analyzed as follows.","(36) Gakusei-wa\\tsannin-wa\\tkita students-TOP [three (people)-TOP] F came a. [(36)1a =","(AQ ((e)t)((e)0 3xe[students (x) A Q( AYe .come (Y))(x)}, AP(e)tAxe[P(x) A 3(x)D b. [(36)P = 3X((e)t)((e)i) [X isanninla A 0--3xe [students(x) A X (Aye.come(y))(x)]] C. [(36)ji BX((e)t)((e)t){X isannini a A X [sanninj a A 0-3xe [students(x) A X (Aye.come(y))(x)]]","Let n be an abbreviation of AP(o t Axe [P(x) A n(x)]. Then ALT(Esanninn may well be understood to be fiiIn is a natural number}. Note that this set has a natural ordering among its members related to inference relation: If n < m, then for any property P, 3x[P(x) A rrt(x)] D 3x[P(x) fi(x)).","[(36)1i says that there is some number n, different from three, such that it is not known whether there are n-many students who came. Since the assertion value of the sentence asserts that there are three such students, this number cannot be less than three because of the inference relation just mentioned above. Therefore the number must be greater than three. Further, as we have seen in the previous section, 0.--T is a weaker assertion than 0-,P, thereby pragmatically implying the negation of the latter, .0.P. Thus, after the assertion of (36), there still must be some number n such that whether there is n-many students who came is at issue. This means that an utterance of (36) pragmatically implies it is not known whether more than three students came.","Now for the excessiveness implicature.","(37) Gakusei-wa\\tsannin-mo\\tkita students-TOP [three (people)-TOO] ,p came a. [(37)1a = (AQ((e)t)((e)i) 3xe[students(x) A Q(Aye .come(y))(x)], AP(e)t Axe [P(x) A 3(x)]) b. [( 37)]P 3X((e)t)((e)t)[X Esannini a A X [sanninja A 3xe[students(x) A","X (Aye.come(y))(x)]]","The presupposition value requires that, prior to the utterance, there must be some number n, different from three, such that it is known that there are n-many students who came. The number cannot be greater than three, because, if we knew that more than three student had come, it might be pointless to assert that (at least) three students came, because it is already implied by the presupposition. Therefore the presupposed number must be less than three.","Suppose, for the sake of argument, that the presupposed number is not mentioned in the prior discourse. Then, this number should be one that can be easily accommodated or inferred from the common ground, which means that it must be readily expectable that that number of students came. Hence the number mentioned i.e. three exceeds that inferable number.","Regrettably, I do not have any good idea about why the presupposed number should not be mentioned in the prior discourse at the moment. But I suppose that it might be related to the fact that the presupposed proposition is implied (in a logical sense) by the asserted proposition in this case. 244 6 Conclusion It must be admitted that the analysis of wa and mo proposed in this paper is very crude and incomplete, and the data that are covered is too limited.","As noted in the last section, the pragmatic process to derive the minimum and excessiveness implicatures is rather obscure and has yet to be spelled out.","In the course of argument, I tacitly assumed that so-call contrastive topic is a topic that is focused. While the definitions given in this paper do yield a semantic representation for such constructions, I am not sure whether that correctly represents the differences between contrastive and non-contrastive topics, and if it does, how those differences arise.","Several constructions germane to my proposal were left out of consideration for want of time.","For example, two noun phrases marked by wa may appear in one sentence. I have not yet deliberated on what the meanings might be that my analysis will assign to such sentences.","Negation might be yet another intricate but intriguing matter. Adverbial quantifiers interacts with negative operators exhibiting scopal ambiguity, and this seems to be related to the informational structure of the sentence. It should be closely investigated whether the relation between scopal ambiguity and informational structure is to be explained adequately when negative operators are incorporated into the theory presented here. A Appendix: Definitions and Derivations","(38) a. [Tarooja = (AP(e)A- P (0, E) b. [TarooP = T((e)A)A c. Paroor = 0","(39) a. Ebuttar = (AyAx.hit(x,y), e) b. [buttaiP = T(e)((e)t) c. [buttal2 = (40) Assertion Application: ( a44)0B)((7C, D)) = (AXB • YD [ci (X) (101)1,13 • 5)","(41) Functional Application: (aa , aP , ai ) (A) B(( 34 3 1 /(3i )A) = (aa(i3a), AtIPXRaP (merge(BG(Pa ))(X))1(17) A X merge(FC(fla ))] A 3W(A)B [W re, aa A W(3P)(i7)1], {7(rnerge(Pa ))01)17 E ai l U fAtI3W(A)B{W Pds aa"]},{"title":"n","paragraphs":["w (8)03118 E (X is of the same type as FC (f3a).) (42) Focus: [F]((aa , aP , ai )) = (OTT, aa ), aP , ai U {al)","(43) Topic: Ewall((aa , aP , ai )) = (a°, AX(e)A AtlaP (X) (V A 31r((e)A)A[17 aa A 0Y(X)(13) A 0--,Y(x)(V)ii, U fAX(e)AA/13Yi(e) A) A [Y Pe, aa A 0-,Y(x)(011).","(44) Additive: [moj((a a ,\\tai )) = (aa , AX(e)A )1ti[aP (X) A 3Y((e)A)AiY aa A Y"]},{"title":"a","paragraphs":["a A Y(X)(ii)jj, ai) (45) Merge: merge(a) a. merge(a) = merge(f3)(merge(7)) if a = (0 ,-y) , and b. merge(a) = a otherwise. (46) [Taroo-wal T [Hanako-o] F butts","a. [[Hanako o] F] = IF] Panakol) = IFIR(OP(e) A .P(h), e), T ((e)A)A, 0)) = ((AT.T, (AP(e)A.P(h), 6)), T ((e)A)A, {(AP(e)A•P(h), 6 )1)( = [1]) 245 b. I[Hanako-c] F buttal [1] ([buttal) = [1](((AyAx.hit(x, y), e), T (e)((e)i) O)) [[Hanako-o] Fr buttala = (AT .T , (AP(e)A .P (h), e)) ((AyAx.hit(x, y), e)) = (AX((e)A),9 [X (Ay)1x.hit(x, y))], (AP(0A•P(h), e)) [[Hanalco-o]p buttar = Aze .PICe(T ((e)A)A (BG(NAx.hit(x, y), e))(X))(z) A X el A 3147((e)A)A[W k-̀'s AP(e)A .P(h) A W(T(e)((e)t) (z))1] = Aze.PX,[Them)A (AyAx.hit(x,Y)(X))(z) A X ,.;.; e] A T] = Aze .[T A T] = T(ot [[Hanako-o]F butta]i = Imerge((AP(e)A •P(h), 6)) (mer ge ((AyAx .hit(x , y), e)))). = {AP(e)A .P(h)(AyAx.hit(x, y))} = {Ax.hit(x, hil","c. [[Taroo wa]T] = Ewall[Tarool) = PP(e)A.P(t), e), AX(e) A MIT((e)44 (X)(131 A","3Y((e)A)A[Y r.t.1 AP(e)A.P(t) A 0Y(X) A 0-1Y(X)11)","fAX(e)AAil3Y((e)A),4[Y A/A0 A .P(t) A Y AP(e)A .P(t) 0-1Y(X)11)","d. [[Taroo-wa] T [Hanako-o]p buttal = i[Taroo-wa]TEE[Hanako-o] F buttal) [(46d)ia = (AP(e)A.P(t), e)((AX (\\trx(e)A)A,-- (AyAx.hit(x, OA, (AP(e)A•P(h), 0)) = (AY((e)A)A .[Y(AyAx.hit(x, y))( t)], (AP(e)A•P(h), E)) IR46d)P = 3X((e)A)A[AX(e)AAibir ((e)A)A( X )(17) A 3Y((e)A)AV AP(e)A .P(t) A","---((e)AM{X03 (X) A 0--,17 (X)j11(BG(1\\t(AyAx.hit(x, Y))i, (AP(e)A•P(h), e))) (X) A X 'Al AP(e)A.P(h)] = 3X((e)A)APYi(e)A)ASY AP(e)A .P(t) A 4Y (X (AyAx.hit(x, y)) A 0.--iY(X(AyAx.)zit(x ) y))]] A X ke, AP(e)A .P (h)]","iii.\\t = t _.\\ta. ((e)) ,..[(46d)11i\\trw 1%,, AP\\tP(t) A W (Ax.hit(x , NA} References Biiring, Daniel. 1997. The Meaning of Topic and Focus: The 59th Street Bridge Accent. Routledge,","London.","Karttunen, Lauri and Stanley Peters. 1979. Conventional implicature. In Choon-Kyu Oh and David A. Dineen, editors, Presupposition, volume 11 of Syntax and Semantics. Academic Press, New York, pages 1-56.","Krifka, Manfred. 1991. A compositional semantics for multiple focus constructions. In Proceedings from Semantics and Linguistic Theory I, pages 127-58.","Krifka, Manfred. 1995. Focus and the interpretation of generic sentences. In Gregory N. Carlson and Francis Jeffry Pelletier, editors, The Generic Book. The University of Chicago Press, Chicago, pages 238-64. Kuno, Susumu. 1973. The Structure of the Japanese Language. The MIT Press, Cambridge, MA.","Link, Godehard. 1998. Algebraic Semantics in Language and Philosophy. CSLI Publications, Stanford, CA. Moltmann, Friederike. 1997. Parts and Wholes in Semantics. Oxford University Press, New York.","Montague, Richard. 1974. The proper treatment of quantification in ordinary English. In Richmond H. Thomason, editor, Forman' Philosophy. Selected Papers of Richard Montague. Yale University Press, New Haven, pages 247-70. Ojeda, Almerindo. 1993. Linguistic Individuals. CSLI Publications, Stanford, CA. Rooth, Mats. 1985. Association with Focus. Ph.D. thesis, University of Massachusetts at Amherst.","Stalnaker, Robert. 1978. Assertion. In Pragmatics, volume 9 of Syntax and Semantics. Academic Press, New York, pages 315-32. 246"]}]}