{"sections":[{"title":"Pragmatic Inference with Conditionals and Concessives in. Japanese","paragraphs":["Yasunari HARADA","School of Law Waseda University","1-6-1, Nishi-Waseda, Shinjuku-ku","Tokyo, Japan","harada@mn.waseda.ac.jp Kumiko HONDA","Center for Japanese Language","Waseda University","1-6-1, Nishi-Waseda, Shinjuku-ku","Tokyo, Japan khonda@mn.waseda.ac.jp Abstract Expressions in Japanese with indeterminates such as \"nani (what)\" and \"dare (who)\" get interpretations very much like universal quantification or existential quantification when followed by conjunctive particle \"mo\" or disjunctive particle \"ka\". Focusing our attention on sequences of the form <indeterminate + ka> such as \"nani-ka (something)\", they generally get interpretations of \"something exists which\" in affirmative sentences, whereas they generally get interpretations of \"something exists which does not\" in negative sentences. Interestingly, the latter with negation changes its figure in conditional sentences and in concessive conditional sentences. In both of these, negative sentences with sequences of the form <indeterminate + ka> get not only interpretations of \"something exists which does not\" but also interpretations of \"nothing exists which\", depending on the situation in which utterances take place. Similar phenomena can be seen with numerals, where negation can take either a narrower or a wider scope with respect to numerical quantification in conditionals and concessives. In this paper, we would argue that those phenomena could be accounted for by postulating pragmatic inferences with conditionals and concessives, and by assuming that Japanese focus particles \"wa\" and \"mo\" in these cases function as a conditional operator and a concessive operator respectively. 1\\tIntroduction: Something in Conditionals Japanese sentences with indeterminates such as \"nani (what)\" and \"dare (who)\" get interpretations very much like existential quantification when followed by disjunctive particle \"Ica\", as seen in (1):","(1) Nani-ka\\ttabe-ta. what-KA\\teat-PAST \"There is something that I ate.\" In (1), the sequence of the form <indeterminate + ka> (\"nani-ka\", somedfing) 2 refers to an indeterminate entity which the speaker ate. Similarly, the sequence of the form <indeterminate + ka> in the negative sentence (2) gets an interpretation very much like existential quantification:","(2) Nani-ka\\ttabe-nakat-ta. what-KA\\teat-NEG-PAST \"There is something that I didn't eat.\" I In the following examples, we use designations shown below: PRES: non-past, PAST: past, NEG: negative, TOP: topic, NOM: nominative, ACC: accusative, COND: conditional particle, and POL: polite auxiliary verb. 2 We assume that \"kd' is a disjunctive particle. We will discuss this issue in section 6. See also Harada and Honda (2000). 223 Here, \"nani-ka\" refers to an indeterminate entity which the speaker did not eat, and the presupposition here is that the speaker presumably ate other things. Sequences of the form <indeterminate + ka> in negative sentences such as (2) generally do not get an interpretation in which there is \"nothing\". We can express these two statements as the following, using the standard predicate logic, to see the scope relationships. (3) 3x [P(x)1 (4) 3x [-,P(x)1","Sequences of the form <indeterminate + ka> with negation, however, can get an interpretation of \"nothing\", when it occurs either in conditional sentences or in concessive conditional sentences.","(5) Nani-ka\\ttabe-nakere-ba,\\to-naka-ga-suku. what-KA\\teat-NEG-COND\\tget-hungry-PREs \"If I don't eat anything, I'll get hungry.\"","(6) Nani-ka\\ttabe-nalcu-te-mo\\thutoru. what-Li\\teat-NEG-coND\\tget-fat-PREs \"Even if I don't eat anything, I'll get fat.\" In (5) and (6), the former of which is a conditional sentence and the latter a concessive conditional sentence, \"nani-ka\" gets the interpretation that there is nothing that the speaker ate. In both of these cases, negation takes a wider scope than existential quantification.3 2\\tNumerals in Conditionals Similar phenomena can be seen with numerals. In the default reading of negative sentences with numerals, numerical quantification takes a wider scope over negation, but negation can take either a narrower or a wider scope with respect to numerical quantification in conditionals and concessives.","(7) Mittsu\\ttabe-ta. three\\teat-PAST \"I ate three (of them).\"","(8) Mittsu\\ttabe-nakat-ta. three\\teat-NEG-PAST \"I did not eat three (of them).\" While three in (7) refers to the quantity of what the speaker ate, three in (8) refers to the quantity of what the speaker did not eat.\" Negation in (8) takes a narrower scope as in the case of (2) with the sequence of <indeterminate + ka>. Then, let us see numerical quantification in negative conditionals and concessives in the following examples.","(9) Mittsu\\ttabe-nakere-ba,\\to-naka-ga-suku. three\\teat-NEG-coND\\tget-hungry-Ps \"If I don't eat three (objects), I'll get hungry.\"","3 Negation could take a narrower scope in conditionals and concessives depending on the situation. (i) Chuumon-shita\\tryouri-no-uchi, nani-ka\\ttabe-naku-te-mo,","order-PAST\\tdish-in\\twhat-KA\\teat-NEG-COND","o-kane-wa harawa-nakere-ba-nara-nai.","money-TOP pay-must-PRES","\"Even if you leave some dish untouched, you have to pay the charge for all the dishes you ordered.\"","We cannot go into a detailed discussion of this issue here. See also 'math (1993).","4 Scope relationships in negative sentences are influenced by various factors. Also, speakers of Japanese differ","somewhat with respect to the default interpretation of these sentences. 224","(10) Mittsu\\tLabe-naku-te-mo,\\thutoru. three\\teat-NEG-coND\\tget-fat-Pis \"Even if I don't eat three (objects), I'll get fat.\" Suppose that three refers to the number of Japanese rice-balls. In the conditional sentence (9), three refers to the number of rice-balls to eat. In concessive conditional sentence (10), three refers to the number that numerates rice-balls to eat, too. 5 In both of these cases, negation takes a wider scope.","We have seen that something and numerals in negative conditionals and concessives behave somewhat similarly with respect to the scope of negation. In the following sections, we will examine pragmatic inferences involved in the interpretation of conditionals and concessives. 3\\tConditionals and Concessives In logical inferences, conditional proposition of the form PQ entails a proposition of the form","whereas in pragmatic inferences, conditional proposition of the form P Q induces an implicature as shown in (11b). (11) a\\tcasanw [ P mug [ Q]. \\tb.\\tcctuncti [ -.43 ]\\t[ Similarly, in pragmatic inferences, concessive conditional proposition of the form PQ induces an implicature as shown in (12b). (12) octscrirK [ P\\tRESULT [ Q]. \\tb.\\tcrtuncti [\\tREsuT [ Q].","With regard to English conditionals, Fauconnier (1994: 114) notes that \"the first half of [(13a)] carries the implicature that only in situation such that 'you are good' will Jesus love you. [A]nyway [and/or but] in the second half cancels this implicature\", and that \"the implicature is not directly linked to counterfactual conditionals, but rather to conditionals in general\". (13) a\\tIf you are good, Jesus will love you, but if you are bad, Jesus will love you anyway. \\tb.\\tCCtriltN[ P] EFFECT( Q ], but octuncNt\\tEFFECII Q] anyway. He also points out that \"[in (130], the overall effect is that Q holds in all situations.\" What we have here are two types of conditionals; one is a simple conditional as shown in (11) and another is a concessive conditional as shown in (12).","A Japanese example that corresponds somewhat straightforwardly to (13a) would be something like (14a).","(14) a.\\tTabere-ba,\\thutoru.\\tTabe-naku-te-mo,\\thutoru. eat-wA\\tget-fat-PREs\\teat-roc-pro\\tget-fat-PREs \"If I eat, I'll get fat. Even if I don't eat, Pll get fat.\" \\t b.\\teckuirN [\\tRESULT\" Q ]. CCNIXIEN [\\tRESULT\" Q]. In the first sentence in (14a), we have a simple conditional with a focus particle \"wa\" .6 In the second sentence in (I4a), what we have is another focus particle \"mo\", whose most common function is 5 In (7) and (8), scalar implicature holds. \"I ate three,\" implies \"I ate two,\" and \"I ate one.\" Similarly, \"I did not eat three,\" implies \"I did not eat two,\" and \"I did not eat one.\" On the other hand, such scalar implicature does not hold for three in (9) and (10). 6 The focus particle \"wad' and the conditional particle \"ba\" are the same lexical item. We will discuss this issue in section 4.1. 225 additive. The entire sentence here is concessive in meaning. A variant of (14a) is something like (15a).","(15) a.\\tTabe-te-mo,\\thutoru.\\tTabe-naku-te-mo,\\thutoru. eat-also\\tget-fat-ms\\teat-NEG-also\\tget-fat-Pis \"Even if I eat, I'll get fat. Even if I don't eat, I'll get fat.\" b.\\tcatilati [ P]= RESUITE Q}. amin [ P]\\tQ]. Interestingly, expressions corresponding to \"but\" or \"anyway\" are not required in (14a) or (15a), although these express the same kind of logical link as in (13). In both of these, P and -if' represent incompatible conditions, and both of these bring the same result Q.7","The union of P and -4) can be expressed as a simple concatenation as shown in (16), where no connective corresponding to \"but\" is allowed in between.","(16) a.\\tTabe-te-mo,\\ttabe-naku-te-mo,\\thutoru. eat-also\\teat-NEG-also\\tget-fat-PREs \"Whether I eat or I don't eat, I'll get fat.\" b.\\tcctiornai [ P]+ cacuni [\\tRiau [ Q]. In (15) and (16), the union of P and -\"II comprise \"all situations\", and in this sense this has much to do with universally quantified condition.","We would like to note that focus particle \"wa\" functions as a conditional operator in natural inference concerning conditionals, and that conjunctive particle \"mo\" functions as a concessive operator in natural inference concerning concessive conditionals. This suggests that natural inference in conditionals and concessives can be accounted for as functions of lexical items such as \"wa\" and \"mo\" in Japanese. 4\\tConditional and Concessive Operators In this section, we will consider how Japanese focus particles \"wa\" and \"mo\" interact with pragmatic inferences concerning conditionals and concessives. 4.1 Focus and Contrast: \"wa\" The Japanese focus particle \"wa\" is typically used in statements of topic-comment style.","(17) Tokyo-wa\\tima\\tsan-ji-desu. Tokyo-WA\\tnow three-o'clock-be-PoL-PREs \"As for Tokyo, it's three o'clock now.\" This usage of \"wa\" is usually referred to as topicalization of the object. In a statement of topic-comment style such as \"A-wa B-da. (A is B.)\", topic A is generally focused because it is the topic of the statement. In such a case, focusing force of \"wa\" does not emerge even though the topic is focused. Then, let us see the following examples of alternations between accusative particle \"o\" and focus particle \"wa\".","(18) Pan-o\\ttabe-ta. bread-Acc\\teat-PAST \"I ate bread.\"","(19) Pan-wa\\ttabe-ta. bread-WA\\teat-PAST \"I ate bread.\" 7 Under general assumption of the world we live in, a sentence like \"Tabe-te-mo, hutoru.\" in (15a) is somewhat strange in isolation without \"Tabe-naku-te-mo, hutoru.\" See Gawron and Harada (1996). 226","where R = P L.) Q, andPn(2=0. Figure 1 Partitioning Sentence (18) is a neutral statement with respect to focusing and says that the speaker ate bread. On the other hand, in (19), focus particle \"wa\" is used instead of accusative particle \"o\". In this case, the statement has an implicature to the effect that the speaker ate bread and did not eat other food; e.g. eggs, salad, and so on. This comes about from the contrast.","Focusing some element in a sentence amounts to making a statement to the effect that some predication holds of the object that corresponds to the focused element in some other circumstances. In other words, focusing an element in a sentence is to give a particular condition in which the predication holds with the object in question. Thus, sentence with focus particle \"wa\" such as in (19) can be changed to a sentence with conditional particle \"ba\", as shown in (20):","(20) Pan-de-are-ba\\ttabe-ta. bread-be-BA\\teat-PAST \"If it is bread, then I ate it.\" Historically, the conditional particle \"ba\" and the focus particle \"wa\" in Japanese are one and the same lexical item. Sentence (20) expresses the logical link shown in (21a). (21) a.\\tamnia' [ P ] RESUT [ Q]. b.\\tCCNIIICN [\\t] RESUT Sentence (20) is a conditional statement and expresses that if P holds then Q holds. A proposition of the form P Q does not logically imply a proposition of the form --, \\tbut pragmatically implicates a proposition of the form Also, a proposition of the form PQ in Japanese induces contrastive proposition of the form –,11 --V. This contrastive proposition clearly shows an implicature seen in (19). Sentence (19) expresses that the speaker ate bread and implicates that the speaker did not eat objects which are not bread. \"wa\" functions as a conditional operator in this way. 4.2 Addition, Conjunction and Concession: \"mo\" In this section we consider Japanese expressions with the focus particle \"mo\". The most typical use of \"mo\" can be seen in (22), where \"mo\" is additive.","(22) Naomi-mo\\tki-ta. Naomi-MO\\tcome-PAST \"Naomi came, too.\" Here, very roughly speaking, a proposition to the effect that Naomi came is added to the preexisting set of propositions to the effect that x came, where x varies over a set of elements that share the invariant property that x came and x is not Naomi. The additive use of \"mo\" extends to conjunctive coordination as in (23):","(23) Ken-mo\\tNaomi-mo\\tId-ta. Ken-MO\\tNaomi-MO\\tcome-PAST \"Both Ken and Naomi came.\" Here, very roughly speaking again, the propositions that Ken came and that Naomi came are mutually additive. If the domain of discourse is the set of {Ken, Naomi}, then this amounts to a universal quantification.","We would like to examine another issue of partitioning and polarity, concerning conjunctive coordination and concessive conditionals. First, we define partitioning simply as shown in Figure 1. In Figure 1, R is partitioned into P and Q, and then P and Q comprise R as the whole. This is closely related to universal quantification. Now, let us see the following examples: 0 A LFFT 1","•••• nn • n ••• [EVENT falling-from-a-tree] [FALLER Al PALLE-Ws AGILITY A] Figure 2 Scale of LFALL-FROM-TREE","(24) a. Him-mo yoru-mo daytime-MO night-MO \"I am busy night and day.\" isogashii. be-busy-Pis","b. Ne-te-mo\\tsame-te-mo, shigoto-ga \\tatama-kara\\thanare-nai. sleep-MO\\tbe-awake-MO job-Nom\\thead-from\\tleave-NEG-PREs \"Whether I'm asleep or I'm awake, the matter of business haunts my mind.\"","c. Tabe-te-mo,\\ttabe-naku-te-mo,\\thutoru. eat-MO\\teat-NEG-MO\\tget-fat-PREs \"Whether I eat or I don't eat, I'll get fat.\" In (24a), the sum of \"hiru (day)\" and \"yoru (night)\" is a whole day. Here a day is partitioned into two sub-parts. The same can be seen in (24b), in which the sum of \"ne-te-iru (to be asleep)\" and \"same-te-iru (to be awake)\" is also a whole day. In (24c), \"taberu\" ( P = to eat) and \"tabe-nar ( = not to eat) differ in polarity. Here, again, the sum of \"taberu (to eat)\" and \"tabe-nai (not to eat)\" is the whole, because all we can do with respect to \"eating\" is either \"to eat\" or \"no to eat\".","A more interesting use of \"mo\" can be seen in (25), where the expression with \"mo\" interacts with scalar implicature.","(25) Sara-mo\\tki-kara\\tochiru. Monkey-MO tree-from\\tfall-PREs \"Even monkeys fall from a tree.\" This Japanese proverb corresponds to an English proverb \"Even Homer sometimes nods\" and says that even monkeys fall from a tree, which implicates that everyone fails. Given our previous analysis of \"mo\" as an additive operator, we would assume that a proposition to the effect that monkeys fall from a tree is added to the preexisting set of propositions. This does not capture the actual intention of the proverb.","What we get with a sentence such as (25) is a scale along which various objects are aligned depending on the likelihood of its falling from a tree. This scale is not induced by \"mo\" but is obtained by our default knowledge relating to the likelihood of monkeys falling from a tree. We have a kind of default knowledge to the effect that monkeys live among trees; therefore monkeys have low likelihood of falling from a tree. This is a natural reasoning, while assuming that monkeys fall from a tree is not. When an unlikely proposition is assumed, we have concession.","Figure 2 is a graphic representation of a scale of likelihood with respect to X falling from a tree. The object a corresponds to monkeys falling from a tree as expressed with \"mo\" in (25), and objects of { , ..., fin I correspond to other possible objects falling from a tree. The horizontal axis represents the value of FALLER's AGILITY, expressed in some real number, and the vertical axis represents the value of LFFr ranging over real numbers from 0 to 1, which is the likelihood of the object falling from a tree. To the extent that it is natural to assume that the greater the agility of an object, the smaller its likelihood of falling from a tree, it should be as natural to assume that the relation can be expressed as a decreasing function. Given this set up, the object a with the highest A value takes the lowest LFFT value. If it is stated that the LFFT value for a is substantial, we infer that the LFFr values for all fis are substantial, too.","Thus, the additive operator \"mo\" adds the object a which takes a lower value of likelihood compared to the set of objects fis each of which takes a higher value. In other words, the object a is conceded. Our account suggests how concession induces quantificational interpretation. 228 5\\tSomething and Nothing in Conditionals and Concessives In this section, we will go back to the issue of the interpretation of the sequence of <indeterminate + 1w> in negative conditionals. First, let us see the following example.","(26)\\ta.\\tNani-ka\\ttabere-ba,\\thutoru. what-KA\\teat-coND\\tget-fat-PREs \"If I eat something, I'll get fat.\" b. oxcart.\" [ P] RESUT [ Q]. c. coNancti. [ -41 ] RES= [","d. Nani-ka\\ttabe-nakere-ba,\\thutora-nai. what-.KA\\teat-NEG-coND\\tget-fat-NEG-PREs \"If I don't eat anything, I will not get fat.\" Sentence (26a) expresses the logical link shown in (26b), and induces an implicature shown in (26c). In (26b) and (26c), condition P and -LP differ in polarity. Here, negation in -P takes a wider scope. The logical link in (26cj is expressed in Japanese as shown in (26d). The sequence of <indeterminate + Ica> appears here. Sentence (26d) induces an implicature shown in (26b), and condition and P differ in polarity. Here again, negation in --IP should take a wider scope. Next, we consider the case of concessives. \\t","(27) a\\tNani-ka\\ttabe-naku-te-mo\\thutom. what-KA\\teat-NEG-MO\\tget-fat-PREs \"Even if I don't eat anything, I'll get fat.\" b. CCNDMCN [\\tRESIT [ Q]. c. actscarN [\\tREST Q].","d. Nani-ka\\ttabere-ba\\thutoru.8 what-KA\\teat-coND\\tget-fat-Pus \"If I eat something, I'll get fat.\" In concessives, incompatible conditions bring the same result. In (27), condition -IP and P differ in polarity, and negation in -IP takes a wider scope. Thus, the sequence of <indeterminate + 1w> in negative concessives goes inside of scope of negation. The relationship between condition P and -IP is easy to interpret in cases where the two have different polarity.9","Now, let us examine a different case involving numerals, where we cannot find the same kind of contrast in polarity. What we find here are contrastive propositions that take numerals as their variable.","We can express \"Nani-ka tabe-te-mo, hutoru.\" instead of sentence (27d). See footnote 7. That \"mo\" is used in (27a) shows that a proposition of presupposes a proposition of Q, and that these two propositions comprise conjunctive coordination. 9 The sequence of <indeterminate +ka> in Japanese is not a noun phrase but an adverbial phrase. Similar phenomena can be seen in adverbial phrases like the following:","Tama-ni\\tmail-ga\\tko-nakere-ba,\\tsabishii.","occasionally email-Nom come-NEG-coND be-lonely-PRES","\"When I don't get mails occasionally, I feel lonely.\" \"Tama-ni (occasionally)\" is an adverbial phrase, and could get two types of interpretations when it occurs in conditionals or concessives with negation; (1) \"If I don't get email (even) occasionally, I get lonely,\" and (2) \"If I don't get email, which happens (only) occasionally, I get lonely.\" Negation in the former takes a wider scope, and negation in the latter a narrower scope (Harada and Imani (personal communication in 1991)). See also Imani (1993). 229 \\t","(28) a\\tMittsu\\ttabe-nakere-ba,\\to-naka-gasuku. three\\teat-NEG-coND •\\tget-hungry-PREs \"If I don't eat three (rice-balls), I'll get hungry.\" b. ocwarN [ -41(3)j MUTE Q 11° c. OCNXIICN [ P(3)] RESUT","d. Mittsu\\ttabere-ba\\to-naka-ga-suka-nai. three\\teat-coND\\tget-hungry-NEo-PREs \"If I eat three (rice-balls), I will not get hungry.\" A contrastive proposition of (28a) is a proposition of (28d). A numeral three in both of these propositions expresses the number that designate the number of \"rice-balls\" to eat. On the other hand, numerals in concessives gets a different interpretation. First, we will examine the following case: \\t","(29) a.\\tHitotsu\\ttabe-to-mo,\\thutoru. one\\teat-MO\\tget-fat-PREs \"Even if I eat one (rice-ball), I'll get fat.\" \\t b.\\tccmucti [ P(1) } RESULT[ Q]. A numeral \"one\" expresses the smallest number in natural language, and an implicature of the whole sentence is that the likelihood of a person who eats only one rice-ball getting fat should in general be quite small but this unlikely event should happen. Figure 3 is a graphic representation of this scale of likelihood. In Figure 3, represents an object eating one rice-ball, and j3, an object eating n numbers of rice-balls. In this case, our scale of likelihood is an increasing function, in which the greater number of rice-balls, the greater the likelihood of getting fat. Now, consider the next example. (30)\\ta. n •• n •• nn [EVENT eating-riceballs] [NUMBER NI ••• n • nn ••• nn Figure 3 Scale of LGET-FAT 10 Here, --(numeral) stands for a proposition to the effect that speaker does not eat numeral (objects). 11 Note that Figure 3 expresses a scale of likelihood based on a general knowledge, which forms the basis of concession. Therefore the value of likelihood of P(2) and P(1) are lower than that of P(3), in Figure 3.","In the following example, scalar implicature seems to be limited to the neighborhood of the particular number mentioned in the sentence.","Kyaku-ga\\t50-nin\\tko-naku-te-mo, party-wa\\thajime-rareru.","guest-NOM 50-person\\tcome-NEG-MO party-TOP\\tstart-can-PREs","\"Even if 50 guests will not come, we can start the party.\" In (iii), --,P(50)Q could have a scalar implicature of P(49)Q, but propositions ofP(1.)Q and P(2)Q do not seem to be presupposed. This example seems to be free from general knowledge, because this kind of party protocols are not general enough. Mittsu\\tLabe-to-mo,\\thutoru. three\\teat-MO\\tget-fat-PREs \"Even if I eat three (rice-balls), I'll get fat.\" b.\\tocwiaN [ P(3)\\tRESULT[ Q]. Here again, sentence (30) has an implicature that the likelihood of a person who eats three rice-balls getting fat is quite low, and this unlikely event should happen.\" Finally, we should consider the following example:"]},{"title":"0","paragraphs":["N 230","(31)\\ta.\\tMittsu\\ttabe-nalcu-te-mo,\\thutoru. three\\teat-NEG-MO\\tget-fat-Pus \"Even if I don't eat three (rice-balls), I'll get fat.\" b. octicerN [ -,./P(3) 1\\tRESLIT\\t]. c. octsurrEN [ P(3) I REKIT Q].","d. Mittsu\\ttabere-ba\\thutoru. three\\teat-corm\\tget-fat-PREs \"If I eat three (rice-balls), I'll get fat.\" A negative concessive sentence (31a) induces an implicature shown in (31d). Concession involves a counterfactual figure of speech in which an event is supposed to take place which cannot take place in reality. Therefore, a proposition, as shown in (31d), that would be induced as an implicature of the concessives (31a) is sometimes too natural. We could say that it is not informafive. In (31a), not eating three objects means eating two objects and eating one object. So the sentence (31a) induces the following inferences: (32) a.\\tcctunw [ P(2)] RESULT [ Q ]. b.\\tcacorN [ P(1) ] RESULT [ Q]. Here, we notice that negative concessives (31a) employs a scale of likelihood as shown in (30), which is affirmative concessives. Figure 3 expresses a scale of likelihood of general knowledge, not of concession. Any reasoning has to employ Figure 3 as its background. Thus, scales of likelihood can be seen as representations of everyday commonsense reasoning and knowledge. 6\\tSomething in Question The sequence of <indeterminate + Ica> gets an interpretation of \"something which exists\" in negative question, where negation takes a wider scope as well as in conditionals and concessives. First, we discuss how disjunctive particle \"ka\" functions in existential quantification and question.12 6.1 Disjunction, Partitioning and Quantification: \"ka\" Japanese particle \"Ica\" is used in disjunctive coordination, as shown in (33) and (34).","(33) Ken-ka\\tNaomi-ga\\tIci-ta. Ken-KA\\tNaomi-Nom Come-PAST \"Either Ken or Naomi came.\"","(34) Ken-ga\\tlci-ta-ka\\tNaomi-ga\\tki-ta-ka\\twakara-nai. Ken-NOM\\tcome-PAST-KA Na0Mi-N0M Come-PAST-KA know-NEG-PRES \"I don't know whether Ken came or Naomi came.\" The most common usage of \"ka\" is found in disjunctive coordination. Sentence (34) has an embedded question, which comprise disjunctive coordination. In (33) and (34), speaker believes that one of the two propositions to the effect that Ken came and that Naomi came is true, but is not sure which proposition is true. In this sense, disjunctive use of \"ka\" has an indeterminacy regarding the belief of the speaker. 13 12 We assume that question marker \"ka\" and disjunctive particle \"ka\" are not only homophonous but that these two are the same lexical item. In question, \"ka\" functions only as a disjunctive operator. With respect to \"ka\" in question, Dr. Mitsu OKADA has expressed a similar idea. (Talk at Tokyo University in 1995 and also personal communication at Linear Logic Workshop held at Keio University in 1999) 13 Japanese disjunctive particle \"1w\" gets not only so-called \"or\"-reading but also \"and\"-reading, depending on the utterance situations. See Harada and Honda (2000). 231","The two referents of the two disjuncts in (33) and (34) comprises the whole set, if the domain of discourse is the set consisting of Ken's coming and Naomi's coming. The disjunctive particle \"kr is partitioning in nature. Partitioning is closely related to disjunction. Let us see an example in which the disjunctive particle \"1w\" is used in existential quantification with indeterminate expressions as shown in (35):","(35)\\tDare-Ica\\tici-ta. who-KA\\tcome-PAST \"Someone came.\" In sentence (35), the sequence of <indeterminate + ka> expresses something like existential quantification. In this example, \"ka\" simply functions as a disjunctive operator. In cases where indeterminate expression \"dare (who)\" is followed by \"Ica\" as shown in (35), the semantic representation of the whole sentence would be something like (36): (36) Came(e l) v Came(e2) v v Came(en) Here, we get an interpretation quite like that of existential quantification. Each disjunct would have a general form of \"x came\", where x ranges over a set of entities that share the invariant property that x came. That at least one of these disjuncts holds is very much similar to 3x [Came(x)] in the standard predicate logic. 6.2 Partitioning and Question Another partitioning use of \"ka\" is found in embedded questions as shown in (37):","(37) a.\\tKen-ga\\tki-ta-ka\\tNaomi-ga\\tki-ta-ka\\twakara-nai. Ken-isum\\tcome-PAST-KA Naomi-Nam\\tcome-PAST-KA know-INEG-FRES \"I don't know whether Ken came or Naomi came.\"","b. Ken-ga\\tki-ta-ka\\tko-nakat-ta-ka\\twalcara-nai. Ken-isum\\tcome-PAsr-KA come-lam-PAST-KA\\tknow-NE33-FRES \"I don't know whether Ken came or he did not come.\"","c. Ken-ga\\tki-ta-ka\\tdou-ka\\twakara-nai. Ken-hum\\tcome-PAsr-KA how-KA\\tknow-MG-PiEs \"I don't know whether Ken came or not.\" Here are three variations of embedded questions in which we can see partitioning into two propositions. In (37b) and (37c), the whole set of possible situations regarding Ken's coming is partitioned into two, one in which Ken came and the other in which Ken did not come, with different polarity assigned to the truth of Ken's coming. Similarly, in (37a), the whole set of possible situations regarding someone's coming is partitioned into two, one in which Ken came and the other in which Naomi came. The domain of discourse here is the set consisting of Ken and Naomi.","An embedded question is not a query directed toward the addressee. On the other hand, in the case of questions, as shown in (38), a sense of query is directed to the addressee:","(38) a.\\tKen-ga\\tki-mashi-ta-ka,\\tNaomi-ga\\tki-mashi-ta-ka? Ken-NOM\\tcome-POL-PAST-KA\\tNaomi-N0M come-POL-PAST-KA \"Did Ken come or did Naomi come?\"","b. Ken-ga\\tki-mashi-ta-ka,\\tki-mase-n-deshi-ta-ka? Ken-NOM\\tCOIne-POL-PAST-KA.\\tcome-POL-NEG-PAST-KA \"Did Ken come or did he not come?\"","c. Ken-ga\\tId-mashi-to-ka? Ken-NOM\\tcome-POL-PAST-KA \"Did Ken come?\" 232 In (38a) and (38b), we clearly see partitioning of relevant situations. The example in (38c) is a straightforward question: \"Is it the case that Ken came?\"","As an utterance, question has indeterminacy. There might be many ways in which indeterminacy is involved in a question in natural languages. For example, in Japanese, (i) we can insert indeterminate expressions in the proposition, (ii) we can use disjunction to express indeterminacy of the truth of propositions as shown in (38a) and (381)), and (iii) we can use the disjunctive particle \"ka\" as sentence-final question marker to express indeterminacy of the truth of P, as shown in (38c). Thus, we assume that question is essentially partitioning, which is expressed as disjunction in Japanese.","The sequence of <indeterminate + 1w> in question as disjunction could be seen in the following examples:","(39) a\\tNani-ka\\ttabe-mashi-to-ka? what-KA\\teat-PoL-PAST-KA \"Did you eat something?'","b.\\tNani-ka\\ttabe-mase-n-deshi-to-ka? what-K4\\teat-PoL-NEG-PAsT-K4 \"Didn't you eat something?\" Sentence (39a) is a disjunctive question whose two disjuncts are expressed as \"is it the case that you ate something, or isn't it the case that you ate something?\" Similarly, sentence (39b) is a disjunctive question; \"Isn't it the case that you ate something, or is it the case that you ate something?\" In both of these cases, two disjuncts differ in polarity. We assume that this difference in polarity between the two propositions can make our interpretations easier. And we have another way to make this polarity difference clearer.","(40) Nani-ka,\\ttabe-mashi-ta-ka,\\ttabe-mase-n-deshi-to-ka? what-KA\\teat-PoL-PAST-KA\\teat-POL-NEGPAST-KA \"As for something, did you eat it, or didn't you eat it?\" This is a disjunctive coordination of questions. In this case, negation takes a wider scope as well as in (39b). That is simply because these two disjuncts share only one something. Is there something that you ate, or isn't there something that you ate? Both something refer to an entity that you ate. Assuming that something would be existential quantifier, quantification cannot overscope negation in both of these disjuncts.\" 7\\tConclusion Expressions in Japanese with sequences of the form <indeterminate + ka> such as \"nani-ka (something)\" generally get interpretations of \"something exists which\" in affirmative sentences, whereas they generally get interpretations of \"something exists which does not\" in negative sentences. The latter with negation changes its figure in conditionals and concessives. In both of these, negative sentences with sequences of the form <indeterminate + ka> get not only interpretations of \"something exists which does not\" but also interpretations of \"nothing exists which\", depending on the situation in which utterances take place. Similar phenomena can be seen with numerals, where negation can take","14 We can see the similar disjunction in the following invitation-like question. (iv)Nani-ka\\ttabe-masu-ka? \\t what-KA\\teat-PoL-KA \"Do you eat something?\"","(v) Nani-ka\\ttabe-mase-n-ka? \\t","what-KA\\teat-POL-NEG-KA","\"Don't you eat something?\"","In invitation-like negative question, as shown in (v), negative sense is rather weak, but negation takes a wider","scope here as well as in (39b) and (40). 233 either a narrower or a wider scope with respect to numerical quantification in conditionals and concessives. In this paper, we suggested that those phenomena could be accounted for by postulating pragmatic inferences with conditionals and concessives. In these pragmatic inferences, we saw many variants of conjunctive and disjunctive coordination. These inferences are conducted along coordination, and interaction between quantification and negation can also be found in coordination. References","Fauconnier, G. 1994. Mental Spaces (the second edition), first published in 1984 as Espaces Menteaux. Cambridge University Press. Gamut, L. T.F. 1991. Logic, Language, and Meaning. The University of Chicago Press. Gawron, J.M. 1999. Universal Concessive Conditionals and Alternative NPs in English. ms.","Gawron, J.M. and Harada, Y. 1996. Indefinites, Conditionals, and Quantification. In H. Nakagawa (ed.) A Cognitive Study of Situatedness in English and Japanese. Report of the International Scientific Research Program.","Grice, H.P. 1975. Logic and Conversation. In P. Cole and J.L. Morgan (eds.) Syntax cmd Semantics, 17°1.3: Speech Acts. Academic Press.","Harada, Y. and Honda, K. 1999a. Scales of Likelihood: Quantification and Indefinites in Natural Language. Paper presented at Linear Logic Workshop. Keio University, Tokyo.","Harada, Y. and Honda, K. 1999b. How Quantification Emerges in Natural Language. Proceedings of the Joint Conference of the rd International Conference on Cognitive Science and the 16 Annual Meeting of the Japanese Cognitive Science Society. Waseda University, Tokyo.","Harada, Y. and Honda, K. 2000. Accessibility Among Situations: Pragmatics of Disjunction in Japanese. Proceedings of the 14th Pacific Asia Conference on Language, Information and Computation. Waseda University, Tokyo.","Harada, Y., Honda, K. and Noguchi, N. 1998. Scalar Implicature and Quantification with \"mo\". Proceedings of the 5th Annual Meeting of the Association for Natural Language Processing. The University of Electro-Communications, Tokyo.","Harada, Y. and Noguchi, N. 1992. On the Semantics and Pragmatics of dake (and only). In C. Barker and D. Dowty (eds.) Proceedings of the rd Conference on Semantics and Linguistic Theory: SALT II. The Ohio State University Press.","Imani, I. 1993. On Conditional Sentence with Negative Quantification. In T. Masuoka (ed.) Conditional Expressions in Japanese. Kuroshio Publisher. Kay, P. 1991. Even. Linguistics and Philosophy, 16:589-611. Sakahara, S. 1985. Inference in Everyday Language. Tokyo University Press. 234"]}]}