{"sections":[{"title":"Nominal Markers and Word Order in Korean Sae-Yours Cho","paragraphs":["Honam University","English Department","Seobong-dong 59-1, Kwangsan-gu","Kwangju-city, Korea 506-714 sycho@honam.honam.ac.kr"]},{"title":"Jong-Joo Choe","paragraphs":["Chosun University","Dept. of English Language & Literature Seoseok-dong 375, Dong-gu Kwangju-city, Korea 501-759","jichoegkorea.com"]},{"title":"Abstract","paragraphs":["The purpose of this paper is to explore the relationship between case and free word order in Korean by providing proper LP constraints which solve the problems of the previous analyses such as Kuno's (1980) Crossing-Over Constraint (COC). Based on Cho & Chai (2000), we introduce a new type marker which includes case, postpositions, and delimiters. We also add the Adjunct LP Constraint and the Argument LP Constraint adapted from the two LP constraints of Cho & Chai (2000). Our LP constraints present a solution to the alleged counterexamples of Cho & Chai (2000) as well as to the problems of Kuno (1980). The newly postulated type marker enables us to account for the scrambling possibilities of the NPs containing postpositions and delimiters."]},{"title":"1\\tThe Issue","paragraphs":["It has been observed that arguments with the same case marker cannot be scrambled out of a VP-complement or an S-complement in Korean and Japanese. This has led Kuno (1980) to propose the so-called 'Crossing-Over Constraint (COC)', which says that two NPs with the same grammatical markers cannot be scrambled. Chung (1998) has also proposed a similar constraint based on obliqueness. Though the COC seems to be successful in handling the scrambling possibility of the NPs with the same case, there still exist counterexamples in Korean.","Recently, Cho & Chai (2000) have pointed out this problem and proposed two Linear Precedence (LP) Constraints in the framework of Head-driven Phrase Structure Grammar (HPSG). They have claimed that case, contrary to the traditional 'monadic' value of CASE feature like NP[nom], should be redefined as a complex entity composed of Potential Case (PC) and Realized Case (RC). They have also introduced the notion of the 'animacy' of NPs. With these devices in hand, Cho & Chai (2000) have claimed that two NPs cannot be scrambled within a sentence, either when they have the same PC value (their PC Constraint) or when they have the same values for both RC and ANIMACY (their RC & AM Constraint). As illustrated in (1), Cho & Chai (2000) present a fine-grained analysis, where Mary's PC value, Acc/Dat, reflects the possibility of the case alternation of the NP with regard to the predicate.","(1) a. John-i Mary-lul\\tton-ul Mary-[PC"]},{"title":"<AccfDat>]","paragraphs":["money-[PC"]},{"title":"<Acc>]","paragraphs":["[RC <Acc>]\\t[RC <Acc>]","[ANI +\\t[ANI","J̀ohn gave Mary some money.'","b. John-i ton-ul Mary-lul cwuess-ta. cwuess-ta. gave-Decl 247 Note that Kuno's COC based on the surface (or realized) case wrongly predicts that the two NPs, Mary and ton 'money', cannot be scrambled because they have the same accusative case. By contrast, Cho & Chai's analysis solves the problem that Kuno's COC cannot. Namely, the scrambled version (lb) does not violate the PC Constraint because the two NPs do not bear the same PC value. Sentence (lb) does not violate the RC & ANI Constraint since the ANIMACY value of the two NPs is different from each other.","However, Cho & Chai (2000) appear to face some theoretical and empirical problems. Sentence (2), where the two NPs, unhayng 'bank' and ton 'money', have the same ANIMACY value, could be a challenge to their theory. In other words, though the PC Constraint does not apply to (2) because of the different PC values of the two NPs, the RC & ANI Constraint wrongly predicts that the two NPs cannot be scrambled because they have the same RC and ANIMACY values. So this sentence seems to constitute a counterexample to the analysis of Cho & Chai (2000).","(2) a. Unhayng-i\\tton-i\\tmanh-ta. bank-[PC <Nom/Dat>] money-[PC <Nom>] much-Decl","[RC <Nom>]","\\t [RC <Nom>] [ANI - \\t[ANI -","T̀he bank has much money.' b. Ton-i unhayng-i manh-ta. Although this shortcoming of Cho & Chai (2000) stems from the fact that they dealt with the scrambling phenomenon only among arguments, they should account for the difference in the scrambling possibilities of (1) and (2) in order to form a complete theory of scrambling phenomenon in Korean.","In this paper, we propose a more extended analysis of nominal markers and word order phenomenon in Korean based on Cho & Chai (2000). In section 2, we introduce a new type marker, which includes case, postpositions, and delimiters. Then we revise the two LP constraints of Cho & Chai (2000) and add the Adjunct LP constraint. In section 3, we present a solution to the alleged counterexample of Cho & Chai (2000) and explain some representative scrambled sentences in Korean under our analysis. In section 4, we conclude this paper with a discussion on the theoretical implications of our analysis."]},{"title":"2\\tA Solution 2.1 Our Proposal","paragraphs":["Cho & Chai (2000) have proposed a new concept of case as a complex entity instead of a monadic one. As they acknowledged, Urushibara (1991) argued that the Korean dative --ey/eykye should be a postposition, rather than a case. On the basis of Cho & Chai (2000) and Urushibara (1991), we introduce a type marker, which not only separates postpositions from case, but also includes delimiters. As illustrated in the format of Attribute-Value Matrix (AVM) of HPSG in (3), the type marker has two attributes, PM (for Potential Marker) and RM (for Realized Marker). (3) –marker\\t– PM CASE >POSTP DEL <E> _RM –ADMINk PM in turn has as its value POSTP (for postposition), CASE (for case), and DEL (for delimiter), which are all list-valued. RM has as its value a list of POSTP, CASE, and DEL as indicated by boxed integers, or 'structure sharing' in HPSG terms. By definition, the value of RM is optional as indicated by parentheses. If they are all realized, they must be in that order. However, case and delimiter do not 248 usually appear at the same time, which is captured by the slash (/) notation. Note that the values of PM and RM are given by the predicate in the lexicon.' They will be unified (or structure shared) with the value of the PHONOLOGY attribute of an NP.","Keeping in mind the modification of the case system above, we need to reconsider the LP constraints. Korean, as a head-final language like Japanese, observes a general LP constraint called the Head-final Constraint. According to this constraint, all the dependents including arguments and adjuncts must precede their head. We present the Head-final Constraint schematically in (4).","(4) Head-final Constraint: [\\t< Head","Adjuncts can be freely scrambled with arguments in Korean as long as they are in the same sentence. As shown in (5), the numeral adjunct NP sey pen 'three times' can be scrambled with the subject argument NP cicin-i 'earthquake-Nom' in the same sentence.","(5) a. Cicin-i\\tsey pen\\tilenass-ta. earthquake-Nom three times\\toccurred-Dec' T̀he earthquake occurred three times.' \\t","b. Sey pen\\tcicin-i\\tilenass-ta. three times\\tearthquake-Nom occurred-Dec'","However when a sentence is embedded as a subordinate clause, the adjunct NP cannot be scrambled out of the sentence. Look at sentence (6) which has sentence (5a) as a subordinate clause. The adjunct NP sey pen in the subordinate clause cannot be scrambled with the subject argument John-i in the matrix sentence, as shown in (6b). (6) a. John-i\\t[s Cicin-i\\tsey pen\\tilenass-ta-ko]\\tmalhayss-ta. \\t J-Nom earthquake-Nom three times\\toccurred-Dec'-Comp told-Dec' J̀ohn told that the earthquake occurred three times.' \\t","b. * Sey pen\\tJohn-i\\t[s cicin-i\\tilenass-to-ko]\\tmalhayss-ta. three times\\tJ-Nom earthquake-Nom occurred-Deci-Comp told-Dec'","The contrast of the scrambling possibility between (5) and (6) enables us to say that adjuncts cannot be scrambled out of their sentence. Adopting the Domain Theory of Reape (1994), we postulate the Adjunct Constraint on the scrambling possibility of adjunct NPs as described informally in (7).","(7) Adjunct (LP) Constraint: Adjuncts cannot be scrambled out of their S domain. The Adjunct Constraint is permissive in that it allows adjuncts to be located anywhere within S. In this respect, the Adjunct Constraint is a general constraint like the Head-final Constraint. However, the Adjunct Constraint is restrictive in that adjuncts cannot be scrambled out of the S domain. This shows the asymmetry in scrambling possibilities between adjuncts and arguments.","With these general constraints and the type marker, we present an LP constraint regarding the scrambling possibilities of arguments. We posit the Argument Constraint informally with two clauses (i) and (ii), each of which is schematically presented as (a) the PM Constraint and (b) the RM & ANIMACY Constraint, respectively, as shown in (8). I It may possibly be said that the locus of marker assignment is the dependency structure, or DEPS, proposed by Bouma et al. (1999). In current HPSG, DEPS contains all the dependents including arguments and adjuncts, while argument structure, or ARG-ST, accommodates only arguments. 249","(8) Argument (LP) Constraint: Two argument NPs cannot be scrambled, (i) EITHER when they have the same PM value (ii) OR when they have the same values for both RM and ANIMACY. a. PM Constraint: \\t domain 1[NP1 [PM\\t< domain 2[1N1)2[PM","b. RM & ANIMACY Constraint: domain 1[NPi[Rm T, ANI a]] < domain 2[NP2[RM T, .ANI a]]","where domain 1 is higher than domain T.\\t","(Cf. Cho & Chai (2000)) The PM Constraint and the RM & ANI Constraint belong to the Argument Constraint, but they operate independently. The PM Constraint says that when two argument NPs have the same PM value, the NP in the higher domain should precede the NP in the lower domain. The RM & ANIMACY Constraint requires that when two argument NPs have the same values for both RM and ANIMACY, the higher NP should precede the lower NP.","Note that by the definition of marker, the two LP constraints can deal with postpositions and delimiters as well as case markers. This makes our theory distinct from that of Cho & Chai (2000) which deals only with arguments containing case markers. 2.2 Problem Solving Given the LP constraints in (4), (7), and (8), we can provide a simpler explanation to various scrambled sentences including the alleged counterexamples to the analysis of Cho & Chai (2000). To demonstrate how our system works, sentence (2) needs to be reconsidered. Sentence (9a) headed by the predicate manh- 'abound in' consists of a subject argument, sonamwu 'pine trees', and a locative adjunct, i san 'this mountain.' When the location is focused, the adjunct NP i san can bear a (contrastive) 'focus' marker, which happens to have the same morphological form of nominative case, as shown in (9b). 2 In this case, the two NPs can be scrambled freely as shown in (9c). \\t","(9) a. Sonamwu-ka\\ti san-ey\\tmanh-ta. Pine trees-Nom this mountain-Loc abound in-Decl P̀ine trees abound in this mountain.'","b. Sonamwu-ka\\ti san-i\\t","manh-ta. Pine trees-Nom this mountain-Foc abound in-Decl","c. I san-i\\tsonamwu-ka\\tmanh-ta. this mountain-Foc pine trees-Nom abound in-Decl Under our analysis, the Argument Constraint does not apply to sentences in (9), because the NP sonamwu is an argument and the other NP i san is an adjunct. So the Adjunct Constraint is relevant to (9), but not the Argument Constraint. By the definition of the Adjunct Constraint, the two NPs in (9) can be freely scrambled because they are in the same S domain. For comprehensibility, our informal representation of (9c), using the type marker, is illustrated as in (10).","(10)\\tI\\tsan-i -[PMIPOSTP<Loc>]","I DEL <Foc>I [RM <Foc>] [AM - I sonamwu-ka\\tmanh-ta. -[PM <Nom>]\\tabound in-Decl [RM <Nom>] [ANI - 2 Following Cho (1999), we use the term Focus in the glossary of i san-i in (9c), instead of Nom. Though some theories regard the morpheme as Nom, it seems that there has been no concrete evidence on which term is correct so far. Hence, we assume that the morpheme is a focus marker. 250 P̀ine trees abound in this mountain (not in that one).'","By the same token, the scrambling phenomenon in (2) can be accounted for under our analysis. A closer examination reveals that the sentence pattern of (2a) is almost the same as (9c), and that the sentence pattern of (2b) is similar to that of (9b). Under our analysis, sentence (2a) can be represented as in (11a). Since the NP unhayng is regarded as an adjunct, the Adjunct Constraint correctly predicts that it can be freely scrambled with the subject NP ton. (11) a. Unhayng-i \\t","\\tton-i\\tmanh-ta. (=2a)","bank-[PMIPOSTP<Loc>] money -[PM <Nom>] much-Decl","DEL <Foc>I [RM <Foc>]\\t[RM <Nom>] [ANI -\\t[ANI -","T̀he bank has much money.'","b. Ton-i unhayng-i manh-ta.\\t (=2b)","So far, we have provided a simpler explanation for the alleged counterexamples to the analysis of Cho & Chai (2000) such as sentence (2), by postulating the Adjunct Constraint and the new type marker. 3 Data Analysis Our analysis enables us to predict the grammaticality of the scrambling phenomenon in various constructions. In fact, there is not only clausal-internal scrambling but also long-distance scrambling in Korean. To demonstrate how well our theory works, we will begin with the clause-internal scrambling of the Double Nominative Construction (DNC), which offers a challenge to any word order theory in Korean."]},{"title":"3.1 Clause","paragraphs":["-"]},{"title":"internal Scrambling","paragraphs":["3.1.1 Double Nominative Construction The Double Nominative Construction (DNC) is a sentence containing two or more nominative-marked NPs with regard to its predicate. According to Cho (1999), there are at least two types of the DNC which exhibit somewhat different scrambling possibilities between the two NPs. The two nominative-marked NPs in sentence (12) cannot be scrambled, whereas the two NPs in sentence (13) can.","(12) a. John-i (NP1)\\temeni-ka (NP2)\\tyeyppu-ta.","J-Nom\\tmother-Nom\\tpretty-Decl","J̀ohn's mother is pretty.' b. *Emeni-ka\\tJohn-i\\tyeyppu-ta.","(13) a. John-i (NP1)\\telkwul-i (NP2)\\tkhu-ta.","J-Nom\\tface-Nom\\tbig-Decl b. Elkwul-i\\tJohn-i\\tkhu-ta. In order to account for the difference in scrambling possibility, Cho (1999) claims that the first NP (NP1) in (12a) is the specifier of the sentence and the second NP (NP2) is the subject of the sentence, while NP1 in (13a) is the subject and NP2 is the adjunct of the sentence. Following his analysis, we will call the DNC like (12a) the 'Specifier-Subject' type and the DNC like (13a) the 'Subject-Adjunct' type. Then it is expected that the Argument LP Constraint is relevant to the Specifier-Subject type since the two NPs are argument NPs, while the Adjunct LP Constraint is relevant to the Subject-Adjunct type as one of the two NPs is the subject argument and the other an adjunct. 251","Under our analysis, the Specifer-Subject type in (12) is described as in (14), where NP1 John-i is in the higher domain and NP2 emeni-ka is in the lower domain.","(14=(12)) a. dom i[John-i\\tdom2 [emeni-ka J-[PM <Nom>]\\tmother-[PM <Nom>]","[RM <Nom>]\\t[RM<Nom>]","[ANI +\\t[ANI +","b. *Emeni-ka\\tJohn-i\\tyeyppu-ta. yeyppu-ta.]] pretty-Decl The two NPs are arguments, so the Adjunct LP Constraint is responsible for their scrambling possibility. According to the PM Constraint, the two NPs cannot be scrambled since they have the same PM value, namely Nom.' The RM & ANIMACY Constraint also says that the two NPs cannot be scrambled as they have the same values for both RM and ANIMACY. In short, both clauses of the Argument LP Constraint correctly predict that the Specifier-Subject type of the DNC cannot be scrambled.","Our analysis describes the Subject-Adjunct type of DNC like sentence (13) as shown in (15), where both NPs are in the same S domain. In this type of DNC, the two NPs can be freely scrambled by the definition of the Adjunct LP Constraint as shown in the scrambled sentence (15b). \\t (15=(13)) a. [s John-i","\\t","elkwul-i\\tkhu-ta.]","J-[PM <Nom>] face-[PM <Nom>] big-Decl","[RM <Nom>]","\\t [RM <Nom>] [ANI + I","\\t [ANI - \\t","b. Elkwul-i\\tJohn-i\\t khu-ta.","We have shown that the scrambling possibilities of the DNC can be explained by the Argument LP Constraint and the Adjunct LP Constraint. The former constraint is relevant to the Specifier-Subject type and the latter to the Subject-Adjunct type. Unlike the DNC, the Double Accusative Construction (DAC) shows different behavior as to scrambling phenomenon. 3.1.2 Double Accusative Construction Like Cho & Chai (2000), our analysis also provides the same explanation for various scrambled sentences such as the Double Accusative Construction (DAC) in Korean.' To demonstrate this, we show how our theory can analyze sentence (16) which belongs to the DAC. In the DAC, the two accusative NPs in (16), namwu-lul and kaci-lul, cannot be switched.","(16) a. John-i dom 1 [nall1W11- 1U I J-Nom tree-[PM <Acc>]","[RM <Acc>]","[ANI - J̀ohn cut the branch of the tree.'","b. *John-i kaci-lul\\tnamwu-lul","dom2[kaci-lul\\tcallass-ta.]]","branch-[PM <Acc>] cut-Decl","[RM <Acc>]","[AM - callassta. The two NPs with an accusative case marker are arguments, so the Argument LP Constraint is responsible for their scrambling possibility. The PM Constraint says that the two NPs cannot be scrambled because they have the same PM value, that is 'Ace.' The RM & ANIMACY Constraint also says that they cannot be scrambled since they have the same values for RM and ANIMACY. Both the PM Constraint and the RM & ANIMACY Constraint correctly predict that the two NPs in (16) cannot 3 Following Cho (1997), we regard the two NPs with the marker —/u/ as the two accusative NPs in (16). But it does not mean that we reject the claim that one of them should be a focused NP. We will not pursue this problem in this paper, since it is beyond the scope of this paper. 252 be scrambled, so the NP namwu-lul in the higher domain must precede the NP kaci-lul in the lower domain.","Again, we can account for the scrambling possibility of sentence (1), which Kuno (1980) cannot deal with but Cho & Chai (2000) can. Reflecting the new type marker, PC and RC are now PM and RM, respectively, as shown in (17). (17=(1)) a. John-i dom 1[Mary-lul\\tdom2 [ton-ul","\\t cwuess-ta.]] M-[PMIPOSTP </Dat>]","\\t money-[PM <Acc>] gave-Decl","CASE <Acc>I [RM <Acc>]","\\t [RM <Acc>] [ANI +","\\t [ANI -","J̀ohn gave Mary some money.' b. John-i ton-ul Mary-lul cwuess-ta. The two accusative-marked NPs are arguments, so the Argument LP Constraint is relevant to them. The PM Constraint does not prevent the two NPs from being scrambled with each other since their PM value is different. (The PM value of the NP Mary is Àcc/Daf , while that of the NP ton is 'Ace) Nor does the RM ANIMACY Constraint apply to this case, since their ANIMACY is different. Therefore, the NP in the higher domain can be scrambled with the NP in the lower domain.","We have shown that our analysis, using the Argument LP Constraint and the Adjunct LP Constraint, is able to account for the clause-internal scrambling phenomenon in the DNC and the DAC. Our LP constraints based on the new type marker are compatible with those of Cho & Chai (2000) on the one hand and are able to deal with the scrambling between adjuncts and arguments on the other hand. 3.2 Long-distance Scrambling Our analysis can also deal with long-distance scrambling where one NP belongs to the embedded clause, and the other one, to the matrix clause. As in English, the verb mit- 'believe' can subcategorize for either an NP and an S or two NPs and a VP. In the former case, when the NP Mary in the embedded sentence bears a nominative marker (18a), it cannot be scrambled with the NP John-i in the matrix sentence as in (18b). But in the latter case when Mary has an accusative marker (18c), it can be scrambled with John-ul as in (18d).","(18) a. John-i\\t[Mary-ka J-[PM <Nom>] M-[PM <Nom>] J̀ohn believes that Mary is stupid.'","b. *Mary-ka\\tJohn-i M-[RM <Nom>] J-[RM <Nom>]","[ANI +]\\t[ANI +","c. John-i\\t[Mary-lul J-[PM <Nom>] M-[PM <Acc>] J̀ohn believes Mary to be stupid.'","d. Mary-lul\\tJohn-i M-[RM <Acc>] J-[RM <Nom>]","[ANI + ]\\t[ANI + papolako]\\tmitnun-ta. be stupid\\tbelieves-Decl [papolako]\\tmitnunta. [papolako]\\tmitnun-ta.] be stupid\\tbelieves-Decl papolako mitnunta. This difference in the scrambling possibility just follows from the fact that under our analysis, (18b) violates the RM and ANI Constraint of the Argument Constraint but (19b) does not violate any LP Constraint.","Likewise, the verb seltukha- 'persuade' subcategorizes for two NPs and a VP to make a complete sentence. As shown in (19a), seltukha- takes Mary as subject, John as object, and Kim-eykey/ul ton-ul cwu-lako as VP complement. The VP complement headed by cwu- 'give' has two object NPs, 253 Kim-eykey/ul and ton-ul. In this case, Kim subcategorized by cwu- and John subcategorized by seltukha- cannot be switched as in (19b) while the two NPs, ton subcategorized by cwu- and John subcategorized by seltukha-, can be scrambled as in (19c).","(19) a. Mary-ka [John-eykey/lul","Mary- John- [RM <Dat>/<Acc>] [PM <Dat, Acc>i [ANI\\t+ [Kim-eykey/ul\\tton-ul cwu-lako] Kim-\\tmoney- give-Comp [RM <Dat>/<Acc>] [RM <Acc>] [PM <Dat, Acc>]\\t[PM <Acc>] [ANI +\\t[ANI - seltukhayss-tal persuaded-Decl M̀ary persuaded John to give money to Kim.' b. *Mary-ka [Kim-eykey/ul John-eykeyaul ton-ul cwu-lako seltukhayss-ta.] c. Mary-ka [ton-ui John-eykey/lul Kim-eykey/ul cwu-lako seltukhayss-ta.]","The previous surface case-based analyses cannot explain why the two NPs, John and Kim in (19b), cannot be scrambled with each other even when they have different CASE values. Furthermore, the surface case-based approach faces difficulties accounting for why the two NPs, John and ton in (19c), can be scrambled with each other, though they have the same CASE value. However, like Cho & Chai (2000), our analysis can also predict that the scrambled sentence (19c) is grammatical whereas (19b) is ungrammatical. As illustrated in (19a), the second NP John and the third NP Kim have the same value for PM, because they both alternate their cases. Therefore, the two NPs cannot be scrambled in terms of the PM Constraint. In contrast, the fourth NP ton can be scrambled freely with other NPs in the given sentence as in (19c) because it does not share a value for PM or ANI with other NPs. The first NP Mary does not share the PM value or RM value with other NPs, so it can also be scrambled with other NPs."]},{"title":"33 Further Data Analysis","paragraphs":["So far, we have shown that our analysis can account for both clause-internal and long-distance scrambling among NPs with a certain case marker, which would be hard to explain by the previous analyses. Furthermore, we will show that our analysis can explain clause-internal and long-distance scrambling among NPs with delimiters or without any markers in the following section. This would be a challenge to any existent theory on free word order in natural language. 3.3.1 Scrambling among Arguments and Adjuncts with Markers The fact that our analysis can deal with all markers via the LP Constraints above enables us to predict that the two NPs bearing the same delimiters such as the 'topic' marker un/nun cannot be scrambled in Korean. The two argument NPs in (20), Mary and ku namca 'that man', bear the same topic marker, and also have the same ANIMACY values. In this construction, the two NPs with the same marker cannot be scrambled.","(20) a. Mary-nun M-[PMI CASE<Nom>]","I DEL <Top> I","[RM <Top> ]","[ANI + ] M̀ary likes that man.'","b. *Ku namca-nun Mary-nun T̀hat man likes Mary.' ku that","namca-nun","man- [PM I CASE<Acc>]","I DEL <Top >1 [RM <Top> ] [ANI + cohahan-ta likes-Deci cohahan-ta. Under our analysis, the RM & ANIMACY Constraint of the Argument Constraint correctly predicts that the two NPs cannot be scrambled since they share the same RM and ANIMACY values.","Furthermore, our theory can also make a correct prediction for the grammaticality of the scrambled sentence with an argument NP and an adjunct with the same delimiter. In (21), though the argument 254 NP, sonamwu-, and the adjunct, i san-, share the same delimiter, they can be freely scrambled as illustrated in (21b). It is so because they need not observe the Argument Constraint. manh-ta. abound in-Decl","(21) a. I san-un\\tsonamwu-nun -[PMIPOSTP <Loc>] pine trees-[PM <Nomfrop>]","DEL <Top> I [RM <Top>]\\t[RM <Top>] [ANI -\\t[ANI -","P̀ine trees abound in this mountain.'","b. sonamwu-nun i san-un\\tmanh-ta.","However, Cho & Chai (2000) have no way to handle the above phenomenon simply because their case system does not contain delimiters. 3.3.2 Scrambling among Arguments without Markers Also it seems that the two NPs bearing no markers cannot be scrambled in Korean. The two argument NPs in (22a), Mary and ku namca 'that man', have no overt marker and the same ANIMACY values. In this case, the two NPs with no marker cannot be scrambled as in (22b).","(22) a. Mary-0 M-[PMI CASE<Nom>]","[RM < >","[ANI + ] M̀ary likes that man .'","b. *Ku namca- Mary- c T̀hat man likes Mary.' ku namca-25","\\t","cohahay","that man-[PM I CASE<Acc>] likes-Decl [RM < > 1 [ANI + I ohahay. Our analysis correctly predicts that (20b) is ungrammatical by the definition of the RM & ANI Constraint. Specifically, the two argument NPs cannot be scrambled because they share the same RM and ANIMACY value, i.e. < > and +, respectively.","However, an argument NP and an adjunct without any marker appear to be scrambled with each other. In (23), though the argument NP, ku namca-, and the adjunct, hakkyo-, have no marker, they can be freely scrambled because they need not observe the Argument Constraint.","(23) a. Hakkyoschool-[PM <Loc>]","[RM < >]","[AM - T̀hat man went to school.'","b. Ku namca-\\thakkyo-","ku namca-","that man-[PM <Nom>]","[RM < >1","[ANI - kass-e. kass-e. went-Decl The scrambling among arguments (and adjuncts) without markers or with the same marker can be accounted for under our analysis by regarding the empty list as a value of the RM. However, this theory seems to face a difficulty in explaining scrambling between an NP with a marker and one without any marker. For instance, when the NP with a topic marker and the NP without any marker are scrambled, the scrambled sentence is illegal as shown in (24).","(24) a. Mary-Mary- [PM! CASE<Nom>] [RM<>] [ANI + M̀ary likes that man .' ku namca-nun that man- [PM I CASE<Acc>] [RM <Top> [ANI + cohahay. likes-Decl 255","b. *Ku namca-nun Mary- cohahay. T̀hat man likes Mary.' Our analysis wrongly predicts that the two NPs with different markers in (24) can be scrambled because the two arguments do not violate any LP constraint. But this is not the case. This would be a puzzle to our theory. We will leave this problem for further research."]},{"title":"4 Concluding Remarks","paragraphs":["It is a well-known fact that the Korean language has various nominal markers and is a relatively free word order language. Lots of linguists believe that there might be some relationship between case markers and the scrambling possibilities. To explore this relationship, Kuno (1980) and Chung (1998) have proposed the COC constraint, which cannot explain various scrambling phenomenon in Korean. Cho & Chai (2000) have been successful in dealing with the scrambling phenomenon only among arguments, which would be a challenge to Kuno (1980) and Chung (1998). However, their theory still invites a number of unnecessary questions mainly because they did not provide a solution for the scrambling phenomenon related to adjuncts.","For the theory of Cho & Chai (2000) to be complete, we have proposed a new type of marker and the Adjunct"]},{"title":"LP","paragraphs":["Constraint, in conjunction with their Argument LP Constraint. These LP constraints might be interpreted as one of our processing strategies: when a given sentence is ambiguous, we tend to regard the sentence as an unscrambled one. In principle, argument NPs are freely scrambled unless they share the same marker, and adjuncts are freely switched as long as they are in the minimal S domain. This idea enables us to provide a simpler explanation for various scrambled sentences including some alleged counter- examples to Cho & Chai (2000). Furthermore, we can account for the scrambling phenomenon among arguments (and adjuncts) with delimiters or without any markers, which would be hard to explain under the previous analyses.","We have theoretically suggested that based on Cho & Chai (2000), our theory can be a complete theory of scrambling phenomenon by providing the new type marker and the Adjunct LP Constraint. Empirically, we have also demonstrated that although there remain some residual problems, our theory enables us to analyze further scrambling data in Korean."]},{"title":"Acknowledgement","paragraphs":["An earlier version of this paper was presented at the Korean Society of Language and Information, November 18, 2000 and at the Linguistic Association of Korea at Chosun University, November 4, 2000. Many thanks go to the audiences' questions and suggestions. We also appreciate comments from Byungsoo Park, Jongbok Kim, Yongkyoon No, Eunjung Yoo, Heerhak Chae, and Pyunghyun Yoon among others."]},{"title":"References","paragraphs":["Bouma, G., R. Malouf, and I. Sag. 1999. Satisfying constraints on extraction and adjunction. Unpublished manuscript.","Cho, Sae-Youn. 1997. Inalienability and Valence Increase in Korean: Inalienable Possession Constructions and Passive. Proceedings of the International Conference on Cognitive Science '97. 39-44.","Cho, Sae-Youn. 1999. The Syntactic Structure of Some Double Nominative Constructions in Korean. Presented at the Conference on Korean Linguistics in conjunction with the 1999 Linguistic Institute at the University of Illinois at Urbana-Champaign. Linguistics, Vol. 6-2. 335-348.","Cho, Sae-Youn and Myong-Hi Chai. 2000. Case, Animacy, and Word Order in Korean. Presented at the Western Conference on Linguistics 2000. To appear in the Proceedings of WECOL 2000. California State University at Fresno.","Chung, Chan. 1998. Case, Obliqueness, and Linearization in Korean. Proceedings of the FHCG-98.","Kuno, Susumo. 1980. A Further Note on Tonoike's Intra-Subjectivization Hyothesis. MIT Working Paper in Linguistics 2. 256 Pollard, Carl and Ivan Sag. 1994. Head-Driven Phrase Structure Grammar. CSLI. Reape, Michael. 1994. Domain Union and Word Order Variation in German. German in Head-Driven Phrase","Structure Grammar. 151-196. CSLI. Urushibara, Saeko. 1991. Ey/Eykey: A Postposition or a Case Marker? Harvard Studies in Korean Linguistics:","Vol. 5. 421-431. Harvard University. 257 258"]}]}