{"sections":[{"title":"","paragraphs":["December 1997 Volume 23, Ntimber 4"]},{"title":"Articles Algorithms for Grapheme-Phoneme Translation for English and French: Applications An Empirical Approach to VP Ellipsis A Computational Treatment of Lexical Rules in HPSG as Covariation in Lexical Entries Critical Tokenization and its Properties Stochastic Attribute-Value Grammars","paragraphs":["Michel Divay and Anthony J. Vitale 495 Daniel Hardt 525 W. Detmar Meurers and Guido Minnen 543 Jin Guo 569 Steven P. Abney 597"]},{"title":"Book Reviews The Balancing Act: Combining Symbolic and Statistical Approaches to Language","paragraphs":["edited by Judith L. Klavans and Philip Resnik Industrial Parsing of Software Manuals edited by Richard E E. Sutcliffe, Heinz-Detlev Koch, and Annette McElligott Using Language by Herbert H. Clark Type Logical Grammar:. Categorial Logic of Signs by Glyn V. Morrill Reviewed by Takenobu Tokunaga Reviewed by John Carroll Reviewed by Marilyn A. Walker Reviewed by Femando Pereira 619 622 625 629 Briefly Noted 635 Publications Received 637 Published Quarterly by the MIT Press for the Association for Computational Linguistics"]},{"title":"Computational Linguistics SSN 0891-2017 Editor","paragraphs":["1993-- Julia Hirschberg AT&T Labs-Research 180 Park Avenue, A237 Florham Park, NJ 07932-0cp71 (+1 973) 360-8330 acl@research.att.com","Associate Editor Robert C. Berwick Massachusetts Institute of Technology Artificial Intelligence Laboratory Cambridge, MA 02139, USA (+1 617) 253-8918 berwick@ai.mit.edu","Book Review Editor Graeme Hirst University of Toronto Department of Computer Science Toronto, CANADA M5S 3G4 (+1 416) 978-8747 gh@cs.toronto.edu","The FINITE STRING Editor Richard Sproat Bell Laboratories 600 Mountain Avenue, 2D-451 Murray Hill, NJ 07974, USA (+1 908) 582-5296 rws@bell-labs.com","Squibs and Discussions Co-Editors Pierre Isabelle RALI, DIRO Universit~ de Montrdal C. P. 6128, Succ. Centre-vitle Montreal, Quebec, CANADA H3C 3J7 (+1 514) 343-6161 isabelle@iro.umontreal.ca","Editorial Board Members","1995-97: Anne Abeille, Universite Paris VII Patrick Blackburn, Universitfit des Saarlandes Susan Brennan, SUNY Stony Brook Matt Crocker, University of Edinburgh Ido Dagan, Bar Ilan University Masaaki Nagata, NTT Information and","Communication Systems Laboratories Megumi Kameyama, SRI International, Menlo Park Ed Stabler, UCLA Kees van Deemter, Institute for Perception Research Gregory Ward, Northwestern University Pete Whitelock, Sharp Laboratories of Europe Ltd.","1996--98: Eric Brill, Johns Hopkins University Richard Crouch, Defence Research Agency David Johnson, IBM/TJ Watson Research Center Julian Kupiec, Xerox Palto Alto Research Center Emmanuel Roche, Mitsubishi Electric Research Laboratory Hinrich Sch~tze, Xerox Palto Alto Research Center Marilyn Walker, AT&T Research","1997-99: David Carter, SRI International, Cambridge Mark Ellison, University of Edinburgh Clair Gardent, Universit?it des Saarlandes Marcus Kracht, Freie Universitfit Berlin Owen Rambow, CoGenTeX, Inc. James Rogers, University of Central Florida Andreas Stolcke, SRI International, Menlo Park Gertjan van Noord, University of Groningen David Yarowsky, Johns Hopkins University December 1997 Volume 23, Number 4"]},{"title":"Computational Linguistics Articles Algorithms for Grapheme-Phoneme Translation for English and Fre.nch: Applications An Empirical Approach to VP Ellipsis A Computational Treatment of Lexical Rules in HPSG as Covariation in Lexical Entries Critical Tokenization and its Properties Stochastic Attribute-Value Grammars","paragraphs":["Michel Divay and Anthony J. Vitale 495 Daniel Hardt 525 W. Detmar Meurers and Guido Minnen 543 Jin Guo 569 Steven P. Abney 597"]},{"title":"Book Reviews The Balancing Act: Combining Symbolic and Statistical Approaches to Language","paragraphs":["edited by Judith L. Klavans and Philip Resnik Industrial Parsing of Software Manuals edited by Richard F. E. Sutcliffe, Heinz-Detlev Koch, and Annette M cElligott Using Language by Herbert H. Clark Type Logical Grammar: Categorial Logic of Signs by Glyn V. Morrill Briefly Noted Publications Received Reviewed by Takenobu Tokunaga Reviewed by John Carroll Reviewed by Marilyn A. Walker Reviewed by Fernando Pereira 619 622 625 629 635 637 Published Quarterly by the MIT Press for the Association for Computational Linguistics ' Copyright Q1997 by the Association for Computational Linguistics. Permission to photocopy articles for internal or personal use, or the internal or personal use of specific clients, is granted by the copyright owner for users registered with the Copyright Clearance Center (CCC) Transactional Reporting Service, provided that the fee of $3.00 per article-copy is paid directly to CCC, 222 Rosewood Drive, Danvers, MA 01923. The fee code for users of the Transactional Reporting Service is 0891-2017/97 $3.00. For those organizations that have been granted a photocopy license with CCC, a separate system of payment has been arranged. Such permission requests and other permission inquiries should be addressed to the Managing Editor at the address given on the inside front cover of this issue. Computational Linguistics is abstracted and/or indexed in the following publications: Annual Review of Information Science and Technology, CompuMath Citation Index, Computer Abstracts, Computing Reviews, Current Contents: Social and Behavioral Sciences, Engineering Index, Knowledge Engineering Review, Language and Language Behavior Abstracts, Linguistic Abstracts, Linguistic Bibliography, Research Alert, Science Abstracts (INSPEC Section C), SciSearch, Social Sciences Citation Index, and Social SciSearch. Volume 14 and subsequent volumes of Computational Linguistics are available on microfilm through University Microfilms International, 300 North Zeeb Road, Ann Arbor, MI 48106, USA. Send advertising and mailing list inquiries to Marketing Dept., MIT Press Journals, Five Cambridge Center, Cambridge, MA 02142; Phone: (617) 253-2866; fax: (617) 258-5028; e-mail: journals-info@mit.edu. Individual Subscriptions to"]},{"title":"Computational","paragraphs":["Linguistics are available only with membership in the Association for Computational Linguistics (ACL). Annual Membership Dues are as follows: regular, $50.00; student -- taking a full-time program of courses and not earning a regular income, $30.00; retired, $30.00; joint -- for couples receiving one subscription, $60.00. A membership application together with an order form for back issues and conference proceedings is included at the end of this issue. Send membership applications and address changes to Priscilla Rasmussen, Association for Computational Linguistics (ACL), P.O. Box 6090, Somerset, NJ 08875, USA. However, note that it is also possible to pay by credit card (both by e-mail and by postal mail) and through banks in Switzerland and Japan. Institutional Subscriptions are $110.00. Outside the U.S. and Canada add $16.00 postage handling. Canadian subscribers add 7% GST. Single copies of current and back issues are $28.00. Outside U.S. and Canada add $5.00 per issue for postage and handling. Canadians add 7% GST. Send institutional subscription orders and address changes to MIT Press Journals, Five Cambridge Center, Cambridge, MA 02142; phone: (617) 253-2889; fax: (617) 577-1545; e-mail: journals-orders@mit.edu. Claims for missing issues will be honored free of charge if made within three months after the publication date of the issue. Prices subject to change without notice. Institutions should order back issues before 1988 and all proceedings from the ACL at the address above. The FINITE STRING will no longer be available in hard copy. It will be accessible from the ACL Homepage at http://www.aclweb.org. Members without access to the WWW but with access to e-mail may request e-mail subscriptions by sending a message to The FINITE STRING Editor, Richard Sproat, rws@bell-labs.com. E-mail versions of the STRING will be available on a quarterly basis, coinciding roughly with the publication of the journal."]}]}