{"sections":[{"title":"Squibs and Discussions Anaphoric Dependencies in Ellipsis","paragraphs":["Andrew Kehler • SRI International Stuart Shieber t Harvard University 1. Introduction It has long been known that anaphoric relationships in the implicit meaning of an elided verb phrase depend on corresponding anaphoric relationships in the source of the ellipsis. This squib concerns what the underlying cause of this dependency is. Does it arise directly through some uniform relation between the two clauses, or does it follow indirectly from independently motivated discourse principles governing pronominal reference?","Verb phrase ellipsis is exemplified by sentence (1): (1) Ivan loves his mother, and James does too. The stranded auxiliary in the second clause (henceforth, the target clause) marks a vestigial verb phrase (VP), a meaning for which is to be recovered from another clause (henceforth, the source clause), in this case, the first clause. The core phenomenon that we address concerns the space of possible readings of the target clause corresponding to the antecedent of the pronoun his in the source clause, which exhibits the following dependency. If his refers extrasententially to some third person, say Kris--that is, if the source clause is taken to mean that Ivan loves Kris's mother--then the target clause must mean that James also loves Kris's mother. That is, example (2a) only has the reading reflected by the indices shown in sentence (2b): (2) a. Ivan/loves hisk mother, and Jamesj does too. b. Ivan/loves hisk mother, and Jamesj loves hiSk mother too.","On the other hand, if the pronoun refers intrasententially to Ivan, so that the source clause is taken to mean that Ivan loves his own mother (as in example (3a)), then the target clause is ambiguous between two readings. It might mean that James loves Ivan's mother (the so-called strict reading shown in (3b)) or that James loves his own mother (the sloppy reading shown in (3c)). (3) a. Ivan/ loves his/mother, and Jamesj does too. b. Ivan/loves his/mother, and Jamesj loves hisi mother too. c. Ivan/loves hisi mother, and Jamesj loves hisj mother too. * Artificial Intelligence Center, 333 Ravenswood Avenue, Menlo Park, CA 94025. E-mail: kehler@ai.sri.com t Division of Engineering and Applied Sciences, 33 Oxford Street, Cambridge, MA 02138. E-mail: shieber@deas.harvard.edu (~) 1997 Association for Computational Linguistics Computational Linguistics Volume 23, Number 3 Notice that the two sets of readings are disjoint and depend crucially on the antecedent of the pronoun in the source clause. 1 Past approaches to recovering these readings fall into two categories,"]},{"title":"source-determined","paragraphs":["analyses and discourse-determined analyses. We describe these in the sections that follow."]},{"title":"2. Source-Determined Analyses","paragraphs":["The conventional approaches to recovering the elided property in VP ellipsis have been source-determined (Sag 1976; Williams 1977; Gawron and Peters 1990; Priest, Scha, and van den Berg 1991; Dalrymple, Shieber, and Pereira 1991; Kehler 1993; Crouch 1995). Common to these approaches is the idea that at some level of representation (surface syntactic, deep syntactic, or semantic) the anaphoric relationships for the source are marked, and that the target is interpreted as if it were constructed with relationships determined in some uniform manner by those of the source clause at that level of representation.","In this paper, we will use the equational analysis of Dalrymple, Shieber, and Pereira (1991, henceforth DSP) as the exemplar of these approaches. In this account, the uniformity is specified by the solving of a certain equation in which, roughly speaking, the meaning of the source sentence as a whole is equated with the meaning of the target VP as applied to the meanings of the elements in the source that are parallel to overt elements in the target. For sentence (2a), this identity is captured by equation (4a), which under suitable assumptions has one solution for the meaning P of the elided VP, namely that in (4b). For sentence (3a), this identity is captured by equation (4c), which under suitable assumptions has two solutions for the meaning P of the elided VP, namely those in (4d) and (4e). In the equational account, the dependency between anaphoric relationships in source and target follows immediately from the mechanism used for constructing and solving the equations. More generally for source-determined analyses, the dependency follows from the method for determining anaphoric or coreference relationships in the target uniformly from those in the source."]},{"title":"(4)","paragraphs":["a. love(ivan, mother(kris) ) = P(ivan) b. P = Ax.love(x, mother(kris) ) c. love(ivan, mother(ivan)) = P(ivan) d. P = Ax.love(x, mother(ivan)) e. P = Ax.love(x, mother(x))","As noted by DSP, the equational analysis applies not only to VP ellipsis but also to the recovery of predicates for interpreting other forms such as do it and do so anaphora, gapping, stripping, and related constructions. These constructions form a natural class of expressions whose use is licensed by a predicate being available, or given, in context. 2 One can think of the equational analysis, then, as a source-determined method for computing the given predicates made available by a clause in a discourse. 1 The choice of which particular one of the three readings was intended by the speaker is, of course, a pragmatic issue, and one that we will not be concerned with in this squib. 2 The concept of givenness is a complicated one; see Prince (1981) for discussion. Our use here corresponds most closely to her Givennesss, or discourse-old in the sense of Prince (1992). 458 Computational Linguistics Volume 23, Number 3 Both"]},{"title":"Ivan","paragraphs":["and"]},{"title":"James","paragraphs":["are salient enough that the referent of"]},{"title":"his","paragraphs":["in the target is ambiguous in exactly the manner required to yield both the strict and sloppy interpretations.","To summarize thus far, a purely discourse-determined analysis predicts that a sentence with ellipsis should display the same readings in a given context that the unelided form would in the same context. Examples such as those above appear to demonstrate that a discourse-determined theory may account for at least some cases of dependencies between anaphoric relationships in source and target clauses."]},{"title":"4. Analysis of Discourse-Determined Analyses","paragraphs":["In order to counterexemplify a discourse-determined analysis, it would suffice to provide an elliptical sentence whose pronominal reference possibilities are different for its corresponding unelided form. Some care must be taken in clearly defining what is meant by \"corresponding unelided form,\" in particular, with respect to whether or not any of the deleted elements in the elided form can receive accent in the unelided form. Though the issue should not be prejudged, it would be reasonable to disallow such accent, as an elided VP by its very nature has no possibility for exhibiting accent.","By examining pairs of elided and unelided forms, we will show that, at a minimum, discourse-determined analyses must make this accent restriction; otherwise, sentence pairs that counterexemplify them can be constructed. We are forced to a view that discourse-determined analyses must reduce the issue of VP ellipsis meaning to deaccented VP meaning. We will then argue that this is not so much a discovery, as a restatement of the problem."]},{"title":"4.1 Accent and Sloppiness","paragraphs":["In general, discourse principles for normal pronominal reference are more flexible than is consistent with the reference behavior exhibited by elliptical reconstructions because, for instance, overt pronouns allow for accent and accompanying deictic gestures. Consider example (8), but with exaggerated accent on the second pronoun and simultaneous pointing to, say, Kris. (8) Ivan/loves his/mother, and Jamesj loves HISk mother. Such extra accent and deictic gesturing are capable of forcing a reading in which the second pronoun refers to Kris, not Ivan or James. However, as discussed in Section 1, its elliptical counterpart has no such reading. We would then have to require, as Hardt's account in fact does, that the discourse principles be applied as if no strong accent or deictic gestures were applied.","Furthermore, allowing even light accent in the unelided form is enough to falsify a discourse-determined analysis. For example, consider the nonelliptical example (9a). This sequence of sentences is felicitous under the anaphoric relationships indicated, when the target clause pronoun is given even light accent. Its elliptical counterpart (9b), however, cannot be taken as having the meaning of (9a). 4","(9) a. Mike Tyson will always be considered one of the greats of professional boxing. After one round with Spinksi, Tysonj beat him/. Now people think that no one can beat himj. 4 We use the # symbol to mark examples that are infelicitous under the intended interpretation. 460 Kehler and Shieber Anaphoric Dependencies in Ellipsis","b. # Mike Tyson will always be considered one of the greats of professional boxing. After one round with Spinksi, Tysonj beat him/. Now people think that no one can.","Example (9) demonstrates that pronouns within copied VPs are not as free to seek extrasentential referents as their unelided VP counterparts. Example (10), a variant of an example that Hardt (1992a) provides to argue against source-determined analyses (see Section 5.1), shows that this is also the case for intrasentential referents. The reading where Mary asked out Bob at Bob's party, while readily available with light accent on the pronoun in example (10a), is not available in its elided counterpart (10b). (10) a. b.# Every boyi was hoping that Mary would ask himi out, but the waiting is over. Last night at Bob'sj party, she asked himj out. Every boyi was hoping that Mary would ask him/ out, but the waiting is over. Last night at Bob'sj party, she did. Rooth (1993) gives a similar example, shown in (11a-b).","(11) a. John/s coach thinks he/has a chance, and Jamesj thinks hey has a chance too. b. # John/s coach thinks hei has a chance, and Jamesj does too. Rooth claims that whereas the unelided form in example (11a), even without accent, gives rise to a sloppy reading, the elided form in example (11b) does not. However, like the cases discussed above, some speakers find the target clause pronoun in example (11a) to require light accent under this interpretation.","These examples serve to further restrict the assumptions needed to support a discourse-determined approach--elided VPs exhibit the discourse behavior of deaccented VPs. Making this (quite reasonable) assumption, discourse-determined analyses are to be seen as reducing VP ellipsis not to general discourse principles for pronominal reference (as they generally have been presented), but to a more specific construction. 4.2 Deaccented VP Behavior Recall from Section 2 that VP ellipsis, do it, do that, do so, and related constructions form a natural class of expressions. Although these forms differ with respect to their syntactic and some of their referential properties, all have one property in common: their meaning depends on information that is given in, and therefore recoverable from, the existing discourse state. Consequently, all exhibit the same range of strict and sloppy readings. Deaccenting is also a well-established indicator that material is given information in the discourse (Terken and Nooteboom 1987, inter alia), and therefore it falls in this same class. As with the various forms of event reference, a VP thus requires an \"antecedent\" to license deaccenting that either exists in the discourse or is inferrable from it. 5 5 Rooth (1993) also posits the equivalence of \"semantic redundancy\" (that is, givenness) constraints for deaccented VPs and VP ellipsis, but ultimately cites the differing readings in examples like (11) as potential counterevidence. If examples like (11) do in fact differ in readings, then discourse-determined analyses are falsified outright. However, if even slight accent is required on the pronoun in the 461 Kehler and Shieber Anaphoric Dependencies in Ellipsis","Sentence (12a) is adapted from a central example that Hardt gives (example (2) in Hardt [1992a]), which has a preferred reading that can be paraphrased as (12b). s","(12) a. John hoped Mary would ask him out, but Bill actually knew that she would.","b. John/hoped Maryk would ask himi out, but Billj actually knew that shek would ask himj out. Note that relative to the anaphoric relationships in the portion of the source clause \"Mary would ask himi out\", the relationships in the corresponding target clause \"Shek would ask himj out\" involve \"switching reference\" of"]},{"title":"him","paragraphs":["from i to j. Hardt claims that (what we are calling) a source-determined account cannot model this switch-ing of reference, because the sloppy reading cannot be generated assuming that only"]},{"title":"Mary","paragraphs":["and"]},{"title":"she","paragraphs":["are parallel elements. Of course, this particular choice of parallelism between the two clauses is not the only one, nor is it the most natural one. While the elements"]},{"title":"John","paragraphs":["and"]},{"title":"Bill","paragraphs":["are not within the minimal clauses, they are parallel within the main clauses. By recognizing the full parallelism, as manifested in the equation"]},{"title":"askout(mary, john)= P~ohn, mary),","paragraphs":["the equational analysis straightforwardly generates the sloppy reading. 9 Viewed in light of the parallelism between the main clause subjects, the sentence does not involve \"switching of reference\" any more than any other sloppy reading of an elliptical clause does. Thus, while examples such as (12) were not directly addressed in work on the equational method, their analysis within the framework is straightforward. 5.2 Arguments on the Basis of Switching Reference with Structural Nonidentity Hardt presents further examples, such as (13), of \"switching reference\" in which the source and target are structurally different.","(13) Every boy in Mrs. Smith's class hoped she would pass him. In John's case, I think she will. Hardt argues, again, that an approach predicated on determining parallelism between source and target would be unable to account for the natural reading of this sentence. Of course, the approach of DSP does not require"]},{"title":"syntactic","paragraphs":["parallelism in setting up the equation for resolving ellipsis; many examples of nonsyntactic parallelisms are provided in that work. (See especially their Section 5.1.1.) Thus, the parallelism argument, per se, does not distinguish a source-determined analysis such as the equational analysis from a discourse-determined analysis.","Nonetheless, it is our sense that something quite different is happening in this particular case. The preposed phrase"]},{"title":"in John's case","paragraphs":["serves a special function here, in a 8 To simplify the discussion, the quantifiers in Hardt's original example have been replaced by proper nouns. The arguments apply to this example just as well. 9 Hardt may be alluding to this when he says that \"an extended notion of parallelism might solve the problem\" (Hardt, 1992a, p. 307). In later work (Hardt 1993), he notes that the absence of this reading \"assumes that the parallel elements are the subject of the antecedent VP and the elliptical VP, although this is not required in the equational approach\" (p. 67). However, he states that allowing other parallel elements \"would represent a radical departure for the equational approach, since the solution to the equation would no longer represent merely the elided material\" (p. 67). As it has never been possible to construe the solutions of ellipsis equations as representing merely the elided material (see, for instance, the solution to example (30b) given by DSP), it is not clear why this would constitute a \"departure,\" much less a radical one. 463 Computational Linguistics Volume 23, Number 3 way that the prepositional phrase"]},{"title":"at Bob's party","paragraphs":["in sentence (10b) does not. Specifically, like phrases such as"]},{"title":"regarding John, as for John,","paragraphs":["and"]},{"title":"with respect to John,","paragraphs":["the phrase"]},{"title":"in John's case","paragraphs":["crucially depends on context for its interpretation. It refers to a previously evoked state or event, meant to exemplify or contrast"]},{"title":"John","paragraphs":["with respect to some other parallel object or group of objects (in this case, every other boy in Mrs. Smith's class). Therefore, before the ellipsis is resolved, the meaning of"]},{"title":"in John's case","paragraphs":["must be resolved. This resolution results in a (non-asserted) representation for"]},{"title":"Johnj hoped she would pass himj,","paragraphs":["which serves as the source for the subsequent ellipsis, on analogy with cases of cascaded ellipsis discussed by DSP, Section 3.3. The meaning of the target of sentence (13) is then simply the strict reading, derivable by source-determined algorithms. The example is thus not a counterexample for source-determined approaches. We should note that while the parallel elements for the ellipsis resolution are determinable from semantic role parallelism, the process of identifying the parallel elements in resolving an expression like"]},{"title":"in John's case","paragraphs":["is clearly a pragmatic one. 5.3 Arguments on the Basis of Multiple Parallel Elements There are other cases that do appear to be problematic for source-determined analyses proposed to date. Example (14) is adapted from one cited by Kitagawa (1991). (14) John told Mary to hand in his paper before Bill does. Some (although not all) speakers find the sloppy reading, in which Bill hands in his own paper, to be acceptable. As we would expect, the unelided version shown in (15) also appears to allow this reading without requiring any accent on the target pronoun. (15) John told Mary to hand in his paper before Bill hands in his paper.","Assuming example (14) has this reading, it appears that the source clause makes available the necessary relation to license either the deaccenting or the eliding of the VP in the target. This would be problematic for most source-determined analyses because recovering this relation necessitates that"]},{"title":"Bill","paragraphs":["be parallel to both"]},{"title":"John","paragraphs":["and"]},{"title":"Mary,","paragraphs":["a possible but unattractive prospect. 5.4 Arguments on the Basis of Parallelism in Coordinate Structures Finally, we note an additional problematic case that to our knowledge has gone unnoticed in the literature. The case involves coordination, in which the coordinated constituents each contain a pronoun, as in example (16). (16) Ivan/likes hisi mother and his/father, and Jamesj does too. Sentence (16) has the two readings corresponding to whether James likes"]},{"title":"Ivan's","paragraphs":["mother and father or"]},{"title":"his own","paragraphs":["mother and father. However, current source-determined analyses predict four readings, also including the two in which James likes one of"]},{"title":"Ivan's","paragraphs":["parents and one of"]},{"title":"his own","paragraphs":["parents. That is, the readings in which the pronouns in the two coordinated constituents refer to different entities are derivable, but do not exist for example (16).","As expected, only the first two of these readings are available for the unelided version of sentence (16), shown in example (17), again assuming that the VP is deaccented. 464 Kehler and Shieber Anaphoric Dependencies in Ellipsis","(17) Ivan/likes his/mother and hisi father, and Jamesj likes his mother and his father too. How such examples are to be handled within source-determined analyses is a subject for future study."]},{"title":"6. Summary","paragraphs":["Although problematic examples for a source-determined analysis of VP ellipsis can be found, these do not provide an argument for moving to a discourse-determined analysis. Indeed, it is the thesis of this paper that discourse-determined analyses are not alternatives to source-determined analyses, but rather, are dependent on them. As such, they do not contribute to our understanding of the possible range of meanings of elliptical verb phrases. What these examples do show is the need to refine source-determined analyses in deriving the predicates that clauses make available in the discourse."]},{"title":"Acknowledgments","paragraphs":["This work was supported in part by National Science Foundation Grant IRI-9009018, National Science Foundation Grant IRI-9350192, National Science Foundation/Advanced Research Projects Agency Grant IRI-9314961, and a grant from the Xerox Corporation. We would like to thank Mary Dalrymple, Mark Gawron, David Israel, Fernando Pereira, and the anonymous reviewers for valuable discussions and comments on earlier drafts."]},{"title":"References","paragraphs":["Crouch, Richard. 1995. Ellipsis and quantification: A substitutional approach. In Proceedings of the Seventh Conference of the European Chapter of the Association for Computational Linguistics, pages 229-236, Dublin, Ireland, March 27-31.","Dalrymple, Mary, Stuart M. Shieber, and Fernando Pereira. 1991. Ellipsis and higher-order unification. Linguistics and Philosophy, 14:399--452.","Gawron, Mark and Stanley Peters. 1990. Anaphora and Quantifi'cation in Situation Semantics, volume 19 of CSLI Lecture Notes. Center for the Study of Language and Information, Stanford, CA.","Hardt, Daniel. 1991a. A discourse model approach to VP ellipsis. In Proceedings of the AAAI Symposium on Discourse Structure in Natural Language Understanding and Generation, Asilomar, CA, November.","Hardt, Daniel. 1991b. Towards a discourse level account of VP ellipsis. In Proceedings of the Eastern States Conference on Linguistics, pages 121-129.","Hardt, Daniel. 1992a. VP ellipsis and contextual interpretation. In Proceedings of the 14th International Conference on Computational Linguistics, Nantes, July.","Hardt, Daniel. 1992b. VP ellipsis and semantic identity. In Chris Barker and David Dowty, editors, Proceedings of the Second Conference on Semantics and Linguistic Theory (SALT-II), Columbus, OH, July. Ohio State University Working Papers in Linguistics no. 40.","Hardt, Daniel. 1993. Verb Phrase Ellipsis: Form, Meaning, and Processing. Ph.D. thesis, University of Pennsylvania. Institute for Research in Cognitive Science report 93-23.","Kehler, Andrew. 1993. A discourse copying algorithm for ellipsis and anaphora resolution. In Proceedings of the Sixth Conference of the European Chapter of the Association for Computational Linguistics (EACL-93), Utrecht, The Netherlands, April.","Kitagawa, Yoshihisa. 1991. Copying identity. Natural Language and Linguistic Theory, 9:497-536.","Prince, Ellen. 1981. Toward a taxonomy of given-new information. In Peter Cole, editor, Radical Pragmatics. Academic Press, New York, NY, pages 223-255.","Prince, Ellen. 1992. The ZPG letter: Subjects, definiteness, and information-status. In Sandra Thompson and William Mann, editors, Discourse Description: Diverse Analyses of a Fundraising Text. John Benjamins B.V., Philadelphia/Amsterdam, pages 295-325.","Prtist, Hub, Remko Scha, and Martin van den Berg. 1991. A formal discourse grammar tackling verb phrase 465"]}]}