{"sections":[{"title":"Dependency of Long-Distance Reflexives","paragraphs":["Hyeran Lee Institute of Continuing Education Kyung Hee University, Suwon","#1 Seocheon-ri, Giheung-up, Yongin-si, Kyunggido, South Korea 449-701","ghyeran@hotmail.com Abstract This paper aims to account for dependency of long-distance anaphors within the derivational approach. Dependency between the antecedent and the anaphor is determined by the universal operations, Merge, Move and Agree. Following Hornstein (2001) and Zwart (2002), anaphors in Korean, Chinese, and Japanese are argued to merge with antecedents to obtain anaphoricity. How such a merged complex participates in derivation is demonstrated using both local and long-distance binding examples. Logophoricity and discourse effects are obtained after computation within CHL when the antecedent and the anaphor are not merged at the outset. 1\\tIntroduction The locally bound reflexives have been explained by the traditional binding theory in Chomsky (1981), R&R's predicate based theory (MR 1993), and the recent derivational theory (Hornstein 2001). Questions are raised with regard to the reflexive forms that seem to be bound across the clause boundary. Long-distance reflexives are found in many languages such as Chinese, Japanese, Korean and others. They are even found in English as seen below.","(1) Zhangsan; zhidao [Lisi; renwei [Wangwuk zui xihuan Zhangsan know Lisi think Wangwu most like self 'Zhangsan; knows that Lisi; thinks that Wangwuk likes self; k' (Pollard and Xue 2001: 326)","(2) Takasii-ga\\t[Kenjirga zibunvro suisenshita-to]\\tomotta (Motomura 2001: 319) Takasi-NOM Kenji-NOM self-ACC recommended-COMP thought T̀akasi thought that Kenji recommended self'","(3) Sumii-ka [Sujirka [Youngheek-ka cakiiliwlul Sumi-NOM Suji-NOM Younghee-NOM self-ACC silehan-ta-ko] sayngkakhan-ta-ko alkoi-ss-ta hate-DEC-COMP think-DEC-COMP know-PAST-DEC Sumii knows that Sujii thinks that Youngheek hates selfvyk'","(4) Johni said that a picture of himself; is on sale","For the constructions like (1), (2) and (3), some argued that they are actually pronouns, and some argued that they are reflexives that can be accounted for by the parameterization of the binding theory (Manzini and Wexler 1987). The sentence (4) is rather surprising, since the English reflexive himself"]},{"title":"is","paragraphs":["the most typical reflexive that is locally bound, but it turns out to be bound across the clause boundary. For (4), Chomsky (1981; 1986) introduced the concept of the governing category, incorporating the phenomena into the local binding. In the movement theory (Chomsky (1986), Battistella (1989), Sung (1990), Cole et al. (1990), and Cole and Wang (1996)), it was claimed that the apparent long-distance binding between the reflexive and the antecedent is actually local with the covert movement of the reflexive across the clause boundary. All these approaches are seeking for syntactic accounts.","On the other hand, it has been claimed that logophoricity plays as a licensing condition for 431 long-distance reflexives (Kuno (1987), Sells (1987), and Zribi-Herts (1989)). The term l̀ogophoric pronoun' was originally used for the analysis of African languages. The concept of logophoricity used for the long-distance reflexives is different from the original concept, including SOURCE, SELF, and PIVOT. In (1-3), both the matrix subjects and the embedded subjects seem to satisfy the logophoric conditions, being aware of the situation predicated. The high frequency in using the verbs of 'saying' and 'thinking' as a matrix subject could induce such a misconception. However, logophoricity cannot explain all binding phenomena, since there are languages such as Chechen and Ingush that do not require the logophoric conditions (Nichols 2001). Chinese and Korean also do not always require the logophoric conditions for antecedents as illustrated below.","(5) Zhangsan; cong Lisij chu tingsuo Wangwuk bu xihuan Zhangsan from Lisi place hear Wangwu not like self Z̀hangsani heard from Lisij that Wangwuk does not like selfilvk'","(6) Chulswurka Youngswuj-lopute Youngheek-ka calcivw1u1 Chulswu-NOM Youngswu-from Younghee-NOM self-ACC sileha-n-ta-ko\\ttul-ess-ta dislike-PRES-DEC-COMP hear-PAST-DEC 'Chulswui heard from Youngswuj that Younghee k dislikes self y*j/k'","In (5) and (6), the SOURCE NP does not serve as an antecedent. The mixed approach (Reinhart and Reuland (1993), Pollard and Sag (1992), Pollard and Xue (2001), Cole et al. (2001), Huang and Liu (2001) and others) thus comes in between, adopting both the syntactic accounts and the logophoricity-based accounts.","This paper attempts to elucidate the licensing conditions on the long-distance anaphors by investigating both the syntactic conditions and the logophoric conditions. I basically follow the spirit of Reuland (2001) in that the syntactic binder is more easily available than the binder based on the logophoricity effects. For the mechanism of the syntactic binding, I follow the derivational approach supported by Hornstein (2001), Kayne (2002), and Zwart (2002). 2\\tPrevious Studies 2.1 Reuland (2001) Reuland (2001) argues that locality conditions on anaphors are derived from the conditions on Move within CHL. He says that encoding a dependency between the anaphor and the antecedent by CHAIM formation within CBI, is the cheapest. Next comes encoding a dependency by variable binding at the LF interface. The costliest way is establishing coreference by using the discourse storage. Ranking availability of a binder in terms of economy, he attempts to account for crosslinguistic differences and considerable microvariations within a particular language. I follow his spirit in that anaphor binding consults the CHL first and then the LF-interface, and finally the discourse storage. Logophoricity could be involved in binding only if the syntactic binding is not established.","Reuland (2001)'s system seems to have an explanatory power for a wide range of data in the area of binding. He provides ranking for binding depending on which component the binding takes place: within CHL, or at LF interface, or from discourse storage. Using this concept, he deals with the non-c-commanding binding cases and unbound binding cases as well as the core binding cases. He argues that there is no intrinsic property of anaphors that prohibits an unbound interpretation.","He is, however, criticized in that (i) his accounts are representational rather than derivational, (ii) chains are made based on traces which violate the Inclusiveness Condition, (iii) his data are focused on 1"]},{"title":"(i) Chain","paragraphs":["(a,13)"]},{"title":"form a Chain if (a)I3's features have been ( deleted by and) recovered from","paragraphs":["a,"]},{"title":"and (b)","paragraphs":["(a,13)"]},{"title":"meets standard conditions on chains such as uniformity, c-command, and locality. (ii) If","paragraphs":["(al, a2)"]},{"title":"is a Chain and","paragraphs":["(i31,"]},{"title":"b 132) is a chain and","paragraphs":["a2= ,"]},{"title":"then","paragraphs":["(al, a2 / r31,"]},{"title":"P2) is a CHAIN. 432","paragraphs":["Dutch SE and SELF anaphors, not explaining"]},{"title":"caki-type","paragraphs":["anaphors that are quite similar to SE but different from SE. SE is used for an argument of inherently reflexive verbs, while"]},{"title":"caki","paragraphs":["is not restricted to the reflexive verbs only.","For the specific analysis of the syntactic binding, I adopt the derivational approach by Hornstein (2001), Motomura (2001), Kayne (2002), and Zwart (2002), instead of depending on a chain formation within CHL. I, however, follow Reuland (2001) in that the anaphoric dependency is determined by derivation within CHL and by LF-interface and discourse storage as well: all unbound anaphors have a high accessibility to the discourse storage, though it is the costliest way of binding. 2.2 Hornstein (2001) and Others: Derivational Approach The derivational approach to syntactic relations argued by Epstein and Seely (1999) extends to syntactic dependency between anaphor and antecedent as seen in the work of Hornstein (2001), Zwart (2002), and Kayne (2002). In this derivational approach, all relations must be explained by Merge, Move and Agree (Chomsky 1999; 2001). The English example is given below. (7) John; likes himself; (8) [ip John I [self [vp John [likes [[John] self]]]] Based on Hornstein (2001), the derivation starts with merging"]},{"title":"John","paragraphs":["with self. The complex"]},{"title":"[John self]","paragraphs":["merges into the object position of"]},{"title":"likes","paragraphs":["where"]},{"title":"John","paragraphs":["gets the internal theta role. Then"]},{"title":"John","paragraphs":["raises"]},{"title":"2","paragraphs":["to Spec VP, where it gets an external theta role of"]},{"title":"likes.","paragraphs":["The theta-criterion does not hold in his analysis so that a DP is permitted to move into more than one theta-position as mentioned."]},{"title":"John","paragraphs":["now raises to Spec IP (Spec TP) where it checks Case and EPP features. The accusative Case checking on"]},{"title":"likes","paragraphs":["is done by the reflexive element"]},{"title":"self Selfraises at","paragraphs":["LF as shown above to check the accusative Case features. Hornstein assumes that"]},{"title":"John","paragraphs":["is introduced in numeration with the nominative Case features and"]},{"title":"self","paragraphs":["with the accusative Case features. All the copies delete prior to the A-P interface due to LCA that requires the deletion of all copies but the topmost one. Hornstein continues to argue that the pronoun is inserted after the copy is deleted to provide morphological support for the bound morpheme"]},{"title":"sell","paragraphs":["Hence"]},{"title":"self","paragraphs":["is pronounced as"]},{"title":"himself.","paragraphs":["Zwart (2002) is in the same spirit with Hornstein. He argues that anaphoricity is a property acquired in the course of a derivation rather than an inherent lexical feature. He claims that the features relevant to anaphoricity can only be acquired in a sisterhood relation as below. (9) A PRONOUN"]},{"title":"3","paragraphs":["a is coreferential with 13 iff a is merged with f3. (10) bcp [antecedent] [PRONOUN]] The statement (9) says that Merge determines the syntactic relation between the antecedent and the anaphor. With a little difference in mechanics from Hornstein (2001), Zwart (2002) also argues that the binding theory can reduce to Merge and Move dispensing with Condition A and other related stipulations and assumptions.","I adopt Zwart (2001) in my analysis, not using"]},{"title":"him as a","paragraphs":["morphological support as in Hornstein (2001), since it seems to violate the Inclusiveness Condition, and complicates the derivation. In Zwart (2001), the merging elements are an antecedent and a PRONOUN, being different from Hornstein (2001) where the merging elements are an antecedent and"]},{"title":"self.","paragraphs":["I follow Chomsky (2001) and Kitahara (2002) in using the probe–goal system to elucidate the interpretative procedure. The operation Agree is involved to distinguish the English anaphor himself"]},{"title":"and","paragraphs":["the Korean type anaphors such as"]},{"title":"caki, ziji,","paragraphs":["and zibun."]},{"title":"2 The word 'raise' is in general use. The more precise meaning of 'raise' should be attraction, since I follow the probe-goal system in Chomsky (2001) in this paper. 3 PRONOUN includes both anaphors and pronouns as variable referential elements in Zwart (2002).","paragraphs":["433 3 Analysis of Long-Distance Binding 3.1 Locally Bound Caki In Korean,"]},{"title":"caki","paragraphs":["is a third person reflexive, showing long-distance binding phenomena. Let us take a look at the sentence that shows local binding first.","(11) Chulswurka cakirlul sileha-n-ta Chulswu NOM self-ACC dislike-PRES-DEC Thulswuj dislikes himselfr (12) [TpChulswu-ia- Chulswu [Chulswu caki] silehanta] T The derivation starts with merging"]},{"title":"Chulswu","paragraphs":["and"]},{"title":"caki as","paragraphs":["shown in (12). The operation Merge establishes the syntactic dependency between the antecedent and the anaphor. T probes a DP to check its uninterpretable phi-features and EPP features."]},{"title":"Chulswu","paragraphs":["is the right candidate to enter into Agree with T, raising to Spec TP through Spec vP. The theta-criterion does not hold as argued in Hornstein (2001) with"]},{"title":"Chulswu","paragraphs":["moving through the internal theta-position and the external theta position to reach to Spec TP."]},{"title":"Caki","paragraphs":["enters into Agree in situ"]},{"title":"4","paragraphs":["checking the uninterpretable phi-features on v and its own Case features. In the following example,"]},{"title":"caki","paragraphs":["is replaced with"]},{"title":"ku.","paragraphs":["(13) Chulswu-ka ku-lul sileha-n-ta Chulswu-NOM him-ACC dislike-PRES-DEC Thulswu dislikes him' (14) [TpChulswu-ka Chulswu [ku silehanta] T In (14),"]},{"title":"Chulswu","paragraphs":["does not merge with"]},{"title":"ku,","paragraphs":["since the two DPs are not coreferential."]},{"title":"Ku","paragraphs":["merges with"]},{"title":"silehana,","paragraphs":["and the complex"]},{"title":"Iku silehanta]","paragraphs":["merges with"]},{"title":"Chulswu.","paragraphs":["The probe T and"]},{"title":"Chulswu","paragraphs":["check their uninterpretable features off by the operation Agree. There is no syntactic dependency between the two DPs, since they do not merge each other. 3.2 SE anaphor in Dutch SE anaphor in Dutch can be analyzed in the same way. The data used here came from Reuland (2001). (15) Oscar; gedraagt zich;","Oscar behaves SE (16) [Tp Oscar T [vp Oscar [gedraagt [Oscar] zich]]]] The SE anaphor"]},{"title":"zich","paragraphs":["merges with"]},{"title":"Oscar","paragraphs":["and then"]},{"title":"Oscar","paragraphs":["raises to Spec vP to get the subject theta-role. By PIC (Chomsky 1999)"]},{"title":"5","paragraphs":[", the probe T can fmd"]},{"title":"Oscar","paragraphs":["in this position as a search target, inducing its raising to SpecTP. The nominative Case of"]},{"title":"Oscar","paragraphs":["and the uninterpretable phi-features and EPP features on T delete by Agree. The syntactic dependency is established when Merge takes place in the beginning. Next is illustrated the ECM structure."]},{"title":"4 I assume that the accusarive Case is checked in situ in Korean. 5 PIC is Phase Impenetrability Condition proposed in Chomsky (1999) : The domain of H is not accessible to operations outside HP, but only H and its edge. 434","paragraphs":["(17) Oscar; voelde [zich1 wegglijden]","Oscar felt himself slide away (18) [cpErp Oscar T [zich [vP Oscar voelde [[[Oscar [zich]] wegglijden]]]]]]"]},{"title":"Oscar","paragraphs":["and"]},{"title":"zich","paragraphs":["merge together, and"]},{"title":"Oscar raises","paragraphs":["to Spec vP to get the subject theta-role and to Spec TP to undergo the operation Agree. Zich can form the Agree relation with"]},{"title":"wegglijden,","paragraphs":["but the verb has incomplete phi-features, being a [-finite] verb. The v with incomplete phi-features cannot be the probe to check the Case features off from"]},{"title":"zich.6","paragraphs":["Thus"]},{"title":"zich","paragraphs":["covertly raises to the outer Spec vP (the multiple specs are possible in Chomsky (1999; 2001)) where it enters Agree with v, checking its Case off."]},{"title":"33 Long-Distance Binding in Korean","paragraphs":["Motomura (2001) adopts the derivational approach to the Japanese long-distance binding. Based on his study, the following Korean sentences show ambiguity in meaning: the anaphor can be bound to the embedded subject or to the matrix subject. (19) Chulswui-ka Younghee-ka\\tsileha-n-ta-ko malha-yss-ta The embedded subject reading is obtained as follows.","(20)caki=Younghee a. [vpi [Younghee caki] silehata] b. [vpi Younghee [vp i [Younghee caki] silehata]] c. [cpi[ipi Younghee [vpi Younghee [vpi [Younghee caki] silehan]]-tal-ko] d. [vP2 [CP1[11,1 Younghee [vpi Younghee [vp i [Younghee caki]","silehan]]-ta]-ko] malhyss] e. {vp2Chulswu [VP2 [CP1[11,1 Younghee [vpi Younghee [vpi [Younghee caki]","silehan]]-ta]-ko] malhyss]] f. [cp2[Tp2Chulswu [vp2Chulswu [VP2[CP1[TP1 Younghee [vpi Younghee [vpi [Younghee","caki] silehan]]-ta]-ko] maLhyssfl-ta]] g. [cP2[Tp2Chulswu [„P2(Chulswu) [vim [CP1{171 Younghee[vpi (Younghee) [VP1","[(Younghee) caki] silehan]]-ta]-ko] malhyss]]-tai]"]},{"title":"Younghee","paragraphs":["and"]},{"title":"caki","paragraphs":["merge each other in (20a). The complex merges again with the verb. Younghee moves to Spec vP to have a subject theta role and then to Spec TP where it checks off its nominative Case and the EPP and uninterpretable features on T by Agree."]},{"title":"Caki","paragraphs":["in situ enters the Agree relation with v, checking off the accusative Case and the uninterpretable phi-features on v. The derivation continues to the next phase, merging the matrix verb and then the matrix subject. All the uninterpretable features in CP2 delete by the operation Agree.","The matrix subject reading is obtained as follows. (21) caki=Chulswu","•\\t• a. vpi [Chulswu c\\tsilehata] ata b. [„P1 Younghee [vpi [Chulswu caki] silehata]] c. [Tpi Younghee [vpi Younghee [vp i [Chulswu caki] silehan]] d. [Tpi Chulswu[n1 Younghee [vpi Younghee [vpi [Chulswu caki] silehan]] –ta]] e. {vP2[CP1[TP1 Chulswu[Tp1 Younghee [vpi Younghee [vpi [Chulswu caki] silehan]]","malhyss] f. [vp2 Chulswu[vp2[cpi [rp i Chulswu[-p 1 Younghee [vpi Younghee [yin [Chulswu caki] silehan]]","–ta]]-ko] malhyss]] 6 The structural Case deletes under agreement if the probe is appropriate—phi-complete (Chomsky 1999: 4). 435","g. [CP2[TP2 Chulswu[vp2Chulswu[vp2kP1[TP1 Chulswu[rp i Younghee [„pi Younghee [vpi [Chulswu caki] silehan]] –ta]]-ko] malhyss]]-ta]"]},{"title":"Chulswu","paragraphs":["and"]},{"title":"caki","paragraphs":["merge together. The complex merges with the verb. Now there are two choices: (i) to move"]},{"title":"Chulswu","paragraphs":["to spec vP and (ii) to merge another DP"]},{"title":"Younghee.","paragraphs":["The condition of Merge over Move forces"]},{"title":"Younghee","paragraphs":["to merge into Spec vP where it obtains the external theta role."]},{"title":"Younghee","paragraphs":["now raises to Spec TP to check its Case features and the EPP and phi-features on T. The problem is how"]},{"title":"Chulswu","paragraphs":["raises to the matrix subject position. Motomura, in his Japanese data analysis, says that adjunction of"]},{"title":"Chulswu","paragraphs":["in (21d) is an instance of scrambling which obviates the MLC. Now"]},{"title":"Chulswu","paragraphs":["has to move to Spec vP2 to get the external theta role. This movement is also problematic, crossing over CP1 from the TP adjoined position. Motomura (2001) acknowledges this problem in Japanese sentences without any solutions. In terms of movement, I do not have a solution either. There is, however, a motivation that forces"]},{"title":"Chulswu","paragraphs":["to raise;"]},{"title":"Chulswu","paragraphs":["has unchecked features and the matrix v also has unchecked features. If we assume that"]},{"title":"Chulswu","paragraphs":["is in the search domain by the probe v, then"]},{"title":"Chulswu","paragraphs":["with some mechanism raises to Spec vP2 where it gets the external theta role and check off uninterpretable features on v. Further raising to SpecTP2 delete the Case features of"]},{"title":"Chulswu","paragraphs":["and the uninterpretable EPP and phi-features on T. Such an attempt to derive the long-distance dependency through the derivational approach is worth investigating, since long-distance binding is more natural than the local binding in this type of language. Responds from native Koreans show that the matrix reading is more natural than the embedded subject reading. If long-distance binding is more easily available, then it should be done within CHL. This fact forces us to find a derivational way of accounting for the dependency within the narrow syntax."]},{"title":"4\\tNominative Anaphors","paragraphs":["Rizzi (1990) proposed that anaphors do not occur in syntactic positions construed with agreement. Woolford (1999) provided evidence that the ungrammaticality of nominative anaphors in English, Italian and Icelandic is due to the presence of agreement. She argues that languages without agreement allow nominative anaphors. Korean, Chinese and Japanese are such languages as shown below.","(22) Chulswurka cakii-ka Younghee-lul sileha-n-ta-ko Chulswu-NOM self-NOM Younhee-ACC dislike-PRES-DEC-COMP malha-yss-ta say-PAST-DEC C̀hulswu; said that self; dislikes Younghee'","(23) Zhangsan; shuo zijii hui lai Zhangsan say self will come Z̀hangsan; said that self; will come' (Huang 1982; Woolford 1999)","(24) Marikoi-ga zibuni-ga ichiban moteru-to\\tshinjiteiru Mariko-NOM self-NOM best be popular-COMP believe M̀arikoi believes that seal is the most popular'","(25) *Mary; said that herself; is the most popular","The derivational approach to the nominative anaphor binding shows why nominative anaphors are well formed in the above examples, while they are out in English type languages. Following the analyses in Hornstein (2001), Motomura (2001), and Zwart (2002), the above examples are analyzed as below. Let us start with (25).","(26) [cp2 Erp2MarY [vP2 Mary said [Cpl that hpiMary herself [vpMary herself [is the most popularMM] 436"]},{"title":"Mary","paragraphs":["and herself merge together in Spec vP, and the complex DP moves to Spec TP to check nominative Case, phi-features and the EPP features. Here I assume that anaphors have incomplete phi-features."]},{"title":"Caki","paragraphs":["type anaphors such as"]},{"title":"ziji, zibun, SE,","paragraphs":["and etc., have the person feature only, not showing the gender and number match."]},{"title":"Himselfapparently","paragraphs":["has person, number and gender described as a 3"]},{"title":"rd","paragraphs":["person, male, singular DP. I assume that the phi-features in English"]},{"title":"himself","paragraphs":["are not complete though since it lacks references. I also assume that uninterpretable features are eliminated by Agree through Match, and Match deleting the Case features and EPP and phi-features should take place between the complete phi-features of the probe and goal."]},{"title":"Herself","paragraphs":["with incomplete phi-features cannot undergo the Agree operation with T."]},{"title":"Mary","paragraphs":["is a good candidate to check all these features at once since it has the full phi-features."]},{"title":"?","paragraphs":["Once"]},{"title":"Mary","paragraphs":["is checked, it is frozen at the place so that it cannot raise to Spec TP2."]},{"title":"Herself","paragraphs":["is stranded within Spec TP with its Case features unchecked and the uninterpretable features on the matrix T cannot be eliminated. This leads the derivation to crash. Thus languages with agreement cannot have the nominative anaphors. Korean is totally different from English. (27) [c"]},{"title":"p","paragraphs":["2Er"]},{"title":"p","paragraphs":["2Chulswu [vP2"]},{"title":"Chulsw","paragraphs":["u [CP1Ir"]},{"title":"p","paragraphs":["i"]},{"title":"C","paragraphs":["hulswu caki ][vpi Chulswu caki [v"]},{"title":"p","paragraphs":["iYounghee silehan])-tal-ko] malha-yss]-tail In (27), Younghee and the verb merge together, and then the merged complex"]},{"title":"Chulswu","paragraphs":["and"]},{"title":"caki","paragraphs":["merges into the Spec vP position. The complex raises to Spec TP to check the EPP, phi-features and Case features off by the operation Agree. I assume that T has no agreement features in this type of language following Woolford (1999). I also assume that incomplete phi-features on a DP match with incomplete phi-features on T. The incomplete phi-features could be interpreted as incompleteness or absence of phi-features. Due to the absence of agreement on T,"]},{"title":"caki","paragraphs":["with incomplete features, rather than"]},{"title":"Chulswu","paragraphs":["with full phi-features can check its own Case features and the EPP features on T. Thus the Agree operation applies to"]},{"title":"caki","paragraphs":["and the lower T."]},{"title":"Chulswu","paragraphs":["with unchecked features must move to Spec vP to obtain an external theta role and then moves to Spec TP to check its nominative Case and the EPP and phi-features of T. Another assumption is needed to obviate the distance crossing over the CP 1. In Korean type of languages, it might be the case that CP is not a strong blocker for movement. No subjacency effects and anaphoric Tense could be the evidence, though it has been arguable and should be investigated more. If this analysis is on the right track, the same applies to the Chinese and Japanese examples."]},{"title":"8","paragraphs":["See the following Chinese sentence. (28) [c"]},{"title":"p","paragraphs":["2ErP2Thangsan [vp2shuo [cpi ErpiThangsan ziji [VP! Zhangsan ziji hui laii]]]]] The complex DP"]},{"title":"Zhangsan ziji","paragraphs":["raises to Spec TP where"]},{"title":"ziji","paragraphs":["checks Case and the EPP features."]},{"title":"Zhangsan","paragraphs":["moves to Spec vP and Spec TP where it checks the Case features, phi-features and the EPP features. (29) [cP2[TP2"]},{"title":"Mariko","paragraphs":["[vp2Mariko\\tMariko zibun [gyp Mariko zibun ichiban moteru]-to] shinjiteiru] The complex DP"]},{"title":"Mariko zibun","paragraphs":["raises to Spec TP where"]},{"title":"zibun","paragraphs":["checks Case and the EPP features."]},{"title":"Mariko","paragraphs":["moves to Spec vP and Spec TP where it checks the Case features, phi-features and the EPP features."]},{"title":"7 In the Hornstein (2001:189), it is assumed that","paragraphs":["self can"]},{"title":"bear Case but not phi-features and that if an expression checks any feature it must check all the features that it can check. 8","paragraphs":["In"]},{"title":"Motomura (2001: 321)'s","paragraphs":["analysis"]},{"title":"of the Japanese reflexive as shown in (29), he states that","paragraphs":["zibun can"]},{"title":"check all of the relevant features of T and of itself and the embedded subject can move up to the matrix clause, thus the derivation converges. He didn't say how the embedded ssubject can cross over CP. 437","paragraphs":["5\\tSyntactic Binding vs. Logophoricity Related Binding","The following Korean examples show how the syntactic binding has priority compared to the logophoricity effects. (30) Chulswui-ka Youngswurlopute Youngheek-ka cakiippyk-lid Chulswu-NOM Youngswu-from Younghee-NOM self-ACC sileha-n-ta-ko\\ttul-ess-ta dislike-PRES-DEC-COMP hear-PAST-DEC 'Chulswu; heard from Youngswu that Youngheek dislikes self ilt/Ic'","(31) Nayi-ka Youngswuj-lopute Youngheek-ka I-NOM Youngswu-from Younghee-NOM self-ACC sileha-n-ta-ko\\ttul-ess-ta dislike-PRES-DEC-COMP hear-PAST-DE","heard from Youngswu that Youngheek dislikes self vyk'","In (30), repeated from (6), the SOURCE NP cannot be the antecedent, while in (31), the SOURCE NP can be the antecedent. The only difference between those two sentences is that the matrix subject is available as a syntactic binder in (30), but not in (31). Based on the derivational approach, a derivation produces the embedded subject reading when"]},{"title":"Younghee","paragraphs":["merges with"]},{"title":"caki.","paragraphs":["The matrix subject reading is produced when"]},{"title":"Chulswu","paragraphs":["merges with"]},{"title":"caki. Youngswu","paragraphs":["must not merge with"]},{"title":"caki,","paragraphs":["since it should merge with the postpositional element"]},{"title":"lopute.","paragraphs":["In (31),"]},{"title":"Younghee","paragraphs":["and"]},{"title":"caki can","paragraphs":["merge together, but"]},{"title":"nay","paragraphs":["and"]},{"title":"Younghee","paragraphs":["cannot merge due to the feature mismatch."]},{"title":"Nay","paragraphs":["is merged into the matrix verb at a later derivational step. According to Zwart (2002), a PRONOUN"]},{"title":"a","paragraphs":["is coreferential with 13 iff"]},{"title":"a","paragraphs":["is merged with 13."]},{"title":"Nay","paragraphs":["has no way to be coreferential with"]},{"title":"caki,","paragraphs":["since they do not merge in the beginning. A question arises: how"]},{"title":"caki","paragraphs":["is bound to"]},{"title":"Youngswu-lopute","paragraphs":["in (31). Within CHL,"]},{"title":"caki","paragraphs":["cannot be bound to"]},{"title":"Youngswu.","paragraphs":["It seems that at SEM some discourse constraints provide"]},{"title":"Youngswu as a","paragraphs":["binder. Such a contact to the discourse storage takes cost, but happens for the diversity of"]},{"title":"meaning","paragraphs":["of the natural languages. In Reuland (2001)'s term, the syntactic binding by Merge and Move is determined within CHL and takes the least cost. The binding by logophoricity is determined at the different component after CHL, that is, at the LF interface or at SEM. If we use Reuland (2001)'s concept of rank in providing binders, we can comprise both the core binding cases and the peripheral binding cases related with logophoricity. 6 Unbound Anaphors In languages like Korean, Chinese, and Japanese, the free reflexives are grammatical. The English-type languages do not allow such a free reflexive. Reuland (2001: 446) says that there is no intrinsic property of anaphors that prohibits an unbound interpretation. He says that free anaphors can only be used for elements that are of the highest accessibility in terms of discourse factors such as center of consciousness and point of view. Take a look at the following examples.","(32) Ziji neng qu nar ma? (Pan 2001: 296)","self can go there Q","'Can self (I) go there?","(33) Caki-ka ha-yss-eyo?","self-NOM do-PAST-Q","(34) *himself went to school. The derivational approach accounts for why unbound anaphors are well formed in Korean, Chinese, and Japanese, while they are ruled out in English. (35) [CP [TPziji [vPziji [VPziji neng qu nar =]]]l (36) [CP [TPcaki [vPcalci. [VPcaki-ka ha-yss-eyo] (37) [CP [TPhimself [vPhimself [VPhimself went to school] With no agreement on T,"]},{"title":"ziji","paragraphs":["and"]},{"title":"caki can","paragraphs":["check Case and the EPP features, though they are incomplete. On the other hand,"]},{"title":"himselfraises","paragraphs":["to Spec TP where it cannot check the Case features, phi-features and EPP features, since T in English has full agreement features while"]},{"title":"himself","paragraphs":["lacks in features. 9 The sentences (35) and (36) converge, though the anaphors are not bound. Nothing prohibits the unbound anaphors as long as the derivation converges without violating Merge and Move. The binder will be found later in a different component: at LF interface or at SEM. The above example with the English anaphor"]},{"title":"himself","paragraphs":["cannot converge through derivation, since there is no way to eliminate the uninterpretable phi-features on T. The derivation simply crashes, voiding all efforts to contact the discourse storage. Consulting the discourse constraints for interpretation of anaphors is possible only for converged derivations. According to Reuland (2001),"]},{"title":"caki","paragraphs":["and"]},{"title":"ziji-type","paragraphs":["anaphors (more precisely SE anaphors in his term) are highly accessible to the discourse factors. This kind of binding is costliest but available in case that the cheaper binding is not available."]},{"title":"7\\tLong-Distance Anaphors in English","paragraphs":["Going back to English cases, the sentence (4) is repeated in (39). (38) Maryi sold a picture of herself; (39) Johni said that a picture of himselfi is on sale The derivational steps for (38) and (39) are shown below. (40) [cp [Tp Mary [vP Mary sold [DP Mary a picture [pp of [Mary herself]]]]] (41) [CP2 [TP2 John; [vn John said [Cpi that bpi John [a picture [of [John himself; ]li[vP1","[DP John a picture [of [John himself; ]]is on sale]]]]] In (40),"]},{"title":"Mary","paragraphs":["and"]},{"title":"herself at","paragraphs":["the outset."]},{"title":"Herselfobtains","paragraphs":["a theta role and its Case is checked in situ."]},{"title":"Mary","paragraphs":["with uninterpretable features raises to Spec DP where it cannot check its nominative Case."]},{"title":"Mary","paragraphs":["continues to raise to Spec vP where it gets the external theta role and then to Spec TP where it checks its nominative Case and the EPP and phi-features on T. In (41),"]},{"title":"John","paragraphs":["and"]},{"title":"himself merge","paragraphs":["together."]},{"title":"Himself","paragraphs":["gets a theta role in site and"]},{"title":"John","paragraphs":["with uninterpretable features raises to Spec DP. In the raised position"]},{"title":"John","paragraphs":["cannot check its Case, since Spec DP is not the nominative Case checking position. The whole complex DP"]},{"title":"[John a picture of (John) himself]","paragraphs":["raises to Spec TP to check its nominative Case and the EPP and phi-features on T1."]},{"title":"John","paragraphs":["with uninterpretable features now raises to Spec vP2 where it obtains a theta role and continues to raise to Spec TP2 to check its nominative Case and the EPP and phi-features of the matrix T.","Problem is again the movement over CP1. Why is the following sentence (42), repeated from (4), excluded while (39) is ruled in? 9"]},{"title":"In English constructions, the DP with full phi-features and the T with full phi-features undergo the operation Agree in the subject position, checking the nominative Case and the EPP and phi-features. There-constudtions show that the operation Agree undergoes between the T (phi complete) and","paragraphs":["there"]},{"title":"(phi incomplete).","paragraphs":["There can"]},{"title":"check the EPP feature on T off but the unibterpretable phi-features on T must be checked by the associate raising, since","paragraphs":["there"]},{"title":"has only a person feature or a D-feature. The example in issue shows that there is no DP like an associate DP in","paragraphs":["there"]},{"title":"constructions that makes Match and Agree possible. 439","paragraphs":["(42) *Mary; said that herseit is the most popular When the merged complex"]},{"title":"[Mary herself]","paragraphs":["raises to Spec TP,"]},{"title":"Mary","paragraphs":["with pull features enter Agree with T."]},{"title":"Mary","paragraphs":["is valued with nominative Case and"]},{"title":"herself","paragraphs":["is"]},{"title":"left","paragraphs":["with uninterpretable features. Once"]},{"title":"Mary","paragraphs":["is checked, it cannot raise to Spec TP in the matrix clause, which results in crash of the derivation due to the uninterpretable features on the matrix T. If"]},{"title":"herself away","paragraphs":["to move to Spec TP in the matrix clause, the derivation still crash, since phi-features of"]},{"title":"herself are","paragraphs":["not complete, leaving the phi-features of the matrix T unchecked. On the other hand, in (41), the complex"]},{"title":"[John a picture of himself]","paragraphs":["shows that"]},{"title":"John","paragraphs":["is in Spec DP position. This position is an edge position accessible from outside.°"]},{"title":"John can","paragraphs":["thus raises to the matrix CP2 and the derivation converges."]},{"title":"8\\tConclusion I","paragraphs":["have shown how Merge, Move and the operation Agree can account for the binding facts. Dependency between an anaphor and an antecedent is the result of derivation within CHL. Logophoricity and discourse effects are involved to establish the dependency when the anaphor binding cannot be determined by the computation within CHL. A variety of phenomena that could not be explained by either the syntactic approach or the logophoricity-based approach in the long-distance reflexives can now be accounted for. This paper will be meaningful in testing Reuland (2001) and Hornstein (2001)'s theory to other languages such as Korean, Chinese and Japanese in comparison to English."]},{"title":"References (Abbreviated due to space) Chomsky, N. 1999. Derivation by Phase. MIT Occasional Papers in Linguistics, No. 18. MIT. Chomsky, N. 2001. Beyond Explanatory Adequacy. Ms. MIT. Hornstein, N. 2001. Move! A Minimalist Theory of Construal. Blackwell. Kayne, R. 2002. Pronouns and their Antecedents. In Derivation and Explanation in the Minimalist Program. Epstein S. and T. Seely (eds). 133-165. Blackwell. Kitahara H. 2002. Scrambling, Case, and Interpretability. In Derivation and Explanation in the Minimalist Program. Epstein S. and T. Seely (eds). 167-183. Blackwell. Motomura, M. 2001. Formal Approaches to Japanese Linguistics 3: Proceedings from FAJL 3. MIT Working Papers in Linguistics 41. 309-323. Reuland, E. 2001. Primitives of Binding. Linguistic Inquiry 32: 439-492. Woolford E. 1999. More on the Anaphor Agreement Effect. Linguistic Inquiry 30: 257-287. Zwart, J. -W. 2002. Issues Relating to a Derivational Theory of Binding. In Derivation and Explanation in the Minimalist Program. Epstein S. and T. Seely (eds). 269-304. Blackwell. 10 Pica (1991) assumes that the anaphor can move out of the Spec DP when the complex picture-DP is in the subject position. Unlike Pica, I assume that John merged with himself can move out of the complex DP through Spec DP. The position where movement takes place is the same, though the moved elements are different due to differences in analysis. 440","paragraphs":[]}]}