{"sections":[{"title":"Mandarin Chinese Shenme in Interaction*","paragraphs":["Fuhui Hsieh Graduate Institute of Linguistics National Taiwan University hsiehfli@ms64.hinet.net 1.0 Introduction It is believed that language is such a species-specific capacity that only humans possess, which of course distinguishes"]},{"title":"homo sapiens","paragraphs":["from other ontogenetically- related species that Darwin believes evolved from the same ancestor. And what does language do for us? As Clark (1997:193) points out, one easy but somehow misleading answer is that public language is to communicate ideas, since the most obvious evidence comes from that fact that human beings profit from what others know. And like a single computer is linked to a network of computers, the link to a network is for us humans primarily provided by language, which is not only a code of communication but also an external memory store (Streeck 1995); and thus it locates one major wellspring of our rather unique kind of cognitive success. Nevertheless, Clark urges us not to neglect a subtler but equally potent role that language may play: as a tool that alters the nature of the computational tasks involved in various kinds of problem solving. And I believe in its broad sense, problem-solving abilities should include the ability language users possess to detect and modify the errors and solve the problems that occur in all the linguistic interactions. Thus, the purpose of this study is to examine a linguistic form"]},{"title":"shenme","paragraphs":["in interaction. As an interrogative pronoun, the form can be used to perform an act in conversations: to ask questions for eliciting information (as in a very common question"]},{"title":"ni jiau shenme mingzi \"ft 111-1itii --t---\"","paragraphs":["(What's your name?)) as well as for clarifying a misunderstanding or unclear point to make the joint project 1 go on as Speaker B does in extract 1. Speaker B misunderstands A's utterance of"]},{"title":"bau-baulgft\"","paragraphs":["(to give a hug) in Line 57 as"]},{"title":"bau-gau","paragraphs":["\"*K\" (to report); she feels rather confused why and what Speaker A's female classmate reported to Speaker A. After 1.1 second of pause, she verbalizes her doubts and asks the question in Line 58. But Speaker A does not take up the question and continues on her prior talk. In Line 60, Speaker B repeats her question; not until her confusion got resolved does the conversation go on in the course. *I wish to thank Prof. Shuanfan Huang and two anonymous reviewers for their useful comments and suggestions. Needless to say, all the errors and inadequacies remaining in this paper are my own. In the sense that many CA experts regard conversations as joint projects that cannot be done without collaborative contribution from all the conversation participants. 06 Extract 1 Homo 56\\tA:...(2.1) wo juede wo you shihou\\"]},{"title":"I.Mr4f,M1141R\\","paragraphs":["57\\t...(2.1) women ban haiyou nusheng hui meishi lai zhau wo bau-bau"]},{"title":"afrilfliMgtt. rAVKIttttNIS","paragraphs":["58\\tB. ...(1.1) baugau shenmel"]},{"title":"*Milt\\","paragraphs":["59\\tA:..buguo nashi hen zhengshang de"]},{"title":"'XI TANAfliE*013","paragraphs":["XXX\\ 60\\tB:...(3.4) baugau shenmel"]},{"title":"*Mitfr","paragraphs":["61\\tA:.. bau-baul","62\\tB:.. oh bau-baul oh\\t"]},{"title":"11","paragraphs":["A: \"Sometimes, I feel that... Some of the girls in my class out of no reason come and ask for","a hug. B: \"Report what?\" A: \"But those are quite normal XXX.\" B: \"Report what?\" A: \"Asking for a hug.\" B; \"Oh, asking for a hug.\" If we pay attention to daily conversations happening around us, shenme, an interrogative pronoun, can occur almost in every utterance; strangely enough, its canonical usage, information-eliciting usage, does not occur predominantly. As in extract 2, Speaker H when uttering shenme in line 195 does not intend to elicit any information but to show her mental state: she is very surprised at hearing the news that the other participant just told. Extract 2 MCON 3 192 ...(1.8) ni zhidau"]},{"title":"*Ma\\","paragraphs":["193 ..\\tzhe-yi-ci women xi-sheng na liangge jiaushoul 194 ..\\tshi bei tamen gauxialai del"]},{"title":"AVItifila-MiY3\\","paragraphs":["195 H:... (0.8) shenme/"]},{"title":"1-1-12/","paragraphs":["196 Y:... ni buxiaude"]},{"title":"ftTriAr4[1154/","paragraphs":["197 H: ...wo buzhidau\\ Y: \"You know. It was they who made the two professors in our department step down (from"]},{"title":"the posts).\" H: \"What!\" Y: \"You don't know that?\" H: \"No, I don't know that.\"","paragraphs":["In extract 3, the question containing shenme in Line 112 occurs in the mid-utterance"]},{"title":"107","paragraphs":["position, a position where a question does not normally occur; this is a rhetorical question intended no reply.","Extract 3","MCON 1 109 F:..duei ah 1","%TR.\\","110... na jiaushi xiowcishi,1"]},{"title":"#131,kal*Pa',\\","paragraphs":["111... ni zheli shi zhi jiaushi xiouxishi de qingfie 112... haishi shenmel"]},{"title":"Mik31-Frk\\","paragraphs":["113... jiushi quanbu mak F: \"That's right. What does 'Teacher's Room' mean? Does it mean the cleaning job or what else? That should mean all the related jobs.\" 2.0 Shenme in Interactions In this section, the various forms and functions of shenme will be examined. The question word is gammaticalized as an indefinite pronoun and indefinite adjective. As an indefinite pronoun, shenme is widely used by the interactants to perform listing tasks and as a scaffolded tool when engaged in re-calling tasks, which will be shown in Section 2.1 and 2.2, respectively. And Section 2.3 will demonstrate that the indefinite adjective shenme, identified by Biq (1990) as a hedge, functions not only as hedge, but is grammaticalized as an epistemic marker, conveying the speaker's attitude and emotion. 2.1 Shenme in Listing Jefferson (1990) discusses list-construction as an interactional task. She observes that lists often consist of three parts, and that participants orient to their three-partedness for example in sequential organization (e.g. when monitoring turn completion). The cognitive mechanism of three-partedness listing is of course out of the scope of this study. What we observe is that conversation participants do show a great tendency in constructing such a three-partedness listing. In Extract 4, the speaker is talking about the work that an office janitor should do by listing out the specific items and after spelling out the working items one by one she adds a shenme in Line 252 to complete her listing. Here shenme, of course, is not merely a slot-filler; it is like English \"and so on\" and French \"et cetera\". Extract 4 MCON1 247 .. jiu laushi xinjian\\"]},{"title":"itznigit\\","paragraphs":["248.. duei-bu-dueil 2 As Schegloff (1996:63) points out, questions, like pre's, are positionally-sensitive TCU, which usually occur at the very end of a speaker's turn. 108 249.. keyi kanshoul","TIMR-51-1 250..fenlai ya_","3}110q_ 251.. gueina ya"]},{"title":"Iffgq_","paragraphs":["252.. shenme 253.. duei-bu-duei\\"]},{"title":"ItTgt","paragraphs":["\"With regard to the correspondence of the teachers, (the office janitor) can keep an eye on, classify and do some thing else to them. Right?\" What strikes me most is that speakers use shenme in listing even when they do not have any specific, concrete or suitable candidates in their minds as in Extract 5, 6, and 7. Extract 5 Assig\\t181 ...ranhou biru shuo\\"]},{"title":"tatbAnt","paragraphs":["182 wo gei ta de you yixie huikueil"]},{"title":"RMAttiYA--42.-1:30A\\","paragraphs":["183 . . . huo-shi-shuol","184 .. ah ta bushi-ah"]},{"title":"#6TA--","paragraphs":["185. .. buhui sajiau ah_"]},{"title":"Walk_","paragraphs":["186 .. shenme 187 shenme del"]},{"title":"{-Fitm","paragraphs":["188 A: mm\\ \"Then, for instance, I gave her some feedbacks that she can't... she doesn't know how to show femininity, what and what.\" A: \"mm.\" Extract 6 G&M 185 M: ..ruguo yau dian nage shenme.\\"]},{"title":"AEIA,M#131ffli-flt.\\","paragraphs":["186 ... ( 1.1 ) nazhong can de,I"]},{"title":"NEVreg,\\","paragraphs":["187. . . nage nage shenme pai ah_"]},{"title":"Mifil#511C-HitYPIL _÷","paragraphs":["188.. shenme shenme zhilei del"]},{"title":"filtii-M23Areg\\","paragraphs":["189.. jiu yau Shang qian kuai ye1"]},{"title":"litr‹±..-T-114\\","paragraphs":["\"If we order that kind of dish, that what-and-what dish or something alike, that would cost us more than a thousand dollars.\" 109 Extract 7 homo 302 ... (0.9) to you xiedau"]},{"title":"f\"AY1.1","paragraphs":["\\t 303\\txiangbau jiushi"]},{"title":"*N.OVA","paragraphs":["\\t —÷ 304\\t"]},{"title":"shenme shenme shenme","paragraphs":["you xie"]},{"title":"filtfilkfilt÷i","paragraphs":["\\t 305\\tkeshi wo mei kan qingchu."]},{"title":"Ticki RiAZAV","paragraphs":["\"He did write what xiangbau was. He wrote that xiangbau was what and what and what; but I didn't take a close look on it.\" In interaction contexts (the places where Schegloff (1996) believes are the natural environment of language use and where Streeck (1995) believes language comes to life), linguistic structures have to meet with the demands of rapid, open-textual and sometimes risky social situation. And those that can survive best are those highly conventionalized formats; among them, pre perhaps is the smallest but the best example. (Streeck 1995:108) And in their cross-linguistic study on repair, Fox, Makoto & Jasperson also attribute the phenomenon of repair in conversations to various interactional pressures, and they believe that it is managed in languages with vastly different syntactic practices to meet these pressures. (1996:188) Here I believe that the use of the indefinite pronoun shenme by Mandarin speakers in listing is also an interaction-motivated phenomenon: like a ready-for-wear filler, shenme enables Mandarin speakers fulfill their listing goal under the interactional pressures even when they do not have any candidates in minds so as to be able to make the project go on."]},{"title":"2.2 Scaffolded Action","paragraphs":["In Extract 8, Speaker F asks M a question about the name of a movie they are talking about. Speaker M does not give an answer in the next turn (Line 206) but rather repeats the question shenme. And in Extract 9, the speaker is intending to retell a story that his classmate told him days ago, but he couldn't remember it at the moment. He also utters shenme in Line 348 & 349 when he is engaged in the task of re-calling. Extract 8 \\t Actor 205\\tF:...(0.79) na pian jiau shenme\\ 206 M:"]},{"title":"shenme=_ itYte=_","paragraphs":["\\t","207\\tyingwen pianming jiau= ...(0.97) <Judge Dred>l 3th-̀ 1 1114=-... (0.97) <Judge Dred>\\ \\t 208\\t• • .ta yian yige jueide faguant"]},{"title":"itN—ilfflatCAM","paragraphs":["\\t209\\tF:...(1.01) shi weilai shijie de ma_ 110 \\t 210\\tM:..dueil","211 ..zhongwen hauxiang fan-cheng shenme [chau-shi-kong zhan-jing7\\","ftkftlf F: \"What is the title of that movie?\" M: \"What=... the English title is <Judge Dred>. He plays the role of Judge Dred.\" F: \"Is it about the future world?\" M: \"Yes. The Chinese title is translated as something like [chau-shi-kong zhan-jing].\" Extract 9 \\t","KTV 346\\tni jian le,I fisT4T,\\ \\t","347\\t..wo cai xiangqi wo tongxuei gen wo jiangl VaSERITIMARMA \\t –÷ 348\\t..ta shuo shenme ah,1 \\t 349\\t-shenme=1 \\t","350\\t( 0.8 ) benlai shuo shen you shenme youlingchuan *3 1-h \\t-Ai"]},{"title":"MO.\\","paragraphs":["\"Now you mentioned it; it reminds me of what my classmate told me (days ago). What did he tell (me)? What=... (He) said there was a ghost boat.\" A simple explanation to this phenomenon would be Paul Churchland's (1995) argument that the linguistic expression is just a shallow reflection of our \"real\" knowledge: that the speaker does not know the answer at the moment and that he is in the process of thinking. A better explanation would be that we regard speakers' uttering or repeating shenme as an interactional device: a device for floor-holding or floor-taking. But are there any other possible explanations to such a talk-to-oneself during recalling phenomenon in interaction? In the 1930s the psychologist Vygotsky pioneered the idea that use of public language had profound effects on cognitive development, and one of his ideas is scaffolded action. An action is called \"scaffolded\" to the extent that it relies on some kind of external support, such as the use of tools or exploitation of the knowledge and skills of other. In this regard, scaffolded actions denote a broad class of physical, cognitive and social growths that allow us to achieve some goal that we would otherwise fail. The most common cases are where a child is temporarily able to succeed at designated tasks only by courtesy of the guidance. (Vygosky 1962; Clark 1997). The speech functions so as to guide behavior, to focus attention, and to guard against common errors. In such cases, the role of language is to guide and shape our own behavior; it is a tool for structuring and controlling action, not merely a medium of information agent. Let's return to the two speakers in Extract 8 & 9. When they are engaged in the task of recalling, I think, their uttering shenme does not merely meet the interactional demand (i.e., to hold the floor) or simply reflect their \"real\" knowledge (i.e. they do not know the answer yet and they are still in the process of thinking); I would rather believe language plays a scaffolded role in orienting their attention and shaping the re-calling task. 111 2.3 Hedges Biq (1990) regards shenme as a hedge. And based on Grice's Maxims, and Horn's A-based and R-based implicature, she identifies three kinds of hedges of Mandarin question words: interactional hedges as fillers, referential hedges as uncertainty markers, and expressive hedges as dispreferred negation relievers. In this regard, they are quite similar to Japanese nan(i) identified by Meynard (2000) as anti-sign and used by Japanese speakers for the purpose of speaking for the unspeakable. Maynard states that by virtue of its status as an anti-sign, a device for avoiding specificity, Japanese nan(i) foregrounds aspects of communication other than information. Extract 10 \\t KTV 346\\tni jiang le, \\t347\\t..wo cai xiangqi wo tongxuei gen wo jiane","R4-1SETA Eft-74-\\ \\t348\\t.. ta shuo shenme ah,\\ \\t 349\\t..shenme=t","f-FA1=\\ 350 ... 0.8 benlai shuo Shen you shenme youlingchuan.1"]},{"title":"**Uti-Mitif Sin\\","paragraphs":["\"Now you mentioned it; it reminds me of what my classmate told me (days ago). What did he tell (me)? What=... (He) said there was a some kind of ghost boat.\" In Extract 11, the speakers are talking about the presidential candidates for the Student Union. Here comes to one particular candidate who they believe is going to be elected; in previously several lUs, they said this one would definitely be elected because his father is the boss of a very big chain-bookstore in Taiwan and he comes from a very rich family; it is very easy for the listeners to infer, from the conversational implicature, that the ability of the candidate himself is not as significant as his richness. Then Speaker L continues the topic and tries to provide another reason that this particular candidate will be elected; this time, he comes to the candidate himself: Extract 11 \\t","47\\tL :(0) haiyou shenme ah M441-FIVIR \\t _÷ 48\\tshenme \\t49\\tyouliang \\t","50\\tyouliang <T xiami T> <1' 1"]},{"title":"4)(","paragraphs":["T> \\t 51\\tqingnian","\\t52\\txiami T> youxiou qingnian <T"]},{"title":"rig*","paragraphs":["T> \\t 112 \\t 53\\tC:.. mofan qingnian ba"]},{"title":"ign.*11E","paragraphs":["L: \"And what else? What...excellent...what ...outstanding... youth?\" C: \"(It) should have been 'Model Youth'.\" Awarded the Title of Model Youth is really something for a young man in Taiwan society. Nevertheless since in their opinions, this particular candidate is more rich than excellent, Speaker L uses shenme (and xiami"]},{"title":"lieg*'","paragraphs":["in Taiwanese) to mark the title, conveying his downplaying tone over. Next in Extract 12, they come to another female candidate who belongs to the Association of Feminism Study. Extract 12 Elect 115\\tL:..duei aj"]},{"title":"Vaig","paragraphs":["\\t 116\\t..nazhong nude hen kongbu"]},{"title":"#13fErligtlilift","paragraphs":["\\t 117\\tqianwan buneng kaulu,1","ra\\","\\t118\\t... (0.8) nuyanshe ye\\","fifen3\\","\\t119\\t•• ranhou to de zhengjian shi shenme nel"]},{"title":"MatztrrgRAAffit*","paragraphs":["\\t 120\\t••"]},{"title":"shenme","paragraphs":["you tichang xingbie xiauyuan la\\"]},{"title":"ft&FrIti llait ritZ ilk\\","paragraphs":["\\t121\\tC:..heN \\t 121\\tL..fanzhengjiushi nazhong nuren nenggou zemoyang ah\\"]},{"title":"z..silitA#13fVcA4MZPVIL114\\","paragraphs":["\\t122\\tranhou tichang tongzhi wenhua"]},{"title":"MAttififfil3Zif-Eulg\\","paragraphs":["L: \"yes. That kind of female are rather terrible; you should never take her into consideration.","The Association of Feminism Study! And what are her propagandas then? To promote","sexist campus and something alike.\" C: \"heN.\" L: \"Anyway, what can that kind of women do? Nothing but to promote homosexual culture.\" They don't want to give their votes for her because they believe anyone who joins that kind of student association is tough and propagates nothing but feministic thoughts and homosexual culture. Here Speaker L also uses shenme to mark the statements that the female candidate issued. Shenme here does not act as a hedge of any kind, but rather an epistemic marker, conveying the speaker's strong negative emotion and attitude toward the entity they are talking about."]},{"title":"5. Concluding Remarks This short paper demonstrates my preliminary observation on a small linguistic form","paragraphs":["shenme"]},{"title":"in Mandarin. Like","paragraphs":["pre's, shenme"]},{"title":"is small but important in both verbal","paragraphs":["113 interactions and cognition. Originating as a question word, it is grammaticalized as an indefinite pronoun and indefinite adjective. Listing is an interaction-motivated phenomenon. Under the interactional pressure, the interactant usually recruits"]},{"title":"shenme","paragraphs":["to complete the listing task; what is important here is not what has been conveyed across to the participant, but that the listing act"]},{"title":"per se","paragraphs":["has been accomplished so as to make the conversation proceeds on the course. When the interactant is engaged in recalling task,"]},{"title":"shenme","paragraphs":["plays a scaffolded role in orientating the interactant's attention and shaping the recalling task. And last, as Biq (1990) points out, it is quite a norm for a question word to be used as a hedge in verbal interaction; however, we can see from the previous examples that"]},{"title":"shenme","paragraphs":["is not only used as a hedge but an epistemic marker conveying the speaker's attitude and emotion. Public speech, inner rehearsal, and the use of written and on-line texts are all potent tools that reconfigure the shape of our cognitive space. Time and again we use words to focus, clarify, transform, offload, and control our own thinking, as Mandarin speakers use shenme in various context of interactions to reach different goals. In this regard, Jackendoff is absolutely right, when he suggests that the mental rehearsal of sentences may be the primary means by which our own thoughts are able to become objects of further attention and reflection. Thus understood, language is not mere imperfect mirror of our intuitive knowledge. Rather, it is part and parcel of the mechanism of reason itself. References Biq, Yong-O. 1990. Question words as a hedge in conversational Chinese: A. Q. and R exercise. Pragmatics and language learning, Monograph Series 1, ed. by L. B. Bouton and Y Kachru, 141-157. Urbana-Champaign: University of Illinois. Clark, A. 1997. Being there, putting brain, body and world together again. MIT Press. Fox, Barbara A., Makoto Hayashi, and Rober Jasperson. 1996. Resources and repair. Interaction and grammar, ed. by Elinor Ochs, Emanuel A Schegloff, and Sandra A. Thompson,185-235. Cambridge University Press. Helasvuo, Marja-Liisa. 2001 Emerging syntax for interaction: noun phrases and clauses as a syntactic resource for interaction. Interactional linguistics, ed. by Couper-Kuhlen, et al., 25-50. John Benjamin. Jefferson, G. 1990. List-construction as task and resource. Interaction competence, ed. by G. Psathas, 63-92. Washington, D.C.: International Institute for Ethnomethodology and Conversation Analysis & University of America Press. Maynard, Senko K. 2000. Speaking for the unspeakable: expressive functions of nan(i) in Japanese discourse. Journal of Pragmatics 32.1209-1239. Streeck, Jurgen. 1995. On projection. Social interaction and intelligence, ed. by E. Goody, 87-110. 114"]}]}