{"sections":[{"title":"Multiple Nominative Constructions in Japanese and Their Theoretical Implications","paragraphs":["Masahiro AKIYAMA","Department of Education, Ehime University","3 Bunkyou-chou, Matsuyama, Ehime, Japan","masahiro@ed.ehime-u.ac.jp Abstract This paper studies the derivation of multiple nominative constructions (MNC) in Japanese. First, discussing the MNC-sentences in which there is a relation of inalienable possession between nominative noun phrases, I will argue that the set of local economy principles that choose among potentially possible steps at a single stage of a derivation contains a principle that minimizes the size of moved elements. Second, considering the derivation of the MNC-sentences in which there is no relation of inalienable possession between nominative noun phrases, I will show a new piece of evidence for the Merge-over-Move principle. 1\\tIntroduction In a derivational theory of syntax, problems of choice arise when there are two or more potentially possible steps at a single stage of a derivation. Chomsky (1995, 2000) proposes that, if Attract/Move and Merge are both potentially possible, Merge is chosen (Merge-over-Move). It has also been proposed in the literature that, when there are two or more elements that can potentially be moved, the element closer to the target than the other(s) is moved (Attract/Move the Closest). Discussing multiple nominative constructions in Japanese, I argue that the set of principles of this kind contains a principle that minimizes the size of moved elements, and show a new piece of evidence for Merge-over-Move.","Multiple-nominative sentences in Japanese are classified into (at least) two types: those that involve a relation of inalienable possession between the nominative DPs ((1), MNC1), and those that do not ((2), MNC2). \\t","(1) a.\\tTaro-ga\\tte-ga\\tnaga-i Taro-NOM\\tarm-NOM\\tlong-PRES T̀aro's arms are long.'","b. Taro-ga\\tmabuta-ga\\thare-ta Taro-NOM\\teyelid-NOM\\tswell-PAST T̀aro's eyelids swelled.'","c. Taro-ga\\timooto-ga\\tbyooki-de\\tnalamat-ta Taro-NOM\\tsister-NOM\\tillness-by\\tdie-PAST T̀aro's sister died of illness.'","d. Taro-ga\\timooto-ga\\tterebi-ni\\tde-ta Taro-NOM\\tsister-NOM\\ttelevision-DAT appear-PAST T̀aro's sister made her appearance on television.' \\t","(2) a.\\tHaru-ga\\ttai-ga\\tuma-i spring-NOM\\tsea breams-NOM\\ttasty-PRES S̀ea breams are tasty in spring.'","b. Nihon-de\\titiban Tokyo-ga\\tkootuu-j iko-ga\\too-i Japan-LOC\\tmost Tokyo-NOM traffic accident-NOM many-PRES Ìn Japan, Traffic accidents most often occur in Tokyo.'","c. Kono bangumi-ga yuumei-na\\thaiyuu-ga yoku\\tshutuen-su-ru 50 this program-NOM famous\\tactor-NOM often\\tappearance-do-PREs F̀amous actors often make appearance on this program.'","I consider only sentences with two nominative DPs for simplicity and refer to the first one as the NDP1 and the second one as the NDP2. 1 I assume that the MNC1 and the MNC2 are derived differently (Takahashi 1994; Tateishi 1994): the MNC1 is derived from a source in which the NDP1 is contained in the [Spec, D] of the NDP2, like genitive possessors; the MNC2 is derived by inserting the NDPs each into different positions. I consider (i) what the overt structure of the MNC1 and that of the MNC2 are like and (ii) why only the proposed structure can be derived from their respective underlying source with the other potentially possible options being blocked. 2\\tThe MNC1 and"]},{"title":"Attract/Move the Smallest","paragraphs":["2.1\\tThe Positions of the Two NDPs The NDPs in the MNC1 have been shown to be subjects by previous studies. Here I discuss only a piece of evidence for their subjecthood that has not been discussed in the literature. In Japanese, a subject can control the embedded pro subject while a genitive DP cannot ((3a)). In the MNC1, either the NDP1 or","the NDP2 can do so, which shows their subjecthood ((3b, c)).2","(3) a.\\t[[Taro-nod\\tmusuko]-gai ffpro {.0} ryuugaku-si-tei-ru]\\taida-ni","[Taro-GEN\\tson]-NOM\\tstudy abroad-do-ASP-PRES\\twhile","sin-da","die-PAST","T̀aro'si son; died while hem was studying abroad.' b. Taro-gai\\tmusuko-gaj\\tfukoo-ni-mo Uprovvi) ryuugaku-si-tei-ru]","Taro NOM\\tson-NOM\\tunfortunately\\tstudy abroad-do-ASP-PRES","aida-ni]\\tsin-da","while\\tdie-PAST","Ùnfortunately, Taro's i son.; died while heo, ) was studying abroad.' c. Taro-gai fukoo-ni-mo [pro {;,j} ryuugaku-si-tei-ru aida-ni] musuko-gaj sin-da Given the subjecthood of the NDPs, previous studies (Tateishi 1994; Ura 1993, 1996) have","proposed that they are both immediately dominated by a projection of T/Agr. Unlike these studies, I","propose that only the NDP1 is overtly in [Spec, T] with the NDP2 being predicate-internal ((4)).","(4) a.\\t[r' [NDP1 Taro]-ga [T' [Ap [NDP2 te]-ga naga] ifi (Cf. (la)) b.\\t[r' [NDP1 Taro]-ga [T' [vp [NDP2 mabuta]-ga hare] ta]] (Cf. (1b))","The evidence for this comes from facts about VP-Preposing and the predicate-proform soo 'so'. In Japanese, a VP can be preposed if it is followed by a focus-particle and the light verb suns","d̀o' is inserted to support T ((5b)).","(5) a.\\tTaro-ga\\t[vp okasi-o\\ttabe]-sae\\t{su-ru/si-ta}","Taro-NOM\\tsweets-ACC\\teat-even\\tdo-PRES/do-PAST","T̀aro even eats/ate sweets.' b. (?) [v Okasi-o tabe]-sae Taro-ga {su-ru/si-ta}","There is a constraint on VP-Preposing in Japanese to the effect that it is marginal when the subject left","behind is not an agent ((6)). I refer to this as the Agent-Subject constraint (see Ohkado (1991)).","(6) a. ?? [Butai-kara\\tochi]-sae\\tTaro-ga\\tsi-ta","stage-from\\tfall-even\\tTaro-NOM\\tdo-PAST","T̀aro even fell from the stage.' b. ?? [Eigo-ga\\thanas-e]-sae\\tTaro-ga\\tsi-ta 1 I do not consider the roles of the NDPs in the information structure or the functional constraint on the MNCs. See Kuno (1973) and Takami and Kamio (1996). 2 For other arguments for the subjecthood of the NDP1, see Doron and Heycock (1999), Heycock (1993) and Kuno (1978, 1983) and Shibatani (1977). 51","English-Nom speak-can]-even \\tTaro-Nom\\tdo-Past","T̀aro even can speak English.'","Let us turn to the MNC1 ((7, 8)). VP-Preposing cannot leave behind the two NDPs in the","MNC1 ((7, 8b)), while it can 'pied-pipe' the NDP1 ((7, 8c)). \\t","(7) a.\\tTaro-ga\\timooto-ga\\tbyooki-de\\tnakunari-sae si-ta (Cf. (1 c))","Taro-NOM\\tsister-NOM\\tillness-by\\tdie-even\\tdo-Past","T̀aro's sister even died of illness.' b. * Byooki-de nakunari-sae Taro-ga imooto-ga si-ta c. ?? Imooto-ga byooki-de nakunari-sae Taro-ga si-ta \\t","(8) a.\\tTaro-ga\\timooto-ga\\tterebi-ni\\tde-sae\\tsi-ta (Cf. (1 d))","Taro-Nom\\tsister-NOM\\ttelevision-DAT appear-even do-Past","T̀aro's sister even made her appearance on television.'","b. *Terebi-ni de-sae Taro-ga imooto-ga si-ta","c. ?? Imooto-ga terebi-ni de-sae Taro-ga si-ta My proposal that the NDP1 is in [Spec, T] and the NDP2 is in the predicate phrase (i.e. VP) ((9)) correctly predicts the facts in (7, 8).","(9)\\t[NDP1 Taro]-ga [T' [NIP [NDP2 imooto]-ga nakunari]-sae si-ta]] Since the NDP2 is contained in VP, VP-Preposing cannot leave it behind ((7, 8b)). Although (7b) violates the Agent-Subject constraint, its complete unacceptability- cannot be attributed solely to it, given the mild deviance of (6a, b) (and (7c)). The NDP2 contained in VP can be moved with the rest of VP by VP-Preposing ((7, 8c)). The mild deviance of (7, 8c) is due to the Agent-Subject constraint, because the NDP1 in the MNC1 is the possessor of the NDP2 and not an agent.","In Japanese, the proform. soo 'so' (followed by the copula da if tense is required) can replace a predicate headed by an A ((10a, c)), an A(dj ectival) N(oun) ((lOb, d)) or a predicative N Oe)). In (1 Oa, b), soo replaces the AP/ANP complement of the verb naru (GOO). In (10c-e), soo replaces the AP/ANP/NP complement of T ((10g)). \\t","(10) a.\\tMary-ga\\tkasikoku\\tnat-ta, Mary-NOM\\tclever\\tbecome-PAST dare-mo\\t[[ano ko-ga\\tsoo naru]\\tto]\\tomow-anakat-ta-keredo anyone\\tthat girl-Nom so become\\tC\\tthink-NEG-PAST-though M̀ary became clever, although no one thought that she would.'","b. Mary-ga\\tkirei-ni\\tnat-ta, Mary-NOM\\tbeautiful\\tbecome-PAST dare-mo\\t[[ano ko-ga\\tsoo naru]\\tto]\\tomow-anakat-ta-keredo anyone\\tthat-girl-NOM so become\\tC\\tthink-NEG-PAST-though M̀ary became beautiful, although no one thought that she would.'","c. Zitu-wa\\tMary-ga\\tkurasu-de\\titiban kasiko-i, in fact\\tMary-Nom\\tclass-LOC\\tmost clever-PRES dare-mo\\t[Mary-ga\\tsoo-da]\\tto]\\tomot-tei-na-i-keredo anyone\\tMary-NOM\\tso-COPULA\\tC\\tthink-ASP-NEG-PRES-though ̀In fact, Mary is the cleverest in the class, although no one thinks that she is.'","d. Zitu-wa\\tMary-ga\\tkurasu-de\\titiban kirei-da, in fact\\tMary-NOM\\tclass-LOC\\tmost beautiful-COPULA dare-mo\\t[Mary-ga\\tsoo-da]\\tto]\\tomot-tei-na-i-keredo anyone\\tMary-Nom\\tso-COPULA\\tC\\tthink-ASP-NEG-PRES-though ̀In fact, Mary is the most beautiful in the class, although no one thinks that she is.'","e. Zitu-wa\\tMary-wa\\tgakusei-da, in fact\\tMary-TOP\\tstudent-COPULA dare-mo\\t[ Mary-ga\\tsoo-da]\\tto]\\tomot-tei-na-i-keredo anyone\\tMary-Nom\\tso-COPULA\\tC\\tthink-ASP-NEG-PAST-though ̀In fact, Mary is a student, although no one thought that she is.' 52 f. bp ano-ko ga [vp [Ap/ANp\\tmaim]] g. Erp Mary-ga [T' [AP/ANP/NP ...] T]] Let us now turn to the MNC1 ((11)). The replacement of AP with soo cannot strand the two","NDPs in the MNC1 ((11 a, b-ii)) unless the NDP2 is marked by a pitch rise (see Note 3), while it can","strand the NDP1 only ((1 la, b-iii)). \\t","(11) a.\\tSaikin-no\\tchousa-ni\\tyor-eba,\\tdansei-ga\\tjumyou-ga recent\\tresearch-DAT according\\tmale-NOM\\tlife span-NOM naga-i\\trasi-i-ga long-PRES\\tseem-PRES-though Àlthough the recent research says that males' life span is long'","i.\\t[[dansei-ga\\tjumyou-ga\\tnaga-i]\\tto]\\tdare-mo male-NOM life span-NOM long-PRES\\tC\\tanyone omot-tei-nakat-ta think-ASP-NEG-PAST ǹo one thought that male's life span is long.' \\t","?*[[dansei-ga jumyou-ga soo-da]\\tto] dare-mo omot-tei-nakat-ta","so-COPULA ǹo one thought that males' life span is.'","iii. [[dansei-ga\\tsoo-da]\\tto] dare-mo omot-tei-nakat-ta","SO-COPULA ǹo one thought that males' is.' \\t","b.\\tUwasa-de-wa,\\tTaro-ga\\tte-ga\\tasi-yori\\tnaga-i rumor-according\\tTaro NOM\\tarm-NOM\\tleg-than\\tlong-PRES rasi-i-ga seem-PRES-though Àlthough the rumor says that Taro's arms are longer than his legs'","i.\\t[honto-ni\\tTaro-ga\\tte-ga\\tasi-yori\\tnaga-i\\tka] actually\\tTaro-Nom\\tarm-NOM\\tleg-than\\tlong-PRES dare-mo\\tsir-ana-i anyone\\tknow-NEG-PRES ǹo one knows whether Taro's arms are actually longer than his legs.' \\t","?*[honto-ni Taro-ga te-ga soo-da\\tka] dare-mo sir-ana-i","SO-COPULA ǹo one knows whether Taro's arms are actually so.' [honto-ni Taro-ga\\tsoo-da\\tdaremo sir-ana-i","so-COPULA ǹo one knows whether Taro's are actually so.'","The contrast between the ii-examples and the Hi-examples supports my analysis, under which only the","NDP1 is overtly in [Spec, T] and the NDP2 is in the predicate phrase ((12a)). This means that the entire AP/ANP that contains the NDP2 must be replaced by soo ((12b)).3 3 Examples like (1 la, b-ii) become more acceptable if the NDP2 is contrastively focused and/or marked by a pitch rise. \\t","(i) a.\\tTaro-ga\\tte-ga\\tnaga-i\\tippou,\\tJiro- {wa/?ga} Taro-NOM arm-NOM\\tlong-PRES\\ton the other hand\\tJiro-TOP/NOM asi-ga\\tnaga-i leg-NOM\\tlong-PUS T̀aro's arms are long. On the other hand, Jiro's legs are long.' \\t","b.\\tTaro-ga te-ga naga-i ippou, Jiro- {wafiga} {asi-ga/ASI-ga} soo-da SO-COPULA","T̀aro's arms are long. On the other hand, Jiro's legs are so.' It is well known that the contrastive focus (characteristically marked by a pitch rise) affects constituency. For 53 \\t (12) a.\\tNDP1-ga [Ap/ANp NDP2-ga A/AN] TE \\t","b.\\t [r' NDP1-ga soo-dan 2.2. The Source of the MNC1 This section shows the evidence that the NDP1 in the MNC1 is overtly moved from within the NDP2 (from [Spec, D]). First, the [Spec, D] of the NDP2 cannot be filled with a genitive DP that can potentially be coindexed with the NDP1 ((13a, b)). Since a DP can contain only one possessor ((13c)), this suggests that the NDP2 contains an empty category coindexed with the NDP1 (i.e. INDP2 e1 tej-ga):","\\t(13) a.\\tTaro-gai [[(*{zibunizibun-zisin}-no) to-gai \\tnaga-i (Cf. (la))","Taro-NOM\\t{self/self-self} -GEN\\tarm-NOM\\tlong-PRES","b. Taro-gai [[(*( zibunizibun-zisin}-noi) mabuta-ga]\\thare-ta (Cf. (lb))","Taro-NOM\\tself/self-self} -GEN\\teyelid-NOM\\tswell-PAST","c. *[Taro-noi\\tzibun/zibun-zisin} -noi te]","Taro-GEN\\t{ self/self-self)-GEN\\tarm The empty category is a DP-trace (of the NDP1), but not (a) a variable, (b) a pro or (c) a PRO. Since there is only an A-binder (the NDP1) that can bind the alleged variable, the option (a) is rejected. The option (b) is also rejected. Japanese allows a pro to appear as the embedded subject, for example, and to be bound by the matrix subject. Such occurrences of pro can be replaced by the anaphor zibun ((14)). If the empty category in the NDP2 were a pro, zibun could replace it, contrary to fact ((13a, b)).","(14)\\tTaro-gai\\t[DP [rp {proi/zibun-gai}\\thon]-o\\tboku-ni","Taro-NOM\\tpro/self-NOM write-PAST\\tbook-ACC\\tI-DAT","kure-ta","give-PAST","T̀aroi gave the book he; had written to me.' Let us turn to the option (c). The controller of a PRO is an argument with an independent 0-role, which means that NDP1, the controller of the alleged PRO, should receive such a 0-role. This is implausible, example, consider (ii) (Takezawa and Whitman 1998). \\t","(ii)a.\\tTaro-ga\\tHanako-ni\\tpurezento-o\\tage-ta Taro-NOM Hanako-DAT present-ACC\\tgive-PAST T̀aro gave a present to Hanako.'","a. Ippou,\\tJiro- {wa/ga)\\tNatsuko-ni\\tpurezento-o\\tage-ta on the other hand Jiro-TOP/NOM Natsuko-DAT \\tpresent-ACC\\tgive-PAST On the other hand, Jiro gave a present to Natsuko.'","0. Ippou, Jiro- {wa/?ga} {Natsuko-ni/NATSUKO-ni} \\tsoo-si-ta","so-do-PAST (̀*)On the other hand, Jiro did so to Natsuko.' \\t","b.\\tTaro-ga Hanako-ni purezento-o age-ta, a. dare-mo\\t[Taro-ga\\tHanako-ni\\tpurezento-o\\tage-ru\\tto]","anyone\\tTaro-NOM\\tHanako-DAT\\tpresent-ACC\\tgive-PRES","omot-tei-nakat-ta-keredo","think-ASP-NEG-PAST-though","àlthough no one thought that he would give a present to Hanako.' p.?*dare-mo [Taro-ga Hanako-ni soo-su-ru\\tto] omot-tei-naka-ta-keredo","so-do-PREs","In (ii), ageru, a three-place predicate, is involved. The dative argument cannot be stranded by the VP-proform","soo-suru if it is not contrastively focused ((ii-b)) but it can be, if it is contrastively focused (with a pitch rise) ((ii-a)).","This contrast can be explained, if the contrastively focused element is moved to a left-peripheral position (Rizzi","1997) or a clause-internal focus position (Yanagida 1996). The same will be true of (i-b). 54 because the omission of the NDP1 does not result in ungrammaticality ((Taro-ga) te-ga naga-i). 4 As for the status of the empty category in the NDP2, there can thus be no choice other than \"DP-trace.\"","Second, consider (15, 16). (15, 16a), in which the NDP2s in (la, b) are short-scrambled, are unacceptable, unless the scrambled NDP2s are focused with a pitch rise (see Note 7). (15, 16c), in which the NDP2s in the embedded clauses of (15, 16b) are long-distance scrambled, are more acceptable. The contrast becomes sharper if the NDP2 that undergoes long-distance scrambling is a wh-phrase ((15d, e) and (16d, e)).5 \\t","(15) a.\\t*Te-ga Taro-ga t naga-i (Cf. (la))","b. Boku-wa\\t[Taro-ga\\tto-ga\\tnaga-i\\tto]\\tomot-ta I-TOP\\tTaro-NOM\\tarm-NOM\\tlong-PRES\\tC\\tthink-PAST Ì thought that Taro's arms are/were long.'","c. ?Te-ga boku-wa [Taro-ga t naga-i]-to omot-ta","d. Kimi-wa\\t[Taro-ga\\t[Icarada-no\\tdono bubun]-ga\\tnaga-i you-TOP\\t[Taro-NOM\\t[body-GEN\\twhich part] -NOM\\tlong-PRES to]\\tomot-ta-no C\\tthink-PAST-Q Ẁhich part of Taro's body did you think is/was long?'","e. [Karada-no dono bubun]-ga kimi-wa [Taro-ga t naga-i] to omot-ta-no \\t","(16) a.\\t*Mabuta-ga Taro-ga hare-ta (Cf. (lb)) b. Boku-wa\\t[Taro-ga\\tmabuta-ga\\thare-ta\\tto]\\tomot-ta","I-TOP\\tTaro-NOM\\teyelid-NOM\\tswell-PAST\\tC\\tthink-PAST","Ì thought that Taro's eyelids swelled...' c. ?? Mabuta-ga, boku-wa [Taro-ga t hare-ta to] omot-ta d. Kimi-wa\\t[Taro-ga\\t[karada-no\\tdono bubun]-ga\\thare-ta","you-TOP\\tTaro-NOM\\t[body-GEN\\twhich part]-NOM\\tswell-PAST","to]\\tomot-ta-no","C\\tthink-PAST-Q","Ẁhich part of Taro's body did you think swelled?' e. ? [Karada-no dono bubun]-ga, kimi-wa [Taro-ga t hare-ta to] omot-ta-no","If the NDP1 is moved to [Spec, T] from within the NDP2, (15a, c, e) and (16a, c, e) involve short or","long-distance scrambling of an element containing a DP-trace over the antecedent of the trace:","movement of the remnant over the element that has been extracted from it ((17)). \\t","(17) a.\\t[t1 {te/mabuta}]-ga2 Taro-gal t2 {naga-i/hare-ta}","b. [t1 {te/mabuta}]la2 boku-wa [p Taro-gal t2 {naga-i/hare-ta} to] omot-ta","c. [t1 karada-no dono bubun]-gat kimi-wa [p Taro-gal t2 {naga-i/hare-ta} to] ... no According to Muller (1996) and Tsujioka (2001), the movement of the remnant containing a trace over the antecedent of the trace is allowed only when the movement of the antecedent and the movement of the remnant are of different types: A'-movement of the remnant over an A'-moved antecedent and A-movement of the remnant over an A-moved antecedent are disallowed ((18)). \\t (18) a.\\t*\\t[x ty ...] (A') Y (A') tx \\t","b.\\t*\\t[x ty ...] (A) Y (A) ... tx It is recognized in the recent literature that, in Japanese, short scrambling is an instance of A-movement and long-distance scrambling is an instance of A'-movement (Grewendorf and Sabel 1998; Tsujioka 2001). 6 The latter can even count as an instance of wh-movement, if the scrambled element is a 4 Ura (1996: 107) shows that the NDP1 can be an idiom-chunk. If his observation is correct, it is problematic to the option (c). See Sakai (1994: 189), for a related issue. 5 The ungrammaticality of examples like (15, 16a) was reported by Fukuda (1991), though he does not recognize the improved status of (15c, e) and (16c, e). 6 It has been believed in the literature on Japanese scrambling (e.g. Saito 1992) that short scrambling can be either an instance of A-movement or an instance of A'-movement. The (alleged) evidence for its A'-status is provided by 55 wh-phrase (Takahashi 1993). The facts in (15, 16) can be explained by my claim that the NDP2 contains the trace of the NDP1, which is A-moved to [Spec, T]. Because short scrambling is A-movement, (15, 16a) involve A-movement of a remnant over an A-moved antecedent, which is predicted to be unacceptable. Since long-distance scrambling is A'-movement, (15, 16c) and (15, 16e) involve A'-movement of a remnant over an A-moved antecedent, which is predicted to be acceptable. The contrast in (15,16) thus supports the claim that the NDP1 is A-moved from within the NDP2.7","Third, consider (19). A noun phrase (DP1) contained in a genitive possessor (DP2) cannot be coreferential with the entire possessed noun phrase (DP3, (19a)). (19a) is acceptable when they are not coreferential. The ungrammaticality of (19a) under coindexation of DPI and DP3 can be explained by the i-within-i condition (Chomsky 1981: 212), since the DP3 in (19a) contains the DP1. With this in mind, let us consider (19b), in which DP2 and DP3 in (19a) appear as the NDP1 and the NDP2 in the MNC1, respectively. In (19b) also, DP1 and DP3 cannot be coreferential. Let us now assume that the i-within-i condition is applied in the course of a derivation. The parallelism between (19a) and (19b) can be explained in terms of the i-within-i condition with recourse to my claim that the NDP1 in the MNC1 was contained in the NDP2 at early stages of the derivation. \\t","(19) a.\\t* [DP3 [DP2 [DP1\\t{Kare/Soiturfaro} ] i-no titioya]-no\\tchoonan](.ilrga sin-da","{he/he/Taro} -GEN\\tfather-GEN\\toldest son-NOM die-PAST *̀[[ {His/Taro's} i father's oldest son]; died.' \\t b.\\t*[Dp2 [DP1 {Kare/Soitu/Taro}J-no titioya]-ga [DP3 choonan] (.4) -ga sin-dab reconstruction facts. However, even under the assumption that short scrambling is A-movement, those facts can still be explained in the following ways: (i) the principles of the Binding Theory can be applied in the course of a derivation (Epstein et al. 1995); (ii) (short-)scrambling is covertly undone (Saito 1989). For this reason, I can conclude that every instance of short-scrambling can be analyzed as A-movement, except those cases to be discussed in Note 7. 7 (15, 16a) become more acceptable if the NDP1 is focused and followed by a pause ((i, ii-a)). This can be explained if a focused element is A'-moved to a left-peripheral position above TP (Rizzi 1997), which, at present, lacks independent evidence but does not seem implausible. Incidentally, (15, 16a) are improved also by replacing the nominative marker on the NDP1 with the topic/contrast-marker wa ((i, ii-b)). This can be expected if a topic or a contrasted element undergoes A'-movement.","(i) a.\\tTE-ga, Taro-ga naga-i (Cf. (15b))","b.\\tTe-wa(,) Taro-ga naga-i (Cf. (15b))","(ii) a.\\tMABUTA-ga, Taro-ga hare-ta (Cf. (16b))","b.\\tMabuta-wa(,) Taro-ga hare-ta (Cf. (16b)) 8 The discussion of (19) is important because it shows that, at the underlying structure, the NDP1 is dominated by the NDP2. As shown by (19a), a noun phrase in a genitive possessor induces an i-within-i violation if it is coindexed with the entire possessed noun phrase. Now let us consider (i).","(i) a.dekake-ta]\\t{Taro/sono gakusei}J i[Erp ei\\tgakkou-ni","school-DAT\\tleave-PAST\\tTaro/that student","{Taro/that student}, who left for school'","b.hanron-s-are-rui\\tto] {-no/-iu}\\tshuchoo]* [[cP [Tp ei sugu-ni","soon\\targue-against-do-PASS-PRES\\tC\\tclaim","t̀he claim that the claim itself will soon be argued against' (i-a) involves a TP (or CP) embedded as a non-restrictive relative clause; (i-b), a CP embedded as the complement of an N (shuchoo c̀laim'). As is always the case with relative clauses, the empty noun phrase in the embedded clause in (i-a) can (only) be interpreted as coreferential with the entire noun phrase. On the other hand, in (i-b), the empty noun phrase in the embedded clause cannot be coreferential with the entire noun phrase. Reinterpreting and modifying Jackendoff's (1977) analysis of non-restrictive relative clauses under the DP-analysis, let us suppose that a non-restrictive relative clause is adjoined to DP ((ii)). Second, let us assume that a complement clause is merged as the complement of N ((iii)), although whether it overtly remains in that position is unclear.","(ii) [DP [Tp ei gakkou-ni dekake-ta] [DP {Taro/sono otoko}]]i","(iii) [DP [NP [cP [Tp ei sugu-ni hanron-s-are-ru] to]-no shuchoon 56","Fourth, consider the examples in (20).","(20) a.(o-)kao]-ga\\tkirei-da[DP\\tSensei-no","teacher-GEN HON-face-NOM beautiful-COPULA","T̀he teacher's face is beautiful.'","b. John-ga [DP sensei-no\\t(o-)kao]-o\\tnagut-ta","John-NOM\\tteacher-GEN HON-face-ACC hit-PAST","J̀ohn hit the teacher's face.'","c. [DP\\tAno doroboo-no (#o-)kao}-ga kirei-da","that\\tthief-GEN","d. John-ga [Dp ano doroboo-no (#o-)kao]-o nagut-ta","e. [DP3 [DP2 [DPI\\tSensei]-no\\tbaka-nadesi]-no\\t(#o-)kao]-ga","teacher-GEN foolish apprentice-GEN HON-face-NOM","kirei-da","beautiful-COPULA","T̀he teacher's foolish apprentice's face is beautiful.'","f. [DP3 [DP2 [DP1\\tAno baka-na gakusei]-no\\tyuumei-na\\tsensei]-no","that foolish\\tstudent-GEN famous\\tteacher-GEN","(o-)kaoj-ga\\tkirei-da","HON-face-NOM beautiful-COPULA","T̀hat foolish student's famous teacher's face is beautiful.' A genitive possessor of a DP can induce the honorific o-prefixation on the possessed noun as shown by (20a, b) (Harada 1976). In (20a), the subject noun phrase contains the genitive possessor sensei-no 'the teacher's', whose referent is socially considered to be worthy of respect in Japan. The same is true of the object noun phrase in (20b). The o-prefixation is far from acceptable when the referent of the genitive possessor is not worthy of respect ((20c, d)). This suggests that honorific o-prefixation is based on the Spec-head relation between a possessor and the D associated with the N to which the prefixation is applied. Let us consider more complex cases in (20e, f). In (20e), the subject noun phrase headed by kao 'face' contains the genitive possessor sensei-no 'the teacher's', which can potentially induce the o-prefixation ((20a, b)). However, in (20e), sensei-no is so deeply embedded that it cannot induce the o-prefixation on kao. On the other hand, in (20f), the possessor headed by sensei-no occupies the Spec of the D associated with kao and thus the o-prefixation can be applied","With this in mind, let us turn to the MNC1 ((21)). \\t","(21) a.\\tSensei-ga\\t(o-)kao-ga\\tkirei-da teacher-NOM HON-face-NOM beautiful-COPULA T̀he teacher's face is beautiful.' \\t","b.\\tAno doroboo-ga (#o-)kao-ga kirei-da that\\tthief-Nom Then the contrast between (i-a) and (i-b) can be explained by the i-within-i condition, if we revise it as in (iv). \\t","(iv)\\tA cannot be coindexed with (or interpreted as coreferential with) B, if B dominates A. In (ii), e is not dominated by the entire DP, given the segment-category distinction, hence they can be coindexed. In (iii), e is dominated by the entire DP, and thus they cannot be coindexed. If the above argument is on the right track, the ungrammaticality of (19a) shows that a genitive possessor is dominated by the entire possessed noun phrase. Similarly, (19b) shows that, at the underlying structure of the MNC1, the NDP1 is dominated by the entire NDP2.","Incidentally, the fact that the empty noun phrase in a restrictive relative clause can be coindexed with the head noun phrase can be correctly dealt with (a) by assuming that a restrictive relative clause is adjoined to DP and DP is the antecedent of the empty noun phrase ((v-a)) or (b) by assuming that a restrictive relative clause is adjoined to NP (or N') and that NP (or N'), but not DP, is the antecedent of the empty noun phrase ((v-b), see Hirose (1997), for discussion indirectly relevant to this issue). \\t","(v) a.\\t[DP [TP Taro-ga ei\\tkat-ta]\\t[DP hon]]i Taro-NOM\\tbuy-PAST\\tbook \\t b.\\t[DP [NP/N' [TP Taro-ga ei kat-ta] [NP/N' hon]ii D] 57 c•baka-na\\tdesi]-ga[DP2 [Dpi sensei]-no","teacher-GEN foolish\\tapprentice-NOM","[DP3 t DP2 (#o-)kao]-ga\\tkirei-da","HON-face-NOM beautiful-COPULA","T̀he teacher's foolish apprentice's face is beautiful.' d•gakusefl-no\\tyuumei-na\\tsensei]-ga[DP2 [DP1Ano baka-na","that\\tfoolish\\tstudent-GEN famous\\tteacher-NOM","[DP3 t DP2\\t(o-)kao]-ga\\tkirei-da","HON-face-NOM beautiful-COPULA","T̀hat foolish student's famous teacher's face is beautiful.'","The honorific o-prefixation can be applied to the head N of the NDP2 if the referent of the NDP1 is","socially regarded as worthy of respect ((21a)). The prefixation is awkward when the referent of the","NDP1 is not worthy of respect ((21b)). Furthermore, consider the complex cases in (21c, d). Similarly","to (20e), when sensei is embedded as the possessor of the NDP1 (DP2 in (21c)), the o-prefixation cannot","be applied to the head N of the NDP2 (DP3 in (21c)). On the other hand, when sensei is the head N of","the NDP1 (DP2 in (21d)), it can induce the o-prefixation on the head N of the NDP2 (DP3 in (21d)),","which is similar to what occurs in (200. These facts can be expected if we assume that the NDP1 in the","MNC occupies the [Spec, D] of the NDP2 at early stages of the derivation and can thereby induce the","honorific prefixation on the head N of the latter, as do ordinary genitive possessors. 2.3. The Derivation of the MNC1 and Attract/Move the Smallest What we have observed so far partially falls into place in the following way: (a) the entire NDP2 is merged into the predicate-internal subject position ((22a)); (b) NDP1 is overtly moved to [Spec, T] to satisfy the E(xtended) P(rojection) P(rinciple) ((22b)); (c) NDP2 overtly remains in-situ, since the EPP has been satisfied.9","(22) a.\\t[TP [XP [NDP2 NDP1 [ND'2 ...]1 ... X] T]","b.\\t[TP NDP1 [T' [XP [NDP2 tNDP1 [ND'2 .•.]] ••• X] T]]","What remains unanswered is the following question: Why is overt movement of the entire NDP2 containing the NDP1 impossible? This issue is an instance of a general one: the MNC1 offers a case where there are two or more elements that can be moved for the same reason at a single stage. It has been proposed that the choice in such cases is mostly made by Attract/Move the Closest (Chomsky 1995). Is that principle responsible for the choice of movement of the NDP1 in the MNC1? Under the definitions of closer that have been proposed, in order for A to be closer to the target than B, A must c-command B (Chomsky 1995, 2000). Since the NDP1 is dominated by the NDP2 in (22a), neither of them c-commands the other. The answer to the above question is thus negative. Then, what makes the decision?","An answer comes from the fact that, other things being equal, natural languages tend to minimize the size of moved elements (See Boskovic 1995, 1997 and Stateva 2002, for relevant 9 I propose that the NDP2 is covertly moved, for the case-reason, to [Spec, T] (the inner [Spec, T] under Richards's (1999) analysis of multiple specifiers). A piece of evidence for this comes from the scope relation between the NDP2 and sentential negation. Negative sentences in Japanese are marked in most cases by the negative marker (a)na(k), which immediately follows a main/copular V or an A, and immediately precedes an adjectival tense-ending (-i 1-atta). The relevant morpheme order is expected if the negative marker selects a VP or an AP, and heads a projection NegP selected by T ((i)). Suppose that, if A asymmetrically c-commands B, A takes scope over B in the salient reading. If the NDP2 is covertly moved to [Spec, T], where it asymmetrically c-commands Neg, it is predicted that the NDP2 takes scope over negation in the predominant reading ((ii)). The salient reading of (ii) is that, for each of Taro's fingers, it is true that it is not longer than Ziro's (corresponding) finger (V > Neg).","(i) [TP •• • [NegP ••• [AP/VP • • • V/A] -(a)na(k)j- {i/atta}]","(ii) Taro-ga\\t[subete-no yubi]-ga\\tZiro-yori\\tnagaku-na-i","Taro-NOM\\t[all-GEN finger]-NOM\\tZiro-than\\tlong-NEG-PRES","Àll Taro's fingers are not longer than Ziro's.' 58 evidence). Here I assume that UG contains the local economy principle (23), where the notion smaller is defined in (24) (Stateva 2002). \\t","(23)\\tAttract/Move the Smallest: A target T can attract a if there is no 13, 13 smaller than a, such that T attracts 1i. \\t","(24)\\tf is smaller than a, if a contains J3. When there are two or more elements that can potentially be moved, and one of them is contained in the other(s) and thus smaller than the other(s), Attract/Move the Smallest (A/MS) chooses the movement of the smaller/smallest element. The NDP1 is contained in the NDP2 in (22a). Therefore, A/MS chooses the movement of the NDP1, which yields the desirable overt structure (22b).10 3\\tThe MNC2 and"]},{"title":"Merge-over-Move","paragraphs":["Let us finally turn to the MNC2. Essentially following Takahashi (1994) and Tateishi (1994), I assume that in the MNC2, the NDP1 and NDP2 are each inserted into different syntactic positions. The NDP2 in the MNC2 can be moved by Short-scrambling in some cases ((25)). This shows that, unlike in the MNC1 ((15, 16a)), the NDP2 in the MNC2 does not contain the trace of the NDP1. \\t (25) a.\\tTai-ga haru-ga uma-i (Cf. (2a)) \\t","b.\\t?Kootuu-jiko-ga Tokyo-ga oo-i (Cf. (2b)) I propose that, in the MNC2 too, the NDP1 is in [Spec, T] while the NDP2 is in the predicate-internal (subject) position ((26a, b)). The evidence for this proposal comes again from the facts about VP-Preposing and the facts about the replacement with soo. \\t (26) a.\\t[r' [DP har*ga [r [AP [ DP tai]-ga uma] ii] (Cf. (2a)) \\t","b.\\t[r' [DP kono bangumi]-ga [T. [vp [DP yuumei-na haiyuu]-ga yoku shutuen-su] ru]]","(Cf. (2c))","First, VP-Preposing cannot leave behind both the two NDPs ((27b)) while it can marginally p̀ied-pipe' the NDP2 ((27c)). The mild deviance of (27c) is due to the Agent-Subject constraint. Given our proposal that the NDP2 in the MNC2 is overtly predicate-internal (i.e. contained in VP in this case), the ungrammaticality of (27b) can be easily explained: VP-Preposing cannot leave behind the NDP2 contained in VP. Because of the agentivity of the subject of the verb shutuen-suru 'make appearance', the complete ungrammaticality of (27b) is not due to the Agent-Subject constraint. \\t","(27) a.\\t? [Tp\\tKono bangumi-ga\\t[T. [vp yuumei-na\\thaiyuu-ga","this program-NOM\\tfamous-COPULA\\tactor-NOM","yoku shutuen-si]-sae\\tsu-ru]]","often appearance-do-even do-PRES","Èven famous actors often make appearance on this program.' b. *Yoku shutuen-si-sae kono-bangumi-ga yuumei-na haiyuu-ga su-ru c. ?? Yuumei-na haiyuu-ga yoku shutuen-si-sae kono bangumi-ga su-ru Second, soo-replacement cannot leave behind the two NDPs ((28, 29b)) while it can leave","behind the NDP1 only ((28, 29c)). My proposal that the NDP2 in the MNC2 is contained in the","predicate phrase (AP, in this case) while the NDP1 is in [Spec, T] correctly explains the contrast","between (28, 29b) and (28, 29c). \\t","(28)\\tHaru-ga [r [Ap tai-ga\\tuma] ii]\\tkoto-wa\\tyoku","spring-NOM\\tsea bream-NOM tasty PRES fact-TOP\\twell sir-are-tei-ru-ga know-PASS-ASP-PRES-though Àlthough it is well known that sea breams are tasty in spring,' \\t","a.\\tkodomo-no\\tkoro-wa,\\t[ ham-ga\\ttai-ga\\tuma-1\\tto] child-GEN\\ttime-TOP\\tspring-NOM\\tsea bream-NOM tasty-PRES\\tC 10 There arise some questions about A/MS: its interaction with Attract/Move the Closest is not considered in the present paper; it is unclear whether it can cope with the optionality of pied-piping in wh-movement, etc. However, answering all such questions is beyond the scope of this paper (see Akiyama 2002, 2003). 59 omot-tei-nakat-ta think-ASP-NEG-PAST","b. *kodomo-no koro-wa, [haru-ga tai-ga\\tsoo-da to] omot-tei-ana-katta","so-COPULA #̀I did not think spring, sea breams are/is so when I was a child.'","c. ? kodomo-no koro-wa, [ham-ga soo-da to] omot-tei-ana-katta Ìd did not think spring is so when I was a child.' \\t","(29)\\tNihon-de\\titiban Tokyo-ga\\tkootuu-jiko-ga\\too-i","Japan-LOC\\tmost Tokyo-NOM traffic accident-NOM many-PRES","rasi-i\\tga","seem-PRES though","Àlthough I heard that, in Japan, traffic accidents most often occur in Tokyo...'","a. [Tokyo-ga\\tkootuu-jiko-ga\\too-i\\tto]\\tdare-mo","Tokyo-NOM traffic accident-NOM many-PRES\\tC\\tanyone","omot-tei-nakat-ta","think-ASP-NEG-PAST","ǹo one thought that traffic accidents (most) often occur in Tokyo.'","b. *[Tokyo-ga kootuujiko-ga\\tsoo-da to] dare-mo omot-tei-nakat-ta","so-COPULA","ltno one thought that Tokyo, traffic accidents is/are so.'","c. [Tokyo-ga soo-da to] dare-mo omot-tei-nakat-ta","Vno one thought that Tokyo is so.'","Let us consider the derivation of the MNC2. Because the NDP2 is the (external) argument of","the predicate, it is merged in the predicate-internal position ((30)). The NDP1 is formed by Merge","independently of (30). After T is introduced, the EPP must be satisfied. There are two options that meet","this requirement: (a) the movement of the NDP2, (which will be followed by the insertion of the NDP1)","((31a)) and (b) the insertion of the NDP1 ((31b)). The facts show that (b) is chosen ((27-29)). But why","is the movement of the NDP2 prohibited? An answer comes from Merge-over-Move: Attract/Move is","blocked in favor of Merge. \\t (30)","\\t [AP [NDP2 tai]-ga ... uma] \\t","(31) a.\\t [i • [NDF2 tai]-ga [r Gar tNDp2 . . . umaj il] \\t","b.\\t CT' [NDpi haruFga [r [AP [NDP2 tafl-ga ... urna] i]] 4\\tConclusion I have shown that, in both the MNC1 and the MNC2, the NDP1 is in [Spec, T] and the NDP2 is predicate-internal. This structural asymmetry is attributed to the general tendency to minimize moved element (A/MS (23)), in the MNC1, and to Merge-over-Move principle, in the MNC2. I thus have argued that A/MS is one of the principles that choose among the possible derivational steps at a single stage of a derivation and also shown further evidence for the Merge-over-Move principle. References","Akiyama, Masahiro (2002). Multiple nominative construction in Japanese and its theoretical implications. In Proceedings of the 2002 LSK International Summer Conference Val: Forum lectures and paper presentations, 93-104. The Linguistic Society of Korea, Seoul.","Akiyama, Masahiro (2003). On the general tendency to minimize move elements: Multiple nominative construction in Japanese and its theoretical implications. MS. Ehime University.","Boskovic, Zeljko (1995). Participle movement and second position cliticization in Serbo-Croatian. Lingua 96: 246-266. 60 Boskovic, Zeljko (1997). The Syntax of Nonfinite Complementation: An Economy Approach. Cambridge, MA:","MIT Press. Chomsky, Noam (1981). Lectures on Government and Binding. Dordrecht: Foris Publications. Chomsky, Noam (1995). The Minimalist Program. Cambridge, MA: MIT Press. Chomsky, Noam (2000). Minimalist inquiries: the framework. In Step by Step: Essays on Minimalist Syntax in","Honor of Howard Lasnik, Roger Martin et al. (eds.), 89-155. Cambridge, MA: MIT Press. Doron, Edit and Caroline Heycock (1998). Filling and licensing multiple specifiers. In Specifiers: Minimalist","Approaches, David Adger et al. (eds.), 69-89. Oxford: Oxford University Press. Epstein, Samuel D., Erich M. Groat, Ruriko Kawashima and Hisatsugu Kitahara (1998). A Derivational","Approach to Syntactic Relations. Oxford: Oxford University Press. Fukuda, Minoru (1991). A movement approach to Multiple Subject Construction in Japanese. Journal of","Japanese Linguistics 13: 21-51. Grewendorf, Ginter and Joachim Sabel (1998). Scrambling in German and Japanese: Adjunction versus","multiple specifiers. Natural Language and Linguistic Theory 17: 1-65. Harada, Shinichi (1976). Honorifics. In Japanese Generative Grammar (Syntax and Semantics 5), Masayoshi","Shibatani (ed.), 499-561, New York: Academic Press. Heycock, Caroline (1993). Syntactic predication in Japanese. Journal of East Asian Linguistics 2: 167-211. Hirose, Yukio (1997). Bound proforms as N-bar proforms. Lingua 102: 169-186. Jackendoff, Ray (1977). X' Syntax: A Study of Phrase Structure. Cambridge, MA: MIT Press. Kuno, Susumu (1973). The Structure of the Japanese Language. Cambridge, MA: MIT Press. Kuno, Susumu (1978). Theoretical perspectives on Japanese linguistics. In Problems in Japanese Syntax and","Semantics, John Hinds and Irwin Howard (eds.), 213-285. Kaitaku-sha: Tokyo. Kuno, Susumu (1983). Shin Nihon Bunpou Kenkyuu (New Studies of Japanese Grammar). Taishuu-kan,","Tokyo. Muller, Gereon (1996). A constraint on remnant movement. Natural Language and Linguistic Theory 14: 355-","407. Ohkado, Masayuki (1991). A note on suru in Japanese. Linguistic Analysis 21:148-169. Richards, Norvin (1999). Featural cyclicity and the ordering of multiple specifiers. In Working Minimalism,","Samuel David Epstein and Norbert Hornstein (eds.), 127-158. Cambridge, MA: MIT Press. Rizzi, Luigi (1997). The fine structure of the left periphery. In Elements of Grammar: Handbook of Generative","Syntax, Liliane Haegeman (ed.), 281-337. Dordrecht: Kluwer Academic Publishers. Saito, Mamoru (1989). Scrambling as semantically vacuous A'-movement. InAlternative Conceptions of Phrase","Structure, Mark R. Baltin and Anthony S. Kroch (eds.), 182-200. Chicago: The University of Chicago","Press. Saito, Mamoru (1992). Long distance scrambling in Japanese. Journal of East Asian Linguistics 1, 69-118. Sakai, Hiromu (1994). Complex NP constraint and case-conversions in Japanese. In Current Topics in English","and Japanese, Masaru Nakamura (ed.), 179-200. Tokyo: Hituzi. Shibatani, Masayoshi (1977). Grammatical relations and surface cases. Language 53: 789-809. Stateva, Penka (2002). Possessive clitics and the structure of nominal expressions. Lingua 112: 647-690. Takahashi, Chioko (1994). Case, agreement, and multiple Specifiers. In Japanese/Korean Linguistics 4, Patricia","M. Clancy (ed.), 395-411. Stanford: CSLI Publications. Takahashi, Daiko (1993). Movement of wh-phrases in Japanese. Natural Language and Linguistic Theory 11:","655-678. Takami, Ken-ichi and Akio Kamio (1996). Topicalization and Subjectivization in Japanese: Characterizational","and identificational information. Lingua 99, 207-235. Takezawa, Koichi and John Whitman (1998). Kaku-to gojun-to tougo-kouzou (Case, word order and syntactic","structure). Tokyo: Kenkyuu-sha. Tateishi, Koichi (1994). The Syntax of 'Subjects.' Tokyo: Kurosio. Tsujioka, Takae (2001). Improper remnant A-movement. In Proceedings of the North East Linguistic Society 31,","Vo1.1, Minjoo Kim and Uri Straus (eds.), 483-500. Amherst, Massachusetts: GLSA. Ura, Hiroyuki (1993). L-relatedness and its parametric variation. MIT Working Papers in Linguistics 19: 377-","399. Ura, Hiroyuki (1996). Multiple feature-checking: A theory of grammatical function splitting. Ph.D. dissertation,","Massachusetts Institute of Technology, Cambridge. Yanagida, Yuko (1996). Syntactic QR in wh-in-situ languages. Lingua 99: 21-36. 61"]}]}