{"sections":[{"title":"Subject Positions and Derivational Scope Calculation in Minimalist Syntax: A Phase-Based Approach","paragraphs":["YUKIKO UEDA Meiji Gakuin University","1518 Kamikuratacho, Totsuka-ku","Yokohama, Japan PXN13771@nifty.ne.jp Abstract This paper proposes a new scope calculation system named a phase-based approach. The new system treats scope calculation as a feature-matching operation between more than one interpretable feature related to quantification (henceforth Fqunt1 ). We call this matching operation Fq.nrmatching. It is shown that the working space of Fquanrmatching is restricted by a syntactic unit phases. Given the matching operation for scope calculation in CHL, scope interpretation can be derivationally determined in narrow syntax as far as it is permitted by the Phase Impenetrability Condition (PIC) proposed in Chomsky (2001). It is demonstrated that various mysterious scope facts in both English and Japanese are reducible to our phase-based scope system without any other special implement. 1\\tIntroduction This paper explores the correlation between subject positions and scope interpretation in Chomsky's (2000, 2001) framework. Section 2 discusses variation in subject positions across languages. We claim that unlike English Nominative Case, C, rather than the finite T, is relevant to ga-marking in Japanese. We further argue for A'-properties of Japanese ga-marked subjects with emphasis on the parallelism between the ga-kara alternating constructions in Japanese and the preverbal and postverbal subject constructions in Greek and Catalan. In Section 3 and 4, based on our different subject positions, we propose a new scope system in terms of a syntactic unit called phases. It is demonstrated that the matching operation is subject to the PIC proposed in Chomsky's (2001) Derivation by Phase, using various scope facts in both English and Japanese, including Double Object Constructions (henceforth DOCs). It is claimed that scope calculation can be derivationally determined in narrow syntax with only existent basic implements for sentence building, that is, match and PIC. Section 5 has a conclusion. 2\\tThe Position of Ga-Marked Subjects in Japanese Section 2 discusses the different status of the Nominative subject in English and the ga-marked subject in Japanese with the conclusion given in (1). (1) a. English Nominative subjects are licensed by T and placed in the TP-layer with A-properties.","b. Japanese ga-marked subjects are licensed by C and placed in the CP-layer with A'-properties. 2.1 Japanese Ga-Marked Subjects Function as A'-Binders: Fukui (1984, 1986) Fukui (1984) claims that Japanese Nominative subjects show A'-properties in team of zibun-binding and Safir's Parallelism Constraint on Operator Binding (henceforth PCOB). Zibun 'SELF' can refer not only to subjects as in (2a), but also to gapless Topic phrases, as in (2b), and relative head nouns, as I The term Fq i borrowed from Watanabe (1998).uant _S 134 in (2c). These positions are considered as typical A'-positions.","(2) a. ga-subject Johnrga Mary-ni zibun; no imooto-o syookai-si-ta. John-Nom Mary-to SELF-Gen sister-Acc introduce-do-Past J̀ohn introduced SELF's sister to Mary.'","b. gapless topic Sono hahaoyarwa [ zibun;-no\\tmusuko-ga sinde simatta]. the mother-Top\\tSELF-Gen son-Nom\\tdie-Past Às for the mother;, SELF i's son died.'\\t (Fukui 1984: 37)","c. relative clause head","[s Zibunrno\\thahaoya-ga kinoo\\tsinde simatta] John;]","SELF-Gen mother-Nom yesterday die-Past\\tJohn J̀ohns, SELFi's mother died yesterday.'\\t (Fukui 1984: 8) Fukui (1984) attempts to give a unified account of these binding facts in (2) and proposes (3). (3) Zibun must be bound by the closest A'-binder. (Fukui 1984: 27) Namely, Fukui claims that the ga-marked subject in (2a) occupies an A'-position on a par with (2b) and (2c). Furthermore, making use of Safir's Parallelism Constraint on Operator Binding, given in (4), he argues for the A'-status of Japanese subjects.","(4) Safir's PCOB (Parallelism Constraint on Operator Binding) If 0 is an operator and x is a variable bound by 0, then for any y, y a variable, x and y are the same in their feature specifications. (slightly modified by Fukui 1984) The Japanese binding facts illustrated in (5) are subject to Safir's PCOB. Kare 'HIS' and zibun S̀ELF' are not the same in their feature specification. That is why (5a) and (5b) are ungrammatical. The main point is that Safir's PCOB is a constraint on A'-binding and not on A-binding. That is, Japanese ga-marked subjects function as A'-binders.","(5) a.* Johnrga karerno kaban to\\tzibun; no syasin-o\\tmot-te-kaet-te-ki-ta John-Nom HIS-Gen bag\\tand SELF-Gen picture-Acc take-TE-back-TE-come-Past lohni came back with HIS; bag and a picture of I-MVISELFi.'","b.*Johni-ga zibun no kaban to karerno syasin-o mot-te-kaet-te-ki-ta.","SELF\\tHIS","c. Johnrga karerno kaban to karei-nosyasin-o mot-te-kaet-te-ki-ta.","HIS\\tHIS","d. Johnrga zibunrno kaban to zibunrno syasin-o mot-te-kaet-te-ki-ta.","SELF\\tSELF\\t (Fukui 1984) On the other hand, the grammaticality of the English sentence (6) indicates that English Nominative subjects are A-binders. (6) Johni came back with hisi bag and a picture of himselfi.\\t (Fukui 1984)","To sum up, Japanese subjects have syntactically different properties from English Nominative subjects with respect to the A/A' dichotomy. The former shows A'-status, the latter, whose Case is generally assumed to be licensed by the finite T, A-properties. What then is the position of Japanese subjects? On the basis of his research, Fukui (1984, 1986) proposes the adjunct hypothesis of Japanese subjects, that is, V'-adjoined position for Japanese subjects. In the subsequent subsections, accepting his claim that Japanese subjects are placed in A'-position with A'-property, we will reach a different conclusion with respect to the position of Japanese ga-marked subjects. We claim that the most plausible position for Japanese ga-marked subjects is the CP-Spec position, which has A'- properties. 2.2 Scope Interaction with Negation Consider the scope interaction between ga-marked subjects and Negation (henceforth Neg). Ga-marked subjects in non-scrambled sentences always take scope over sentential Neg as illustrated in 135 (7).","(7) a. Daremo-ga\\tohiru-o tabe-nak-atta. (every > Neg, *Neg > every) everyone-Nom lunch-Acc eat-Neg-Past Ǹobody ate lunch.'","b. 3-nin no gakusei-ga ohiru-o\\ttabe-nak-atta. (3 > Neg, *Neg > 3) 3-CL Gen student-Nom lunch-Acc eat-Neg-Past T̀here are three students who did not take lunch.' If we assume that sentential Neg is generated between vP and TP (Pollock 1989), it is plausible that Japanese ga-subjects are located outside vP.","To summarize the discussion so far, Japanese ga-marked subjects have A'-properties and are placed in the position higher than Neg, at least, outside vP. In the subsequent subsections, we forward our claim that a position somewhere in CP is one of the most plausible candidates for Japanese ga-marked subjects. 2.3 Against the Involvement of Finite T in Ga-Marking This subsection further narrows down the discussion to the question of the possible positions for Japanese subjects. It is shown that C, rather than finite T, is involved in ga-marking in Japanese.","Takezawa (1987) argues that not only English Nominative Case, but also Japanese ga is assigned by finite T (INFL in his terms). Takezawa (1987) shows that ga cannot be assigned to vP-internal elements without the finite T, using the Small Clause type examples in (8) and causative constructions in (9). The predicates of these types do not permit any Tense morphemes in the embedded clause.","(8) Small Clause type complements","a. with a finite Tense morpheme John-ga jcp [ Mary-no yokogao]-ga totemo utukusi-i ] \\tto]\\tomot-ta. John-Nom\\tMary-Gen profile-Nom very beautiful-Pres COMP think-Past J̀ohn thought Mary's profile was ((lit.) is) very beautiful.'","b. without a finite Tense morpheme John-ga [ Mary-no yokogao]-*gai-o totemo utukusiku] omot-ta. John-Nom Mary-Gen profile-Nom/-Acc very beautiful think-Past (lit.)J̀ohn thought Mary's profile very beautiful.'\\t(Takezawa 1987:73-75)","Complement subject positions of -sase C̀ADS' and -moraw 'receive'","a. John-wa [ Mary-nil*-ga\\tsusi-o\\ttabe]-sase-ta. John-Top Mary-Dati-Nom susi-Acc eat -CAUS-Past J̀ohn made Mary eat susi.'","b. John-wa [ Mary-nil*-ga\\tsyukudai-o\\ttetudat-te]-morat-ta. John-Top Mary-Dat/-Nom homework-Acc help-TE-receive-Past (lit.)J̀ohn received Mary's helping (his) homework.' (= John had Mary help with his homework.)\\t (Takezawa 1987:76)","Contrary to Takezawa's claim, there is evidence that the existence of the finite T is not relevant to ga-marking. Some subordinate clauses with the non-finite T permit a ga-marked subject as illustrated in (10). (11) provides a piece of evidence that the subordinate clauses such as nagaramo 'though' and temo 'even if' disallow the Tense morphemes -ru Tres' and -ta Past'.2","(10) a. [cp Zen syusyoo-ga\\taredake huhyoo-o\\tkai-nagaramo],","the former Prime Minister-Nom so much disrepute-Acc buy-though konkai-no senkyo-wa Zimintoo-ga assyoo sita. this election-Top,\\tthe LDP-Nom swept the board T̀he LDP swept the board in this election [cp though the former Prime Minister was blamed so much].'","b. [cp Ame-ga\\thut-temo], watasi-wa dekake-ru.","2 Kuroda observed the same point with sentences using nagara as in (i). (i) Titioya-ga keikan\\tde ari nagara, kare-wa tumi-o okasite-simat-ta. father-Nom policeman be though he-Top sin-Acc commit-PertPast T̀hough his father is a policeman, he committed a sin.' (9) 136","rain-Nom fall-even if I-Top\\tgo out-Pres Ì'll go out even if it rains.' (11) a. *[cp Zen syusyoo-ga aredake huhyoo-o"]},{"title":"kaw-rul-ta nagaramo],...","paragraphs":["b. *[cp Ame-ga"]},{"title":"hu-rul-ta-temo], \\t","paragraphs":["V-Pres/-Past-though V-Pres/-Past-even if (10) and (11) show that unlike English Nominative subjects, the ga-marked subjects are not dependent on the existence of the finite T. The crucial difference between Takezawa's (8a) and (8b)-(9a-b) is not whether the embedded clauses have a finite T or not, but whether or not they have a C-projection. The embedded clauses in (8b) and (9a-b) must be a vP with no higher projections, that is, neither a TP nor a CP, because they cannot take sentential adverbs such as"]},{"title":"saikin","paragraphs":["'recently'"]},{"title":"asu","paragraphs":["'tomorrow', and"]},{"title":"kinoo","paragraphs":["ỳesterday', as illustrated in (12) and (13). Contrary to (12a), the adverb"]},{"title":"saikin","paragraphs":["'recently' is not related to the embedded clauses in (12b) and (13a-b). This means that there is no finite T connected with the sentential adverb in these embedded clauses. The embedded clauses must be smaller than TP. (12) a."]},{"title":"Kinoo,","paragraphs":["John-ga [cp["]},{"title":"T","paragraphs":["p"]},{"title":"saikin","paragraphs":["["]},{"title":"T","paragraphs":["p[Mary-no yokogaoj-ga totemo utukusi-i ]] to]\\tomot-ta. yesterdayJohn-Nom recently Mary-Gen profile-Nomvery beautiful-Pres COMP think-Past Ỳesterday, John thought [Mary's profile was ((lit.) is) very beautiful recently]."]},{"title":"b.*Kinoo,","paragraphs":["John-ga"]},{"title":"[saikin","paragraphs":["["]},{"title":"1","paragraphs":["4) Mary-no yokogaol-o totemo utukusiku]] omot-ta. yesterday John-Nom mently Mary-Gen profile-Acc very\\tbeautiful think-Past (lit.)*Ỳesterday, John thought [Mary's profile very beautiful recently].' (13) a. *Kinoo,\\tJohn-ga ["]},{"title":"asu\\t[","paragraphs":["Mary-ni susi-o\\ttabe]]-sase-ta. yesterday John-Nom tommorow Mary-Dat susi-Acc eat-CAUSE-Past *̀yesterclay, John made [Mary eat susi tomorrow].'","b."]},{"title":"*Kinoo,\\t","paragraphs":["John-ga ["]},{"title":"saikin [Mary-ni","paragraphs":["syukudai-o\\ttetudat-te]-morat-ta. yesterday John-Nom recently Mary-Dat homework-Acc help-TE-receive-Past (11)*Ỳesterday, John received Mary's recent helping (his) homework.' (= *Yesterday, John had [Mary help with his homework recently].)","On the contrary, the subordinate clauses, given in (10) as counterexamples, permit the embedded interpretation of sentential adverbs, as shown in (14). (14) a. [cp Zen syusyoo-ga\\t"]},{"title":"saikin","paragraphs":["aredake huhyoo-o\\t"]},{"title":"kai-nagaramo],","paragraphs":["the former Prime Minister-Nom recently so much disrepute-Acc buy-though"]},{"title":"kinoo\\t","paragraphs":["Zimintoo-ga hutatabi senkyo-de\\tassyoosi-ta. yesterday , the LDP-Nom again in the election sweep the board-Past 'Yesterday, the LDP swept the board in the election again[cp though the former Prime Minister was recently blamed so much].'","b. [cp Ame-ga\\t"]},{"title":"konban hut-temo],","paragraphs":["watasi-wa"]},{"title":"asu\\t","paragraphs":["dekake-ru. rain-Nom tonight fall-even if I-Top\\ttomorrow go out-Pres","Ì'll go out tomorrow even if it rains tonight.' Furthermore, Takezawa (1987) claims that [+stative] predicates such as"]},{"title":"-hosi","paragraphs":["ẁant/prefer' do not assign accusative Case to the embedded subject. Instead,"]},{"title":"ga","paragraphs":["is assigned to it in situ from the matrix finite T (INFO as shown in (15). According to Takezawa, the adjective"]},{"title":"-hosi","paragraphs":["permits S'(=CP)- deletion optionally. If S'(=CP) deletes, then"]},{"title":"ga","paragraphs":["is assigned from the matrix finite T in the ECM fashion. (15) Watasi-wa\\t[s(=Ipptooto-ga\\tie-ni\\tkaet-te-ki-te]\\t"]},{"title":"hosi-i.","paragraphs":["I-Top\\tmy \"ther-Nom home-to back-TE-come-TEwarPres Ì want my brother to come back home.'","However, if we assume that C is relevant to ga-marking, such a deletion operation can be eliminated. That is,"]},{"title":"-hosi 'want'","paragraphs":["takes a CP-complement when the embedded subject is marked with"]},{"title":"ga.","paragraphs":["We can reach a unified account for ga-marking in Takezawa's grammatical contrast as in (8) and (9), subordinate clauses as in (10), and adjective-hosi ẁant/prefer' type complements as in (15). 137","To sum up so far, we claim that the availability of ga-marking does not depend on the finite T, but on the existence of C. (16)C, rather than finite T, is involved in ga-marking in Japanese.","Pushing the idea that C is involved in ga-marking, we should further develop our original and independent arguments for A'-status of Japanese ga-marked subjects. Next subsection discusses this point cross-linguistically. 2.4 Parallelism between the Preverbal and Postverbal Subject Constructions in","Greek/Catalan and the Ga-Kara 'Nom-from' Alternating Constructions in Japanese Alexiadou and Anagnostopoulou (1998) claim that in Greek/Catalan, the preverbal subjects show A'- status, whereas the postverbal subjects A-status. In this subsection, we observe that exactly the same is true with the ga-kara Ǹom-from' alternating constructions in Japanese. 2.4.1 Greek/Catalan: Alexiadou and Anagnostopoulou (1998) In Greek and Catalan, SVO and VSO word order are both possible, as shown in (17).","(17) a. 0 Petros pandreftike tin Ilektra. (SVO)\\t(Greek) Peter\\tmarried\\tIlektra P̀eter married Ilektra.'","b. pandreftike 0 Petros tin Ilektra. (VSO) married\\tPeter\\tIlektra P̀eter married Ilektra.' A & A (1998) argue for the A'-status of the preverbal subjects. First, the preverbal subject in Greek can precede sentential adverbs such as xtes 'yesterday', as given in (18) and complementizers such as an 'if', as in (19).","(18) 0 Petros xtes\\tmeta apo poles prospathies sinandise ti Maria. Peter yesterday after from many efforts \\tmet\\tMary Àfter many efforts, Peter met Mary yesterday.'","(19) a. Epid\\t0 Petros an erthi\\ti Maria tha figi because Peter\\tif comes Mary FUT leave B̀ecause if Mary comes, Peter will leave.' b. *Because Peter if Mary comes, will leave3","The second piece of evidence for the A'-status of the preverbal subjects comes from the bound variable interpretation of overt personal pronouns in Catalan. As given in (20), a bound variable reading is impossible in the preverbal position, but it is possible in the postverbal position (Barbosa 1995). They account for these facts on the basis of the assumption that the preverbal subjects occupy an A'-position. Thus, pronouns cannot be interpreted as bound variables.","(20)a. *Tots els setudeiantsi es pensen que ells; aprovaran. All the student\\tthink that they pass Àll the students think they will pass.'","b. Tots els jugadorsi estan convencus que guanyaran ells;. All the players are persuaded that win\\tthey Àll the players are persuaded that they are the ones who will win.'","The third piece of evidence is related to the issue of scope ambiguity in Greek. Greek quantificational elements in the preverbal subject position have unambiguous scope, whereas in the postverbal position the subject can have ambiguous scope: (21) a. SVO order: (some > every, *every > some) 3 A reviewer of Japanese/Korean linguistics pointed out that (19b) is perfect in English if there are a comma and a pose between Peter and if. However, we ignore the case with special poses and stresses in this paper. We leave the issues open to future studies. (A & A 1998: 494) 138 Kapios fititis\\tstihiothetise kathe arthro. some student filed\\tevery article T̀here is some student, who filed every article.'","b. VSO order: (some > every, every > some) stihiothetise kapios fititis\\tkathe arthro. filed\\tsome student every article T̀here is some student, who filed every article.' Èvery article was filed by a different student.' In (21a) kapios fititis 'some student' in the preverbal position necessarily has wide scope over the universal quantifier phrase kathe arthro 'every article' in object position. On the other hand, the postverbal subject in (21b) can have narrow or wide scope.","To summarize, the facts given above indicates that the preverbal subject position in Greek/Catalan has A'-status. (22a) and (22b) are the structures of the preverval and postverbal subject constructions in Greek and Catalan.4","(22) a. SVO order (the preverbal Subj. construction) [cp Subj•i\\tT +V [VP\\ttv Obj.","b. VSO order (the postverbal Subj. construction) [cp\\t[.rp\\tT +V [VP Subj.\\ttv Obj. ]]] 2.4.2 Japanese: Ga-Kara Wom-From' Alternation Japanese has a structure parallel to the Greek preverbal and postverbal subject alternation discussed above. Cho (1995), Inoue (1998, 2001), and Ito (2001) observe that a class of verbs, which has the -ga -ni -o Case pattern and a ni-phrase carrying the feature [+animate] and the sense of endpoint, permits the ga-kara Nom-from' alternation (ex. okur 'send', tutae 'report', sikar 'scold', iw 'say', hanas s̀peak', ageru g̀ive'). Inoue (1998) calls the sentences with postpositional subjects Disguised Subjectless Sentences (henceforth DSSs). Typical examples are given in (23).","(23) a. Anata-gal-kara Taroo-ni tegami-o\\tokut-te-kudasai. you-Nom/-from Taro-to\\ta letter-Acc send-TE-imperative P̀lease send a letter (from you).'","b. Anata-gal-kara\\tTaroo-o\\tsikat-te-kudasai. you-Nom/-from Taro-Acc\\tscold-TE-imperative P̀lease scold Taro.'","c. Watasi-gal-kara Taroo-ni sono zizitu-o tutae-te-oki-masu. I-Nom/-from\\tTaro-to the fact-Acc tell-TE-put-Pres Ì will tell the fact to Taro.'\\t (Ito 2001) The ga-kara pairs of sentences given in (23) are very similar to the preverbal and postverbal subject constructions observed in Greek and Catalan.","First, the alternating subjects are placed in syntactically different positions. One is a vP-internal position. The other is outside vP. Unfortunately, the point with respect to word order restrictions given in (18) and (19) in Greek cannot be reproduced for Japanese, because Japanese is one of the head-final languages. However, contrary to the ga-marked subject, it is demonstrated that the kara-marked subject is in the vP-internal subject position by the causativization test. In Japanese, -ga '- Nom' cannot occur in the embedded clause in causative constructions. It has to be replaced with an embedded subject marker -ni 'NI', as illustrated in (24).","4 With respect to the EPP-satisfaction of T, A&A (1998) propose the EPP parameter as in (i). (i) The EPP parameter","In Null Subject Languages (NSLs), it is parameterized as to whether the EPP-feature in T can be satisfied","with a head X°.","Greek and Catalan take a value such that the EPP-feature in T is satisfied with X° via V-raising. 139","(24)a. John-ga\\tringo-o\\ttabe-ta. John-Nom apple-Acc eat-Past J̀ohn ate an apple.'","b. Mary-ga [John-*gaPK-ni ringo-o tabej-sase-ta. Mary-Nom John-Nom/-Dat apple-Ace eat-CAUS-Past M̀ary made John eat an apple.' As I mentioned above, it is not a sentential adverb, but a VP adverb that the embedded clause in (24b) can take, as illustrated in (25).","(25)a. VP adverb Mary-ga ["]},{"title":"gatugatu to","paragraphs":["John-ni\\tringo-o tabe]-sase-ta. Mary-Nom hungrily John-Dat apple-Acc eat-CAUS-Past 'Mary made John eat an apple hungrily.'","b. sentential adverb","* Mary-ga ["]},{"title":"saiwai\\t","paragraphs":["John-ni ringo-o tabe]-sase-ta. Mary-Nom fortunately John-Dat apple-Ace eat-CAUS-Past","*Wary made [John eat an apple fortunately].' (only a matrix reading) (25) shows that the size of the embedded clause is smaller than TP, that is, vP. Next consider (26), where one of the DSS verbs,"]},{"title":"setumei-s","paragraphs":["'explain-do', is the head of the complement vP of"]},{"title":"-sase","paragraphs":["C̀AUS'. (26) Troo-ga [Dssvp watasi-ni kanozyo no byoozyoo-o"]},{"title":"setumei-s]-(s)ase-ta.","paragraphs":["Taro-Nom\\tI-NI\\ther condition-Acc\\texplain-do-CAUS-Past. T̀aro made me explain her condition (to someone).' However, once the goal ni-phrase of"]},{"title":"setumei-s","paragraphs":["'explain' is phonetically realized in the embedded clause, ni-subject is avoided and should be replaced with kara-subject: (27) a.??Troo-wa [Dssvp watasi-ni"]},{"title":"Mary-ni","paragraphs":["kanozyo no byoozyoo-o setumei-s]-(s)ase-ta. Taro-Top\\tI-NI\\tMary-to her condition-Acc\\texplain-do-CAUS-Past. T̀aro made me explain her; condition to Marys.'","b. Troo-wa [ watasi-kara"]},{"title":"Mary-ni","paragraphs":["kanozyo no byoozyoo-o setumei-s]-(s)ase-ta. Taro-Top I-from\\tMary-to her condition-Acc\\texplain-do-CAUS-Past. T̀aro made me explain hers condition to Marys.' (27) indicates that the embedded subject marker"]},{"title":"ni","paragraphs":["'NI' can alternate with"]},{"title":"kara","paragraphs":["'from' within the vP embedded clause. Furthermore, (28) shows that the kara-subject allows only VP adverbs on a par with ni-subject observed in (25).","(28)a. VP adverb Troo-wa"]},{"title":"[yukkurito","paragraphs":["watasi-kara Mary-ni kanozyo no byoozyoo-o setumei-s]-(s)ase-ta. Taro-Top deliberately I-from\\tMary-to her condition-Acc\\texplain-do-CAUS-Past. 'Taro made [me explain hers condition to Marys deliberately]:","b. sentential adverb","*Troo-wa"]},{"title":"[saiwaini","paragraphs":["watasi-kara Mary-ni kanozyo no byoozyoo-o setumei-s]-(s)ase-ta. Taro-Top fortunately I-from\\tMary-to her condition-Acc\\texplain-do-CAUS-Past. T̀aro made [me explain hers condition to Marys fortunately].' (only a matrix reading) It follows that the kara-subjects are generated as a vP-internal argument subject, unlike the ga-marked subjects. This is parallel to the Greek non-inverted subject constructions. Namely, the subject in VSO order in Greek corresponds to the DSS kara-subject.","Second, the same contrast with respect to variable binding observed in Catalan, mentioned in (20), can be found between the ga-marked subject and the DSS kara-subject in Japanese, as illustrated in (29). In (20), the bound variable interpretation with overt personal pronouns is impossible in preverbal position, but it is possible in postverbal position.","(29) a.*Daremorga [ karerai-ga Taroo-o sikar-u to] it-ta. everyone-Nom they-Nom Taro-Acc scold-Pres Comp say-Past *Tveryonei said that theyi will scold Taro.' 140","b. Daremoi-ga [ karerai-kara Taroo-o sikar-u\\tto] it-ta. everyone-Nom they-from Taro-Acc scold-Pres Comp say-Past Tveryonei said that theyi will scold Taro.'","Finally, in Greek, quantificational elements in the preverbal subject position have unambiguous scope, whereas in the postverbal position the subject can have ambiguous scope. In (21a), kapios fititis 'some student' in preverbal position has necessarily wide scope over the universal quantifier phrase kathe arthro 'every article' in object position. On the other hand, the postverbal subject in (21b) can have both narrow and wide scopes.","What is remarkable is that exactly the same contrast between the two subject positions in Greek can be observed in Japanese as a contrast between the ga-marked subject and the DSS kara-subject:","(30)a. ga-subject: (some > every, *every > some) Dareka-ga\\tdono tegami-mo okut-te-oi-te-kudasai. someone-Nom every letter\\tsend-TE-put-TE-imperative 'I hope that there is someone who sends every letter.' *1 hope that each letter is sent by someone.'","b. kara-subject: (some > every, every > some) Dareka-kara\\tdono tegami-mo okut-te-oi-te-kudasai. someone-from every letter\\tsend-TE-put-TE-imperative 'I hope that there is someone who sends every letter.' Ì hope that each letter is sent by someone.'","We have observed that Japanese sentences with the ga-kara alternating constructions parallel syntactically the preverbal and postverbal subject constructions in Greek and Catalan. It follows that like Greek and Catalan, these contrasts between the ga-subject and the kara-subject are reduced to the idea that the two subjects are placed in different syntactic positions. The kara-subject is placed in a vP-internal position and has A-properties, whereas the ga-subject is in a position higher than [Spec, TP], namely, in the CP-layer, and has A'-properties.5 3\\tProposals: Scope Interpretation Assuming the difference in subject positions, we propose that Watanabe's (1998, 2000) F quant","-movement in overt syntax is reducible to Chomsky's (2000, 2001) Agree. We call this operation F rmatching. Following Watanabe (1998, 2000), we assume that if the Nuant-matching operation is executed in narrow syntax, then this creates inverse scope reading at LF. As far as feature-matching is one of the legitimate operations in narrow syntax, it follows that its application is restricted by the syntactic unit phases and that it is subject to the PIC. We call the new scope system a phase-based approach. The phase-based approach eliminates a parameter with respect to the language variation of the availability of QR or the location of strong feature. Different scope phenomena between languages follow from a more general apparatus for sentence building, namely, match and the PIC. 3.1 Assumptions Before demonstrating our new scope mechanism, we summarize our assumptions. First, we crucially use Chomsky's (2001) Derivation by Phase version of PIC:","(31) The Phase Impenetrability Condition The domain of H is not accessible to operation at ZP, but only Hand its edge.","[zp Z [Hp [ H\\t] I (where ZP and HP are strong phases) (Chomsky 2001) 5 As for unavailability of the [Spec, TP] position in Japanese, Ueda (2002) discusses it in terms of the idea that Japanese is one of the non-agreement forced languages in the sense of Kuroda (1998). Ueda attempts to restate Kuroda's insight as the 4:o-defectiveness of Japanese T in Chomsky's (2000 and 2001) framework. The crucial mechanism is as follows: 4)-features would allow T to be activated, but Japanese T has a null set of 0-features. Thus, Japanese T can neither enter into an Agree-relation nor have the EPP feature. That is why Japanese [Spec, TP] is unavailable for Nominative subjects. Case-feature of subject NPs must wait for the next probe, that is, C. 141 The PIC is a syntactic condition, which restricts the size of 'working space' of syntactic operations and the timing of Spell-Out. (31) means that YP, which is a complement of a phase HP, cannot be accessible to operation at the next higher phase ZP, because the complement YP is spelled-out after the head Z is merged, projecting the next phase ZP. (32) is a schematic structure of the visible domain at ZP-phase level. (32) The"]},{"title":"boxed portions indicate","paragraphs":["the visible domain at ZP-phase","Z .\\tYP]",". edge head","strong phase strong phase Furthermore, we introduce a new notion deactivated NPs, given in (33), and assume (34) with respect to the timing of the application of the matching operation. (33)Deactivated NPs are NPs all of whose uninterpretable features are marked for deletion. (34) The Nm-matching operation applies to deactivated NPs. Given (31)-(34), it is demonstrated that mysterious scope takings in declaratives and ditransitives in both English and Japanese are appropriately reducible to the phase-based scope system. The typical scopal contrast between the two languages given in (35) is accounted for in the following way.","(35) a. English: ambiguous\\t(some > every, every > some) Someone loves everyone. b. Japanese: unambiguous (some > every, *every > some) Dareka-ga daremo-o aisitei-m. C [Tpl Subj."]},{"title":"T","paragraphs":["fop v* [vp Obj.","1\\t1 °Kflquant-matching\\t strong phase I[VP\\tQ]iv*P *F „t-matching (35a) and (35b) are the schematic structures of (36a) and (36b) respectively. Assuming the notion of deactivated NPs, given in (33) and the research results in Section 2, English subject QP becomes a deactivated NP when its uninterpretable Case-feature is marked for deletion by T. Thus, English subject QP can be a probe for Fquant-matching at the completion of TP. Therefore, in English, the Obj. QP is visible from the Subj. QP in [Spec, TP], because TP is not a strong phase and the complement of v*P, namely, VP, is not spelled-out yet. The boxed portion is the visible domain of a relevant Numprobe, namely, the Subj.QP in (36a). As the result, Nuan t-matching is possible between the Subj. QP and the Obj. QP in English, resulting in the inverse scope at LF. Thus, (35a) is two-way-ambiguous at LF. One is the wide scope reading of the existential quantifier someone in the canonical order. The other is the inverse scope reading via Fquaut-matching, that is, the universal quantifier everyone takes scope over the existential quantifier someone. On the other hand, as discussed in Section 2, C, rather than T is involved in ga-marking in Japanese. That is, Japanese ga-marked subjects can be a deactivated NP at the completion of CP. When C merges with TP, the complement of the lower strong phase v*P, namely, VP is spelled-out and the Obj. QP is invisible from the subj. QP in CP-layer. Num-matching is impossible. Thus, Japanese shows the fixed scope in canonical order.","Furthermore, scope facts in Catalan given in (21) can be also reducible to our phase-based scope system. The schematic structures of (21a) and (21b) are given in (37). (37) Catalan (= (21))"]},{"title":"a.SVO: unambiguous","paragraphs":["[cP"]},{"title":"ISubj i C\\tT + Vi [op tt","paragraphs":["v [vp"]},{"title":"*Fquaurmatching","paragraphs":["(36) a. English: [cp I\\t7\\t] b. Japanese: [cp"]},{"title":"1S'ubj.","paragraphs":["strong phase 142","(38) Japanese (= (31)) a. ga-Sub'.: unamb . ous Obj. MEI] b. kara-Subj : ambiguous","En, [yip kara-Subj.ryr\\tv* I1 T] C]6 'Fquant-matchinp [CP b. OSV: ambiguous [cp\\tC [T? T +\\t[v* { Subj. j. v [vp ti\\th]ii OKNua„, matching I In SVO order, the Obj. QP in v*P phase is invisible from the preverbal Subj. QP in CP phase, whereas in VSO order, the postverbal Subj. QP is in the domain of the same phase as the Obj. QP, namely, v*P. Thus, Fquant-matching is possible, resulting in scope ambiguity. (38) shows that the same is true of the scope facts in ga-kara alternating constructions in Japanese. 4\\tMysterious Scope Taking in Double Object Constructions This section discusses DOCs, whose scopal behaviors have been shrouded in mystery in the history of scope studies. It is shown that the phase-based approach sheds new light on this mystery. On the basis of a series of studies of Hale and Keyser (2002) and Takezawa (2000), we provide the threelayered vP structure (39) for DOCs in English and a class of ditransitive constructions in Japanese. In (39), v3 projects an external argument for the subject NP, which is the same as a normal transitiviser in transitive clauses. A remaining v*P1 guarantees the possessor relation between IO and DO in a sense of Hale and Keyser (2002) and Takezawa (2000). Furthermore, we propose that not only the subject NP, but also the IO moves from [Spec, v*P1] to [Spec, v*P2], because only the IO in DOCs allows quantifier stranding on a par with subject NP, as shown in (40). We assume that the IO gets a new theta-role, [+affected] , in [Spec, v*P2], because the I0 is subject to the animacy condition in both English and Japanese. (39) [cp C\\tSubj•; [v.p3 tj v3 [v*p2 IO; v2 [,,vi\\tvl [vp V DO +\\tI","(40)a. The students [vP [ alli\\tpassed the exam.] b. *John passed examsi [ alli ti c. John gave students; [alli ] apples. Given the structure (39), the mysterious scope facts in both English and Japanese given in (41), (42), and (43), are also naturally accounted for under our phase-based approach without any other stipulative conditions.","(41)Scope fixing between IO and DO: The IO always takes scope over the DO in both English and Japanese. a. John gave someone everything. (JO > DO, *DO > IO)","IO\\tDO b. John-ga dareka-ni dono hon mo age-ta. (10 >DO, *DO >10)","John-Nom someone NI every book give-Past","(42) Asymmetrical scope taking: The DO cannot take scope over the subject, but the IO can in English. a. Someone gave everyone his report card. (Subj > 10, IO > Subj) 6 We assume that Case-feature of the kara-subject NP is vP-internally licensed by the postposition kara 'from'. Therefore, the kara-subject can be a deactivated NP in the position within vP-layer. 143 EDI EA] am","Subj\\tIO b. Someone gave Bill"]},{"title":"everything.","paragraphs":["(Subj >DO, *DO > Subj) Subj\\tDO(Hornstein (1995):178)","(43)"]},{"title":"No contrast with respect to scope-taking between Subject-I0 and Subject-DO in Japanese a. Dareka-ga\\tdaremo-ni\\t","paragraphs":["hon-o\\tage-ta. (Subj > JO, *I0 > Subj) someone-Nom everyone-NI book-Acc give-Past T̀here is someone, who gave a book to everyone.'"]},{"title":"b. Dareka-ga","paragraphs":["Taroo-ni"]},{"title":"doremo-o\\tage-ta.\\t","paragraphs":["(Subj > DO, *DO > Subj) someone-Nom Taro-NI everything-Ace give-Past T̀here is someone, who gave everything to Taro.' Asymmetrical scope between the JO and the DO in both English and Japanese given in (41) can be predictable from the schematic structure (44)(= (39)). The complement of vl, namely, VP, is spelled out when v2 merges with v*P1 and thus, the DO is not visible from the IO position. Therefore Fquatir matching is impossible between the IO and the DO in both English and Japanese.","(44) [cp C [Tp Subj.j [v*P3 tj v3 {v.p21 I0i v2 [v*pl ti vl l[vp V DO]]]]]]] *Fquant-matching","The contrast between English (41a) and Japanese (42a) is attributed to the difference in subject positions in those languages discussed above. As shown in (45a) and (46a), the IO is visible from the English subject in [Spec, TP], because [Spec, v*P2] is an edge and is not spelled-out yet at the v*P3-phase level, whereas it is invisible from the Japanese ga-marked subject in CP-layer. That is why only English permits ambiguous reading between the subject QP and the JO.","As for the scope interaction between subject QP and DO, the DOs in both English and Japanese are too far from the subject positions. Thus, neither English nor Japanese allows F t-matching, resulting in unambiguous reading.","(45) English: structure immediate! after the subject NP merges with TP (T') a. [ .firalkilliffelfairMa opi ti vl [vp V DO ]]]]]","I i. [I•N vl {vp V"]},{"title":"TX) Mil","paragraphs":["e b.","(46) Japanese a.[c"]},{"title":".6Y01111111M11","paragraphs":["[v*P2 10i [v*P1 ti [VP DOED *Fg.rmatching *Fquant-matching","b. ifirrNIMIENII[v.p2 IOi [opt ti [vprO *F .t-matching"]},{"title":"Ph","paragraphs":["arm"]},{"title":"Lti","paragraphs":["5\\tConclusion In this paper, it has been shown that unlike English Nominative subjects, ga-marked subjects are placed in the CP-layer with A'-properties. We observed that the ga-marked subjects and kara-marked subjects syntactically parallel those of the inverted and non-inverted subjects in Greek and Catalan.","Based on the assumption of different subject positions, we proposed a new scope calculation system called the phase-based approach. In our system the operation to create binary-absorbed quantifiers is reducible to a syntactic operation Agree. We called this operation Fq rmatching. This matching operation creates the inverse scope reading. We have demonstrated that our new scope system can give a unified account for various mysterious scope phenomena in several languages. Given our phase-based approach to scope calculation, scope interpretation can be derivationally determined in narrow syntax at every strong phase as far as Chomsky's (2001) PIC permits. That is, the derivation in narrow syntax directly feeds the interpretation. Furthermore, if this approach is on the right track, the adequacy of the existence of phases as a syntactic unit as well as the relevance of the PIC in Chomsky's Derivation by Phase is also demonstrated by the results of our research. 144 Acknowledgements This paper is a revised version of a part of my Ph.D dissertation submitted, in partial fulfillment of the requirements for the degree of Doctor of Philosophy to Graduate School of Language Sciences at Kanda University of International Studies.","I am grateful to Sandiway Fong, Kazuma Fujimaki, Shosuke Haraguchi, Nobuko Hasegawa, Hiroto Hoshi, Kazuko Inoue, Taketo Ito, Hideki Maki, Roger Martin, Shigeru Miyagawa, Tomohiro Miyake, Edson T. Miyamoto, Masatake Muraki, Masao Ochi, Naoko Okura, Masaki Sano, Hiroaki Tada, Koichi Takezawa, Keiko Watanuki, and Masashi Yamada for their invaluable comments and extensive discussion. The research reported here was supported in part by Japan Society for the Promotion of Science and by International Foundation for the Promotion of Languages and Culture. References","Alexiadou, Artemis, and Elena Anagnostopoulou. 1998. Parameterizing AGR: Word Order, V-Movement, and EPP-Checking. Natural Language and Linguistic Theory 16: 491-539.","Barbosa, Pillar. 1995. Null Subjects. Doctoral dissertation, MIT.","Chomsky, Noam. 2000. Minimalist Inquiries: the Framework, in R. Martin, D. Michael, and J. Uriagereka, eds., Step by step: Essays on Minimalist Syntax in Honor of Howard Lasnik. 89-115. Cambridge, Mass.: MIT Press.","Chomsky, Noam. 2001. Derivation by Phase, in M. Kenstowicz, ed., Ken Hale: A Life in Language. 1-52. Cambridge, Mass.: MIT Press.","Fukui, Naoki. 1984. Studies on Japanese Anaphora I: the Adjunct Subject Hypothesis and Z̀ibun'. Ms., MIT, Cambridge, Mass.","Fukui, Naoki. 1986. A Theory of Category Projection and its Applications. Doctoral dissertation, MIT, Cambridge, Mass.","Hale, Ken and Jay Keyser. 2002. On the Double-Object Construction, in Linguistic Inquiry Monographs 39: Prolegomenon to a Theory of Argument Structure. 159-188. Cambridge, Mass.: MIT Press.","Hornstein, Norbert. 1995. Logical Form. Cambridge, Mass.: Blackwell.","Inoue, Kazuko. 1998. Sentences without Nominative Subjects in Japanese, in K. Inoue, ed., Grant-in-Aid for COE Research, Report (2A) Researching and Verifying an Advanced Theory of Human Language: Explanation of the Human Faculty for Constructing and Computing Sentences on the Basis of Lexical Conceptual Features. 1-34. Kanda University of International Studies.","Inoue, Kazuko. 2001. Noodoobun, Zyudoobun, Nizyuumokutekigo-koobun to ' Kara' -Kaku, in N. Hasegawa and K. Inoue, eds., Scientific Approaches to Language 1: 49-76. Center for Language Sciences, Kanda University of International Studies.","Ito, Taketo. 2001. Syugomeishiku niokeru Ga-Kaku to Kara-Kaku no Kootai nituite. Meikai Nihongo 6: 45-63. Meikai University.","Pollock, Jean-Yves. 1989. Verb Movement, Universal Grammar, and the Structure of IP. Linguistic Inquiry 20: 365-424.","Sportiche, Dominique. 1988. A Theory of Floating Quantifiers and its Corollaries for Constituent Structure. Linguistic Inquiry 19: 425-449.","Takezawa, Koichi. 1987. A Configurational Approach to Case-Marking in Japanese. Doctoral dissertation, University of Washington.","Ueda, Yukiko. 2002. Subject Positions, Ditransitives, and Scope in Minimalist Syntax: A Phase-Based Approach. Doctoral dissertation, Kanda University of International Studies.","Ueda, Yukiko. 2003. FQ subjects and Scope. Ms., Meiji Gakuin University.","Watanabe, Akira. 1998. Absorption: Interpretability and Feature Strength. Ms., University of Tokyo. [A revised version in K.Inoue, ed., Grant-in-Aid for COE Research, Report (4A) Researching and Verifying an Advanced Theory of Human Language: Explanation of the Human Faculty for Constructing and Computing Sentences on the Basis of Lexical Conceptual Features, 253-296. Kanda University of International Studies, 2000.] 145"]}]}