{"sections":[{"title":"Mandarin Adverbial Jiu In Discourse*","paragraphs":["Fuhui Hsieh Graduate Institute of Linguistics National Taiwan University hsiehfh@rns64.hinet.net 1.0. Introduction I was motivated to conduct this study by an almost omnipresent, multi-functional, and sometimes semantically illusive marker jiu in verbal interactions. Almost all the linguists who study jiu put jiu and cai together and investigate the contrastive semantic meanings, pragmatic functions and conversational implicatures of these two markers in contrastive perspective. But such a comparative study cannot help us understand the behavior of jiu in conversations. If we pay a little attention to the daily conversations around, we may get an impression that the frequency of the occurrence of jiu is much higher than that of cai. In Liu's (1993) study, the total number of occurrences of jiu in her 255-minute spoken corpus is 291, whereas that of cai is only 29. 1 I do not intend to argue against their theoretical approaches; to the contrary, their detailed and theoretically consistent accounts of these two markers provide me with a solid base to investigate the behavior of jiu in our verbal interactions. 2.0. Literature Review Biq (1984) and (1988) are the most detailed studies on identifying adverbial functions of jiu and cai. She exemplifies a well-organized study that is carefully defined along the lines of modem linguistic theories. She consistently identifies and distinguishes the different usages in terms of one descriptive parameter (i.e. the scope of focus), and contrasts the two markers with one explanatory principle (i.e. scalar implicature based on Gricean maxims). She categorizes the various occurrences of jiu and cai into four types of usage: parametric usage, limiting usage, emphatic usage, temporal usage. In each usage, jiu and cai place a different type of focus on some element involved in speech. Cai/jiu can have four different kinds of focus: (1) temporal setting of the narrated event. (2) parametric: the circumstances determining the actuation of the event; (3) the emphatic: the event itself; (4) limiting: some element internal to the event. And cai/jiu are distinguished from each other by the implicatures they carry. In addition to further exploring the adverbial functions of jiu and cai in spoken discourse, Liu's study also extends the grarnmaticalization processes of the two markers, including the * I wish to thank Prof. Shuanfan Huang and two anonymous reviewers for their useful comments and suggestions. Needless to say, all the errors and inadequacies remaining in this paper are my own. There are only 37 cai in my 135-minute spoken corpus. All my data come from the Mandarin Spoken Corpus by NTU; for a detailed description of the texts I chose for this study, please see the Appendix. 182 source, pathways, and endpoint functionality. 3.0. The Database"]},{"title":"3.1. Comparison","paragraphs":["of"]},{"title":"Liu's and Hsieh's database","paragraphs":["Table 1. Comparison of Liu's and Hsieh's database. Liu's Hsieh's Texts 5 15 Durations 255 mins 135 mins The number of occurrences of JTU 291 6672 The number of JIU per minutes 1.14 4.94 From the table above, we can see that the number of occurrences"]},{"title":"of jiu","paragraphs":["is much higher in the present data, about five times as many as those in Liu's data. In average, Mandarin speakers utters five tokens of"]},{"title":"jiu","paragraphs":["per minute. And I follow Liu's study and categorize"]},{"title":"jiu","paragraphs":["according to the function and summarize the distribution in Table 2. Before that, I give a brief description of the categorization"]},{"title":"of jiu. 3.2. The categorization","paragraphs":["of jiu"]},{"title":"3.2.1. As a linking element","paragraphs":["According to Liu (1993), there are main functions of jiu: as a linking element and as a limiting element. As a linking element,"]},{"title":"jiu","paragraphs":["relates two propositions in an antecedent-consequent relation and always occurs with the consequent clause, as in A,"]},{"title":"jiu","paragraphs":["B (A and B are two different propositions). Without making further sub-categorization here, Liu recognizes the dependency of A-C can be of any semantic type, but that the jiu-marked consequent proposition clauses are directly resultative of the antecedent. As the following examples reveal, however, not all jiu-marked propositions in such relations are a consequence of the event indicated in the antecedent clauses. Based on the data I have, I therefore sub-categorize such an A-C linking usage into three types: LCONDITIONAL. In this usage,"]},{"title":"jiu","paragraphs":["usually cooccurs with the following phrases:"]},{"title":"zhiyau...jiu \"R","paragraphs":["-"]},{"title":"5...a\"; yaushi ...jiu \"5\\t","paragraphs":["ruguo ...jiu \"prm...-a\";"]},{"title":"na(...)jiu.","paragraphs":["iirs(• • •)-a\","]},{"title":"(na/ruguo)dehua.","paragraphs":["fiu \"(NIABV)115-1.. .g\" ;"]},{"title":"buran. fiu","paragraphs":["\"T ...a\". For example:"]},{"title":"(1)\\t","paragraphs":["Basketball 103"]},{"title":"B:..zhiyau you henduo ren","paragraphs":["R-gz44(faA 104"]},{"title":"jiu keyi cangdau","paragraphs":["\"As long as we have lots of persons, we can get (the basketball field).\" 2.CONSEQUENTIAL: In this usage, jiu marks the consequent clause as a consequence of 2 hi my data, I did not take into account the use of jiu in the phrase offiushishuo, which is routinized as a discourse marker. 183 the event indexed by the antecedent clauses, and usually co-occurs with the following phrases: yinwei...jiu"]},{"title":"\"M...a\";fieguo...jiu \"ei...a\";","paragraphs":["(suoyi/na)...jiu (/uede/xing) (shuo) \" ( pfitv#13) ...a ("]},{"title":"*WE ) ( ) \";","paragraphs":["suoyi...jiu"]},{"title":"\"ffij.),...-sr.","paragraphs":["For example: (2) Basketball 410 .. suoyi wo ye jiu yizhi da"]},{"title":"pfiwRtst–ittIT","paragraphs":["411 .. ranhou pingchangjiu yizhi tiau"]},{"title":"mfA').41-t–a.ot","paragraphs":["412 .. yizhi tiau","----nt -- 413 ..jiu bian gau le\\","atwx-r\\","\"(At the beginning of this semester, everyone was playing the basketball;) therefore, I also","started playing the basketball. And in usual time with nothing to do, I just jumped and jumped;","as a result, I became taller.\" 3.SEQENTIAL: In this usage, jiu marks the temporal sequence of two propositions, as in A, then jiu B. It usually co-occurs with such phrases as houlai...jiu \"fA*....-,51\"; ranhou...jiu\".M...a\"; na...jiu"]},{"title":"IN ...a\".","paragraphs":["For example:","(3) Basketball 200 B: ..ranhou MfA 201 ..zhau ren yihou"]},{"title":"1-1AUtA --->","paragraphs":["202"]},{"title":"..jiu","paragraphs":["you ji qingchu shi shei"]},{"title":"-4tii-EM3VAS","paragraphs":["\"Then, after you've found someone, you have to remember who you did find.\" 3.2.2. As"]},{"title":"a temporal linking element","paragraphs":["When jiu is used as a temporal linking element, it relates an event/state to a temporal frame, be it a temporal phrase or a temporal clause. The essential function of jiu is to assert a direct, or immediate relation between an event/state and a temporal reference point, by signaling an extremely short interval. It implies a time span between a temporal reference point and the event/state, and excludes all but the beginning of the span. jiu as a temporal linking function to mark \"immediate future\" (Biq 1988: 83) the event is described relative to","the speech act time or to some assumed nominative reference point. For example:","(4) Match 408: na-mo zau jiu kai-shi zuo-mei","NI 7. -T-Miii/FR","\"(You) started making matches at that early age.\" 3.2.3. As"]},{"title":"a limiting element","paragraphs":["(flu can also be used as a sentential particle to limit, usually in an emphatic manner, the referential or predicational scope of a subsequent constituent. As a limiting element, jiu does not indicate relations across two propositional entities; instead, it is relevant only to one following constituent. The limiting jiu is usually considered to be 'emphatic' (Biq 1988. Li & Thompson 1981), and Liu (1993) attributes such emphatic reading to its scope limiting character: highlight a selected member out of a general set. For example: 184 (5) MCON3 124:"]},{"title":"wo fiu","paragraphs":["xi-huan yun-dong"]},{"title":"MIA-WEE","paragraphs":["\"I like nothing but sports.\"","(6) Match\\t116: ta jiu jiau ke-yi tai yi-dian","ft1:- \"What he can do is just lifting his leg a little bit.\""]},{"title":"3.2.4 As a concessive conditional marker","paragraphs":["In this usage,fiu always combines with either shi 'be' or suan 'count' as in --ax"]},{"title":"I itA.","paragraphs":["Such a usage is rare in our data; I found only two examples: (7) Homo 134 A:.. na suoyi"]},{"title":"ni fiusuan","paragraphs":["zhenzheng you"]},{"title":"#13PRWIMXAEg","paragraphs":["135\\t..ni dagai ye buhui tai ganjue dau"]},{"title":"fiFtVitT tStY11","paragraphs":["\"Therefore, even if you do have (that kind of propensity), you probably wouldn't be aware of it.\"","(8) MCON1 445 ..na zue zhuyau shi yinwei zheli feng da"]},{"title":"AIWA -K;","paragraphs":["446 ..ranhou women zheli shi di de"]},{"title":"ATARIMIliflrfg","paragraphs":["̂447 ..fiushi women gang sau-guo"]},{"title":"grAafrININA","paragraphs":["448 ..keshi"]},{"title":"TirA","paragraphs":["449 ..ta yi cue","SP—rIX 450 ..ye cue dau \"The most important is that the"]},{"title":"wind","paragraphs":["here is rather high and then (the ground) here is low;"]},{"title":"even if we just finish sweeping, the wind will still blow the dirt (and the trash) here.\"","paragraphs":["3.2.5. hiu in prepositional phrases"]},{"title":"Another use","paragraphs":["ofjiu"]},{"title":"is the occurrence","paragraphs":["ofjiu"]},{"title":"in a prepositional phrase, as in the phrases of","paragraphs":["jiu...reyian / jiu...cengmian\\t"]},{"title":"El\", in which jiu introduces the topical frame for the following proposition. For example:","paragraphs":["(9) Assig","\\t 318 .. ta ciji you dingwei"]},{"title":"EPZR.","paragraphs":["319 ..ranhou zai xuexiau • 320"]},{"title":"..fiu zemo","paragraphs":["ativ 321 ..zemo • 322 ..zemo gen tongxue hudong de cengmian 323 „flu dau nali","glYr_Wel","\"She has located herself in a clear position. With regard to the relationship between classmates in school, she would never exceed the assumed relation.\" 185","3.2.6. The identificational use In her thesis, Liu also discusses the identificational use of:flu, as infiushi 111\",jiushuo or the reduced form jiu, which she views as a convergence of its linking and limiting functions. In this usageflushi or jiu functions as an equating or identificational marker that attaches a preceding NP with a structurally parallel NP or relative type of clause. Though she gives examples to illustrate the usage, she does not indicate the number of occurrences in her distribution table (Liu 1993:81&138). Following are Liu's examples (p.138): (10) ta shoo ta jihu dou meiyou shenmo tiezhe le","AfatAtiVAT*614E"]},{"title":"fiti","paragraphs":["l"]},{"title":"t WT","paragraphs":["jiushi pin-xue pin de hen yanzhong. glEkrairnaf4fitEW","\"She said she barely has any iron (in her blood); in other words, she has serious anaemia.\"","(11) tong-sheng-nan, ta hai keyi la,","Tong Sheng Nan fthaTictkik","Jiushuo ta men-zhe tou zuo la, ren man quianxu de.",","]},{"title":"1,1114Mi","paragraphs":["l"]},{"title":"k\\tman","paragraphs":["t, \"Tong Sheng Na is alright; that is, he is hardworking and modest.\" From the examples, we can clearly see that the two tokens of jiu here are more like paraphrasing than identificational usage. Furthermore, the use of jiushuo as an identificational (or paraphrasing) marker does not occur in my data. 4.0 Results and Findings","Table 2 summarizes a comparison of the distribution of jiu in Liu's and Hsieh's results.","Table 2. The distribution of jiu in Liu's and Hsieh's database","Liu's Hsieh's","Linking A-C linking 114 324","45 Consequential","Linking103 Conditional","176 Sequential.","TemporalTemporal linking 47 23","Limiting 122 158 Scope-limiting","ConcessiveConcessive 6 2","Prepositional 0 1 Prepositional","Verbal 2 0 Verbal 159 Identificational usage","Total 291 667 Total","**\\t79 **AR' What calls my attention is the obviously outnumbering of the linking usage, identificational usage and the limiting usage of jiu. I will give a detailed account of each usage in my data in the following sections. 4.1 The linking usage ofjiu What strikes me more is that when I was analyzing the data, some of linking jius were 3 Since jiushishuo has been routinized as a discourse marker, I did not take into account such usage in my data. 186 so devoid in the semantic content and so illusive in its pragmatic function that it was sometimes a rather difficult task to identify its categorization, especially those combined with","temporal connectives ranhou and houlai. For example:","(12) MCON3 174: Y:..dongjun-yan xianzai zai gau na-ge daxuefa","MS! IfAr±1̂±105ilfflt*8:","175...ranhou ta fiu shuo"]},{"title":"taftint","paragraphs":["176..ta jiu shuo women xi tai baushou le"]},{"title":"fttt-Maill*taci=7*","paragraphs":["177 ..dou meiyou dau"]},{"title":"ORA*Y1","paragraphs":["178... (1.1)ta jiu zai na-bian"]},{"title":"ftgit#54","paragraphs":["179..ho ta xianzai hau-xiang mingjindang oh","it3NAANIXIES \"Dong Jun-yen now is making the college bill; and then he said...He said our department was too conservative and (none of the faculty) attended the meeting. He was just there....0h, he is rather like a member of Mingjindang.\" (13) fami\\t258 ..zhenghau you qu bang woba mai yige dianzi"]},{"title":"EAT t- Agfit&N--1NV-T-","paragraphs":["259 ..pa ta","infft 260 ..zaushang ta hua-yi-jiau"]},{"title":"V-__EfV6--15Z","paragraphs":["261 B:.oh 262 A:. ranhou"]},{"title":"\\t","paragraphs":["-\\̂t263 uwo jiu shuo"]},{"title":"IASIR","paragraphs":["264 _women jia yifin jiudian le","afrmEHAPAT 265 ..jiu-dianban le","AN4T-T •","A: \"(No, that was because)"]},{"title":"we","paragraphs":["were going to buy a mat for my father; he slipped and fell down that morning.\" B: \"Oh.\" A: \" Then, I said. It was nine o'clock when we were leaving"]},{"title":"our home; nine-thirty.\" Many scholars who study connectives have found that connectives in discourse often lose their semantic content in conjoining two propositions but are used as discourse markers (Schiffirn 1985; 1986; 1992) or verbal fillers (Huang 1993). Huang's study regards Mandarin temporal connective","paragraphs":["ranhou as a"]},{"title":"\"hesitation marker\" rather than a \"linking word\" which reflects speakers' \"conceptual planning operation\" that is translated into linguistic form. Following Schiffrin's (1994) lists theory, Su (1998) illustrate the nonpropositional use of","paragraphs":["ranhou,"]},{"title":"which is used to maintain textual coherence rather than the temporal order of events.","paragraphs":["She calls such use of ranhou interactional"]},{"title":"usage, since it is not necessarily to link anaphorically a previous proposition (event time), but simply to denote the temporal sequence of speech behavior (discourse time); furthermore, it can be used as a topic initiator, a 187","paragraphs":["floor-holding device or a floor-taking device. (Su 1998)4 In this regard, the linkingfiu acts more like an utterance-connective, even when it does not combine with such connectives as"]},{"title":"ranhou, hou-lai","paragraphs":["and"]},{"title":"shuo-yi.","paragraphs":["In my data, about half, more than fifty, of the sequentialfius do not mark any antecedent- consequent relation of the two propositions, but simply denote the temporal sequence of speech behavior for the purpose of accomplishing conversational coherence (Craig & Tracy 1983). As Extract (14) and (15) illustrate: (14) Assig\\t353 B:..hm\\","354 A:"]},{"title":"..xiang wo jin-tian jiu xie a","paragraphs":["StIld4-X:Ti' i Ifr"]},{"title":"–p. 355\\t..","paragraphs":["ranhou jiu zai na han shuo","ftaitMIASilat","356\\t<Q ou dou meiyou zhuyi guo eh <Q"]},{"title":"MAVIS,' eh B: \"hm.\"","paragraphs":["A: \"Just like"]},{"title":"while I was writing today, and then I cried out, Òu, I have never noticed that...\" (15) KTV 489 B: .. <@","paragraphs":["ni you-mei-you kan zuotian de chaujixingqitian @>","<@ anVagergX1YJEWLV =1\"X @>","490\\t.. [(H) @@@1","491\\tA:"]},{"title":"..[meiyou a]","paragraphs":["[etifq 492\\t"]},{"title":"..jiu zai biauyan grVION","paragraphs":["493\\tB: .. <@"]},{"title":"zuotian nage @> <@","paragraphs":["Irg"]},{"title":"X#5iii @> 494\\t","paragraphs":["A:"]},{"title":"..zeyang","paragraphs":["VI ---,.\\t495\\tB:"]},{"title":"..lan-xin-mei to jiu shang nage jizhehui","paragraphs":["E,CANISt_EXIMEAlar B: \"Did you watch"]},{"title":"Super Sunday","paragraphs":["yesterday? A: \"No, I was performing.\" B: \"Yesterday, that...\" A: \"What?\" B: \"Lan Xin-mei showed up in the Ji-zhe-hui.\" 4.2 Identificational usage"]},{"title":"of jiu / jiushi","paragraphs":["As Liu (1993) points out, the identification use of"]},{"title":"jiu","paragraphs":["or"]},{"title":"jiushi","paragraphs":["is to identify or characterize the referent of a previously mentioned NP as in an equation sentence, as Extract (16) & (17) illustrate: (16) Theft\\t37 L:..(0.8)"]},{"title":"nage you <E dialogue E> NNW","paragraphs":["dialogue"]},{"title":"38\\t..suo-wei <E dialogue E>","paragraphs":["PfigN dialogue --).\\t39 .."]},{"title":"jiushi you tang liang fang","paragraphs":["it"]},{"title":"I","paragraphs":["k"]},{"title":"i e.t.","paragraphs":["tt.W. \"That needs dialogues. The so-called dialogue refers to the two-party conversation.\" (17) KTV\\t169 B:"]},{"title":"(0)shang-xiau shi to baba ma __E.AttIlIllitg","paragraphs":["4 As Su points out, \"everyday talk is the accomplishment of conversational coherence (Craig and Tracy 1983); it is the joint creation and display of connective between utterances, such that what one speaker says can be understood to follow sensibly from what the other has said.\" (Su 1998:177)"]},{"title":"188","paragraphs":["--).\\t170 A: (0)"]},{"title":"duei shang-xiau jiushi ta baba 51.±.RaAM","paragraphs":["B: \"Is the colonel her father?\" A: \"Yes, the colonel is her father.\" Table 3 The distributions of identificational i"]},{"title":"iu","paragraphs":["and i"]},{"title":"iushi jiu-shi/jiu","paragraphs":["Occurrence External facts/An entity's ID 71 Assessments 58 Concessive 1 Nevertheless, as the data in Table 3 reveal, we may find that the identificational jiu is not only used in equation sentences to give an objective description to identify or characterize an entity, but also used to report speaker's thought, subjective opinions, evaluations or assessments. The most striking is that it can appear as verbal filler. In Extract (18), the two speakers are talking about their mutual friend, Lan-xin, and getting worried about Lan-xin's recent depression and conflict caused by her rather busy career. Lan-xin feels rather perplexed because on the one hand she wants to transfer to the department of translating editors to gain more free time, but on the other hand, she also wants to stay in the original post as a reporter to write \"something\", a goal which a translating editor can never reach. When Speaker S utters"]},{"title":"bianyi jiushi zheyangzi \" nitAile-T-\"","paragraphs":["(A translating editor is just like this)\" in Line 175, it is pretty hard for the addressee to understand what exactly a translating editor is like unless she knows the speaker's preference and subjective assessment on this job. (18) repo\\t171:"]},{"title":"..ta qishi MAO","paragraphs":["172"]},{"title":"..lan-xin ta ziji ye xiang xie xie MOMMEtz/SA 173..xie dian dongxi a AM*N 174 S:..bianyi shi RNA —). 175...bianyi jiushi zheyangzi iGNIVAilit-T- C:","paragraphs":["\"In fact, Lan-xin also wants to write and has her own products.\" S: \"A translating editor","is just like that.\" In Extract (19), the speakers are talking about a heavy snowstorm that forces the Dallas airport closes and one speaker's father is thus stuck in the Dallas airport. Moreover, the Dallas airport does not provide any food or hotel for the passengers and just let the passengers sit and wait in the airport lobby. Then Speaker B asks a question in Line53, and Speaker A provides a confirming answer followed by a negative assessment on Dallas City, which is not directly related to the question. (19) fami\\t52 B:"]},{"title":"..zemo namo WRNY2","paragraphs":["53 ( 1.8 ) dalesi shi yiqian dagu zhu de difang"]},{"title":"AmAJAItmanit 54 A:..duei a %IN","paragraphs":["GC 189 ---> 55 ..dalesi fiushi yige da zaiqu"]},{"title":"AtAilIA—faltXg","paragraphs":["B: \"How could that be? Is Dallas the place where the eldest aunt lived before?\" A: \"Yes. Dallas is an area where big disasters occur.\" And in Extract (20) Speaker L's utterance in Line 122 conveys strong negative emotional reaction toward the entity they are talking about. His description of that woman is solely based on his subjective opinions rather than on external facts or objective evidence.","(20) elec\\t115 L: duei a","tf","116\\t..nazhong nu de hen kongbu","NEVOM.Rait 117","\\t","qianwan buneng kaulu","-TATfig","118\\t... ( 0.8 ) nuyanshe ye","121 C: ..heN ---> 122 L: ..fanzheng jiushi nazhong nuren nenggou zemoyang a"]},{"title":".KES1k#13fV(A9gAVVIP","paragraphs":["L: \"Yes. That kind of female are rather terrible. You should never take her into consideration. The Association of Feminism Study!( Two Ns omitted) C: \"heN.\" L: \"Anyway, what can that kind of women do?\" 4.3. The limiting usage of jiu According to Liu, the limiting jiu occurs with almost all kinds of constituents. Although it renders slightly varying meanings when combined with different constituents, its major function is to place focus on a subsequent element by limiting the scope of possible candidates to the particular one. But in my data, I have found that in addition to conveying emphatic meaning, jiu can also denote a decision or a suggestion, as the following example illustrates: (21) G& M\\t305: women jiu shier-dian Matti-1h \"Let's say twelve o'clock.\" 5. Discussions From Table 1, we can clearly see that the frequency of the occurrence of jiu in verbal interactions is much higher now than that in Liu's 1993 study, whereas that of cai does not change much as time changes. Furthermore, as a linking element, jiu is gaining its epistemic meaning as a discourse marker. The linking jiu is not only to mark an antecedent-consequent relation of two propositions, but also to denote a temporal sequence of speech behavior. As an identificaitonal element, jiu can be used in equation sentences Jo identify or characterize a previously mentioned entity; such an identification can go from those based on external facts or objective statements to those based on speaker's personal preference and subjective evaluations or assessments and to those without any semantic content but serving as verbal 190 fillers. The high frequent occurrence of jiu in verbal interactions accelerates the change of the meaning and the behavior of Mandarin jiu. On the other hand, the cal behaves extremely conservatively in this aspect. A possible explanation for such a difference in these two adverbial items might be that jiu originates as a verb and cai a noun in the Early Stage of Old Chinese. Research by Gentner (1981) and by Gentner and France (1988) suggests that if the comprehension system is looking for a possible metaphor, it would try the verb first, because verbs are inherently more mutable than nouns. They found that nouns tend to refer to fixed entities, while verb meanings bend more readily to fit the context. But how do we explain the behavior of limiting jiu that speakers use to denote their decision or suggestion after their negotiation in the interaction? In her 1993 study, Liu also explores the grammaticalization process of Mandarin adverbial marker jiu, states that the development of jiu has followed more than one path/channel of grammaticalization and thus can be represented as a poly-grammaticalization chain; that is, one and the same morpheme provides the source of more than one chain. (Liu 1993:216-218) Jiu originates from a spatial motion verb in Early Old Chinese; the essential meaning of jiu is 'to bring oneself to the deictic center of the GOAL', with focus more on the TOWARDS-THE-GOAL part. (Liu 1993:221) And through metaphorical and contextual manipulations, the verbal jiu is allowed to be used in a wide range of contexts. Therefore, on the basis of the metaphorical concept ACTION IS PATH or ACTION IS MOVEMENT, that speakers make a decision after negotiation with others through verbal interactions can be perceived as taking action t̀o accomplish a certain task' or t̀o achieve certain goal', which can both be perceived as moving in space towards a definite location. 6. Concluding Remarks This study starts out with my little curiosity about the seemly over-flooded use of jiu in our daily verbal interactions and turns out to be an account of the further grammaticalization process of Mandarin adverbial marker jiu after Liu's 1993 study. As what many functional linguists and CA experts believe, grammar emerges out of response to verbal interactions. The high frequency of jiu in verbal interactions accelerates the change of the meaning and the behavior of Mandarin jiu. References Biq, Yung-O. 1984. The semantics and pragmatics of CAI and JIU in Mandarin Chinese. Ph.D. dissertation. Cornell University. \\t. 1988. From focus in proposition to focus in speech situation: cai and jiu in Mandarin Chinese. JCL 16.72-108. \\t. 1990. Conversation, continuation and connectives. Text 10(3).187-208. Gentner, D. 1981. Some interesting differences between verbs and nouns. Cognition and brain theory 191 4(2):161-178. \\t, and I. France. 1988. The verb mutability effect. Lexical ambiguity resolution, ed. by Steven Small et al. Morgan Kaufmann. Heine, Bernd, U. Claudi, and F. Hunnemeyer. 1991. Grammaticalization: a conceptual framework. Chicago: University of Chicago Press. Hopper, Paul. 1987. Emergent grammar. Berkeley Linguistics Society 13:139-157. Huang, Shuanfan. 1993. Pause as a window on the mind and the grammar—evidence from spoken Chinese discourse. Paper presented at the Workshop on Interfaces and the Chinese Language, June 30-August 6, 1993, Ohio State University. Liu, Mei-chun. 1993. Discourse, grammar, and grammaticalization: synchronic & diachronic analyses of Mandarin adverbial markers JIU & CAI. Ph.D. dissertation. University of Colorado at Boulder. UMI. Schiffrin, Deborah. 1985. Conversational coherence: the role of well. Language 61(3).640-667. \\t. 1986. The function of and in discourse. Journal of Pragmatics 10(1).41-66. \\t. 1992. Anaphoric then: aspectual, textual and epistemic meaning. Linguistics 30(4):753-792. Su, Lily I-wen. 1998. Conversational coherence: the use of ranhou in Chinese spoken discourse. Selected papers from the Second International Symposium on Language in Taiwan, ed. by Shuanfan Huang, 167-182. Taipei: The Crane Traugott, Elizabeth. 1989. On the rise of epistemic meanings in English: an example of subjectification in semantic change. Language 65.31-55. Appendix TEXT SPEAKERS TOPIC TYPE DURATION lUs Hong Kong C, 33, female, social worker in a church Y: male, clergyman in the church Z: male, clergyman in the church W: the transcriber Hong Kong Face-to-face 8'27\" 446 G & M G: female college teacher about 34 M: female college teaches about 39 Treating Face-to-face 6'11\" 379 Match H: a junior college teacher and amateur matchmaker, female, about 50 I: a junior college teacher, female, about 33 M: a college teacher, female, about 39 Matchmaking Face-to-face 10'00\" 706 Actor M: male, student F: female, student Actor Face-to-face 10'05\"66\"' 498 Basketball T: female, 29, teacher Basketball Face-to-face 9'05\" 414 192 B: junior high school student, 14 Repo C: female, social worker in a church S: female, a translating editor in a magazine W: female, the transcriber Reporters Face-to-face 19'20\" 835 Assignment A: female, college student, 22 B: female, college student, 29 Assignment Face-to-face 11'22\" 758 Theft L: a female graduate student about 27 J: a female teaching assistance about 28 I: a female junior college teacher about 33 M: a female college teacher about 39 Theft Face-to-face 8'51\" 584 MCON1 F: female, librarian, 40 M: male, assistant, 30 Department Face-to-face 9'06\" 504 1 KTV A & B: female college students KTV Face-to-face 9'17\" 532 Homo A & B: roommates at a girl's dormitory in NT U Homo\\t, Face-to-face 10'34\" 385 Fami A: female, middle age, housewife B. female, college student C: female, college student 0: female, child Family talk Face-to-face","1 6'41\" 333 MCON3 Y: female, college lecturer, 33 H: female, vice professor, 40 J: female, janitor, 65 Ping-pong Face-to-face 5'03\" 260 Elec C & L: male, college students Election Face-to-face 6'18\" 299 MCON5 B: female college student, 21 J: female college student, 21 L: female, housewife, 43 Friends Face-to-face 5'36\" 251 193"]}]}