{"sections":[{"title":"THE ORGANIZATION OF THE ROSETTA GRAMMARS Jan Odijk Philips Research Laboratories, P.O. Box 80.000 5600 JA Eindhoven, The Netherlands","paragraphs":["ABSTRACT","In this paper the organization of the grammars in the Rosetta machine translation system is described and it is shown how this organization makes it possible to translate between words of different syntactic categories in a systematic way. It is also shown how the organization chosen makes it possible to translate 'small clauses' into full clauses and vice versa. The central concept worked out here in some detail is the concept of 'partial isomorphy' between subgrammars. The system as described here has been implemented and is currently being tested."]},{"title":"1 ROSETTA","paragraphs":["In this section I will mention some essential properties of the Rosetta machine translation system. For more extensive descriptions of this system I refer to Landsbergen(1987), Appelo & Landsbergen(1986), Appelo, Fellinger & Landsbergen(1987) and Leermakers & Rous(1986).","The Rosetta machine translation system is an interlingual machine translation system based on Montague Grammar and developed at Philips Research Laboratories in Eindhoven for Dutch, English and Spanish. The grammars used in Rosetta are computational variants of Montague Grammar and are called M-grammars.","Rules in M-grammars, called M-rules, operate on syntactic surface trees. If a certain string"]},{"title":"str","paragraphs":["is associated with a syntactic tree of category C the notation"]},{"title":"C(str)","paragraphs":["will be used. An M-grammar in Rosetta is subdivided into a number of subgrammars. Each subgrammar is a rule package and is defined by specifying a"]},{"title":"head","paragraphs":["(the category of a designated argument from the import for the subgrammar),"]},{"title":"export","paragraphs":["(the categories of the syntactic trees yielded by the subgrammar) and a"]},{"title":"control expression","paragraphs":["that indicates in which order M-rules must be applied. In Rosetta31 a distinction is made between meaningful M-rules, called"]},{"title":"rules","paragraphs":["(that correspond to a meaning operation), and meaningless rules, called"]},{"title":"transformations","paragraphs":["(that do not correspond to a meaning operation).","M-grammars are reversible. Because of this fact, the translation relation between two sentences can be illustrated by showing their derivations ill generation. The example derivations below will be restricted to generation only.","Within the Rosetta system the grammars of the relevant languages are attuned to one another, in such a way that two sentences that are each other's translation can be derived starting from corresponding basic expressions by applying COlTesponding rules in the same way for both sentences. 'Corresponding' here means: 'corresponding to the same meaning operation or basic meaning', and it holds of meaningful M-rules only.","M-grammars attuned in this way are called"]},{"title":"isomorphic grammars,","paragraphs":["and therefore the method of translation used is called the"]},{"title":"isomorphic grammar approach to machine translation. 2 CATEGORIAL MISMATCHES","paragraphs":["In order to derive simple sentences e.g."]},{"title":"Ziet hi 3\" de manf","paragraphs":["one could design a grammar of Dutch that, starting with a basic verb"]},{"title":"(zie)","paragraphs":["applies rules to derive the sentence mentioned. One could have rules combining a basic verb with arguments that it allows or requires"]},{"title":"(hij, de mart)","paragraphs":["in a sentence, rules that determine the tense of this sentence"]},{"title":"(present tense)","paragraphs":["and rules that determine 'mood' and real- ...... ÂThe.pap-er-d-ea~-with the grammars in the third version of the Rosetta system, Rosetta3."]},{"title":"- 80 -","paragraphs":["ize the sentence accordingly ( in this case yes-no-question, main clause, realized by the order verb-subject-object}, etc..","In order to derive the English sentence Does he see the manf as a translation of this Dutch sentence it would be required to design a grammar of English isomorphic to the grammar of Dutch sketched above. There must be a rule combining a verb (see} with its arguments (he, the man}. There must be rules determining tense and aspect (simple present tense in the example sentence), and there must be rules that determine 'mood' and realize the sentence accordingly (yes-no- question, main clause, realized by introducing the auxiliary verb do and the order do-subject-verb-object}, etc..","In this simple example the syntactic categories of the Dutch word zien and its translation into English see are the same. For these cases isomorphic grammars can be developed rather straightforwardly.","However, machine translation systems must be able not only to translate between words of the same category, but also to translate between words of different syntactic categories. Some examples where a translation between words of different categories is required or desirable are given in the following table: hij zwemt graag (Adv} he likes to swim (Verb} hij is toevallig ziek (Adv) he happens to be ill (Verb} het mist (Verb} it is foggy (Adj) hij schaamt zich ervoor (Verb}"]},{"title":"He (_Adj.!","paragraphs":["........ hij is mij 3 gulden schuldig (Adj) He owes me 3 guilders (Verb} hij is in A'dam woonaehtig (Adj) He resides in Amsterdam (Verb} Het is voldoende (Adj}","The Rosetta grammars nmst be able to deal with such cases in a systematic way.","It must also be possible to translate 'small clauses' into full clauses (finite or infinite) and vice versa. 'Small Clauses' are propositional units in which a subject-predicate relationship is expressed and which are not marked for tense and aspect (cf. Stowell (1981)). Some examples of full clauses and their corresponding 'small clauses' are given in the following table: 'Full Clauses' Verb Adj Prep Adv Noun He killed a man He is intelligent He is against the deal He is here He is a fool 'Small Clauses' Verb"]},{"title":"Adj","paragraphs":["Prep Adv Noun I had the man killed I consider him intelligent We got him against the deal We got him here They consider him a fool","Small clauses can occur only as complements within a clause. The fact that they are not marked for tense and aspect is reflected in the absence of auxiliary and copular verbs. If the grammar allows for translation of clauses into small clauses and vice-versa, then it becomes possible to derive e.g. he seems ill and hii schiint ziek te zijn (lit. he seems to be ill as translations of each other. It is sometimes requh'ed to be able to translate small clauses into full clauses in some cases. The English sentence he seems ill cannot be translated into Dutch *hi i schiint ziek, which is ungrammatical, but umst be translated into hi] schi]nt ziek te zijn ( he seems to be ill) or into bet schiint dat hi i ziek is (it seems that he is ill}."]},{"title":"3 GRAMMAR ORGANI-ZATION","paragraphs":["The global organization of the grammars (leaving transformations out of consideration) is the same for all languages, as is required by the isomorphic method.","The grammars are subdivided into five proiec-tion subgrammars ~, one for each major category (Verb, Noun, Prep, Adj, Adv). 3","Each of these projection subgrammars consists of a number of subgrammars. The partitioning of projection subgrammars into subgrammars is motivated by the fact that it must be possible to use tile output of each subgrammar as import to subgrammars of other projection subgrammars.","A schematic representation of the paxtitioning of a projection subgrammar into subgrammars is","2These are called subgrammars in Appeio, Fellinger & Landsbergen(1987)","3Apart from these subgrammars there is also a projection subgrammar to derive simple NPs, which is not partially isomorphic to the other projection subgrammars. -81 - given in figure 1, where X is a variable over the major syntactic categories. A projection subgrammar is a set of subgrammars that define a projection for a given category X. A projection of some category X is a syntactic structure headed by X.","Each projection subgrammar is bifurcated as indicated in figure 1. If the rules and transformations in the XPPtoGLAUSE and CLAUSEtoSENTENCE subgrammars are applied a full clause is derived. If the rules and transformations of the XPPtoXPFORMULA (XPPtoXPF) and XPFOR-MULAtoXPP (XPFtoXPP) are applied a 'small clause' is derived.","The projection subgrammars are partially isomorphic to one another, which makes it possible to translate a subset of constructions from one projection subgrammar into constructions from some other projection subgrammar. Furthermore the XPPtoXPF subgrammars are partially isomorphic to the XPPtoCLAUSE subgrammars, and the XPFtoXPP subgramlnars are partially isomorphic to the CLAUSEtoSENTENGE subgrammars. This makes it possible to translate a subset of full clauses into 'small clauses'.","The subgrammars are partially isomorphic to one another instead of fully isomorphic, because for certain full clauses no corresponding small clauses exist (e.g. there is no 'small clause' corresponding to the full clause Is he Jill). BX derivation ] XPP I formation I ....... I"]},{"title":"to ix Pf","paragraphs":["CLAUSE I XPF"]},{"title":"1 ,l","paragraphs":["CLAUSE to XPF to SENTENC~ XPP Figure 1: The global organization of the Rosetta projection subgrammars. X is a variable ranging over the major syntactic categories","The subgrammars indicated in figure 1 will be discussed in more detail now.","X-Derivation subgrammar deals with derivation and composition","XPPformation In this subgrammar the argument structure and the syntactic realization of arguments (whether they are subject, object, prepositional object, etc.) is accounted for. Voice (active, passive) is determined in this subgrammar.","XPPtoCLAUSE When this subgrammar is applied a full clause will be derived. In the subgrammar propositional complements and adverbials are introduced, tense and aspect is determined and auxiliaries are introduced accordingly. There are several transformations in this subgrammar to deal with the proper incorporation of propositional units into the structure, e.g. transformations dealing with control phenomena, and transformations dealing with the proper positioning of verbs (especially in Dutch). 'Hidden' arguments, e.g. nonovert by-phrases in passives, are dealt with here.","XPPtoXPF When this subgrammar is applied a 'small clause' will be derived. The XPPtoXPF subgrammars are partially isomorphic to the XPPtoCLAUSE subgrammars, hence they contain similar corresponding rules. They contain rules introducing propositional complements, rules determining tense and aspect (which is considered to be present though dependent upon superordinate clauses) and rules dealing with hidden arguments.","CLAUSEtoSENTENCE In this subgrammar nonpropositional arguments are introduced and scope of quantificational expressions is accounted for. Furthermore the 'mood' of a sentence is determined, i.e. it is decided whether it is going to be a declarative, interrogative, relative etc. clause.","XPFtoXPP This subgrammar is partially isomorphic to the GLAUSEtoSENTENCE subgrammars. It contains rules to introduce nonpropositional arguments and to account for scope. There are 'mood' rules determining whether the XPP is 'closed' (i.e. there are no free variables left in the structure), or 'open', (i.e. the subject variable is free). - 82 -"]},{"title":"4 ILLUSTRATIONS","paragraphs":["The global organization of the grammar will be illustrated here by showing the derivation processes of certain examples involving a categorial mismatch and of some examples of translations from 'small clauses' into full clauses or vice versa. I repeat that only the generative part of the derivation need be demonstrated given the reversibility of the grammars. Furthermore only the correct derivation paths through the grammar will be illustrated, though in reality many false paths, i.e. paths through the grammar that do not lead to an actual sentence, are chosen by the grammar.","Since M-grammaxs are reversible it possible to 'translate' from e.g. Dutch into Dutch. In this way Rosetta functions as a paraphrase generator. Because of this, the partial isomorphy between two projection subgrammars can (and will) be illustrated by showing the parallel derivation of two paraphrases in generation.","In subsection 4.1 the derivation of hi] schaamt zich ervoor and he is ashamed of it will be illustrated.","In subsection 4.2 the derivation of I find him intelligent and I find that he is intelligent will be illustrated.","In subsection 4.3 the derivation of he seems intelligent, he seems to be intelligent and it seems that he is intelligent as paraphrases of one another will be illustrated.","In subsection 4.4 the derivation of de op haar verliefde man and de man die op haar verliefd is as paraphrases of one another will be illustrated.","In subsection 4.5 the derivation of hi] zwemt graag and he likes to swim will be illustrated."]},{"title":"4.1 Adjective-Verb","paragraphs":["The derivations of hi] schaamt zich ervoor (lit. he ashamed himself therefor) and its translation he is ashamed of it run as follows. The verb schamen is a two place verb so that it can be combined with two variables, zl and ~, in the VPPformation subgrammar yielding VPP(xl x2 schaam}. In the English grammar, the adjective ashamed is also combined with two variables in the ADJPPformation subgrammar, yielding ADJPP(zi ashamed z2}. The Dutch verb schamen must realize its second argument as a prepositional object with the preposition voor. The English adjective ashamed must realize its second argument as a prepositional object as well, though headed by the preposition of. Pattern transformations axe applied to yield this effect: VPP(zl voor r¢ schaam} and ADJPP(zi"]},{"title":"ashamed of z2).","paragraphs":["Ill the VPPformation snbgrammar a Voice-rule applies determining that the structure is in active voice. In the ADJPPformation subgrammax a corresponding rule applies which has no visible effects.","In Dutch a transformation spelling out a reflexive pronoun must apply, since the verb schamen is a so-called inherently reflexive verb. This yields VPP(zi zieh voor x2 schaam). Since spelling out these reflexive pronouns is achieved by transformations, no corresponding M-rule need apply in English.","These structures are both input to the XPPtoCLAUSE subgrammar where they are turned into clauses. In Dutch this yields CLAUSE(zi zieh soor z2 schaam). In English the copula be is introduced, yielding OLAUSE(zi be ashamed of x2}. Tense and aspect rules are applied in both cases, putting the structures in present tense, yielding OLAUSE(xi zich voor x2 schaamt) and OLAUSE(zx is ashamed"]},{"title":"of ~).","paragraphs":["Substitution rules substitute the NPs her and it respectively for the variables z2 and the NPs hi] and he respectively for the variables zt. This yields in English OLAUSE(he is ashamed of it) and in Dutch OLAUSE(hij zich voor het schaamt). An obligatory transformation turns voor het in Dutch into ervoor.","Mood rules are applied in Dutch and in English. The clauses are turned into declarative main clauses. In English this yields SENTENCE(he is ashamed of it} and in Dutch this yields SEN-TENCE(hij zich ervoor schaamt}. Application of the transformation putting the finite verb in 'second' position and application of an obligatory topicalization transformation in Dutch yield the actual sentence Hij schaamt zich ervoor. 4.2"]},{"title":"Adjective-declarative with main verb clause","paragraphs":["The parallel derivations of I find him intelligent and I find that he is intelligent run as follows. In the ADJPPformation subgrammar the adjective intelligent is combined with a variable zi yielding ADJPP(zi intelligent) This ADJPP can be turned either into a clause yielding OLAUSE(zi be intelligent) (ill tlle XPPtoOLAUSE subgrammax) or it can continue as an adjectival construction (in the ADJPPtoADJPF subgrammar). Tense and Aspect rules determine that the tense of this construction is dependent on the tense of a superordinate construction yet to be formed. A substitu- - 83 - tion rule substitutes the NP containing he for zl yielding ADJPF{"]},{"title":"he intelligent)","paragraphs":["and CLAUSE{he"]},{"title":"is/was intelligent}","paragraphs":["respectively. Finally Mood rules determine the way the clause and the ADJPF are realized. The mood rule forming subordinate declarative clauses is mapped onto the mood rule forming 'closed' ADJPPs (CADJPP). Applying these mood rules yields"]},{"title":"SENTENCE{that he is/was intelligent)","paragraphs":["and CADJPP(he"]},{"title":"intelligent).","paragraphs":["These results can be used later in the derivation as arguments to the verb .find.","To derive the rest of the structures the verb find is combined with two variables (z2, x3 ) yielding VPP{x2 find z3). The substructures built earlier can be substituted for x3 yielding VPP("]},{"title":"x2 find he intelligent)","paragraphs":["and VPP(zz"]},{"title":"find that he is/was intelligent)","paragraphs":["respectively. After turning these VPPs into clauses and applying tense and aspect rules (putting the sentences ill present tense) the tense of the subordinate clause can be determined. This yields CLAUSE(z2"]},{"title":"find he intelligent}","paragraphs":["and CLAUSE(z2"]},{"title":"find that he is intelligent). Ap-","paragraphs":["plying a case-assignment transformation and substituting the NP(I) for ~ yields CLAUSE(/find"]},{"title":"him intelligent}","paragraphs":["and CLAUSE{/find"]},{"title":"that he is intelligent}","paragraphs":["respectively. Applying a mood rule that turns these clauses into declarative main clauses yields the actual sentences. 4.3 Adjective-declarative clause"]},{"title":"with copula","paragraphs":["The derivations of"]},{"title":"he seems intelligent, he seems to be intelligent","paragraphs":["and"]},{"title":"it seems that he is intelligent","paragraphs":["starts in the same way as in the preceding section. A CADJPP(he"]},{"title":"intelligent)","paragraphs":["and a SEN-"]},{"title":"TENCE(that he is/was intelligent}","paragraphs":["are generated. In addition to the mood rule forming finite declarative subordinate sentences a nmod rule forming 'closed' infinite declarative subordinate sentences containing"]},{"title":"to","paragraphs":["call be applied. This rule forms the SENTENCE(he"]},{"title":"to be intelligent)","paragraphs":["out of the CLAUSE(he"]},{"title":"be intelligent ).","paragraphs":["These results can be used as arguments to tile verb seem. In the VPPformation subgrammar a VPP(seem z2) is formed from the verb seem and the variable z2. The SENTENCEs and the CAD-JPP obtained earlier are substituted for the variable x2. This yields the structures VPP(seem he"]},{"title":"intelligent}, VPP(seem that he is/was intelligent}","paragraphs":["and"]},{"title":"VPP(seem he to be intelligent}","paragraphs":["respectively. A transformation turns the subject of embedded","infinitival complements of verbs such as"]},{"title":"seem","paragraphs":["into the subject of"]},{"title":"seem,","paragraphs":["and the NP(it} is inserted as a subject of the verb"]},{"title":"seem","paragraphs":["if it has a finite complement. After determining tense and aspect and applying a subject-verb agreement transformation this yields the structures CLAUSE(he"]},{"title":"seems intelligent),","paragraphs":["CLAUSE(it"]},{"title":"seems that he is intelligent)","paragraphs":["and CLAUSE(he"]},{"title":"seems to be intelligent}","paragraphs":["respectively. Applying the mood rule forming declarative main clauses yields the actual sentences.","In tile grammar of Dutch parallel derivations can be made. The CADJPP(hff"]},{"title":"intelligent)","paragraphs":["(cf."]},{"title":"he intelligent}","paragraphs":["and tile SENTENCEs"]},{"title":"dat hij intelligent is/was","paragraphs":["and"]},{"title":"hi3\" intelligent te zijn","paragraphs":["(cf."]},{"title":"that he is/was intelligent","paragraphs":["and"]},{"title":"he to be intelligent","paragraphs":["resp.) can be derived. Some of these results can be used as arguments to the verb"]},{"title":"sehijnen 'seem'.","paragraphs":["In the VPPformalion subgrammar the verb"]},{"title":"sehijnen","paragraphs":["is combined with the variable z¢ into a VPP(z~"]},{"title":"sehijn).","paragraphs":["The SENTENCEs obtained earlier can be substituted for this variable, but tile CADJPP(h/j"]},{"title":"intelligent)","paragraphs":["cannot, because the Dutch verb"]},{"title":"sehijnen","paragraphs":["does not","take CADJPPs as a complement. Tile derivation continues with the two results"]},{"title":"VPP( dat hij is~was intelligent schffn)","paragraphs":["and VPP(h/j"]},{"title":"intelligent te zijn schijn}.","paragraphs":["Application of several transformations to deal adequately with such complements in Dutch (Verb-raising and extraposition (in tile sense of Evers(1975)), subject-to-subject-raising and some others) and application of tense and aspect rules yields"]},{"title":"CLAUSE(her schijnt dat hij intelligent is)","paragraphs":["and"]},{"title":"CLAUSE{hij intelligent sehijnt te zijn)","paragraphs":["respectively. Application of mood rules forming declarative main clauses and some obligatory transformations in Dutch yields tile actual sentences"]},{"title":"Het sehijnt dat hij intelligent is","paragraphs":["and"]},{"title":"Hi] sehijnt intelligent te zijn","paragraphs":["as translations of tile English sentences derived earlier. 4.4"]},{"title":"Adjective-relative clause","paragraphs":["The derivations of"]},{"title":"(de) op haar verliefde (man) (the man in love with her) and (de man) die op haar verliefd is (the man that is in love with her)","paragraphs":["runs as follows. The adjective"]},{"title":"verliefd 'in love'","paragraphs":["is a two-place adjective that is combined with two variables xl and x¢ in tile ADJPPformation subgrammar. This yields a structure of the form ADJPP(xl"]},{"title":"verlie[d","paragraphs":["~). The adjective"]},{"title":"verliefd","paragraphs":["must realize its second argument (z2) as a prepositional object that can occur in front of the adjective. Pattern transformations introduce the preposition required, yielding ADJPP(sl"]},{"title":"op z~ verliefd ). - 84 -","paragraphs":["This ADJPP can be turned into a clause, or it can be turned into an adjectival phrase. The XP-PROPtoGLAUSE subgrammar changes the structure mentioned in the following way: OLAUSE(zl op z2 verliefd zi3\"n), where the top category has been turned into CLAUSE and tile copula zi3\"n 'be' has been introduced. To form all adjectival phrase the ADJPP is input to the XPPtoXPF subgrammar, yielding ADJPF(zl op ~ verliefd). In both subgrammars tense and aspect rules apply.","In the CLAUSEtoSENTENCE subgrammar a transformation is applicable that moves the subject variable zl into a position where normally relative pronouns would appear. In this particular structure this has no effects on the hft-right order, but the relation that zl bears is changed.","In the CLAUSEtoSENTENGE subgramlnar and in the ADJPFtoADJPP subgrammar the NP(zij) 'she' is substituted for variable ~ and the appropriate Case form (accusative) is assigned to it. This yields CLAUSE(z~ op haar verliefd is/was) and ADJPP(zi op haar verliefd).","Finally Mood rules turn tlle ADJPP into an 'open' ADJPP (OADJPP} yielding OADJPP(zl op haar verliefd}, and they turn the CLAUSE into a relative subordinate clause: SENTENGE(zl op haar verliefd is). These structures can be used by rules in the NP-subgrammar that introduce these structures as modifiers and bind variable zl."]},{"title":"4.5 Graag-like","paragraphs":["In the Dutch sentence hij zwemt graag the adverb graa9 appears. This adverb must be mapped onto the English verb like in the translation he likes to swim.","It is assumed that the Dutch adverb graa9 is a two place-function. This is required in Rosetta, because its translation like is a two-place function 4. However, apart from being required in Rosetta, it is also plausible for independent reasons that 9raa9 is a two-place function: the adverb 9raag imposes selectional restrictions upon the subject of the sentence it appears in (cf. fhet regent 9raag or fde steen valt graag, which are as odd as their English counterparts fit likes to rain and fThe stone likes to fall). If we assume that predicates impose sehctional restrictions only upon their arguments, then it must be the case that the subject of the sentence is an argument of 9raag, or that the argument of","4This contrasts with the approach in the Eurotra framework, where this requirement does not hold. See Arnold et."]},{"title":"aL (19as)","paragraphs":["9raag is coindexed with the subject of tile sentence. I will assmne tlle latter.","Starting with the subordinate infinitival clause in English, we combine the verb swim, which takes one argument, with a variable zl as its subject, yielding: VPP(zl swim) Similarly in the Dutch grammar the translation of swim, zwem, is combined with zl: VPP(zl zwem) Ill tile VPPformation subgrammar the voice rule to form active clauses is applied.","After tile VPPformation subgrammar the derivation continues in tile XPPtoGLAUSE subgrammar. All M-ruh to make the sentence infinitival is applied. Corresponding rules are applied in the XPPtoCLAUSE subgrammar of Dutch.","In the GLAUSEtoSENTENCE subgrammar no arguments are substituted. In English a rule is applied that makes the clause all infinitival subordinate clause containing to and containing a free variable in subject position which will later be subject to control transformations. This yields a structure of the form SENTENGE(zl to swim)","In Dutch a corresponding rule is applied that makes the clause all infinitival subordinate clause without te with a free variable in subject position. This yields the following structure in Dutch: SENTENCE(zx zwemmen) These structures will be used later on.","In the VPPformation subgrammar of English the two-place verb like is combined with two variables, zl and x2. This yields: VPP(zi like x2) The voice rule to form active sentences is applied.","Correspondingly, in the ADVPPformation subgrammar of Dutch tile adverb 9raa9 is combined with two variables, zl and za, and a voice rules is applied. This yields: ADVPP(zl 9raa9 z2}","In the English subgrammar XPPtoCLAUSE tile sentential structure derived above is substituted for the variable x~, yielding: VPP(zi like [ xl to"]},{"title":"swim]}","paragraphs":["A control transformation deletes the second occurrence of zl. Tense and aspect rules apply which turn the structure into a finite clause in present tense.","In the Dutch subgrammar XPPtoCLAUSE the sentential structure derived above is substituted for the variable z¢ by a special rule that takes care of substitution of sentential complements into AD-VPPs. This special rule deletes the ADVPP node and replaces it by a VPP node, turns the ADVP into a modifier inside this VPP, makes the VP of SENT the VP of this VPP, deletes the variable zl inside SENT and un-does the morphological effects of tense rules. This yields the structure: VPP(zl - 85 -"]},{"title":"AD VP(graag} zwem)","paragraphs":["These structures continue their normal derivation. Tense and aspect rules apply, the NP argument"]},{"title":"hij\" (he)","paragraphs":["is substituted for st and the sentence is made into a declarative main clause, yielding in English: SENTENCE(he"]},{"title":"likes to swim)","paragraphs":["and in Dutch, after application of the transformation of 'Verb second' and an obligatory topicalization transformation:"]},{"title":"SENTENCE( hij zwemt graag) 5 CONCLUSION","paragraphs":["It has been shown that the concept of partial isomorphy between subgrammars makes it possible to translate between words of different syntactic categories and between 'small clauses' and full clauses in a systematic way. Furthermore, it has been shown that one of the most difficult cases of translation between words of different categories, viz. the"]},{"title":"9raa9/like","paragraphs":["translation probhm, can be reduced to having only one special rule, given partial isomorphy between subgrammars."]},{"title":"ACKN O WLED GEMENT S","paragraphs":["This paper is based on joint work being done in the Rosetta machine translation project. I would like to thank Lisette Appelo, Jan Landsbergen, Margreet Sanders and Andr6 Schenk for many valuable comments on earlier drafts of this paper."]},{"title":"and Methodolooical Issues in Machine Translation of Natural Lanouaoes,","paragraphs":["Carnegie Mellon University, Center for Machine Translation, Pittsburgh, Pennsylvania. Evers, A. (1975),"]},{"title":"The Transformational Cycle in Dutch and German,","paragraphs":["diss. University of Utrecht.","Landsbergen, J. (1987), 'Isomorphic grammars and their use ill the Rosetta Translation System', Philips Research M.S. 12.950, Paper presented at tile Tutorial on Machine Translation, Lugano, 1984, in: M. King (ed.), Ma-"]},{"title":"chine Translation, the State of the Art,","paragraphs":["Edinburg University Press.","Leermakers, R. and J. Rous (1986), 'The Translation Method of Rosetta', Philips Research M.S. 13.701, In:"]},{"title":"Computers and Translation,","paragraphs":["Vol 1, number 3, pp. 169-183. Stowell, T."]},{"title":"(1981), Origins of Phrase Structure,","paragraphs":["Ph. D. dissertation, MIT."]},{"title":"REFERENCES","paragraphs":["Appelo, L. , C. Fellinger and J. Landsbergen (1987), 'Subgramlnars, Rule Classes and Control in the Rosetta Translation System', Philips Research M.S. 14.131, to appear in:"]},{"title":"Proceedings of 8rd Conference ACL,","paragraphs":["European Chapter.","Appelo, L. and J. Landsbergen (1986), 'The Machine Translation Project Rosetta', Philips Research M.S. 13.801, In:"]},{"title":"Proceedings First International Conference on the State of the Art in Machine Translation,","paragraphs":["Saarbriicken, pp. 34-51.","Arnold, D., S. Krauwer, L. des Tombe & L. Sadhr (1988), \"Relaxed' Compositionality ill Machine Translation', in:"]},{"title":"Proceedings of the Second International Conference on Theoretical - 86 -","paragraphs":[]}]}