{"sections":[{"title":"Fourth Conference of the European Chapter of the Association for Computational Linguistics Proceedings of the Conference 10- 12 April 1989 University of Manchester Institute of Science and Technology Manchester, England Published by the Association for Computational Linguistics ©1989, Association for Computational Linguistics Order copies of this and other ACL proceedings from: Donald E. Walker (ACL) Bell Communications Research 445 South Street MRE 2A379 Morristown, NJ 07960-1961, USA Printed in Great Britain by BPCC Wheatons Ltd, Exeter - ii - PREFACE This volume contains texts of the papers presented at the Fourth Conference of the European Chapter of the Association for Computational Linguistics, reserve papers, and tutorial abstracts. Over 130 papers were submitted for the conference, and the overall standard was high: it was with regret and difficulty that the Programme Committee were able to accept only 45, even including parallel sessions and reserve papers. We are grateful to all those who submitted papers, to the Programme Committee and referees for reading them, and to all who worked hard on local arrangements. Our thanks in particular to Prof. J. C. Sager and to the secretarial staff of the Centre for Computational Linguistics, UMIST for many forms of moral and material support. Don Walker and the officials of the European Chapter, Maghi King, Beat Buchmann, and Mike Rosner, also did much to make it all possible. Harold Somers, UMIST Mary McGee Wood, Manchester Joint Programme Committee and Local Arrangements Chairs Programme Committee Christian Boitet, GETA/UMSG, Grenoble Bran Boguraev, Cambridge Computer Lab & IBM Yorktown Heights NY Laurence Danlos, LADL, Pads Anne de Roeck, University of Essex (tutorials) Gerald Gazdar, University of Sussex Jdrgen Kunze, Akademie der Wissenschaften der DDR, Berlin Michael Moortgat, Universiteit Leiden Harold Somers, UMIST Manchester (co-chair) Oliviero Stock, IRST, Povo/Trento Henry Thompson, University of Edinburgh Dan Tufi~, Central Institute for Management and Inforrnatics, Bucharest Mary McGee Wood, University of Manchester (co-chair)","paragraphs":["- 111","- Local Arrangements Committee"]},{"title":"Paul Bennett Martin Earl Lindsey Hammond John McNaught Jeanette Pugh Harold Somers Mary McGee Wood Referees Lars Ahrenberg (Linkdping) Gerard Bailly (Grenoble) Ted Briscoe (Lancaster) Jean-Louis Binot (Everberg) Nicoletta Caizolari (Pisa) John Carroll (Cambridge) Robin Cooper (Edinburgh) Waiter Daelemans (Brussel) Roger Evans (Sussex) Giovanni Guida (Milano) Hans Hailer (SaarbrtYcken) Peter Hellwig (Heidelberg) Gerard Kempen (Nijmegen) James Kilbury (Dtt'sseldorf) Steven Krauwer (Utrech0 Jock McNaught (Manchester) Michael McTear (Ulster) Willem Meijs (Amsterdam) Vladimir Pericliev (Sofija) Steve Pulman (Cambridge) Elisabeth Ranchhod (Lisboa) Graeme Ritchie (Edinburgh) Christian Rohrer (Stuttgart) Dietmar R6'sner (Darmstadt) Bengt Sigurd (Lund) Petr Sgall (Praha) Jon Slack (Milton Keynes) Pete Whitelock (Edinburgh) Gerd Willee (Bonn) - iv - Programme of events","paragraphs":["6.00 - 9.00 pm Registration for tutorials 9.00 - 10.00 am Registration for tutorials Saturday 8th April Sunday 9th April","10.00 - 11.00 and 11.30 - 1.00 Tutorials on Discourse (Bonnie Lynn Webber) or Machine translation (Jun-ichi Tsujii) 1.00 - 2.30 Lunch","2.30 - 3.30 and 4.00 - 5.30 Tutorials on Categorial grammars (Mark Steedman) or The lexicon (Bran Boguraev) 6.00 onwards Registration for conference 7.30 Reception Monday 10th April 9.00 - 9.30 Registration 9.30 Opening remarks: J.C. Sager (UMIST Manchester) and Maghi King (ACL European Chapter Chair) 10.00 Invited paper: James Pustejovsky (Brandeis University Waltham MA) Current issues in Computational Lexical Semantics 11.00 Coffee break 11.30 Anne Abeill~ & Yves Schabes (LADL Paris & UPenn Philadelphia) Parsing idioms in lexicalized TAGs 12.00 Mark Hepple & Glyn Morrill (University of Edinburgh) Parsing and derivational equivalence 12.30 Gosse Bouma (Research Institute for Knowledge Systems, Maastricht) Efficient processing of flexible categorial grammar 1.00 Lunch 2.30 Michael Gerlach & Helmut Horaeek (Universit//t Hamburg) Dialog control in a natural language system 3.00 Lance A. Ramshaw (BBN Systems and Technologies Corporation Cambridge MA) A metaplan model for problem-solving discourse -V-3.30 Kurt Eberle & Walter Kasper (Universit~/t Stuttgart) Tenses as anaphora 4.00 Tea break 4.30 Graeme Ritchie (University of Edinburgh) On the generative power of two-level morphological rules 5.00 Jonathan Calder (University of Edinburgh) Paradigmatic morphology 5.30 Roger Evans & Gerald Gazdar (University of Sussex) Inference in DATR 7.30 Dinner (optional) in UMIST Harwood Room Tuesday llth April 9.30 Hiroaki Kitano, Hideto Tomabechi & Loft Levin (Carnegie Mellon University Pittsburgh) Ambiguity resolution in DmTrans Plus 10.00 Jan Odijk (Philips Research Laboratories Eindhoven) The organization of the Rosetta grammars 10.30 Jan Haji~ (Charles University Prague) Morphotactics by attribute grammar 11.00 Coffee break Parallel session A: 11.30 Patrick Saint-Dizier (UniversR Paul Sabatier Toulouse) Programming in logic with constraints for natural language processing 12.00 Hirosi Tuda, K6iti Hasida & Hidetosi Sirai (University of Tokyo, ICOT Tokyo & Tamagawa University Tokyo) JPSG parser on constraint logic programming 12.30 Mike Reape (University of Edinburgh) A logical treatment of semi-free word order and bounded discontinuous constituency Parallel session B: 11.30 Joan L.G. Baart (University of Leiden) Focus and accent in a Dutch text-to-speech system 12.00 Steve Whittaker & Phil Stenton (Hewlett-Packard Laboratories Bristol) User studies and the design of natural language systems 12.30 Danilo Fum, Paolo Giangrandi & Carlo Tasso (Universitd di Trieste & Universitd di Udine) Tense generation in an intelligent tutor for foreign language teaching: some issues in the design of the verb expert 1.00 Lunch - Vi - Parallel session A: 2.30 Ulrich Held & Sybille Raab (Universitat Stuttgart) Collocations in multilingual generation 3.00 David M. Carter (SRI International Cambridge) Lexical acquisition in the core language engine 3.30 Dan Tufi~ (Institute for Computer Technique and Information Bucharest) It would be much easier if went were good Parallel session B: 2.30 C16o JuUien & Jean-Charles Marty (Cap Sogeti Innovation Grenoble) Plan revision in person-machine dialogue 3.00 Carom Eschenbach, Christopher Habel, Michael Herweg & Klaus Rehldtmper (Universit~lt Hamburg) Remarks on plural anaphora 3.30 Mark T. Maybury (Rome Air Development Center Griffiss AFB NY) Enhancing explanation coherence with rhetorical strategies 4.00 Tea break 4.30 Marc Moens, Jo Calder, Ewan Klein, Mike Reape & Henk Zeevat (University of Edinburgh GBr) Expressing generalizations in unification-based grammar formalisms 5.00 Rod Johnson & Mike Rosner (IDSIA Lugano & ISSCO Gendve) A rich environment for experimentation with unification grammars 5.30 Erik-Jan van der Linden (University of Brabant Tilburg) Lambek theorem proving and feature unification 7.00 coach(es) depart for banquet Banquet (7.30 for 8) at SmithiUs Coaching House, Bolton"]},{"title":"Wednesday 12th April","paragraphs":["9.30 Jdrgen Kunze (Akademie der Wissenschaften der DDR Berlin) A formal representation of propositions and temporal adverbials I0.00 Jan Tore L0nning (University of Oslo) Computational semantics of mass terms 10.30 Allan Ramsay (University of Sussex) Extended graph unification 11.00 Coffee break 11.30 Lyn Pemberton (University of Sussex) A modular approach to story generation 12.00 Fiammetta Namer (Universit~ de Paris VII) Subject erasing in Italian text generation 12.30 Jonathan Calder, Mike Reape & Henk Zeevat (University of Edinburgh) An algorithm for generation in Unification Categorial Grammar 1.00 Lunch - vii - 2.30 Mats Wirdn (Linkdping University) Interactive incremental chart parsing 3.00 Gabriel G. Bds & Claire Gardent (Universitd de Clermont II & Centre for Cognitive Science Edinburgh) French order without order 3.30 Lita Taylor, Claire Grover & Ted Briscoe (University of Lancaster) The syntactic regularity of English noun phrases 4.00 Tea break 4.30 Masako Kume, Gayle K. Sato & Kei Yoshimoto (ATR Osaka)A descriptive framework for translating speaker's meaning: Towards a dialogue translation system between Japanese and English 5.00 Ronald M. Kaplan, Klaus Netter, Jdrgen Wedekind & Annie Zaenen (Xerox Palo Alto Research Center & Universi~t Stuttgart) Translation by structural correspondences 5.30 John Bateman, Robert Kasper, Jdrg Schdtz & Erich Steiner (ISI/USC Marina del Re), CA & IAI Snarbrdcken Ger) A new view on the process of translation 6.00 Conference ends Reserve papers Ntis Dahlb~/ck & Arne Jdnsson (Linkdping University) Empirical studies of discourse representations for natural language interfaces Gertjan van Noord, Joke Dorrepaal, Doug Arnold, Steven Krauwer, Louisa Sadler, & Louis des Tombo (University of Essex & Rijksuniversiteit Utrecht) An approach to sentence-level anaphora in machine translation CJ. Rupp (UMIST Manchester) Situation semantics and machine translation Zaharin Yusoff (Universiti Sains Malaysia Penang) On formalisms and analysis, generation and synthesis in machine translation",".°. - Vlll - Contents Tutorial Abstracts Discourse Bonnie Lynn Webber Machine translation Jun-ichi Tsujii Categorial grammars Mark Steedman The lexicon Bran Boguraev xv xv xv xvi Current issues in computational lexical semantics James Pustejovsky Parsing idioms in lexicalized TAGs Anne Abeilld & Yves Schabes Parsing and derivational equivalence Mark Hepple & Glyn Morrill Efficient processing of flexible categorial grammar Gosse Bouma Dialog control in a natural language system Michael Gerlach & Helmut Horacek A metaplan model for problem-solving discourse Lance A. Ramshaw Tenses as anaphora Kurt Eberle & Walter Kaspor On the generative power of two-level morphological rules Graeme Ritchie Paradigmatic morphology Jonathan Calder Inference in DATR Roger Evans & Gerald Gazdar Ambiguity resolution in DmTrans Plus Hiroaki Kitano, Hidcto Tomabechi & Lori I..¢vin The organization of the Rosetta grammars Jan Odijk Programming in logic with constraints for natural language processing Patrick Saint-Dizier JPSG parser on constraint logic programming Hirosi Tuda, K6ifi Hasida & I-Iidctosi Sirai A logical treatment of semi-free word order and bounded discontinuous constituency Mike Rcape xvii 10 19 27 35 43 51 58 66 72 80 87 95 103 -ix-Focus and accent in a Dutch text-to-speech system Joan L.G. Baart User studies and the design of natural language systems Steve Whittaker & Phil Stenton Tense generation in an intelligent tutor for foreign language teaching:","some issues in the design of the verb expert Danilo Fum, Paolo Giangrandi & Carlo Tasso Collocations in multilingual generation Ulrich Heid & Sybille Raab Lexical acquisition in the core language engine David M. Carter It would be much easier if went were goed Dan Tufts Plan revision in person-machine dialogue Clio Jullien & Jean-Charles Marty Remarks on plural anaphora Carola Eschenbach, Christopher Habel, Michael Herweg & Klaus Rehk~imper Enhancing explanation coherence with rhetorical strategies Mark T. Maybury Expressing generalizations in unification-based grammar formalisms Marc Moens, Jo Calder, Ewan Klein, Mike Reape & Henk Zeevat A rich environment for experimentation with unification grammars Rod Johnson & Michael Rosner Lambek theorem proving and feature unification Erik-Jan van der Linden A formal representation of propositions and temporal adverbials Jdrgen Kunze Computational semantics of mass terms Jan Tore L~nning Extended graph unification Allan Ramsay A modular approach to story generation Lyn Pemberton Subject erasing and pronominalization in Italian text generation Fiammetta Namer An algorithm for generation in Unification Categorial Grammar Jonathan Calder, Mike Reape & Henk Zeevat Interactive incremental chart parsing Mats Wirdn French order without order Gabriel G. B6s & Claire Gardent The syntactic regularity of English noun phrases Lita Taylor, Claire Grover & Ted Briscoe 111 115 24 130 137 145 153 161 168 174 182 190 197 205 212 217 225 233 241 249 256 -X-A descriptive framework for translating speaker's meaning:.","towards a dialogue translation system between Japanese and English Masako Kume, Gayle K. Sato & Kei Yoshimoto Translation by structural correspondences Ronald M. Kaplan, Klans Netter, Jllrgen Wedekind & Annie Zaenen A new view on the process of translation John A. Bateman, Robert T. Kaspe~, J~rg F.L. Schdtz & Erich H. Steiner An approach to sentence-level anaphora in machine translation Gertjan van Noord, Joke Dorrepaal, Doug Arnold, Steven Krauwer,","Louisa Sadier & Louis des Tombe Empirical studies of discourse representations for natural language interfaces Nils Dahlb//ck & Arne JOnsson Situation semantics and machine translation CJ. Rupp On formalisms and analysis, generation and synthesis in machine translation Zaharin Yusoff 264 272 282 299 291 308 319 \" xi - Author Index Anne Abeilld I Doug Arnold 299 Joan L.G. Baart 111 John A. Bateman 282 Gabriel G. B~s 249 Bran Boguraev xvi Gosse Bouma 19 Ted Briscoe 256 Jo Calder 58 174 233 David M. Carter 137 Ntis Dahlb~/ck 291 Joke Dorrepaal 299 Kurt Eberle 43 Carola Eschenbach 161 Roger Evans 66 Danilo Fum 124 Claire Gardent 249 Gerald Gazdar 66 Michael Gerlach 27 Paolo Giangrandi 124 Claire Grover 256 Christopher Habel 161 Kditi Hasida 95 Ulrich Heid 130 Mark Hepple 10 Michael Herweg 161 Helmut Horacek 27 Rod Johnson 182 Arne Jdnsson 291 Cldo Jullien 153 Ronald M. Kaplan 272 Robert T. Kasper 282 Walter Kasp~r 43 Hiroaki Kitano 72 Ewan Klein 174 Steven Krauwer 299 Masako Kume 264 Jffrgen Kunze 197 Lori Levin 72 Erik-Jan van der Linden 190 Jan Tore I.~nning 205 Jean-Charles Marry 153 Mark T. Maybury 168 Mare Moens 174 Glyn Morrill 10 Fiammetta Namer 225 Klaus Netter 272 Gertjan van Noord 299 Jan Odijk 80 Lyn Pemberton 217 James Pustejovsky xvii Sybille Ranb 130 Allan Ramsay 212 Lance A. Ramshaw 35 Mike Reape 103 174 233 - xii - Klaus Rehldimper Graeme Ritehie Mike Rosner CJ. Rupp Louisa Sadler Patrick Saint-Dizier Gayle K. Sam Yves Schabes Jdrg F.L. Schutz Hidetosi Sirai Mark Steedman Erich H. Stciner Phil Stenton Carlo Tasso Lita Taylor Hideto Tomabechi Louis des Tombe Jun-ichi Tsujii Hirosi Tuda Dan Tufi~ Bonnie Lynn Webber Jffrgen Wedekind Steve Whittaker Mats Wirdn Kei Yoshimoto Annie Zaenen Yusoff Zabarin Henk Zeevat 161 51 182 308 299 87 264","1 282 95 xv 282 116 124 256 72 299 xv 95 145 XV 272 116 241 264 272 319","174 233 Subject Index (compiled from authors' key words) abbreviations accent ambiguity resolution anaphora bounded discontinuous constituency CALL Categorial grammar categories chart parsing collocations constraint logic programming derivational equivalence dialogue dialogue control dialogue translation discourse Dutch English explanation feature unification feature value logics finite-state transducers focus French generalizations generalized quantifiers generation generative power grammar description grammatical formalisms idioms inferences interfaces intonation isomorphy Italian Japanese JPSG knowledge representation Lambek theorem proving language teaching lexical acquisition lexical semantics lexicography lexicology lexicon logic programming logical equivalence Machine Translation man-machine dialogue mass terms metaplan morphology noun phrases orthography 212 \"111 72","43 161 299 103 124","xv 19 249 212 241 130","87 95 10 27 27 264","xv 35 43 153 161 168 291 111","256 264 168 190 103 51","111 161 249 174 205 319 51 212","174 272 319","1 197 291 111 80 225 264 95","43 66 190 124 137 xvii 137 58","xvi 66 130","87 95 103 233 319 153 205 35","51 58 66 145 256 58 124130 217 225 233 282 116 153 205 xvi 72 80 264 272 282 299 308","llo - Xlll - parsing person-machine dialogue phonology plan tracking planning plural pragmatic models problem-solving pronominalization rhetorical strategies semantics Situation Semantics speech synthesis story structure subject erasing syntax TAGs temporal logic temporal relations tense text-to-speech systems theorem proving tree-adjoining grammars two-level morphology Unification Categorial Grammar unification user studies word order","1 10 19 95 241 153 58 35 153 161 35 35 225 168","197 205 308 111 217 225","80 249 256","1 197 197","43 124 111 19","1 51 233","58 95 174 182 190 212 233 116","103 249 - xiv -"]},{"title":"Tutorial Abstracts Machine Translation Jun-ichi Tsujii (UMIST) MT systems developed so far are surveyed, and the basic characteristics of MT which distinguish it from other NLP applications are discussed. New trends in research such as telephone dialogue translation, knowledge-based MT etc. are also discussed. Discourse Bonnie Lynn Webber (U Penn) Discourse places two demands on a communicative agent: (1) the need to comprehend and produce multiple utterances, each being interpreted in the context of those preceding it, and (2) the need to treat utterances as intentional behavior. Both processes seem to be inherently computational. That is, to model changes in context and attention requires consideration of the side effects of understanding and producing utterances. Similarly, interpreting and responding to utterances as intentional behavior requires support for planning and plan inference. This tutorial explores emerging computational models and methods for both contextual and intentional aspects of discourse. Combinatory Categorial Grammars Mark Steedman (U Penn) The session will discuss a generalisation of Categorial Grammar based on the inclusion of a few syntactic operations related to \"combinators\", such as functional composition. The theory implies a radical revision of accepted notions of surface structure and constituency, with interesting implications for theories of the production and comprehension of spoken and written language. The theory will be presented in the first instance as a theory of syntactic competence, with particular attention to constructions involving coordination and unbounded dependency. Attention will be paid to certain universal properties of such constructions across languages. The discussion will then be widened to consider the implications of this theory of syntax for selected problems in prosody and intonation, incremental semantic interpretation, and processing. - XV ° The lexicon Bran Boguraev (Cambridge Computer Lab & IBM Yorktown Heights) Knowledge of and about words underlies all natural language processing tasks. This tutorial will focus on the complementary questions of content and format(s) of computational lexicons, after looking in some detail at the specific lexical requirements of natural language processing systems. In particular, we will study some recent developments in theories of grammar and lexical semantics, and observe the implications in the way they handle lexical information for the organization of computational lexicons. We will trace, through a number of illustrative examples, issues like formalization of lexical information, flexibility and extendability of lexicon formats, scaling up prototype lexical systems, and acquisition of lexical knowledge, and observe how these inter-relate during the process of designing lexical components for realistic natural language processing systems.","paragraphs":["o xvi ° Current Issues in Computational Lexical Semantics James Pustejovsky Brandeis University Waltham, MA. USA Abstract In this talk I would like to address some issues of major importance in lexical semantics. In particular, I will discuss four topics relating to current research in the field: methodology, descriptive coverage, adequacy of the representation, and the computational usefulness of representations. In addressing these issues, I will discuss what I think are some of the central problems facing the lexical semantics community, and suggest ways of best approaching these issues. Finally, I outline a theory of lexical semantics embodying a richer notion of compositionality, termed cocomposition, which aims to spread the semantic load more evenly throughout the lexicon. 1. Introduction I believe we have reached an interesting turning point in research, where linguistic studies can be informed by computational tools for lexicology as well as an appreciation of the computational complexity of large lexical databases. Likewise, computational research can profit from an awareness of the grammatical and syntactic distinctions of lexical items; natural language processing systems must account for these differences in their lexicons and grammars. The wedding of these disciplines is so important, in fact, that I believe it will soon be impossible to carry out serious computational research in our field without the help of electronic dictionaries and computational lexicographic resources [Walker, 1986]. Positioned at the center of this synthesis is the study of word meaning, lexical semantics, which is currently witnessing a minor revival. Given this, I would like to turn to a few issues that I feel the lexical semantics community should address. In particular, I will pose the following four questions: 1. Has recent work in lexical semantics been methodologically any sounder than the previous work in the field? 2. Do theories being developed today have any broader coverage than the earlier descriptive work? 3. Do current theories provide any new insights into the representation of knowledge for the global structure of the lexicon? 4. Finally, has recent work provided the computational community with useful resources for parsing, generation, and translation research? Before answering these questions, I would like to establish two points that will figure prominently in our critique of the field. The first is that, without an appreciation of the syntactic structure of a language, the study of lexical semantics is bound to fail. There is no way in which meaning can be completely divorced from the structure that carries it. This is more a methodological point than anything else, since grammatical distinctions are a useful metric in evaluating competing semantic theories. c~--, - xvii - The second point is that the meanings of words should somehow reflect the deeper, conceptual structures in the system and the domain it operates in. This is tantamount to stating that the semantics of natural language should be the image of (nonlinguistic) conceptual organizing principles (whatever their structure). Some of the major points I would like to make here are the following. First, a clear notion of semantic well-formedness will be necessary in order to characterize a theory of possible word meaning. This may entail idealizing the notion of lexical meaning away from other semantic influences. For instance, this might suggest that discourse and pragmatic factors should be handled differently or separately from the semantic contributions of lexical items in composition (contra [Hobbs, 1987]. Although this is not a necessary assumption and may in fact be wrong, it may help narrow our focus on what is important for lexical semantic descriptions. Secondly, lexical semantics must look for representations that are richer than thematic role descriptions [Fillmore, 1968]. As argued in [Levin and Rappaport, 1986], named roles are useful, at best, for establishing fairly general mapping strategies to the syntactic structures in language. The distinctions possible with \"theta\" roles are much too coarse-grained to provide a useful semantic interpretation of a sentence. What is needed, therefore, is a principled method of lexical decomposition. This presupposes, if it is to work at all, (1) a rich, recursive theory of semantic composition, (2) the notion of semantic well-formedness mentioned above, and (3) an appeal to levels of interpretation in the semantics [Scha, 1983]. Thirdly, and related to the point above, the lexicon is not just verbs. Recent work has done much to clarify the nature of verb classes and the syntactic constructions that each allows [Levin, 1985]. Yet it is not clear whether we are any closer to understanding the underlying nature of verb meaning, why the classes develop as they do, and what consequences these distinctions have for the rest of the lexicon and grammar. The curious thing is that there has been little attention paid to the other lexical categories (but see [Fass, 1988]. That is, we have little insight into the semantic nature of adjectival predication, and even less into the semantics of nominals. Not until all major categories have been studied can we hope to arrive at a balanced understanding of the lexicon and the methods of composition. 2. Methods in Lexical Semantics Given what I have said, let us examine the questions presented above in more detail. Because of space, I will have little to say concerning question (4) in this short note. First, let us turn to the issue of methodology. How can we determine the soundness of our method? Are new techniques available now that have not been adequately explored? Very briefly, we can summarize the most essential techniques assumed by the field, in some way, as follows (see, for example [Cruse, 1986]): 1. On the basis of categorial distinctions, establish the fundamental differences between the grammatical classes; the typicial semantic behavior of a word of category X. 2. Find distinctions between elements of a word class on the basis of collocation and cooccurrence tests. For example, \"dog\" and \"rock\" partition into different classes due to certain features. 3. Test for distinctions of a grammatical nature on the basis of diathesis; i.e. alternations that are realized in the syntax. For example, break vs. cut in (i) and (ii) below [Hale and Keyser, 1986].","(i) a. The glass broke. b. John broke the glass.","(ii) a. *The bread cut. b. John cut the bread. - xviii - This results in ever-finer distinctions in the semantic and syntactic behavior of verbs. 4. Test for entailments in the word senses of a word, in different grammatical contexts. The same lexical item may carry different entailments in different contexts. For example, \"forget\" in (i):","(i) a. John forgot that he locked the door. b. John forgot to lock the door. Sentence (a) has a factive interpretation of \"forget\" that (b) does not carry. 5. Test for the ambiguity of a word. Distinguish between ambiguity and polysemy, (cf. [Hirst, 1987], [Fass, 1988]) and from the accidental nature and the logical nature of ambiguity. For example, the ambiguity between the two senses of \"bank\" in (i) and the polysemy in (ii).","(i) a. the bank of the river b. the richest bank in the city","(ii) a. The bank raised its interest rates yesterday. b. The store in next to the bank. 6. Establish what the compositional nature of a lexical item is when applied to other words. For example, \"alleged\" vs. \"tall\" in the example below.","(i) a. the alleged suspect b. the tall suspect While \"tall\" is a simple intersective modifier in (b) we must be aware of the intensional behavior of adjectives such as \"alleged\" in (a). This just briefly characterizes some of the techniques that have been useful for arriving at pre-theoretic notions of word meaning. What has changed over the years are not so much the methods themselves as the descriptive details provided by each test. One thing that has changed, however, --and this is significant-- is the way computational lexicography has provided stronger techniques and even new tools for lexical semantics research: for sense discrimination tasks [Atldns 1987]; for constructing concept taxonomies [Amsler 1985, Atldns, Klavans and Boguraev, forthcoming]; for establishing semantic relatedness among word senses [Wilks et al, 1988]; as well as for testing new ideas about semantic representations [Boguraev and Pustejovsky, forthcoming]."]},{"title":"3. Descriptive Adequacy of Existing Representations","paragraphs":["Turning now to the question of how current theories compare with the coverage of lexical semantic data, there are two generalizations that should be made. First, the taxonomic descriptions that have been made of verb classes are far superior to the classifications available twenty years ago (see [Levin, 1985] for review). Using mainly the descriptive vocabulary of [Talmy, 1975, 1985] and [Jackendoff, 1983], fine and subtle distinctions are drawn that were impossible to capture in the earlier primitives-approach of [Schank, 1972, 1975] or the frame semantics of [Fillmore, 1968]. There are two problems with the current work, however. Unlike the theories of [Wilks, 1975] and [Quillian, 1968], there is no general coherent view on what the entire lexicon will look like when semantic structures for other major categories are studied. Furthermore, it is not clear whether this work embodies a real theory of knowledge representation. We can, however, view this research as the first step towards constructing a theory of lexical semantics which is integrated into a linguistic theory, as well as interpreted in a knowledge representation system. - xix - 4. Explanatory Adequacy of Existing Representations Finally, let us turn to the question of whether current theories have changed the way we look at representation and lexicon design. The question here is whether the representations assumed by current theories are adequate to account for the richness of natural language semantics. It should be pointed out here that a theory of lexical meaning will affect the general design of our semantic theory in several ways. If we view the goal of a semantic theory as being able to recursively assign meanings to expressions, (accounting for phenomena such as synonymy, antonymy, polysemy, metonymy, etc.), then our view of compositionality depends ultimately on what the basic lexical categories of the language denote. Conventional wisdom on this point paints a picture of words behaving as either active functors or passive arguments [Montague, 1974]. But if we change the way which categories can denote, then the form of compositionality itself changes. Therefore, if done well, lexical semantics forces us to reevaluate the very nature of semantic composition in language (see, for example [Keenan and Faltz, 1985]). In what ways could lexical semantics affect the larger methods of composition in semantics? I mentioned above that most of the careful representation work has been done on verb classes. In fact, the semantic weight in both lexical and compositional terms usually falls on the verb. This has obvious consequences for how to treat lexical ambiguity. For example, consider the verb \"bake\" in the two sentences below.","(1) a. John baked the potato. b. John baked the cake. [Atkins, Kegl, and Levin, 1988] demonstrate that verbs such as \"bake\" are ambiguous, with both a \"change-of-state\" sense (la) and a \"create\" sense (lb). A similar ambiguity exists with verbs that allow the resulative construction, shown in (2) and (3), and discussed in [Dowty, 1979], [Jackendoff, 1983], and [Levin and Rapoport, 1988].","(2) a. Mary hammered the metal. b. Mary hammered the metal flat.","(3) a. John wiped the table. b. John wiped the table clean. On many views, the verbs in (2) and (3) are ambiguous, related by either a lexical transformation [Levin and Rapoport, 1988], or a meaning postulate [Dowty, 1979]. In fact, given strict requirements on the way that a verb can project its lexical information, the verb \"run\" in (4) will also have two lexical entries, depending on the syntactic environment it selects [Talmy, 1985], [Levin and Rappaport, 1989].","(4) a. Mary ran yesterday. b. Mary ran to the store yesterday. These two verbs differ in their semantic representations, where the \"run\" in (4b) means \"go-to-by-means-of-running\", while in (4a) it means simply \"move-by-running\". The methodology described above for distinguishing word senses is also assumed by those working in more formal frameworks. For example, [Dowty, 1985] proposes multiple entries for control and raising verbs, and establishes their semantic equivalence with the use of meaning postulates. That is, the verbs in (5) and (6) are lexically distinct but semantically related by rules."]},{"title":"(5)","paragraphs":["a. It seems that John likes Mary. b. John seems to like Mary. - XX -","(6) a. Mary prefers that she come. b. Mary prefers to come. Given the conventional notions of function application and compositionality, there is little choice but to treat all of the above cases as polysemous verbs. Yet, something about the systematicity of such ambiguity suggests that a more general, simpler explanation should be possible. By relaxing the conditions on how the meaning of a complex expression is derived from its parts, we can, in fact, arrive at a very straightforward explanation for cases of \"logical polysemy.\" The basic idea is this. Rather than treating the expressions that behave as arguments to a function as simple, passive objects, imagine that they are as active in the semantics as the verb itself. The product of function application would be sensitive to both the function and its active argument. Something like this is suggested in [Keenan and Faltz, 1985], as the \"Meaning-Form Correlation Principle.\" What I have in mind can best be illustrated by returning to the examples in (1). Rather than having two word senses for a verb such as \"bake,\" suppose there is simply one, a \"change-of-state.\" Now, assume that \"bake\" can be lexically specified as a Process verb [Pustejovsky, 1988]. It is a general property of Processes, that they can shift their \"aspectual type\" to become a telic event. For example, \"push the wagon\" can shift from a Process to a Transition (\"push the wagon to Mary\") by general principles of event composition (cf. [Pustejovsky, 1988]). Assume further, that our semantic theory makes a logical distinction between \"potatoes\" and \"cakes\" in terms of natural versus artifactual objects. Any artifact can be identified with the state of being that object, along with the purpose of the object, and other information. Most importantly, however, an artifact has a kind of stative interpretation as part of its meaning. Notice that the two senses for \"bake\" in (1) are the result of compositionality in a richer sense. For observe that the \"create\" sense arises by the same principle of event composition mentioned above. Namely, that there is a baking process, and it results in a cake. This is the \"create\" sense, and it is present just in those cases where an artifactual stative is already encoded in the argument (see [Pustejovsky, 1989] for details). In fact, similar principles seem to be operating in the examples mentioned in (2) through (4); namely, systematic ambiguity is the result of principles of semantic composition, rather than lexical ambiguity. I will call this particular kind of case \"cocompositionality.\" In explaining the behavior of the systematic ambiguity above, I made reference to properties of the Noun Phrase that are not typical semantic properties for nouns in linguistics, e.g. artifact, natural kind. In [Pustejovsky, 1989] and [Pustejovsky and Anick, 1988], I suggest that there is a system of relations that characterizes the semantics of nominals, very much like the argument structure of a verb. I call this the \"Qualia Structure\", adopting a term from [Goodman, 1951]. Essentially, the qualia structure of a noun determines its meaning as much as the list of arguments determines a verb's meaning. The elements that make up a qualia structure include notions such as \"container,\" \"space,\" \"surface,\" \"figure,\" \"artifact,\" and so on. When we combine the qualia structure of a NP with the argument structure of a verb, we begin to see a richer notion of compositionality emerging, one that looks very much like object-oriented approaches to programming [Ingria and Pustejovsky, 1988]. As an example, consider the two senses of \"window\" and \"door\" in (7) and (8) below:","(7) a. John crawled through the window. b. The window is closed.","(8) a. Mary painted the door. b. Mary walked through the door. ¢ - xxi - Each noun appears to have two senses: an object denotation, and a portal denotation. We can characterize the meaning of such \"Double Figure Ground\" nominals as a three place relation, roughly something like N(Figure,Invert-Figure, Ground), where Figure refers to the artifact itself, Invert-Figure refers to the portal, and Ground is a reference constant. The foregrounding or backgrounding of a nominal's qualia is very similar to argument structure-changing operations for verbs. That is, in (Sa) \"paint\" applies to the Figure interpretation of \"the door,\" while in (8b), \"through\" will apply to the Invert-Figure interpretation of the same NP. The ambiguity with such nouns is a logical one, one that is intimately linked to the semantic representation of the object itself. The qualia structure is a way of capturing this fact. Having discussed the notion of logical polysemy, let us conclude our brief discussion of lexical semantics with the issue of metonymy. Metonymy, where a subpart or related part of an object \"stands\" for the object itself, also poses a problem for standard denotational theories of semantics. For example, how can we account for the reference shifts such as those shown in (9)?","(9) a. Thatcher vetoed the channel tunnel. b. Mary enjoyed the book. I suggest that these are cases of semantic \"type coercion\", where the verb has coerced the meaning of a term phrase into a different semantic type. In the case of (9a), it is obvious that what is vetoed is some proposal relating to the object. In (9b), the book is enjoyed only by virtue of some event or process that involves the book, performed by Mary. It might furthermore be reasonable to assume that the qualia structure of \"book\" specifies what the artifact is used for; i.e. reading. Such coercion results in a word sense for the NP that I will call \"logical metonymy.\" Roughly, logical metonymy is where a logical argument of a semantic type (selected by a function) denotes the semantic type itself. For details see [Pustejovsky, 1989]. Another interesting example involves the possible subjects of causative verbs. These are also cases of logical metonymy. Consider the sentences in (10) and (11).","(10) a. The pictures of himself frightened John. b. A cup of coffee in the morning woke John up.","(11) a. John killed Mary. b. The gun killed Mary. c. John's stupidity killed Mary. d. The war killed Mary. e. John's pulling the trigger killed Mary. The sentences in (10) illusffate the various syntactic consequences of metonymy and coercion involving experiencer verbs, while those in (11) show the different \"metonymic extensions\" possible from the causing event in a killing. The generalization here is that when a verb selects an event as one of its arguments, type coercion to an event will permit a limited range of logical metonymy. 5. Conclusion In this paper I have tried to cover what I believe are currently some of the most interesting issues in lexical semantics. I have also tried to outline an approach to meaning where the semantic load is spread more evenly throughout the lexicon. This entails a semantic description of noun classes, termed a \"theory of Qualia,\" as well as the rules of composition that allow this information to be incorporated into the semantic interpretation of larger expressions. Although much of what I have presented is incomplete and somewhat programmatic, I firmly believe this approach can help clarify the nature of word meaning and compositionality in natural language. - xxii - Acknowledgements I would like to thank Dan Fass for lengthy discussion on many of the issues mentioned here. I would also like to thank Branimir Boguraev and Robert Ingria for useful comments. Any errors, of course, are my own. References [Amsler, 1980] Amsler, Robert, The Structure of the Merriam-Webster Pocket Dictionary. Ph.D dissertation, 1980. [Atkins, 1987] Atkins, Beryl T, \"Semantic ID Tags: Corpus Evidence for Dictionary Senses,\" in the Proceedings of 3rd Annual Conference at U. Waterloo, Center for the New OED, pgs.17-36, 1987. [Atkins et al, 1988] Atkins, Beryl, Judy Kegl, and Beth Levin, \"Anatomy of a Verb Entry\", Journal of Lexicographic Research 1, 1988. [Atkins et al, forthcoming] Atkins, Beryl, Judith Klavans, forthcoming. and Bran Boguraev, \"Semantic Verb Clusters from MRDs\", [Boguraev and Pustejovsky, forthcoming] Boguraev, Bran and James Pustejovsky, \"Knowledge Representation and Computational Lexicons,\" to appear in Zampolli and Calzolari, Towards a Lexicographer's Workstation, Oxford University Press. [Cruse, 1986] Cruse, D. A., Lexical Semantics, Cambridge University Press, 1986. [Dowty, 1979] Dowty, David R., Word Meaning and Montague Grammar, D. Reidel, Dordrecht, Holland, 1979. [Dowty, 1985] Dowty, David R., \"On Some Recent Analyses of Control,\" 1985. Linguistics and Philosophy 8, pp. 1-41, [Fass, 1988] Fass, Dan, \"Collative Semantics: A Semantics for Natural Language Processing,\" MCCS-99-118, Computing Research Laboratory, New Mexico State University, Las Cruces, New Mexico, 1988. [Fillmore, 1968] Fillmore, Charles, \"The Case for Case\", in Universals in Linguistic Theory, E. Bach and R. Harms (eds.). New York, Holt, Rinehart, and Winston, 1968. [Goodman, 1951] Goodman, Nelson, The Structure of Appearance, Reidel Publishing, Dordrecht, 1951. [Grimshaw, 1981] Grimshaw, Jane, \"Complement Selection and the Lexicon\" Linguistic Inquiry, 1979. ,..","- XX111","- [Gruber, 1965] Gruber, Jeffrey, Studies in Lexical Relations, MIT PhD, 1965 [Hale and Keyser, 1986] Hale, Ken and S.J. geyser, \"Some Transitivity Alternations in English,\" Lexicon Project Working Papers 7, Center for Cognitive Science, MIT, Cambridge, MA. [I-Iirst, 1987] Hirst, Graeme, Semantic Interpretation and the Resolution of Ambiguity, Cambridge University Press, Cambridge, 1987. [Hobbs, 1987] Hobbs, Jerry, \"World Knowledge and Word Meaning,\" New Mexico, January, 1987. in Proceedings of TINLAP-3, Las Cruces, [Ingria and Pustejovsky, 1988] Ingria, Robert and James Pustejovsky, \"Active Objects in Syntax and Semantics,\" ms. BBN and Brandeis University, 1988. [Jackendoff, 1972] Jackendoff, Ray, Semantic Interpretation in Generative Grammar, MIT Press, Cambridge, MA. 1972. [Jackendoff, 1983] Jackendoff, Ray, Semantics and Cognition, MIT Press, Cambridge. [Keenan and Faltz, 1985] Keenan, Edward, and Leonard Faltz, Boolean Semantics for Natural Language, Reidel Publishing, Dordrecht, 1985. [Levin, 1985] Levin, Beth, (ed) \"Lexical Semantics in Review,\" Lexicon Project Working Papers Number 1, MIT, 1985. [Levin and Rapoport, 1988] Beth Levin and T.R. Rapoport, \"Lexical Subordination,\" CLS 24, 275-289. [Levin and Rappaport, 1986] Levin, Beth and Malka Rappaport, \"The Formation of Adjectival Passives\", Linguistic Inquiry, 17.4, 1986. [Montague, 1974] Montague, Richard, Formal Philosophy, New Haven, Yale University Press. [Quillian, 1968] Quillian, M. Ross, \"Semantic Memory,\" Cambridge, MA. MIT Press, 1968. in M. Minsky (ed)"]},{"title":"Semantic Information Processing,","paragraphs":["[pustejovsky, 1988] Pustejovsky, James, \"Event Semantic University, Waltham, MA. 1988. Structure,\" Computer Science Technical Report, Brandeis [pustejovsky, 1989] Pustejovsky, James, \"Type Coercion and Selection,\" to appear in Proceedings of West Coast Conference on Formal Linguistics, Vancouver, 1989. - xxiv - [-Pustejovsky and Anick, 1988] Pustejovsky, James and Peter Anick, \"On The Semantic Interpretation of Nominals\", in Proceedings of COLING-1988, Budapest, 1988. [Scha, 1983] Scha, Rernko J. H., \"Logical Foundations for Question Answering,\" MS 12.331 Philips Research Laboratories, Eindhoven, the Netherlands, 1983. [Schank, 1975] Schank, Roger,"]},{"title":"Conceptual Information Processing,","paragraphs":["Amsterdam, North-Holland, 1975. [Talmy, 1975] Talmy, Len, \"Semantics and Syntax of Motion,\" in J.P. Kimball (ed),"]},{"title":"Syntax and Semantics 4,","paragraphs":["Academic Press, New York, 1975. [Talmy, 1985] Talmy, Len, \"Lexicalization Patterns\", in Timothy (Ed.), Cambridge, 1985."]},{"title":"Language Typology and Syntactic Description,","paragraphs":["Shopen, [Walker, 1986] Walker, Donald, \"Knowledge Resource tools for Accessing Large Text Files\", Artificial Intelligence and Information Science research, TR. 85-21233-25, 1986. [Wilks, 1975] Wilks, Yorick, \"Preference Semantics,\" in"]},{"title":"Formal Semantics of Natural Language,","paragraphs":["Keenan, E. (ed.), Cambridge University Press, 1975. [Wilks et al, 1988] Wilks, Yorick, Dan Fass, Cheng-Ming Guo, James McDonald, Tony Plate, Brian Slator, \"A Tractable Machine Dictionary as a Resource for Computational Semantics,\" in Bran Boguraev and Ted Briscoe (eds)"]},{"title":"Computational Lexicography for Natural Language Processing,","paragraphs":["Harlow, Essex, Longman. - XXV -"]}]}