{"sections":[{"title":"","paragraphs":["A FORMAL REPRESERTATION OF PROPOSITIONS AND T~PORAL ADVERBIALS","Jttrgen Kunze","Zentralinswitut fGr Sprachwissenschaft der","Akademie der Wissenschaften der DDR Prenzlauer Promenade 149-152","Berlin, DDR-1100 ABSTRACT","The topic of the paper is the introduction of a formalism that permits a homogeneous representation of definite temporal adverbials, temporal quantifications (as frequency and duration), temporal conJ~ctions and tenses, and of their combinations with propositions. This unified representation renders it possible to show how these components refer to each other and interact in creati~ temporal meanings. The formal representation is 0ased on the notions \"phase-set\" and \"phase-operator\", and it involves an interval logic. Furthermore logical coz~uections are used, but the (always troublesome) logical quantifications may be avoided. The expressions are rather near to lingaistic structures, which facilitates the link to text analysis. Some emprical confirmations are outlined. q. THE GENERAL FRAME","This paper presents some results that have been obtained in the field of time and tense-phenomena (K~Luze 1987). In connection with this some links to text analysis, knowledge representation and q~erence mechanisms have been taken into accoumt. The formalism presented here differs from what is under label of temporal logic on the market (e. g. Prior (1967), Aqviet/Guenthner (1978). Our main in-tention is to establish a calculus that is rather near to linguistic structures on one side (for text analysis) and to inference mechanisms on the other side.","The whole formalism has integrating features, i. e. the following components are represented by the same formal means in a way, that it becomes easy and effective to refer the different components to each other: - The propositions and their validity","with respect to time; - Definite temporal adverbials (nex~","wee k , ever~ Tuesda2); - Definite temporal qu~uti£ications as","frequency (three times) and duration","(three hours), comparislon of fre-","quencies, durations etc.; - Temporal conj~ctlons; -","Tenses and their different meanings.","The unified representation renders it possible to observe how the components interact in creating temporal meanings and relations. Some details have to be left out here, e. g. the notion \"determined time\" and the axiomatic basis of the calculus. -"]},{"title":"197 -","paragraphs":["2. PHASE-SETS AND PROPOSITIONS","A phase p is an interval (either unbounded or a span or a moment) which a truth value (denoted by q(p)) is assigned to: q(p) = T : p is considered as an affir-","mative phase. q(p) • F : p is considered as a denying","phase. The intervals are subsets of the time axis U (and never empty!).","A phase-set P is a pair tP',q3, where Pa is a set of intervals, and q (the evalnation function) assigns a truth value to each pe Pa. P has to fulfil the following consistency demand: (A) For all p,,p\"aP\" holds:","If p'n p\" @ ~, then q(p') • q(P\"). A phase-set P is called complete, iff the union of all phases of P covers U.","Propositions R are replaced by complete phase-sets that express the \"structured\" validity of R on the time axis U. Such a phase-set, denoted by (R>, has to be understood as a possible temporal perspective of R. There are propositions that differ from each other in this perspective only: Por (I) John sleeps in the dinin~ room~ one has several such perspectives: He is sleeping there, he sleeps there because the bedroom is painted (for some days), he sleeps always there. SO the phases of (R> are quite different, even with clear syntactic consequences for the underlying verb, The local adverbial may not be omitted in the second and third easel ~","I skip here completely the following problems:","- A more sophisticated application of nested phase-sets for the representation of discontinuous phases in (R>;","- the motivation of phases (e. g. according to Vendler (1967)) and their adequacy. 3. PHASE-0PERATORS A phase-operator is a mapping with","phase-sets as arguments and values.","There are phase-operators with one and","with two arguments. A two-place phase-","operator P-O(PI,P 2) is characterized by","the following properties:","(B) If P = P-O(PI,P2), then P\" • P~, i. e. the set of intervals of the resulting phase-set is the same as of the first argument;","(C) For each phase-operator there is a characteristic condition that says how q(p) is defined by q1(p) and P2 for all p £ P~. This condition implies always that q(p) = F follows from q1(p) = F. SO the effect of applying P-O(PI,P 2) is that some T-phases of PI change their truth value, new phases are not created.","The characteristic conditions are based on %wo-place relations between intervals. Let rel( , ) be such a relation. Then we define (by means of tel) q(p) according to the following scheme:"]},{"title":"CD) q(P) \" f T, if ql(p) =","paragraphs":["T and there is a P2 G P~ with q2(P2) = T and rel(P2oP); F otherwise"]},{"title":"- 198-","paragraphs":["We will use three phase-opera~ors and define their @v~uation functions in the following way by (D)s","(E) P = 0CC(P1,P2): rel(P2,p) is the relation \"P2 and p overlap\", i. e. P2nP ~ ~.","(F) P = PER(P1,P2)s rel(P2,p) is the relation \"P2 contains p\", i. e. P2 ~ p\"","(G) P = NEX(PI,P2)s rel(P2,p) is the relation \"P2 and p are not seperated from each other\", i. e. P2uP is an interval.","As an illustration we consider some examples. Needless to say~ that their exact represention requires further formal equipment we have not introduced yet. Typical cases for 0CC and PER ares (2) yesterda~ was bad weather.","Overlapping of (yesterday> and a T-","phase of (bad weather>. (3) John worked the whole evening.","A T-phase of ( evening> is contained","in a T-phase of (John works>.","(for (evening>, (yesterday> cf. 7.) There is only a slight difference between the characteristic conditions for 0CC and NEX: NEX admits additionally only b~EETS(P2,p) and ~LEETS(p,p2) in the sense of Allen (1984). Later ! will motivate that NEX is the appropriate phase-operator for the conjunction when. Therefore, sentences of the form (~) R1, when R 2. (cf. (N), (0)) will be represented by an expression that contains NEX((R2> , (Rfl>) as core. The interpretation is thaC nothing happens between a certain T-phase of (RI> an~ a certain T-phase of (R2~ (if they do not overlap).","The next operation we are going to define is a one-place phase-operator with indeterminate character. It may be called \"choice\" or \"singling out\" and will be denoted by xP~, where P1 = [~,qd] is again an arbitrary phase-sets","(H) xP - [~,q~,","1 - P~ = ~ (set of intervals unchanged)"]},{"title":"I","paragraphs":["T for exactly one p with","ql(p) = T (if there is some","q(p) = T-phase in P1)! F otherwise If we need different choices, we write xP1' YPI' zP2' ..., using the first sign as an index in the mathematical sense.","Moreover~we define one-place phase-operators with parameters:","(I) KAR(PI,n) = [Pm, q]:","P~ = ~ (set of intervals unchanged)","i T, if qfl(p) = T and there are","exactly n T-phases in PI; q(p) =","F otherwise (for all p g pm independently of qq(p)) Similarily one defines 0RD(PI,g) for integers g: ORD(PI,g) assigns the value T exactly to the g-th T-phase of PI' if there is one, with certain arrangements for g (e. g. how to express \"t~e last but second\" etc.)","Finally we define the \"alternation\" alt(P I) of an arbitrary phase-set P1 = [l~1,ql]. By alternation new phases may be create~s alt(P1) contains exactly those phases which one gets by joining all phases of P1 that are not seperated ~o - 199 - from each other and have the same value ql(Pl). So the intervals of alt(P I) are unions of intervals of PI' the q-values are the common ql-values of their parts (of. (A)). It is always alt(alt(P1)) = alt(P1) , and alt(P I) is complete, if PI is complete. Going from left to right on the time axis U, one has an alternating succession of phases in alt(P1) with respect to the q-values. alt(P I) is the \"maximal levelling\" of the phase-set PI\" 4. LOGICAL CONNECTIONS","The negation of a phase-set P1 is defined as follows:"]},{"title":"(J) ~PI = tP',qG:","paragraphs":["P~ = P~ (set of intervals unchanged) q(p) = neg(ql(p)) Note that (~R> and N(R> may be different because of non-equivalent phase-perspectives for ~R and R!","For each two-place functor \" u \" (e. g. \"Q\" = \"v\") we aegina PI a P2' if the sets PI and P2 are equal:"]},{"title":"(K) PI m P2 = [Pt'q3: P'= P;- P~","paragraphs":["q(p) = Pu(ql(p),q2(p)) , where F u is the corresponding truth func-tion (e. g. vel for \" w,,). Obviously for every phase-operator P-O the expression P'O(PI'P2) \"~ PI represents both a phase-set and a clear \"tautology\" - in other words - a phase-set that is \"always true\", if PI is complete. Therefore, alt(P-0(PI,P2)-~P1 ) = U ° (where U ° is the phase-set that contains the time axis U as the only interval with the q-value T) reflects the double nature of the aforesaid implication. 5. TRUTH CONDITIONS","The last considerations lead immedeately to the following definitions. The whole formalism requires two types of truth conditions, namely (L) alt(P) = U ° (M) alt(P) # ~U ° • They have different status: (L) is used, if the phase-set P is considered as a temporal representation of something that is valid, independently of time. (M) is applied~if P is considered as something that represents a certain \"time\" (expressed by the phases of P). Because of the second possibility, alt appears not only in truth conditions, but it may constitute arguments in phase-operators etc., too. This will be shown in the examples below.","Obviously one has for arbitrary phase-sets P = [P',q~,","alt(P) = U ° iff Vt~U~pGP~","Cq(p) = T • tap)","altCP) ~ ~U° iff ~t GU 3p~P~","CqCp) ="]},{"title":"Ta tGp)","paragraphs":["6. SOME CO tgIRNT ON THE PORMALISM","By regarding the time axis U as a basic notion one has to take the trouble to consider the topology of U, and gets difficulties with closed and - 200 - and open sets, environments etc.. This may be avoided by taking an axiomatic viewpoint: For all operations, relations etc. one formulates the essential properties needed and uses them without direct connection to the time axis. In this way U becomes a part of a model of the whole formalism. This is independent of the fact, that in definitions and explanations U may appear for making clear what is meant. 7 • TEMPORAL ADVERBI ALS","In section 2. we have outlined, how propositions R are substituted by phase-sets (R>. The same has to be done for temporal adverbials. First we consider definite adverbials: (tuesday> is a phase-set P, where P~ is the set of all days (as spans p covering together the whole time axis U), and exactly the Tuesdays have the value q(p) = T. For (day>~he set pm is the same, but it is q(p) = T for all p G Pm. (evening> has as intervals suitable subintervals of the days with q(p) = T, whereas the remaining parts of the days form phases with q(p) = F in (evening> . Analogously ( e~> contains all years as spans p with q(p) = T, whereas (1986> has the same spans, but exactly one with q(p) = T.","Now we combine temporal adverbials with propositions. An e~ct representation would require that we list all possible structures of phrases, clauses etc. that express a certain combination. We use instead of this \"standard paraphrases\" as \"a~ least on Tuesdays R\". If R is a certain proposition, e. g.","R = John works in the library , then","this paraphrase stands (as a remedy) for","(5) John works, worked, ... in the library every Tuesday. On every Tuesda~ John ... On Tuesda~ of ever~ week John ... A~ least on Tuesdays John ...","Examples with truth condltionas","(6) (the days, when R> = occ(<day>, (R>)","~t(...) , ~u ° (cf. (~) - (E))","(7) (the Tuesdays in 1986 , when R >","= 0CC(OCC((tuesday>,(R>), (1986>)","~t(...) ~ ~u °","(8) (at least on Tuesdays E >","= (tuesd%7> -~ OCC((day~, (R>)","alt(...) = u ° (cf. (~))","(9) (at most on Tuesd%ys R>","= OCt(( daft, (R>) -~ < tuesday >","alt(...) = U °","(10) (in 1986 at least on Tuesdays R>","= ( 1986 > -~","PER(( year>,","alt((tuesd> -~ OCC((day>, < R>)))","alt(...) = u ° (cf. (F))","(1986 is a year, throughout which","it is always true, tha~ every","Tuesda~ is a day, when R occurs.)","The second argument of PER is a phase-","set defined by an air-operation. This","phase-set has as T-phases exactly those","maximal periods during which (8) holds.",",","PER((~ear~,...) selects the years that","are covered by such a period, and the","whole expression says that 1986 is such","a year (and nothing about other years).","The time of speech L is formally represented by a phase-set L ° with three phases, namely L itself with q(L) = T, and the two remaining infinite intervals with the q-value F. Then one may define (today> = 0CC((day~,L°). By - 201 - using the phase-operator ORD (cf. (I)) one introduces (yesterday) etc., and similarily (this year> etc.. (11) (in this year three times R","= (R)\"~KAR(OCO((R), (this year}),3)","alt(...) = U ° (12) (the three times R in this ye.._ar)","= KAR(OCC((R), (~his year)) ,3)"]},{"title":"sit(...)","paragraphs":["+"]},{"title":"~U °","paragraphs":["In (11) a yes-no-decision is expressed (there are three T-phases of (R)in this year), but in (12) a \"time\" is defined, namely the three T-phases of (R> in this year. Therefore~the truth conditions are different. The expression in (12) may appear as an argument in other expressions again. Now we apply the operation \"choice\":","(13) (at most on Tuesdays three times R) ="]},{"title":"V OCC(x(da~),","paragraphs":["KAR(OCC((R), x(day~),3)) -~<tuesda~)","alt(...) = U ° OCC((R),x(day>) determines the T-phases of (R) on a single day, KAR(...,3) keeps them iff there are exactly three (otherwise they become F-phases, cf. (I)), OCC(x(day},...) assigns to the single day the value Tiff the T-phases of (R) on this day have been preserved. There-fore, ~OCC(...,...) is a T-F-distribu-tion over all days if x runs over all days, and the whole expression says that all T-days are Tuesdays. (q~)"]},{"title":"(15)","paragraphs":["(exactl~ on Mondays and Fridays R)"]},{"title":"coo(( day>, (at) ((monde~) v (~>) alt(...) = u ° (of. (8), (9))","paragraphs":["(never on Tuesdays R> OOO(( day), (R)) -~ ~ (tuesday) alt(...) = u ° (cz. (9)) These examples demonstrate the application of logical functors.","As one oan see, the e~pressions ren-der it possible to formulate even rather complex temporal relations in a comprehensible manner without much redundancy, the necessary arguments appear only once (or twice for certain quantifications as e. g. (tuesday) and (da~ in (8)). In order to handle durations, one needs another phase-operator EXT that is quite similar to KAR and ORD. The argument R stands either for \"bare\" propositions (without any temporal component) or for propositions with some temporal components. In the latter case the corresponding expression has to be substituted for (R): (q6) Ever~ Tuesda~ John watches tele-","vision in the evening. Take (R) = (in the evenin~ R') with R' = John watches television. Then one can represent (R) by","(R) = OCC( (R'}, (evening)) with alt(...) ~ ~U ° (John's t.v.- phases in evenings) and apply (8):"]},{"title":"( tuesda~ ) -~","paragraphs":["OCC(( day},0CC(( R' ), (evening~) )","alt(...) = U O Similarily one obtains (qO) from (8). The truth condition in (8) causes that alt(...) occurs as argument in (qO). The sign \"=\" in the examples means that the left side is defined by the right side, the left side is stripped of one (or more) temporal components. In this sense (6), (8) and (9) are rules, (7) and (I0) include two rules in each case. The full and exact form of such rules requires more than the standard paraphrases, namely corresponding (syntactic) str~ctures on their left side. - 202 - 8. TENSES","Till now nothing has been said about tenses. It is indeed possible to represent tenses in the formalism that we have outlined. But it is impossible to introduce \"universal\" rules for tenses. Even between closely related languages like English and German there are essential differences. So it does not make sense to explain here the details for the German tenses (of. Kunze 1987).","The main points in describing tenses are these: At first one needs a distinction between \"tense meanings\" and \"tense forms\" (e. g. a Present-Perfect-form may be used as Future Perfect). After that one has to introduce special conditions for special tense meanings (e. g. for perfect tenses in German and English, for the aorist in other languages). Further a characterization of tense meanings by a scheme like Reichenbach's is necessary, including the in-troduction of the time of speech L °.","On this basis rules for tense-assignment may be formulated expressing whioh tenses (= meanings) a phase xP or a phase-set P can be assigned to. From the formal point of view tenses then look like very general adverbials, and it is rather easy to explain how tenses and adverbials fit together. Tenseassignments create new expressions in addition to those used above. It is im-portant that the position of the phases of (R> does not depend on the tense R is used with: The tense selects some of these phases by phase-operators. So alt(NEX(xP,L°)) • ~U ° is the basic condition for the actual Present (of. (G)). 9. TEMPORAL CONJUNCTIONS","For some temporal conjunctions there are two basic variants, the \"particular\" usage and the \"iterative\" usage. We illustrate this phenomenon for when:","(N) whenl (particular usage of when): WHENI(RI,R2): (for \"RI, when R2\")"]},{"title":"alt(NEX((~2>,(~1~ )) * ~u °.","paragraphs":["(17) When John went to the librar~ he found 10 ~. (Once t when ... ) In (17) there is a reference to a single T-phase of (RI> and a single T-phase of (R2). One can show that the truth condition for when I is equivalent to 3x SyCaltCNEXCx(R2),YCRI>)) * ~U °) , but this form is avoidable (cf. (H) and the end of 5.).","(0) when2(iterative usage of when): WHEN2RI,R2): (for \"RI, when R2\") (18) When John went to the library.","he took the bus. (Whenever ... ) In (18) something is said about all T-phases of (R2~ , namely Vx 3y(alt(NEX(x(R2~ ,y(R~ ) * NuO) , which is equivalent to the truth condition for when 2.","Conjunctions like while, as lon~ as etc. are represented in a similar way with the phase-operator PER (cf. (F)). For the conjunctions after, before, since and till one needs in addition an ANTE- and a POST-operator, which are tense-dependent (the main difference is caused by imperfective vs. perfective) and modify the arguments of the phase-operators. Some of the conjunctions have both basic variants, whereas since admits no iterative usage. - 203 - The meaning of since is expressed by","(P) since: (only particular usage) SINCE(Rfl,R2): (for \"Rfl, since R2\")"]},{"title":"alt(P~(PosT((~2)), (RI)~ ~ ~u °,","paragraphs":["and the truth condition for afterq is (Q) afterq (particular usage of after)s","AFTERI(Rq,R2): (for \"Rq, after R2\")"]},{"title":"alt(PER((RI~ ,POST((R2)))) , ~U °","paragraphs":["It turns out that an analysis of temporal conjunctions based only on the Reichenbach scheme causes some difficulties. It works very well for when and while (cf. Hornstein 1977) and the German equivalents (als/wenn, w~hrend and solam~e), but for the remaining cases ANTE- and POST-operations seem to be inivitable. qO . AN F~iPIRI CAL CONFIP~IATION","By combining the rules for te~se-as-sig~ment and the truth conditions for the temporal conjunctions (in German there are seven basic types) and by allowing for some res~rictiomsfor their use (e. g. als only for Past, seit not for Future) one gets for each conjunction a prediction about the possible combinations of tenses in the matrix and the temporal clause.","Gelhaus (q97@) has published statistical data about the distributions of tenses in the matrix and the temporal clause for German. From the huge L!MAScorpus the took all instances of the use of temporal conjunctions. From my calculus one cannot obtain statistics, of course, it decides only on \"correcthess\". The comparlsion proved that there is an almost complete coincidence. The combinations for als/wenn cannot be derived, if one takes OOC instead of NEX in (N) and (O). The same seems to be the case for when. The restrictions for the propositions R I and R 2 (e. g. [+FINIT]), given by Wunderlich (1970), can be deduced from the truth conditions (details about both questions in (Kunze (1987)). REFERENCES","Allen, James P.. 1984 Towards a General Theory of Action and Time. Artificial Intelli~ence 23 (1984): 123-154.","Aqvist, Lennart, Guenthner, Franz.1978 Fundamentals of a Theory of Verb As-pect and Events within the setting of an Improved Tense Logic. In: Studies in Formal Semantics (North-Holland Linguistic Series 35), North-Holland: 167-199.","Gelhaus, Hermann. 1974 Untersuchungen zur consecutio temporum im Deutschen. In: Studien zum Tempus~ebrauch im Deutsche_.__~n (¥orechungsberichte des Instiruts ~ deutsche Sprache, Nr. 15). Verlag Gunter Narr, TUbingen: 1-127.","Hornstein, Norbert.1977 Towards a Theory of Tense. Linguistic Inuuir~ ~ (3): 521-557.","Kunze, JUrgen.1987 Phasen, Zeitrelationen und zeitbezogene Inferenzen. In: Kunze,J. Ed., Problems der Selektion un~ Semantik (Studia Grammatica 28) Akademie-Verlag, Berlin: 8-154.","Prior, Arthur N.1967 Past, Present, Future. Clarendon Press, Oxford, U.K.","Vendler, Zeno.1967 Linguistics in Philosop~y. Cornell University Press, Ithaca, New York.","Wunderlich, Dieter.1970 TemDus und Zeitreferenz im Deutschen. Linguistische Reihe 5, MtLuchen."]},{"title":"204","paragraphs":[]}]}