{"sections":[{"title":"19th Annual Meeting of the Association for Computational Linguistics Proceedings of the Conference 29 June--1 July 1981 Stanford University Stanford, California, USA Published by the Association for Computational Linguistics © 1981, Association for Computational Linguistics Order copies of this and other ACL proceedings from: Donald E. Walker (ACL) Bell Communications Research 445 South Street MRE 2A379 Morristown, NJ 07960-1961, USA","paragraphs":["PREFACE This volume is the official record of the proceedings of the 19th Annual Meeting of the Association for Computational Linguistics, held on the campus of Stanford University, from June 29 to July i, 1981. It contains both the refereed papers presented at the meeting and the position statements of the participants to the two invited panels, the first on the evaluation of natural language interfaces to databases, and the second on parsing. The conference is the result of the efforts of many individuals and institutions, all of whom get my thanks and those of the Association. The program committee consisted of Chip Bruce, Jaime Carbonell, Mitch Marcus, Ellen Prince, Ralph Weischedel, and myself. Jane Robinson and Norman Sondheimer organized the panels. Norman also oversaw the production of these proceedings. Jerry Kaplan handled the local arrangements. Don Walker produced the Call for Papers and the Advanced Program, and was always available to make sure the rest of us didn't forget what to do next. I could never have undertaken to be program chairman without the support I received from my hosts, SRI International and Bolt Beranek and Newman, Inc., while I was on sabbatical from the University of Toronto. My special thanks go to Jane Perry of SRI and Beverly Tobiason of BBN for their secretarial assistance. Financial assistance came from several sources. SRI International produced the Call for Papers and the Advanced Program. Bolt Beranek and Newman provided secretarial support to the program committee. Sperry Univac produced the proceedings. The Department of Computer Science at Stanford provided support for the local arrangements. Most importantly, thanks to all who took the time to write and submit papers. Particular thanks go to those whose submissions could not be accommodated in our limited schedule. Finally, thanks to those who in these days of soaring transportation costs attended the meeting. You make it all worthwhile. C. Raymond Per fault Program Chairman i TABLE OF CONTENTS Session I","A Practical Comparison of Parsing Strategies Jonathan Slocum ..................................................................... 1","Computational Complexity and Lexical Functional Grammar Robert C. Berwick ................................................................... ?","Chart Parsing and Rule Schemata in PSG Henry Thompson ...................................................................... 167","Corepresentational Grammar and Parsing English Comparatives Karen Ryan .......................................................................... 13","Performance Comparison of Component Algorithms for Phonemiclzation of Orthography Jared Bernstein and Larry Nessly .................................................... 19","PHONY: A Heuristic Phonological Analyzer Lee A. Becket ....................................................................... 23 Session II Panel: Evaluation of Natural Language Interfaces to Database Systems Norman K. Sondheimer, Chair ........................................................... 29 J. Norwood Crout ....................................................................... 31 William C. Mann ....................................................................... 33 So R. Petrick ......................................................................... 35 Earl D. Sacerdoti ..................................................................... *** Harry Tennant ......................................................................... 37 Bozena Henisz Thompson ................................................................ 39 Session III","Two Discourse Generators William C. Mann ..................................................................... 43","A Grammar and a Lexicon for a Text-Productlon System Christian M.I.M. Matthiessen ........................................................ 49","Language Production: the Source of the Dictionary David D. McDonald ................................................................... 57 Session IV L","Analogies in Spontaneous Discourse Rachel Re ichman ..................................................................... 63","Investigation of ProceSsing Strategies for the Structural Analysis of Arguments Robin Cohen ......................................................................... 71","What's Necessary to Hide?: Modeling ~tion Verbs James F. Allen ......................................... ............................. 77","A Rule-based Conversation Participant Robert E. Frederking ................................................................ 83","Search and Inference Strategies in Pronoun Resolution: An E~erimental Study Kate Eh rlich ........................................................................ 89 il Session V Panel: Perspectives on Parsing Issues Jane J. Robinson, Chair ............................................................... 95 Robert J. Bobrow and Bonnie L. Webber ................................................. 97 Ralph D. Grishman ..................................................................... i01 Ronald M. Kaplan ...................................................................... 103 Martin Kay ............................................................................ *** Mitchell M. Marcus .................................................................... *** Christopher K. Riesbeck .................................. . ............................ 105 Session VI","Presupposition and Implicature in Model-Theoretic Pragmatics Douglas B. Moran .................................................................... 107","Some Computational Aspects of Situation Semantics Jon Barwise ......................................................................... 109","A Situation Semantics Approach to the Analysis of Speech Acts David Andreoff Evans ................................................................ ll3","Problems in Logical Form Robert C. Moore ..................................................................... 117","A Case for Rule-Driven Semantic Processing Mar tha Palmer ....................................................................... 125","A Taxonomy for English Nouns and Verbs Robert A. Amsler .................................................................... 133 Session Vli","Interpreting Natural Language Database Updates S. Jerrold Kaplan and Jim Davidson .................................................. 139","Dynamic Strategy Selection in Flexible Parsing Jaime G. Carbonell and Philip J. Hayes .............................................. 143","A Construction-Specific Approach to Focused Interaction in Flexible Parsing Philip J. Hayes ..................................................................... 149","Controlled Transformational Sentence Generation Madeleine Bates and Robert Ingria ................................................... 153","Transportable Natural-Language Interfaces to Databases Gary G. Hendrix and William H. Lewis ................................................ 159 *** Paper not received at time of publication iii"]}]}