{"sections":[{"title":"","paragraphs":["variables eL categories grarnmatlcales dans un modele Arlane","paper submitted for COTING 86","Bonn by Jean-Phlllppe GUII_BAUD","GETA, BP 68","Unlversit~ Scfenttfique et M~dtca]e de Grenoble 38402 Salnt-Martin-d'H~res, FRANCE ( Aprll 1986) BES#ME .].I.,.LES VARIABL.ES DANS L!~_SI=[.SOIJRCE","Toutes les categories grarnnatlcales utllls~.es daes un mod@le (Je traductlon Ariane sont formalls6es et eod~es de facon mn~monique en tant que variables et valeurs de variables. L'ensemble des variables d'un module donn(; constltue le vocabulatre du m6talangage qui permet de d#.crlre la langue source et la langue clble de ce mod61e.","La structure de donn6es du systCme est une arborescence dolt chaque noeud porte une d~coratlon. Les d~corat tons cont lennen t les var 1ables d~.c l aries pour le syst~'m/e et affect6es de certalnes valeurs. Les variables apparalssent ~galement darts les grmnnalres d'analyse, (Je traesfert et de g~n~ration, dans les dictlonnalre.'; monollngues d'analyse ou de g~n@ratlon et blllngues de transfert lexlcal, alnsl que dans les sp~ct ficat tons de mod~le lingutst tque (gran~a t res statlques). M_O T$__CI_EJ: S","La structure llngulstlque interface (SLI) de la langue source est une arborescence d~cor~e qut rend compte de la structure de chacune des phrases de l'~nonc~ ~ traduire. Sa g~om~trie d~flnlt Lie parenthesage de groupes, tandls que ]es var'lables refl~tent ]a s~mantlque de ce parenth~sage. 1. _STRpCTURE SYN]-AXIQUE _DE SURFACE","La variable <classe syntagmatlque> attrlbue un nora chacun des groupes iltlbriqu~s de la structure (groupe nominal, groupe adjectival, subordonn@e infinitive, etc. ).","La variable <fonctlon syntaxique> sert & indlquer le r~le syntax ique de chaque groupe (suJet, objet, attribut du suJet, attribut de l'objet, etc.) par rapport au noyau de cr; groupe (gouverneur) , et & Identlfler ce dernier.","Variables, valeurs de variables, untt~ lexicale, l emme, mot, ar bor'escence, d~cor at ion, gran~]a 1 re stat lque, analyse morpholog lque (AM), analyse structurale (AS), transfert iexlcal (TI.), g~n~.ratlon syntaxlque (GS), g~nerat Ion mor phol ogl que (GM), structure lingulstlque Interface (SLI), source, cible. _~, J.NTR_QqUCS:(DN","Chaque concept grarnnat 1 ca l est une classe qui regroupe ue certain hombre d'#.l~ments possibles. Le llngulste est llbre d'or£1anlser ses classes comnle 11 l'entend et de donner l'lnterpr~tatloo qu'll veut aux dlverses combinatsons d'61~ments. Par e×emple Genre ( masculln, f~mlnln, neutre ), Nombre ( sleguller, plurlel ), Relation ( hypotaxe, parataxe, prostaxe ), Element loglque ( th~me, rhyme, ph~me ), bomalne (gen~ral, mCdecine, aviation ), sous forme cod6e, reoolvent un nora et un ensemle de valeurs, / Ibrement choisls par le 1 lngulste, par e x emp 1 e : GNR(m, P, n) ; NBR(sln,plu) ; RELAT(hypo, par a,pro) ; CLOG( th, rh, ph ) ; OOMA 1NE (gen, med, av 1 on ).","A titre d'exemple, dans le cas du hombre, on peut d6slgner la classe, un de ses 616meets, ou aucun d'eux NBR(sin,plu) ; NBR(piu) ; NBR( ~ ).","Lorsqu'on a 6tabl I la liste du vocabulalre du m6t al angage d e description d'une 1 angue, ll est possible de d~flnlr des conventions d'lnterpr(~tatlon, par exemple : A(1,2) ==> 1 et 2; B(X,Y) ==> X ou Y;","- P(T,G) ==> NBR( ~ ). 2_= 5]LI_tMC!_.U.R_.E__ S'YNTAX!QUF= GE TRANSFER-r.","Cette structure constltue ie \"nlveau proforld\" qut demeure Inchangc s de la langue source A la langue clble, & cette restriction pr@s que certalnes inversions darts la num6rot at Ion des arcjunlen t s peuvent devoir\" 6tre eFfectu~es pour' la cible.","La variable <relation logique> permet d'identifier en les num~rotant les arguments de tous les gouverneurs de groupe pr6dicatifs. La num6rotatlon est lnvarlante par rapport & la classe syntagmatlque et la fonctlon synta×ique des groupes.","La variable <relation s~_man t t que> per'met de sp#cifler la nature s6mantlque des relatlons loglques atnsi que la fonct ion s~mant 1que des groupes non-arguments. <relation loglque> et <relat 1on s~mantique> forment un tout.","Les quatr'e variables pr~sent~es cl-dessus se compl~tent et rendent compte de trois nlveaux d'lnterpr~tatlon au moyen d'une seule g~omCtrie: La SLI est en queique sorte une structure g~n~ratrice de trois structures dl f£6rentes. 3. R EP]IESE_NTA!ION LEXICALE","La repr6sentatlon lexlcale des mots et tournures des phrases se fatt trols niveau:","La variable UL (unlt~ iexlcale) permet de d~slgl)er une classe particuli~re de lelrtaes qul renvoient au meme concept ou archtlex6me de rEf6rence et d6rlvent les uns des autres. Pal\" exemple, UL(construlre) pourra designer les lemmes : construire, construct Ion, constructeur, construct lble, construct ibl 1 1 t6, construct If, construct tvl t~; et UL(manger) , les lee'ones : manger, mangeur, come s t I b ] e, comes t I b I I i t 6.","Ci~aque Ul_ possede till letn;~e partlculler & partir duquel on d6rive tous les autres. On l'appelle lenlne origlne et ll sert & d~noter I'UL.","Les var lables de <cat6gor le> et de <der tvat ion> permet tent ensul te de d6noter n' tmporte quel sous-ensembie de lelTl~es."]},{"title":"405","paragraphs":["4."]},{"title":"ACTUALISATI~H~E","paragraphs":["Les variables d'actuallsatton morphologique telles que <nombr e>, <genre>, <personne>, < temps>, <mode>, etc, d@crivent avec pn@clslon le mot du ]elfrne trouv@ dans le texte. Par exemple: Ul(construire) <cat@gorie>(nom) <d@rivation>(verbe vers le nom d'agent) <genre>(masculln) <nombre>(pluriel) est une racer de repr@senter le mot ~~teurs."]},{"title":"5~TUALISATII~N_SYNTA~","paragraphs":["Les variables d'actuallsatlon syntaxlque d¢crivent le type d'@nonclatlon de la phrase (tnterrogatlf, exclamatlf, conditionnel, etc) ) et sa r@alisation verbale (passif, actif, prognesslf, etc.). llI. LES VARIABLES BANS LE DICTIONNAIRE._D'ANALYSE","Dans le syst@me Ariane les dlctlonnalres d'analyse ne sent ouverts qu'ulle seule tints: pendant l'analyse morphoioglque. Leur fonotlon est double, permettre le d@coupage des mots en AM et assigner aux mots toutes les 1nformatlons utlles au ben d@roulement de I'AS.","Ces dictlonnalres sent des dictionnalres de morphes. Certains contlennent des bases lexlcales, d'autres divers affixes flexlonnels et d@rivatlonnels.","Les variables dans les dlctlonnalres tnforment d'une part sur la r@f@rence lexicale, les paradlgmes de flexion, d@rlvation et conjugalson, d'autre part sur les propr1@t@s dlstributionnelles du point de vue de la puissance et de la valence. Les varlables paradlgmatlques permettent d'analyser correctement chaque mot du texte en vue d'Identlfler 1el#he et UL de r6f@rence. Les variables dlstributlonnelles permettront au moment de 1'analyse structurale ult@rleure d'op@rer les bees parentll~sages de groupes.","Valence et Puissance sent g@n@ralement exprimCes par des valeurs de - cat6gorle morbhosyntaxlque ou syntagmatlaue; -","cas de d@cltnalson nomlnale (accusatlf, etc.); - br@positlons r@gies; -","traits s@manttques.","Caract@rlsatlon et distribution s@mantiques des lex@mes connalssent les llmltes qui sent celles de la s~mantique de traits. En g@n@ral, on utilise Lie nombre restrelnt de tralts, afln d'@vlter le danger toujours l~alnent des contradictions et lncoh@rences. I1 s'aglt unlquement de completer les traits grammaticaux sl ceux-cl s'av@rent par trop lnsufftsants. On n'ignore pas, par exemple, que tout ce qut rel@ve du concret peut servlr A formuler de l'abstrait et que route abstraction peut devenir r@allt6 d@signable: il y a des ~changes permanents entre le rhyme et le th~me (cf. Zemb). Pour ne parler que de l'opposltion eoncret-abstralt...","- des caract6rlstlques de la gral~alre de la langue\" clble, qul ne sent @vldemment pas celles de la grarrmalre de la langue, source.","Alnsl, on flxe la valeur de fonctlon syntaxlque et ceile de classe syntagmatlque d'un groupe & partir de sa valeur de relatlon loglque et des variables dlstrtbutlonnelles port@es par le gouverneur du groupe dent 11 d@pend. Pour citer un exemple de transformation effectu6e sur la SLI ctble pendant le trattement GS.","En fln de GS tout a @t~ v~rlfi@ ou recalcul~. Les feullles de l'arbre qul portent une r@f@rence lexlcale sent dans le ben ordre (celul des mots de la phrase) et affect@es des bonnes valeurs de cat@gorle, de d@rlvatlon et d'actuallsatlon morphologlque, de sorte que l'automate de g~n~ration morphologique peut produire les mots du texte tradult en deux @tapes=","- calculer la base lexlcale du ben leone de I'UL;","- calculer les affixes qul font le ben mot du len~ne de I'UL."]},{"title":"V~_L~&","paragraphs":["VARIABLES BANS LE DICTIONNAIRE DE TRANSFERT gE.XlCA~","En TL, 11 y a tout d'abord mlse en correspondance d'une llste de valeurs d'ULs sources avec une llste de valeurs d'ULs ctbles. Chaque UL cible est aceompagn6e d'un ensemble de valeurs de variables relatlves & sa distribution syntaxique. Ce sent ces nouvelles propri@t@s dlstrlbutionnelles qui seront & la base du calcul, darts ]a SLI clble, des cat@gorte syntagmatlques et fonctions syntaxiques des ~ventuels groupes dependants.","Les conditions de cholx entre plusleurs cibles pour une source sent libellees & l'aide de valeuns de variables: celles qui sent contenues dans les d@corations de la SLI source. II est rare qu'une valeur d'UL source suffise & elle seule pour d@termlner l'6qulvalent clble. Tr~s souveet tl faut tester la dlstrlbutlon effective et parfols m&me l'actualisatioe. V.I~_LES _VARIIABLES DA~S LE DICTIONNAIRE_DE GM","Les dtctlonnalres de GM sent des dlctlonnalres monollngues qul contlennent la llste exhaustive des morphes constltutifs des mots de la clble. Comme en AM, tl y a des dictlonnatres de bases lexlcales et des dlctlonnaires d'afflxes grammatlcaux.","Chaque article de dletionnalre est une valeur ou un ensemble de valeurs de variables auquel est affect@ LIIq morphe (une cha~ne de caract@res) et 6ventuellement des valeLirs de variables paradtgmatiques qui permettent, pour un morphe le×ical, de trouver prefixe, suffixe et/ou d@sinence, dans un dlctlonnalre d'affflxes, en fonctlon des valeurs de variables d@rlvationnelles et d'actuallsation issues de GS.","A l'lnverse de I'AM nO l'on va des morphes de la langue vers les valeurs de variables par le blais de dlctionnalres et de grammaires, la GM va des variables aux morphes de la langue par l'lnterm~dialre de dictlonnaires et d'une grarrrnatre. IV. LES VARI&BLES~_.LA S~IBLE","La structure interface cible est l'entr@e du processus de g@n@ratton syntaxlque de la langue clble. Elle va @tre transform@e progressivement jusqu'& obtenir la structure de surface des phrases du texte traduit.","La SLI clble est l'image de la SLI source. Les variables contenues dans ses d@coratlons sent la traductlon en ctble du vocabulaire du m@talangage de description de la source. Les r@f@rences lexlcales sent nouvelles, le nlveau profond des relations loglques et s@mantlques restant inchang@. Les niveaux moins ~rofonds ont @t@ automatlquement tradults, mals dolvent etre tous recalcul@s et r@aJustCs en fonctlon des nouvelles proprl@t6s distrlbutlonnelles des nouvelles ULs issues du transfert lexlcal; VI I , VARIABLES DYNAMIOUES_VS VARIABLES STATIO~ES","On appelle variables dynamiques eelles d'un mod~le ex@cutable en Ariane. Les variables statldues sent celles que l'on uttllse dans les grm~aires statiques.","Les sp@clflcations lingulstlques d'un modele se font au moyen de gran~aires statiques. Ces grammaires d~crlvent les langues source et clble d'un mod@le en utilisant une autre structure de donn~es que le syst~me Artane mais utilisent la m6me notation, sous forme de variables, des cat@gories gra~aticales. Elles restent lndependantes de toute strat@gie d'approche dynamlque (strat@gie d'analyse ou de g@n@ration).","Avant meme que d'@crlre de telles grarnmaires, on dresse la ltste de toutes les notions utlles & la descrlptlon de la langue dent on veut falre l'analyse oU la synth@se. Elles sent ensuite cod6es sous forme de variables et de valeurs de variables."]},{"title":"406","paragraphs":["V I I I .~ELQUI-ZS VAR!AB~ DEL' ALLEMAND","Les variables de l~allemand couvrent l'ensemble des notions llngulstlques relatives","- aux cat~gories morphosyntaxlques","- aux d6rlvatlons morphosyntaxlques","- aux cas de flexion - & l'actuallsation morphologlque - & l'actuallsatlon syntaxlque - au degr~ de l'adJectif","- aux pr'opri~t~s syntaxiques","- aux propri~t~s s@mantiques","- A la distribution syntaxtque et s~mantlque - aux classes syntagmatiques","- et aux fonctions syntaxlques. J ~LE~pARILIE$ DU D._$_S COU R=S E NALL~E- MAN D","Dans le module allemand, on d~crlt les parties du discours & l'aide d'une variable de cat~gorle et plusleurs variables de sous-cat~gorles.","L'ensemble des valeurs ne constltue pas un tout homog6ne, pas plus que les parties du dlscours n'en font un darts la plupart des gra~natres des langues du monde. Les crit#res de distinction peuvent 6tre d'ordre morphologlque, syntaxlqLle, s~mantlque ou logtque, et darts tous lee cas calqu~s sur la plupart des gralnnaires tradltionnelles.","On a Jug6 utile d'aJouter & la llste tradltlonnelle los valeurs de prCdicateur (ces \"adverbes de phrase\" dont la fonctlon est d'Etabltr ]a llalson entre th~me et rhyme - cf Zemb (1978)); - stgne d'~dltion;","- £orme non-alphabEtlque (pour les ~qLlatlons math&matiques et autres formules chlmlques); de r~f~rence (de pl~ces d~tachCes, par exemple).","I_a sous-cat~gorlsation de l'adJolnt (adJectlf ou adverbe} est r~alis~e en fonction de la puissance de ce dernler: un adJolnt peut d~termlner","- un verbe attributif;","- un verbe non-attrlbutlf~","- un","nom;","- un autre adJolnt;","- un sous-ensemble quelconoue des puissances pr6c~dentes.","Toute d6sinence d'arttcle ou d'adJectif n'est forte ou falble que par rapport & certalns cas. Un substantlf au plurlel est touJours fort. Un substantlf au stnguller ne l'est que s'll relCve du non--dlscret.","Bans la gral~alre d'analyse, on falt pr~valolr les rOgles sutvantes: - FORT + FORT -=> FORT; - FORT + FAIBLE --> FORT; - FAIBLE + FORT --> FAIBLE; - FAIBLE + FAIBLE --> FAIBLE.","Une suite coh~rente nomlnale dott avolr une r6sultante forte et l'intersectlon des valeurs potties par ses ~16ments ne dolt pas ~tre vide.","Les valences d'un lexome sent exprim~es au moyen de trois variables princlpa]es (VALO, VAL1, VAL2) : Elles sp~clflent le type syntagmatlque des arguments 0,1 et 2 extg6s par ce lex~me. Un argulnent peut ~tre - un groupe nominal; - un groupe pr6posl t lonnel ; - une subordonn~e compl6tlve; - une infinitive; - ou une interrogative lndlrecte.","SI ]'argument est un groupe nominal (pr6posltlonnel ou non) les variables de valence Indlquent le cas (et la pr#position) r@gie.","Exemple: BEMALEN -> VALI(GN), VAL2(GP), GNI(ACC), GP2(MIT). BIBLIQGRAPHIE CHAPPUY, S ZEMB, VAUOUOIS, STAHL, • (1983). Formalisatlon de la description des niveaux d'lnterpr6tatlon des langues naturelles. Etude men&e en vue de L'analyse et de la g6n6ration au moyen de . transducteurs. ThOse de 36me cycle, INPG Grenoble. J.-M. {1978). Verglelchende Grar~natlk Franzoslsch-Deutsch Tell 1. Mannheim: Blbllographisches Instltut. Ouden-Sonderrelhe verglelchende Gra~natik~ Bd 1. B. et CIIAPPUY £. (1985). Static Gran~ars: a formalism for the description off linguistic modeIs. Proceedings of the Conference on Theoretical and Methodological issues in Machine Translation of Natural Languages, Colgate Unlverslty, tlamtlton, NY, USA, August 14-16, 1986.","G. (1984). L'analyse syntaxlque automatlque de l'allemand. CNRS, Paris. 2~L'F.~XPRES$ION D_E L A SUIT_ E FLEX_IONNELLE_COHER.E_N__TE La coh6rence d'une suite flexlonnelle telle que diE grossEN TtePE s'exprlme par rapport au cas, au genre gral~natlcal, au hombre et au type de d~eltnalson (fort/falble). Etant donn~ que ces catQgorles sent ll~es darts toute suite flexlonnelle, on a d~cld~ de er6er les 8 variables suivantes: - cas slnguller masculln fort; - cas Slllguller masculln fatble; - cas stngulter £~mintn fort; -","cas slngulter f6mtnln £alble; -- cas slngulier neutre fort; -","cas slngulter neutre fatble; - cas plurlel fort; -","cas plurlel falble. qul prennent toutes leur valeur darts l'ensemble unique (nomlnatlf,aecusatlf,datlf,genltlf). -0-0-0-0--0-0-0-0-"]},{"title":"407","paragraphs":[]}]}