{"sections":[{"title":"","paragraphs":["RESUME Johannes Meyer-lngwersen 2 HAMBURG 13 Von Melle Park 6 Orientalisches Seminar ANALYSE DE PROPOSITIONS ALLEMANDES .................................. (Procedures sp~ciales apr~s avoir trouv~ la racine du verbe /geh-/) Le sujet de ma communication est : procedures d'un programme d'analyse de propositions allemandes ~ ex~cuter apr~s avoir trouv~ la racine du verbe /geh-/ dans une proposition. a) Le programme g~n~ral :","Le programme d'analyse~ dont nous allons d~finir ici une partie, fait partie d'un programme de traduction automatique de l'allemand en d'autres langues choisies ~ volont~. Nous prendrons pour base une forme du programme id~alis~e, qui sans consideration de la capacit~'limit~e de l'ordinateur explique toutes les differences des constructions allemandes entre elles. De cette mani~re on dolt regarder les propositions : Seine Worte + gehen + in dieselbe Richtung Herr ~dller + geht + in dieselbe Richtung comme constructions tout ~ fait diff~rentes, parce que le ehoix du sujet leur donne une signification diff~rente. En appliquant ce programme d'analyse au but d'une traduction automatique en une langue concrete, on peut renoncer ~ marquer les differences dans tousles cas o~ les constructions de la \"langue-but\" sont parall~les aux constructions de l'allemand, par exemple : mais : die Ware + geht + gut tovar' + idet + xoro~o the article + sells + well la marchandise + se vend + bien","Le programme dtanalyse consiste en plusieurs groupes de procedures, et chaque groupe est appliqu~ au texte entier, c'est-~-dire qu'on ne traduit pas proposition par proposition. Les groupes de procedures sont : (I) reconnaissance des mots isol~s","ddcomposltlon en lex~mes et foncteurs grauanaticaux","chiffrage des lex~mes et fonsteurs par des nombres. Le code des lex~mes consiste en un chiffre pour la classe du mot,","et quelques autres chiffres, qui marquent le caract~re syntactique et s~mantique","du mot. -i-","(2) lffterpr~tation des foncteurs comme categories granmmticales (cas, nombre, temps, etc.), autant que le permet la pure morphologie.","(3) reconnaissance de la relation des ~l~men~s pronom~naux aux phrases nominales pr~c~dentes.","(4) reconnaissance des adverbes presque toujours ind~pendants du verbe. (cette categoric comprend aussi adverbes locaux et temporaux, voir"]},{"title":"(5))","paragraphs":["(5) Consideration des verbes finis : le verbe fini, peut il ~tre compI~t~ par un adverbe local ou temporal.? Par exemple : Ich warte eine Stunde Die Arbeit dauert einen Tag Ich lebe in London Dans ce cas : prendre en consideration les adverbes trouv~s sous (4).","(6) d~finition de la construction predicative de la proposition l'aide d'une liste de constructions pr~dicatives de l'allemand, ~tablie selon les racines verbales. b) La partie du programme communiqu~e ici :","Ma co=:nunication concerne la 6~me partie du programme pour le cas o~ la racine du verbe /geh-/ se trouve ~tre part du verbe fini. Cette partie du programme consiste en les operations suivantes :","(i) Recherche du pr~verbe devant la racine ver~ale ou ~ la fin de la proposi~on. Le pr~verbe sera chiffr~ par un chiffre g~n~ral du pr~verbe et un nombre courant pour le pr~verbe special.","(2) Recherche des ~l~ments ressemblants aux pr~verbes, mais sp~ciaux pour le verbe /geh-/, comme : (adjectifs) (autres) konform entzwei Kaputt irre wund fehl schwanger hopps fremd zuende ~ssig vonstatten verloren auseinander verlustig fHrbass auf und ab auf und davon aug und her ...°...",".... L'~l~ment pr~verbal sera chiffr~ par un chiffre g~n~ral de l'~l~ment pr~verbal et un nombre courant pour i' ~l~ment pr~verbal special. -2-","(3) (Pattie commune pour :'","propositions ~ /geh- /","/pr~v//geh- /","/el I~r4v//geh- / et aussi pour d'autres verbes) D~finition des phrases nominales et pronomin~les selon leurs fon6teurs grammaticaux. On y trouvera des phrases nominales ~ tous les quatre cas'purs, et d'autres avec les pr4positions suivantes : ~is, an, auf, aus, bei, his, his auf, bis an, ..., dutch,","entlang, gegen, gen, in, mit, nach, Uber, urn, unter, yon, vor~ wider, zu. Cette d~finition selon les foncteurs grammaticaux ne suffit pas pour traduire les constructions par des constructions correspondantes~ Comparer par exemple les phrases nominales suivantes ; NP + K 3 nach + NP auf + NP auf +nombre auf + adjectif an + NP Er geht seiner WeRe Er geht festen Schrittes Er geht des Geldes ver!usting Er geht nach Paris Das geht nach Gunst Das verb geht nach der Re~el Er geht auf den Bau Er geht auf (den~ Zehenspitzen Er geht auf 80 Er geht auf arm Er geht an die Elbe Er geht mir an die Hand Er geht mir an den Kra~en Er geht am Stoc~ :C"]},{"title":"~/ % /","paragraphs":["Er geht an die Milch Dans cette partie de programme ies phrases nominales seront chiffr~es par un nombre compos~ de chiffre g4n4ral pour phrases nominales, chiffres sp~ciaux pour les foncteurs grammaticaux, et d'autres chiffres sp4ciaux pour les traits caract~ristiques syntactiques et s~mantiques des substantifs ou pronoms contenus dans les phrases nominales.","Apr~s l'ex4cution de la 3~me partie du~:~rogramme,les propositions sont rendues comme s~quences de nombres complexes qui repr~sentent phrases nominales diff~rentes, pr4verbes et racine verbale. Dans le programme d'anal~se ii y a une liste de toutes les s~quences possibles de cette/imani~re. -3-Cette liste est arrang~e, en succession hi4rarchique, selon les caract4ristiques suivantes : racine verbale; pr4verbe; foncteurs des phrases nominales, traits caract4ristiques syntactiques et s~mantiques des substantifs et pronoms. Chaque s4quence sera chiffr4e par","- un nombre courantj qui choisira la construction correspondante de la\"langue-but\" , dans une liste semblable.","- chiffres pour d4terminer la fonction des phrases nominales dans la construction (param~tres). -4-"]}]}