{"sections":[{"title":"Aspectual Requirements of Temporal Connectives: Evidence For A Two-Level Approach to Semantics","paragraphs":["Michael Herweg Universitiit Hamburg","FB lnformatik","AB Wissens- und Sprachverarbeitung","Bodenstedtstr. 16 D-2000 Hamburg 50","Germany","e-mail: herweg@rz, inf ormatik, uni-hamburg, dbp. de","Abstract This paper argues for a two-level theory of semantics as opposed to a one-level theory, based on the example of the system of temporal and durationM connectives. Instead of identifying the semantics of lexical items and larger constituents with conceptual structures, the two-level theory assumes that there is an intra-linguistic level of abstract semantic representations distinct from the extra-linguistic level of conceptual representations. It is argued that the two-level theory can give a more appropriate treatment of polysemy as well as a better account of the conditions under which connectives may (more or less) be felicitously combined with complement expressions which do not respect tile aspectual requirements of the connectives."]},{"title":"1 Semantic Representations and Conceptual Representations","paragraphs":["This paper addresses a specific question in the theory of natural language semantics with the example of a specific lexical domain. The question is whether one should opt for a one-level or a two-level theory of semantic interpretation. The lexical domain is the system of temporal and durational connectives such as after, before, while, when, as soon as, since, until and as long as (or rather their German equivalents).","The one-level theory, which is the predominant one in cognitive and computational linguistics, considers semantic representations to be part of the conceptual system. Syntactic representations are directly mapped onto conceptual structures, with no separate, intra-linguistic semantic level mediating between the two kinds of representation (see, e.g., [12] and many others). As a consequence, there is no distinction in principle between genuine linguistic knowledge about meanings and extra-linguistic, conceptually encoded knowledge.","The two-level theory of semantic interpretation (see, e.g., [3, 8, 13]) claims that the interpretation of a linguistic expression in a particular context of use involves the construction of a conceptual representation constrained by the semantic representation of the expression. Semantic and conceptual representations are distinct levels of mental representation which are governed by the principles of two separate cognitive modules, the systems of grammatical and conceptual knowledge, respectively. Semantic representations are structured configurations of semantic units which, on the one hand, are determined by the grammatical system of the language in question and, on the other hand, are grounded"]},{"title":"152","paragraphs":["in - or motivated by - the conceptual system. Semantic representations are abstract representations of meaning in that they are not identical with specific conceptual interpretations which an expression may have in a l~articular context of use. Instead, they constrain the range of possible conceptual interpretations which may be contextually assigned to an expression. They do so by fixing general, abstract conditions for admissible conceptual interpretations. Semantic representations are the unique level on which the principles of compositionality of meaning are operative.","Conceptual representations are structured configurations of conceptual units, which are mental representations of certain aspects of the external world. In the semantic interpretation of a linguistic expression in a given context of use, they serve as contextually specified representations of meaning. Being subject to the principles of the conceptual system, which mediates between various cognitive systems (visual, auditive, motoric, motivational, linguistic, ... ) and in itself consists of several subsystems, conceptual representations provide the level of integration of extra-linguistic, conceptually encoded knowledge in the course of the semantic interpretation of an expression. Thus, conceptual representations are the level on which non-compositional processes of interpretation take place.","The crucial question for a decision between the two competing views is whether or not there are generalizations and regularities concerning semantic structure which cannot be traced back to conditions of syntactic or conceptual structure. And indeed, experimental research in psycholinguistics suggests that, for example, delays in the production of the marked item as opposed to the production of the unmarked item of a pair of gradable adjectives"]},{"title":"(small","paragraphs":["vs."]},{"title":"big, short","paragraphs":["vs."]},{"title":"long)","paragraphs":["in describing relations between objects differing in size are due to features of the lexical items themselves and not to features of the conceptualization of the scene [14]. In particular, the markedness effect appears only in language production tasks but not in non-linguistic tasks, as opposed to a congruency effect (the retrieval of a particular concept may be inhibited by a competing activated concept), which could be observed both in linguistic and non-linguistic tasks. These findings argue for the need to distinguish between the complexity of the abstract semantic representations assigned to the lexical items in question and the complexity of the more concrete conceptual representation of a situation. Bierwisch (in [3]) proposes a general format for semantic representations of gradable adjectives within the two-level theory which meets these demands.","Once one accepts the need for distinguishing two levels of representation, i.e. a level of semantic representation subject to genuine linguistic knowledge and a level of conceptual representation subject to extra-linguistic knowledge, one may assume a theoretical perspective different from that adopted in various versions of the one-level theory with regard to a number of well-known problems in lexical semantics. Let me briefly indicate this new perspective with two examples: firstly, the interpretation of expressions which are semantically deviant from a purely compositional point of view without neccessarily being strictly unacceptable, and secondly, the treatment of polysemy. Each of these problems will be addressed in more detail below with regard to temporal connectives."]},{"title":"2 The Two-Level Perspective on Semantics","paragraphs":["First of all, the two-level approach can shed some light on a problem for which, in competing approaches, no theoretically satisfactory account has been given so far. The problem is the following. In general, we have rather clear criteria by which the compositional seman-"]},{"title":"153","paragraphs":["tics of an expression can be determined. However, actual discourse occasionally disregards compositional semantics to a certain extent: There may be combinations of expressions which are deviant from a semantic point of view without being strictly unacceptable. In a number of cases, these constructions can more or less easily be given a special interpretation shaped by the context. As a matter of fact, their semantic irregularity may often reveal itself only through a systematic study of the whole paradigm. Consider the following examples from the realm of the semantics of aspect, i.e. that part of semantics that primarily deals with the basic distinction between state expressions and event-type expressions. In each of these examples, there is a clash between the demands of the count adverbial and the aspect of the sentence the adverbial is applied to. Example (1.a) is taken from [1].","(1) a. ?John slept three times last night. b. ??John was healthy three times last night. c. *Three times, John did not write a paper on semantics last night. In each of these sentences, the count adverbial is applied to a sentence overtly describing a state, i.e. a situation which homogeneously holds for a certain period of time. Since state sentences, in contrast to event-type sentences such as John fell asleep, John regained his health and John wrote a paper on semantics, do not carry an internal criterion of individuation for the situations they describe, these cannot be counted straightforwardly. If a state holds homogeneously over a certain period of time, it also holds at all parts of that period; so on what grounds could we claim that a certain state held exactly three times last night? The presence of a count adverbial may, however, force one to implicitly supply an external criterion of individuation. From a logical point of view, the sentence in question is thereby treated on a par with event-type expressions. The count construction is then understood as specifying the numbcr of distinct maximum quantities of the state (cf. [10, 11]). The examples in (1) show that some sentences allow for such an adjustment of their interpretation to the requirements of their context more easily than others.","One popular strategy for treating examples such as (1) is to note that these phenomena exist, but, due to a lack of theoretical means to cope with them, to not further dwell on the subject. Another strategy is to assign less restrictive meanings to the expressions in question, so that the critical constructions turn out to be regular. The latter strategy has a number of drawbacks. In the first place, there is the borderline problem: It is hard -","if not impossible - to give a theoretically sound explanation of why specific cases such as (1.c) are really unacceptable. In the second place, reduced acceptability often comes in degrees, as is shown by (1.a) and (1.b). Ill the third place, the interpretation of the critical combinations always involve some amount of inferential effort, which can easily be acknowledged. Neither the second nor the third problem can be dealt with simply by allowing more combinations to be regular from a semantic point of view. As I will argue below, both call for an explanation in terms of extra-linguistic knowledge of and assumptions about features of types of situations. The two-level theory of interpretation claims that semantically deviant, though more or less interpretable, constructions always require a non-compositional reinterpretation of some expression. The need for such a reinterpretation follows directly from the semantic representations assigned to the respective expressions. However, the conditions under which certain reinterpretations can or cannot be performed are spelled out on the extra-linguistic, conceptual level. Consider the examples in (1). The difference between (1.a) and (1.b) is primarily based on a difference regarding what we are willing to assume about the lenght of periods of the respective"]},{"title":"154","paragraphs":["kinds of states. (1.a) does and (1.b) does not match our standard assumptions in this respect. When we try to assign an interpretation to (1.b), we have to perform quite a lot of additional reasoning about the person's state of health. However, even such effort can hardly help us to find a sensible interpretation for (1.c). Our knowledge about states such as the one described there gives us hardly any clue about what the situation which the sentence purports to describe to us might look like.","By providing us with a distinction between linguistic and extra-linguistic determinants in the interpretation of a linguistic expression in a particular context of use, the two-level theory yields a differentiated, modular theory of acceptability judgements with a clear distinction between semantically regular and irregular constructions on the one hand and conceptually interpretable (acceptable) and uninterpretable (unacceptable) constructions on the other hand. The requirements of temporal connectives regarding the aspect of the clauses they can combine with, which is a phenomenon in line with the one exemplified in (1), form a convincing case in favour of the two-level approach to semantics. This will be the subject of §3.","Furthermore, the two-level theory opens up a new perspective on the treatment of polysemy in different linguistic fields. This perspective diverges considerably from what has been suggested within the one-level approach, most notably in prototype semantics in the style of the Lakoff school. Instead of assigning a setof rather specific (though systematically connected) conceptual meanings to a polysemous expression, each of which incorporates a considerable amount of contextual information as well as assumptions about object types, situation types and so on, one may confine oneself to a unique, sufficiently abstract semantic representation, which constrains the range of admissible conceptual interpretations. The differentiation of particular conceptual interpretations in various contexts is carried out by a number of general conceptual operations, the choice of which depends on various kinds of extra-linguistic knowledge and assumptions as well as contextual features. This general idea has been applied to a number of polysemous expressions already. See, for example, Bierwisch [2] on nouns such as school and theatre, which can be used to refer to buildings, institutions, cultural achievements and collections of processes, depending on the particular context of use. Herweg [7] studies polysemous spatial prepositions such as in; Herweg [8] deals with polysemous temporal connectives. Lung [3] gives an extensive analysis of the semantics and conceptual interpretations of dimensional adjectives such as long, short, wide and narrow. Lung et al. [13] describe a computer model of the interpretation of dimensional adjectives implemented in the LILOG project of IBM Germany. The basis of this model is the two-level theory of interpretation with specific formats for semantic representations and for the representation of the relevant conceptual knowledge about spatial properties of objects.","In short, the two-level approach to polysemy claims in contrast to its competitors that the different readings of a polysemous lexical item in various contexts do not give rise to an abundance of semantic representations assigned to that expression. Rather, the various readings are differentiated on the conceptual level, where extra-linguistic knowledge about object types, situation types and so on may be assessed in the interpretation of an expression. In §4, I will illustrate the treatment of polysemy within the two-level theory with the example of temporal and non-temporal readings of the connective be/ore. 155"]},{"title":"3 Aspectual Requirements of Connectives","paragraphs":["By a number of tests, most temporal connectives can be shown to regularly accept only complement clauses of one particular aspect ill its whole range. This defines the aspectual requirements of the connectives as determined by their semantics. Nevertheless, one often encounters combinations of a connective with a clause which, though not fully regular from a semantic point of view, can easily be conceptually understood. However, these combinations vary considerably regarding their acceptability. Their conceptual interpretations always involve some amount of inferential effort in order to produce an aspectual reinterpretation of the complement expression. This reinterpretation serves to adjust the conceptual interpretation of the clause to the aspectual requirements of the connective. Obviously, this is essentially the same phenomenon we observed above (example (1)) with state sentences in the context of count adverbials.","In the underlying semantic theory of tense and aspect, I distinguish between expressions of two basic aspects: event-type expressions and state expressions; the latter include expressions about ongoing processes (cf. [5]). A sentence based on an event-type expression reports that a situation which is conceptually categorized as an individual event of the type in question occurs within a certain period of time. A sentence based on a state expression asserts that a situation which is conceptually categorized as a state holds homogeneously over a period of time. In both cases, the respective times are specified by the tenses and possibly the temporal adverbials of the sentences. As is well known from the literature (e.g. [4]), the aspect of a sentence can be determined by its combinatorial potential with respect to time span adverbials"]},{"title":"((with)in two hours)","paragraphs":["and durational adverbials"]},{"title":"(for two hours):","paragraphs":["Event-type expressions only combine with time span adverbials (and count adverbials, for that matter), but not with durational adverbials; for state expressions, it is just the other way around. By this test, which makes use of the inherent semantic properties of these kinds of adverbials, it can be shown that negation always produces a state expression. (Some putative counter-examples are discussed in [10]). The negated sentence either says that a negative state, i.e. the opposite of the mentioned state, holds over a certain period of time, or that there is no event of the respective type within that period. In either case, the sentence specifies a homogeneous property of the time in question. This will be relevant for the ensuing discussion (cf. (1.c) above). The following set of examples illustrates what has been said so far.","(2) [event-type expressions] a. Peter drank a bottle of wine in two hours. b. *Peter drank a bottle of wine for two hours.","(3) [state expressions] a. *Peter waited for a wine dclivery in two years. b. Peter waited for a wine delivery for two years.","(4) [negated event-type expressions] a. *In two years, Peter didn't drink a bottle of wine. b. For two years, Peter didn't drink a bottle of wine.","(5) [negated state expressions] a. *In two years, Peter didn't wait for a wine delivery. b. For two years, Peter didn't wait for a wine delivery. In addition to the two basic aspects, there is a third, derived aspect, namely the perfect aspect. The perfect aspect is the result of applying an operator to event-type expressions"]},{"title":"156","paragraphs":["which associates to an event of the type in question a potentially bounded consequent state proximal to that event. For further details about this theory of the aspects and its formal specification, the reader is referred to [8, 9, 10].","In the following, I will illustrate ~the aspectual requirements of temporal connectives, the criteria used to determine these properties of the lexical semantics of the connectives, the operations of reinterpretation and the conceptual conditions for these operations with some examples taken from the system of German connectives. German connectives show very interesting aspectual requirements, which in many cases are more restrictive than those shown by their English counterparts. For example,"]},{"title":"nachdem","paragraphs":["('after') does not merely require an event-type expression in its complement clause (see (6.a)), but more specifically a clause in the perfect aspect, i.e. an expression representing an event of a particular type plus a consequent state proximal to that event (see (6.b)). The relevant time of the event or state reported in the main clause (either the definite time of an event or some arbitrary time at which the state in question holds) is located within this consequent state. Note that the potentially bounded proximal consequent state plays a crucial role, i.e. more than a simple relation of temporal ordering is needed in the semantics of"]},{"title":"+nachdem","paragraphs":["(and, for that matter, in the semantics of English"]},{"title":"after).","paragraphs":["(6.b) could not describe a situation in which Peter sits down in his chair, gets up, moves to another place and only then reaches for the newspaper.","(6) a. ??Nachdem Peter sich in seinen Sessei setzte, griff er nach der Zeitung.","['after Peter sat down in his chair, he reached for the newspaper']","b. Nachdem Peter sich in seinen Sessel gesetzt hatte, griff er nach der Zeitung.","['after Peter had sat down in his chair, he reached for the newspaper'] Occasionally,"]},{"title":"nachdern","paragraphs":["is combined with a complement clause which, if taken on its own, has to be classified semantically as a state expression (see (7.a)). This combination must, however, be considered as semantically deviant, since"]},{"title":"nachdem","paragraphs":["does not combine freely with negated complement clauses (see (7.b), (7.c)). Since negation, irrespective of whether it is applied to a state expression (7.b) or an event-type expression (7.c), always produces a state expression, there should be no such restriction if the combination of"]},{"title":"nachdem","paragraphs":["with a state expression were fully regular from the point of view of compositional semantics.","(7) a. Nachdem Peter in seinem Sessel sal3, griff er nach der Zeitung.","['after Peter sat in his chair, he took tile newspaper']","b. *Nachdem Peter nicht in scinem Sessel sa6, griff er nach der Zeitung.","['after Peter did not sit ill his chair, he took tile newspaper']","c. *Nachdem Peter sich nicht in seinen Sessel setzte, griff er nach der Zeitung.","['after Peter did not sit down in his chair, he took the newspaper'] In assigning a conceptual interpretation to (7.a), the complement clause cannot be understood as reporting a state, but calls for a non-compositional reinterpretation which supplies a change-of-state event as the first argument of tile relation expressed by"]},{"title":"nachdem/after.","paragraphs":["The appropriate reinterpretation of (7.a) is the ingressive reinterpretation, which assigns to the state of Peter sitting in his chair the event of the state's ingression. Thereby, the conceptual interpretation of the state expression is adjusted to the arrangement of events and states characteristic for the perfect aspect: The state that holds when Peter sits in his chair is considered to be the consequent state of its own ingression, i.e. the state which results from a change-of state event of Peter sitting down and eventually comes to an end when Peter gets up again."]},{"title":"157","paragraphs":["With very few exceptions, the change-of-state interpretation is difficult to obtain for negated complement clauses, since the fact that something is not the case usually does not provide us with any significant temporal demarcation to which we can relate other events or states. It is therefore in general neccessary to assert explicitly that a change-of-state event has occurred. This can be done by means of mehr ['any more']:","(8) a. Nachdem Peter nicht mehr in seinem Sessel saS, griff er nach der Zeitung. ['after Peter did not sit in his chair any more, he reached for the newspaper']","b. ??Nachdem Peter sich nicht mehr in seinen Sessel setzte, griff er nach der Zeitung. ['after Peter did not sit down in his chair any more, he reached for the newspaper'] But even then, (8.b) is odd. The reason is that the corresponding positive clause does not describe a state, but an event. Thus, some additional reasoning is neccessary in order to obtain a state which held at some time in the past and then changed into the state that there is no event of Peter sitting down in his chair. If there is an interpretation for (8.b) at all, it is a habitual interpretation (which of course is a special kind of a state interpretation): Peter took the newspaper after he quit his habit of regularly sitting down in a particular chair of his - whatever this is supposed to tell us.","Can we, however, conclude from examples such as (7.a) that at least all positive state expressions are accepted by nachdem, even though they must get a special interpretation? This is not so, because not all positive state expressions allow for an ingressive reinterpretation. A state can be assigned an event representing its ingression only if there exists a previous phase of the opposite state. As an example, see (9), which cannot mean something like 'after becoming a young person (= at the time when he was young), Peter already played the piano like a virtuoso'.","(9) ??Nachdem Peter jung war, spielte er schon wie ein Virtuose Klavier. ['after Peter was young, he already played the piano like a virtuoso'] Although the state of a given person being young is of course a temporary state, it does not have a beginning in the sense of an event marking the ingression of the state (see also *he became young, *he is already young). There is no preceding state in which the person is not young. Before being young, the person simply did not exist, which means that the negative state expression cannot be applied to times prior to the person's lifetime. (By the same token, the state of a given person being old does not have an end in the sense of an event consisting in the state's egression.) This contrasts with (7.a): Before Peter sat down in his chair, he did not sit in his chair, i.e. the opposite of the state of Peter sitting in his chair obtained. Therefore, the complement clause in (7.a) does and the complement clause in (9) does not allow for all ingressive reinterpretation. This difference in acceptability cannot be traced to any difference between the state expressions Peter in seinem Sessel sitz- ['Peter sit- in his chair'] and Peterjung sei. ['Peter be- young'] regarding their semantic properties crucial in the context of temporal and aspectual interpretation; in other respects, these expressions show exactly the same relevant properties.","It is part of our conceptual knowledge about different kinds of states whether a state fits the sequences of negative and positive phases that characterize the ingressive event type (as well as other kinds of event types such as the egressive event type). A formal theory of the relevant properties of the conceptual domains of times, event types, events and"]},{"title":"158","paragraphs":["states (including processes), in which the conditions of different kinds of reinterpretations of state expressions can directly be expressed as conditions concerning the arrangement of phases of the states in question, has been developed in [8, 9, 10]). The theory contains two basic sorts of predicates and individuals: event-type predicates, which express heterogeneous properties of individual events, and state predicates, which express homogeneous properties of periods of time. In addition to standard propositional negation, there is a predicate negation restricted to state predicates. This allows one to distinguish between a proposition asserting that a positive state predicate does not hold at a given time, and the application of a negative state predicate to a time, where the latter is obtained by negating the corresponding positive predicate.","A system of operators establishes various kinds of connections between the two domains. There is, for example, an operator relating an event to a state consisting of the set of times which are temporally included in the time of occurrence of the event. This operator is intended to capture the (basic) meaning of the progressive aspect. On the other hand, there is an ingressive and an egressive operator. These operators map states onto the corresponding ingressive and egressive event types, respectively. Both operators can only be applied to a state if phases of the state are preceded or followed by phases of the corresponding negative state. Another operator worth mentioning maps states onto the so called 'pofective' event type. This event type characterizes events which consist in the occurrence of a maximum period at which the state obtains (as in Peter was at the beach twice this week; see also (1) above). In contrast to the ingressive and the egressive operator, the pofeetive operator does not require that a phase of the state is flanked by phases of the negative state. All that is required is that there are earlier and later times at which the state does not hold (in the sense of simple propositional negation). With these means, the formal system can capture tile difference between a state such as Peter being young, which, though being a temporary state, cannot be said to have a beginning, and states such as Peter sitting in Iris chair, which actually have a beginning. This is exactly what is needed in order to cope with the difference between (7.a) and (9).","Let us now turn to constructions involving a direction of reinterpretation opposite to that discussed so far. Take the following examples."]},{"title":"(io)","paragraphs":["a. Solange Peter in Hamburg war, lebte er bei seinen Eltern.","['as long as Peter was in Hamburg, he lived with his parents']","b. (?)Solange Peter Maria traf, lebte er bei seinen Eltern.","['as long as Peter was meeting (meet-PAST) Maria, he lived with his parents']","e. *Solange Peter Maria heiratete, lebte er bei seinen Eltern.","['as long as Peter married (marry-PAST) Maria, he lived with his parents'] Whereas the interpretation of (7.a) involves the transition from a state to a type of event systematically associated with that state, the interpretation of (10.b) requires that an event-type expression is conceptually reinterpreted as a state expression. The durational connective solange ('as long as') is semantically restricted to state expressions in the complement clause. Thus, (10.a) is grammatical. In (10.b), however, where solange is combined with an expression reporting the occurrence of an event (note that there is no Progressive form in German; (...) Peter Maria traf is an event expression), the complement clause cannot be interpreted straightforwardly but must again be reinterpreted. The preferred reinterpretation gives tile clause a habitual or iterative reading. By this, we obtain a (habitual or iterative) state, which eventually conforms with tile requirements of the connective. The complement clause of (10.c) does not - or at least not that easily - al-"]},{"title":"159","paragraphs":["low for this or any other kind of statal reinterpretation of the event expression. Therefore, (10.c) is irrevocably unacceptable.","One major advantage of the two-level theory of interpretation is that one can precisely locate the source of the difference in acceptability between (10.b) and (10.c) without having either to weaken the aspectual requirements of the connective or to alter the semantic classification of the complement expressions. The semantic part of the lexical entry of solange determines that this connective is restricted to state expressions as complements, and the clauses Peter Maria traf and Peter Maria heiratete are semantically nothing but event-type expressions. Whenever one encounters semantically deviant combinations such as (10.b) and (10.c), one tries to find a reinterpretation of the complement clause which fulfills the semantic requirements of the connective. This involves checking which kind - if at all - of statal reinterpretation may be obtained for the event-type expression in question. While doing so, one is led to access extra-linguistic, conceptually encoded knowledge about the types of events described. Conceptual knowledge about the type of event of some person meeting some other person tells us that these events may - and in fact often do - occur more than once, which is a prerequisite for a habitual or iterative reinterpretation. Conceptual knowledge about the type of events of person x marrying person y tells us that, with the exception of some rather unusual cases, this type of events does not occur often enough in x's and y's lifetime to form a habitual state of that couple. But note that nothing in the meaning of the verb marry Jcan sensibly be said to prevent x and y from getting married on one day and getting a divorce on the next day over and over again, just as x and y are free to meet as often as they like - in the former case, x's and y's habit simply would not fit our assumptions about the world. And this is just what makes us accept (10.b), but leads us to reject (10.c)."]},{"title":"4 Temporal and Non-Temporal Readings of before","paragraphs":["It is a well known fact that the temporal connective before as well as its equivalents in other languages has a wide variety of non-temporal readings. Consider the following examples. In (ll.a), before has a purely temporal reading. In (ll.b-d), the connective has various kinds of non-temporal readings: (ll.b) shows a likelihood reading, (ll.c) a preference reading, and (ll.d) a conditional reading.","(11) a. Before the Edmonton Oilers played the Minnesota North Stars, they beat the","Los Angeles Kings.","b. Before the Pittsburgh Penguins win the Stanley Cup, the Minnesota North","Stars will.","c. Before Wayne Gretzky signs with the Edmonton Oilers again, he will quit","playing hockey.","d. The Pittsburgh Penguins will not get their money before they have","beaten the Boston Bruins. In its temporal use, before says that the relevant time of the situation reported in the main clause is located on the time scale prior to the time of the event introduced in the complement clause. Since before puts no aspectual restriction on the main clause, the relevant time is either the definite time of occurrence of an event or some indefinite time at which a state holds. In addition to this purely temporal relation, before determines that the time associated with the main clause situation is proximal to the complement"]},{"title":"160","paragraphs":["clause event, i.e. it is placed within what I call the proximal pre-state of the event. Note that the notion of proximity is again crucial to the meaning of"]},{"title":"before,","paragraphs":["just as it is in the case of German"]},{"title":"nachdem","paragraphs":["and English"]},{"title":"after:","paragraphs":["(ll.a) can hardly be used to convey the information that the Oilers played the North Stars in the spring of 1991 and beat the L.A. Kings a year or a decade ago (which would not be excluded if the connective were to express nothing but a temporal ordering relation), even if the Oilers actually happened to beat the L.A. Kings in 1990 and 1980 as well as in 1991. Apart from marginal cases, relating the events in (ll.a) by means of"]},{"title":"before","paragraphs":["most naturally indicates that both events occurred within the same season (or any other period which can serve as the conceptual basis for fleshing out the notion of proximity in a given context).","As for the preference and likelihood readings, a number of relevant features, such as the choice of tenses, has already been brought to attention by I-Iein~im~iki [6]; so I will not unneccessarily repeat them here. There are, however, two things which Hein~im~iki did not make particularly clear: first, under what circumstances these readings arise, and second, whether or not she thinks that the temporal and non-temporal readings follow from different semantic representations of the connective.","Note in the first place that tile non-temporal readings are only options we may choose in the interpretation of (ll.b) and (ll.c). If we consider (ll.b) to be a claim about two successive seasons of the National Hockey League, say tile 1991 and the 1992 season, (ll.b) may perfectly well be understood to tell us that in 1991 the Minnesota North Stars and in 1992 the Pittsburgh Penguins will win the Stanley Cup. (Since in this case NHL seasons or years in their entirety form the basic units of time, we must count the time of the North Stars' triumph as proximal to the Penguins' 1992 victory.) If, however, (ll.b) is intended to be a claim about the very same season, as, for example, when we are discussing the prospects of our favourite teams for the season to come, a temporal interpretation would not make any sense. After all, we know that there can be only one champion per season. In the same way, (ll.c) can simply mean that Wayne Gretzky will first quit his career and then sign a contract with his former team. But this temporal interpretation of the sentence would contradict our assumptions about what the president of a team normally expects from the players he employs.","This shows that the preference and likelihood readings of"]},{"title":"before","paragraphs":["are alternatives to the temporal interpretation of the connective which we choose in case the latter hardly makes any sense. The conditions under which these non-temporal readings car/ appear must be spelled out in terms of our extra-linguistic knowledge of and assumptions about features of types of situations, i.e. they are genuinely conceptual in nature. Tile relevant conditions are the following: A temporal interpretation contradicts what we think is plausible, and the two statements linked by the connective allow us to establish a contrast between types of situations. In (ll.b), the neccessary contrast is given by two possible outcomes of the hockey season. In (11.c), the contrast consists in a player's choice either to end or to continue his career, the latter being a prerequisite for being offere'd a new contract. Where there is no contrast, a preference or likelihood interpretation can hardly be achieved; compare (ll.b) and (ll.c) to (12). The two readings differ in that tile preference reading requires that the situations are under a subject's control; see sentence (13), which has a likelihood reading only.","(12) a. Before the Pittsburgh Penguins win tile Stanley Cup, Mario Lemieux will","score for them more than once.","b. Before Wayne Gretzky signs with the Edmonton Oilers again, he will","decide to continue his career. 161","(13) Before Wayne Gretzky signs with tile Edmonton Oilers again, the Pacific Ocean will dry out. I consider the basic meaning of"]},{"title":"before","paragraphs":["to be temporal. The preference and likelihood readings require no special semantic representations, but arise through a conceptual reinterpretation of the ordering relation conditioned by the circumstances outlined above. Ill the basic temporal use, the ordering relation is interpreted as the temporal precedence relation between times associated with situations. In preference and likelihood readings, this relation is replaced by the relation of subjective prcference or likelihood, respectively, which ranks one type of situation superior to another type of situation. (What comes first on the scale is more likely or preferred than what comes later, just as what is present or in the past has a higher degree of certainty than what is yet to come.) In both the temporal and the non-temporal cases, there is a projection of parameters associated with situations - their times or their types - onto a scale, on which situations can be located with respect to that parameter. The notion of proximity in the semantics of"]},{"title":"before","paragraphs":["also carries over to non-temporal uses. In the cases discussed above it means that the type of situation described in the main clause is among the closest alternatives to the type of situation described in the complement clause with respect to the nature of the scale.","Nothing has been said so far about tile conditional reading of"]},{"title":"before","paragraphs":["in (11.d), which is repeated here as (14):","(14) The Pittsburgh Penguins will not get their money before they have beaten the Boston Bruins. A conditional reading can only arise if the main clause contains a negation and the subordinate clause is in the perfect aspect. The reasoning that leads to a conditional reading can be elucidated by considering what the standard temporal meaning of"]},{"title":"before","paragraphs":["yields in connection with these types of clauses. In its temporal interpretation, (14) says that prior to the consequent state of the Penguins' victory there is no event of the type that the team is getting money. This means that tile earliest possible change from a period without such an event to a period including such an event is when the victory has occurred. If there will be such an event at all, it must occur after the victory. This reasoning leads us to regard a victory of the Pittsburgh Penguins over the Boston Bruins as a condition for the occurrence of any event of the Penguins getting their money. Here again, the two types of events are projected onto a non--temporal scale, which in this case is a scale on which events are preceded by their conditions. The relation of proximity in the meaning of"]},{"title":"before","paragraphs":["now means that the realization of the event type introduced in the main clause is among the immediate consequences of the type of event described in the subordinate clause."]},{"title":"5 Conclusion","paragraphs":["Let me sum up my position. There is evidence from experimental psycholinguistics that we have to take into account an intra-linguistic level of semantic representations distinct from the extra-linguistic level of conceptual representations. In theoretical linguistics, the two-level theory can, for example, give an explanation of the differences in acceptability among expressions which are not fully correct from the point of view of compositional semantics. The theory claims that semantically deviant, though more or less acceptable, constructions require a non-compositional reinterpretation of some expression. Thereby,"]},{"title":"162","paragraphs":["the theory reflects the fact that their interpretation always involves a certain amount of reasoning. The need for an reinterpretation can be predicted from the semantic representations assigned to the respective i expressions. However, the conditions under which certain reinterpretations can or cannot be carried out are spelled out on the conceptual level. Due to extra-linguistic knowledge about types of situations (or, in cases other than those discussed in the present paper, tyi:)es of objects or other kinds of entities), some expressions allow for an appropriate reinterpretation and others do not. In addition, the two-level theory suggests a different perspective on the treatment of polysemous expressions. Rather than assigning a load of highly specialized semantic representations to the expressions in question, each of which incorporates a considerable amount of contextual information and whose number might easily get out of control in various linguistic fields, the theory highlights that there is a division of labour between the semantic and the conceptual level. Each level of representation makes its own contribution to what eventually will be the interpretation of a linguistic expression in a particular context. Acknowledgements: I wish to thank Elke Jiiger for her assistance in the preparation of the manuscript and Geoff Simmons for correcting nay English."]},{"title":"References","paragraphs":["[1] Bach, Emmon (1986): \"The algebra of events\"."]},{"title":"Linguistics and Philosophy","paragraphs":["9, 5-16.","[2] Bierwisch, Manfred (1983): \"Semantische und konzeptuelle Repr~entationen lexikalischer Einheiten\". in: R. Ruzicka & W. Motsch (eds.):"]},{"title":"Untersuchungen zur Semantik.","paragraphs":["Berlin: Akademie-Verlag, 61-99 (studia grammatica 22). [3] Bierwisch, Manfred & Lang, Ewald (eds., 1989):"]},{"title":"Dimensional Adjectives. Grammatical Structure and Conceptual Interpretation.","paragraphs":["Berlin: Springer. [4] Dowty, David (1979):"]},{"title":"Word Meaning and montague Grammar. The Semantics of Verbs and Times in Generative Semantics and Montague's PTQ.","paragraphs":["Dordrecht: Reidel. [5] Galton, Antony (1984):"]},{"title":"The Logic of Aspect. An Axiomatic Approach.","paragraphs":["Oxford: Clarendon Press."]},{"title":"[6] [7] [8] [9]","paragraphs":["Hein~m~iki, Orvokki (1978):"]},{"title":"Semantics of English Temporal Connectives.","paragraphs":["Bloomington/Indiana: Indiana University Linguistics Club. Herweg, Michael (1989): \"Ans~tze zu einer semantischen Beschreibung topologischer Pr~.positionen\". in: C. Babel et al. (eds.):"]},{"title":"Raumkonzepte in Verstehensprozessen. Interdisziplindre Beitriige zu Sprache und Raum.","paragraphs":["Tiibingen: Niemeyer, pp. 99-127. Herweg, Michael (1990):"]},{"title":"Zeitaspekte. Die Bedeutung yon Tempus, Aspekt und temporalen Konjunktionen.","paragraphs":["Wiesbaden: Deutscher Universit~itsverlag. Herweg, Michael (to appear/a): \"Temporale Konjunktionen und Aspekt. Der sprachlithe Ausdruck von Zeitrelationen zwischen Situationen\". to appear in"]},{"title":"Kognitionswissenschafl. 163 [10] Herweg, Michael (to appear/b): \"Perfective and imperfective aspect and the theory of events and states\", to appear in Linguistics. [11] Herweg, Michael (to appear/c): \"A critical examination of two classical approaches to \"aspect\". to appear in Journal of Semantics. [12] Jackendoff, Ray (1983): Semantics and Cognition. Cambridge, Mass.: The MIT Press. [13] Lang, Ewald; Carstensen, Kai-Uwe; Simmons, Geoff (1991): Modelling Spatial Knowledge On A Linguistic Basis. Theory-Prototype-Integration. New York, Berlin, Heidelberg: Springer (Lecture Notes in Artificial Intelligence 481). [14] Schriefers, Heribert (1990): \"Lexical and conceptual factors in the naming of relations\". Cognitive Psychology 22, 111-142. 164","paragraphs":[]}]}
