{"sections":[{"title":"Lexical Semantics and Knowledge Representation Proceedings of a Workshop Sponsored by the Special Interest Group on the Lexicon of the Association for Computational Linguistics Edited by James Pustejovsky and Sabine Bergler 17 June 1991 University of California Berkeley, California, USA © 1991, Association for Computational Linguistics Order copies of this and other ACL proceedings from: Donald E. Walker (ACL) Bellcore, MRE 2A379 445 South Street, Box 1910 Morristown, NJ 07960-1910, USA Preface","paragraphs":["The recent resurgence of interest in lexical semantics (LS) has brought many linguistic for-malisms closer to the knowledge representation (KR) languages utilized in AI. In fact, some for-malisms from computational linguistics are emerging which may be more expressive and formally better understood than many KR languages. Furthermore, the interests of computational linguists now extend to include areas previously thought beyond the scope of grammar and linguistics, such as commonsense knowledge, inheritance, default reasoning, collocational relations, and even domain knowledge.","With such an extension of the purview of \"linguistic\" knowledge, the question emerges as to whether there is any logical justification for distinguishing between lexical semantics and world knowledge. The purpose of this workshop is to explore this question in detail, with papers addressing the following points:","1. Possible methods for determining what is lexical knowledge and what is outside the scope of such knowledge.","2. Potential demonstrations that the inferences necessary for language understanding are no different from supposed non-linguistic inferences. 3. Arguments from language acquisition and general concept development. 4. Cross-linguistic evidence for the specificity of lexical semantic representations. 5. Philosophical arguments for the (impossibility of the) autonomy of lexical knowledge.","6. Theoretical approaches and implemented systems that combine lexical and non-lexical knowledge.","The current volume contains the written versions of the papers and panel positions presented at the (first) workshop on Lezical Semantics and Knowledge Representation, held at the University of California, Berkeley, on June 17, 1991, in conjunction with the meeting of the 29th Annual Meeting of the Association for Computational Linguistics. James Pustejovsky Chair, Program Committee"]},{"title":"Acknowledgements","paragraphs":["The organization of a special interest group within the ACL on the lexicon (SIGLEX), has occasioned the sponsoring of workshops such as the one presented here. There are many people to thank for making this workshop possible, and for helping to see the proceedings out the door. Special thanks must first go to Don Walker and the executive committee of the ACL for making SIGLEX O~iCial. Secondly, I would like to thank the other members of the program committee, Bran Boguraev, Ulrich Heid, Peter Norvig, and Robert Wilensky, for organizational and reviewing help. I would also like to thank Sabine Bergler for extensive help with preparing the manuscripts for publication. Finally, Peter Norvig and his staff deserve particular mention, for procuring the room, food services, and other local arrangements. ooo 111 LEXICAL SEMANTICS AND KNOWLEDGE REPRESENTATION 17 June 1991","University of California","Berkeley, California, USA","A workshop sponsored by the","Special Interest Group on the Lexicon (SIGLEX)","of the","Association for Computational Linguistics FINAL PROGRAM Opening session (chair: James Pustejovsky) 9:00-9:10 Opening statement (JP) 9:10-9:40 Keynote address: Knowledge Representation and Knowledge of Words","Richmond Thomason 9:40-9:55 discussion Session 1 (chair: James Pustejovsky) 9:55-10:15 Syntaz-Driven and Ontology-Driven Lezical Semantics","Sergei Nirenburg and Lori Levin 10:15-10:35 Knowledge Management for Terminology-Intensive Applications: Needs and Tools","Ingrid Meyer 10:35-10:55 Interpretation without Semantics","Stephen Helmreich 10:55-11:10 coffee break Session 2 (chair: Robert Wilensky) 11:10-11:30 Logical Structures in the Lezicon","John Sows 11:30-11:50 Conventional Metaphor and the Lezicon","James Martin 11:50-12:10 Representation of Semantic Knowledge wflh Term Subsumption Language","Gerrit Burkert and Peter Forster 12:10- 2:00 lunch iv Session $ (chair: Peter Norvig) 2:00- 2:20 Predictable Meaning Shifts: Some Linguistic Properties of Lezical Implication Rules","Nicholas Ostler and B.T.S. Atkins 2:20- 2:40 Lezical Operations in a Unification-based Framework","Ann Copestake and Ted Briscoe 2:40- 3:00 Lezical Structures for Linguistic Inference","Peter Anick and Sabine Bergler 3:00- 3:20 In So Many Words: Knowledge as a Lezical Phenomenon","Willem Meijs and Piek Vossen","3:20- 3:35 coffee break","Session 4 (chair: Bran Boguraev)","3:35- 3:55 Redefining the 'Level' of the 'Word' Melissa Macpherson","3:55- 4:15 Semantic Emphasis and the Structure of Verb Fields Juergen Kunle","4:15- 4:35 Lezical and World Knowledge: Theoretical and Applied Viewpoints John White","4:35- 4:55 Aspectual Requirements of Temporal Connectives: Evidence for a Two- level Approach to Semantics Michael Herweg 4:55- 5:10 coffee break Session 5 (chair: James Pustejovsky) 5:10- 6:30 Roundtable Discussion: Acquisition and Reusability of Lezical and World Knowledge","Martha Evens, Nicoletta Calzolari, Martha Palmer, Eiji ¥okota, Tomoyoshi Matsukawa 6:30- 6:50 discussion 6:50- 7:00 closing (JP)","Alternate Papers: Presupposition and Default Reasoning: A Study in Lezical Pragmatics Robert Mercer Lezicon, Ontology, and Tezt Meaning Boyan Onyshkevych and Sergei Nirenburg A Two-Level Knowledge Representation for Machine Translation: Lezical Semantics and Tense/Aspect Bonnie Dorr The Autonomy of Shallow Lezical Knowledge Kathleen Dahlgren V"]},{"title":"TABLE OF CONTENTS","paragraphs":["Preface James Pustejovsky ...................................................................... iii Knowledge Representation and Knowledge of Words Richmond Thomason ................................................................... 1 Syntaz-Driven and Ontology-Driven Lezical Semantics Sergei Nirenburg and Lori Levin ........................................................ 9 Knowledge Management for Terminology-Intensive Applications: Needs and Tools Ingrid Meyer ........................................................................... 20 Interpretation without Semantics Stephen Helmreich ...................................................................... 34 Logical Structures in the Lezicon John Sows .............................................................................. 38 Conventional Metaphor and the Lezicon James Martin ........................................................................... 56 Representation of Semantic Knowledge with Term Subsumption Language Gerrit Burkert and Peter Forster ........................................................ 67 Predictable Meaning Shifts: Some Linguistic Properties of Lezical Implication Rules Nicholas Ostler and B.T.S. Atkins ...................................................... 76 Lezical Operations in a Unification-based Framework Ann Copestake and Ted Briscoe ........................................................ 88 Lezical Structures for Linguistic Inference Peter Anick and Sabine Bergler ......................................................... 102 In So Many Words: Knowledge as a Lezieal Phenomenon Willem Meijs and Piek Vossen .......................................................... 113 Redefining the 'Level' of the 'Word' Melissa Macpherson .................................................................... 127 Lezical and World Knowledge: Theoretical and Applied Viewpoints John White ............................................................................. 139 Aspectual Requirements of Temporal Connectives: Evidence for a Two-level Approach to Semantics Michael Herweg ......................................................................... 152 A Model for the Interaction of Lezical and Non-lezical Knowledge in the Determination of Word Meaning Peter Gerstl ............................................................................ 165 For the Lezicon that has Everything Martha Evens, Joanne Daxdaine, Yu-Fen Huang, Sun M Li, Judith Markowitz, Frank Ri- 179 naldo, Margi Rinaldo, Robert Strutz .................................................... Acquiring and Representing Semantic Information in a Lezieal Knowledge Base Nicoletta Calzolari ...................................................................... 188 General Lezical Representation for an Effect Predicate Martha Palmer ......................................................................... 198 Development of the Concept Dictionary: Implementation of Lezical Knowledge Tomoyoshi Matsukawa and Eiji Yokota .................................................. 206 Presupposition and Default Reasoning: A Study in Lezical Pragmaties Robert Mercer .......................................................................... 224 Lezicon, Ontology, and Tezt Meaning Boyan Onyshkevych and Sergei Nirenburg ............................................... 238 A Two-Level Knowledge Representation for Machine Translation: Lezical Semantics and Tense/Aspect Bonnie Dorr ............................................................................ 250 The Autonomy of Shallow Lezical Knowledge Katldeen Dahlgren ...................................................................... 264 vi"]}]}
