{"sections":[{"title":"A Semantics and Pragmatics for the Pluperfect Alex Lascarides* Centre for Cognitive","paragraphs":["Science and","Human Communication Research Centre University of Edinburgh","2, Buccleuch Place","Edinburgh EH8 9LW, Scotland, UK alexl~k, ac. ed. copci"]},{"title":"Nicholas Asher IRIT, Umvermt~ Paul Sabatier 118 Route de Narboane 31062 Toulouse Cedex, France also at: Centre for Cognitive Science and Department of philosophy University of Texas, Austin asherlirit .it","paragraphs":["Abstract We offer a semantics and pragmatics of the pluperfect in narrative discourse. We rexamine in a formal model of implicature, how the reader's knowledge about the discourse, Gricean-maxims and causation contribute to the meaning of the pluperfect. By placing the analysis in a theory where the interactions among these knowledge resources can be precisely computed, we over-come some problems with previous Reichenbachian approaches. 1 Introduction In this paper, we investigate the impact of the pluperfect tense on the temporal and rhetorical structure of narrative discourse. We will use a representation framework for discourse structure called SDRT (standing for Segmented Discourse Representation Theory) (Asher 1993), and a theory of discourse attachment called DICE (standing for Discourse and Commonsense Entailment), which is designed to compute temporal implicatures for natural language texts (Lascarides and Asher 1991). We will argue that the resultant analysis overcomes problems with Reichenbachian theories of tense (e.g., Kamp 1991a)."]},{"title":"2 Limitations of Kamp's Account","paragraphs":["Kamp's (1991a) Reichenbachian account of the pluperfect is problematic in at least three ways. Firstly, the temporal structure of a text is determined solely","*The support of the Science and Engineering Research Council through project number GR/G22077 is gratefully acknowledged. HCRC is supported by the Economic and Social Research Council. from syntax, so there can be no explanation of why even though (1) has the same tense structure as (2), they are interpreted differently: no order is inferred between the events in (1b-d) while there is temporal progression in (2b-d).","(1) a. Alexis was a very good girl by the time","she went to bed yesterday. b. She had helped her mum withthe house-","work. c. She had practised her piano. d. She had done all her homework. e. We all felt very good about it.","(2) a. Max arrived at the summit at midday. b. He had got up at 5:30am, c. had prepared his lunch, and d. had passed base camp before 7am. Intuitively, the order of events in (2b-d) is inferred from causal knowledge about the typical orders between the events and by the temporal information conveyed by the list structure. In contrast, there is no knowledge that enables such an inference in (lb-d). An explanation in these terms requires us to solve the Interaction Problem: The anMysis of the pluperfect must interact in precise and systematic ways with the reader's causal knowledge, pragmatic maxims and the discourse type to yield appropriate temporal structures. Kamp's syntactic-based account fails to specify such interactions.","The second problem is that, in line with the Reichenbachian approach, the semantics of tense appeals only to"]},{"title":"temporal","paragraphs":["relations. But consider texts (3) to (5).","(3) Max entered the room. He poured himself a cup of coffee. 250 (4) ?Max poured himself a cup of coffee. He had","entered the room. (5) Max poured himself a cup of coffee. He had","entered the room feeling depressed, but now","he felt much better. Texts (3) and (4) attempt to describe similar temporal relations, and yet only (3) is acceptable. Similarly, (4) and (5) describe similar temporal relations between the first event mentioned and the second, but only (5) is acceptable. One can view (3) to (5) as a manifestation of contextual relevance; a similar view is proposed in Caenepeel and SandstrSm (1992). One event being in the consequent state of the other is sufficient for simple past tensed text to satisfy the Contextual Relevance Constraint (eft (3)), but it won't do for the pluperfect in (4), although the additional information in (5) ameliorates (4)'s incoherence. We can thus think of the pluperfect as a discourse marker that indicates that the range of possible connections that would make the clause 'contextually relevant' is restricted (relative to the possibilities for the simple past). This yields the Relevance Problem: The analysis of the pluperfect must take Contextual Relevance into account. Kamp (1991a) fails to explain the incoherence of (4) because the Reichenbachian analysis doesn't solve this problem: to solve it, a Reiehenbachian semantics of tense would have to be extended so that it considers causal and rhetorical connections, as well as temporal relations.","A third problem with the Reichenbachian account of tense is that the purely temporal specification fails to explain why the pluperfect clause can initiate a perspective shift such as those that occur in free indirect style, where the control over the proposition shifts from the author to a character in the text (Leech and Short 1981, Quirk et al. 1985). For example, consider text (6), taken from Nakhimovsky (1988): (6) a. The telephone rang.","b. It was Mme Dupont.","c. Her husband had eaten too many oysters","for lunch.","d. The doctor recommended a change in","lifestyle (6c) initiates free indirect style: Control over the proposition in (6c) is shifted from the author to Mme Dupont, because in contrast to (6b), (6c) reports Mine Dupont's perceptions (of what was said over the phone). The pluperfect plays a crucial role in creating free indirect style in (6), for replacing it with the simple past would mean that the author's perspective is maintained: (6) d. Her husband ate too many oysters for","lunch. This yields the Perspective Problem: The semantic framework used must be able to represent perspective, such as those that occur in indirect speech. Although Discourse Representation Theory (DRT) is a rich semantic framework in which perspective can be represented, the analysis of tense in DgT presented in (Kamp 1991a) fails to exploit this. All purely Reichenbachian treatments of tense fail to capture shifts in perspective, because they don't take into account the information status of the clauses concerned.","In order to solve the Interaction, Relevance and Perspective Problems, we will formalise the discourse role of the pluperfect using two tools: a semantically-based theory of discourse structure called SVgT, and a formal theory of discourse attachment called DICE. Using these tools, we model both the pluperfect's semantic and pragmatic contributions to discourse. In contrast to Kamp (1991a), we will examine the role that the reader's background knowledge plays in interpreting the pluperfect tense, and provide analyses of the above texts. The reason we devote atten-tion to a formal account is because we assume that the reader's various knowledge resources on occasion yield conflicting conclusions about discourse structure (cf. Hobbs 1985, Lascarides and Asher 1991), and resolving the conflicts is arbitrary unless supported by an underlying logical consequence relation."]},{"title":"3 A Description of SDRT and DICE","paragraphs":["We start with a brief overview of SDRT and DICE. SDRT (Asher 1993) takes the basic building blocks of discourse structure to be propositions with a dynamic content, which are represented as DaSs--the representation scheme in Kamp's (1981) DRT. However, discourse relations may also obtain between more complex structures---segmented DRSs (SDgSs), which are defined recursively. In SDRT, an NL text is represented by an SDRS, which is a pair of sets containing respectively: the DgSs or SDgSS representing respectively sentences or text segments, and discourse relations between them. These structures are constructed in a dynamic, incremental fashion. The default assumption is that the sentence boundary marks the unit of information to be attached to the SDRS for the preceding discourse.","Discourse relations modelled after those proposed by Hobbs (1985) and Thompson and Mann (1987) link together the constituents of an SDRS. We will use seven discourse relations: Narration, Elaboration, Explanation, Background, Continuation, Parallel and Contrast. The first four of these constrain temporal structure: Narration entails that the descriptive order of events matches their temporal order; an Explanation or Elaboration entail they mismatch; and Background entails temporal overlap.","The recursive nature of SDRSs gives discourse structures a hierarchical configuration. Certain discourse relations in an SDRS impose a hierarchical structure; these subordinating relations are Elaboration and Explanation. The so-called open constituents to which new information can attach are the previous constituent or constituents it elaborates or explains. Thus the open clauses are those on the 251 right frontier of the discourse structure (cf. Polanyi 1985, Grosz and Sidner 1986, Webber 1991), assuming that it is built in a depth first left to right manner.","SDRT specifies which parts of the SDRS are available to the representation of the current sentence for attachment via a discourse relation. DICE provides the means to"]},{"title":"infer","paragraphs":["from the reader's knowledge resources which discourse relation should be used to do attachment. DICE makes the following claims. The current sentence is attached to the preceding SDRS with a discourse relation; the process by which this is done takes the reader's background knowledge into account, and the resulting SDRS determines how time is structured in the discourse. Here, we assume the reader's knowledge base (KB) contains: the SDRS for the text so far; the logical form of the current sentence; an assumption that that logical form must attach at an open site (i.e., the text is coherent); all defeasible and indefeasible world and pragmatic knowledge; and the laws of logic.","The rules introduced below are shown in Lascarides and Asher (1991) to be manifestations of Gricean-style pragmatic maxims and world knowledge; we assume they form part of the reader's KB. A formal notation makes clear both the logical structure of these rules, and the problems involved in calculating implicature. Let (% a,/3) be the update function, which means \"the representation v of the text so far, of which c~ is an open node, is to be up-dated with the representation/3 of the current sentence via a discourse relation with a\". Let a 4~/3 mean that a is a topic for/3; let"]},{"title":"ea","paragraphs":["be a term referring to the main eventuality described by the clause a; and let"]},{"title":"fall(m,","paragraphs":["ea) mean that this event is a Max falling. Let el -4 e2 mean the eventuality el precedes e2, and"]},{"title":"cause(el, e2)","paragraphs":["mean £1 causes e2. Finally, we represent the defeasible connective as a conditional > (so ~ > ~b means 'if ql, then normally ~b'). The maxims for modelling implicature are then represented as schemas: • Naxration: (% a, 13) >"]},{"title":"Narration(a,/3) • Axiom on","paragraphs":["llaxration:"]},{"title":"(Ua ation(a,/3) • States Overlap:","paragraphs":["(r, a,/3) A state(e#) >"]},{"title":"overlap(e,, e#) • Background:","paragraphs":["(,',"]},{"title":"a,/3)","paragraphs":["A"]},{"title":"overlap( e~ ,","paragraphs":["eo ) >"]},{"title":"Background(a,/3)","paragraphs":["• Axiom on Background:"]},{"title":"iT(Background(a,/3)","paragraphs":["-+"]},{"title":"overlap( e~ , ea ) )","paragraphs":["• Continuation: (r,/3, 7) A a .[J./3 >"]},{"title":"Continuation(~3,","paragraphs":["7)","• Continuing Discourse Patterns: D((r, a, 7)Aa 4~/3A ~b(o~,/3) A"]},{"title":"Continuation(~3,","paragraphs":["7) -- v)) • Causes Precede Effects:"]},{"title":"D(cause(e2, el) ~ -~el -~ e2)","paragraphs":["The rules for Narration and its Axiom convey information about the pragmatic effects of the textual order of events; by default, textual order mirrors temporal order. States Overlap, Background and its Axiom convey the pragmatic effects derived from aktionsart information (states normally provide background information). Continuation and Continuing Discourse Patterns convey the pragmatic effects of the preceding discourse structure; they state that normally, the current clause 7 continues to describe the same topic a as the preceding clause/3 did (for in SDRT,"]},{"title":"Continuation(~3,","paragraphs":["7) entails/3 and 7 have the same topic a), and 7 is related to a by the same discourse relation. Finally, that Causes Precede their Effects is indefeasible world knowledge.","The logic on which DICE rests is Asher and Morreau's (1991) Commonsense Entailment (CE). Three patterns of nonmonotonic inference are particularly relevant. The first is Defeasible Modus Ponens: if one default rule has its antecedent verified, then the consequent is nonmonotonicaily inferred. The second is the Penguin Principle: if there are conflicting default rules that apply, and their antecedents are in logical entailment relations, then the consequent of the rule with the most specific antecedent is inferred. The third is the Nixon Diamond: if there are conflicting default rules that apply but no logical relations between the antecedents, then no conclusions are inferred.","In interpreting text (7), the KB contains (a, a,/3), where a and/3 are respectively the logical forms of the first and second sentences. (7) Max stood up. John greeted him.","(8) Max opened the door. The room was pitch dark. The only rule that applies is Narration, and its consequent is inferred via Defeasible Modus Ponens. Hence by logical omniscience, the standing up precedes the greeting. In contrast, text (8) verifies the antecedents to two conflicting defeasible laws: Narration and States Overlap. By the Penguin Principle, States Overlap wins, because its antecedent logically entails Narration's. In turn, this entails that the antecedent to Background is verified; and whilst conflicting with Narration, it's more specific, and hence its"]},{"title":"consequent--Background--follows","paragraphs":["by the Penguin Principle. We call this double applica-tion of the Penguin Principle the Cascaded Penguin Principle. 1","The Nixon Diamond provides the key to text incoherence (Lascarides and Asher, 1991). If the reader's knowledge resources are in irresolvable conflict, no","1The formal details of how the logic CE models these interpretations axe given in Lascaxides and Asher (in press). Although the Cascaded Penguin Principle, as in (8), is not valid in general, they show that for the particular case considered here, CE validates it. 252 conclusions about the discourse structure can be inferred. DICE exploits this account of incoherence in its approach to"]},{"title":"discourse popping.","paragraphs":["When a Nixon Diamond occurs in attempting to attach the current clause to the previous one, they don't form a coherent text segment. So the current clause must attach to one of the other open clauses, resulting in discourse popping."]},{"title":"4 The Semantics of the Pluperfect","paragraphs":["DICE represents temporal information in two places: first, in the DRS representing a sentence; and second, in the discourse relations. Because of these two levels, we can preserve"]},{"title":"sentential","paragraphs":["equivalence between the simple past and pluperfect, while still maintain-ing that these tenses play different roles in"]},{"title":"discourse,","paragraphs":["by ensuring that different default rules for discourse attachment apply. We pursue such an analysis of the pluperfect here, because in contrast to Hamann (1989), it enables us to provide a"]},{"title":"uniform","paragraphs":["semantics of tense which explains why the simple past and pluperfect are equivalent in sentences containing temporal connectives, but different in discourse (see Lascaxides and Asher 1992).","The logical forms of (9) and (10) are respectively (9') and (10'). (9) John greeted Max"]},{"title":"e,t greet(j, m, e) (9') hold(e,t) t ..< now","paragraphs":["(10) John had greeted Max"]},{"title":"s,t (10') [ s = cs(e) hold(s, t) t -4 now","paragraphs":["In (9~), the discourse referent e is a John greeting Max event, which holds at the time t preceding"]},{"title":"now.","paragraphs":["In (10~), s is the consequent state of the event of John greeting Max, and it holds at the time t which precedes"]},{"title":"now.","paragraphs":["So our semantics of the perfect is like that in Moens and Steedman (1988): a perfect trans-forms an event into a consequent state, and asserts that the consequent state holds. The pluperfect of"]},{"title":"a state,","paragraphs":["such as (11), therefore, is assumed to first undergo a transformation into an event. (11) John had loved Mary. The event is usually the inceptive reading of the state in this case,"]},{"title":"John started to love Mary--","paragraphs":["although this can vary with the context. Then, the pluperfect asserts that the consequent state of this event holds--in this case, the consequent state is the state of John loving Mary itself. We forego defining the function"]},{"title":"cs","paragraphs":["which takes events to consequent states here for reasons of space, but see Lascaxides (1988) and Blackburn and Lascaxides (1992) for a proposed semantics. We do, how-ever, assume that the following relationship holds between an event and its consequent state:","• Consequent States:"]},{"title":"ra(Vt)( hold(cs(e), t) ~ (3t')( hold(e, t') A t' -4 t) ) m(¥t')( hoid( e, t') ~ (3t )(hold( cs( e ), t) ̂t' -< t ) )","paragraphs":["So a consequent state holds if and only if the event holds at an earlier time. This relationship means that (9') and (10') are truth conditionally equivalent, under the usual assumption that time is dense. They only differ in terms of which eventualities are available for future anaphoric reference. This equivalence is in sharp contrast to all Reichenbachian treatments of the tenses.","The main eventuality in (10) is the consequent state s of John having greeted Max. But sometimes in discourse attachment it is useful to refer in the rules of attachment to the"]},{"title":"event","paragraphs":["of John greeting Max itself, which is embedded in (10'). To do this, we define a function"]},{"title":"ev","paragraphs":["on eventualities:"]},{"title":"ev(e) = { e' if e = cs(e')","paragraphs":["e otherwise"]},{"title":"5 The Pragmatics of the Pluperfect","paragraphs":["We now show how the discourse role of the pluperfect can be captured. We argued earlier that the range of possibilities for connecting a pluperfect clause to a simple past tensed one is smaller than the range of possibilities allowed for connecting a simple past tensed clause to a simple past tensed one (cf. (3) vs. (4)). We will show that to account for the above data, the discourse relations permitted between a simple past and pluperfect are exactly"]},{"title":"Elaboration, Explanation, Parallel","paragraphs":["and"]},{"title":"Contrast.","paragraphs":["This would be what one would intuitively expect, for these are the only discourse relations we consider that are compatible with a backwards movement of time in discourse, and the pluperfect in general indicates this temporal structure.","We represent this constraint as defeasible knowledge, for (12) is an exception:","• Constraint When Changing Tense (CCT):"]},{"title":"(r, c~, fl) A sp(cr) A pp(/3) > Cpp(a, fl)","paragraphs":["(12) Max left the house at 7am. He had passed","the station by 9:lSam. CCT states that. if a pluperfect clause /3 is to be attached to a simple past tensed clause a, then the discourse relation between them must be defined by"]},{"title":"Cry,","paragraphs":["which is the condition that the consequent state described in the pluperfect must include the eventuality described in the simple past, and furthermore. one of"]},{"title":"Elaboration, Explanation, Parallel","paragraphs":["and"]},{"title":"Contrast","paragraphs":["must hold."]},{"title":"Elaboration","paragraphs":["and"]},{"title":"Explanation","paragraphs":["impose a backwards movement of time in discourse by 253 their semantics. The temporal condition of inclusion imposed by Cpp ensures that, if the discourse relation between a stative simple past sentence and the pluperfect one is"]},{"title":"Parallelor Contrast,","paragraphs":["then the backwards movement of time between the eventualities described still holds, as we will see shortly."]},{"title":"5.1 A Simple ExAmple","paragraphs":["First we consider CCT'S impact on text (13), and contrast this with VlCV.'s analysis of text (7). (13) Max stood up. John had greeted him. In the interpretationof (13), the rules that apply are: Narration, States Overlap and CCT. By the Penguin Principle, one infers that the consequent state of greeting and standing up overlap (by States Overlap), and that the clauses are related by Cpp. In addi-tion, the Greeting Law below captures the intuition that if a standing up and a greeting are connected, and moreover, we know that the connection is Cpp, then in the absence of information to the contrary, the relation"]},{"title":"Explanation","paragraphs":["is preferred in that context (for out of the four choices, John's greeting Max explaining why Max stood up is the most plausible). • 6reefing Law:"]},{"title":"( ( r, a,/3) A standup( ev( ea ) ) A greeting( ev( e# ) ) A c.(a./3)) > En.tanation(a./3)","paragraphs":["Now Background and the Greeting Law apply, and one infers"]},{"title":"Background(a,/3)","paragraphs":["and"]},{"title":"Explanation(a,/3).2","paragraphs":["So the consequent state of the greeting is in force when Max stands up, and the greeting explains why Max stood up. Thus CCT helps us model the difference between (7) and (13).","CCT overcomes a flaw in the semantics of the pluperfect presented in (Lascarides and Asher in press); there, the constraint was presented as indefeasible, and consequently was unable to explain (12). Mak-ing CCT defeasible has also changed the inference pattern underlying the analysis of (13). Whereas in Lascarides and Asher (in press) Cpp(a,/3) is inferred"]},{"title":"monotonically","paragraphs":["from the premises by modus ponens; here, the inference pattern is the Penguin Principle. 5.2 An Example of Incoherence Now consider texts (3) and (4); we infer that the discourse relation connecting the sentences in (3) is"]},{"title":"Narration.","paragraphs":["(3) Max entered the room. He poured himself a cup of coffee. (4) ?Max poured himself a cup of coffee. He had","entered the room. The laws that apply in the analysis of (4) are Narration, States Overlap and COT. As in the analysis of (13),"]},{"title":"overlap(ea,e#)","paragraphs":["and"]},{"title":"Cpp(a,/3)","paragraphs":["are inferred. However, our knowledge about pouring coffee and","2As in the Cascaded Penguin Principle, we can divide up the nonmonotonic reasoning in this way in this case. entering a room means that we don't have a law like the Greeting Law which allows us to infer which relation permitted by"]},{"title":"Cpp","paragraphs":["is most plausible. So we fail to infer which of the four permitted discourse relations holds for (4). And we assume that know-ing one of a set of discourse relations must hold, but not being able to infer which actually holds, is sufficient grounds for incoherence. The Nixon Diamond mentioned earlier, which leads to incoherence, is a specific case of this.","Now consider text (5). (5) Max poured himself a cup of coffee. He had","entered the room feeling depressed, but now","he felt much better. The default assumption in DICE is that one constructs the DRSS for whole"]},{"title":"sentences","paragraphs":["before one attempts discourse attachment. Using rules for constructing DRSs, the logical forms of the sentences in (5) are respectively a and/3. el,tl"]},{"title":"pour(j, coffee, el) (a) hold(el, tl) tl -4 now","paragraphs":["82, t2, 83, t3"]},{"title":"| = cs(e2) hold(s2, t2) (#) t2 -~ now feel-better(j, sa ) hold(s3,","paragraphs":["t3)"]},{"title":"t3 -4 now overlap(","paragraphs":["s2, e 1) t2 -4 t3 The conditions that the event el of pouring coffee overlaps with the state s2 of having entered the room arises from the discourse use of"]},{"title":"now","paragraphs":["in /3. Now we must relate /3 to a with a discourse relation. The rules that apply are States Overlap and Narration. CCT does"]},{"title":"not","paragraphs":["apply, because we are not relating a pluperfect clause to a simple past tensed one. By the Cascaded Penguin Principle, we infer"]},{"title":"Background(a,/3).","paragraphs":["Thus the second sentence in (5) describes the background circumstances when Max poured himself the coffee. Unlike (4), we do no have a situation where we fail to infer which of the permitted set of discourse relations holds, and so (5) is coherent.","If the comma in (5) is replaced with a full stop, then upon failing to attach the second sentence to the first (as in (4)), one attempts to attach the third sentence to the second to obtain an SDRS which one"]},{"title":"then","paragraphs":["attempts to attach to the first sentence. At this point, CCT won't apply, and so as in (5), we don't have a situation where we are unable to infer which of the permitted discourse relations holds. So the text 254 is predicted to be coherent. The above accounts of (3) to (5) show that the Relevance Problem is solved. 5.3 Parallel and Contrast We now give an example of a text in which the relation"]},{"title":"Contrast","paragraphs":["occurs together with a change in tense from the simple past to the pluperfect. (14) John was lazy now. But he had worked very","hard for several years. When analysing (14), SDRT will yield two constituents a and ~ representing the respective sentences. The presence of the particle"]},{"title":"but","paragraphs":["forces a"]},{"title":"contrast","paragraphs":["relation between a and fl, but an incoherent SDRS may result if the relation is not verified by the semantic content and structure of the constituents themselves.","The semantics of"]},{"title":"Parallel","paragraphs":["and"]},{"title":"Contrast","paragraphs":["are explored in depth in Asher (1993). Briefly,"]},{"title":"Paralle~a, ~)","paragraphs":["or"]},{"title":"Contrast(a, fl)","paragraphs":["hold just in case the constituents a and /~ have a particular semantic structure and content. The semantic structure required by"]},{"title":"Parallel and Contrast","paragraphs":["is defined in terms of"]},{"title":"embedding trees.","paragraphs":["Each constituent has an embedding tree, which depicts the hierarchical structure of the constituent SDRSs"]},{"title":"and","paragraphs":["the hierarchical structure of the DRSs in the SDRSs. The embedding trees for the two constituents a and fl of (14) are given below. The embedded DRS ff in the embedding tree for fl represents the subVRS that characterizes the"]},{"title":"event","paragraphs":["of working hard introduced by the pluperfect."]},{"title":"]","paragraphs":["Briefly,"]},{"title":"Paralle~a, fl)","paragraphs":["requires that there is a pairing of nodes in the embedding trees of a and fl such that each pair contains two semantically and structurally similar objects."]},{"title":"Contrast(a,~),","paragraphs":["on the other hand, involves a pairing of nodes from the embedding tree of a and the embedding tree of fl, such that at least some pairs contain structurally similar but semantically"]},{"title":"dissimilar","paragraphs":["objects. Similarity and dissimilarity are exhibited by means of an assignment of polarities (+, -) to nodes. Both nodes get + when they are similar, one gets + and the other - when they are dissimilar. Given a pragmatic constraint of novelty or informativeness, no two constituents can be perfectly parallel.","Echoing the distinction between topic and focus or given information and new, Asher (1993) isolates for each constituent a theme; the constraints on possible themes are specified in (Asher 1993). Themes may contain arguments and conditions of the SDRSs in question; in general, the more of the conditions of a constituent that a theme covers the stronger the parallel or contrast relation it supports. Parallelism between two constituents is maximized when there is a common theme and it is as maximal as is compatible with informativeness. Contrast is maximally plausible when themes are complementary or even contraries. Plausible contrast is defined with respect to CE: A plausibly contrasts with B if the KB entails A > -,B or B > -,A.","In our example (14) above, the theme of a that is maximal with respect to supporting"]},{"title":"Contrast","paragraphs":["under the mapping of nodes suggested below is"]},{"title":"lazy(el,j)","paragraphs":["while the corresponding theme of ff is"]},{"title":"work-hard(e2,j).","paragraphs":["When paired together the KB implies that they are plausibly contrastive, assuming that world knowledge is stated as intuitions would dictate. Thus, contrasting polarities are assigned to the paired nodes and"]},{"title":"Contrast(a, fl)","paragraphs":["is verified, as is required by the presence of"]},{"title":"but.","paragraphs":["Thus, the SDgS coherently supports Contrast. a"]},{"title":"Contrast","paragraphs":["does not determine any temporal order by itself. However,"]},{"title":"Contrast","paragraphs":["is compatible with"]},{"title":"Cpp(a,","paragraphs":["fl), which is inferred in DICE by the Penguin Principle. Cpp(a, fl) will force us to conclude that the consequent state e# includes ea, which is the state of John being lazy. Because of the Consequent States axiom, we can infer from this that the event of working hard precedes John being lazy. In addi-tion,"]},{"title":"Contrast","paragraphs":["is compatible with"]},{"title":"Background,","paragraphs":["and so in this particular case DICE will also force us to infer"]},{"title":"Background(a,","paragraphs":["fl), since (i) ea is a state, (ii) by States Overlap, c~ by default overlaps e~, and (iii) by Background, this overlap will by default imply"]},{"title":"Background(a, ~).","paragraphs":["5.4 Perspective Shift The analysis of (6) will exploit information flow between the lexicon and discourse attachment. (6) a. The telephone rang. a","b. It was Mme Dupont. fl","c. Her husband had eaten too many oysters","for lunch. 7","d. The doctor recommended a change in","lifestyle. 6 The analysis of (6) proceeds as follows: let the logical forms of the sentences be respectively a to 6. First we consider the lexical information in a. Pustejovsky's (1991) representation of lexical entries for artifacts 255 e, t, z, p, so, tO"]},{"title":"hold(e,t) t -< now ring(telephone, e) say(z,p, so) hold(so,to) ~J, Elaboration pC_","paragraphs":["W, S, t t"]},{"title":"husband(w, d) \":[='-\" I [ eat-too-many-oysters(w, e) hold(s, t')","paragraphs":["t t ~ now"]},{"title":"t' -4 to","paragraphs":["Figure 1: The SDRS representing Text (6) includes a representation of their telic roles, which intuitively define the purpose of the artifact. We assume that the telic role of a telephone is to have a conversation. This telic role invokes three thematic roles, identified below by z (the speaker), p (the thing that's said), and y (the listener).","• From the Lexicon:"]},{"title":"telephone","paragraphs":["> z said that p to y This lexical information influences discourse attachment: upon attempting to attach 8 to a, the reader infers that Mme Dupont can fill the role z, and so by default, she does. Having identified Mme Dupont as filling this role, the rule Elaboration below applies. Elaboration captures the intuition that if 8 is to be attached to a with a discourse relation, and 8 identities a role in a, then normally,"]},{"title":"Elaboration(a,8)","paragraphs":["holds.","• Elaboration: (% a, 8) A/3 identifies a role in a >"]},{"title":"Elaboration(a, 8)","paragraphs":["By the Penguin Principle on Narration and Elaboration,"]},{"title":"Elaboration(a, 8)","paragraphs":["is inferred.","Now the task is to update this SDRS with 7: a and 8 are both open constituents. Caenepeel (1989) argues that if the discourse context induces a psychological perspective of a protagonist z, and the clause currently being processed is stative, then that current clause is interpreted with respect to z's point of view. In this example, the context provided by a does induce a psychological perspective because the above telic role invokes the propositional attitude"]},{"title":"said that.","paragraphs":["Furthermore, 7 is in the pluperfect, and therefore is stative. This motivates Caenepeel's Axiom below: it states that a pluperfect sentence 7 by default identifies the proposition p in the propositional attitude ~b invoked by a:","• Caenepeel's Axiom:"]},{"title":"(r, a, 7) A PP(7)","paragraphs":["A ~(a, p) > 7 identifies p","Now consider the reasoning behind attaching 7 to the preceding open constituent a. The rules that apply are Narration, States Overlap, COT and Caenepeel's Axiom. Nothing in the reader's KB conflicts with the consequent of Caenepeel's Axiom, and so its consequent is inferred; i.e., 7 identifies p. CCT conflicts with Narration, and so Upp(a, 7) is inferred by the Penguin Principle. Because 7 identifies p, Elaboration applies, and whilst conflicting with Narration, it's more specific, and so"]},{"title":"Elaboration(a, 7)","paragraphs":["is inferred."]},{"title":"Elaboration(a,8)","paragraphs":["entails a # 8 by"]},{"title":"Elaboration's","paragraphs":["semantics in SDRT. So in attaching 7 to 8, Continuation fires and"]},{"title":"Continuation(8,","paragraphs":["7) is inferred. The full representation of (6) is given in figure 1.","The relic role for"]},{"title":"telephone","paragraphs":["has been identified, and"]},{"title":"so say(z,p, so)","paragraphs":["is added to the DRS representing a. 8 and 7's DRS conditions then identify the roles: d = z 256 in ~ (i.e., Mine Dupont is the speaker on the phone), and p C_ 7 in 7 (i.e., what was said over the phone is denoted by 7). So, ot contains a"]},{"title":"propositional attitude","paragraphs":["of"]},{"title":"saying,","paragraphs":["which given the other DRSS, holds between Mme Dupont and the proposition denoted by 7. 3 Thus the representation of (6) encodes the perspective shift that occurs when interpreting 7, and so solves the Perspective Problem. And note that elaborations can actually affect the truth conditions of DgSS by specifying arguments of event types: in this case, recognising the elaboration enabled d - z and p _C 7 to be added to the DRS conditions. 5.5 Attaching Pluperfects Together Now consider text (1).","(1) a. Alexis was a very good girl by the time she went to bed yesterday.","b. She had helped her mum with the housework. c. She had practised her piano. d. She had done all her homework. e. We all felt very good about it. One infers"]},{"title":"Elaboration","paragraphs":["between (la) and each of the pluperfect clauses (lb), (lc) and (ld) using a similar strategy to that outlined in the analysis of (13). We now examine in detail how the pluperfect clauses are related to each Other. (lb) is an open clause to (lc), and just as in (8),"]},{"title":"Background","paragraphs":["is inferred via the Cascaded Penguin Principle: the pair of conflicting laws are States Overlap and Narration and Background and Narration. Continuation also applies, given the"]},{"title":"Elaboration","paragraphs":["relations already inferred, and so"]},{"title":"Continuation","paragraphs":["is inferred;"]},{"title":"Continuation","paragraphs":["conflicting with neither"]},{"title":"Background","paragraphs":["nor"]},{"title":"Narration. 4","paragraphs":["A similar line of reasoning applies when attaching (ld) to the open (lc), and so one infers"]},{"title":"Background","paragraphs":["and"]},{"title":"Continuation","paragraphs":["to relate these constituents as well. Finally, further pragmatic knowledge that is encoded in race form a Nixon Diamond when attempting to attach (le) to (ld) thus inducing a discourse pop to (la) (we omit the details of this here). Thus the discourse structure","3 We have used the traditional representation of propositional attitudes in DRT, outlined in Asher (1986), Kamp (1991b) and Zeevat (1986).","*Again, the predicates are sufficiently independent that we can divide up the nonmonotonic reasoning in this way. of (1) can be pictorially represented as follows:"]},{"title":"Background","paragraphs":["la"]},{"title":"Elabora~","paragraphs":["lb ' lc \" ld"]},{"title":"Continuation ' Continuation Background Background ' le","paragraphs":["All we have inferred for (1b-d) is that the consequent States overlap; this doesn't constrain the relative"]},{"title":"starts","paragraphs":["of the states. So the"]},{"title":"events","paragraphs":["described in the pluperfect clauses remain unordered, in agreement with intuitions.","A more specific rule than States Overlap, if conflicting with it, may induce orderings among the pluperfect clauses. In the analysis of (2), we assume there are more specific rules than States Overlap, that convey (a) the pragmatic effects of list-type discourse structures; and (b) knowledge concerning the normal course of events when climbing a mountain. These rules favour"]},{"title":"Narration","paragraphs":["being inferred, by default. And by the Penguin Principle, these laws deem States Overlap irrelevant, and so we will infer"]},{"title":"Narration,","paragraphs":["rather than"]},{"title":"Background,","paragraphs":["between the pluperfect clauses in (2)."]},{"title":"Narration","paragraphs":["imposes precedence relations between the consequent states, and so the textual order of the"]},{"title":"events","paragraphs":["matches their temporal order. Thus DICE provides the means to solve the Interaction Problem. 6 Conclusion We have solved some critical problems about the way the pluperfect tense affects the temporal structure and rhetorical structure of narrative text. We have argued that contrary to the Reichenbachian approach, the discourse role of the pluperfect must take the reader's background knowledge into account. We have provided an anMysis in which the pluperfect is viewed as a syntactic discourse marker, which indicates that only a restricted set of discourse relations are permitted in order to attach the current clause to the preceding text. We viewed the simple past and pluperfect as"]},{"title":"sententiaily","paragraphs":["equivalent, although they play distinct discourse roles because of the different constraints they impose on coherent discourse.","When attaching a pluperfect sentence to a simple past tensed one, the task is to infer which of the four discourse relations"]},{"title":"Ezplanation, Parallel, Contrast","paragraphs":["or"]},{"title":"Elaboration","paragraphs":["hold. Information about causation can be used to infer"]},{"title":"Ezplanation.","paragraphs":["Information about structural and semantic similarities and dissimilarities can be used to infer"]},{"title":"Parallel","paragraphs":["and"]},{"title":"Contrast.","paragraphs":["And information obtained from the lexicon can be used to infer"]},{"title":"Elaboration.","paragraphs":["For example, the 257 lexicon provides potential thematic roles which the pluperfect clause can identify: if it does, then this results in an"]},{"title":"Elaboration","paragraphs":["at the discourse level. In this sense, the pluperfect provides a forum in which to explore how information at the lexical level interacts with information at the discourse level.","In the light of this, analysing the pluperfect requires an integrated account of lexical and discourse processing. But this is beyond the scope of this paper. Further research must be pursued in lexical semantics, that addresses the problem of how rhetorical information influences lexical processing. Likewise, the theory of discourse attachment must be augmented with a detailed account of how information flows from the lexicon to the textual level. Both of these issues are explored in (Asher and Lasearides 1993)."]},{"title":"Acknowledgements","paragraphs":["Thanks to Mario Borillo, Myriam Bras, Mimo Caenepeel, Uwe Reyle and two anonymous reviewers for their helpful comments on earlier drafts of this paper. References","[Asher, 1986] Nicholas Asber. Belief in Discourse Representation Theory."]},{"title":"Linguistics and Philosophy,","paragraphs":["15:127-189. lasher, 1993] Nicholas Asher."]},{"title":"Reference to Abstract Objects in English: A Philosophical Semantics for Natural Language Metaphysics.","paragraphs":["Kluwer Academic Publishers.","lasher and Lascarides, 1993] Nicholas Asher and Alex Lascarides. Lexical Disambiguation in a Discourse Context."]},{"title":"Proceedings of the International Workshop on Universals in the Lexicon,","paragraphs":["Dagstuhl, Germany.","lasher and Morreau, 1991] Nicholas Asher and Michael Morreau. Common Sense Entailment: A Modal Theory of Nonmonotonic Reasoning."]},{"title":"Proceedings to the 1Pth International Joint Conference on Artificial Intelligence,","paragraphs":["Sydney Australia, August 1991.","[Blackburn and Lascarides, 1992] Patrick Blackburn and Alex Lascarides. Sorts and Operators for Temporal Semantics."]},{"title":"Proceedings of the Fourth Symposium on Logic and Language,","paragraphs":["Budapest, Hungary, August 1992. [Caenepeel, 1989] Mimo Caenepeel."]},{"title":"Aspect, Temporal Ordering and Perspective in Narrative Fiction.","paragraphs":["PhD thesis, University of Edinburgh","[Caenepeel and Sandstr/~m, 1992] Mimo Caenepeel and Goerel SandstrSm. A Discourse-level Approach to the Past Perfect in Narrative,"]},{"title":"Proceedings of the 4th International Workshop on the Semantics of Time, Space and Movement and Temporal Reasoning,","paragraphs":["Toulouse.","[Grosz and Sidner, 1986] Barbara J. Grosz and Candy L. Sidner. Attention, Intention, and the Structure of Discourse."]},{"title":"Computational Linguistics,","paragraphs":["12:175-204.","[Hamann, 1989] Cornelia Hamann. English Temporal Clauses in a Reference Frame Model, Schopf, A. (ed.)"]},{"title":"Essays on Tensing in English Volume II: Time, Te~4 and Modality,","paragraphs":["pp31-153.","[Hobbs, 1985] Jerry R. Hobbs. On the Coherence and Structure of Discourse. Report No. CSLI-85-37, Center for the Study of Language and Information, October, 1985.","[Kamp, 1991a] Hans Kamp. The Perfect and Other Tenses in French and English, in Kamp, H. (ed.),"]},{"title":"Tense and Aspect In English and French,","paragraphs":["DYANA deliverable 2.3B, available from the Centre for Cognitive Science, University of Edinburgh.","[Kamp, 1991b] Hans Kamp..Procedural and Cognitive Aspects of Propositional Attitude Con-texts. Lecture Notes for the 3rd European Summer School on Language, Logic and Information, Saarbriicken, Germany.","[Lascarides, 1988] Alex Lascarides."]},{"title":"A Formal Semantic Analysis of the Progressive.","paragraphs":["PhD thesis, Centre for Cognitive Science, University of Edinburgh.","[Lascarides and Asher, 1991] Alex Lascarides and Nicholas Asher. Discourse Relations and Defeasibh Knowledge."]},{"title":"Proceedings of the $gth Annual Meeting of the Association for Computational Linguistics,","paragraphs":["pp55-63.","[Lascarides and Asher, 1992] Alex Lascarides and Nicholas Asher. The Pluperfect in Narrative Discourse."]},{"title":"Proceedings of the 4th International Workshop on the Semantics of Time, Space and Movement and Temporal Reasoning,","paragraphs":["Toulouse.","[Lascarides and Asher, in press] Alex Lascarides and Nicholas Asher. Temporal Interpretation, Discourse Relations and Commonsense Entailment. to appear in"]},{"title":"Linguistics and Philosophy.","paragraphs":["[Leech and Short, 1981] Geoffrey N. Leech and Michael H. Short."]},{"title":"Style in Fiction","paragraphs":["Longmans","[Moens and Steedman, 1988] Marc Moens and Mark J. Steedman. Temporal ontology and temporal reference."]},{"title":"Computational Linguistics,","paragraphs":["14:15-28.","[Nakhimovsky, 1988] Alexander Nakhimovsky. Aspect Aspectual Class, and the Temporal Structure of Narrative."]},{"title":"Computational Linguistics,","paragraphs":["14(2):29--43.","[Polany~, 1985] Livia Polanyi. A Theory of Discourse Structure and Discourse Coherence. In Eilfort, W. 258"]},{"title":"H., Kroeber, P. D. and Peterson, K. L. (eds.) Papers from the General Session at the Twenty-First Regional Meeting of the Chicago Linguistics Society, Chicago, April 25-27, 1985. [Pustejovsky, 1991] James Pustejovsky. The Generative Lexicon. Computational Linguistics 17(4):409-441. [Quirk et ai., 1985] andolph Quirk, Sidney Greenbantu, Geoffrey Leech and Jan Svartvik. A Comprehensive Grammar of the English Language. Longman. [Reichenbach, 1947] Hans Reichenbach. Elements of Symbolic Logic. London: Macmillan. [Scha and Polanyi, 1988] Remko Scha and Livia Polanyi. An augmented context free grammar. Proceedings of the ~th Annual Meeting of the Association for Computational Linguistics, pp573-577. [Thompson and Mann, 1987] Sandra Thompson and William Mann Rhetorical Structure Theory: A Framework for the Analysis of Texts. IPRA Papers in Pragmatics, 1:79-105. [Webber, 1991] Bonnie Webber. Structure and Ostension in the Interpretation of Discourse Deixis, Language and Cognitive Processes, 6(2):107-135. [Zeevat, 1986] Henk Zeevat. A Treatment of Belief Sentences in Discourse Representation Theory, in Groenendijk, J., de Jongh, D. and Stokhof, M. (eds.) Studies in Discourse Representation Theory and the Theory of Generalized Quantitiers, Groningen-Amsterdam Studies in Semantics, FoRIs, pp189-215. 259","paragraphs":[]}]}