{"sections":[{"title":"","paragraphs":["DELIMITEDNESS AND TRAJECTORY-OF-MOTION EVENTS *","Michael White","Department of Computer and Information Science University of Pennsylvania","Philadelphia, PA, USA","mwhit e@linc, cis. upenn, edu Abstract The first part of the paper develops a novel, sortally-based approach to the problem of aspectual composition. The account is argued to be superior on both empirical and computational grounds to previous semantic approaches relying on referential homogeneity tests. While the account is restricted to manner-of-motion verbs, it does cover their interaction with mass terms, amount phrases, locative PPs, and distance, frequency, and temporal modifiers. The second part of the paper describes an implemented system based on the theoretical treatment which determines whether a specified sequence of events is or is not possible under varying situationally supplied constraints, given certain restrictive and simplifying assumptions. Briefly, the system extracts a set of constraint equations from the derived logical forms and solves them according to a best-value metric. Three particular limitations of the system and possible ways of addressing them are discussed in the conclusion. 1 Introduction Ever since Verkuyl (1972) first observed that the aspectual class of a sentence depends not only on its main verb (as in Vendler, 1967) but also on its verbal","*The author gratefully acknowledges the helpful com-ments of Jeff Siskind, Mark Steedman, Matthew Stone, and Christy Doran, as well as the support of DARPA N00014-90-J-1863, ARO DAAL03-89-C-0031, NSF IRI 90-16592, Ben Franklin 91S.3078C-1. arguments and modifiers, numerous researchers have proposed accounts of this, the problem of ASPEC-TUAL COMPOSITION. Of course, the ultimate aims of these studies have never been to determine the aspectual class of an expression per se -- clearly a theory-internal notion -- but rather to predict the outcomes of certain aspect-related syntactic and se-mantic tests (cf. Dowty, 1979, Verkuyl, 1989). Likewise, the present paper focuses on these empirical issues, in particular the compatibility of a given expression with for- and in-adverbials and the result-ing existential and downward entailments. As an example of this temporal adverbial test, consider (1) below: (1) (a) John drank beer * in ten minutes.","(*for} (b) 3ohn drank a pint of beer in ten minutes. In example (1) we may observe that the appropriate temporal adverbial is determined by the object of the verb drink -- at least as long as we exclude from consideration iterative, partitive, and other non-basic readings (cf. Moens and Steedman, 1988).","Central to previous approaches to aspectual composition have been attempts to explain the puzzling parallels between count noun phrases and telic sentences on the one hand, which have inherently \"de-limited\" extents, and mass nouns, bare plurals, and atelic sentences on the other, which do not. In connection with this intuitive notion of delimitedness, it has often been observed that mass terms (e.g. beer) and bare plurals (e.g. margaritas) are similar to atelic expressions (e.g. John drink beer / margaritas), insofar as they share the property of REFERENTIAL"]},{"title":"HOMOGENEITY","paragraphs":["(reviewed below). This sets 412 them apart from count noun phrases (eg. a pint of beer) and teiic expressions (e.g. John drink a pint of beer), which do not generally do so.","Observations such as these led Dowty (1979), Hinrichs (1985) and Krifka (1989, 1992) to incorporate various tests for referential homogeneity into their logical forms in order to account for the temporal adverbial variations. I argue against this move here by showing that it engenders a problem which I shall call THE ACCIDENTAL REFERENTIAL HOMOGENEITY PROBLEM (defined below). As an alternative, I develop in the first part of the paper a novel, sortally-based approach to aspectual composition. The account is argued to be superior not only on empirical grounds, insofar as it dissolves this particular problem, but also on computational grounds, insofar as it justifies employing a feature-based approach. While the account is restricted to manner-of-motion verbs (e.g. run), it does cover their interaction with mass terms, amount phrases, distance and locative modifiers, and temporal adverbials.","In the second part of the paper, I describe an implemented system based on the theoretical treatment which determines whether a specified sequence of events is or is not possible under varying situationally supplied constraints, given certain restrictive and simplifying assumptions. These as-sumptions include requiring the sentences to specify trajectory-of-motion events (e.g. Guy jogging from the inn to the bar) which are modeled as continuous constant rate changes of location in one dimension. Briefly, the system extracts a set of constraint equations from the derived logical forms and solves them according to a best-value metric. The system is implemented in SCREAMER, Siskind and McAllester's (1993) portable, efficient version of nondeterministic Common Lisp augmented with a general-purpose constraint satisfaction package. Three particular limitations of the system and possible ways of addressing them are discussed in the conclusion.","2 The Accidental Referential Homogeneity Problem REFERENTIAL HOMOGENEITY is the conjunction of the properties of REFERENTIAL DIVISIVENESS and REFERENTIAL CUMULATIVITY. An expression refers divisively if whenever it applies to a given entity, it also applies to all subentities of that entity, down to a certain limit in size. For example, if there is a material entity to which beer applies, then beer also applies to all its (macroscopic) subparts; the same is clearly not true of a pint of beer. Cumulativity works in the other direction: an expression refers cumulatively if whenever it applies to two entities, it also 'applies to their collection. Here again, if we collect two entities to which beer applies then we get something to which beer also applies; in contrast, if we collect two entities to which a pint of beer applies, we get an entity to which two pints of beer applies instead. Similarly, we may observe that the atelic expression John drink beer refers homogeneously to situational entities (eventualities), unlike the telic expression John drink a pint of beer.","With these properties in mind, THE ACCIDENTAL REFERENTIAL HOMOGENEITY PROBLEM may be stated as follows: some expressions which on intuitive and syntactic grounds should be in the heterogeneous class \"happen\" to refer homogeneously (cf. Schubert and Pelletier 1989). This problem has been noted in passing by Mittwoch (1982), Moens (1987), and Krifka (1989), but to my knowledge has not been systematically addressed by those focusing on the semantics of aspect. The easiest examples to construct involve lexical or quantificational vagueness, though more insidious examples exist involving self-similar objects. For instance, consider Mittwoch's example below:","(2) John wrote something in ten minutes which it took me half an hour to translate. The problem here is that the expression John write something refers homogeneously, but nevertheless combines with an in-adverbial -- if there is an event of John writing something, then all the subevents of that event (down to a certain limit in size) will also be events of John writing something (Mbeit not the same thing), and thus the expression refers divisively; similar considerations show that it refers cumulatively as well. To take another example, consider the following sentence:","(3) John typed a sequence of characters in thirty seconds (which it took me two minutes to write by hand). In (3) the problem is that subsequences of characters are also sequences of characters (albeit different ones), and thus the expression John type a sequence of characters happens to refer homogeneously too.","Since the indicated expressions in (2) and (3) turn out referentially homogeneous rather than heterogeneous, their compatibility with in-adverbials (and not for-adverbials) is problematic for the theories of Dowty, Hinrichs and Krifka. 1 Now, as an alternative to the present approach, one might want to consider basing an account of this problem on differing scope possibilities for the expressions which \"accidentally\" and \"truly\" refer homogeneously -- that is, to some-how allow for different subquantities of beer but not different subsequences of characters. A serious problem for any such approach, however, is the existence of readings where the temporal adverbial has wide scope, as in (4):","1Showing this in detail is beyond the scope of the present paper. For a more detailed exposition of this problem as it relates to Ktifl~'s theory, see White (1993). 413","(4) Amazingly, John replied to every new email message in under two hours. The availability of such wide scope readings does not seem compatible with the idea of requiring the quantified phrase to outscope the temporal adverbial, which would seem to be necessary in order to (always) correctly predict the appropriate temporal adverbial by means of a referential homogeneity test.","Beyond the empirical problems engendered by referential homogeneity tests, there appear to be significant computational ones as well. From the generation standpoint, it seems quite unreasonable to test whether any or all subevents of an event to be described happen to meet the same description be-fore choosing a temporal adverbial to convey duration. Likewise, from the standpoint of interpretation, if one is to make use of aspectual information in processing successive sentences in discourse (as in the theories of Hinrichs, 1986, Moens and Steedman, 1988, and Lascarides and Asher, 1991, for example), there is equally little time for performing such tests. 2"]},{"title":"3 Theory","paragraphs":["3.1 Ontology Various authors (including Link, 1983, Bach, 1986, Krifka, 1989, Eberle, 1990) have proposed model-theoretic treatments in which a parallel ontological distinction is made between substances and things, processes and events, etc. A similarly parallel distinction is employed here, but in a rather different way: unlike the above treatments, the present account models substances, processes, and other such entities as abstract kinds whose realizations vary in amount. As such, the approach developed here may be seen as building upon the work of Carlson (1977) and his successors; it also represents one way to further formalize the intuitions found in Moens and Steedman (1988) and Jackendoff (1991).","Following Schubert and Pelletier (1987), the present account distinguishes individuals from kinds, but not from stages or quantities. Extending their ontology, the same distinction is assumed to hold not only in the domain of materials but also in the domain of eventualities, and derivatively in the do-mains of space and time as well. This extension sets the stage for taking a sortal approach to the semantics of aspect, in contrast to previous model-theoretic accounts. 3.2 Semantics Let us assume a many-sorted higher-order logic with model structures consisting of the following elements, 2A similar point was suggested by Manfred Krifka"]},{"title":"(p.c.).","paragraphs":["Entity • Material - Substance - Thing • Eventuality - Process - Event • Space - Trajectory • Time • Amount - Quantity - Distance - Duration • Number Figure 1: The (Abbreviated) Sort Hierarchy plus an interpretation function: • a set of entities: E • sorts: Material, Eventuality, Kind, ... • binary relations: p, comp, E_, r, amt, ... To structure the set of entities E, we require permissible models to satisfy various axioms on the binary relations.","Roughly following Eberle (1990) and Jackendoff (1991), we assume postulates enforcing the (nonexhaustive) sort hierarchy shown in Figure 1. We also assume that certain sorts cut across the hierarchy, in particular the disjoint sorts Kind and Individual. These sorts partition the sorts Material, Eventuality, Space and Time. Some of the resultant sorts are named in Figure 1; these equivalences are shown below:","• Kinds Substance = Kind f3 Material Process = Kind fl Non-State","• Individuals Thing = Individual fl Material Event = Individual fl Non-State","Following Schubert and Pelletier, we map predicates to kinds using the operator p. To map kinds to their realizations, we employ a relation comp(osed of) inspired by Jackendoff's (1991) conceptual function of the same name. As this relation is central to the present account, its sortal requirements are shown below: 414 (5) Vxy. comp(z)(y) --* Kind(x) A Individual(y) (6) For all S in {Material, Eventuality,...}:","Vxy. comp(z)(y) -* S(z) A S(y)","In the spirit of Krifka (1989) and Eberle (1990), we also employ a partial order ff (part of) on the sort Individual, as well as total orderings ~ and < on the sorts Amount and Number, respectively. F]-- nally, we employ spatio-temporal trace functions r mapping from Eventuality to Space and to Time, as well as a function am(oun)t mapping from Individual to Amount.","We relate the preceding binary relations as follows. First, formal kinds and their realizations are required to satisfy the following axiom: 3 (7) VPz. comp(p(P))(z) ~ P(z) Second, we require the spatio-temporal trace functions r to be homomorphisms preserving the part-of relation, as shown below: (8) Vele2 • el_e2 ~ v(el)__.v(e2) Third, we also require the spatio-temporal trace functions to preserve the composed-of relation, at least when they map processes to kind-level entities, as shown in (9); in the case of the temporal trace function rt, this requirement is strengthened to hold generally, as shown in (10):"]},{"title":"(9) Veal. comp(e)(el) ̂Kind(r(e))","paragraphs":["--* comp(r(e))(r(el )) (10) Veel. comp(e)(ea) --* comp(rt(e))(rt(el)) Fourth, as a correlate of referential divisiveness, we assume that the set of individuals composed of a given kind is closed under the part-of relation; that is, whenever an individual y= is composed of a certain kind z, then all subparts Yl of y~ are also composed of z, as shown in (11). 4 (11) Vxyly2. comp(z)(y2) A ylff_y2 -* ¢omp(z)(yl) Finally, we require the function amt and unit measures such as minutes' to satisfy various fairly obvious postulates concerning the preservation of the orderings __, _ and _<. 3.3 Syntax","The rudimentary categorial grammar given in Figure 2 suffices to derive all of the logical forms in the next section. Note that lexemes such as slime are paired with syntactic categories such as n and se-mantic functions such as slime ~ (where the category vp abbreviates s \\ np). Three e-rules are also employed, one for introducing p in a bare np, one for","SNote that not all kinds need involve #; presumably, conventional kinds such as Coke or Heineken are named directly.","4Because of the notorious MINIMAL PARTS PROBLEM (i.e., how little beer is still beer?), this postulate is not quite correct as stated; amending it would require adding a condition that yl be \"large enough ~ for the kind z. lifting a vp to apply to a generalized quantifier, 5 and one for adding an existential quantifier to the sentence radical (ignoring tense and mood). 3.4 Aspeetual Composition Manner-of-motion verbs such as run, wa&, etc. are interesting insofar as the telicity of the expressions in which they are used is dependent upon both the subject NP and an optional trajectory-specifying PP: (12) John ran along the river for 20 minutes. (13) John ran to the bridge in 20 minutes. (14) Slime oozed into the urn for 20 minutes. (15) Two liters of slime oozed into the urn in 20","minutes. Let us assume that such verbs take material entities as arguments and describe eventualites (either events or processes). To capture their aspectual behavior, we stipulate the following preliminary postulate: For all A in {run', ooze',...} :"]},{"title":"(16) we.","paragraphs":["[Individual(e) Individual(rs(e)) A Individual(z)] Meaning postulate (16) states that if A(z) holds of an eventuality e, where A ranges over run e, ooze ~, etc., then e is an event (an individual eventuality) if and only if its spatial trace rs(e) is an individual trajectory and x is a thing (i.e., an individual material).","If we assume that the expression to the bridge only describes individual trajectories, then postulate (16) forces John run to the bridge to describe an event. In contrast, if we assume that the expression along the river is not restricted in this way, then John run along the river may describe a process as well. To capture this formally, the following meaning postulate is needed: (17) Vzp. to'(x)(p) --* Individual(p) Given the categories listed in Figure 2, the expressions John run along the river and John run to the bridge receive the following translations: (18) Ae. run'(j)(e ) A along'(the'(river'))(rs(e)) (19) Ae. run'(j)(e) A to'(the'(bridge'))(rs(e)) From meaning postulates (16) and (17), it follows that the latter expression must describe events; with no analogous meaning postulate for along, the former expression is free to describe processes as well.","Before continuing, it is worth explaining why postulate (17) is a reasonable one. Recall that a given process stands in the composed-of relation to multiple events. If these events differ in their spatial extents, then the spatial trace of the process cannot sensibly be an individual-level entity, assuming","SThis rule is a simplified version of a more general rule which introduces an existential quantifier over the eventuality variable. 415 John ten liters of slime the run e miles to for in minutes e := np := num := gq [ pp-of\\ num := pp-of/np :--~ n :---- np/ n := np / n :-- s\\np := s \\gq/vp :-- vp\\vp\\num := vp\\vp/tm := vp\\vp/tm := vp\\vp/tm := tm \\num :-\" U/8 : j : 10 : ~nmP. B~. comp(m)(x) ̂amt(~) = liters'(n) ̂P(~) : Az. z : slime' : g : the' : run' : APQe.Q(Az.P(:r)Ce)) : AnPxe. P(z)(e) ̂amt(rs(e)) = miles'(n) : AyPze. P(z)(e) ̂to'(y)(rs(e)) : AdPxel. Be. P(z)(e) h comp(e)(el) ̂amt(rt(el)) = d : ,~dPze. P(z)(e) A amt(rt(e)) _ d : minutes' : AP.Be.P(e) Figure 2: Rudimentary Syntax unique amounts (distances) for individual trajectories; instead, it should be a kind-level trajectory, standing in the composed-of relation to the various individual trajectories corresponding to these multiple events -- as per postulate (9). It is in this sense that the spatial trace of a process may not be \"delimited\" in extent. Of course, this does not mean that the spatial trace of a process cannot be bounded in any absolute sense; in the case of along the river, for example, no resultant trajectory is allowed to continue (very far) past the river's end. l~eturning now to to the river, we may note that this expression describes the end point of a trajectory; as such it is naturally restricted to describing individual trajectories, which always have defined endpoints.","Next we turn to slime and two liters of slime. Given the categories listed in Figure 2, the expressions Slime ooze into the urn and Two liters of slime ooze into the urn receive the following translations:","(20)),e. ooze'(u(slime'))(e) ̂ into'(the'(urn'))(rs(e)) ,Xe. Bz. comp(g(slime'))(z) ̂","(21) amt(x) = liters'(2) ̂ooze'(z)(e) ̂","into'(the'(urn'))(n(e))"]},{"title":"Now,","paragraphs":["if we assume a sortal"]},{"title":"meaning","paragraphs":["postulate for into analogous to that of to, then it follows from the sortal requirements on p and comp that (20) can only describe processes, whereas (21) can only describe events.","At this point we are ready to consider the temporal adverbials. Not surprisingly, the relation comp is crucial to the present account of the for- vs. in-adverbial test data, as can be seen from comparing their semantics: whereas for-adverbials measure out a process using comp and a given amount of time, in-adverbials simply require that an event take place within a given amount of time.","Let us first consider how the machinery developed so far can be used to account for examples (14) and (15), augmented below: (22) Slime oozed into the urn"]},{"title":"{for}","paragraphs":["* in twenty minutes.","(23) Two liters of slime oozed into the urn {*for t","in twenty minutes.","The respective translations of the two possibilities in","(23) follow:","3zeel. comp(p(slime'))(z) A","amt(x) = liters'(2) ̂ooze'(x)(e) ̂","(24) into'(the'(urn'))(rs(e)) ̂","comp(e)(el) ̂amt(rt(el)) = minutes'(20)","Bze. comp(p(slime'))(z) ̂","amt(z) = liters'(2) ̂ooze'(x)(e) ̂ (25) into'(the'(urn'))(rs(e)) ̂","amt(r,(e)) -< minutes'(20) Since the entity e in (24) is required to be an event, comp(e)(el) turns out undefined, s making (24) semantically anomalous. In contrast, lacking comp, the translation in (25) is unproblematic. Similar reasoning shows that (22) can only be compatible with for-adverbials, assuming durations (i.e., amounts of temporal traces) are not defined for processes. Furthermore, these same considerations lead to the correct predictions in examples (12) and (13) as well. T Finally, without further ado the theory makes the correct predictions in (26) below, as distances (amounts of spatial traces) are only defined for events:","sI-Iere I am assuming for expository purposes that the interpretation of a function is undefined if any of its argument terms are not of the appropriate sort, or are undenned themselves.","ZNote, however, that the theory as it stands cannot rule out ? John ran along the river in £0 minutes, which comes out meaning the same thing as John ran some distance along the river in ~0 minutes. 416 * for ~ twenty (26) John ran four miles in j \" minutes.","Up until this point we have relied (in part) on the stipulated postulate (16) to capture the temporal adverbial data. We consider now how we may derive this postulate from more basic assumptions, beginning with the following one: For all A in {run', ooze' .... } :"]},{"title":"Wee~. A(x)(e) ̂comp(e)(e~) --. (27) [3~. A(=l)(el) ̂comp(r.(e))(~.(ed)]","paragraphs":["V [:Ix1. A(xl)(el) A comp(z)(xl)] Postulate (27) is meant to capture in a novel way the intuition that a A process e must be \"measured out\" either by its trajectory Ts(e) or by its material argument x (cf. Krifka, 1989, Dowty, 1991, Tenny, 1992, Verkuyl and Zwarts, 1992). It does so by requiring that all individual events el composed of e be A events with either an individual trajectory %(el) composed of %(e) or an individual material argument x~ composed of x (or possibly both). From (27) follows the only-if (~--) part of (16), as follows: if both x and rs(e) are individual-level entities, then neither of the alternatives in the. consequent of (27) can be true, since the composed-of relation is not defined for individual-level entities; therefore, by way of contradiction, e cannot be a process (at least if we assume all kind-level entities are in the domain of comp).","To make the if(--+) part of (16) follow too, we may employ the following postulate: For all A in {run', ooze',...} :"]},{"title":"(28) We. A(x)(e) ̂Individual(e) R(amt(rt(e) ) )(amtO'Je) ) )(amt(x) )","paragraphs":["Postulate (28) relates the duration of a A event to the length of its trajectory and the quantity of its material argument by some unspecified relation R (which might limit speeds to acceptable ranges, for example). Since amounts are only defined for individual-level entities, this forces the trajectory and material argument of a A event to be individual-level as well. 3.5 Referential Homogeneity Revisited While the property of referential homogeneity does not play a part in capturing the for- vs. in-adverbial test data in the present approach, it is nevertheless necessary to account for certain desired inferences. In particular, we shall need a version of referential divisiveness in order to make the first but not the second inference below a valid one: (29) John ran along the river for five minutes.","John ran along the river for four minutes.","(30) -, John ran to the bridge in five minutes. John ran to the bridge in four minutes. Given the translation of John ran to the bridge in n minutes in (31) below, it is easy enough to see why (30) is not a valid inference: all that is needed is a model in which there is an event of John running to the bridge that takes more than four minutes but takes place within five minutes.","(31) 3e. run'(j)(e) A to'(the'(bridge'))(~',(e)) ̂ amt(rt(e)) _ minuteg(n) Turning now to (29), consider the translations below:","(32) 3ee2. run'(j)(e) A along'(the'(river'))(r.(e)) A comp(e)(e2) A amt(rt(e)) = minutes'(5)","(33) 3eel . run'(j)(e) A along'(the'(river'))(rs(e)) A comp(e)(et) A amt(l\"t(e)) = minutes'(4) Note here that the variables have been (equivalently) renamed to indicate which we shall take to be the same and which different: that is, we shall take e2 and el to be two events of different durations composed of the same process e. To get (29) to follow in this way, we need the following two postulates: For all A in {run', ooze',...} :","(34) Vze2dl . A(z)(e2) A dl _ amt(rt(e2)) ---,","3el . elEe2 A amt(rt(el)) = dl","For all r in {along', to',...} : (35) Vze. r(x)(rs(e)) A comp(e)(el) ---,"]},{"title":"r(x)(r,(el))","paragraphs":["Postulate (34) states that if a A event e2 has duration amt(rt(e2)), then for all lesser durations dl, e2 has subevents el of that duration; postulate (35) states that r trajectory predicates are preserved by the composed-of relation. From postulate (34) it follows that the running event e2 of duration five minutes must have a subevent el of duration four minutes, which we know by (11) to be composed of the same process e; finally, postulate (35) ensures that el is also located along the river, thus validating (29).","In addition to accounting for the downward entailments above, the machinery developed so far also accounts for existential entailments such as the one in (36), assuming the translation of the consequent given in (37): Slime oozed into the urn for ten minutes.","(36) Some amount of slime oozed into the urn in ten minutes. 3zme. comp(/~(slime'))(z) A Amount(m) A"]},{"title":"(37) amt(x) = m ̂ooze'(x)(e) ̂ into'(the'(urn'))(r.(e)) ̂ amt(rt(e)) -< minutes'(10) The inference (36) follows by postulates (27) and","paragraphs":["(35). Since Some amount of slime ooze into the"]},{"title":"urn turns out to be referentially homogeneous, (36) concomitantly shows how the present approach dissolves","paragraphs":["THE ACCIDENTAL REFERENTIAL HOMOGENEITY PROBLEM. 417 3.6 Repetitions So far we have been careful to exclude from consideration the iterative readings that for-adverbials can induce (cf. Moens and Steedman, 1988, Jackendoff, 1991). Here we consider some extensions to the approach developed above which permit these to be captured as well.","Let us begin by adding retried sets to the domain of individuals, along the lines of Link (1983) or Krifka (1989). We do so by partitioning the sort Individual using disjoint sorts Atom and Non-Atom and introducing a new relation __.i (individual part of) isomorphic to the subset relation over the power set of the atoms, minus the empty set (to avoid confusion, we might rename the other part of relation E_q, for quantity part of). We also add a cardinality function [ • ] mapping individuals to numbers, and an operator plur(al) mapping predicates over atoms to predicates over non-atoms. Naturally enough, we require the operator plur to satisfy the following postulate, where __.~i is equal to ___i with its domain restricted to the atoms: (38) VPzlz2. plur(P)(z2) A zl__.aiz2 -\"* P(Zl)","Given this additional machinery, we may account for the iterative readings induced by for-adverbials by simply positing a lexical ambiguity between the reading for"]},{"title":"for","paragraphs":["given in Figure 2 and the one below:"]},{"title":"(39)","paragraphs":["for:"]},{"title":"~dPxel. 3e.","paragraphs":["t~(plur(P(z))) = e ̂ comp(e)(el) ̂amt(rt(e)) = d Note that in reading (39), the process e measured out by the for-adverbial is not the one described by P(z), but rather the one equal to/~(plur(P(z))), which has as its realizations collections of P(z) events of varying cardinalities; note also that the sortal requirements on plur and comp ensure that the two readings off or-adverbials are in complementary distribution, insofar as only one can ever be defined for a given eventuality predicate p.8","Finally, we may observe that these same extensions can be used to give a natural account of frequency adverbials such as twice or n times: (40) twice: APze. plur(P(x))(e) ̂l e 1= 2 4 Application In this section we turn to an implemented system based on the above theoretical treatment which determines whether a specified sequence of events is or is not possible under varying situationally supplied constraints. The domain is limited to trajectory-of-motion events specified by the verbs run, jog,","sit is worth noting that as an alternative to positing a lexical ambiguity, one could just as easily invoke a coercion operator on an event predicate P(z) mapping it to the process predicate he. #(plur(P(x))) = e, which would bring the present treatment more in line with Moens and Steedman (1988) and Jackendoff (1991). plod, and walk; the locative prepositions to, towards, from, away from, along, eastwards, westwards, and to and back; various landmarks; the distance adverbials n miles; the frequency adverbials twice and n times; and finally the temporal adverbials for and in. Trajectory-of-motion events are modeled as continuous constant rate changes of location in one dimension of the TRAJECTOR relative to one or more LANDMARKS (following Regier 1992 in his use of Langacker's 1987 terminology).","Briefly, the system takes a set of landmark loca-tions (which are assumed to remain constant) and an input string from which it derives all possible logical forms for the given sentences; it then extracts a set of constraint equations from the derived logical forms and solves them according to a best-value metric. If a solution is found, it is displayed as a space-time diagram as shown in Figure 3. Note that distances are in miles, durations are in minutes, and the range of rates associated with the verbs are appropriate for a serious athlete.","The best-value metric currently employed is proximity to the median rate for the given manner of motion, summed across successive events. Accord-ing to this metric, an event such as Guy running to the bar takes a default amount of time according to the distance and the median rate; however, an event of Guy running to the bar in n minutes may take less time if this duration is less than the default -- at least up to the point where the specified duration requires exceeding the given maximum running rate, thus making the constraint equations unsatisfiable. Likewise, an event of Guy running along the river (towards the bar, say) for n minutes will yield a default distance according to the amount of time and the median rate; this distance may vary according to more demanding distance requirements imposed by succeeding sentences, again up to a certain point.","The times of successive repetitive events are summed, so that scope differences between frequency and temporal adverbials may be adequately treated; that is, the system correctly determines when one but not the other of Guy jogged to the care and back in ten minutes twice and Guy ... twice in ten minutes is possible. The summing of the durations of successive events also allows the system to determine an appropriate number of iterations for Guy jogged to the cafe and back for 30 minutes. 9","The system is implemented in SCREAMER, Siskind and McAllester's (1993) portable, efficient version of nondeterministic Common Lisp augmented with a general-purpose constraint satisfaction package. Taking advantage of SCREAMER'S compatibility with the COMMON LISP OBJECT SYSTEM, constraints are specified in a declarative, hierarchical fashion. As an example, Figure 4 shows how variables associ-","9Note that the system cannot find a solution for Guy ran to the bar ]or 30 minutes, since there is no provision for adding unspecified events (such as leaving the bar). 418"]},{"title":"Guy's Journey Time 120.00 - 110.00 - 100.00 - 90.00 - 80.00 - 70.00 - 60.00-50.00 - 40.00-30.00 - 20.00 - 10.00 t ~ 0.00 I 0.00 I I 5.00 10.00 Guy - mouth bridge","paragraphs":["m care -"]},{"title":"museum bar inn -dam Location","paragraphs":["Figure 3: Program output for the following input string: \"Guy walked eastwards along the river for 40 minutes. Then he jogged from the cafe to the museum. Next he ran to the bar and back three times in 20 minutes. Finally he plodded to the inn.\" Note that for 20 minutes could have been used instead of three times in 20 minutes. 419 (defclaes trajectory-event () ;;; etc ...","(del~aited :initformnil) ;;; etc ... (defmethod initialize-instance :after ((e trajectory-event) treat inits) ;;; etc ... (assert! (=v dt (-v tl tO))) (assert! (=v d (*v r dr))))) (defclaeerun-event (trajectory-event) ()) (defmethod initialize-instance :after ((e run-event) ~reet lairs) (declare (ignore inits)) (let ((r (slot-value • 'rate))) (assert! (<=v r (/ I 4.5))) (assert! (>=v r (/ i 6.5))))) Figure 4: Declarative, hierarchical constraint specification in SCREAMER. ated with the trajectory-of-motion class of events are constrained according to the formula distance = rate x time; it also shows how a further constraint on rates is associated with the running specialization of this class.","Because the domain is so simple, adequate constraints on trajectories are trivial to specify. Some-what more imaginatively, processes are modeled by their constrained but unsolved-for realizations; they are distinguished from them solely (and efficiently!) by the value of the feature delimited, as justified by the sortal approach advocated in the last section. Likewise, kind- and individual-level trajectories are distinguished by the same feature, in such a way as to maintain postulate (16). Lest the reader miss the point for its simplicity, it is worth emphasizing (recalling Figure 3) that this feature is crucial for determining whether single instances or repetitions are involved in sentences such as Guy walked eastwards along the river/or ~0 minutes and Guy ran to the bridge and back for ~0 minutes. 5"]},{"title":"Conclusion","paragraphs":["In this paper I have presented a novel, sortally-based approach to the problem of aspectual composition which I have argued to be superior on both empirical and computational grounds to previous approaches relying on referential homogeneity tests. I have also described an implemented system based on the theoretical treatment which determines whether a specified sequence of trajectory-of-motion events is or is not possible under varying situationally specified constraints.","Beyond its obvious shortcomings, there are three specific limitations to the system worth mentioning. First, the range of discourses is limited to narrative sequences, which greatly simplifies the necessary reasoning (el. Hwang and Schubert, 1991, Lascarides and Asher, 1991, Hobbs et. el. 1993). Second, the present approach does not lend itself well to flexibly accommodating new information. Third, in the case where a specified sequence of events turns out not to be possible, the constraint satisfaction approach does not provide any mechanism for explaining why this happens to be so. In order to address these problems, in future work I intend to investigate to what extent the present approach can be meshed with the Interpretation as Abduction approach advocated by Hobbs et. al., which appears to be well suited to these issues."]},{"title":"References","paragraphs":["[Bach, 1986] Emmon Bach. The algebra of events. Linguistics and Philosophy, 1986.","[Carlson, 1977] Greg Carlson. A unified analysis of the English bare plural. Linguistics and Philosophy, 1:413-457, 1977.","[Dowty, 1979] David R. Dowty. Word Meaning and Montague Grammar. Reidel, 1979.","[Dowty, 1991] David Dowty. Thematic proto-roles and argument selection. Language, 67(3):547-615, 1991.","[Eberle, 1990] Kurt Eberle. Eventualities in natural language understanding systems. In Sorts and Types in Artificial Intelligence. Springer Verlag, 1990.","[Habel, 1990] Christopher Habel. Propositional and depictorial representations of spatial knowledge: The case of path-concepts. In Natural Language and Logic. Springer Verlag, 1990. Lecture Notes in Artificial Intelligence.","[Hays, 1989] Ellen M. Hays. On defining motion verbs and spatial relations. Technical Report 61, Universit~it des Saarlandes, 1989. SFB 314 (VI-TRA).","[Herskovits, 1986] Annette Herskovits. Language and Spatial Cognition. Cambridge University Press, 1986.","[Hinrichs, 1985] Erhard Hinriehs. A Compositional Semantics for Aktionsarten and NP Reference in English. PhD thesis, The Ohio State University, 1985.","[Hinrichs, 1986] Erhard Itinrichs. Temporal anaphora in discourses of English. Linguistics and Philosophy, 9(1), 1986. 420 [Hobbs"]},{"title":"et al.,","paragraphs":["1988] Jerry Hobbs, Mark Stickel, Paul Martin, and Douglas Edwards. Interpretation as abduction. In"]},{"title":"Proceedings of ACL,","paragraphs":["1988. [Hobbs"]},{"title":"et al.,","paragraphs":["1993] Jerry Hobbs, Mark Stickel, Douglas Appelt, and Paul Martin. Interpretation as abduction, 1993. To appear in Artificial Intelligence Journal.","[Hwang and Schubert, 1991] Chung Hee Hwang and Lenhart K. Schubert. Tense trees as the \"fine structure\" of discourse. In"]},{"title":"Working Notes of the AAAI Fall Symposium on Discourse Structure in Natural Language Understanding and Generation,","paragraphs":["Asilomar,"]},{"title":"CA,","paragraphs":["November 1991.","[Jackendoff and Landau, 1991] Ray Jaekendoff and Barbara Landau. Spatial language and spatial cognition."]},{"title":"LEA,","paragraphs":["1991.","[Jaekendoff, 1991] Ray Jackendoff. Parts and boundaries."]},{"title":"Cognition,","paragraphs":["41:9-45, 1991.","[Krifka, 1989] Manfred Krifka. Nominal reference, temporal constitution and quantification in event semantics. In R. Bartsch, J. van Benthem, and P. van Emde Boas, editors,"]},{"title":"Semantics and Contextual Expressions.","paragraphs":["Dordrecht, 1989.","[Krifka, 1992] Manfred Krifka. Thematic relations as links between nominal reference and temporal constitution. In Ivan A. Sag and Anna Szabolcsi, editors,"]},{"title":"Lexical Matters.","paragraphs":["CSLI, 1992. [Langacker, 1987] Ronald Langacker."]},{"title":"Foundations of Cognitive Grammar I: Theoretical Prerequisites.","paragraphs":["Stanford University Press, 1987.","[Lascarides and Asher, 1991] Alex Lascarides and Nicholas Asher. Discourse relations and defensible knowledge. In"]},{"title":"Proceedings of the PPth Annual Meeting of the Association for Computational Linguistics,","paragraphs":["1991.","[Link, 1983] G6dehard Link. The logical analysis of plurals and mass terms. In R. Bauerle, C. Schwarze, and A. yon Steehow, editors,"]},{"title":"Meaning, Use, and Interpretation of Language.","paragraphs":["de Gruyter, 1983.","[Link, 1987] G/Sdehard Link. Algebraic semantics of event structures. In J. Groenendijk, M. Stokhof, and F. Veltman, editors,"]},{"title":"Proceedings of the Sixth Amsterdam Colloquium,","paragraphs":["1987. [Mayer, 1989] Roll Mayer. Coherence and motion."]},{"title":"Linguistics,","paragraphs":["pages 437-485, 1989.","[Mittwoch, 1982] Anita Mittwoch. On the difference between"]},{"title":"eating","paragraphs":["and"]},{"title":"eating something:","paragraphs":["Activities versus accomplishments."]},{"title":"Linguistic Inquiry,","paragraphs":["1982.","[Moens and Steedman, 1988] Marc Moens and Mark Steedman. Temporal ontology and temporal reference."]},{"title":"Computational Linguistics,","paragraphs":["June 1988. [Moens, 1987] Marc Moens."]},{"title":"Tense, Aspect and Temporal Reference.","paragraphs":["PhD thesis, University of Edinburgh, 1987.","[Pelletier and Schubert, 1989] Francis Jeffry Pelletier and Lenhart K. Schubert. Mass expressions. In D. Gabbay and F. Guenthner, editors,"]},{"title":"Handbook of Philosophical Logic,","paragraphs":["chapter IV.4, pages 327-407. D. Reidel Publishing Company, 1989.","[Regier, 1992] Terrance Philip Regier."]},{"title":"The Acquisition of Lezical Semantics for Spatial Terms: A Connectionist Model of Perceptual Categorization.","paragraphs":["PhD thesis, University of California at Berkeley, 1992.","[Schubert and Pelletier, 1987] Lenhart K. Schubert and Francis Jeffry Pelletier. Problems in the representation of the logical form of generics, plurals, and mass nouns. In"]},{"title":"New Directions in Semantics,","paragraphs":["pages 385-451. Academic Press, 1987.","[Siskind and McAllester, 1993a] Jeffrey Mark Siskind and David Allen MeAllester. Nondeterministic LISP as a substrate for constraint logic programming. Technical Report IRCS-93-03, University of Pennsylvania, 1993.","[Siskind and McAllester, 1993b] Jeffrey Mark Siskind and David Alien McAllester. SCREAMER: A portable efficient implementation of nondeterministic COMMON LISP. To appear in AAAI-93, 1993.","[Tenny, 1992] Carol Tenny. The aspectual interface hypothesis. In Ivan A. Sag and Anna Szabolcsi, editors,"]},{"title":"Lexieal Matters.","paragraphs":["CSLI, 1992. [Vendler, 1967] Zeno Vendler."]},{"title":"Linguistics in Philosophy.","paragraphs":["Cornell University Press, 1967.","[Verkuyl and Zwarts, 1992] Henk Verkuyl and Joost Zwarts. Time and space in conceptual and logical semantics: the notion of path."]},{"title":"Linguistics,","paragraphs":["pages 483-511, 1992. J","[Verkuyl, 1972] H. J. Verkuyl."]},{"title":"On the Compositional Nature of the Aspects.","paragraphs":["Reidel, 1972.","[Verkuyl, 1989] H. J. Verkuyl. Aspectual classes and aspectual composition."]},{"title":"Linguistics and Philosophy,","paragraphs":["12(1), 1989.","[White, 1993] Michael White. On pasta makers and delimitedness. In"]},{"title":"Proceedings of the Penn Review of Linguistics,","paragraphs":["volume 17, 1993.","[Zwarts and Verkuyl, 1991] Joost Zwarts and Henk Verkuyl. An algebra of conceptual structure; an investigation into Jackendoff's conceptual semantics. Forthcoming, 1991. 421"]}]}