{"sections":[{"title":"A Constraint-based Representation Scheme of Collocational Structures","paragraphs":["Dirk Heylent Andr6 Schenkt Marc Verhagenl: (heylen@let.ruu.nl) (schenk@let.ruu,nl) (verhm@sx.ac.uk)","t OTS - Trans 10 -3512 JK Utrecht (NL)","CLMT Essex University - Wivenhoe Park - C04 3SQ Colchester (UK) 1 Introduction The main aim of the ET-10/?5 project, 'Collocations and the Lexicalisation of Semantic Operations '1, is to evaluate the use of Mel'~uk's analysis of collocations in terms of lexical functions 2, as an interlingun device in a machine translation system. In this poster we only point out the main design issues in-volved in encoding the essential parts of this analysis in an HPSG-style framework. Other aspects of the project, such as the definition of collocations, or the evaluation of the analysis as such, will not be dealt with. The linguistic analysis of collocations (as far as it is dealt with in this poster) involves two major issues. • Coding the Mel'~ukian analysis in an HPSG-Iike","grammar. • Designing the architecture of the lexicon. 2 Analysis Examples of the collocational structures we have in mind are strong criticism (as an adjective-noun combination) and give a demonstration (as a verb-noun combination). The essential characteristics we want to account for in our analysis are the following. • The collocational cooccurrence restriction. • The dependence of the meaning of the collocate","on the combination. • The relation between the 'collocate occurrence'","of a word and its free occurrence.","Following Mel'Suk, the restricted choice of the particular adjective or verb is represented in the dictionary by means of lexical functions. The dictionary entry for criticism contains a section in which its 'collocates' are listed, indexed by a lexical function. In this case, we would find: Magn(criticism) = strong. This points out that you can use strong when you want to express Magn(criticism). In our interpretation of these lexical functions, we take them to be general semantic operations, representing the major semantic contribution of the collocate. So we say that strong means Magn (= very, intense ...) in the context of criticism.","As far as translation is concerned, we no longer need a transfer rule mapping 'strong criticism' on","Z We would hereby like to acknowledge the financial support by the Commission of the European Community, Association Suissetra (Geneva) and Oxford University Press.","2See for instance [Mel'(~uk and ~olkovsky, 1988]. 'scherpe kritiek' (lit. sharp criticism)because if both are analyzed as the interlingual Magn, we can leave the correct choice of adjective to the monolingual components.","The HPSG grammars we are using, closely resemble the proposals in [Pollard and Sag, 1987]. As far as the coding of the lexical functions is concerned, we have simply interpreted these as relation names. 3 Representation","Besides the use of a Mel'~ukian analysis and the","choice of an HPSG-style grammar, one of the design","criteria that has guided the representation is to be","'minimally redundant'. This has led to the following","solution. • The collocate is only specified by a partial lex-","ical entry, which is a generalization of its 'free-","occurring' counterpart (its meaning is left un-","specified, for instance). • In the lexicon, it is specified on the base which","collocates it selects for a particular lexical func-","tion. The remainder of the collocation specific","information about the collocate is specified here","as well. The following is part of the entry for criticism to","illustrate the latter issue. The COL field provides","the information that to express Magn(criticism), it","can combine with strong. The reference Sstrong is","to the collocate entry in the dictionary. $criticism:"]},{"title":"PHONcritieisrn COL {,.trong[ CONT,IND [ VAR[1] References","paragraphs":["[Heylen el al., 1993] Dirk Heylen, Andr6 Schenk, and Marc Verhagen. A unification-based representation scheme of collocational structures, to appear, 1993.","[Mel'~uk and Zolkovsky, 1988] I.A. Mel'~uk and A.K. 7,olkovsky. The explanatory combinatorial dictionary. In M. Evens, editor, Relational Models in the Lexicon, pages 41-74. CUP, Cambridge, 1988.","[Pollard and Sag, 1987] Carl Pollard and Ivan Sag. Information Based Syntax and Semantics. CSLI, Stanford, 1987. 469"]}]}