{"sections":[{"title":"Relational Nouns as Anaphors  Hiroaki NAKAMURA","paragraphs":["Department of General Subjects, Japan Coast Guard Academy","Wakaba-cho 5-1, Kure City, Hiroshima,","JAPAN, 737-0832","nakamura@jcga.ac.jp","Yoshiki MORI","Institute of Linguistics and Literature, University of Tsukuba","Tennoudai 1-1-1, Tsukuba-shi, Ibaraki,","JAPAN 305-857 mori@lingua.tsukuba.ac.jp  "]},{"title":"Abstract","paragraphs":["This paper examines the syntactic and semantic properties of a set of nouns recently called \"Relational Nouns\" like mother, neighbor, etc. Relational nouns denote relations between individuals, rather than sets of individuals regular nouns denote, and are referentially dependent on individual-denoting expressions. In Japanese relational nouns may appear 'bare' with no genitive possessors in the noun phrases they project, i.e., but still require the possessors somewhere in sentences. The presence of bare relational nouns allow Japanese to have a lot of peculiar constructions like multiple subject sentence, indirect passives, etc. Assuming the a version of categorial grammar in which the syntax and semantics work in tandem, we discuss the proper way to provide model-theoretic interpretations for expressions containing relational nouns under direct compositionality."]},{"title":"1 Introduction","paragraphs":["It has recently been argued that the relational nouns has peculiar syntactic and semantic properties quite different from those of regular nouns (see Jacobson 1999, 2000; Partee and Borschev 2000; Vikner and Jenssen 1999; Asudeh 2003, among others). Relational nouns denote a wide range of \"relations\" like kinship relations as in mother, child, etc., whole-part relations as in hand, height, etc., location relations as in neighbor, local bar, or ownership relations as in (my) book, (my) car, etc. These nouns, however, share common semantic properties we will see shortly. Also this group of nouns have to do with the occurrence of certain constructions peculiar to Japanese. Consider multiple subject sentence (1a), indirect passive (1b) and relativization clause (1c):  (1) a. Taroo-ga zikka-ga yuufuku-dearu-(koto). Taroo-NOM parents-home-NOM rich-be-PRESS-(FACT) '(the fact that) Taroo's parents' home is rich'","b. Taroo-ga tuma-ni sakidat-are-ta. Taroo-TOP wife-DAT passed-away-PASS-PAST 'Taroo suffered his wife's death.' c. [Tuma-ni sakidat-are-ta otoko-wa] isyoku-nimo fujiyuu-o kanjir-u. wife-DAT passed-away-PASS-REL man-TOP food-or-clothing have-trouble-PRES 'The man who suffered his wife's death suffers hardships in food and clothing.'  The existence of the constructions illustrated in (1) in Japanese, unlike in English, should partly be ascribed to the fact that possessors can \"run away from home,\" i.e., the specifier position of relational nouns, or, putting it differently, relational nouns can occur bare without genitive possessor NPs. Though we do not take the genitive NPs preceding relational nouns to literally have the \"possessor-relation\" to the latter, we continue use the term \"possessor\", following a long tradition, even when the possessor appears in a position distant from a relational noun it is associated with, as in (2):  PACLIC 18, December 8th-10th, 2004, Waseda University, Tokyo (2) a. Taroo-no jikka-ga totemo kanemoti-da. Taroo-GEN.POSS family-home-NOM very rich-be-PRES 'Taroo's parents' home is very rich.\" b. Taroo-ga totemo jikka-ga kanemoti-da. Taroo-NOM.POS very family-home-NOM rich-be-PRES  We will argue that relational nouns are referentially dependent on other (referential) nouns, i.e., they have some sort of anaphoric properties. This hypothesis will explain some interesting phenomena like quantification as shown in (3):  (3) Kono roojin-hoomu-deha subeteno dansei-ga tuma-ni sakidat-are-teiru. In this nursing home, all men-NOM wife-DAT die-earlier-PASS-PAST 'In this nursing home, all men suffered their wives's death.\"  In sentence (3), though only the man variable is universally quantified, the value of wife variable must covary with a particular choice of a man, that is, tuma 'wife' can never take scope over dansei 'man'. Instead of the unselective binding or movement analysis, we propose that relational nouns contain variables to get bound in the course of derivation, and show the analysis in which constructions containing relational nouns, mostly concentration on indirect passive sentences, can be assigned sound model-theoretic interpretations 'on the fly', adopting a version of categorial grammar as our framework."]},{"title":"2 Syntax and Semantics of Relational Nouns","paragraphs":["It is widely assumed that nouns denote properties or sets of individuals and are expressions of type <e,t>. Relational nouns, however, never denote sets. Take furusato 'hometown' as an example. Although there is a set of towns or cities in some model, there is no set of hometowns. Your hometown is probably not my or someone else's hometown. What Furusato actually denote must vary depending on people who are from. It should be noted here that there is no clear distinction between regular nouns and relational nouns. Observe the following pair of sentences.  (4) a. Kooen-de takusan-no kodomo-ga yakyuu-o si-tei-ta. park-IN a lot of children-NOM baseball-ACC play-PROG-PAST 'Many children were playing baseball in the park.' b. Tanaka-san-wa kodomo-ga soori-ni-made na-tta. Ms. Tanaka-TOP child-NOM Prime Minister-to-even become-PAST 'Ms. Tanaka's child eventually became the Prime Minister.'  In (4a), kodomo 'children' implys a set of very young human beings, while kodomo in (4b) has no such implication and simply means some individual who stands in the 'son-of' relation to Ms. Tanaka and became the Prime Minister. Following the recent work on relational nouns (Partee and Borscjev 2000, Vikner and Jenssen 1999, Jacobson 1999, 2000), let us take relational nouns to denote relations between individuals, as in (5):  (5) tuma 'wife' := <e,<e,t>>: λxιy[wife'(x)(y)]  The lexical specification for tuma indicates that it is a function taking male individuals and returning female individuals who stand in the wife-relation to the former. The ι-operator indicates that relational nouns convey a kind of definiteness. In some model, once the value of the male variable is determined, the value of the wife variable is automatically and uniquely determined. Without going into the details of the definiteness effect of relational nouns, let us suppress the ι-operator and variables bound by it for brevity. So we will spell out the meaning of tuma as in λx[wife-of(x)], following Jacobson's work. The way of reflecting the semantics of relational nouns in syntax is to assume that their syntactic category is N/LNP, which indicates that expressions of this category look for an NP argument, a possessor, on its left to yield an expression of category N. In Japanese sentences nouns must be followed by a case particle in principle, which we assume to be a type shifter changing <e,t> expressions of category N to e-type expressions of category NP. We represent the category of relational NPs as NP/LNPGEN.Poss, the functional category looking for a genitive marked NP with the possessor role on its left and assume that expressions of this category are of type <e,e>, functions from individuals to individuals. It is important to distinguish the types, as well as the categorys, of nouns and noun phrases.  (6) Taroo-no tuma-ga ............. NPGEN NPNOM/LNPGEN.Poss: λx[tuma-of'(x)] ------------------------------------------------------------------------- NPNOM: tuma-of'(taroo') One of important characteristics of Japanese is to allow BARE relational nouns possessor to occur independently, that is, to allow relational nouns and possessors to form a kind of discontinuous constituents, as can be seen in the typical multiple subject construction:  (7) a. Zoo-wa totemo hana-ga nagai. elephant-NOM very nose-NOM long 'The elephant's nose is very long.' b. hana-ga totemo nagai zoo ... nose-NOM very long elephant 'the elephant whose nose is very long'  Since relational NPs are of type <e,e> and referentially dependent on \"antecedents,\" they must be bound by the latter to determine the truth values of sentences containing them. In this paper we deal with the binding of possessor arguments in bare relational nouns, concentrating on indirect passives which have no English counterparts, and show some peculiarities of Japanese relational nouns. Observe the indirect passives in (8) as a point of \\departure.  (8) a. Taroo-wa [ tuma-ni sakidat ]-are-ta. Taroo-TOP wife-DAT passed-away-PASS-PAST 'Taroo suffered his wife's death.' b. Taroo-wa [sensei-ni suugaku-no seiseki-o homer]-are-ta. Taroo-TOP [ teacher-DAT math-GEN score-ACC praise]-PASS-PAST 'Taroo have his performance in math praised by the teacher.'  It seems natural to assume that a semantic licensing or felicity condition for indirect passives is the presence of relational nouns in lower sentences indicated by the square brackets in (7).1 In (7a), tuma  1 The presence of relational nouns have not been taken as a felicity or licensing condition for indirect passives in the literature since sentences like (i) have no relational nouns in the (embedded) clauses. (i) a. Kinoo Taroo-wa ame-ni hur-are-ta. yesterday Taroo-TOP rain-DAT rain-PASS-PAST 'Taroo was adversely affected by the rain yesterday.' b. Taroo-wa totuzen Hanako-ni sakidat-are-ta. Taroo-TOP suddenly Hanako-DAT die-PASS-PAST 'Taroo suffered Hanako's sudden death.' We think that sentences like (ia) are exceptional because many intransitive verbs can not be embedded in indirect passives, as in: (ii) *Taroo-wa taihuu-ni kor-are-ta. Taroo-TOP typhoon-DAT come-PASS-PAST Some complex indirect passive forms like ame-ni hur-are-ru, therefore, should be considered to be idiomatic expressions. PACLIC 18, December 8th-10th, 2004, Waseda University, Tokyo 'wife' must be construed as Taroo's wife and seiseki 'score' as Taroo's score.2 Any version of categorial grammar does not posit phonologically unrealized elements as linguistic entities, as in Generative Grammar and treat missing arguments simply as gaps. The anaphoric nature must therefore be attributed to the lexical properties of relational nouns."]},{"title":"3 Relational Nouns and Binding","paragraphs":["How can we get referential nouns bound by NPs which have run away from their possessor positions? Before presenting syntacticand semantic derivationsof indirect passives, let us consider what the notion of (semantic) binding will do to give proper interpretations. We will be given a clue to the analysis from the binding of regular anaphors like reflexives or pronouns. Assuming that sentence (9a), containing the reflexive zibun(-zisin) 'SELF', should be interpreted as in (9b), meaning of sentence (10a) with the relational noun noun should be something like (10b):  (9) a. Taroo-ga zibun(-zisin)-o seme-ta. Taroo-NOM SELF-ACC blame-PAST 'Taroo criticized himself.' b. seme-ta'(taroo')(taroo')  (10) a. Taroo-ga tuma-ni sakidat-are-ta. (=(1b)) b. sakidat-are-ta'(tuma-of'(taroo'))(taroo')  Our main purpose here is to provide the interpretation like (10b)for (10a), without recourse to any assignment functions. There have been two ways to achieve the semantic binding shown in (9b) and (10b) in the literature. First, let us take a look the approach pursued by Jacobson's influential work (Jacobson 1999, 2000; see also Barker 2002). We will modify her analysis to cover the semantic binding of relational nouns in Japanese). As mentioned above, relational NPs are expressions of type <e,e>. She posits a new syntactic category NPNP","for anaphors, which differs from regular NP/LNP (function looking for an NP on the left) in that an expression of category NPNP","has an unbound anaphor in it, which must get bound somewhere in the course of derivation. The superscript NP should be taken to be a kind of feature or information about an unbound anaphor. To combine with an expression of this category, a higher functional category must undergo one of the two type shift operations, what she calls g-rule and z-rule. The g-rule (the syntactic analogue of the Geach-rule), like the slash-feature passing convention in GPSG/HPSG, enables the information of an unbound anaphor to be propagated to larger expressions as if we are composing functions. The z-rule actually carries out binding of the anaphor to a higher argument. Suppose that a linguistic expression is represented as triples <phonological form α; syntactic category; meaning>. The g- and z- rules are defined as in (11) and (12), respectively:  Though there is no relational noun in (ib), this sentence implys that there should be a kinship or some very close relationship between Taroo and Hanako. If this kind of close relationships cannot be inferred from the discourse, sentences like (ib) are unacceptable. We can say that the relational reading is presupposed in sentence (ii). 2 It is often assumed that overt anaphors can show up in the possessor position of relational nouns though they appear to be somewhat awkward or to convey some special implicature, say, exaggeration. (i) ?Taroo-wa jibun-no/kare-no tsuma-ni sakidat-are-ta. Taroo-TOP self-GEN/his-GEN wife-DAT die-PASS-Past Notice here the pronoun kare-no 'his' can never be interpreted to be disjoint in referencefrom the topi Taroo. The reflexive zibun can normally be bound locally or non-locally but, in indirect passiveslike (ii), it is strongly preferred to be coreferential with an NP in a matrix clause. (ii) Taroo-wai Hanako-nij zibun-noi/*?j tuusinbo-o mir-are-ta. Taroo-TOP Hanako-DAT self-GEN report-card-ACC see-PASS-PAST 'Taroo was unhappy when Hanako saw his report card.' This judgment might be another support for our claim that the presence of relational nouns is (at least partly) a felicity condition for indirect passives.  (11) The g rule: Let α be an expression of the form <[α]; A/B; α'>. Then there is an expression β of the form <[α]; AC","/BC",";λc[α'(f (c))]]> (for f of tyep <C',B'> and c of tyep C'.  (12) The z rule: Let α be an expression of the form <[α];(A/NP)/B; α'>. Then there is an expression β of the form <[α]; (A/NP)/(BNP","); α'>; λf[λx[α'(f(x))(x)]]>. (Jacobson 2003:61)  Some assumptions concerning indirect passives are in order before proceeding. As pointed out above, indirect passives require relational nouns to occur somewhere in embedded clauses and the possessor arguments of relational nouns to be coreferential with higher arguments (probably, the experiencer of the passive suffix -rare). The passive suffix rare has the following category and meaning:  (13) rare-ru := (S/LNPExp)/SCOMP: λPλx[rare'(P)(x)]  The embedded clause can be derived as in (14):  (14) tuma-ni sin(u)- NPNP","S/LNP ---------------- g-rule SNP",")/LNPNP"," ------------------------------------------------ Functional Application (hereafter, FA) SNP","of type <e,t> containing an unbound pronoun (in the possessor position of wife)   Rare in (13) must undergo the z-rule to concatenate with (14) and achieve the required binding of the two slots of the derived complex predicate sakidat-are-ta. The whole derivation can be shown as in (15).  (15) Taroo-wa tuma-ni sin(u)- rare-ta SNP",": λx[sinu'(tuma-of'(x))] (S/LNPExp)/LSNP","by z-rule ----------------------------------------------------------------------------------FA S/LNPExp: λx[rare'(sinu'(tuma-of'(x))(x)] [1] ---------------------------------------------------------------------------------------------------FA S: rare'(sinu'(tuma-of'(taroo'))(taroo')) [2]  The point is that the binding of the (possessor of) relational noun to the higher experiencer is fulfilled in the course of derivation, that is, \"binding on the fly\" (Szabolcsi 2003). So the grammar itself must contain the two type shift rules, the g- and z-rules, which can be used at any stage in a derivation if necessary. We call this approach \"Type-shift Approach\" following Jacobson 2003. There is another important approach to deal with anaphor binding in the literature, including Szabolcsi 1989, 1992; Morrill 2004, among others), where the binding requirements are built into the meaning of anaphors. For example, the anaphor zibun-zisin 'self' must be locally bound by the subject or external argument. This binding properties should be ascribed to the lexical semantics of zibun-zisin, though it is the verb semeru in (8) that is reflexivized while the reflexivizer is the anaphor zibun(-zisin). To solve this discrepancy, Szabolcsi (1989, 1992) regard the anaphor as the duplicator in (16):3  3 The combinatory categorial grammar approach Szabolcsi assumes has the three basic combinators in (i)(Szabolcsi 1992: 251) and complex combinators like W can be derived by combining the simple combinators. (i) a. Compositor: B = fgx[f(g(x)] Bfgx = f(gx) b. Connector: S = hgx[h(x)(gx)] Shgx = hx(gx) c. Lifter: = T = xg[g(x)] Txg = gx PACLIC 18, December 8th-10th, 2004, Waseda University, Tokyo (16) Duplicator: W (= ST) := λfλx[fxx] Wfx = fxx where f is of P→(P→Q), and x of P  In order for the anaphor to work as the duplicator in (16), its category must be lifted to the function taking a transitive verb to reflexivize the argument structure of the latter. The category of the reflexive should be (S/LNP)/((S/LNP)/NP). The interpretation in (9b) can be derived as in (17):  (17) Taroo-ga zibun-zisin-o seme-ta. NP: taroo' (S/LNP)/((S/LNP)/LNP):λfλx[f(x)(x)] (S/LNP)/LNP: λxλy[semeta'(x)(y)] --------------------------------------------------------------------------------------------- S/LNP:λx[semeta'(x)(x)] ------------------------------------------------------------------------------------------ S: semeta'(taroo')(taroo')  We can easily extend the lexical semantic analysis of reflexives to relational nouns. Relational nouns should not be bound within its own argument structure since we have no relational noun having the meaning like SELF, as in *Taroo-no zibun. Therefore, the possessor argument of a relational noun must be bound by some higher NP. Suppose the derived combinator, Relational Duplicator, in (18) for relational nouns.  (18) Relational Duplicator: WR","= λfλgλx[f(g(x))(x)]  In fact the combinator (18) is derived by assembling simple combinators in footnote 3 (see Szabolcsi 1989, 1992) but combinatory representations are quite unreadable, so we continue to use the lambda notation just for simplicity. As in the analysis of the reflexive, we have to devise an appropriate category for a relational nouns to take a predicate as an argument, but the category needs to be flexible to concatenate with various types of predicates. As a first approximation, let us assign the simple category and meaning shown in (19) to the relational noun tuma 'wife':  (19) tuma := (S/LNP)/((S/LNP)/LNP): λfλx[f(tuma-of'(x))(x)]  In the lexical semantic analysis of relational nouns, the indirect passive verbs must be formed in the lexicon where the main role of the passive suffix is to add an extra argument, Experiencer, to the argument structure of stem verbs. Given these assumptions, the derivation of (10) should be something like (20):  (20) Taroo-wa tuma-ni sin-are-ta NP (S/LNP)/ (S/NP)/NP: λfλx[f(tuma-of'(x))(x)] (S/NP)/NP ----------------------------------------------------------------------------- S/LNP: λx[sin-are-ta'(tuma-of'(x))(x)]  We have to make the category of relational nouns more flexible to allow them to combine with almost all types of verbs, so we will use the categorial notation NPn","to indicate arbitrary number of noun phrases. The category of relational nouns should be something like (S/NPn-1",")/(S/NPn",") (where n > 1). When a relational noun appear in the object position of a lower verb as in (8b), we give the desired interpretation as shown in (21):    The compositor B in (ia) is the operation which takes f, g, and x and returns f(gx), which is the typical operation of function composition. The connector S in (ib) is also well known as Substitution in Combinatory Categorial Grammar framework pursued by Steedman (1996, 2000). Lifter T is the operation, often called Type Raising, of reanalyzing the argument as a new functor which takes as argument the functor which would have applied to it before lifting. (21) Taroo-wa sensei-ni seiseki-o homer-are-ta NP NP ((S/LNP)/LNP)/(((S/LNP)/LNP)/LNP) ((S/NP)/NP)/NP ----------------------------------------------------------------------- (S/NP)/NP: λxλy[homer-are-ta'((seiseki-of'(x))(y)(x)]  It should be noticed that under the lexical semantic approach, the grammar does not have to have the special type lifting rules, the g- and z-rules, because the necessary interpretation for binding is already incorporated into the meaning of relational nouns. We are flexible enough to derive almost all cases of indirect passives and can easily extend this analysis to other constructions involving relational nouns. Both of the type-shifting approach and lexical semantic approach for anaphora resolution can actually give healthy model-theoretic interpretations to indirect passives without recourse to assignment functions, following the spirit of variable-free semantics. If we adopt the lexical semantic approach, we have to posit a new higher functor category for relational nouns to explain semantic binding properties of 'bare' relational nouns but we can suggest that this special category is necessary to deal with Japanese peculiar constructions involving relational nouns like indirect passives, the multiple subject sentences, etc. If we appeal to the type-shifting approach, however, we further need to explain what can be a trigger of necessary type shifting operations. Also we find other lexically idiosyncratic properties of anaphors, like locality, subject orientation, gender distinction, etc. Japanese does not require genitive pronouns to appear in the possessor position of relational nouns, which suggests that relational nouns should be treated as (partial) anaphors in this language. The fact that possessors and relational nouns can appear separately from each other in Japanese allows a wide variety of peculiar constructions we do not find, say, in English. In conclusion, we are inclined to prefer the lexical semantic analysis of binding to the type-shifting one, sticking to the radical lexicalist view of grammar. In the next section we adapt the analysis of relational nouns to account for relativization and quantification of indirect passives. "]},{"title":"4 Extension of the Analysis","paragraphs":["Pied-piping is not necessary to relativize possessor NPs in Japanese though it has no expressions corresponding English relative pronouns. When the possessor is extracted, the relational noun can remain in situ, as in the sentences in (22).  (22) a. [ hana-ga nagai ] zoo nose-NOM be-long elephant 'the elephant whose nos is long' b. [ tuma-ni sakidat-are-ta ] otoko wife-DAT die-PASS-PAST man 'the man whose wife passed away' c. [ sensei-ni seiseki-o homer-are-ta] kodomo teacher-DAT score-ACC praise-PASS-PAST child 'the child who have his score praised by the teacher'  In the expressions indicated by the square brackets, there must be gaps to make them property-denoting expressions of type <e,t>. Given the tight syntax-semantic relation built in our theory of grammar, we can derive these apparently complex relative clauses without any extra stipulation. In Japanese, a verb finite forms can be as a noun modifying form, that is, a relative clause in Japanese (remember that Japanese has no expression corresponding to relative pronouns in English). When a finite verb is used as a nominal modifier, we should analyse a verb into the stem and the tense suffix and assign the category S/LNP to the stem and (N/N)/(S/LNP) to the tense suffix, which actually takes an open proposition and returns a nominal modifier. Take a simple example. One place predicate aruk-u 'walk' can be used as either a finite verb or a nominal modifier, as in (23):   PACLIC 18, December 8th-10th, 2004, Waseda University, Tokyo (23) a. aruk-u (finite) := S/LNP: λx[walk'(x)] Taroo-ga aruk-u. Taroo-NOM walk-PRES. walk'(taroo')  b. [ e aruk -u ] otoko S/LNP (N/N)/L(S/LNP) N ---------------------------------- N/LN:λxλP[aruku'(x) & P(x)] ------------------------------------------------------ N: λx[aruku'(x) & otoko'(x)]  Assuming these categories and interpretations for Japanese relative clauses, let us turn to the relativization of indirect passive example (21):  (24) sensei-ni seiseki-o homer-are- ta gakusei NP VPn-1","/VPn",": (S/NP)/NP: (N/N)/(S/NP): N: λxλf(f'(seiseki-of'(x),(y),(x)) λxλy[homer-are-ta'(x)(y)] λx[gakusei'(x)] ---------------------------------------------------------------------- S/LNP: λx[homer-are-ta'(seiseki-of'(x))(y)(x)] ----------------------------------------------------------------------------------------------- (N/N): λxλP[homer-are-ta'(seiseki-of'(x))(sensei')(x) and P(x)] ------------------------------------------------------------------------------------------------------------------ N: λx[(homer-are-ta'(seiseki-of'(x))(sensei')(x)) & gakusei'(x)]  Our lexical semantic analysis of relational nouns can give the noun modified by the relative clause the appropriate interpretation of a set of students who have their grades praised by the teachers. Finally, let us take a look at the case of universal quantification. Consider the sentence in (25):  (25) Kaisya-ni kaiko-s-are-ta subete-no sararii-man-wa itsumademo syatyoo-o urami-tsuzuk-eru. Company-DAT fire-PASS-PAST all salaried-worker-TOP forever president-ACC hold-a-grudge-PRESS 'Every salaried worker who was fired by his company continues to hold a grudge against its president.'  Obviously kaisya 'company' can receive a specific reading, taking scope over the universally quantified noun salaried worker. In this case there is a unique company all salaried workers worked for. However, kaisya can also be construed as a relational noun, i.e., the function from salaried workers to companies which fired them. Under this interpretation, every choice of a salaried worker, there is a potentially different company that fired him and a different president that he is holding a grudge against. We may represent the values of the salaried-worker variable, the company-variable and the president variable as in the following trio-list, the set of assignment functions.  (26) salaried worker company president s1 c1 p1 s2 c2 p2 s3 c2 p2 s4 c3 p3 : : :  The proper logical form for (25) should be something like (27):  (27) xιy([sararii-man’(x) & kaiko-sare-ta’(kaisya'(x),(y)), x)] →","urami-tsuzuker-u’(ιz[syatyoo'(y,z)], x))  Our analysis of relational nouns can give sentence (25) the proper interpretation in (27) without appealing to the set of assignment of functions in (26) (suppose that the category TOP for a topic is a function taking open sentences of category S/LNP to yield S and Q-TOP is its universally quantified version in (28)):  (28) kaisya-ni kaiko-s-are -ta subeteno s.w. -wa syatyoo-o urami-tuzuk-eru. VP/Vt2","Vt2","(NP/NP)/VP Q N NPTOP/LN VP/VT2","Vt2"," -------------------------------- ---------------- -------------------------------- ----------------------------------------------- VP: (NP/NP)/VP: Q-NP VP: λxy[kaiko-s-are'(kaisya'(x)(y)),(x)]: x[(P(x) & s.w.(x))Q(x)] z[urami-tuzukeru'(syatyoo'(y)(z))(x)] ---------------------------------------------------------------------------------------------- S/(S/LNP): x[y[(s.w(x) & kaikos-are-ta'(kaisya-of'(x)(y))(x)] & Q(x)] ------------------------------------------------------------------------------------------------------------------------------------------- S: xιy[(sararii-man’(x) & kaiko-sare-ta’(kaisya'(x)(y)),(x)) → urami-tsuzuker-u’(ιz[syatyoo(z,y)], (x)))"]},{"title":"5 Conclusion","paragraphs":["In this paper we have argued that relational nouns, unlike common nouns, denote functions from individuals to sets (when they show up as NPs, they denote relations between individuals), rather than sets of individuals and that they are referentially dependent on other NPs, showing anaphoric properties when they are bare (when they show up without overt possessors) because their possessor arguments must be resolved in the course of derivation via some kind of binding operation. Under the categorial framework which does not posit any kind of empty categories like traces or PROs, the anaphoric nature of relational nouns must be part of their lexical meaning. We discussed the anaphora resolution of bare relational nouns mainly concentrating indirect passives which typically require relational nouns in lower clauses. We have examined the two mechanisms of semantic binding recently developed in the categorial grammar framework, the type shifting approach and lexical semantic approach. Though both of these approaches can give proper interpretations to sentences with relational nouns, we have shown that lexical semantic approach of binding (Szabolcsi 1989, 1992; Morrill 2002) is preferable, taking into account various lexical properties of anaphors including relational nouns. We proposed a new category for bare relational nouns which allow for some peculiar constructions in Japanese. Our simple grammar with the lexical information of binding built into the lexical entries of relational nouns can give sentences involving relational nouns the correct syntactic combinations and semantic interpretations in a parallel manner and the relational nouns can successfully get bound in the course of derivation. Though our analysis of relational nouns might look complicated at a first glance, our grammar actually posit just a few extra categories and meanings for relational nouns. It should be noticed here that an apparently simpler device like co-indexing in the generative grammar can never provide sound model theoretic interpretations to constructions with relational nouns. Following the spirit of variable free semantics (Jacobson 1999, 2000, 2003; Szabolcsi 1989, 1992, 2003), we extended our analysis to cases of quantification and relativization involving relational nouns, without recourse to assignment functions."]},{"title":"Acknowledgements","paragraphs":["We are grateful to the two anonymous reviewers for helpful comments. We'd also like to thank Key Yoshimoto and Masahiro Kobayasi for many discussions on this article. References Asudeh, A. 2003. The Resumptive Puzzle of Relational Nouns. Ms. Barker, C. 1995. Possessive Descriptions. Center for the Study of Language and Information, Stanford. Barker, C. 2002. Remark on Jacobson 1999: Crossover as a Local Constraint. Ms. Dowty, D. 1997. Toward a Minimalist Theory of Syntactic Structure, ms., Ohio State University. PACLIC 18, December 8th-10th, 2004, Waseda University, Tokyo","Engdahl, E. 1988. Relational Interpretation. In R. Kempson (ed.), Metal Representation: The Interface between Language and Reality, 63-82. Cambridge University Press. Hasegawa, N. 1999. Seisei-Nihongogaku Nyuumon. Taisyuukan, Tokyo. Jacobson, P. 1999. Towards a Variable-Free Semantics, Linguistics and Philosophy 22, 117-184.","Jacobson, P. 2000. Paycheck Pronouns, Bach-Peters Sentences, and Variable-free Semantics. Natural Language Semantics 8: 77-155.","Jacobson, P. 2003. Binding without Pronouns (and Pronouns without Binding). Kruiff, G-J. M. and R. T. Oehrle, eds., Resource-Sensitivity, Binding and Anaphora, Kluwer Academic Press, Dordrecht.","Kruijff, G. and S. Vasishth. 2001. Compence and Performance Modelling of Free Word Order, ESSLLI 2001 Course Reader, Helsinki University. Kuno, S. 1973. The Structure of the Japanese Language. MIT Press.","Lee, K. 2000. A CCG Fragment of Korean. Proceedings of PACLIC 14, 219-229, Logico-Linguistic Society of Japan. Mihara, K. 1994. Nihongo-no Tougo-Kouzou: Seisei-bunpou Riron-to Sono Ouyou. Syoohaku-sya, Tokyo. Morrill, G. 2004. On Bound Anaphora in Type Logical Grammar. ESSLLI 2004 Course Material.","Partee, B. and Borschev, B. 2000. Genitives, Relational Nouns, and the Argument-Modifier Distinction. C. Fabricius-Hansen, E. Lang, and C. Maienborn (eds.), ZAS Papers in Linguistics 17:177-201. Sugimoto, T. 1990. Nihon-go no Daisyugo to Syudai. Kyusyu Daigaku Kougakubu Kiyou 3, 165-182. Steedman, M. 1996. Surface Structure and Interpretation. MIT Press. Steedman, M. 2000. The Syntactic Process. MIT Press.","Szabolcsi, A. 1987. Bound Variables in Syntax: Are There Any? In R. Bartsch et. al. eds., Semantics and Contextual Interpretation, Foris, Dordrecht.","Szabolcsi, A. 1992. Combinatory Grammar and Projection from the Lexicon. In I. Sag and A. Szabolcsi, eds., Lexical Matters. Center for the Study of Language and Information, Stanford.","Szabolcsi, A. 2003. Binding on the Fly. Kruijff, G-J. and R. Oehrle, eds., Resource Sensitivity, Binding and Anaphora, Kluwer, Dordrecht.","Trechsel, F. R. 2000. A CCG Account of Tzotzil Pied-Piping. Natural Language and Linguistic Theory 18: 611-663.","Vikner, C. and Jensen, P. A. 1999. A Semantic Analysis of the English Genitive. Interaction of Lexical and Formal Semantics. Ms. Copenhagen and Kolding, Denmark."]}]}