{"sections":[{"title":"On Argument-Adjunct Asymmetry of Sluicing in Mandarin Chinese Li-Chi Lee Chen","paragraphs":["Graduate Institute of Linguistics National Tsing Hua University Address for Correspondence: P. O. Box 2-292 Hsinchu, Hsinchu City 300, Taiwan, R. O. C. E-Mail: g924706@oz.nthu.edu.tw"]},{"title":"Abstract","paragraphs":["This study attempts to account for the argument-adjunct asymmetry of Sluicing in Mandarin Chinese. Such an asymmetry is empirically demonstrated by a language-particular phenomenon, so-called shi-support, which is also the last resort (Chomsky, 1995a) of our linguistic mechanism. In the current related literature, shi-support is obligatory for wh-arguments but optional for wh-adjuncts (Wang, 2002). However, I argue that at the PF level shi-support is even optional for wh-arguments; that is, it is only needed in the derivation at the LF level. My analysis is crucially based on CLM’s (1995) insightful analysis of LF Copying Theory. Departing from their analysis in crucial respects, however, I argue that a covert wh-movement also takes place simultaneously with the operation of copying the antecedent IP. For reasons of economy, such a non-overt movement is preferred and is of the least efforts (Procrastinate). In addition, evidence from shi-support argues that Sluicing in Mandarin Chinese prefers LF copying rather than PF deletion. To sum up, shi-support is compulsory for wh-arguments in that the ECP (Empty Category Principle) requirement must be satisfied at the LF level owning to the intervening “barriers” (Chomsky, 1986). Keywords: argument-adjunct asymmetry, shi-support, Sluicing, LF Copying Theory"]},{"title":"1. Introduction","paragraphs":["Sluicing is an elliptical construction which involves a remnant wh-phrase followed by an empty constituent. Such an elliptical constituent, in the standard assumption, is an IP, and the remnant wh-phrase can escape from being elided in that it has either undergone wh-movement or has been  I am indebted to both Prof. T.-H. Jonah Lin and Prof. Shu-Min Chang for their valuable comments and criticisms. All honors belong to them and all errors are my own responsibility. PACLIC 18, December 8th-10th, 2004, Waseda University, Tokyo base-generated in [Spec, CP]. To account for such an escape of wh-phrase, two derivational theories have been generally adopted, those being PF Deletion Theory (Ross, 1969) and LF Copying Theory","(CLM, 1995) respectively1 . However, Sluicing in Mandarin Chinese is even more complicated since an argument-adjunct asymmetry in this wh-in-situ language is frequently demonstrated by shi-support, and little attention has been given to the point in the current related literature 2 . In this study, I very boldly but bravely, attempt to explore a little further into such an asymmetry in Mandarin Chinese Sluicing. My analysis is crucially based on CLM’s (1995) insightful analysis of LF Copying Theory. Departing from their analysis in crucial respects, however, I argue that a covert wh-movement also takes place simultaneously with the operation of copying the antecedent IP. In addition, evidence from shi-support will help argue that Sluicing in Mandarin Chinese prefers LF copying rather than PF deletion. As for this, there will be a detailed discussion in the following subsections, and the concept of “barriers”(Chomsky, 1986) will be applied in this study as well so as to account for shi-support in Mandarin Chinese Sluicing, which has been touched from time to time but still remains unexplored and unexamined."]},{"title":"2. Asymmetry in Mandarin Chinese Sluicing 2.1 Wh-Construction in Mandarin Chinese","paragraphs":["It is not to be denied that wh-phrases or wh-words may be categorized into two main types, those being wh-arguments and wh-adjuncts. As Mandarin Chinese is a wh-in-situ language, the wh-phrases in this language will stay in their original places, inclusive of wh-arguments and wh-adjuncts, as shown in (1) and (2): (1) a. Zhangsan xihuan shei (wh-argument) Zhangsan like who ‘Who does Zhangsan like?’ b. Zhangsan xihuan Meili Zhangsan like Meili ‘Zhangsan likes Meili.’ 1","The adoption of PF Deletion Theory argues that there is a subsequent deletion operation that affects the IP after wh-movement takes place, while LF Copying Theory states that the remnant wh-phrase is base-generated in [Spec, CP], and its interpretation depends on a special copying rule that operates in the non-overt syntax, that is to say, at the LF level. 2","Wang (2002) carries out a thorough investigation on Sluicing in Mandarin Chinese. He adopts the analysis of PF Deletion Theory (Ross, 1969) and argues that there exists a focus movement in Mandarin Chinese Sluicing. However, in his master thesis there is still no further account for this asymmetrical phenomenon why wh-arguments need shi-support while such a support is optional for wh-adjuncts. In this study, however, I argue that shi-support is an empirical evidence for the covert movement in Mandarin Chinese. I shall have more to say about it later on. (2) a. Zhangsan shenmeshihou aishang Meili (wh-adjunct) Zhangsan when fell in love with Meili ‘When did Zhangsan fall in love with Meili?’ b. Zhangsan shanggelibai aishang Meili Zhangsan last week fell in love with Meili ‘Zhangsan fell in love with Meili last week.’ Judging from (1a) and (2a), we can see that the wh-argument shei ‘who’ and the wh-adjunct shenmeshihou ‘when’ occur in the same places with their counterparts Meili ‘Meili’ and shanggelibai ‘last week’ in (1b) and (2b) respectively. However, in such ordinary, unchanged wh-constructions, we are unable to see the difference between wh-arguments and wh-adjuncts. If we cannot see the difference between them, how can we further account for the asymmetry between these two different kinds of wh-phrases? Fortunately, Mandarin Chinese Sluicing gives an empirical demonstration of such an asymmetry. This will be discussed further in the following subsections. 2.2 Wh-Argument Wh-arguments in Mandarin Chinese are mainly the following two wh-phrases: Shei ‘Who’ and Shenme ‘What.’Since these two phrases belong to the category of so-called wh-phrases, they are immune from being deleted in Sluicing sentences. Interestingly, Sluicing in Mandarin Chinese empirically demonstrates a language-particular asymmetry by the existence of shi before the remnant wh-arguments in an elliptical construction, as shown in (3): (3) a. *Zhangsan xihuan mouren, keshi wo bu zhidao shei Zhangsan xihuan Zhangsan like someone but I not know who Zhangsan like ‘Zhangsan loves someone, but I don’t know who Zhangsan likes.’ b. Zhangsan xihuan mouren, keshi wo bu zhidao shi shei Zhangsan xihuan Zhangsan like someone but I not know be who Zhangsan like ‘Zhangsan loves someone, but I don’t know who Zhangsan likes.’ The sentence in (3a) illustrates that when the IP ‘Zhangsan xihuan’ is deleted, this elliptical construction is judged ungrammatical. However, such ill-formedness and ungrammaticality can be rescued by the insertion of shi before the remnant wh-argument. This escape hatch by shi-support presupposes that shi in the Sluicing construction with a following remnant wh-argument might function as a linguistic mechanism to save the ill-formed Sluicing sentences in Mandarin Chinese. PACLIC 18, December 8th-10th, 2004, Waseda University, Tokyo 2.3 Wh-Adjunct Wh-adjuncts in Mandarin Chinese are even of more different forms than wh-arguments, those being Weishenme ‘Why,’ Zenmeyang ‘How,’ Zainali ‘Where,’ and Shenmeshihou ‘When3 .’ Compared to their counterparts of wh-arguments in Sluicing, the remnant wh-adjuncts in Sluicing don’t have to be preceded by shi, as shown in (4): (4) Zhangsan xihuan Meili, keshi wo bu zhidao (shi) wieshenme Zhangsan xihuan Meili Zhangsan like Meili but I not know (be) why Zhangsan like Meili ‘Zhangsan likes Meili, but I don’t know why Zhangsan likes Meili.’ The Sluicing sentence in (4) evidently shows a great asymmetry between wh-arguments and wh-adjuncts since the former needs shi-support to maintain grammatical, whereas such insertion is optional for the latter. Thus it is presupposed that wh-adjuncts have a quality to fulfill the needs of self-satisfaction while wh-arguments need shi-support to maintain the same status. In the next subsection, I shall be accounting for the occurrence of such an asymmetry."]},{"title":"3. Shi-Support in Mandarin Chinese Sluicing 3.1 Wh-Movement in Mandarin Chinese","paragraphs":["It is commonly agreed that Mandarin Chinese is a wh-in-situ language, which tends to facilitate covert LF wh-movements (cf. Huang, 1982) as well as unselective binding between base-generated Q-operators and in-situ wh-phrases (cf. Tsai, 1999). Both approaches might bring some challenges and problems to the PF deletion theory. However, Wang (2002) argues that LF movements will not rescue the wh-phrases from being deleted, since operations at PF are only effective in dealing with structures in overt syntax, as shown in (5) (5) a. Zhangsan yujianle mouren, keshi wo bu zhidao Zhangsan yujianle shei Zhangsan met someone but I not know Zhangsan met who ‘Zhangsan met someone, but I don’t know who didZhangsan meet.’ b. *Zhangsan yujianle mouren, keshi wo bu zhidao Zhangsan yujianle shei Zhangsan met someone but I not know Zhangsan met who ‘Zhangsan met someone, but I don’t know who did Zhangsan meet.’ (Wang, 2002: 26-27) 3","If we adopt Kuroda’s (1965) insight that a wh-phrase can be decomposed as wh plus some N at LF, there might be more kinds of wh-adjuncts and even wh-arguments. To illustrate, since a wh-phrase can be considered as an existential quantifier, who can be decomposed as wh+someone, what as wh+something, and so on. This decomposition can also be applied in the wh-phrases of Mandarin Chinese. For instance, Weishenme ‘Why’can be decomposed as Shenme ‘What’plus Yuanin ‘reason’or Shenme ‘What’plus Liyou ‘reason.’ Wang (2002) argues that LF movements will not rescue the wh-phrases in Mandarin Chinese from being deleted, since operations at PF are only effective in dealing with structures in overt syntax. This argument will be indefensible, however. In my assumption, wh-phrases in Mandarin Chinese Sluicing will survive till the LF level. They are base-generated in [Spec, CP] and will undergo a covert movement along with the LF operation of copying the antecedent IP. Their interpretation relies on such a special copying rule that operates in the non-overt syntax, namely LF. If we adopt the proposal by Ross (1969), then we will not be able to account for the motivation of shi-support. Such a language-particular phenomenon can neither be accounted for by the analysis of Wang’s (2002) “Focus Movement,” since he wrongly predicts that the movements in the wh-in-situ language like Mandarin Chinese are overt. Both Ross’ (1969) and Wang’s (2002) analyses are ruled out in the Minimalist Program (MP: Chomsky, 1995b) because they are quite unsatisfactory and far-fetched. For reasons of economy, covert movements are preferred and are of the least efforts (Procrastinate). For more specific explanation of the impossibilities of (5b), please see my analysis as shown in (6): (6) LF Copying Theory in Mandarin Chinese Sluicing Spell-Out [IP Zhangsan yujianle mouren], keshi wo bu zhidao [CP [CP shei [IP e]]] 1. Copying of the antecedent IP: [IP Zhangsan yujianle] 2. Covert movement of Shei 3. Shi-Support (Last Resort) PF LF [IP Zhangsan yujianle mouren], keshi wo bu zhidao [CP shi [CP ti [IP Zhangsan yujianle sheii ]]] We see, by adopting the LF Copying Theory (CLM, 1995) to account for the ungrammaticality of (5b), that the IP Zhangsan yujianle shei ‘Who did Zhangsan meet’occurs only at the LF level by three covert steps: copying the antecedent IP, moving the wh-phrase Shei, and inserting Shi. Abandoning Pesetsky’s (1989) Earliness Principle, I adopt so-called Procrastinate Principle4 to argue that the movement at the LF level is more economical and is of the least efforts. In addition, such application at LF can avoid the undesired result of (5b) at the PF level since the movements after spell-out do not affect the phonetic phone at the PF level. However, the existence of shi-support remains a mystery. This is a point to which I shall return in the next subsection. 4","In the Minimalist Program, Procrastinate Principle is a general economy constraint which states that all movements in a derivation should be delayed as long as possible. An operation should take place only when it is needed, and not before. This principle prefers derivations which postpone movements until after spell-out, so that the results of the movements do not affect phonetic phone (Crystal, 1997). In Chomsky’s (1995b) remarks, LF movement is “cheaper”than overt movement. PACLIC 18, December 8th-10th, 2004, Waseda University, Tokyo 3.2 Shi-Support As the Last Resort From the preceding discussion, there exists a presumption that shi-support might function as a savior to rescue the ungrammaticality of Sluicing, in which the remnant wh-argument is not preceded by shi and thus is ill-formed. However, as shi-support is a language-particular phenomenon, it serves only as the last resort 5 . Then what is its syntactic function? In the following discussion, I will argue that shi-support is needed in order to satisfy the ECP (Empty Category Principle) requirement because of the intervening barriers6 . Moreover, shi-support is even optional for wh-arguments at the","PF level7 . By the assumption of Procrastinate Principle, I will adopt the LF Copying Theory (CLM, 1995) to explain the asymmetry between wh-arguments and wh-adjuncts. Somewhat different from their analysis in decisive respects, however, I will prove that a covert wh-movement also takes place together with the operation of copying the antecedent IP. Such movement is more economical, and the mysteries of this argument–adjunct asymmetry will be revealed, as shown in (7) and (8): (7) Covert Movement of Wh-Argument (ex. Shei ‘Whom’) Zhangsan xihuan mouren, keshi wo bu zhidao shi shei Zhangsan like someone but I not know be who ‘Zhangsan likes someone, but I don’t know who’ Spell-Out [IP Zhangsan xihuan mouren], keshi wo bu zhidao [CP [CP shei[IP e]]] 1. Copying of the antecedent IP: [IP Zhangsan xihuan] 2. Covert movement of Shei 3. Shi-Support (Last Resort) properly governed PF LF [IP Zhangsan xihuan mouren], keshi wo bu zhidao [CP shi [CP ti [IP Zhangsan xihuan sheii ]]] barrier 5","For further details, see Chomsky (1995a). 6","For further details, see Chomsky (1986). 7","As a native speaker of Mandarin Chinese, my linguistic intuition tells me that shi-support is optional even for wh-arguments since its occurrence/non-occurrence will not affect the perception of the speaker and the hearer in daily conversation. This presupposes that shi-support is compulsory for wh-arguments only at the LF level for the ECP requirement. This will be under discussion later. (8) Covert Movement of Wh-Adjunct (ex. Weishenme ‘Why’) Zhangsan xihuan Meili, keshi wo bu zhidao weishenme Zhangsan like Meili but I not know why ‘Zhangsan likes Meili, but I don’t know why’ Spell-Out [IP Zhangsan xihuan Meili], keshi wo bu zhidao [CP [CP [IP e] weishenme]] 1. Copying of the antecedent IP: [IP Zhangsan xihuan Meili] 2. Covert movement of Weishenme PF LF [IP Zhangsan xihuan Meili], keshi wo bu zhidao [CP [CP weishenmei [IP Zhangsan xihuan Meili] ti]] barrier properly governed In early 1970s, Chomsky and other linguists argued that empty categories (i.e. traces) should be included in the inventory of category types found in natural languages. Thus traces should also be properly governed, either by their antecedents or by other lexical heads. From (7) and (8) it is quite straightforward and obvious that the traces of wh-arguments and wh-adjuncts should be properly governed to satisfy the ECP (Empty Category Principle) requirement at the LF level. The reason why shi exists before the wh-argument Shei ‘Who’ is that the trace of this wh-argument cannot be antecedent-governed by its antecedent in the lower hierarchical level, and thus must be lexically-governed or head-governed by a lexical head, such as the preceding verb Zhidao ‘know.’ However, there exists a barrier (Chomsky 1986) between this lexical head and the covert wh-argument trace, which has blocked the verb from governing into the intervening CPs. Thus we have nothing but to pursue another lexical head. If unfortunately there exists none, then we will need to create one, such as shi8 . Obviously, shi here functions as the last resort to help maintain the grammaticality at the LF level. On the other hand, since the trace of the wh-adjunct Weishenme ‘Why’is able to be antecedent-governed by its antecedent, shi becomes optional and doesn’t have to appear as the last resort."]},{"title":"4. Conclusion","paragraphs":["My investigation started with a brief introduction of the wh-phrases in Mandarin Chinese. From the occurrence of these wh-phrases, it was proved that Mandarin Chinese is a wh-in-situ language. 8","Although shi-support is our last resort, I don’t give any account why the epenthetic element is shi. According to Shi (1994), shi is a modal verb and the primary marker of emphatic sentences, but this is not the point here. To inquire further into this matter would lead us into another specialized area, and such a digression would undoubtedly obscure the outline of my argument. PACLIC 18, December 8th-10th, 2004, Waseda University, Tokyo However, not all the wh-phrases are the same. They are generally categorized into two main types: wh-arguments and wh-adjuncts. As for these two wh-phrases, there is an asymmetrical phenomenon between them. Such asymmetry is empirically demonstrated by shi-support in Mandarin Chinese Sluicing. However, since shi-support is a language-particular phenomenon, it only functions as the last resort to rescue the ill-formed Sluicing sentences. I also argued that the movement at the LF level is preferred and is of the least efforts due to reasons of economy. Thus I crucially adopted CLM’s (1995) insightful analysis of LF Copying Theory. Different from their analysis in crucial respects, however, I argued that a covert wh-movement also takes place simultaneously with the operation of copying the antecedent IP. In addition, the concept of “barriers” (Chomsky, 1986) was applied in this study as well. To sum up, shi-support is optional at the PF level but is needed for wh-arguments at the LF level in that the ECP (Empty Category Principle) requirement must be satisfied at this stage."]},{"title":"References","paragraphs":["Chomsky, Noam. 1986. Barriers. Cambridge, Mass.: MIT Press. Chomsky, Noam. 1995a. Some Notes on Economy of Derivation and Representation. The Minimalist Program: 129-166. Cambridge, Mass.: MIT Press. Chomsky, Noam. 1995b. A Minimalist Program for Linguistic Theory. The Minimalist Program: 167-218. Cambridge, Mass.: MIT Press. Chung, Sandra, William A. Ladusaw, and James McCloskey. 1995. Sluicing and Logical Form. Natural Language Semantics 3: 239-282.","Crystal, David. 1997. A Dictionary of Linguistics and Phonetics 4th","eds: 309. UK: Blackwell Publishers Ltd. Huang, C.-T. James. 1982. Logical Relation in Chinese and the Theory of Grammar. PhD Dissertation. MIT. Kuroda, S.-Y. 1965. Generative Grammatical Studies in the Japanese Language. PhD Dissertation. MIT. Pesetsky, David. 1989. Language-Particular Processes and the Earliness Principle. MIT. Ross, John Robert. 1969 Guess who? in R. Binnick et al (eds.). Proceedings of the Fifth Regional Meeting of the Chicago Linguistics Society: 252-286. Chicago: University of Chicago Press. Shi, Dingxu. 1994. The Nature of Chinese Emphatic Sentences. Journal of East Asian Linguistics 3: 81-100. Netherlands: Kluwer Academic Publishers. Tsai, Wei-Tien Dylan. 1999. On Economizing the Theory of A-bar Dependencies. New York: Garland. [1994 PhD Dissertation. MIT.] Wang, Chyan-An Arthur. 2002. On Sluicing in Mandarin Chinese. Master Thesis. National Tsing Hua University."]}]}