{"sections":[{"title":"","paragraphs":["Proceedings of the SIGDIAL 2013 Conference, pages 372–374, Metz, France, 22-24 August 2013. c⃝2013 Association for Computational Linguistics"]},{"title":"Roundtable: An Online Framework for Building Web-based Conversational Agents  Eric Forbell and Nicolai Kalisch and Fabrizio Morbini and Kelly Christoffersen and Kenji Sagae and David Traum and Albert A. Rizzo Institute for Creative Technologies University of Southern California Los Angeles, CA 90094, USA {lastname}@ict.usc.edu   Abstract","paragraphs":["We present an online system that provides a complete web-based sandbox for creating, testing and publishing embodied conversational agents. The tool, called Roundtable, empowers many different types of authors and varying team sizes to create flexible interactions by automating many editing workflows while limiting complexity and hiding architectural concerns. Finished characters can be published directly to web servers, enabling highly interactive applications."]},{"title":"1 Introduction","paragraphs":["To support the creation of a virtual guide system called SimCoach (Rizzo et al, 2011) designed to help military service personnel and their families understand behavioral healthcare issues and learn about support resources, a core virtual human architecture that included a new dialogue management approach was developed (Morbini et al., 2012b). SimCoach is an embodied, conversational virtual human guide delivered via the web and is supported by a flexible information state dialogue manager called FLoReS designed to support mixed initiative dialogue with conversational systems. Morbini et al. (2012a) provide a detailed description of the dialogue manager.","Although FLoReS supports a wide variety of virtual human character behaviors, these must be specified in dialogue policies that must be authored manually. Initially, authoring for this dialogue manager required coding of policies using a custom programming language. Therefore significant training for content authors was necessary, as well as substantial support from dialogue system developers in managing resources such as training data for the language understanding system. To improve the accessibility of the system to non-technical subject matter experts and other creative staff, it became clear that additional tools were necessary. In this demonstration, we present Roundtable: a web-based authoring environment for virtual human characters that is designed for use by subject matter experts who are qualified for content authoring in targeted domains, but who may not possess technical skills in programming or experience in dialogue system design."]},{"title":"2 Supporting rapid authoring of dialogue agents for the web","paragraphs":["Roundtable is a complete web-based authoring system enabling the end-to-end creation, validation, testing and web publishing of virtual human characters using the SimCoach virtual human architecture. The system provides features that empower many types of authors, team sizes and makeups. The system allows an author to select from a set of preconfigured 3D character models, model the dialogue policy through behavior templates and more direct subdialogue editing, train and test the natural language understanding component, render animation performances associated with character behaviors and utterances, and test both text-based and fully animated interactions. Finally, the complete character dataset can be exported and deployed to a live, highly available server environment, where interaction data can be monitored and periodically collected for analysis and refinement, all from within the same browser environment (Figure 1). The entire system, from authoring to end-user interaction with 372 the virtual human character, is web-based and requires only a current web browser for content authors and end users."," (a)  (b)  (c)  (d)  Figure 1: Selected modules from the Roundtable character authoring system (a) character project browser; (b) dialogue policy editor; (c) training data manager (d) action and animation asset manager","At the core of the authoring application is an","object-oriented information model and set of","management systems that span the following","roles:","• Dialogue content management, responsible for persistence, search, validation and retrieval operations of all dialogue elements including subdialogue networks; information state variables and effects; goals and effects; and dialogue action an-notations that provide the mapping to the action database.","• Training data management, concerned with managing training items for a data-driven natural language understanding module, as well as providing support for running regressions when updating the training set.","• Action management, provides data operations for managing potentially large sets of virtual human performance-related assets, including utterance text, speech audio when not system-generated, annotated nonverbal behavior schedules, as well as non-performance actions which include web-hosted videos, digested web articles, or any arbitrary HTML effect.","• Deployment management, enabling rapid deployment of locally tested characters to highly available web servers as well as review and data warehousing functions for both analytic and refinement purposes.","The information model is implemented in a relational database that fully specifies, relates and allows inquiry and validation of authored information. Additionally, a complete web application programming interface (API) powers the Roundtable application, providing a transactional framework for data operations as well as user privilege enforcement, but which also allows application expansion.","The information model also serves to decouple the authoring representation from the data structures necessary to drive dialogue behavior at runtime. Prior to realizing an authored character in the FLoReS engine, project dialogue data elements are exported into the format expected by the runtime target, a process that we expect to expand in the future to support different dialogue managers and language understanding configurations. 373  Figure 2: The interactive virtual human character published to the web, accessible by current browsers."]},{"title":"3 Demo script","paragraphs":["This demonstration will show how to build a simple conversational virtual human character using Roundtable, from acquiring an account (http://authoring.simcoach.org, free for academic research) to obtaining the URL for the newly created character, and all of the steps in between. The workflow to build a character is as follows:","1. In the project module (Figure 1a) we create a new character by providing a unique name and selecting an existing 3D character model.","2. Opening the newly created project brings up the interaction module (Figure 1b) where we choose from a list of available subdialogue templates that can be used for common dialogue behaviors (question-answer, greeting, etc.). The provided Greeting and Goodbye templates are used to define the character’s conversational behavior when initiating and ending an interaction, respectively. Invoking the Question-Answer template, we can quickly define how the character will respond to a specific question or statement. Each template requires a name and sample text for any user or system utterance.","3. Following the template-based subdialogue generation, we create training data for the natural language understanding component by providing possible user utterances associated with each user dialogue act in the templates used (Figure 1c).","4. The last task is to refine system utterances, which are generated automatically during the step of policy authoring, and generate animation data. From the action module, we can search and inspect all system actions. For any system action, with a single button click, we can synthesize audio and render animations (Figure 1d).","5. Finally, we navigate to the test module, compile our character project, and are then able to chat with the new character to ensure expected behavior. At this point, the character is ready to be deployed, with its unique URL, and is immediately accessible on the web (Figure 2)."]},{"title":"4 Conclusion","paragraphs":["We described the Roundtable online authoring framework that has been designed to support non-expert users in rapidly creating embodied, conversational virtual characters of varying complexities. The tool, being web-based, requires zero configuration to get started and authored virtual characters can be deployed to In-ternet-facing web servers immediately, expanding the reach of many dialogue-driven applications."]},{"title":"Acknowledgments","paragraphs":["The effort described here has been sponsored by the U.S. Army. Any opinions, content or information presented does not necessarily reflect the position or the policy of the United States Government, and no official endorsement should be inferred."]},{"title":"References","paragraphs":["A. Rizzo, B. Lange, J.G. Buckwalter, E. Forbell, J. Kim, K. Sagae, J. Williams, B.O. Rothbaum, J. Difede, G. Reger, T. Parsons, and P. Kenny. An in-telligent virtual human system for providing healthcare information and support. In J.D. Westwood et al., editor, Technology and Informatics. IOS Press, 2011.","Fabrizio Morbini, David Devault, Kenji Sagae, Jillian Gerten, Angela Nazarian and David Traum FLoReS: A Forward Looking, Reward Seeking, Dialogue Manager in proceedings of International Workshop on Spoken Dialog Systems (IWSDS-2012), Ermenonville, France, November 2012b.","Fabrizio Morbini, Eric Forbell, David DeVault, Kenji Sagae, David Traum and Albert Rizzo. A Mixed-Initiative Conversational Dialogue System for Healthcare. Demonstration in SIGdial 2012, the 13th Annual SIGdial meeting on Discourse and Dialogue, Seoul, South Korea, 2012a.   374"]}]}