{"sections":[{"title":"","paragraphs":["Proceedings of the 9th Workshop on Multiword Expressions (MWE 2013), page 138, Atlanta, Georgia, 13-14 June 2013. c⃝2013 Association for Computational Linguistics"]},{"title":"The Far Reach of Multiword Expressions in Educational Technology Jill Burstein Educational Testing Service 660 Rosedale Road Princeton, NJ 08541 USA JBurstein@ets.org Abstract","paragraphs":["Multiword expressions as they appear as nominal compounds, collocational forms, and idioms are now leveraged in educational technology in assessment and instruction contexts. The talk will focus on how multiword expression identification is used in different kinds of educational applications, including automated essay evaluation, and teacher professional development in curriculum development for English language learners. Recent approaches developed to resolve polarity for noun-noun compounds in a sentiment system being designed to handle evaluation of argumentation (sentiment) in testtaker writing (Beigman-Klebanov, Burstein, and Madnani, to appear) will also be described."]},{"title":"About the Speaker","paragraphs":["Jill Burstein is a managing principal research scientist in the Research & Development division at Educational Testing Service in Princeton, New Jersey. Her background and expertise is in computational linguistics with a focus on educational applications for writing, reading, and teacher professional development. She holds 13 patents for educational technology inventions. Jills inventions include e-rater, an automated essay scoring and evaluation system. And, in more recent work, she has leveraged natural language processing to develop Language MuseSM, a teacher professional development application that supports teachers in the development of language-based instruction that aids English learner content understanding and language skills development. She received her B.A. in Linguistics and Spanish from New York University, and her M.A. and Ph.D. in Linguistics from the Graduate Center, City University of New York."]},{"title":"References","paragraphs":["Beigman Klebanov, B., Burstein, J., and Madnani, N. (to appear) Sentiment Profiles of Multi-Word Expressions in Test-Taker Essays: The Case of Noun-Noun Compounds. In V. Kardoni, C. Ramisch, and A. Villavicencio (eds.) ACM Transactions for Speech and Language Processing, Special Issue on Multiword Expressions: From Theory to Practice. 138"]}]}