{"sections":[{"title":"","paragraphs":["163","Proceedings of the 9th Brazilian Symposium in Information and Human Language Technology, pages 163–167, Fortaleza, CE, Brazil, October 21–23, 2013. c⃝2013 Sociedade Brasileira de Computação"]},{"title":"Modalidade no Português Brasileiro: as estruturas condicionais Priscila Osório Côrtes1 , Heliana Mello1, 2","paragraphs":["1 Laboratório de Estudos Empíricos e Experimentais da Linguagem – Universidade","Federal de Minas Gerais (UFMG) Av. Antônio Carlos, 6627, Faculdade de Letras, sala 4017 – 31270-901 – Belo","Horizonte – MG – Brasil 2 Escola de Matemática Aplicada – Fundação Getúlio Vargas","{pritico,hmello}@ufmg.br Abstract. This paper is an outcome of a project dedicated to the study of modality in spontaneous spoken Brazilian Portuguese, stemming from the C-ORAL-BRASIL corpus (Raso; Mello 2012). Its focus is on conditional strategies as epistemic modal indexes. The study reveals different kinds of realization for conditional structures in speech in relation to their informational organization, in accordance with the hypothesis proposed by the Speech Act Theory (Cresti 2000; 2008). Resumo. Este artigo resulta do projeto de estudo da modalidade no Português Brasileiro de fala espontânea a partir de dados do corpus C-ORAL-BRASIL (Raso; Mello 2012) e tem seu foco nas estratégias condicionais como índice de modalidade epistêmica. O estudo revela tipos diferentes de realização das estruturas na fala, relacionadas à sua organização informacional, segundo a hipótese proposta pela Teoria da Língua em Ato (Cresti 2000; 2008)."]},{"title":"1. Introdução","paragraphs":["Este artigo insere-se no projeto de estudo da modalidade no corpus C-ORAL-BRASIL, que mapeou todas as estratégias de modalização do PB encontradas na amostra (Mello; Côrtes e.p.), assim como no projeto de estudo da sintaxe e da semântica da fala, em fase inicial. O presente estudo tem seu foco na estratégia das construções condicionais como índice modal e na sua organização na fala. Partimos da noção da modalidade como um domínio semântico que acomoda variadas nuances de sentido (conteúdos semânticos desiderativos, intentivos, hipotéticos, dubidativos, dentre outros), adicionadas a uma hipotética estrutura neutra (Mello; Côrtes e.p.) e defendemos que as condicionais são índices de modalidade epistêmica, aquela que diz respeito à avaliação que o falante faz de uma estrutura neutra em termos de possibilidade e necessidade, segundo seus conhecimentos.","As condicionais destacam-se neste estudo porque assumem uma estrutura textual, que difere das estratégias lexicais, e possuem uma distribuição prosódicopragmática peculiar. Vários estudos já atentaram para as instâncias condicionais como veículos de modalidade, como Neves (1999), Vale (2005), Sweetser (1990), Bezerra & Meireles (2009), dentre outros. Condicionais são instâncias hipotéticas que instauram uma condição/possibilidade em que se ancora um julgamento ou consequência. Ao levantamento de uma condição, que é uma projeção para um mundo hipotético, associa-164 se um grau de certeza, sempre inerente à modalização epistêmica. Neste artigo, mostramos como as condicionais, enquanto veículos de modalidade, ocorrem no PB falado e investigamos a sua interação com a estrutura informacional prevista pela Teoria da Língua em Ato (Cresti 2000; 2008), descrita a seguir."]},{"title":"2. Metodologia","paragraphs":["O corpus C-ORAL-BRASIL representa a diatopia mineira da fala espontânea do Português Brasileiro e é segmentado prosodicamente em enunciados e unidades tonais, segundo a Teoria da Língua em Ato (Cresti 2000; 2008), que defende a organização da fala em unidades informacionais1",", as quais compõem enunciados, unidades mínimas de interpretação pragmática que são a contraparte lingüística de uma ação (ilocução). O enunciado se limita por uma quebra prosódica terminal, percebida pelos falantes da língua como de perfil conclusivo.2","As unidades informacionais que podem compor os enunciados têm valor não-terminal (não-conclusivo).","Para este estudo, analisamos manualmente um subcorpus balanceado, representativo do corpus, constituído de 20 textos do domínio informal (30 mil palavras). Reconhecemos como condicionais as estruturas que envolvem a instauração de uma condição ou estado aos quais pode se associar uma conclusão, consequência, julgamento ou ação, ligados principal – mas não somente - pela conjunção “se”."]},{"title":"3. As estruturas condicionais em um corpus de fala espontânea","paragraphs":["Estudos como os de Vale e de Neves mostram que tanto na escrita quanto na fala as condicionais se distanciam de sua dita forma mais canônica, a estrutura lógica “se p, (então) q” para se estruturarem de maneiras diversas. Segundo Neves (1999), as construções condicionais são denominadas tradicionalmente períodos hipotéticos, em que a proposição subordinada, que veicula causa ou condição, é chamada de prótase, e a principal, que veicula a consequência, a conclusão, realização da condição mencionada etc, é a apódose.","Quanto à modalidade, Cresti (2002) e Tucci (2008) defendem que o seu escopo na fala é a unidade informacional. Isso significa dizer que o valor modal veiculado por um índice de modalidade (como os elencados acima) incide apenas sobre o conteúdo locutivo da unidade informacional que o abriga. Em seu estudo sobre a modalidade no PB, Mello & Côrtes (e.p.) corroboram essa hipótese no que diz respeito aos outros índices modais simples, como verbos, adjetivos, advérbios etc. As estruturas condicionais desafiam essa hipótese, porque raramente se limitam a uma unidade informacional, como mostraremos mais adiante. A construção condicional pode ultrapassar os limites de um enunciado ou estar completamente acomodada nele, dividida, ou não, em mais de uma de suas unidades tonais.","Na amostra aqui analisada foram encontrados os seguintes tipos de condicionais com relação à estrutura e à distribuição informacional: Tabela 1. Estrutura sintática e informacional das construções Estrutura Informacional Frequência 1 As UI recebem etiquetas anotadas após as fronteiras prosódias (TOP=tópico; COM=comentário). 2 A fronteira de um enunciado é representada pelo símbolo “//” e a fronteira de uma unidade tonal, por","“/”. 165 Estrutura sintática total TOP / COM CMM / CMM3","COM Enunciados diferentes Outros pro/apo 49 9 7 8 3 76 apo/pro 2 2 2 2 2 10 pro -- -- 21 -- 2 23 Frequência total 109"]},{"title":"4. A relação entre as estruturas sintática e informacional das condicionais","paragraphs":["Conforme mencionado anteriormente, nosso corpus de análise é segmentado prosodicamente em unidades tonais. Partimos do princípio de que a estrutura informacional do enunciado está intimamente atrelada à estrutura sintática das condicionais. Sendo assim, apresentamos a seguir as relações mais frequentes encontradas entre as duas estruturas: prótase-apódose em perfil TOP/COM e prótase realizada no COM. 4.1. Prótase /=TOP= apódose //=COM= (49 ocorrências) (1) *BRU: [268] <e se for uma palavra composta /=TOP= cê faz assim> //=COM=$","O par prótase-apódose-TOP/COM é o mais frequente na amostra. Talvez haja preferência dessa estrutura justamente por causa da própria natureza do padrão TOP/COM, semelhante ao padrão prótase/apódose. O tópico é o campo de aplicação da força ilocucionária presente no comentário, isto é, funciona como uma base para o ato que será realizado em seguida, ao passo que a prótase representa uma condição para a realização ou conclusão da apódose. Portanto, o tópico é uma entidade pragmática que contém alguma informação sobre a qual há referimento posterior, delimitando assim um domínio específico. 4.2. Prótase //=COM= (21 ocorrências) Observando as ocorrências de prótase na amostra, percebemos que elas podem ser categorizadas em três subgrupos de acordo com a realização ou não da apódose, e em caso positivo, com o seu tipo: (a) prótases cuja apódose não é realizada, mas é suspensiva, compreensível intersubjetivamente pelos falantes que participam da interação; (b) prótases que são perguntas parciais; (c) prótases cuja apódose foi realizada anteriormente à prótase, podendo estar diluída no contexto ou ter sido realizada por outro falante. Abaixo encontram-se exemplos dessas estruturas: (2) *ANE: [38] eh /=PHA= se cê n tiver um carrinho queũ [/1]=SCA= que sobe aqui //=COM=$","A ocorrência (2) pertence ao grupo das prótases cuja apódose não é realizada, mas pode ser compreendida no contexto de enunciação (grupo a). A ocorrência desse tipo de prótase não gera dúvidas nos ouvintes sobre o conteúdo da apódose. Este é compartilhado por todos. O falante faz uma asserção sobre a dificuldade de dirigir nas ruas muito inclinadas. 3 A etiqueta CMM refere-se às unidades de comentários múltiplos, descritos mais adiante. 166","Outro contexto em que há ausência de apódose é quando a condicional é na verdade uma pergunta (grupo b), como em: (3) *LUC: [311] <se alguém se enrola hhh> //=COM=$","Em outros casos, prótase e apódose são conjugadas em turnos de falantes diferentes (4), caso em que também não apresentam a sintaxe tradicional: (4) *TER: [22] mas /=INP= gente velha /=TOP= já prometeu o [/1]=SCA= os presente /=TOP= <já /=SCA= pode> garantir que ganhou //=COM=$ *RUT: [23] <ah /=CMM= é> //=CMM=$ [24] se n morrer antesũ <deles //=COM=$ Em (4) a falante RUT estabelece uma condição, expressa pela prótase iniciada pela conjunção “se”, para o que foi dito anteriormente pela falante TER. No entanto, no turno de TER, já há uma construção condicional, daquelas sem a conjunção. O que ela diz poderia ser parafraseado como: “se já prometeram os presentes, já é possível garantir que os ganhou”. Essa ocorrência pertence ao grupo (c), em cujas ocorrências a prótase segue a apódose, que pode não ser canonicamente realizada."]},{"title":"5. Conclusões","paragraphs":["As estruturas condicionais encontradas na amostra apontam para o fato de que a sua manifestação na fala não é canônica em relação ao que se afirma sobre as estruturas proposicionais. A estrutura “se p, (então) q” não reflete o uso das construções condicionais nas línguas naturais. Como observado, a realização canônica da apódose é facultativa; na sua ausência, elementos da situação se misturam à linguagem e constroem estruturas condicionais. Como aponta Greenberg (1963), a forma não-marcada das condicionais nas línguas naturais é a realização da prótase seguida pela apódose. Comrie (1986) defende que a prótase contém a parte essencialmente não-factual da construção. O nosso estudo confirma isso e apresenta a hipótese de que quando ocorre a ordem inversa, o foco da construção está no conteúdo veiculado pela apódose, isto é, a parte mais saliente informativamente é a ação presente na apódose.","Somada a essas, há a questão da realização informacional das condicionais. Neste estudo, encontramos as condicionais acomodadas em variadas estruturas informacionais: prótase e apódose na mesma unidade de comentário, no perfil tópico/comentário, em enunciados diferentes, em perfis de comentários múltiplos etc. Quando a prótase e a apódose são realizadas em enunciados diferentes, a estrutura se completa em atos de fala diferentes, cada um veiculando uma ilocução.","Quanto à epistemicidade das construções condicionais, a modalidade strictusensu está presente na apódose, que traz a avaliação do falante sobre um estado de coisas apresentado na prótase, a qual funciona como instanciador de um espaço hipotético sobre o qual a modalização irá incidir. As condicionais se definem como construções epistêmicas em que uma condição ou estado de coisas hipotético é apresentado (na prótase) e julgado (na apódose).","Observamos também que o escopo da modalidade ultrapassa a unidade informacional quando o índice modal é uma estrutura condicional. Esse aspecto merece uma investigação mais ampla, pois põe em xeque uma premissa da Teoria da Língua em Ato, a de que o escopo da sintaxe é a unidade informacional. 167"]},{"title":"6. References","paragraphs":["Bezerra, W.; Meireles, F. (2009) “Um estudo sobre construções condicionais no Português do Brasil”. In: Miranda, N.; Salomão, M. (Ed.). Construções do Português do Brasil – Da gramática ao discurso. Belo Horizonte: Ed. UFMG, p.150-176.","Comrie, B. (1986) Conditionals: A Typology. In: Traugott, E. C. ; Meulen, A.; Reilly, J.S.; Ferguson, C. A. (eds.) On Conditionals. Cambridge, Cambridge University Press, p. 77-99. Cresti, E. (2000a) Corpus di italiano parlato. Firenze: Accademia della Crusca, v. 1. 2 v.","Cresti, E. (2002) Illocuzione e modalità. In: Beccaria, P. – Marello, C. (eds.) La parola al testo. Scritti per Bice Mortara-Garavelli. Torino: Ed. dell'Orso, p. 133-145.","Greenberg, J. H. (1963) Some Universals of Grammar with Particular Reference to the Order of Meaningful Elements. In: Greenberg, Joseph H. (eds.) Universals of Language. Cambridge, Mit Press, p. 73-113. Mello, H.; Côrtes, P. (em preparação) “Valências modais em enunciados complexos”.","Neves, M. H. (1999) “As construções condicionais” In: Neves, M. H. (ed.) Gramática do Português falado – vol. VII. Campinas: Ed. Unicamp, p. 497-544. Raso, T.; Mello, H. (Ed.) (2012) C-ORAL-BRASIL I. Belo Horizonte: Editora UFMG.","Sweetser, E. (1990) From etymology to Pragmatics: Metaphorical and cultural aspects of semantic structure. Cambridge: Cambridge University Press.","Tucci, I. (2008) “La modalizzazione nel parlato spontaneo. Relazione tra espressioni lessicali della modalità e unità d’informazione.” In: M. Pettorino, A. Giannini, M. Vallone, R. Savy (Eds). La comunicazione parlata. Atti del Convegno Internazionale (Napoli 23-25 febbraio 2006). Napoli: Liguori, pp. 447-64.","Vale, Flávia. (2005) A expressão da condicionalidade no português escrito do Brasil: contínuo semântico-pragmático. Tese de doutorado (Doutorado em Letras Linguística e Língua Portuguesa). Universidade Estadual Paulista, Araraquara, 149p."]}]}