{"sections":[{"title":"","paragraphs":["INTENTIONALITY IN A TOPICAL APPROACH OF DISCOURSE STRUCTURE 1"]},{"title":"Jan van Kuppevelt","paragraphs":["University of Nijmegen - Department of Philosophy (e-mail: JVKUPPEV@ KUNRC1.URC.KUN.NL ) Position paper The alternative to be outlined provides a proposal to solve a central problem in research on discourse structure and discourse coherence, namely, as pointed out by many authors, that of the relationship between linguistic and intentional structure, or, in other words, between subject matter and presentational relations (Mann and Thompson 1988) or informational and intentional relations (Moore and Pollack 1992). As is argued for in Van Kuppevelt (1993), this alternative not only implies uniformity on the structural levels involved, i.e. the linguistic and intentional level, but also on the level of attentional states (Grosz and Sidner 1986). 2 The latter is ruled by the dynamics of topic constitution and topic termination, determining which discourse units are in focus of attention during the development of the discourse. 3 We will see that both linguistic relations and intentions are defined in a uniform way by topic-forming questions in discourse, thereby automatically satisfying the need for a multi-level analysis as is argued for in Moore and Paris (1992), and as is signalled by Dale (this volume), avoiding differences in discourse segmentation between RST analyses and intentional approaches.","The central hypothesis underlying this alternative is that the structural coherence in discourse is governed by the discourse-internal process of questioning, consisting of the contextual induction of explicit and/or implicit topic-forming questions. This process gives rise to the phenomenon that the organization of discourse segments (as well as the associated isomorphic structure of intentions) agrees with the internal topic-comment structure, and that in the following specific way: (i) every discourse unit u(D)Tp has associated with it a topic Tp (or, a discourse topic DTp) which is provided by the (set of) topic-forming question(s) Qp that UTp has answered, and (ii), the relation between discourse units u(D) Ti is determined by the relation between the topic-forming questions Qi answered by these discourse units u(D)Ti. 4","Topics are thus context-dependently characterized in terms of questions arising from the preceding discourse. As is elaborated upon in Van Kuppevelt (1991/92) every contextually induced explicit .... or implicit (sub)question Qp that ...... is answered in discourse constitutes a (sub)topic Tp. Tp ts that which ts questioned; an undetermined set of (possibly non-existent) discourse entitles (or a set of ordered n-tuples of such entities in the case of an n-fold question) which needs further","1 The research for this position paper has been made possible by a fellowship from the Royal Netherlands Academy of Arts and Sciences (KNAW).","2 See especially Sidner (this volume), nodng that tile general term discourse structure relations is ambiguous between intentional, attenfional and linguistic relations.","3 We will left out here a discussion about the essential function of topic (\"focus\") in th¢ production of coherent discourse.","4 So the uniform approach in terms of topic-forming questions differs from, e.g., Hovy (1990) and Lascafides, Asher and Oberlander (1992), where topic (\"focus\") information is considered to be supplementary to discourse rdadons. 136 specification. Comment C a is provided by the answer Ap. It specifies the entities asked for. If the comment-value (that may-not be specific enough, whibh might be the case when specifying a property of the topic entities instead of enumerating them) is satisfactory for the addressee, Tp.iS closed off and loses its actuality in the discourse. Example (1) gives a brief illustration of this topic-comment characterization. (1) Q1 A1 A: Yesterday some notorious people have been arrested. B: Who have been arrested? A: Some members of the mob have been arrested. Topic TI defined by question Q1 is the (still) undetermined set of persons that have been arrested at the given time/place. Comment C1 to this topic is provided by answer A1. Actually, the comment-value it provides does not enumerate the persons asked for but specifies a property which restricts the set of possible answers to Q1.","The process of questioning which is responsible for the assumed structural relations in discourse involves three main functional parameters:"]},{"title":"feeders, topic-constituting questions","paragraphs":["and"]},{"title":"subtopic-constituting subquestions.","paragraphs":["A feeder FI is a linguistic or non-linguistic event whose function is to initiate the process of questioning in discourse or to re-initiate this process if no more questions are induced as the result of the preceding context and the discourse participants want to continue the conversation. An example of a feeder is the opening sentence in (1).","By definition, every explicit or implicit question Qp which is directly asked as the result of a feeder functions as a topic-constituting question. An example is the explicit question Q1 in (1). Apart from the fact that such a question introduces a main, leading topic in the discourse, a so-called program is associated with it implying that the development of the discourse is controlled or restricted by the question. This program consists of the specific task, to be carried out by the speaker (writer), to provide an answer to the question which is satisfactory for the addressee. In a coherent discourse which answers one leading question such a program stretches over the whole discourse which means that the answering process comprises several stages. It will be argued further on that it are precisely these programs which fulfil a crucial function on the intentional level.","In all those cases where the answer to a question is not realized at once, the implied answering process is necessarily mediated by subquestioning: if a topic-constituting question is answered unsatisfactorily this gives, in a recursive way, rise to the contextual induction of subquestions until the original question has been answered satisfactorily. In other words, subquestions are subservient to the program associated with a preceding topic-constituting question in which thcy fulfil a completion function. 5 Examples of subquestions are the implicit subquestions <Q2> and <Q3> in the following example, answered by speaker A (angled brackets indicate the implicit character of a question)."]},{"title":"(2)","paragraphs":["F1 A: QI B: A1 A:"]},{"title":"<Q2>","paragraphs":["A2 <Q3>"]},{"title":"A3","paragraphs":["The opposition has a plan to end the State budget shortage. What does this plan mean? The plan's centrepiece is legislation ordering the Governor to cut drastically in most areas of state government. How much will be cut? As much as 18 percent will be cut. Which areas will be excluded? Welfare for single mothers and children, and for the aged, blind and disabled will be excluded.","Apart from topics and subtopics a topic of a higher order must be assumed as well in order to account for coherence on all structural levels. It is defined in terms of the topics constituted by main","5 The notion of subquesfioning outlined here captures both task-oriented subdialogues and clarification and correction subdialogues (see Litman and Allen 1990 on this point), this in a uniform way. 137 questions and is called a discourse topic. The assumption of discourse topics accounts for the fact that the overall structure of discourse may be discontinuous, due to radical shifts in main subjects. By definition, a discourse topic DTt is the set of all topics Tp (usually hierarchically comprising lower-order subtopics) that are constituted as the result of one and the same feeder Fi (DTi = {Tpl Tp arisen from Fi}). Topic and discourse topic coincide if as the result of a feeder only one topic is constituted ({Tp}:=Tp). For the discourse in (2) this means that DT1 = T1.","As for discourse gtructure, it obtains that it can be divided into coherent units in agreement with the topic hierarchy just outlined. The segmentation structure of (2) according to this topic hierarchy is thus as follows: (2)' uDTi[F1 uTi[QI A1 uT2[<Q2 > A2] uT3[<Q2 > A3]]] O DT1 represents the discourse unit for which discourse topic DT1 is defined. The flat structure shows that this discourse unit consists of feeder F1 and the discourse unit uT1 for which topic T1 is defined. The latter encompasses two direct subunits, U T2 and U T3, for each of which a subtopic is defined.","Fundamental to the approach outlined is that relations on the linguistic level, differently represented and accounted for as what is called coherence relations (Hobbs 1979), schemata (McKeown 1985) and RST relations (Mann and Thompson 1988), are constituted by explicit or implicit (sub)topic-forming questions relating every new sentence (or discourse unit larger than a single sentence) to the preceding discourse and providing it a (subordinate) topic. The approach presupposes a notion of implicit questions implying that the questions answered by a speaker often remain implicit, especially in monologues but also very frequently in dialogues. Apart from the different language specific devices that help to identify these questions (word order, intonation, particles, surface structures like pseudo-cleft structures, etc.), they have the great advantage that the discourse relations they constitute can be identified in a direct way, e.g. with the help of the given accent distribution. Implicit questions are characterized as questions which the speaker anticipates to have arisen with the addressee on interpreting preceding utterances or a non-linguistic event occurring in the communicative context. As such, they imply discourse production to be addresseeoriented, involving, among other things, speaker's beliefs about the addressee's knowledge of background and situation.","As for the relation with intentionality, the communicative goals associated with linguistically related discourse units are expressed by programs (\"tasks\") associated with main, topic-constituting questions. In a coherent discourse that forms an answer to a topic-constituting question such an intention is expressed by the program imposed on the development of the whole discourse. We already indicated that subquestions fulfil a specific completion function in the factual realization of such programs. Actually, the intention is the result of a program if carried out adequately, namely the desired effects which a satisfactory answer to the question brings about on the hearer's knowledge state implying a change in the mutual belief of speaker and hearer. Let's consider example (3) for a brief illustration."]},{"title":"(3)","paragraphs":["FI A: Tomorrow I will visit Harry. QI Where does he live? A1 B: He lives in Amsterdam .... The communicative goal, expressed by the program associated with question QI, is to achieve a specification of the place where Harry lives. Obviously, it must specify this place to an extent compatible with the context that gave rise to Q1, namely in such a way that speaker A is able to identify the place in question.","The presented uniform account of relations and intentions is in agreement with the assumed functional differences between them. As argued for by Hovy (this volume) intentions govern content (\"what is to be said\") and relations the expression of a content (\"how the material is to be 138 expressed in the language itself\"). This agrees with our account in the following way. The program associated with a main question determines what has to be said such that the discourse comes to a satisfactory end, while the question itself governs how this content is expressed. For instance, the same content can be expressed differently depending on the question that is answered. However, as may be clear from the foregoing, we disagree with Hovy that intentions and relations differ in their range of specifying discourse structure. Both relations and intentions define coherence on the local and global level, this in agreement with the topic-comment structure of discourse.","Apart from the above mentioned, our approach accounts, in a systematic way, for the problem of appropriate responses to \"follow-up questions\", as signalled by Moore and Paris (1992) and Moore and Pollack (1992). The problem is that, among other things, the spewer (system), in order to answer effectively to these questions, needs a record of the intentions underlying preceding utterances that gave rise to these questions. In our system these questions are analyzed as subquestions which must be interpreted in the context of the intention associated with the main question answered by the preceding utterances. A necessary condition for an answer to be an appropriate response to a follow-up question is that it must be complementary with respect to the incomplete answer given to the main question, thereby satisfying the intention associated with that question. However, contrary to what the authors suggest, we do not need a record of the intentions of all preceding utterances but only of those that are still actual in discourse. This process is captured by a principle implying that a question and the associated intention is continued as long as subquestions of that question, indicating that the original question has not yet been answered satisfactorily, occur in the discourse. References Dale, R. (1993).\"Rhetoric and Intentions in Discourse.\" This volume. Grosz, B.J. and Sidner, C.L. (1986). \"Attention, Intentions and the Structure of Discourse.\"","Computational Linguistics, 12, 175-204. Hobbs, J.R. (1979). \"Coherence and Coreference.\" Cognitive Science, 3, 67-90. Hovy, E. (1990). \"Unresolved Issues in Paragraph Planning.\" In Current Research in Natural","Language Generation, edited by R. Dale, C. Mellish, and M. Zock. Academic Press. Hovy, E. (1993). \"On the Relationship between Intentions and Structural Relations in Discourse.\"","This volume. Lascafides, A., Asher, N. and Oberlander, J. (1992). \"Inferring Discourse Relations in Context.\"","In Proceedings of the 29th Annual Meeting of the ACL, 55-63. Litman, D.J. and Allen, J.F. (1990). \"Discourse Processing and Commonsense Plans.\" In","Intentions in Communication, edited by P.R. Cohen, J. Morgan and M. Pollack, 365-388.","MIT Press. Mann, W.C. and Thompson, S.A. (1988). \"Rhetorical Structure Theory: Toward a Functional","Theory of Text Organization.\" Text, 8, 243-281. McKeown, K.R. (1985). Text Generation: Using Discourse Strategies and Focus Constraints lo","Generate Natural Language Text. Cambridge University Press. Moore, J.D. and Paris, C.L. (1992). \"Planning Text for Advisory Dialogues: Capturing Intentional","and Rhetorical Information.\" Technical Report 92-22, University of Pittsburgh, Department of","Computer Science, Pittsburgh, PA. Sidner, C.L. (1993). \"On Discourse Relations, Rhetorical Relations and Rhetoric.\" This volume. Van Kuppevelt, J. (1991). Topic en Comment: Expliciete en Impliciete Vraagstelling in Discourse.","Ph.D. thesis, University of Nijmegen. Van Kuppevelt, J. (1992). \"Discourse Structure, Topicality and Questioning.\" Submitted. Van Kuppevelt, J. (1993). \"About a Uniform Notion of S- and D-topics.\" To appear in","Proceedings of the Conference on Functional Description of Language, Charles University,","Prague, November 1992. 139"]}]}
