{"sections":[{"title":"Planning for Intentions with Rhetorical Relations","paragraphs":["Susan M. Haller","Department of Computer Science","State University of New York at Buffalo","haller@cs.buffalo.edu","A viable model of interactive discourse must explain how interlocutors share conversational control to construct the discourse, and recognize the contributions of others to it. The position that I take in this paper is from a narrower perspective, one in which there is a primary speaker who controls and directs the discourse, but that does so while trying to accommodate the informational needs of someone who primarily listens, and who believes what the speaker has to say. From this perspective, I will argue that speakers realize their intentions by conveying rhetorical relations. With the primary speaker's intent understood, I maintain that the primary listener's contribution prompts the speaker to express his intent with rhetorical relations that satisfy the listener's informational needs. Both the intentions of the primary speaker, and the primary listener's feedback are interpreted in the context of their shared beliefs about the domain, their shared beliefs about the discourse that has been constructed so far, and their common, language-based knowledge of possible extensions to it.","Researchers have argued for several years that communicative intent not only exists, its recognition by a listener is essential in order for communication to occur [Aus62, Gri69, GS86]. More recently, Mann and Thompson have proposed that the juxtaposition of propositional content communicates one or more rhetorical relations [MT87]. Their theory, Rhetorical Structure Theory (RST), explains coherent text structure in terms of a set of rhetorical relations that exist between units of text. The model that I use for planning discourse about domain plans in interactive set-tings was developed under the assumption that intentions and rhetorical relations exist, and that the relations that a speaker chooses to express are appropriate to conveying her underlying intentions [Hal93]. These assumptions are consistent with views that have been expressed by others [Kib93, KK93, Lim93, Mai93, MP93, Tra93].","The following dialogue illustrates a relationship between intentions and rhetorical relations that my model captures: Jack: Jill: I'm going shopping at Wegman's (1) These checks must go in the mail today. (2) There is a mailbox to the right as you go into Wegman's. (3) Jill's remarks convey her intention to have Jack mail some letters, however her request is [,ol, explicit in either line (2) or (3). In addition to the assertional content of each sentence, when ,Jill follows line (2) with line (3), she conveys to Jack that a relation holds between these pieces of information. This relation is that the information in line (3) allows the situation in line (2) to be dealt with effectively. In terms of Mann and Thompson's rhetorical relations, the content of line (3) is enablement for line (2). It is Jill's conveyance of this relation that communicates her intention, thereby making her request. Furthermore, Jill believes that Jack knows how different rhetorical relations relate to discourse intentions. This assumption is as basic as her assumption that Jack will know the words that she uses. 23","Assuming that intentions are conveyed by expressing appropriate rhetorical relations, Moore and Pollack note that RST becomes problematic IMP92]. The RST relations fall into two classes."]},{"title":"A presentational","paragraphs":["relation is used by a speaker to affect the mental attitude of the listener, and a"]},{"title":"subject-matter","paragraphs":["relation is used to inform the listener of the relation itselfi When analyzing text in which relations of both types apply, Mann and Thompson suggest that only one is appropriate, which one that is, depends on whether conveying an intention, or conveying a relation is the essential text purpose. Moore and Pollack argue against this view taking the position that a speaker always structures information in a discourse with an overarching intention in mind. They note, for example, that a speaker may convey an object-attribute relation with intentions at two levels: at the level of information, the speaker intends for the listener to recognize the object-attribute relationship, and at the level of communicative activity, the speaker intends for the listener to be able to carry out some plan. Moore and Pollack refer to these levels as the"]},{"title":"informational","paragraphs":["and"]},{"title":"intentional","paragraphs":["levels respectively, and they contend that a theory of discourse must account for this duality.","In my system planning at the intentional level always precedes planning at the informational level. I use a planning/acting system, the SNePS Actor [KS91] to formulate, represent, and execute text plans in an interactive environment. The text plan that my system builds is about a domain plan that is under discussion. In developing my model I have had to consider the relationship between intentions and information from the perspective that the system is directing the discussion, and making its own intentions clear. From this perspective, planning at the intentional level is primary, and can, and often does, lead to planning at the informational level.","In my system, there are two kinds of text plans that correspond to the intentional and informational levels that Moore and Pollack distinguish. In response to a question, my system first formulates goals and plans to influence the listener's mental attitude or abilities. I have identified two intentions that are useful for planning text about plans. First, with respect to the listener's mental attitude, my system plans text to try to have a listener adopt a domain plan. Secondly, with respect to the listener's abilities, my system plans text so that a listener will be able to execute a domain plan. The initial text planning that my system performs is to try to achieve one of its intentions, these text plans are called"]},{"title":"discourse plans.","paragraphs":["The discourse plans in my system are based o. Searle's speech acts [Sea69], and Mann and Thompson's presentational rhetorical relations.","The system's discourse plans can, and sometimes do, operate on their own. This decision is based on the observation that speakers can make utterances that convey an intention, but are otherwise content-free. Direct speech acts like the simple request, \"Close the door.\" are productions of this kind. However, another way that speakers communicate their intentions is by expressing rhetorical relations. For example It's cold in here. (4) Close the door. (5) makes the same request as before, however, it conveys two additional pieces of information. One piece is the assertional content of (4), and the second piece is that (5) is a"]},{"title":"solution","paragraphs":["to a problem presented in (4). The second piece of information is a rhetorical relation that underscores the request. For this reason, in my system, discourse plans can expand out to include a second type of text plan."]},{"title":"Content-selection plans","paragraphs":["correspond to subject-matter rhetorical relations. These plans select additional content for the discussion, but they do so only as part of a discourse plan.","In my model, an assumption that underlies analysis of the user's feedback is that discourse plans, and their appropriate expansions in terms of rhetorical relations are common knowledge. Therefore, the system incorporates each of its plans into a single, overarching plan for the discourse. This plan is represented in the system's knowledge base, and it is updated as the system continues to plan and interact. When the system speaks, if the listener does not know the system's underlying 24 discourse intent beforehand, it is assumed that he will recognize it from the rhetorical relations that are conveyed. If the listener does know the system's intentions in advance, it is assumed that he will use this knowledge to make sense of the system's contribution. Therefore, my model is consistent with the observations of others that understanding between the intentional and the informational level can flow in either direction [GS86, MP92].","Following Carberry, I assume that when the listener knows the speaker's intention the listener has expectations for what will follow [Car89]. In my model, these expectations take the form of a set of rhetorical relations that are typically used to realize a given intention. Motivated by Grice's cooperative principle and the maxims of Relevance and Quantity [Gri75], the system analyzes feedback using its executed text plan as the discourse context. I assume that the listener's vaguely articulated feedback addresses the system's intent, and that in the context of the system's discourse plan and what is mutually believed, it provides enough information for the system to decide how to expand its discourse plan. This approach explains why the question \"Why?\" is unambiguous in the following interaction: Jack: Take the No. 4 train. (6) Jill: Why? (7) Jack: It will get you there fast. (8)","There are two types of mutual belief that the interlocutors use to coordinate this kind of interaction: shared beliefs and common knowledge. First, let us assume that based on beliefs that exist prior to this exchange, Jack and Jill share tile belief that Jill has a goal, for example, going downtown. Secondly, Jack and Jill believe that, as language users, they possess common knowledge of the preconditions on discourse plans for activities like advising and requesting. Using both types of knowledge, Jack can infer that Jill has interpreted his initial remark at line (6) as advice on how to pursue her goal, and not as a request for an act to achieve a goal that she may not know. This inference is notwithstanding the fact that both speech acts can be realized with the utterance at line (6).","To analyze Jill's response, Jack relies again on both their shared beliefs, and common knowledge about how discourse plans are realized in terms of rhetorical relations. When Jill asks \"Why?\" at line (7), Jack knows that advice can be meted out on its own, as Jack did in line (6), or it can be realized with a rhetorical relation, preferably one that uses a clause that has already been expressed. Since Jill knows this too, Jack concludes that her question is referring to the motivation that typically augments requests and advice. Therefore, Jack interprets Jill's why-question as a prompt to continue the discourse with this type of information. This approach is supported by the observation that Jack could have planned the advice with the motivation in the first place. Lines (9) and (10) in the following example illustrate this: Jack: Take the No. 4 train. (9)","It will get you there fast. (10) Jill: Why? (11) Jack: It's an express. (12) In this example, because Jack has already provided the motivation, Jill's why-question (line (11)) asks a different question. Since Jack knows his own intentions and how they are being expressed, and .because this knowledge is shared with Jill, Jack can infer that Jill's why-question is prompting him for an appropriate expansion of the motivation itself. As noted by Moore and Pollack, to perform these kinds of inferences, a speaker needs to keep track of both her intentions and how they are realized in terms of rhetorical relations.","The following interaction presents more tangible evidence for the existence of rhetorical relations, and demonstrates how they can be used to elicit information: 25 Jack: Take the No. 4 train. (13) Jill: Why not the 1 or the 2? (14) Jack: You could take one of those, (15)","but the 4 is an express. (16)","Jill's question at line (14) essentially primes Jack with the rhetorical relation to use. However, the rhetorical relation that she seeks is not an immediate, or perhaps typical, realization of the advice. Therefore, she must say enough for Jack to recognize the realization of his own intentions that she seeks. Jill's feedback indicates that she wants Jack to include information about alternative trains. To accommodate Jill while still realizing his intentions, Jack uses a composition of rhetorical relations that incorporates this information. In this case, Jack uses concession to include the information that taking other trains is feasible if not preferable.","To summarize, the development of my model and its subsequent implementation has forced me to consider two issues: the relationship between intentions and rhetorical relations, and how intentions and rhetorical relations interact with the speaker's and the listener's beliefs. In the process I have identified two system-held intentions that are useful for discussions of plans: to have a listener adopt a plan, and to have a listener be able to execute a plan."]},{"title":"[Aus62]","paragraphs":["[Car89] [Gri69]"]},{"title":"[cri75]","paragraphs":["[GS86] [Hal93] [Kib93] [KK93] [I<S91] [Lim93] [Mai93] [MP92] [M P93] [MT87]"]},{"title":"[Sea69]","paragraphs":["[Tra93]"]},{"title":"References","paragraphs":["J. L. Austin. How To Do Things With Words. Oxford University Press, New York, 1962. S. Carberry. A pragmatics-based approach to ellipsis resolution. Computational Linguistics, 15(4), 1989. H. P. Grice. Utterer's meaning and intentions. Philisophical Review, 78, 1969. H. P. Grice. Logic and conversation. In P. Cole and J. L. Morgan, editors, Syntax and Semantics 3: Speech Acts. Academic Press, New York, 1975. B. J. Grosz and C. L. Sidner. Attention, intentions, and the structure of discourse. Computational Linquistics, 12:175-204, 1986. S. M. Haller. Interactive generation of plan justifications. In Proceedings of the Fourth European Workshop on Natural Language Generation, pages 79-90, 1993. A. Kibrik. Proposals for discussion: Intentions in discourse. In Proceedings o] the Workshop on Intentionality and Discourse Relations, 1993. T. Korelsky and R. Kittredge. Towards stratification of rst. In Proceedings o] the Workshop on Intentionality and Discourse Relations, 1993. D. Kumar and S. C. Shapiro. Architecture of an intelligent agent in SNePS. SIGART Bulletin, 2(4):89-92, August 1991. J. Lim. Domain-dependent and domain-independent rhetorical relations. In Proceedings of the Workshop on Intentionality and Discourse Relations, 1993. E. Maier. The representation of interdependencies between communicative goals and rhetorical relations in the framework of multimedia document generation. In Proceedings of the Workshop on Intentionality and Discourse Relations, 1993. J. D. Moore and M. E. Pollack. A problem for rst: The need for multi-level discourse analysis. Computational Liinguistics, 18(4), 1992. discussion. V. O. Mittal and C. L. Paris. Position paper. In Proceedings o] the Workshop on Intentionality and Discourse Relations, 1993. W. C. Mann and S. A. Thompson. Rhetorical structure theory: A theory of text organization. Technical report, Information Sciences Institute, 1987. .1. R. Searle. Speech Acts: An Essay in the Philosophy of Language. Cambridge University Press, Cambridge, 1969. l). R. qYaum. Rhetorical relations, action and intentionality in conversation. In Proceedings of the Workshop on Intentionality and Discourse Relations, 1993. 26"]}]}
