{"sections":[{"title":"","paragraphs":["The Multifaceted Organization of Discourse Dan Suthers","Learning Research and Development Center","3939 O'Hara Street","University of Pittsburgh Pittsburgh, PA 15260","suthers+@pitt.edu","The organization of discourse is multifaceted. Theories that take a single perspective on discourse structure, examining for example only goal satisfaction or textual coherence or ignoring the context in which a text was generated, will fail to identify the full functional significance of the content and organization of text. The task of generating coherent text to meet some communicative intentions requires consideration of a number of constraints on content and organization that manifest in different ways in the end-product. Therefore the task of analyzing a text with respect to its coherence and intended functionality requires factoring distinct influences on the organization of the text itself. Diverse Accounts of Coherence","Various accounts of discourse coherence have been offered in the literature, each with their own merits and limitations. For example, Grosz & Sidner [1986] defined a coherent discourse to be one in which a single discourse purpose is \"shared bffy all the participants and when each utterance of the discourse contributes to achieving this purpose.\" Grosz and Sidner provided a clear account of certain aspects of the hierarchical and prerequisite structure of discourse. However they did not address the variety of communicative roles that sibling text segments can play with respect to each other.","Intersegmental coherence is the concern of rhetorical structure theory (KST), whose proponents have stated (in various forms, and most directly by Hovy [1988]) that a coherent text is one in which each contiguous segment of text is related by a rhetorical relation. This claim is concisely stated, easy to understand and apply, and intuitively appealing. However it is deficient in being too weak in explanatory power and too strong in its conditions for coherence. It is too weak because the rhetorical relations themselves were developed by identifying relationships between contiguous segments of text in a corpus of texts considered to be coherent. Because of this circularity, the rhetorical characterization of coherence does not account for the sources of coherence or say why the text is coherent: the rhetorical relations are merely descriptive of coherent text. The claim is too strong because coherence does not necessarily require rhetorical relations between every contiguous segment of a text. The ordering of a text can be arbitrary at points. There is unlikely to be a well motivated rhetorical relation between those segments whose contiguity is arbitrary. This problem has shown up in text generation: Moore ~ Paris [1991] encountered certain difficulties in the design of their explanation planner that they attributed to the requirement that a rhetorical relation be present between each pair of contiguous segments in a plan. It.ST has also been criticized for conflating different kinds of relations that should be distinguished [Grosz & Sidner 1986, Moore & Pollack 1993, Suthers 1990].","Finally, Hobbs' [1979] characterization of coherence as the ease of inferring coherence relations linking the parts of the text has also been criticized on the basis that the coherence relations serve no purpose once they have been inferred. The reader is more concerned with discerning 128 the communicative intent of a text than with verifying its coherence, and the theoretician should be as well. The relations by which coherence is defined should be"]},{"title":"independently motivated for reasons of communicative functionality.","paragraphs":["This view is not inconsistent with the view that coherence relations must be"]},{"title":"recognized","paragraphs":["to succeed in making a text coherent. The former simply requires that coherence relations serve some communicative function other than being recognized as contributing to coherence. Hobbs' characterization can be restated as follows: a discourse is coherent to the extent that it makes its communicative functionality plain. However this leaves us with the question of precisely which functionally motivated relations are needed to account for coherence, and how these relations can provide a structural \"test\" for coherence that replaces the initial approximation provided by Hovy's interpretation of RST. Some Aspects of Discourse Structure","My own work [Suthers 1993a] has been concerned with explanation as a question-answering","activity in an instructional setting. I have found it necessary to distinguish the following structural","aspects because each requires examination of a different source of information and/or application","of a different kind of planning knowledge: 1. Exchange Structure: The appropriateness of the dominating rhetorical acts I with respect","to expectations created by prior exchanges. (Is the rhetorical act appropriate for the question","just asked? Is the question being deferred?)","2. Informative Structure (a special kind of goal satisfaction): The relevance of expressed information for performing an intended rhetorical act. (E.g., When does a causal, functional, or structural description constitute an answer to a question?)","3. Propositional Structure (a.k.a. \"informational\" or \"ideational\"): The propositional inter-relatedness of references to different domain entities in a given communicative act. 2 (What propositions are being expressed? How is each entity that is mentioned related to the topic?)","4. \"Contextual structure\" in [Suthers 1993a] (but better understood in terms of tradeoffs between context-sensitive constraints on content choice rather than as structural): The appropriateness of the contents of a communicative act in the context of the knowledge available to the interlocutors and the knowledge expressed in prior dialogue. (E.g., does the utterance provide new information? Does it elaborate on an explanation or argument under construction?)","5. Supplemental Structure: The ways in which one segment plays a supporting role with respect to another segment, such as facilitating comprehension or retention [Zukerman 1990]. Supplemental relations correspond roughly to those rhetorical relations where nuclearity is determined by intention rather than information. As Moore & Moser note in their workshop abstract, these provide different kinds of dominance.","6. Sequential Structure: the consistency of the sequential presentation of the units of an explanation at all granularities with their intended communicative functionality. A partial ordering in terms of constraints derived from the above functional relationships [Suthers 1993b]. tOne of 14 rhetorical iLlocutions (account, compare, define, describe, illustrate, ...) applied to a topic (entity","reference or proposition). =A communicative i]locution (assent, inform, dissent, request) applied to one or more propositions. 129","Based on this structural taxonomy, two concise (though oversimplified) conditions for a coherent explanation can be stated:  The graph of informative, supplemental, and propositional relations between segments is a"]},{"title":"connected graph","paragraphs":["meeting the definitions of these relations (i.e., there are no isolated units of analysis, weaker than requiring a relation between each contiguous pair of units).  The sequencing of the segments is"]},{"title":"consistent with the intended communicative functionality","paragraphs":["of the segments, the functionality being discerned by the aforementioned relations [Suthers 1993b]. (Given a more adequate treatment of exchange structure, the conditions could be extended to include the appropriateness of the dominating rhetorical acts for the exchange context.) This characterization of coherence addresses the weakness of the previous accounts by identifying the sources of coherence in"]},{"title":"independently motivated","paragraphs":["constraints on the content and organization of an explanation without unnecessarily strong conditions or assumptions about hearer inferences. Additionally, the proliferation of coherence relations is reduced by separating supplemental roles from domain-specific relations.","My argument for the above taxonomy depends on my theoretical assumptions about the text planning process rather than on direct linguistic evidence. This deficiency can be addressed by empirical work. However, regardless of whether this particular taxonomy proves to be the most useful, I expect that it is plausible enough to make the point that a complete description of the coherence and communicative functionality of discourse requires acknowledgment of"]},{"title":"functionally distinct categories","paragraphs":["of relationships between segments, not just different relationships within a category. This is especially the case in text genres that mix informational and intentional goals (such as instructional texts). As Owen P~ambow pointed out in his workshop abstract, such genres require the development of new text planning architectures - the primary topic of Suthers [1993a]. Some Remaining Questions","I believe that the need to consider the above aspects of discourse structure during text planning is fairly well estabhshed. (I take the above list to be an approximation to a lower bound, being the items I needed to process in my own planner.) The question remains: which aspects of discourse structure are processed by an agent in"]},{"title":"understanding","paragraphs":["a text. 7 This is an empirical question which I won't speculate on further here. However it should be noted that the above characterization of coherence is oriented towards the needs of generation rather than the process of comprehension. \"Coherence\" from the point of view of the understander need not be the same as \"coherence\" from the point of view of the generator, as their processing requirements may differ.","A related question is whether coherence is the combined effect of its aspects identified by the analyst, or whether it suffices to attend to only one source of coherence when many are possible. Gisela Kedeker 3 argues that a hearer need only recognize the presence of one coherence relation; therefore when multiple relations hold between two segments (ideational, rhetorical, or segmental in her terminology), the speaker can choose which to mark. (She provides evidence that one could have marked both.) Yet marker choice does not rule out the need to process other aspects of coherence, for example the planner must decide whether and how to use an ideational (e.g. causal) relation in constructing a rhetorical (e.g., evidential) one. aTalk at LB.DC, Pittsburgh, May 1993. 130 Conclusion","Both the analysis and generation of coherent and functional text depend on the coordination of multiple types of structural relations at different granularities. It is not productive to view discourse structure as consisting of a single class of relations: one risks omitting or conflaring relevant yet distinct functionalities and sources of coherence. The author has proposed distinctions between exchange, informative, propositional, contextual, supplemental, and sequential structure [Suthers 1993a]: these differentiate types of intentional and rhetorical structure. Improved taxonomies are possible and may depend on whether one is primarily interested in modeling generation or understanding. Regardless, we need to deal with multiple descriptions when analyzing a text. The community should focus on"]},{"title":"factoring","paragraphs":["functionally distinct aspects of discourse structure according to their functionality in generation and understanding processes. References Grosz, B. & Sidner, C. [1986]. Attention, intention, and the structure of discourse."]},{"title":"Computational Linguistics.","paragraphs":["Vol. 12, no. 3. pp. 175-204. Hobbs, J. [1979]. Coherence and coreference."]},{"title":"Cognitive Science.","paragraphs":["Vol. 3, no. 1, pp. 67-90. Hovy, E. [1988]. Approaches to the planning of coherent text. Presented at the"]},{"title":"4th International Workshop on Text Generation.","paragraphs":["Catalina Island, California, July 1988. Moore, J. &: Paris, C. [1991]. The EES explanation facility: its tasks and its architecture."]},{"title":"Workshop on Comparative Analysis of Explanation Planning Architectures, 9th National Conference on Artificial Intelligence.","paragraphs":["July 1991, Anaheim, CA.","Moore, J. & Pollack, M. [1993]. A problem for KST: The need for multi-level discourse analysis."]},{"title":"Computational Linguistics.","paragraphs":["Vol. 18, no. 4, pp. 537-544. Suthers, D. [1990]. Reassessing rhetorical abstractions and planning mechanisms."]},{"title":"5th International Workshop on Natural Language Generation.","paragraphs":["June 1990, Dawson, Pennsylvania.","Suthers, D. [1993a]. An analysis of explanation and its implications for the design of explanation planners. Ph.D. Dissertation, University of Massachusetts.","Suthers, D. [1993b]. Sequencing explanations to enhance communicative functionality. To appear in"]},{"title":"Proc. Cognitive Science.","paragraphs":["June 1993, Boulder, Colorado. Zukerman, I. [1990]. Generating peripheral rhetorical devices by consulting a user model."]},{"title":"5th International Workshop on Natural Language Generation.","paragraphs":["June 1990, Dawson, Pennsylvania, pp. 156-163. 131"]}]}
