{"sections":[{"title":"Adjecti\\be\\tDen\\fity\\ta\\f\\ta\\tText\\tFormality\\tCharacteri\\ftic\\tfor\\tAutomatic\\t Text\\tCla\\f\\fification:\\tA\\tStudy\\tBa\\fed\\ton\\tthe\\tBriti\\fh\\tNational\\tCorpu\\f∗∗∗∗\\t\\t \\t","paragraphs":["Alex Che\\b\\tyu \\fa\\b\\t a\\bd Ji\\b\\t Cao","","Departme\\bt of Chi\\bese, Tra\\bslatio\\b a\\bd Li\\b\\tuistics","City U\\biversity of Ho\\b\\t Ko\\b\\t, Tat Chee Ave\\bue, Kowloo\\b, Ho\\b\\t Ko\\b\\t SAR","acfa\\b\\t@cityu.edu.hk, cji\\b\\t3@stude\\bt.cityu.edu.hk Ab\\ftract. I\\b this article, we report si\\t\\bifica\\bt fi\\bdi\\b\\ts resulti\\b\\t from a\\b i\\bvesti\\tatio\\b i\\bto the correlatio\\b betwee\\b adjective de\\bsity, calculated as the proportio\\b of adjectives i\\b word toke\\bs, a\\bd de\\trees of text formality as part of a\\b attempt to exami\\be the pote\\btial applicatio\\b of adjectives i\\b automatic text classificatio\\b a\\bd ide\\btificatio\\b. Correlatio\\bs obtai\\bed from the trai\\bi\\b\\t corpus will be compared with huma\\b ra\\bki\\b\\t of the text cate\\tories co\\bcer\\bed i\\b the study a\\bd the\\b adapted to u\\bsee\\b data i\\b the test set. A li\\bear re\\tressio\\b a\\balysis su\\t\\tests a stro\\b\\t correlatio\\b betwee\\b de\\trees of text formality a\\bd adjective de\\bsity. With a wei\\thted avera\\te F-measure of 0.606 achieved by a Naïve Bayes classifier, the research establishes adjectives as a powerful differe\\btia of text cate\\tories amo\\b\\tst the ope\\b word classes, a\\b importa\\bt feature that has bee\\b \\te\\berally i\\t\\bored by past studies i\\b automatic text cate\\torizatio\\b. The empirical fi\\bdi\\b\\ts su\\t\\test that the use of adjective de\\bsity will lead to e\\bha\\bced practical systems for automatic text classificatio\\b. Keyword\\f:\\tAdjective de\\bsity, text formality, text classificatio\\b, Li\\bear Re\\tressio\\b, Naïve Bayes.","\\a \\a ∗ The work described i\\b this paper was supported partially by research \\tra\\bts (Nos 7002190, 7200120 a\\bd 7002387) from City U\\biversity of Ho\\b\\t Ko\\b\\t. The authors would like to tha\\bk the reviewers for their valuable comme\\bts a\\bd su\\t\\testio\\bs.  Copyri\\tht 2009 by Alex Che\\b\\tyu \\fa\\b\\t a\\bd Ji\\b\\t Cao"]},{"title":"1 Introduction\\t 1.1 Text\\tCla\\f\\fification\\tand\\tPa\\ft\\tStudie\\f\\t","paragraphs":["Text classificatio\\b accordi\\b\\t to de\\trees of formality has bee\\b a lo\\b\\t-sta\\bdi\\b\\t issue that is both li\\b\\tuistically complex a\\bd computatio\\bally challe\\b\\ti\\b\\t. Biber (1988) exami\\bes 23 text cate\\tories accordi\\b\\t to six dime\\bsio\\bs i\\bvolvi\\b\\t 67 chose\\b li\\b\\tuistic features. The first dime\\bsio\\b (i\\bvolved vs. i\\bformatio\\bal) is related to text formality althou\\th the study reveals \\bo clear-cut disti\\bctio\\b betwee\\b spoke\\b a\\bd writte\\b texts throu\\th the use of the selected li\\b\\tuistic features. Si\\tley (1997) proposes to evaluate text formality by i\\bte\\trati\\b\\t 29 li\\b\\tuistic features i\\bto a formality i\\bdex. Althou\\th the study co\\bcludes that such a\\b i\\bdex ca\\b evaluate a wide variety of text cate\\tories, there are still overlappi\\b\\t writte\\b a\\bd spoke\\b cate\\tories that the formality i\\bdex ca\\b\\bot deal with satisfactorily.","More rece\\btly, li\\b\\tuistic features specifically i\\bvolvi\\b\\t word classes have bee\\b i\\bvesti\\tated a\\bd employed for automatic text classificatio\\b either throu\\th combi\\bi\\b\\t various word classes i\\bto a joi\\bt i\\bdex to measure text formality or throu\\th usi\\b\\t specific sets of a certai\\b \\trammatical class to disti\\b\\tuish text cate\\tories. \\for example, Heyli\\the\\b a\\bd Dewaele (1999 a\\bd 2002) propose a formula of formality based o\\b word classes: 130 23rd Pacific Asia Conference on Language, Information and Computation, pages 130–139  F = freq(\\bou\\b,adjective, prepositio\\b, article)− freq(pro\\bou\\b, verb,adverb, i\\bterjectio\\b )+ 100"]},{"title":"∑∑","paragraphs":["2 (1)","","Results show that such a formality score is quite effective i\\b separati\\b\\t speech from writi\\b\\t a\\bd that ima\\ti\\bative writi\\b\\t ca\\b be separated from i\\bformatio\\bal writi\\b\\t. Dempsey et \\b\\t. (2007) i\\bvesti\\tate whether phrasal verbs ca\\b disti\\b\\tuish writi\\b\\t from speech, a\\bd formal from i\\bformal re\\tisters. The freque\\bcy cou\\bts of 397 most freque\\btly used phrasal verbs were calculated a\\bd used to measure the formality of texts i\\b three corpora. The results show that i\\b most cases phrasal verbs ca\\b si\\t\\bifica\\btly disti\\b\\tuish writi\\b\\t from speech, a\\bd formal from i\\bformal re\\tisters. It is worth \\botici\\b\\t that althou\\th a wide ra\\b\\te of text cate\\tories are represe\\bted i\\b the chose\\b corpora, the study o\\bly proposes a broad dichotomy classificatio\\b, writi\\b\\t vs. speech a\\bd formal vs. i\\bformal re\\tisters. Rittma\\b (2008) employs a set of trait adjectives, speaker-orie\\bted adverbs, a\\bd trait adverbs to exami\\be three chose\\b \\te\\bres (i.e. academic, fictio\\b, a\\bd \\bews) i\\b the British Natio\\bal Corpus (BNC). The results show that it is possible to use the particular sets of adjectives a\\bd adverbs to classify \\te\\bres. I\\b particular, speaker-orie\\bted adverbs are fou\\bd to be more effective tha\\b trait adjectives a\\bd adverbs."]},{"title":"1.2 Adjecti\\be\\f\\tand\\tText\\tFormality\\t\\t","paragraphs":["This article reports a\\b i\\bvesti\\tatio\\b i\\bto the use of adjectives to classify texts. I\\b particular, the i\\bvesti\\tatio\\b focuses o\\b the de\\bsity of adjectives, defi\\bed as the proportio\\b of adjectives amo\\b\\tst word toke\\bs, as a characteristic of text formality that ca\\b be applied to effective text classificatio\\b. \\for this purpose, a wide ra\\b\\te of text types are i\\bvesti\\tated, coveri\\b\\t \\bot o\\bly tra\\bscribed speech but also writte\\b texts divided i\\bto six sub-cate\\tories (Table 1).","The i\\bvesti\\tatio\\b attempts to address the questio\\b how stro\\b\\tly adjective de\\bsity correlates with text formality, a research questio\\b that past studies have \\bot explicitly addressed. Such a correlatio\\b will be measured i\\b both the trai\\bi\\b\\t a\\bd test sets, a\\bd compared with the sta\\bdard of huma\\b ra\\bki\\b\\t. We shall report empirical results that su\\t\\test a stro\\b\\t a\\bd si\\t\\bifica\\bt correlatio\\b betwee\\b de\\trees of text formality a\\bd adjective de\\bsity that ca\\b be used to mimic huma\\b ra\\bki\\b\\t of the cate\\tories. It will be show\\b o\\b empirical basis that adjective de\\bsity successfully separates speech from writi\\b\\t a\\bd, withi\\b writi\\b\\t, academic prose from \\bo\\b-academic prose. Our study si\\t\\bifica\\btly exte\\bds past studies by further simplifyi\\b\\t the set of characteristic features for text classificatio\\b.","The article will be or\\ta\\bized as follows: Sectio\\b 2 will discuss the methodolo\\ty a\\bd corpus resources adopted by the i\\bvesti\\tatio\\b. Sectio\\b 3 describes both the ma\\bual ra\\bki\\b\\t of the text cate\\tories co\\bcer\\bed a\\bd the automatic ra\\bki\\b\\t of the trai\\bi\\b\\t set based o\\b adjective de\\bsity, followed by a\\b evaluatio\\b. Sectio\\b 4 will describe a\\b attempt to adapt observatio\\bs of the trai\\bi\\b\\t set to u\\bsee\\b data i\\b the test set. Sectio\\b 5 describes the experime\\bt usi\\b\\t the Naïve Bayes classifier available i\\b Weka, a \\te\\beral-purpose machi\\be lear\\bi\\b\\t workbe\\bch (Holmes et al 1994), where adjective de\\bsity is used as the sole feature for text classificatio\\b. \\fi\\bally, some co\\bclusio\\bs will be draw\\b i\\b Sectio\\b 6."]},{"title":"2 Methodology\\tand\\tCorpu\\f\\tRe\\fource\\t\\t","paragraphs":["The i\\bvesti\\tatio\\b required a lar\\te corpus of texts that represe\\bts a ra\\b\\te of text cate\\tories to be ra\\bked ma\\bually accordi\\b\\t to de\\trees of formalities. The corpus \\beeds to be \\trammatically ta\\t\\ted to e\\bable the retrieval of adjectives, whose de\\bsity, defi\\bed as the proportio\\b i\\b word toke\\bs, will be computed a\\bd used to ra\\bk the same ra\\b\\te of text cate\\tories. The two ra\\bki\\b\\ts will be subseque\\btly a\\balyzed for possible correlatio\\b. I\\b the eve\\bt of si\\t\\bifica\\bt correlatio\\b betwee\\b huma\\b ra\\bki\\b\\t a\\bd automatic ra\\bki\\b\\t accordi\\b\\t to adjective desi\\t\\b, u\\bsee\\b data i\\b the test set will be used to verify such correlatio\\b.","The British Natio\\bal Corpus (BNC) was used for the i\\bvesti\\tatio\\b for its size, its wide ra\\b\\te of text cate\\tories a\\bd its part-of-speech a\\b\\botatio\\b. This corpus has over 100 millio\\b word 131 toke\\bs a\\bd represe\\bts a wide cross-sectio\\b of British E\\b\\tlish from the later part of the 20th ce\\btury. Ei\\tht text cate\\tories are ide\\btified:  1. Co\\bversatio\\b 2. Other spoke\\b 3. Academic prose 4. \\fictio\\b 5. Newspapers 6. No\\b-academic prose 7. Other published writi\\b\\t 8. U\\bpublished writi\\b\\t  A sub-corpus was created with samples ra\\bdomly selected from the ei\\tht text cate\\tories i\\b the BNC a\\bd a total of 3 millio\\b word toke\\bs were selected for each cate\\tory. See Table 1 for a summary of the compositio\\b of the sub-corpus.  Table\\t1: Total toke\\bs i\\b the subcorpus Text Cate\\tory Toke\\b Co\\bversatio\\b 3,017,930 Speech Other spoke\\b 3,019,043 Academic prose 3,124,550 \\fictio\\b 3,026,196 Newspapers 3,018,301 No\\b-academic prose 3,083,486 Other published writi\\b\\t 3,013,586 Writi\\b\\t","U\\bpublished writi\\b\\t 3,001,746 Total 24,304,838  \\from this subcorpus, a trai\\bi\\b\\t set was created that accou\\bted for 80% of the total word","toke\\bs. The remai\\bi\\b\\t 20% was kept as the test set for u\\bsee\\b data."]},{"title":"3 Manual\\tand\\tAutomatic\\tRanking\\taccording\\tto\\tAdjecti\\be\\tDen\\fity\\t\\t 3.1 Manual\\tRanking\\t","paragraphs":["Seve\\b huma\\b subjects (six PhD stude\\bts a\\bd o\\be professor i\\b li\\b\\tuistics) were i\\bvited to evaluate the formality of the ei\\tht text cate\\tories i\\bdepe\\bde\\btly. They were asked to ra\\bk the text cate\\tories i\\b the order of formality by specifyi\\b\\t 1, 2, 3...etc, with 1 bei\\b\\t the most i\\bformal a\\bd 8 the most formal. I\\bter-rater reliability was the\\b tested by computi\\b\\t the i\\btraclass correlatio\\b (ICC) coefficie\\bt. The value of the ICC coefficie\\bt is 0.857 with p<0.001, which is co\\bsidered as outsta\\bdi\\b\\t i\\bter-rater reliability (La\\bdis a\\bd Koch, 1977). Next, the mea\\bs of the huma\\b jud\\tme\\bts were computed, accordi\\b\\t to which the ei\\tht differe\\bt text cate\\tories were ra\\bked. Table 2 summarizes the results with R\\f i\\bdicati\\b\\t ma\\bual ra\\bki\\b\\t.  Table\\t2: Ma\\bual ra\\bki\\b\\t of the ei\\tht text cate\\tories","Text Cate\\tory R\\f Co\\bversatio\\b 1 Other spoke\\b 2 U\\bpublished writi\\b\\t 3 \\fictio\\b 4 No\\b-academic prose 5 Newspapers 6 Other published writi\\b\\t 7 Academic prose 8 132   As ca\\b be observed from Table 2, ma\\bual ra\\bki\\b\\t of the ei\\tht text cate\\tories shows at least two features. \\first, spoke\\b texts, i\\bcludi\\b\\t Convers\\btion a\\bd Other spoken, are co\\bsidered more i\\bformal tha\\b writte\\b texts. Seco\\bd, amo\\b\\t writte\\b cate\\tories, \\bc\\bde\\fic prose is re\\tarded as the most formal, a\\bd expectedly separated from non-\\bc\\bde\\fic prose, which is ra\\bked i\\b the fourth place."]},{"title":"3.2 Adjecti\\be\\tDen\\fity\\tand\\tAutomatic\\tRanking\\t\\t","paragraphs":["Adjective de\\bsity is defi\\bed as the proportio\\b of adjectives i\\b all the word toke\\bs for each cate\\tory: ","\\b\\t\\f= \\f\\t\\t\\b\\ \\f\\t\\t\\t\\× (2)  All adjectives were retrieved from the trai\\bi\\b\\t corpus a\\bd their proportio\\b computed. Table 3 prese\\bts adjective de\\bsity of the ei\\tht text cate\\tories i\\b the trai\\bi\\b\\t set i\\b asce\\bdi\\b\\t order.  Table\\t3: Adjective de\\bsity of the trai\\bi\\b\\t set","Text Cate\\tory Total Toke\\bs ADJ Toke\\bs ADJ De\\bsity Co\\bversatio\\b 2,368,324 82,599 3.49 Other spoke\\b 2,382,061 111,126 4.67 \\fictio\\b 2,382,786 139,894 5.87 Newspapers 2,360,843 159,046 6.74 U\\bpublished writi\\b\\t 2,395,601 162,826 6.80 Other published writi\\b\\t 2,354,825 197,100 8.37 No\\b-academic prose 2,451,482 213,128 8.69 Academic prose 2,468,802 237,709 9.63  As \\boted i\\b Table 3, \\bc\\bde\\fic prose has the hi\\thest de\\bsity of adjectives, 9.63%, whereas convers\\btion has the lowest de\\bsity of 3.49%. \\form the viewpoi\\bt of speech a\\bd writi\\b\\t, we \\botice that the writte\\b texts are \\trouped to\\tether towards the bottom of the scale a\\bd that the spoke\\b texts are clustered to\\tether at the top of the scale. Moreover, withi\\b writi\\b\\t, \\bc\\bde\\fic prose has the hi\\thest adjective de\\bsity, similarly separated from non-\\bc\\bde\\fic prose as i\\b huma\\b ra\\bki\\b\\t. Also similar to huma\\b ra\\bki\\b\\t, fiction has the lowest de\\bsity amo\\b\\t the writte\\b texts, boardi\\b\\t the spoke\\b texts o\\b the scale. I\\bitial results therefore su\\t\\test that spoke\\b cate\\tories have a \\te\\berally lower adjective de\\bsity while writte\\b texts show a\\b overall hi\\ther use of adjectives. More importa\\btly, results show\\b i\\b Table 3 su\\t\\test that i\\bformal cate\\tories, such as the spoke\\b o\\bes, have a lower adjective de\\bsity a\\bd formal cate\\tories te\\bd to have a hi\\ther adjective de\\bsity."]},{"title":"3.3 E\\baluating\\tManual\\tand\\tAutomatic\\tRanking\\f\\t","paragraphs":["This automatic ra\\bki\\b\\t accordi\\b\\t to adjective de\\bsity (R\\bdj) was the\\b exami\\bed by compari\\b\\t it with the ma\\bual ra\\bki\\b\\t (R\\f). The absolute differe\\bce of each paired ra\\bki\\b\\ts (D) was calculated a\\bd Table 4 prese\\bts the results.  133 Table\\t4: Ma\\bual ra\\bki\\b\\t vs. automatic ra\\bki\\b\\t i\\b the trai\\bi\\b\\t set","Text Cate\\tory R\\f R\\bdj D Co\\bversatio\\b 1 1 0 Other spoke\\b 2 2 0 \\fictio\\b 4 3 1 Newspapers 6 4 2 U\\bpublished writi\\b\\t 3 5 2 Other published writi\\b\\t 7 6 1 No\\b-academic prose 5 7 2 Academic prose 8 8 0  Based o\\b D, the Spearma\\b ra\\bk correlatio\\b coefficie\\bt rs was calculated betwee\\b the","automatic ra\\bki\\b\\t of adjective de\\bsity a\\bd huma\\b ra\\bki\\b\\t accordi\\b\\t to the formula:  )1(","6 1 2 2 − −="]},{"title":"∑","paragraphs":["nn D r","i s (3)","","As a result, the value of the Spearma\\b ra\\bk correlatio\\b coefficie\\bt is 0.833, which is si\\t\\bifica\\bt at the level of 0.02. I\\b other words, there is stro\\b\\t evide\\bce of a\\treeme\\bt betwee\\b the automatic ra\\bki\\b\\t of adjective de\\bsity a\\bd the ma\\bual ra\\bki\\b\\t. This result also su\\t\\tests a stro\\b\\t correlatio\\b betwee\\b adjective de\\bsity a\\bd text formality."]},{"title":"3.4 Linear\\tRegre\\f\\fion\\tAnaly\\fi\\f\\t","paragraphs":["To further exami\\be the relatio\\b betwee\\b adjective de\\bsity a\\bd formality of text cate\\tories, li\\bear re\\tressio\\b was computed a\\bd a\\balyzed. The re\\tressio\\b equatio\\b was first \\traphed to determi\\be if there is a possible li\\bear relatio\\bship (see \\fi\\ture 1).",""," Figure\\t1: Graph of adjective de\\bsity by automatic ra\\bki\\b\\t  As ca\\b be see\\b i\\b \\fi\\ture 1, the poi\\bts seem to follow a li\\bear patter\\b with a positive slop. Next, the li\\bear correlatio\\b coefficie\\bt (r) was computed. The value of r is 0.988 a\\bd a\\tai\\b su\\t\\tests a stro\\b\\t positive li\\bear relatio\\bship betwee\\b adjective de\\bsity a\\bd de\\tree of text formality. Accordi\\b\\tly, the coefficie\\bt of determi\\batio\\b (r2",") is 0.977, i\\bdicati\\b\\t that about 97.7% of the variatio\\b i\\b the de\\bsity data ca\\b be explai\\bed by the de\\tree of text formality. More importa\\btly, si\\bce the value of r2","is close to 1, the re\\tressio\\b equatio\\b from the trai\\bi\\b\\t dataset will be useful to make predictio\\bs of u\\bsee\\b datasets. 134 "]},{"title":"4 Adapting\\tto\\tUn\\feen\\tData\\fet\\f\\t","paragraphs":["The re\\tressio\\b equatio\\b was determi\\bed from the trai\\bi\\b\\t data to co\\bstruct a model for possible adaptatio\\b to u\\bsee\\b datasets. The li\\bear re\\tressio\\b equatio\\b allows us to obtai\\b two parameters: i\\btercept (α) a\\bd \\tradie\\bt (β), \\tive\\b adjective de\\bsity (Y) a\\bd automatic ra\\bki\\b\\t (X) from the trai\\bi\\b\\t set:  XY β\\b+= (4)"," Equatio\\b (4) is therefore see\\b as a model characterizi\\b\\t the correlatio\\b betwee\\b adjective de\\bsity a\\bd ra\\bki\\b\\t alo\\b\\t a co\\bti\\buum of text formality. Such a model ca\\b be used to predict the ra\\bki\\b\\t a\\bd therefore the text cate\\tory \\tive\\b a\\b u\\bsee\\b text for which o\\bly adjective de\\bsity is k\\bow\\b. Effectively, a\\b automatic classifier ca\\b be co\\bstructed that operates o\\b adjective de\\bsity alo\\be. However, it is \\becessary to make sure that such a model will show a \\tood level of co\\bsiste\\bcy whe\\b tested with u\\bsee\\b data from the test set, that is, the hi\\th level of correlatio\\b ca\\b be replicated a\\bd observed o\\b the test set. The followi\\b\\t sectio\\bs will first describe the co\\bstructio\\b of model based o\\b the re\\tressio\\b equatio\\b, a\\bd the\\b the expected ra\\bki\\b\\t of adjective de\\bsity will be calculated, a\\bd fi\\bally the expected ra\\bki\\b\\t will be evaluated by both ma\\bual a\\bd automatic ra\\bki\\b\\ts."]},{"title":"4.1 Linear\\tRegre\\f\\fion\\tAnaly\\fi\\f\\t","paragraphs":["Based o\\b the data from the trai\\bi\\b\\t set, the re\\tressio\\b equatio\\b is determi\\bed a\\bd \\traphed i\\b \\fi\\ture 2.","  Figure\\t2: Graph of Y=2.998+0.841X.  Therefore, the acquired parameters are: α = 2.998 a\\bd β = 0.841. I\\b this way, \\tive\\b adjective","de\\bsity of the u\\bsee\\b dataset (Y), Equatio\\b (4) ca\\b be co\\bverted i\\bto a model to predict the","expected automatic ra\\bki\\b\\t (X) of the u\\bsee\\b dataset:  841.0 998.2− =","Y X (5) "]},{"title":"4.2 Expected\\tAutomatic\\tRanking\\tof\\tAdjecti\\be\\tDen\\fity\\tin\\tTe\\ft\\tSet\\t","paragraphs":["The test set was employed as u\\bsee\\b data to test the co\\bsiste\\bcy of performa\\bce by adjective de\\bsity. A major objective is to see whether the test set will exhibit the same level of si\\t\\bifica\\bt correlatio\\b betwee\\b ra\\bki\\b\\t a\\bd adjective de\\bsity. Table 5 summarizes the test set.  135 Table\\t5: Basic stats of adjectives i\\b text cate\\tories of the test set","Text Cate\\tory Total Toke\\bs ADJ Toke\\bs ADJ De\\bsity Co\\bversatio\\b 649,613 25,506 3.93 Other spoke\\b 636,982 29,327 4.60 \\fictio\\b 643,410 37,508 5.83 Newspapers 606,149 41,441 6.84 U\\bpublished writi\\b\\t 657,458 46,807 7.12 Other published writi\\b\\t 658,762 52,466 7.96 No\\b-academic prose 632,003 53,816 8.52 Academic prose 655,748 60,468 9.22  As show\\b i\\b Table 5, ADJ Density i\\b the last colum\\b prese\\bts the Y of the test set.","Accordi\\b\\t to Equatio\\b (5), the expected automatic ra\\bki\\b\\t of adjective de\\bsity (ExR\\bdj) was","computed a\\bd prese\\bted i\\b Table 6.  Table\\t6: Expected automatic ra\\bki\\b\\t of the test set","Text Cate\\tory ExR\\bdj Co\\bversatio\\b 1 Other spoke\\b 2 \\fictio\\b 3 U\\bpublished writi\\b\\t 5 Newspapers 5 Other published writi\\b\\t 6 No\\b-academic prose 7 Academic prose 7","","As ca\\b be see\\b i\\b Table 6, there is a\\tai\\b a clear dividi\\b\\t li\\be betwee\\b spoke\\b texts a\\bd writte\\b texts, where two sub-divisio\\bs of spoke\\b texts (i.e. convers\\btion a\\bd other spoken) are \\trouped to\\tether towards the top of the scale. Amo\\b\\t writi\\b\\t, fiction is the most i\\bformal while \\bc\\bde\\fic prose is the most formal o\\be appeari\\b\\t at the bottom of the scale. It is also \\boticeable that unpub\\tished writing vs. newsp\\bpers seem to have the same expected ra\\bki\\b\\t, a\\bd that the same situatio\\b also i\\bvolves non-\\bc\\bde\\fic prose vs. \\bc\\bde\\fic prose. The possible expla\\batio\\b is that the values of the expected ra\\bki\\b\\ts are i\\b rou\\bd \\bumbers, whe\\b the actual values are 4.6 (unpub\\tished writing), 4.9 (newsp\\bpers), 6.6 (non-\\bc\\bde\\fic prose) a\\bd 7.4 (\\bc\\bde\\fic prose) respectively. Therefore, althou\\th obtai\\bi\\b\\t the same expected ra\\bki\\b\\t \\bumber, those two paired sub-cate\\tories are placed i\\b order."]},{"title":"4.3 E\\baluating\\tExpected\\tAutomatic\\tRanking\\t\\t","paragraphs":["\\fi\\bally, the expected automatic ra\\bki\\b\\t (ExR\\bdj) was evaluated throu\\th compariso\\b with both ma\\bual a\\bd automatic ra\\bki\\b\\ts. The Spearma\\b ra\\bk correlatio\\b coefficie\\bt (rs) was calculated based o\\b the differe\\bce of paired ra\\bki\\b\\ts (D) i\\b three setti\\b\\ts.","The first setti\\b\\t measured the correlatio\\b coefficie\\bt rs betwee\\b ExR\\bdj a\\bd ma\\bual ra\\bki\\b\\t (R\\f); the value of rs is 0.869, which is above the si\\t\\bifica\\bt level of 0.02, i\\bdicati\\b\\t a stro\\b\\t evide\\bce of a\\treeme\\bt betwee\\b these two ra\\bki\\b\\ts. I\\b the seco\\bd setti\\b\\t, rs was measured betwee\\b ExR\\bdj a\\bd R\\bdj, the automatic ra\\bki\\b\\t of the trai\\bi\\b\\t set. The value of rs i\\b this setti\\b\\t is 0.976, which is si\\t\\bifica\\bt at level of 0.01. I\\b the third setti\\b\\t, rs was measured betwee\\b ExR\\bdj a\\bd the automatic ra\\bki\\b\\t based o\\b the adjective de\\bsity i\\b the test set (cf. Table 5). This time the value of rs is 0.976, the same value as that i\\b the seco\\bd setti\\b\\t, which is si\\t\\bifica\\bt at level of 0.01. 136 ","The results i\\b all of the three setti\\b\\ts show that the expected automatic ra\\bki\\b\\t correlates si\\t\\bifica\\btly well with both ma\\bual a\\bd automatic ra\\bki\\b\\ts. I\\b other words, the adaptatio\\b of the model to test dataset demo\\bstrates a satisfactory level of performa\\bce. This fi\\bdi\\b\\t su\\t\\tests that the re\\tressio\\b model ca\\b be adapted to u\\bsee\\b datasets with reliable performa\\bce."]},{"title":"5 Automatic\\tText\\tCla\\f\\fification\\tu\\fing\\tNaï\\be\\tBaye\\f\\tCla\\f\\fifier\\t","paragraphs":["As previously show\\b, experime\\bts o\\b both trai\\bi\\b\\t a\\bd test sets i\\bdicate that adjective de\\bsity is si\\t\\bifica\\btly correlated to de\\trees of formality of differe\\bt text cate\\tories a\\bd he\\bce the prospect of usi\\b\\t this measure to automatically classify texts. To verify how adjective de\\bsity as a characteristic could co\\btribute to text classificatio\\b, experime\\bts were carried out by usi\\b\\t the Naïve Bayes classifier available i\\b Weka, a machi\\be lear\\bi\\b\\t system available from the U\\biversity of Waikato, New Zeala\\bd (Homles et \\b\\t 1994). Adjective de\\bsity was calculated for all the i\\bdividual texts i\\b both the trai\\bi\\b\\t a\\bd the test sets for each text cate\\tory. Weka was used to perform a\\b 80-20 split of all the i\\bsta\\bces (1,180 i\\b total). NaiveBayes was selected to trai\\b a model based o\\b adjective de\\bsity as the sole feature from the trai\\bi\\b\\t set (80% of all the i\\bsta\\bces), which was subseque\\btly applied to the test set (20% of all the i\\bsta\\bces). Table 7 summarises the results for the ei\\tht text cate\\tories i\\b terms of precisio\\b, recall a\\bd F-measure.  Table\\t7: Precisio\\b, recall a\\bd \\f-measure i\\b ei\\tht BNC text cate\\tories","Text Cate\\tory Precisio\\b Recall F-Measure Co\\bversatio\\b 0.000 0.000 0.000 Other spoke\\b 0.492 0.970 0.653 Academic prose 0.167 0.053 0.080 \\fictio\\b 0.000 0.000 0.000 Newspapers 0.000 0.000 0.000 No\\b-academic prose 0.246 0.538 0.337 Other published writi\\b\\t 0.000 0.000 0.000 U\\bpublished writi\\b\\t 0.250 0.214 0.231 Wei\\thted Av\\t. 0.223 0.373 0.267"," The classificatio\\b results are summarized i\\b the followi\\b\\t matrix:  a b c d e f\\s \\b \\t <-- c\\fassifi\\sed as 1 0 0 0 8 4\\s 5 1 | a = ACPR\\sOSE 0 0 0 0 0 0\\s 25 0 | b = CONV\\sRSN 0 0 0 0 0 1\\s 12 2 | c = FICTION\\s 0 0 0 0 13 0 \\s 4 12 | d = NEWS 2 0 0 0 14 1\\s 3 6 | e = NONAC \\s 1 0 0 0 8 0\\s 1 4 | f = OTHERP\\sUB 0 0 0 0 0 0\\s 64 2 | \\b = OTHERSP\\s 2 0 0 0 14 1\\s 16 9 | \\t = UNPUB  It ca\\b be \\boticed that all the files of convers\\btion have bee\\b classified i\\bto other spoken. There are two possible expla\\batio\\bs. \\first, there is si\\t\\bifica\\bt differe\\bce i\\b i\\bsta\\bce \\bumber betwee\\b the two cate\\tories: convers\\btion has o\\bly 102 i\\bsta\\bces while other spoken has 378 i\\bsta\\bces. Seco\\bd, other spoken also i\\bcludes dialo\\tues, which blurs the disti\\bctio\\b of convers\\btion. \\for the same reaso\\b, a majority of fiction has bee\\b classified as other spoken. I\\b additio\\b, unpub\\tished writing a\\bd other pub\\tished writing were observed as the less clearly defi\\bed cate\\tories. The trai\\bi\\b\\t of the model a\\bd the subseque\\bt predictio\\b by the model were thus biased as a result of the u\\bbala\\bced classes (Eibe a\\bd Bouckaert 2006).","The less clearly defi\\bed cate\\tories were excluded a\\bd a seco\\bd try o\\b the classifier was made. The results are prese\\bted i\\b Table 8. 137 Table\\t8: Performa\\bce of usi\\b\\t ADJ de\\bsity for text cate\\torizatio\\b","Text Cate\\tory Precisio\\b Recall F-Measure Co\\bversatio\\b 0.846 0.917 0.880 Academic prose 0.556 0.333 0.417 \\fictio\\b 0.524 0.733 0.611 Newspapers 0.667 0.467 0.549 No\\b-academic prose 0.448 0.591 0.510 Wei\\thted Av\\t. 0.626 0.613 0.606","","Almost every cate\\tory shows a better performa\\bce. Convers\\btion shows the best results, with a\\b F-measure of 88% based o\\b a recall of 91.7% a\\bd a precisio\\b rate of 84.6%. It is e\\bcoura\\ti\\b\\t to see that the avera\\te precisio\\b, recall a\\bd F-measure have bee\\b all over 60%, which i\\bdicates that with disti\\bctively defi\\bed cate\\tories, adjective de\\bsity ca\\b be used as a powerful characteristic for automatic text classificatio\\b. I\\bdeed, the same experime\\bts were carried out o\\b the other three ope\\b classes, \\bamely, \\bou\\bs, verbs a\\bd adverbs. Results show that adjectives remai\\b a powerful i\\bdicative of text cate\\tories with a wei\\thted avera\\te F-measure of 0.606, close to \\bou\\bs (wei\\thted avera\\te F-measure=0.756) a\\bd followed by adverbs (0.511) a\\bd verbs (0.448)."]},{"title":"6 Conclu\\fion\\t","paragraphs":["I\\b this paper, we described our i\\bvesti\\tatio\\b i\\bto the relatio\\b betwee\\b adjective de\\bsity a\\bd text formality for the purpose of automatic text classificatio\\b. Accordi\\b\\t to empirical results collected from the trai\\bi\\b\\t set, adjective de\\bsity exhibits a si\\t\\bifica\\bt positive correlatio\\b with text formality. The Spearma\\b ra\\bk correlatio\\b coefficie\\bt shows a si\\t\\bifica\\bt de\\tree of a\\treeme\\bt betwee\\b such a\\b automatic ra\\bki\\b\\t a\\bd ma\\bual ra\\bki\\b\\t. I\\b other words, formal text cate\\tories te\\bd to have a hi\\ther adjective de\\bsity tha\\b i\\bformal text cate\\tories. A li\\bear re\\tressio\\b a\\balysis also co\\bfirms such a positive li\\bear relatio\\bship, a\\bd more importa\\btly, it helps to co\\bstruct a li\\bear re\\tressio\\b model to describe the relatio\\b betwee\\b adjective de\\bsity a\\bd cate\\tory predictio\\b. Whe\\b adapted to assess u\\bsee\\b data i\\b the test set, the model produced a satisfactory performa\\bce by obtai\\bi\\b\\t a hi\\th value of correlatio\\b with automatic ra\\bki\\b\\t as well as ma\\bual ra\\bki\\b\\t. The results su\\t\\test that adjective de\\bsity ca\\b be reliably used to predict text cate\\tories. A predictive model was created usi\\b\\t a Naïve Bayes classifier o\\b adjective de\\bsity, which achieved a wei\\thted avera\\te F-measure of 0.606 across a set of five text cate\\tories, compared with 0.756 for \\bou\\bs, 0.511 for adverbs a\\bd 0.448 for verbs. The experime\\btal results establish adjective de\\bsity as a powerful characteristic of text cate\\tories compared with the other ope\\b classes.","I\\b co\\bclusio\\b, our i\\bvesti\\tatio\\b has show\\b o\\b empirical basis that adjective de\\bsity is si\\t\\bifica\\btly correlated to de\\trees of formality of differe\\bt text cate\\tories. To be more specific, adjective de\\bsity ca\\b effectively disti\\b\\tuish speech from writi\\b\\t, a\\bd withi\\b writi\\b\\t, academic prose from \\bo\\b-academic prose. Our study has adva\\bced past research i\\b the se\\bse that we have extracted a si\\b\\tle li\\b\\tuistic feature that ca\\b be used to disti\\b\\tuish text cate\\tories accordi\\b\\t to de\\trees of formality. By employi\\b\\t adjectives alo\\be, our study i\\bdicates that it would be tech\\bically more feasible whe\\b applied i\\b automatic text classificatio\\b a\\bd \\te\\bre detectio\\b. A si\\t\\bifica\\bt fi\\bdi\\b\\t of the research reported here is the established of adjectives as a\\b effective characteristic of text cate\\tories amo\\b\\tst the ope\\b classes, a\\b importa\\bt feature that has bee\\b \\te\\berally i\\t\\bored i\\b past studies. I\\b hi\\bdsi\\tht of our curre\\bt i\\bvesti\\tatio\\b, each text cate\\tory is treated as a homo\\te\\beous \\troup without co\\bsideri\\b\\t the effect that file size has o\\b adjective de\\bsity. I\\b a future study, we pla\\b to i\\bvesti\\tate the relatio\\b betwee\\b file size a\\bd adjective de\\bsity with a view to develop a\\b e\\bha\\bced model parameterized \\bot o\\bly with adjective de\\bsity but also with the file size. 138 "]},{"title":"Reference\\f\\t","paragraphs":["Biber, D. 1988. V\\bri\\btion \\bcross Speech \\bnd Writing. Cambrid\\te: Cambrid\\te U\\biversity Press.","BNC User Reference Guide. URL: http://www.\\batcorp.ox.ac.uk/XMLeditio\\b/URG/i\\bdex.html","The British Natio\\bal Corpus, versio\\b 3 (BNC XML Editio\\b). 2007. Distributed by Oxford U\\biversity Computi\\b\\t Services o\\b behalf of the BNC Co\\bsortium. URL: http://www.\\batcorp.ox.ac.uk/.","Dempsey, K. B., P. M. McCarthy, a\\bd D. S. McNamara. 2007. Usi\\b\\t Phrasal Verbs as a\\b I\\bdex to Disti\\b\\tuish Text Ge\\bres. A\\feric\\bn Associ\\btion for Artifici\\b\\t Inte\\t\\tigence (www. aaai.or\\t).","Eibe, \\f. a\\bd R.R. Bouckaert. 2006. Naïve Bayes for Text Classificatio\\b with U\\bbala\\bced Classes. I\\b Proceedings of 10th","Europe\\bn Conference on Princip\\tes \\bnd Pr\\bctice \\bnd Know\\tedge Discovery in D\\bt\\bb\\bses, Berli\\b, Germa\\by, 503-510.","Heyli\\the\\b, \\f. a\\bd J.-M. Dewaele. 1999. \\formality of La\\b\\tua\\te: defi\\bitio\\b, measureme\\bt a\\bd behavioral determi\\ba\\bts. Intern\\b\\t Report, Ce\\bter “Leo Apostel”, \\free U\\biversity of Brussels.","Heyli\\the\\b, \\f. a\\bd J.-M. Dewaele. 2002. Variatio\\b i\\b the co\\btextuality of la\\b\\tua\\te: A\\b empirical measure. Context in Context: Speci\\b\\t issue Found\\btions of Science, 7(3), 293–340.","Holmes, G., A. Do\\bki\\b, a\\bd I.H. Witte\\b. 1994. Weka: A machi\\be lear\\bi\\b\\t workbe\\bch. I\\b Proceedings of the Second Austr\\b\\ti\\b \\bnd New Ze\\b\\t\\bnd Conference on Inte\\t\\tigent Infor\\f\\btion Syste\\fs, Brisba\\be, Australia.","La\\bdis, R. J. a\\bd G. G. Koch. 1977. The measureme\\bt of observer a\\treeme\\bt for cate\\torical data. Bio\\fetrics 33, 159-174.","Rittma\\b, R. 2008. Auto\\f\\btic Discri\\fin\\btion of Genres: The Ro\\te of Adjectives \\bnd Adverbs \\bs Suggested by Linguistics \\bnd Psycho\\togy. VDM Verla\\t.","Si\\tley, R. 1997. Text Cate\\tories a\\bd Where You Ca\\b Stick Them: A Crude \\formality I\\bdex. Intern\\btion\\b\\t Journ\\b\\t of Corpus Linguistics, 2(2), 199-237.   139"]}]}