{"sections":[{"title":"  Resolvi\\b\\t M\\fltiple Wh-Fra\\tme\\bts: A Sy\\btax-Pra\\tmatics Approach∗∗∗∗ ","paragraphs":["Sang-H\\b\\b \\tark","","\\f\\bpartm\\bnt of English, S\\boul National Univ\\brsity,","599 Kwanangno, Kwanak-gu, S\\boul mus\\b00@snu.ac.kr"," Abstract. This pap\\br att\\bmpts to provid\\b a n\\bw analysis of multipl\\b wh-fragm\\bnts, th\\b socall\\bd ‘multipl\\b sluicing’, in English. Against pr\\bvious approach\\bs which r\\bsort to a r\\bconstruction/d\\bl\\btion account or a gapping analysis, th\\b propos\\bd analysis captur\\bs multipl\\b wh-fragm\\bnts without positing a copy-d\\bl\\btion m\\bchanism. In fact, multipl\\b whfragm\\bnts ar\\b vi\\bw\\bd as a root claus\\b whos\\b int\\brpr\\btation is d\\bt\\brmin\\bd by pr\\bvious discours\\b cont\\bxt. This is achi\\bv\\bd by sugg\\bsting a n\\bw typ\\b constraint bas\\bd on th\\b analysis of fragm\\bnt by B\\brtom\\bu and Kordoni (2005). Keywords: multipl\\b wh-fragm\\bnts, sluicing, cont\\bxt, r\\bsolution, H\\tSG \\p \\p ∗ I would lik\\b to thank thr\\b\\b anonymous r\\bvi\\bw\\brs for comm\\bnts and sugg\\bstions on th\\b \\barli\\br v\\brsion of this","pap\\br.  Copyright 2009 by Sang-H\\b\\b \\tark"]},{"title":"1 I\\btrod\\fctio\\b","paragraphs":["Sluicing is a ph\\bnom\\bnon which involv\\bs a stand alon\\b wh-phras\\b whos\\b cont\\bnt is partially d\\bt\\brmin\\bd by cont\\bxt.  (1) a. A: Many dissid\\bnts hav\\b b\\b\\bn r\\bl\\bas\\bd.","B: \\fo you know who? b. A: Is th\\br\\b anyon\\b who could possibly unscr\\bw th\\b hatch? B: G\\b\\b, I wish I kn\\bw who. c. A: \\fid anyon\\b show up for class today? B: Yup. A: R\\bally? B: Y\\bah. A: Who? \\p \\p \\p (Ginzburg and Sag, 2000: 321-323)  In th\\bs\\b \\bxampl\\bs, \\bach of th\\b r\\bduc\\bd qu\\bstions contains a singl\\b wh-phras\\b. How\\bv\\br, similar \\bxampl\\bs with mor\\b than on\\b wh-r\\bmnants ar\\b also possibl\\b.  (2) a. A: Som\\b stud\\bnt is r\\bport\\bd to hav\\b quarr\\bl\\bd with a famous prof\\bssor.","B: [Which st\\fde\\bt] [with which professor]? (Ginzburg and Sag, 2000: 301) b. Ev\\bryon\\b bought som\\bthing, but I can’t t\\bll you [who] [what]. ","Th\\b aim of this pap\\br is to obs\\brv\\b pr\\bvious accounts on multipl\\b wh-fragm\\bnts shown in th\\bs\\b \\bxampl\\bs, th\\b so-call\\bd ‘Multipl\\b Sluicing’ in English. It also att\\bmpts to provid\\b an analysis in t\\brms of pragmatic r\\bsolution bas\\bd on B\\brtom\\bu and Kordoni (2005). 435 23rd Pacific Asia Conference on Language, Information and Computation, pages 435–443  "]},{"title":"2 Previo\\fs St\\fdies 2.1 Park a\\bd Ka\\b\\t’s (2007) M\\fltiple Sl\\fici\\b\\t A\\balysis","paragraphs":["Sluicing is g\\bn\\brally assum\\bd to involv\\b an \\bllipsis of a T\\t-constitu\\bnt of a claus\\b, l\\baving a C\\t-proj\\bction containing a wh-r\\bmnant. S\\bnt\\bnc\\bs such as (3) ar\\b analyz\\bd as involving mov\\bm\\bnt of whoi into Sp\\bc of C\\t and subs\\bqu\\bnt d\\bl\\btion of th\\b T\\t.  (3) Arab\\bll\\b is marrying som\\bon\\b you know. Gu\\bss [C\\t whoi [I\\t sh\\b is marrying ti]]!  How\\bv\\br, this analysis cannot simply b\\b \\bxt\\bnd\\bd to \\bxampl\\bs such as (2), b\\bcaus\\b it would th\\bn giv\\b ris\\b to a probl\\bm of having ungrammatical sourc\\b.  (4) *Ev\\bryon\\b bought som\\bthing, but I can’t t\\bll you [who]i [what]j ti bought tj.  \\f\\bspit\\b this imm\\bdiat\\b probl\\bm, this kind of approach is pursu\\bd by \\tark and Kang (2007), who assum\\b that \\bxampl\\bs such as (2) ar\\b ‘g\\bnuin\\b’ multipl\\b sluicing. In ord\\br to block th\\b probl\\bm b\\bhind (4), \\tark and Kang adopt th\\b mov\\bm\\bnt th\\bory of Richard (2001) and \\bxplain that th\\b ungrammaticality of (4) is du\\b to th\\b ill-form\\bd application of th\\b copy-d\\bl\\btion op\\bration. To b\\b sp\\bcific, it is assum\\bd that th\\b first wh-r\\bmnant is associat\\bd with th\\b strong E\\t\\t f\\batur\\b, which d\\bt\\brmin\\bs which copy und\\brgo\\bs d\\bl\\btion. Thus, th\\b tail of th\\b first whr\\bmnant must b\\b d\\bl\\bt\\bd and th\\b h\\bad, i.\\b., th\\b first wh-r\\bmnant its\\blf should r\\bmain at ov\\brt syntax. On th\\b oth\\br hand, in th\\b cas\\b of th\\b s\\bcond wh-r\\bmnant, it is th\\b tail which is associat\\bd with th\\b strong E\\t\\t f\\batur\\b. Thus, what should r\\bmain aft\\br all ar\\b th\\b h\\bad of th\\b first chain and th\\b tail of th\\b s\\bcond chain, r\\bpr\\bs\\bnt\\bd as in (4’). This is th\\b cas\\b w\\b obtain th\\b und\\bl\\bt\\bd count\\brpart of (2b), who bo\\b\\tht what.  (4’) ..., but I can’t t\\bll you [who]i [what]j ti bought tj  L\\bt us turn to th\\b cas\\b of (2b). H\\br\\b, th\\b tail of th\\b s\\bcond wh-r\\bmnant do\\bs not surviv\\b b\\bcaus\\b it is includ\\bd in th\\b T\\t d\\bl\\btion sit\\b. Thus, th\\b h\\bad surviv\\bs inst\\bad and yi\\blds th\\b surfac\\b form in (2b). In short, und\\br \\tark and Kang’s analysis, \\bxampl\\bs lik\\b (4) ar\\b simply non\\bxist\\bnt; \\bith\\br th\\b string in (2b) or (4’) is possibl\\b.","How\\bv\\br, it is suspicious that multipl\\b wh-fragm\\bnts as w\\bll as sluicing involv\\b wh-fronting. According to Ginzburg and Sag (2000), \\bxpr\\bssions such as the he\\f\\f and the heck can only modify \\bxtract\\bd wh-words.  (5) a. A: A fri\\bnd of min\\b cam\\b in.","B: Who (#th\\b h\\bll/#th\\b h\\bck)? b. A: A fri\\bnd of min\\b must hav\\b st\\bpp\\bd in whil\\b I was out. B: I wond\\br who (#th\\b h\\bll/#th\\b h\\bck). \\p (Ginzburg and Sag, 2000: 314) (6) a. A: Som\\b stud\\bnt is r\\bport\\bd to hav\\b quarr\\bl\\bd with a famous prof\\bssor.","B: [Who](#th\\b h\\bll/#th\\b h\\bck) [with who]?","b. Ev\\bryon\\b bought som\\bthing, but I can’t t\\bll you [who](#th\\b h\\bll/#th\\b h\\bck) [what](#th\\b","h\\bll/#th\\b h\\bck).  Th\\b fact that th\\b modifi\\brs the he\\f\\f and the heck cannot app\\bar in th\\bs\\b \\bxampl\\bs is \\bvid\\bnc\\b against any analysis bas\\bd on a r\\bconstruction/d\\bl\\btion op\\bration such as \\tark and Kang (2007). 436   Also, \\tark and Kang’s copy-d\\bl\\btion analysis fac\\bs th\\b probl\\bm of d\\bciding which pr\\bvious","utt\\branc\\b can s\\brv\\b as th\\b ant\\bc\\bd\\bnt of th\\b wh-r\\bmnants.1","For \\bxampl\\b, in (7), th\\b ant\\bc\\bd\\bnt","and th\\b wh-r\\bmnants ar\\b s\\bparat\\bd by thr\\b\\b turns of utt\\branc\\bs.","","(7) A: \\fid anyon\\b show up with any girl for th\\b party y\\bst\\brday? B: Yup. A: R\\bally? B: Y\\bah. A: (\\fo you know) [Who] [with who]?  Mor\\bov\\br, as \\bxampl\\bs in (8) show, th\\br\\b ar\\b cas\\bs wh\\br\\b possibl\\b ant\\bc\\bd\\bnts for wh-","r\\bmnants can only b\\b provid\\bd by th\\b following discours\\b cont\\bxt. In this cas\\b, th\\br\\b is no way","to apply th\\b copy-d\\bl\\btion op\\bration. ","(8) a. I don’t know [who] [with who], but I am sur\\b \\bv\\bryon\\b will g\\bt hook\\bd up with som\\bon\\b. \\p \\p \\p \\p \\p (M\\brchant, 2006: 286) b. I don’t know [who] [with who], but I’m sur\\b \\bv\\brybody will danc\\b with som\\bbody. (Rom\\bro, 1997:197)  Th\\bs\\b facts sugg\\bst that multipl\\b wh-fragm\\bnts cannot b\\b analyz\\bd by r\\bconstruction/d\\bl\\btion bas\\bd analysis."]},{"title":"2.2 A Gappi\\b\\t A\\balysis: Nishi\\ta\\fchi (1998) a\\bd Las\\bik (2007)","paragraphs":["Anoth\\br way to \\bxplain multipl\\b wh-fragm\\bnts is to abandon th\\b multipl\\b sluicing analysis and to propos\\b an alt\\brnativ\\b account: a gapping analysis (Nishigauchi, 1998; Lasnik, 2007). Lasnik argu\\bs that \\bxampl\\bs lik\\b (2) ar\\b sp\\bcial cas\\bs of gapping, with th\\b initial wh-r\\bmnant in Sp\\bc of C\\t and th\\b oth\\br in som\\b oth\\br sp\\bcifi\\br position d\\briv\\bd by rightward focus mov\\bm\\bnt. As \\tark and Kang (2007) not\\b, how\\bv\\br, th\\b s\\bcond r\\bmnant of th\\b multipl\\b wh-fragm\\bnts can b\\b an \\bl\\bm\\bnt which cannot und\\brgo rightward focus mov\\bm\\bnt, such as th\\b \\bxc\\bptionally Cas\\bmark\\bd \\t\\t in (9b)."," (9) a. *I b\\bli\\bv\\b t to b\\b dishon\\bst [th\\b politician with high profil\\b in int\\brnational affairs].","b. On\\b of th\\b boys b\\bli\\bv\\bs b\\bhind on\\b of th\\b tr\\b\\bs to b\\b th\\b b\\bst plac\\b to hid\\b, but I don’t","know [which] [behi\\bd which tree].  Mor\\bov\\br, multipl\\b wh-fragm\\bnts \\bxhibit prop\\brti\\bs that can n\\bv\\br b\\b \\bxplain\\bd und\\br this","approach. First, multipl\\b wh-fragm\\bnts can app\\bar in \\bmb\\bdd\\bd \\bnvironm\\bnts.","","(10) a. Ev\\bryon\\b brought som\\bthing (diff\\br\\bnt) to th\\b potluck, but I couldn’t t\\bll you [who]","[what]. \\p \\p \\p \\p (M\\brchant, 2001:112) b. ?Som\\b linguist criticiz\\bd (y\\bst\\brday) som\\b pap\\br about sluicing, but I don’t know","[which li\\b\\t\\fist] [which paper abo\\ft sl\\fici\\b\\t]. (\\tark and Kang, 2007: 422)  Not\\b, how\\bv\\br, that gapping is not possibl\\b in \\bmb\\bdd\\bd cont\\bxt (Also not\\bd by Takahashi, 1994; Nishigauchi, 1998; \\tark and Kang, 2007). ","\\p \\p","1","G\\bn\\brally, th\\b ant\\bc\\bd\\bnt of th\\b first wh-fragm\\bnt has b\\b\\bn consid\\br\\bd to b\\b a univ\\brsal quantifi\\br (Nishigauchi, 1998; \\tark and Kang, 2007, among oth\\brs). How\\bv\\br, it is doubtful wh\\bth\\br this g\\bn\\bralization is corr\\bct; in (2a) and (6a), th\\b first wh-r\\bmnant involv\\bs an \\bxist\\bntial quantification, and in (7) th\\b parall\\bl \\bl\\bm\\bnt is anyone. Thus, I assum\\b that th\\b acc\\bptability of multipl\\b wh-fragm\\bnts is basically not d\\bp\\bnd\\bnt on th\\b natur\\b of th\\b quantification involv\\bd within th\\b ant\\bc\\bd\\bnt. 437   (11) *John saw Bill, and Tom said that Mary saw Susan.","","Anoth\\br fact that distinguish\\bs th\\b two constructions is th\\b typ\\b of constitu\\bnts involv\\bd. Multipl\\b wh-fragm\\bnts, as th\\b t\\brm sugg\\bsts, can only contain two wh-phras\\bs. On th\\b oth\\br hand, gapping can app\\bar with both a wh- and a non-wh r\\bmnant.  (12) a. I know who Mary talk\\bd to y\\bst\\brday about phonology, ?*but I don’t know [who]","[abo\\ft sema\\btics]. \\p \\p \\p (Lasnik, 2007)","b. Which boy r\\bad Haml\\bt, and [which \\tirl] r\\bad [Macbeth]? (\\tark and Kang, 2007) ","Also, as w\\b obs\\brv\\bd in (8), th\\b fact that multipl\\b wh-fragm\\bnts can app\\bar wh\\bn follow\\bd by th\\b parall\\bl \\bl\\bm\\bnts shows that th\\by cannot b\\b instanc\\bs of gapping.  (13) *\\t\\bt\\br ___ with Susi\\b, and John danc\\bd with Elisab\\bth. "]},{"title":"3 Theoretical Back\\tro\\f\\bd 3.1 Fra\\tme\\bt A\\balysis i\\b HPSG","paragraphs":["W\\b obs\\brv\\bd in th\\b pr\\bvious s\\bction that n\\bith\\br a gapping analysis nor a r\\bconstruction/d\\bl\\btion-bas\\bd multipl\\b sluicing analysis fails to \\bxplain th\\b prop\\brti\\bs of multipl\\b wh-fragm\\bnts. Not\\b, how\\bv\\br, that w\\b r\\bj\\bct\\bd th\\b latt\\br analysis b\\bcaus\\b of th\\b probl\\bm caus\\bd by th\\b natur\\b of th\\b op\\bration involv\\bd. This is important b\\bcaus\\b th\\b basic id\\ba of tr\\bating sluicing and multipl\\b wh-fragm\\bnts as instanc\\bs of a mor\\b g\\bn\\bral typ\\b is t\\bnabl\\b giv\\bn that both constructions involv\\b stand alon\\b wh-r\\bmnants whos\\b s\\bmantics is associat\\bd with th\\b sam\\b typ\\b of illocutionary forc\\b, q\\bestion.","In t\\brms of th\\b H\\bad-\\friv\\bn \\thras\\b Structur\\b Grammar (H\\tSG), this m\\bans that multipl\\b wh-fragm\\bnts can b\\b analyz\\bd by \\bxt\\bnding th\\b works of Ginzburg and Sag (2000) or of B\\brtom\\bu and Kordoni (2005). In both analys\\bs, \\blliptical constructions such as sluicing and short answ\\brs ar\\b analyz\\bd as fragm\\bnts which ar\\b phrasal signs but whos\\b s\\bmantics contain a messa\\te, i.\\b. th\\b minimal ind\\bp\\bnd\\bnt unit of m\\baning. Fragm\\bnts ar\\b r\\bsolv\\bd wh\\bn th\\by s\\brv\\b as prop\\br answ\\brs or utt\\branc\\bs to th\\b qu\\bstions, op\\bn issu\\bs or \\bv\\bn to th\\b surrounding physical \\bnvironm\\bnts. Sinc\\b no r\\bconstruction/d\\bl\\btion op\\bration is involv\\bd, th\\bs\\b analys\\bs do not hav\\b th\\b probl\\bm aris\\b in \\tark and Kang’s (2007) analysis.","In choosing on\\b of th\\b two analys\\bs as th\\bor\\btical background of this study, th\\b diff\\br\\bnc\\bs b\\btw\\b\\bn th\\bs\\b analys\\bs should b\\b consid\\br\\bd; first, in Ginzburg and Sag (2000), fragm\\bnts ar\\b d\\bfin\\bd as h\\bad-daught\\brs of th\\b r\\bl\\bvant clausal typ\\b (dec\\farative-fra\\tment-c\\fa\\bse if it is a short answ\\br, or s\\f\\biced-fra\\tment-c\\fa\\bse if it is a sluic\\b), wh\\br\\bas in B\\brtom\\bu and Kordoni (2005), th\\by ar\\b tr\\bat\\bd as non-h\\bad daught\\brs. Thus, as B\\brtom\\bu and Kordoni point out, Ginzburg and Sag’s analysis has a pot\\bntial probl\\bm wh\\bn th\\b r\\bmnant of an \\blliptical construction involv\\bs mor\\b than on\\b constitu\\bnt, as in th\\b cas\\b of multipl\\b wh-fragm\\bnts. S\\bcond, Ginzburg and Sag assum\\b som\\b syntactic parall\\blism b\\btw\\b\\bn th\\b sourc\\b and th\\b fragm\\bnt. Th\\by captur\\b this by r\\bquiring that th\\b f\\batur\\b CAT(EGORY) of th\\b r\\bmnant and that of th\\b sali\\bnt utt\\branc\\b to b\\b th\\b sam\\b. On th\\b oth\\br hand, for B\\brtom\\bu and Kordoni, th\\b \\bff\\bct of such a parall\\blism is a m\\br\\b \\bff\\bct of an \\bxt\\bnsion of SUBCATEGORIZATION \\tRINCI\\tLE, which r\\bquir\\bs that fragm\\bnts must app\\bar in th\\b surfac\\b form corr\\bsponding to th\\b s\\bmantic rol\\b th\\by r\\bc\\biv\\b from th\\b pr\\bdicat\\b at th\\b s\\bmantic-conc\\bptual l\\bv\\bl. Th\\b following \\bxampl\\b of G\\brman is an \\bvid\\bnc\\b showing that som\\b kind of fragm\\bnts do not hav\\b \\bxplicit linguistic sourc\\b.   438   (14) – Ein\\bn Kaff\\b\\b, \\pbitt\\b.","A coff\\b\\b[acc. masc. sg.] pl\\bas\\b ‘A coff\\b\\b, pl\\bas\\b.’  Consid\\bring th\\bs\\b facts, I d\\bv\\blop my analysis of multipl\\b wh-fragm\\bnts bas\\bd on B\\brtom\\bu and Kordoni (2005)."]},{"title":"3.2 Bertome\\f a\\bd Kordo\\bi (2005)","paragraphs":["In B\\brtom\\bu and Kordoni (2005), two g\\bn\\bral ways of r\\bsolving various typ\\bs of fragm\\bnts ar\\b propos\\bd: r\\bsolution via-id\\bntity, which tak\\bs plac\\b at th\\b s\\bmantic-structural l\\bv\\bl and r\\bsolution via-inf\\br\\bnc\\b, which tak\\bs plac\\b at th\\b s\\bmantic-conc\\bptual l\\bv\\bl. Th\\b first typ\\b finds its sourc\\b in th\\b pr\\bvious sourc\\b, as in (15a) and th\\b s\\bcond typ\\b finds two sourc\\bs of cont\\bxt anchoring: th\\b pr\\bvious discours\\b (15b) and th\\b surrounding physical \\bnvironm\\bnt (15c).  (15) a. > Wh\\bn did 2-\\tac r\\bl\\bas\\b “All \\by\\bs on m\\b”? > And Micha\\bl Jackson “Thrill\\br”? b. > Has Anastacia r\\bl\\bas\\bd any C\\fs in th\\b last y\\bar? - Y\\bs, “L\\bft outsid\\b alon\\b”. > Any priz\\bs? c. > Flights to \\taris. (Utt\\br\\bd by a custom\\br at th\\b trav\\bl ag\\bncy)","(B\\brtom\\bu and Kordoni, 2005)  According to B\\brtom\\bu and Kordoni, in (15a), th\\b structural information of th\\b sourc\\b of th\\b gapp\\bd s\\bnt\\bnc\\b is still in th\\b ‘discours\\b-r\\bcord’, which is a m\\bmory buff\\br that r\\bgist\\brs r\\bpr\\bs\\bntations of th\\b utt\\branc\\bs in an ord\\br pr\\bs\\brving way. In this cas\\b, th\\b first utt\\branc\\b of (15a) can s\\brv\\b as th\\b ant\\bc\\bd\\bnt of th\\b gapp\\bd s\\bnt\\bnc\\b and thus r\\bsolution tak\\bs plac\\b at th\\b s\\bmantic-structural l\\bv\\bl. How\\bv\\br, th\\br\\b is no such dir\\bct linguistic sourc\\b in (15b) and (15c). Y\\bt, in (15b), r\\bsolution is still possibl\\b sinc\\b th\\br\\b ar\\b r\\bpr\\bs\\bntations of obj\\bcts which ar\\b still und\\br ‘focus of att\\bntion’.2","That is, \\bv\\bn though th\\b structural information of th\\b first utt\\branc\\b of (15b) cannot s\\brv\\b as ant\\bc\\bd\\bnt, th\\b obj\\bcts b\\bing talk\\bd about at that point, i.\\b. th\\b fact that Anastacia r\\bl\\bas\\bd som\\b C\\fs last y\\bar, is activ\\b in th\\b m\\bntal r\\bpr\\bs\\bntations of th\\b participants of this conv\\brsation, which is \\bnough to r\\bsolv\\b th\\b fragm\\bnt. In th\\b last cas\\b (15c), \\bllipsis r\\bsolution d\\bp\\bnds on situational \\bnvironm\\bnts which trigg\\br th\\b activation of som\\b script in th\\b knowl\\bdg\\b-bas\\b of th\\b h\\bar\\br.","B\\brtom\\bu and Kordoni propos\\b th\\b following n\\bw dim\\bnsion, re\\b\\tolu\\fion)-\\fype, which classifi\\bs various typ\\bs of fragm\\bnts bas\\bd on th\\b way th\\by ar\\b r\\bsolv\\bd. Th\\b subtyp\\b sem(antic)-str\\bct(\\bra\\f)-res(o\\f\\btion)-fra\\t(ment)-c\\f(a\\bse) r\\bpr\\bs\\bnts cas\\bs such as (15a), wh\\br\\b th\\b r\\bsolution tak\\bs plac\\b at th\\b s\\bmantic-structural l\\bv\\bl. This typ\\b also includ\\bs multipl\\b whfragm\\bnts, which always hav\\b a c\\brtain linguistic sourc\\b. Anoth\\br subtyp\\b sem(antic)- conc(ept\\ba\\f)-res(o\\f\\btion)-fra\\t(ment)-c\\f(a\\bse) r\\bpr\\bs\\bnts fragm\\bnts such as in (15b) and in (15c).        \\p \\p 2 Th\\b assumption b\\bhind this notion is that wh\\bn a sp\\bak\\br choos\\bs to utt\\br fragm\\bnts, it is b\\bcaus\\b h\\b b\\bli\\bv\\bs that","th\\b focus of att\\bntion of th\\b h\\bar\\br and of hims\\blf ar\\b plac\\bd in th\\b sam\\b m\\bntal r\\bpr\\bs\\bntation, and thus, th\\b","h\\bar\\br will b\\b abl\\b to appr\\bciat\\b th\\b m\\baning carri\\bd by fragm\\bnts. 439   (16) reso\\f\\btion-type (B\\brtom\\bu and Kordoni, 2005)   Th\\b sp\\bcification for th\\b typ\\b sem-const-res-fra\\t-c\\f is shown in (17). This typ\\b contains information on th\\b s\\bmantic-structural r\\bpr\\bs\\bntation. Th\\b f\\batur\\b \\fISC-REC(OR\\f), which is a C(ON)T(E)XT f\\batur\\b, has as valu\\b an s\\bmantic-structural obj\\bct of typ\\b m(e)s(sa)\\te-cont(ent)- sem(antic)-obj(ect).3","Th\\b moth\\br’s REL(ATION)S list contain th\\b RELS of th\\b C-CONT and that of th\\b NON-HEA\\f-\\fTRS. This m\\bans that th\\b moth\\br’s m\\baning is compos\\bd from th\\b m\\baning of its h\\bad and th\\b non-h\\bad daught\\brs. Also, th\\b top-l\\bv\\bl s\\bmantics is provid\\bd by th\\b h\\bad-daught\\br. This is achi\\bv\\bd by id\\bntifying th\\b L(OCAL)TO\\t of th\\b C-CONT with GTO\\t.  (17) sem-str\\bct-res-fra\\t-c\\f:   This typ\\b inh\\brits from th\\b following g\\bn\\bral typ\\b fra\\t(ment)-c\\f(a\\bse), which sp\\bcifi\\bs th\\b syntax and d\\b\\bp s\\bmantics of fragm\\bnts. Th\\b f\\batur\\b SEM stands for th\\b s\\bmantic-conc\\bptual \\p \\p 3 ms\\t-cont-sem-obj is a subtyp\\b of m(es)s(a)\\t(e)-sem(antic)-obj(ect) and cont(ent)-sem(antic)-obj(ect), which ar\\b","subtyp\\bs of a sup\\brtyp\\b sem(antic)-obj(ect). Th\\bs\\b typ\\bs r\\bpr\\bs\\bnt s\\bmantic obj\\bcts which s\\brv\\b as valu\\bs of","\\fISC-REC and FOC-ATT. For sp\\bcifications of th\\bs\\b typ\\bs, pl\\bas\\b r\\bf\\br to Figur\\b 1 of B\\brtom\\bu and Kordoni","(2005). 440   r\\bpr\\bs\\bntation and th\\b f\\batur\\b C-SEM th\\b r\\blations that r\\bpr\\bs\\bnt th\\b m\\baning of th\\b h\\baddaught\\br.  (18) fra\\t-c\\f:  "]},{"title":"4 My A\\balysis","paragraphs":["As I not\\bd in s\\bction 3.1, und\\br B\\brtom\\bu and Kordoni’s analysis, fragm\\bnts ar\\b tr\\bat\\bd as nonh\\bad daught\\brs in a g\\bn\\bral h\\bad-compl\\bm\\bnt structur\\b. Th\\b h\\bad-daught\\br is assum\\bd as a phon\\btically \\bmpty \\bl\\bm\\bnt, which contribut\\bs its s\\bmantics to th\\b moth\\br. Thus, this analysis can account for fragm\\bnts involving mor\\b than on\\b constitu\\bnt, such as constructions involving multipl\\b wh-fragm\\bnts.","L\\bt us assum\\b that B\\brtom\\bu and Kordoni’s analysis can b\\b straightforwardly \\bxt\\bnd\\bd to multipl\\b wh-fragm\\bnts, that is, multipl\\b wh-fragm\\bnts ar\\b instanc\\bs of th\\b typ\\b sem-str\\bct-resfra\\t-c\\f. Th\\bn, th\\b two wh-r\\bmnants in this construction will corr\\bspond to NON-HEA\\f-\\fTRS, and th\\b soa of C-CONT │RELS will carry th\\b conc\\bptual s\\bmantics of th\\b v\\brbal h\\bad which s\\bl\\bcts for th\\bs\\b wh-r\\bmnants. Th\\b structur\\b-sharing of RELN valu\\b b\\btw\\b\\bn th\\b soa within \\fISC-REC and th\\b soa within C-CONT will \\bnsur\\b that th\\b r\\blation that th\\b h\\bad-daught\\br provid\\bs is th\\b sam\\b with th\\b r\\blation of th\\b utt\\branc\\b in r\\bc\\bnt discours\\b cont\\bxt. In this way, th\\b r\\blationship b\\btw\\b\\bn th\\b fragm\\bnts and th\\bir ant\\bc\\bd\\bnt can b\\b captur\\bd as far as th\\b cor\\b m\\baning of th\\b ant\\bc\\bd\\bnt is pr\\bs\\bnt within th\\b discours\\b r\\bcord.","How\\bv\\br, this approach is probl\\bmatic b\\bcaus\\b it captur\\bs multipl\\b wh-fragm\\bnts and gapping und\\br th\\b sam\\b typ\\b constraint.4","In ord\\br to corr\\bctly charact\\briz\\b th\\bs\\b two constructions, constraints must b\\b impos\\bd ind\\bp\\bnd\\bntly on \\bach cas\\b.","B\\blow, I propos\\b a n\\bw typ\\b for multipl\\b wh-fragm\\bnts, m\\b\\fti(p\\fe)-wh-fra\\t(ment)-c\\f, which is a subtyp\\b of th\\b typ\\b sem-str\\bct-res-fra\\t-c\\f w\\b obs\\brv\\bd in 3.2. Compar\\bd to this sup\\brtyp\\b, m\\b\\fti-wh-fra\\t-c\\f furth\\br sp\\bcifi\\bs at l\\bast th\\b following facts; first, th\\b typ\\b m\\b\\fti(p\\fe)-whfra\\t(ment)-c\\f must contain two wh-r\\bmnants. This is achi\\bv\\bd by sp\\bcifying th\\b two m\\bmb\\brs of th\\b f\\batur\\b NON-H(EA)\\f-\\fTRS to contain an \\bl\\bm\\bnt of typ\\b param, which r\\bpr\\bs\\bnts th\\b quantificational m\\baning of a wh-\\bxpr\\bssion, within th\\b f\\batur\\b STORE. S\\bcond, th\\b STORE valu\\b of th\\b moth\\br is \\bmpty, which m\\bans that th\\b stor\\bd m\\baning of wh-\\bxpr\\bssions must b\\b r\\btri\\bv\\bd at this nod\\b. Also, this constraint r\\bquir\\bs that th\\b non-h\\bad daught\\brs’ WH valu\\b b\\b \\bmpty, sinc\\b no \\bxtraction is involv\\bd.     \\p \\p 4 Not\\b that th\\b gapping \\bxampl\\b in (15a) is assum\\bd as an instanc\\b of this typ\\b in B\\brtom\\bu and Kordoni (2005). 441   (19) m\\b\\fti-wh-fra\\t-c\\f:   (20) m\\b\\fti-wh-fra\\t-c\\f (inh\\brit\\bd from sup\\brtyp\\bs)   Th\\b \\bxampl\\bs of multipl\\b wh-r\\bmnants obs\\brv\\bd in this pap\\br ar\\b all corr\\bctly lic\\bns\\bd by this constraint; \\bxc\\bpt th\\b \\bxampl\\bs in (8) I r\\bp\\bat b\\blow.  (21) a. I don’t know [who] [with who], but I am sur\\b \\bv\\bryon\\b will g\\bt hook\\bd up with","som\\bon\\b. \\p \\p \\p \\p \\p","b. I don’t know [who] [with who], but I’m sur\\b \\bv\\brybody will danc\\b with som\\bbody.  In this cas\\b, th\\br\\b is no pr\\bdicat\\b that can s\\brv\\b as th\\b h\\bad of th\\b multipl\\b wh-fragm\\bnts b\\bcaus\\b th\\b corr\\bsponding \\bl\\bm\\bnt do\\bs not \\bnt\\br th\\b discours\\b-r\\bcord until who with who is spok\\bn. Rath\\br, it is provid\\bd right aft\\br th\\b fragm\\bnts ar\\b spok\\bn. Thus, it s\\b\\bms that th\\b \\bl\\bm\\bnt corr\\bsponding to th\\b r\\blation tagg\\bd with 5 in (20) is \\bmpty until th\\b fragm\\bnts ar\\b spok\\bn and th\\bn lat\\br fill\\bd wh\\bn th\\b following utt\\branc\\b provid\\bs th\\b corr\\bsponding pr\\bdicat\\b. To impl\\bm\\bnt this id\\ba, a modifi\\bd notion of discours\\b-r\\bcord is n\\b\\bd\\bd, which, at this mom\\bnt, I l\\bav\\b to futur\\b r\\bs\\barch. 442  ","Also, as not\\bd by Nishigauchi (1998), th\\b distribution of \\bmb\\bdd\\bd \\bxampl\\bs such as (2b), r\\bp\\bat\\bd h\\br\\b as (22a), is r\\bstrict\\bd to cas\\bs wh\\br\\b th\\by app\\bar as a compl\\bm\\bnt of factiv\\b/ r\\bsolutiv\\b pr\\bdicat\\bs such as know, discover, for\\tet, te\\f\\f, \\t\\bess, predict. Multipl\\b wh-fragm\\bnts strongly r\\bsist app\\baring as a compl\\bm\\bnt of Qu\\bstion Emb\\bdding (QE) pr\\bdicat\\bs5","such as ask, wonder, investi\\tate, and disc\\bss.  (21) a. Ev\\bryon\\b bought som\\bthing, but I can’t t\\bll you [who] [what].","b. Ev\\bryon\\b bought som\\bthing. *?I wond\\br [who] [what]. (Nishigauchi, 1998: 146)  Assuming Ginzburg and Sag’s (2000) accounts on th\\bs\\b pr\\bdicat\\bs, it s\\b\\bms that th\\b pr\\bf\\br\\bnc\\b for factiv\\b/r\\bsolutiv\\b pr\\bdicat\\bs com\\bs from th\\b fact that th\\bs\\b pr\\bdicat\\bs do not simply tak\\b qu\\bstions as th\\bir argum\\bnt, but rath\\br co\\brc\\b th\\b qu\\bstion into a fact. At th\\b mom\\bnt, my b\\bst approximation is that th\\b goal of sp\\baking multipl\\b wh-fragm\\bnts in a conv\\brsation is not to ask th\\b h\\bar\\br about th\\b r\\bf\\br\\bnts of th\\b wh-\\bxpr\\bssions, but to ass\\brt a fact about th\\b pr\\bviously utt\\br\\bd proposition \\b.g. that h\\b knows or do\\bs not know who th\\by r\\bally ar\\b. Though I do not provid\\b a d\\btail\\bd analysis of this issu\\b, th\\b (im)possibility of \\bmb\\bdding with c\\brtain pr\\bdicat\\bs can b\\b captur\\bd by r\\bfining th\\b l\\bxical \\bntri\\bs of pr\\bdicat\\bs which tak\\b a s\\bnt\\bntial compl\\bm\\bnt whos\\b cont\\bnt is typ\\b q\\bestion."]},{"title":"5 Co\\bcl\\fsio\\b","paragraphs":["In this pap\\br, I propos\\bd an alt\\brnativ\\b analysis of multipl\\b wh-fragm\\bnts. I sugg\\bst\\bd that th\\b r\\bsolution of multipl\\b wh-fragm\\bnts is, to som\\b \\bxt\\bnt, d\\bt\\brmin\\bd by discours\\b cont\\bxt. Furth\\br r\\bs\\barch is r\\bquir\\bd to \\bxplain th\\b narrow\\br distribution of \\bmb\\bdd\\bd cas\\bs and th\\b fact that th\\b sourc\\b can b\\b provid\\bd right aft\\br multipl\\b wh-fragm\\bnts ar\\b utt\\br\\bd."]},{"title":"Refere\\bces","paragraphs":["Boling\\br, \\f. 1978. Asking mor\\b than on\\b Thing at a Tim\\b. In H. Hiz, \\bd., Q\\bestions, pp. 107-","150. \\fordr\\bcht: R\\bid\\bl. B\\brtom\\bu, N. and V. Kordoni. 2005. Int\\bgrating \\tragmatic Information in Grammar. An","Analysis of Int\\brs\\bnt\\bntial Ellipsis. In S. Müll\\br, \\bd., Proceedin\\ts of the HPSG05","Conference. Ginzburg, J. and I. A. Sag. 2000. Interro\\tative Investi\\tations: The Form, Meanin\\t, and Use of","En\\t\\fish Interro\\tatives. Stanford: CSLI. Lasnik, H. 2007. Multipl\\b Sluicing. A handout giv\\bn in LING 819 Sprin\\t 2007. Univ\\brsity of","Maryland. M\\brchant, J. 2001. The Syntax of Si\\fence: S\\f\\bicin\\t, Is\\fands, and the Theory of E\\f\\fipsis. Oxford. Nishigauchi, T. 1998. ‘Multipl\\b Sluicing’ in Japan\\bs\\b and th\\b Functional Natur\\b of Wh-\\thras\\bs.","Jo\\brna\\f of East Asian Lin\\t\\bistics, 7, pp. 121-152. \\tark, M.-K. and J.-M. Kang. 2007. Som\\b R\\bmarks on Multipl\\b Sluicing in English. St\\bdies in","Generative Grammar, 17(1), pp. 419-434. Richard, N. 2001. Movement in Lan\\t\\ba\\te. Oxford: Oxford Univ\\brsity \\tr\\bss. Rom\\bro, M. 1997. R\\bcov\\brability Conditions for Sluicing. In F. Corblin et a\\f., \\bds., Empirica\\f","Iss\\bes in Forma\\f Syntax and Semantics. pp. 193-216. \\t\\bt\\br Lang: B\\brn. Takahashi, \\f. 1994. Sluicing in Japan\\bs\\b. Jo\\brna\\f of East Asian Lin\\t\\bistics, 3, pp. 263-300. \\p \\p 5 This t\\brm is adopt\\bd from Ginzburg and Sag (2000). 443"]}]}