{"sections":[{"title":"How Lan\\b\\ta\\be P\\focessin\\b Const\\fains (Comp\\ttational) Nat\\t\\fal Lan\\b\\ta\\be P\\focessin\\b: A Co\\bnitive Pe\\fspective ","paragraphs":["Prakash ωυωtndaω+","","Cωtgnitive Science Lab, Internatiωtnaω+ Institute ωtf Infωtrmatiωtn Technωtω+ωtgy,","Rωtωtm Nωt. C-8, NBH, Hyderabad 500032, India prakash.mωtndaω+@research.iiit.ac.in Abst\\fact. In this paper I aim at sketching ωtut in bare ωtutω+ine a new mωtdeω+/framewωtrk ωtf ω+anguage prωtcessing with its impω+icatiωtns fωtr naturaω+ ω+anguage prωtcessing. Research in theωtreticaω+ ω+inguistics, cωtmputatiωtnaω+ ω+inguistics and mathematicaω+ ω+inguistics has deω+ineated the ways naturaω+ ω+anguage can be represented and mωtdeω+ed. Studies in cωtgnitive (neurωt)science, ωtn the ωtther hand, have shωtwn hωtw ω+anguage prωtcessing is impω+emented in human cωtgnitive machinery. Here an attempt wiω+ω+ be made tωt integrate aω+ω+ these findings intωt a mathematicaω+ mωtdeω+ ωtf ω+anguage prωtcessing which wiω+ω+ pωtint tωt sωtme pωttentiaω+ cωtnstraints ωtn what naturaω+ ω+anguage prωtcessing can achieve ωtr dωt and what it pωtssibω+y cannωtt. Keywo\\fds: Language prωtcessing, mathematicaω+ mωtdeω+, theωtreticaω+ ω+inguistics, cωtmputatiωtnaω+ ω+inguistics, cωtgnitive science."]},{"title":"1 Int\\fod\\tction1 ","paragraphs":["A ω+ωtt ωtf research in mainstream theωtreticaω+ ω+inguistics (Chωtmsky, 1995, 2000; Pωtω+ω+ard and Sag, 1994; Bresnan, 1982, 2001; Jackendωtff, 2002), mathematicaω+ ω+inguistics (ωυanaster-Ramer, 1987; Kracht, 2003), cωtmputatiωtnaω+ ω+inguistics/naturaω+ ω+anguage prωtcessing (Berwick, 1985; Bartωtn et al., 1987; Aω+tman, 1995; Hausser, 2001; Rωtark and Spωtrat, 2007) has shωtwn hωtw the representatiωtnaω+, structuraω+ and ω+ωtgicaω+ prωtperties ωtf naturaω+ ω+anguage can be mωtdeω+ed. On the ωtther hand, an emerging bωtdy ωtf research in cωtgnitive neurωtscience ωtf ω+anguage (Leveω+t, 1989; Grωtdzinsky et al., 2000; Brωtwn, 2001; Puω+vermüω+ω+er, 2002; Hagωtωtrt, 2003; Paradis, 2004; Pωteppeω+, 2004) has reveaω+ed the ways thωtse prωtperties ωtf ω+anguage are represented in human brain shωtwing their cωtnnectiωtn tωt cωtgnitive mechanisms ωtf ω+anguage prωtcessing. But there seems tωt be a guω+f between these apprωtaches ωtn ωtne hand, and between the integrated resuω+ts frωtm these studies and naturaω+ ω+anguage prωtcessing in artificiaω+ inteω+ω+igence ωtn the ωtther. Apart frωtm that, mathematicaω+ ω+inguistics dωtes nωtt seem tωt have cωtmmitted itseω+f tωt cωtnsidering and refω+ecting these issues bωtrdering ωtn wider crωtss-cωtnnectiωtns. Against this cωtntext, it becωtmes a pragmatic need tωt see hωtw aω+ω+ these issues can be ω+inked tωt each ωtther. The present prωtpωtsaω+ is aimed at bridging the guω+f as specified abωtve, which wiω+ω+ prωtbabω+y prωtject far reaching impω+icatiωtns fωtr naturaω+ ω+anguage prωtcessing in artificiaω+ inteω+ω+igence in generaω+. A generaω+ architecture ωtf ω+anguage embedded within a cωtgnitive architecture wiω+ω+ first be drawn up tωt uω+timateω+y shωtw hωtw it might cωtnstrain naturaω+ ω+anguage prωtcessing. In the middω+e, a mathematicaω+ expω+ωtratiωtn ωtf ω+anguage and ω+anguage prωtcessing as faω+ω+ing ωtut ωtf the generaω+ architecture ωtf ω+anguage wiω+ω+ aω+sωt be taken up in ωtrder tωt derive significant fωtrmaω+ generaω+izatiωtns that the entire architecture ωtffers.","The aim is tωt strike ωtut a synergistic cωtnfω+uence between the (fωtrmaω+) ω+inguistic nωttiωtns and cωtncepts, and the emerging generaω+ architecture ωtf ω+anguage which wiω+ω+ be shωtwn tωt be bωtund up with each ωtther. In sum, it wiω+ω+ be argued that the nature ωtf ruω+es, cωtnstraints, functiωtn, prωtcessing, ω+anguage universaω+s and cωtmpetence as derived frωtm the ωtveraω+ω+ generaω+ architecture ωC ωC  Cωtpyright 2009 by Prakash ωυωtndaω+ 365 23rd Pacific Asia Conference on Language, Information and Computation, pages 365–374 ωtf ω+anguage has deep impω+icatiωtns fωtr cωtmputatiωtnaω+ inteω+ω+igence underω+ying naturaω+ ω+anguage prωtcessing."]},{"title":"2 A Gene\\fal A\\fchitect\\t\\fe of Lan\\b\\ta\\be","paragraphs":["Here a generaω+ functiωtnaω+ architecture ωtf ω+anguage wiω+ω+ first be presented with an eye ωtn its pωttentiaω+ impω+icatiωtns fωtr the ωtveraω+ω+ framewωtrk ωtf the mathematicaω+ mωtdeω+ tωt be expω+ωtred here. A certain generaω+izatiωtns wiω+ω+ be drawn up frωtm this generaω+ architecture ωtf ω+anguage tωt be impω+emented in and intertwined with a superimpωtsed cωtgnitive architecture. Such impω+icatiωtns wiω+ω+ be extrapωtω+ated fωtr the cωtgnitive architecture within which the mathematicaω+ framewωtrk wiω+ω+ be pωtsitiωtned. A range ωtf studies in ω+inguistic phenωtmena (Neeω+man and Ackema, 2004; Hengeveω+d et al., 2004; ωυascaró, 2007) are increasingω+y pωtinting tωtward mωtre intercωtnnected, fω+uid interactiωtns amωtng the cωtmpωtnents ωtf ω+anguage- syntax, semantics, ω+exicωtn, mωtrphωtω+ωtgy and phωtnωtω+ωtgy. Nωtw ω+et’s have a ω+ωtωtk at the generaω+ architecture as given beω+ωtw.  ","","ωC ωC Fi\\b\\t\\fe 1: A muω+tipartite unified functiωtnaω+ architecture ωtf ω+anguage  This is a functiωtnaω+ ω+eveω+ architecture ωtf ω+anguage in mind/brain. The nωtdes are functiωtnaω+ mωtduω+es, nωtt in Fωtdωtrian sense. They are functiωtnaω+ω+y cωtherent units ωtf representatiωtnaω+ resωturces reaω+ized in diffuse, ωtften shared netwωtrks ωtf brain regiωtns (Gωtbet, 2005; Dωtwning, 2005). Such representatiωtnaω+ resωturces can be characterized in terms ωtf the activatiωtn patterns in neuraω+ regiωtns which are invωtω+ved in the cωtmpωtnents ωtf ω+anguage-nameω+y, ω+exicωtn, syntax, semantics, phωtnωtω+ωtgy and mωtrphωtω+ωtgy. And the bi-directiωtnaω+ arrωtws regiment prωtcessing cωtnnectiωtns amωtng them. Here we get in the architecture prωtcessing ωtf representatiωtns, sωt prωtcessing is unified with representatiωtns. Prωtcessing interacts with and infω+uences the representatiωtns in mind/brain in a mutuaω+ mωtduω+atωtry dynamics and prωtcessing appω+ied tωt representatiωtns wiω+ω+ cωtnstitute (ω+inguistic) structures. In the prωtpωtsed architecture abωtve cωtmputatiωtn can run in any directiωtn invωtω+ving any number ωtf ω+anguage dωtmains fωtr the interpretatiωtn ωtf any type ωtf interactiωtn effects- whether ω+arge ωtr smaω+ω+- amωtng the cωtmpωtnents ωtf ω+anguage. Different ω+inguistic phenωtmena wiω+ω+ invωtω+ve different sets ωtf interactiωtns amωtng the cωtmpωtnents. Here interface/interactiωtn effects can be cωtmputed in paraω+ω+eω+ frωtm and in any directiωtn invωtω+ving any number ωtf dωtmains ωtr mωtduω+es ωtf ω+anguage given that ωtnω+y sωtme cωtntent ωtf each as required by ωtthers is avaiω+abω+e tωt the ωtthers. These cωtnstraints wiω+ω+ encωtde hωtw each cωtmpωtnent ωtf ω+anguage wiω+ω+ interact with the ωtthers, sωt fωtr exampω+e, a specific cωtnstraint can determine hωtw much infωtrmatiωtn shωtuω+d be passed frωtm syntax tωt phωtnωtω+ωtgy tωt which matters ωtf recursiωtn, argument structure, wωtrd ωtrder etc. may be irreω+evant but syntactic cωtnstituency may weω+ω+ be reω+evant in specific situatiωtns. At best, such cωtnstraints may weω+ω+ be variabω+e acrωtss different ω+anguages-sωtme absωtω+ute and sωtme reω+ative. Befωtre we prωtceed, ω+et’s specify a number ωtf cωtncepts tωt be used fωtr the fωtrmaω+izatiωtns in ω+ater sectiωtns beω+ωtw. A li\\b\\tuisti\\f phe\\bome\\bo\\b is any phenωtmenωtn that invωtω+ves a kind ωtf interactiωtn between any number ωtf cωtmpωtnents ωtf ω+anguage fωtr the ωtbserved reguω+arities/irreguω+arities fωtund acrωtss ω+anguages. An i\\btera\\ftio\\b between any number ωtf cωtmpωtnents ωtf ω+anguage invωtω+ves a sωtrt ωtf 366 interfacing between them such that such interfacing causes the cωtmpωtnents ωtf ω+anguage invωtω+ved in the interactiωtn tωt map required infωtrmatiωtn ωtntωt each ωtther, fωtr exampω+e, the ω+inguistic phenωtmenωtn ωtf split i\\btra\\bsitivity- a distinctiωtn between ergativity/unaccusativitycauses syntax, ω+exicωtn, mωtrphωtω+ωtgy and semantics tωt wωtrk in tandem and have impacts ωtn ωtne anωtther. Computatio\\bal releva\\b\\fe requires the mapping ωtf as much ω+inguistic infωtrmatiωtn at the interfaces between the cωtmpωtnents ωtf ω+anguage as is feasibω+e and needed in a given ω+inguistic phenωtmenωtn. Adequa\\fy of i\\bformatio\\b is the amωtunt ωtf ω+inguistic infωtrmatiωtn as demanded in the requirements ωtf cωtmputatiωtnaω+ reω+evance, sωt fωtr exampω+e, in the ω+inguistic phenωtmenωtn ωtf middle \\fo\\bstru\\ftio\\bs infωtrmatiωtn abωtut wωtrd ωtrder/ω+inearity, agreement frωtm syntax are tωt be characterized as adequate infωtrmatiωtn .","Stipulati\\b\\t Fωtr any χ in any L there must be an I(χ) such that there is a set Ω ωtf Lc which are in paraω+ω+eω+ interactiωtn with each ωtther with τ(I(χ)) and |Lc |= Θ and Θ≥ 1 and Ω ≠ Ø iff I(χ) satisfies a set Ф ωtf cωtnstraints that ωtperate ωtn I(χ).","What this means is simpω+y that fωtr any ω+inguistic phenωtmenωtn χ in any ω+anguage L, there must be sωtme interactiωtn invωtω+ved in χ which is I(χ) determined by cωtmputatiωtnaω+ reω+evance and adequacy ωtf infωtrmatiωtn τ such that there is a set Ω ωtf ω+inguistic cωtmpωtnents Lc interacting with each ωtther in χ and Lc can be ωtf any number Θ but Θ must nωtt be equaω+ tωt zerωt, that is, must be equaω+ tωt ωtne ωtr mωtre than ωtne and the set Ω ωtf Lc must nωtt be a nuω+ω+ set with the set Ф ωtf cωtnstraints that ωtperate ωtn the mutuaω+ interactiωtn(s) ωtf the ω+inguistic dωtmains."]},{"title":"3 Towa\\fd a Co\\bnitive A\\fchitect\\t\\fe of Lan\\b\\ta\\be P\\focessin\\b","paragraphs":["It is necessary tωt fit the functiωtnaω+ architecture ωtf ω+anguage intωt an architecture incωtrpωtrating ωtther cωtgnitive dωtmains sωt that hωtw this architecture ωtf ω+anguage interacts with ωtther cωtgnitive dωtmains can be ω+inked tωt neuraω+ prωtcessing at the ω+ωtwer ω+eveω+. The extended picture in Figure 2 beω+ωtw is aω+sωt symmetric with certain cωtnstraints ωtn their mutuaω+ interactiωtn such that nωtt aω+ω+ infωtrmatiωtn passes frωtm ωtne dωtmain/system tωt anωtther. Such cωtnstraints- cωtmputatiωtnaω+, aω+gωtrithmic and impω+ementatiωtnaω+ in ωυarr’s (1982) sense- are specified by ωtur genωtme. They can each be specified in the manner beω+ωtw. Comp\\ttational Const\\faints: Cωtmputatiωtnaω+ cωtnstraints wiω+ω+ invωtω+ve cωtnstraints that deω+imit the range ωtf chωtices the mωtduω+atωtry interactive dynamics between the cωtgnitive dωtmains prωtduces fωtr adaptive prωtbω+em sωtω+ving. Sωt fωtr instance, such a cωtnstraint can determine hωtw much (wωtrking) memωtry can be aω+ω+ωtcated fωtr ωtnω+ine cωtnstructiωtn ωtf syntactic cωtnstituents ωtr stωtrage ωtf them during cωtmprehensiωtn. Al\\bo\\fithmic Const\\faints: Aω+gωtrithmic cωtnstraints are thωtse cωtnstraints that cωtnsist ωtf restrictiωtns ωtn the aω+gωtrithmic prωtcesses that inter-dωtmain interactiωtns can cωtnstruct based ωtn the avaiω+abω+e resωturces fωtr specific tasks. It shωtuω+d aω+sωt be nωtted that the aω+gωtrithmic prωtcesses in each cωtgnitive dωtmain may be different frωtm thωtse in the ωtther(s) (Rωteper, 2007). Such cωtnstraints may, fωtr exampω+e, affect hωtw infωtrmatiωtn can be transferred frωtm visuaω+ perceptiωtn tωt ω+anguage sωt that ω+anguage may recωtnstruct the visuaω+ perceptuaω+ space, sωt finer detaiω+s ωtf visuaω+ perceptiωtn may nωtt be avaiω+abω+e tωt ω+anguage because ωtf such aω+gωtrithmic cωtnstraints. Implementational Const\\faints: Impω+ementaω+ cωtnstraints are cωtnstraints that fix up the ω+ayωtuts ωtf neuraω+ cωtnnectivity amωtng netwωtrks ωtf brain regiωtns such that cωtgnitive functiωtns are deω+imited by the manner ωtf neuraω+ cωtnnectivity amωtng neuraω+ netwωtrks. Cωtnstraints ωtf this kind are mωtstω+y ω+aid ωtut geneticaω+ω+y ωtr epigeneticaω+ω+y and mωtdified tωt a ω+arge extent during deveω+ωtpmentaω+ trajectωtry.","Sωt these cωtnstraints fix up rather than determine hωtw the cωtgnitive dωtmains ωtr mωtduω+es are gωting tωt interact with each ωtther. Enumerating aω+ω+ ωtf them wiω+ω+ be a big prωtbω+em, since we dωt nωtt yet knωtw hωtw many cωtnstraints appω+y tωt the cωtgnitive dωtmains in questiωtn. Nωtr dωt we knωtw in fuω+ω+ detaiω+s hωtw they ω+ay ωtut the maps ωtf interactiωtnaω+ bωtundaries between the cωtgnitive 367 dωtmains ωtr mωtduω+es, since a mapping frωtm genes tωt behaviωtr and cωtgnitiωtn is stiω+ω+ ωtut ωtf ωtur reach (Karmiω+ωtff-Smith, 1992; Heschω+, 2002).   ωC   ωC Fi\\b\\t\\fe 2: Intercωtnnectiωtn ωtf ω+anguage tωt ωtther cωtgnitive dωtmains/systems.  Here aω+ω+ these dωtmains have varying interactiωtns (I(d)) with respect tωt each ωtther; what this means is that aω+ω+ these cωtgnitive dωtmains have differentiaω+ mutuaω+ interactiωtns with respect tωt each ωtther. And this can be represented thrωtugh a distributiωtn ωtf jωtint prωtbabiω+ity in the fωtω+ω+ωtwing equatiωtn. This is in cωtnsωtnance with ωυωtndaω+ (2009). The interactiωtn pωttentiaω+ I(φ) can be characterized as  ωC N I(φ) ="]},{"title":"Σ","paragraphs":["Pi ∫ d c1, ... d cN δ(c1 ... cN). ∆ψ (1) ωC i=1 ωC","Here \\f1 ... \\fN are differentiaω+ prωtbabiω+ity functiωtns cωtming ωtut ωtf the interactiωtn dynamics ωtf ω+anguage with ωtther cωtgnitive dωtmains and N in \\f1 ... \\fN must be a finite arbitrary number as required fωtr the tωttaω+ity ωtf cωtgnitive dωtmains; P is a prωtbabiω+ity functiωtn; ∆ψ is a tempωtraω+ distributiωtn. The cωtgnitive dωtmains are functiωtnaω+ω+y cωtherent units ωtf emergent seω+f-ωtrganizing representatiωtnaω+ resωturces reaω+ized in diffuse, ωtften shared and ωtverω+apping, netwωtrks ωtf brain regiωtns as mediated by the bidirectiωtnaω+ interactiωtns in Figure 2. This is aω+sωt cωtnsistent with the dynamicaω+ view ωtf cωtgnitiωtn (Spivey, 2007). Hωtwever, it may be ωtbjected that aω+ω+ the dωtmains are cωtnnected tωt each ωtther in a symmetric fashiωtn, since such an architecture aω+ω+ωtws fωtr transfer ωtf infωtrmatiωtn in any directiωtn given that sωtme cωtnstraints are maintained. But in biωtω+ωtgy such symmetric intercωtnnectiωtns are being increasingω+y recωtgnized (Gωtttω+ieb, 2002; Dunbar, 2007). Apart frωtm that, research in deveω+ωtpmentaω+ neurωtscience and neurωtbiωtω+ωtgy ωtf ω+anguage (Neviω+ω+e and D. Baveω+ier, 1998; Stiω+es, 2000; Diamωtnd et al., 2004; Davidsωtn et al., 2006; Jωthnsωtn, 2001; Jωthnsωtn and Karmiω+ωtff-Smith, 2003; Lieberman, 2006) is aω+sωt pωtinting tωtward a greater intercωtnnectedness and neuraω+ ωtverω+ap between the cωtgnitive mωtduω+es ωtr dωtmains. They aω+ω+ emerge in cω+ωtse synergy acrωtss the deveω+ωtpmentaω+ scaω+e. Research in the area ωtf Co\\t\\bitive Li\\b\\tuisti\\fs (Faucωtnnier, 1985, 1997, 2002; Lakωtff, 1987; Langacker, 1987) has aω+sωt increasingω+y emphasized that ω+anguage, memωtry, visiωtn, mωttωtr system and ωtther cωtgnitive dωtmains are interω+inked tωt each ωtther in what we mean by ω+anguage. These are nωtt just disparate findings; they pωtint tωtward sωtmething. Nωtw the time has perhaps cωtme tωt amass findings and resuω+ts frωtm fieω+ds as diverse as cωtgnitive neurωtscience, (deveω+ωtpmentaω+) genetics, evωtω+utiωtnary biωtω+ωtgy, deveω+ωtpmentaω+ neurωtpsychωtω+ωtgy, psychωtω+inguistics, neurωtω+inguistics tωtward expω+ωtring ω+anguage in its brωtadest pωtssibω+e spectrum sωt that the nature ωtf ω+anguage at aω+ω+ ω+eveω+s can be unω+ωtcked. The symmetric intercωtnnected architecture ωtf ω+anguage is mωttivated ωtn these grωtunds. Visiωtn, memωtry, mωttωtr system, auditωtry 368 system, emωttiωtn, sωtciaω+ cωtgnitiωtn are aω+ω+ ω+inked tωt each ωtther here in the architecture, as they aω+ω+ have sωtmething tωt dωt with ω+anguage. It may nωtt be the case that aω+ω+ wiω+ω+ have equaω+ infω+uence and mωtduω+atiωtn ωtn each ωtther; rather they must have differentiaω+ infω+uence ωtn each anωtther. Fωtr exampω+e, memωtry might infω+uence and mωtduω+ate ω+anguage mωtre than visiωtn. These factωtrs wiω+ω+ certainω+y be a part ωtf the cωtnstraints ωtn their mutuaω+ interactiωtn. Hωtwever, here the reasωtns fωtr incω+uding emωttiωtn and sωtciaω+ cωtgnitiωtn are twωtfωtω+d. First, the rωtω+e ωtf emωttiωtn and sωtciaω+ cωtgnitiωtn in ω+anguage has been reω+ativeω+y negω+ected in the ω+iterature. But recentω+y the cωtnnectiωtn between ω+anguage and emωttiωtn (Shanahan, 2007) has been raised. Shanahan (2007) argues that it is ωtur emωttiωtns that prωtjected the symbωtω+ic system that was ω+ater adapted tωt ω+inguistic capacity. Given the pωtssibiω+ity that emωttiωtn prωtvided a bωtωtst tωt the grωtwth ωtf a symbωtω+ic capacity mediating the ω+anguage-emωttiωtn interface, we find that ω+anguage interacts with emωttiωtn at muω+tipω+e ω+eveω+s with much strωtnger bωtnd than has been perhaps presumed. Evidence ωtf this cωtmes frωtm ω+anguage acquisitiωtn research where it is becωtming cω+earer that withωtut emωttiωtnaω+ mechanisms ω+anguage acquisitiωtn is aω+mωtst impωtssibω+e (Paradis, 2004). Emωttiωtnaω+ mechanisms as we understand them are aω+sωt inseparabω+e frωtm sωtciaω+ cωtgnitiωtn. A range ωtf findings (Jωthnsωtn et al., 2005; Jackendωtff, 2007; Kinzω+er, 2007; Oω+sωtn, 2007) suggest that ω+anguage, perceptiωtn and sωtciaω+ cωtgnitiωtn gωt tωtgether in humans’ cωtgnitive deveω+ωtpment and heω+p in cωtgnitive tasks based ωtn differentiaω+ prωtcessing requirements. Such findings cωtupω+ed with research in sωtciωtω+inguistics (Hymes, 1972) can be integrated in suppωtrt ωtf the architecture abωtve that pωtsits that there is a symmetric intercωtnnectiωtn between ω+anguage and ωtther cωtgnitive dωtmains incω+uding emωttiωtn and sωtciaω+ cωtgnitiωtn. Cωtmputatiωtnaω+ω+y speaking, sωtciaω+ cωtgnitiωtn wiω+ω+ cωtntain an ωtntωtω+ωtgy ωtf knωtwω+edge abωtut sωtciaω+ categωtries, status, vaω+ues, pωtwer, sωtciaω+ setting etc. Aω+ω+ this indicates that there is much cω+ωtser cωtupω+ing between the cωtgnitive dωtmains than has been assumed. This is what makes the whωtω+e architecture susceptibω+e tωt simpω+icity cωtupω+ed with cωtmpω+exity as wiω+ω+ be discussed in the fifth sectiωtn where it wiω+ω+ be ω+inked tωt cωtmputatiωtnaω+ inteω+ω+igence. This architecture pωtssesses simpω+icity in the sense that there are fewer number ωtf assumptiωtns that are buiω+t intωt the architecture, it is cωtmpω+ex in that the entire architecture is structuraω+ω+y cωtmpωtsed ωtf cωtnstituent subsystems each ωtf which again having its ωtwn subsystems."]},{"title":"4 Towa\\fd a Mathematical Ca\\fto\\b\\faphy of a Lan\\b\\ta\\be Model","paragraphs":["A range ωtf mathematicaω+ generaω+izatiωtns by means ωtf extrapωtω+atiωtns frωtm the assumptiωtns made abωtve can nωtw be sketched ωtut as fωtω+ω+ωtwing ωtut frωtm the ωtveraω+ω+ picture ωtf the architecture ωtf ω+anguage abωtve. Such mathematicaω+ generaω+izatiωtns can be drawn up in such a way that such generaω+izatiωtns wiω+ω+ have cωtnstraints ωtn tωtp frωtm the superimpωtsed cωtgnitive architecture and at bωtttωtm frωtm the generaω+ architecture ωtf ω+anguage embedded in that cωtgnitive architecture. It is beω+ieved that such mathematicaω+ generaω+izatiωtns cω+ωtthe the famiω+iar nωttiωtns abωtut ω+anguage in a newer way sωt that significant insights can be derived frωtm an integratiωtn ωtf mathematicaω+ mωtdeω+ing, a cωtgnitive architecture and a generaω+ized architecture ωtf ω+anguage. Hence, here a set ωtf ω+inguistic cωtncepts in reω+atiωtn tωt neurωtcωtmputatiωtnaω+ prωtcessing ωtf ω+anguage wiω+ω+ be mathematicaω+ω+y fωtrmaω+ized. Vectωtrs wiω+ω+ be used in the fωtrmaω+izatiωtn as given beω+ωtw since they are perhaps better suited fωtr the task ωtf a mathematicaω+ mωtdeω+. Even if ωtne may have certain reservatiωtns regarding their mωtdeω+ing capabiω+ities in the framewωtrk being prωtpωtsed here, parsimωtny dictates that the mωtre cωtmpact and ω+ess eω+abωtrate characterizatiωtn with much currency be used. The same principω+e wiω+ω+ be regimented here. First, ω+et us characterize the cωtmpωtnents ωtf ω+anguage L as a set ωtf vectωtrs representing syntactic, semantic, mωtrphωtω+ωtgicaω+ and ω+exicaω+ features, prωtcesses and cωtmpωtnents. ωC","ωC L= {α1, α2, α3, ... ,αn} ωC (2)  Sωt the same can be said abωtut ωtther cωtgnitive systems, memωtry (ωυ), attentiωtn (A), visiωtn","(V), auditiωtn (AD), emωttiωtn (E), mωttωtr system (ωυS), and sωtciaω+ cωtgnitiωtn (SC).  369","ωC ωυ= {β1, β2, β3, ..., βn} ωC (3)","ωC A= {γ1, γ2, γ3, ..., γn} ωC (4)","ωC V= {ω1, ω2, ω3, ..., ωn} ωC (5)","ωC AD= {ξ1, ξ2, ξ3, ..., ξn} ωC (6)","ωC E= {π1, π2, π3, ..., πn} ωC (7)","ωC ωυS= {φ1, φ2, φ3, ..., φn} ωC (8)","ωC Sc= {μ1, μ2, μ3, ..., μn} ωC (9)","ωC","ωυemωtry (ωυ) wiω+ω+ have cωtmpωtnents ω+ike wωtrking memωtry, ω+ωtng-term memωtry, semantic","memωtry etc. in the vectωtrs; attentiωtn (A) wiω+ω+ have as cωtmpωtnents ωtvert attentiωtn, cωtvert","attentiωtn etc.; visiωtn (V) wiω+ω+ have as cωtmpωtnents featuraω+ visiωtn, spatiaω+ visiωtn etc.; auditiωtn","(AD) wiω+ω+ have cωtmpωtnents ω+ike acωtustic-phωtnetic auditiωtn, articuω+atωtry-auditωtry mapping etc.;","emωttiωtn (E) wiω+ω+ have as cωtmpωtnents affect, mωtωtd, cωtnatiωtn ωtf affect etc.; mωttωtr system (ωυS)","wiω+ω+ have schemas ωtf seω+ectiωtn, pω+anning, executiωtn, and sωtciaω+ cωtgnitiωtn (SC) wiω+ω+ have","ωtntωtω+ωtgies ωtf status, hierarchy, register, sωtciaω+ setting etc. Undωtubtedω+y, in many cases the","vectωtrs representing cωtmpωtnents, features, prωtcesses in each cωtgnitive dωtmain/system wiω+ω+ be","ωtverω+apping. Hωtwever, here any vectωtr (Vi) wiω+ω+ have the fωtω+ω+ωtwing dynamics as specified in","(Spivey, 2007). ωC ∂ Vi = f (Vi) ωC (10) ωC ∂t "]},{"title":"4.1 Mathematical St\\f\\tct\\t\\fe of R\\tles, Const\\faints, F\\tnction, P\\focessin\\b, Lan\\b\\ta\\be Unive\\fsals and Competence","paragraphs":["The nωttiωtns ωtf ruω+es, cωtnstraints, functiωtn, prωtcessing, ω+anguage universaω+s, and cωtmpetence wiω+ω+ be revisited here and iω+ω+uminated in mathematicaω+ ω+ight. They fωtrm the cωtre ωtf ω+anguage; sωt insights taken frωtm the brωtader architecture ωtf ω+anguage as specified abωtve can be appω+ied tωt what cωtnstitutes the cωtre ωtf ω+anguage. One may argue whether such new, if rudimentary, fωtrmaω+izatiωtns adequateω+y mωtdeω+ the nωttiωtns as given beω+ωtw. Hωtwever, ωtne has tωt start de nωtvωt if ωtne wants tωt expω+ωtre famiω+iar nωttiωtns with a view tωt ω+inking them tωt unfamiω+iar and unexpω+ωtred paths ωtf inquiry. At the end, such nωttiωtns wiω+ω+ be used tωt shωtw what it is that we uω+timateω+y unveiω+ thrωtugh the intercωtnnectiωtn ωtf such nωttiωtns as fωtrmaω+ized beω+ωtw. R\\tles: Ruω+es R= (R1,..., Rn) in ω+anguage wiω+ω+ be fωtrmaω+ized in the fωtrm beω+ωtw-R ="]},{"title":"∫","paragraphs":["υ (Pi (α1. α2. α3, ... ,αn), Pj (α1. α2. α3, ... ,αn)) f (Pi (α1. α2. α3, ... ,αn), t) d(Pi (α1. α2. α3, ... ,αn)) (11)","","Here υ denωttes a prωtbabiω+ity weight recursiveω+y assigned tωt Pi and Pj which are differentiaω+ prωtbabiω+ities having a cωtmpω+ementary distributiωtn with t denωtting a particuω+ar pωtint ωtf time. In additiωtn, υ aω+sωt determines hωtw strωtngω+y Pi and Pj may be cωtrreω+ated at time t. And f is a cωtntinuωtus prωtbabiω+ity functiωtn. Const\\faints: Cωtnstraints (Ci) ωtn ruω+es and its prωtcesses abωtund in the ω+iterature (Kayne, 1994; ωυωtrωt, 2000; Smωtω+ensky and Legendre, 2006). Such cωtnstraints ωtperate ωtn phωtnωtω+ωtgicaω+, semantic and ω+exicaω+-mωtrphωtω+ωtgicaω+ ruω+es and prωtcesses determining the pωtssibω+e mappings frωtm input vaω+ues ωtf underω+ying ω+inguistic fωtrms tωt the pωttentiaω+ vaω+ues ωtf surface ω+inguistic fωtrms ωtr representatiωtns. Sωt we get cωtnstraints ω+ike-  Ci = R"]},{"title":"∫","paragraphs":["υ ((Pi (α1. α2. α3, ... ,αm), Pj (α1. α2. α3, ... ,αm)) f (Pi (α1. α2. α3, ... ,αm), t) d(Pi (α1. α2. α3, ... ,αm)) (12) ωC 370 Here m < \\b frωtm (10), m might be any arbitrary number between 2 and \\b-1 (2 being the ω+ωtwest pωtssibω+e jωtint prωtbabiω+ity between the members ωtf the set ωtf vectωtrs in (2)). And sωt m actuaω+ω+y denωttes differentiaω+ interactive pωttentiaω+ities ωtf vectωtr cωtmpωtnents ωtf ω+anguage as they are deducted frωtm ruω+es. F\\tnction: Functiωtns have been defined and expω+ained in functiωtnaω+ theωtries in terms ωtf cωtmmunicative purpωtse ωtf ω+anguage use (Givón, 1995; Hengeveω+d and ωυackenzie, 2006). Functiωtn is a statisticaω+ prωtbabiω+ity. Sωt, fωtr exampω+e, sωtmebωtdy utters ‘a man’ and stωtps, we cannωtt determine whether this NP is the subject ωtr the ωtbject, this becωtmes the subject/ωtbject as the next wωtrd is prωtcessed; it becωtmes the subject in ‘a man cωtmes ...’, but becωtmes an ωtbject in ‘a man I knωtw...’. Sωt in the same way, if we say ‘Cω+ub..’ and stωtp, the functiωtn predicate cannωtt be determined frωtm this. As we gωt ωtn and cωtntinue with ‘Cω+ub them tωtgether...’, it becωtmes the predicate; ωttherwise in ‘Cω+ub is a sωtciaω+ gathering...’ it is the subject, nωtt predicate. Let us fωtrmaω+ize it in terms ωtf cωtnditiωtnaω+ prωtbabiω+ity- ωC","ωC P(αi/ αj) = P(αi ∩ αj) (13) ωC P (αj)  αj can be either syntactic categωtry ωtr phωtnωtω+ωtgicaω+ structure ωtr even semantic structure in a vectωtr. Taking aω+ω+ such pωttentiaω+ities, we get fu\\b\\ftio\\bal pote\\btiality Fp. Sωt it can be represented in the fωtrm ωtf tωttaω+ prωtbabiω+ity as– ","Fp = P (α1). P (Fp /α1) + P (α2). P (Fp /α2) + P (α3). P (Fp /α3) +, ... , + P (αn). P (Fp /αn) ωC (14)  P\\focessin\\b: Nωtw the aspect ωtf cωtgnitive prωtcessing ωtf ω+anguage as emerging ωtut ωtf the cωtgnitive architecture ωtf ω+anguage in Figure 2. can have the fωtω+ω+ωtwing mathematicaω+ representatiωtn-  ωC ∂ 1","Cd . ∂ 2","Cd . ∂ 3","Cd . , ..., . ∂ i","Cd = f (","1","Cd.2 Cd.3","Cd ., ...,. i","Cd) ωC (15) ωC ∂t ∂t ∂t ∂t ωC ωC ωC Here","i","Cd denωttes a cωtgnitive dωtmain ω+ike ω+anguage ωtr visiωtn etc. as described in Figure 2. and i ≤ 8, since we have eight cωtgnitive dωtmains intercωtnnected tωt each ωtther in Figure 2. Lan\\b\\ta\\be Unive\\fsals: Language universaω+s (UL) as specified in Cωtmrie (1981), Crωtft (1990) can aω+sωt be mathematicaω+ω+y expressed in the fωtω+ω+ωtwing fashiωtn-  ωC UL = f (FL. LP, ∆λ) ωC (16)  FL denωttes ω+anguage functiωtn, LP ω+anguage prωtcessing and ∆λ a vectωtr fieω+d characterizing chance variatiωtn. This meshes fairω+y weω+ω+ with Kirby (1999). Competence: At ω+ast Chωtmskyan I-ω+anguage ωtr cωtmpetence (CL) can be characterized as a state ωtf prωtcessing in neurωtcωtgnitive system at a pωtint ωtf time. It wiω+ω+ be in the fωtrm ωtf a tripω+e ωtf variabω+e prωtcessing state (∆ψ), a pωtint ωtf time (t) and a prωtbabiω+ity density functiωtn (ρ).  ωC CL= (∆ψ, t, ρ) ωC (17)  Where ∆ψ = f( (ψ, t-1), (ψ, t-2), (ψ, t-3), ... ,(ψ, t-m), (ψ, t +1), (ψ, t +2), (ψ, t +3),..., (ψ, t + (n-1)), (ψ, t + n)), when m < n.","ωC ωC ωC (18)  What this suggests is that cωtmpetence is nωtt ωtnω+y dependent ωtn previωtus prωtcessing states ωtf the neurωtcωtgnitive system, but aω+sωt ωtn thωtse cωtming ω+ater tωt be expected. This may seem tωt be cωtunterintuitive ωtn the face ωtf it; but a ω+ittω+e mωtre thinking wiω+ω+ shωtw that what we understand as 371 cωtmpetence is a bit eω+ementary. Cωtntrωtversies abωtund in the ω+iterature. Cωtmpetence is a functiωtn ωtf what the cωtgnitive agent did, dωtes and can pωtssibω+y dωt. Such characterizatiωtn is quite cωtnsistent with the dynamicaω+ view ωtf cωtgnitiωtn as weω+ω+ (Spivey, 2007)."]},{"title":"4.2 Eme\\f\\bent Comp\\ttational Syne\\f\\by, Nat\\t\\fal Lan\\b\\ta\\be P\\focessin\\b and A\\ftificial Intelli\\bence","paragraphs":["Ruω+es, cωtnstraints, functiωtn, prωtcessing, ω+anguage universaω+s, and cωtmpetence as specified abωtve fωtrm what may be caω+ω+ed emer\\te\\bt \\fomputatio\\bal sy\\ber\\ty which characterizes seω+f- ωtrganizing cωtgnitive ω+anguage prωtcessing, it is emergent in that aω+ω+ these cωtmpωtnents interact with each ωtther in a cωtmpω+ex seω+f-ωtrganizing dynamics which can never be reduced tωt any ωtf them; it is cωtmputatiωtnaω+ in that it can be characterized by Kωtω+ωtmωtgrωtv cωtmpω+exity and it is a synergy in that the emergent pattern grωtws ωtut ωtf dynamic, perhaps nωtnω+inear, cωtupω+ing amωtng them. Aω+ω+ these nωttiωtns are inherentω+y interwωtven with ωtne anωtther. Cωtnstraints as we knωtw them are defined and ωtperate ωtn ruω+es; functiωtn and prωtcessing principω+es are aω+sωt frωtzen and embedded in ruω+es; functiωtn and prωtcessing are factωtrs in the cωtnstitutiωtn ωtf ω+anguage universaω+s and at ω+ast, cωtmpetence is a functiωtn ωtf ruω+es, cωtnstraints, ω+anguage universaω+s and prωtcessing. Let’s see why the nωttiωtn ωtf emer\\te\\bt \\fomputatio\\bal sy\\ber\\ty as emerging frωtm the interwωtven matrix ωtf ruω+es, cωtnstraints, functiωtn, prωtcessing, ω+anguage universaω+s, and cωtmpetence is impωtrtant here. They reveaω+ sωtme deeper patterns abωtut ω+anguage prωtcessing whether in humans ωtr machines. Let’s see hωtw. Tωtωtω+s ω+ike parser, ω+anguage generatωtr, ω+anguage understanding system, mωtrphωtω+ωtgicaω+ anaω+yzer, tωtkenizer, stemmer etc. as are used in naturaω+ ω+anguage prωtcessing tasks acrωtss a range ωtf pω+atfωtrms are themseω+ves prωtducts ωtf this emergent cωtmputatiωtnaω+ synergy, as they are deveω+ωtped thrωtugh human effωtrts. But they can never repω+icate ωtr simuω+ate this emergent cωtmputatiωtnaω+ synergy; since if hypωttheticaω+ω+y any ωtf them can at aω+ω+, the simuω+ated/repω+icated synergy has tωt be abω+e tωt prωtduce anωtther tωtωtω+/ tωtωtω+s just ω+ike itseω+f and that prωtduct has tωt prωtduce yet anωtther and sωt ωtn ad infinitum- an infinite regress. This is ω+ωtgicaω+ω+y impωtssibω+e. Sωt what ωtur advanced naturaω+ ω+anguage prωtcessing tωtωtω+s can achieve is ωtnω+y a fragment ωtf what this emergent cωtmputatiωtnaω+ synergy is suppωtsed tωt prωtduce thrωtugh individuaω+ ωtr cωtω+ω+ective effωtrts. It is nωtt just a cωtnstraint ωtn naturaω+ ω+anguage prωtcessing tωtωtω+s; rather, it is a cωtnstraint ωtn machines in generaω+ which wiω+ω+ be the prωtducts ωtr gifts ωtf artificiaω+ inteω+ω+igence."]},{"title":"5 Concl\\tsion","paragraphs":["This is just a preω+iminary sketch ωtf what naturaω+ ω+anguage prωtcessing can ωtffer fωtr artificiaω+ inteω+ω+igence given that ωtur neurωtcωtgnitive machinery impωtses cωtnstraints ωtn naturaω+ ω+anguage prωtcessing tωtωtω+s which are just prωtducts ωtf this machinery. They cωtme naturaω+ω+y ωtut ωtf the mathematicaω+ framewωtrk sketched ωtut here. What naturaω+ ω+anguage prωtcessing tωtωtω+s can dωt is autωtmatizatiωtn ωtf a few seemingω+y human tasks in the barest depth, but perhaps nωtthing beyωtnd that. The impωtrtant thing is that such cωtnstraints have been cωtuched in a preω+iminary mathematicaω+ framewωtrk described and deω+ineated here. Further greater and richer insights intωt the fundamentaω+ nature ωtf ω+anguage prωtcessing can perhaps be extracted frωtm the framewωtrk; this wiω+ω+ be the gωtaω+ ωtf future research."]},{"title":"Refe\\fences","paragraphs":["Aω+tman, G. T. ωυ. 1995. Computatio\\bal Models of Spee\\fh Pro\\fessi\\b\\t. Cambridge, ωυass.: ωυIT Press. Bartωtn, E., R. Berwick, and E. V. Ristad. 1987. Computatio\\bal Complexity a\\bd Natural La\\b\\tua\\te. Cambridge, ωυass.: ωυIT Press. Berwick, R. 1985. The A\\fquisitio\\b of Sy\\bta\\fti\\f K\\bowled\\te. Cambridge, ωυass.: ωυIT Press. Bresnan, J. 1982. The Me\\btal Represe\\btatio\\b of Grammati\\fal Relatio\\bs. Cambridge, ωυass.: ωυIT Press. 372 Bresnan, J. 2001. Lexi\\fal-Fu\\b\\ftio\\bal Sy\\btax. Oxfωtrd: Bω+ackweω+ω+. Brωtwn, C. ωυ. 2001. The Neuro\\fo\\t\\bitio\\b of La\\b\\tua\\te. Oxfωtrd: Oxfωtrd University Press. Chωtmsky, N. 1995. The Mi\\bimalist Pro\\tram. Cambridge, ωυass.: ωυIT Press. Chωtmsky, N. 2000. ωυinimaω+ist Inquiries: The Framewωtrk. In R. ωυartin, D. ωυichaeω+s, and J. Uriagereka, eds., Step by Step: Essays o\\b Mi\\bimalist Sy\\btax i\\b Ho\\bor of Howard Las\\bik, pp. 89- 155. Cambridge, ωυass.: ωυIT Press. Cωtmrie, B. 1981. La\\b\\tua\\te U\\biversals a\\bd Li\\b\\tuisti\\f Typolo\\ty. Lωtndωtn: Bω+ackweω+ω+. Crωtft, W. 1990. Typolo\\ty a\\bd U\\biversals. Cambridge: Cambridge University Press. Davidsωtn, ωυ. C., D. Amsωt, L. C. Andersωtn, and A. Diamωtnd. 2006. Deveω+ωtpment ωtf Cωtgnitive Cωtntrωtω+ and Executive Functiωtns frωtm 4-13 Years: Evidence frωtm ωυanipuω+atiωtns ωtf ωυemωtry, Inhibitiωtn, and Task Switching. Neuropsy\\fholo\\tia, vωtω+. 44, pp. 2037 – 2078. Diamωtnd, A., L. Briand, J. Fωtsseω+ω+a, and L. Gehω+bach. 2004. Genetic and Neurωtchemicaω+ ωυωtduω+atiωtn ωtf Prefrωtntaω+ Cωtgnitive Functiωtns in Chiω+dren. Ameri\\fa\\b Jour\\bal of Psy\\fhiatry, vωtω+. 161, pp. 125-132. Dωtwning, P., A. W. Chan, ωυ. Peeω+en, C. Dωtdds, and N. Kanwisher. 2005. Dωtmain Specificity in Visuaω+ Cωtrtex. Cerebral Cortex, vωtω+. 15, pp. 12. Dunbar, R. I. ωυ. 2007. Brain and Cωtgnitiωtn in Evωtω+utiωtnary Perspective. In S. Pω+atek, J. P. Keenan and T. K. Shackeω+fωtrd, eds., Evolutio\\bary Co\\t\\bitive Neuros\\fie\\b\\fe. Cambridge, ωυass.: ωυIT Press. Faucωtnnier, G. 1985. Me\\btal Spa\\fes: Aspe\\fts of Mea\\bi\\b\\t Co\\bstru\\ftio\\b i\\b Natural La\\b\\tua\\te. Cambridge, ωυass.: ωυIT Press. Faucωtnnier, G. 1997. Mappi\\b\\ts i\\b Thou\\tht a\\bd La\\b\\tua\\te. New Yωtrk: Cambridge University Press. Faucωtnnier, G. and ωυ. Turner. 2002. The Way We Thi\\bk: Co\\b\\feptual Ble\\bdi\\b\\t a\\bd the Mi\\bd's Hidde\\b Complexities. New Yωtrk: Basic Bωtωtks. Givón, T. 1995. Fu\\b\\ftio\\balism a\\bd Grammar. Amsterdam: Jωthn Benjamins. Gωtbet, F. 2005. ωυωtduω+arity and Chunking. In W. Caω+ω+ebaut and D. Rasskin-Gutman. eds., Modularity: U\\bdersta\\bdi\\b\\t the Developme\\bt a\\bd Evolutio\\b of Natural Complex Systems. Cambridge, ωυass.: ωυIT Press. Gωtttω+ieb, G. 2002. Fωtrm Gene tωt Organism: The Deveω+ωtping Individuaω+ as an Emergent, Interactiωtnaω+, Hierarchicaω+ System. In ωυ. Jωthnsωtn, Y. ωυunakata and R. O. Giω+mωtre, eds., Brai\\b Developme\\bt a\\bd Co\\t\\bitio\\b. Lωtndωtn: Bω+ackweω+ω+. Grωtdzinsky, Y., L. Shapirωt and D. Swinney, eds. 2000. La\\b\\tua\\te a\\bd the Brai\\b: Represe\\btatio\\b a\\bd Pro\\fessi\\b\\t. San Diegωt: Academic Press. Hagωtωtrt, P. 2003. Hωtw the Brain Sωtω+ves the Binding Prωtbω+em fωtr Language: A Neurωtcωtmputatiωtnaω+ ωυωtdeω+ ωtf Syntactic Prωtcessing. Neuroima\\te, vωtω+. 20 (1), pp. S18-S19. Hausser, R. R. 2001. Fou\\bdatio\\bs of Computatio\\bal Li\\b\\tuisti\\fs. Amsterdam: Springer, 2001. Hengeveω+d, K. J., Rijkhωtff and A. Siewierska. 2004. Parts ωtf Speech Systems and Wωtrd Order. Jour\\bal of Li\\b\\tuisti\\fs, vωtω+. 40(3): pp. 527-570. Hengeveω+d, K. and J. L. ωυackenzie. 2006. Functiωtnaω+ Discωturse Grammar. In K. Brωtwn, ed., E\\b\\fy\\flopedia of La\\b\\tua\\te a\\bd Li\\b\\tuisti\\fs. Vol IV. Oxfωtrd: Eω+sevier. Heschω+, A. 2002. The I\\btelli\\te\\bt Ge\\bome. Amsterdam: Springer. Hymes, D. 1972. On Cωtmmunicative Cωtmpetence. In J. B. Pride, and J. Hωtω+mes, eds., So\\fioli\\b\\tuisti\\fs. Harmωtndswωtrth, ωυiddω+esex: Penguin. Jackendωtff, R. 2002. Fou\\bdatio\\bs of La\\b\\tua\\te. Oxfωtrd: Oxfωtrd University Press. Jackendωtff, R. 2007. La\\b\\tua\\te, Co\\bs\\fious\\bess, Culture. Cambridge, ωυass.: ωυIT Press. Jωthnsωtn, ωυ. H., R. Griffin, G. Csibra, H. Haω+it, T. Farrωtni, ωυ. De Haan, L. A. Tucker, S. Barωtn-Cωthen and J. Richards. 2005. The Emergence ωtf the Sωtciaω+ Brain Netwωtrk: Evidence frωtm Typicaω+ and Atypicaω+ Brain Deveω+ωtpment. Developme\\bt a\\bd Psy\\fhopatholo\\ty, vωtω+. 17, pp. 599–619. Jωthnsωtn, ωυ. H. 2001. Functiωtnaω+ Brain Deveω+ωtpment in Humans. Nature Reviews Neuros\\fie\\b\\fe, vωtω+. 2, pp. 475-483. 373 Jωthnsωtn, ωυ. H. and A. Karmiω+ωtff-Smith. 2003. Neurωtscience Perspectives ωtn Infant Deveω+ωtpment. In G. Brenmer, and A. Sω+ater, eds., Theories of I\\bfa\\bt Developme\\bt. Oxfωtrd: Bω+ackweω+ω+. Karmiω+ωtff-Smith, A. 1992. Beyo\\bd Modularity: A Developme\\btal Perspe\\ftive o\\b Co\\t\\bitive S\\fie\\b\\fe. Cambridge, ωυass.: ωυIT Press. Kayne, R. 1994. The A\\btisymmetry of Sy\\btax. Cambridge, ωυass.: ωυIT Press. Kinzω+er, K. D., E. Dupωtux, and E. Speω+ke. 2007. The Native Language ωtf Sωtciaω+ Cωtgnitiωtn. Pro\\feedi\\b\\ts of the Natio\\bal A\\fademy of S\\fie\\b\\fes, vωtω+. 104(30), pp. 12577-12580. Kirby, S. 1999. Fu\\b\\ftio\\b, Sele\\ftio\\b a\\bd I\\b\\bate\\bess. Oxfωtrd: Oxfωtrd University Press. Kracht, ωυ. 2003. The Mathemati\\fs of La\\b\\tua\\te. Berω+in: ωυωtutωtn de Gruyter. Lakωtff, G. 1987. Wome\\b, Fire, a\\bd Da\\b\\terous Thi\\b\\ts: What Cate\\tories Tell us about the Mi\\bd. Chicagωt: University ωtf Chicagωt Press. Langacker, R. 1987. Fou\\bdatio\\bs of Co\\t\\bitive Grammar. 2 vols. Stanfωtrd, Caω+if.: Stanfωtrd University Press. Leveω+t, W. J. ωυ. 1989. Speaki\\b\\t: From I\\bte\\btio\\b to Arti\\fulatio\\b. Cambridge, ωυass.: ωυIT Press. Lieberman, P. 2006. Toward a\\b Evolutio\\bary Biolo\\ty of La\\b\\tua\\te. Cambridge: ωυass.: Harvard University Press. ωυanaster-Ramer, A. 1987. Mathemati\\fs of La\\b\\tua\\te. Amsterdam: Jωthn Benjamins. ωυarr, D. 1982. Visio\\b: A Computatio\\bal I\\bvesti\\tatio\\b i\\bto the Huma\\b Represe\\btatio\\b a\\bd Pro\\fessi\\b\\t of Visual I\\bformatio\\b. San Franciscωt: W. H. Freeman. ωυascaró, J. 2007. Externaω+ Aω+ω+ωtmωtrphy and Lexicaω+ Representatiωtn. Li\\b\\tuisti\\f I\\bquiry, vωtω+. 38, pp. 715-735. ωυωtndaω+, P. 2009. Hωtw Limited is the Limit? Tωt appear in Pro\\feedi\\b\\ts of I\\bter\\batio\\bal Co\\bfere\\b\\fe o\\b Re\\fe\\bt Adva\\b\\fes i\\b Natural La\\b\\tua\\te Pro\\fessi\\b\\t. ωυωtrωt, A. 2000. Dy\\bami\\f A\\btisymmetry. Cambridge, ωυass.: ωυIT Press. Neeω+eman, A. and P. Ackema. 2004. Beyo\\bd Morpholo\\ty; I\\bterfa\\fe Co\\bditio\\bs o\\b Word Formatio\\b. Oxfωtrd: Oxfωtrd University Press. Neviω+ω+e, H. J. and D. Baveω+ier. 1998. Neuraω+ Organizatiωtn and Pω+asticity ωtf Language. Curre\\bt Opi\\bio\\b i\\b Neurobiolo\\ty, vωtω+. 8: pp. 254-258. Oω+sωtn, I. R., A. Pω+ωttzker, and Y. Ezzyat. 2007. The Enigmatic Tempωtraω+ Pωtω+e: A Review ωtf Findings ωtn Sωtciaω+ and Emωttiωtnaω+ Prωtcessing. Brai\\b, vωtω+. 130, pp. 1718 -1731. Paradis, ωυ. 2004. A Neuroli\\b\\tuisti\\f Theory of Bili\\b\\tualism. Amsterdam: Jωthn Benjamins. Pωteppeω+, D. 2004. Tωtwards a New Functiωtnaω+ Anatωtmy ωtf Language. Co\\t\\bitio\\b, vωtω+. 92, pp. 1– 12. Pωtω+ω+ard, C. and I. Sag. 1994. Head-Drive\\b Phrase Stru\\fture Grammar. Chicagωt: Chicagωt University Press. Puω+vermüω+ω+er, F. 2002. The Neuros\\fie\\b\\fe of La\\b\\tua\\te. Cambridge: Cambridge University Press. Rωtark, B. and R. Sprωtat. 2007. Computatio\\bal Approa\\fhes to Sy\\btax a\\bd Morpholo\\ty. Oxfωtrd: Oxfωtrd University Press. Rωteper, T. 2007. The Prism of Grammar. Cambridge, ωυass.: ωυIT Press. Shanahan, D. 2007. La\\b\\tua\\te, Feeli\\b\\t a\\bd the Brai\\b: The Evo\\fative Ve\\ftor. New Brunswick: Transactiωtn. Smωtω+ensky, P. and G. Legendre. 2006. The Harmo\\bi\\f Mi\\bd. Vol 1. Cambridge, ωυass.: ωυIT Press. Spivey, ωυ. 2007. The Co\\bti\\buity of Mi\\bd. New Yωtrk: Oxfωtrd University Press. Stiω+es, J. 2000. Neuraω+ Pω+asticity and Cωtgnitive Deveω+ωtpment. Developme\\btal Neuropsy\\fholo\\ty, vωtω+. 18 (2), pp. 237-272. ωC 374"]}]}