{"sections":[{"title":"Query-F\\b\\tused\\fMulti-D\\b\\tument\\fSummarizati\\bn\\fUsing\\f\\f C\\b-Training\\fBased\\fSemi-Supervised\\fLearning\\f∗∗∗∗\\f \\f \\f","paragraphs":["Po Hua,b",", Do\\b\\tho\\b\\t J\\fa , Ha\\f Wa\\b\\tc , a\\bd Cho\\b\\t Te\\b\\ta  a 129 Luoyu Road, Computer School, Wuha\\b U\\b\\fvers\\fty,","Wuha\\b 430079, Ch\\f\\ba","phu@ma\\fl.cc\\bu.edu.c\\b, do\\b\\tho\\b\\t_j\\f2000@yahoo.com.c\\b, tcho\\b\\t616@126.com b 152 Luoyu Road, Departme\\bt of Computer Sc\\fe\\bce, Huazho\\b\\t Normal U\\b\\fvers\\fty,","Wuha\\b 430079, Ch\\f\\ba c","463 Gua\\bsha\\b Road, School of Electro\\b\\fcs a\\bd I\\bformat\\fo\\b, Wuha\\b Polytech\\b\\fc, Wuha\\b 430074, Ch\\f\\ba whseak\\f\\b\\t@163.com Abstra\\tt. Th\\fs paper prese\\bts a \\bovel approach to query-focused mult\\f-docume\\bt summar\\fzat\\fo\\b. As a \\tood b\\fased summary \\fs expected to keep a bala\\bce amo\\b\\t query releva\\bce, co\\bte\\bt sal\\fe\\bce a\\bd \\f\\bformat\\fo\\b d\\fvers\\fty, the approach f\\frst makes use of both the co\\bte\\bt feature a\\bd the relat\\fo\\bsh\\fp feature to select a \\bumber of se\\bte\\bces v\\fa the cotra\\f\\b\\f\\b\\t based sem\\f-superv\\fsed lear\\b\\f\\b\\t, wh\\fch ca\\b \\fde\\bt\\ffy the query releva\\bt se\\bte\\bces beyo\\bd a s\\f\\b\\tle po\\f\\bt of v\\few. The\\b the ra\\bk\\f\\b\\t al\\tor\\fthm based o\\b Markov cha\\f\\b ra\\bdom walks \\fs employed o\\b the releva\\bt se\\bte\\bces by e\\bcoura\\t\\f\\b\\t co\\bte\\bt sal\\fe\\bce a\\bd \\f\\bformat\\fo\\b d\\fvers\\fty \\f\\b a u\\b\\ff\\fed framework. The f\\f\\bal summary focus\\f\\b\\t o\\b the \\f\\bte\\trat\\fo\\b of releva\\bce, sal\\fe\\bce a\\bd d\\fvers\\fty \\fs created after several se\\bte\\bces w\\fth the h\\f\\thest overall ra\\bk\\f\\b\\t scores are extracted. We performed exper\\fme\\bts o\\b DUC2007 dataset a\\bd the evaluat\\fo\\b results show that the proposed approach ca\\b ach\\feve s\\f\\t\\b\\ff\\fca\\bt \\fmproveme\\bt over sta\\bdard basel\\f\\be approaches a\\bd \\ta\\f\\b comparable performa\\bce to the state-of-the-art systems. Keyw\\brds:\\fmult\\f-docume\\bt summar\\fzat\\fo\\b, co-tra\\f\\b\\f\\b\\t based sem\\f-superv\\fsed lear\\b\\f\\b\\t, \\traph based se\\bte\\bce ra\\bk\\f\\b\\t","\\a \\a ∗ The work reported \\f\\b th\\fs paper was supported by the Major Research Pla\\b of Nat\\fo\\bal Natural Sc\\fe\\bce Fou\\bdat\\fo\\b of Ch\\f\\ba (90820005, 90920005), Nat\\fo\\bal Natural Sc\\fe\\bce Fou\\bdat\\fo\\b of Ch\\f\\ba (60773011, 60773167) a\\bd Wuha\\b U\\b\\fvers\\fty 985 Project (985yk004).  Copyr\\f\\tht 2009 by Po Hu, Do\\b\\tho\\b\\t J\\f, Ha\\f Wa\\b\\t, a\\bd Cho\\b\\t Te\\b\\t"]},{"title":"1 Intr\\bdu\\tti\\bn\\f","paragraphs":["Query-focused mult\\f-docume\\bt summar\\fzat\\fo\\b has attracted much atte\\bt\\fo\\b \\f\\b rece\\bt years. D\\fffere\\bt from \\te\\ber\\fc summar\\fzat\\fo\\b, \\ft a\\fms to prov\\fde more perso\\bal\\fzed \\f\\bformat\\fo\\b for a \\t\\fve\\b query. By automat\\fcally captur\\f\\b\\t releva\\bt a\\bd sal\\fe\\bt co\\bte\\bt from a lar\\te amou\\bt of search\\f\\b\\t results a\\bd show\\f\\b\\t them \\f\\b a co\\bc\\fse way, the sort of summar\\fzat\\fo\\b ca\\b a\\fd people to qu\\fckly access a\\bd d\\f\\test the\\fr \\f\\bterested \\f\\bformat\\fo\\b. It also prov\\fdes a\\b effect\\fve mea\\bs to d\\fverse appl\\fcat\\fo\\bs such as quest\\fo\\b a\\bswer\\f\\b\\t system, perso\\bal\\fzed \\f\\bformat\\fo\\b retr\\feval, perso\\bal\\fzed \\bews recomme\\bder, etc. To date, the most \\f\\bflue\\bt\\fal a\\b\\bual evaluat\\fo\\b workshop for automat\\fc summar\\fzat\\fo\\b research \\fs the Docume\\bt U\\bdersta\\bd\\f\\b\\t Co\\bfere\\bce (DUC or \\bow TAC), wh\\fch prov\\fdes a lar\\te-scale test be\\bchmark as well as commo\\b evaluat\\fo\\b procedures for researchers to share the\\fr \\fdeas a\\bd exper\\fe\\bces. 190 23rd Pacific Asia Conference on Language, Information and Computation, pages 190–199 ","The cr\\ft\\fcal \\fssues \\f\\b query-focused mult\\f-docume\\bt summar\\fzat\\fo\\b are as follows: The f\\frst o\\be \\fs that the \\f\\bformat\\fo\\b co\\bta\\f\\bed \\f\\b the \\te\\berated summary should be h\\f\\thly related to the \\t\\fve\\b query. The seco\\bd \\fssue \\fs how to take sal\\fe\\bce a\\bd d\\fvers\\fty \\f\\bto accou\\bt whe\\b select\\f\\b\\t a batch of se\\bte\\bces or other textual u\\b\\fts as represe\\btat\\fves for a summary. As the allowed capac\\fty \\f\\b a summary \\fs usually l\\fm\\fted, \\ft w\\fll be \\f\\bappropr\\fate to put all the \\f\\bformat\\fve se\\bte\\bces from d\\fffere\\bt docume\\bts \\f\\bto the summary for they may co\\bvey the s\\fm\\flar mea\\b\\f\\b\\ts. The \\f\\btu\\ft\\fo\\b beh\\f\\bd a \\tood query-focused summary \\fs to preserve the \\f\\bformat\\fo\\b b\\fased to the query as much as poss\\fble, a\\bd rema\\f\\b the most represe\\btat\\fve a\\bd sal\\fe\\bt \\f\\bformat\\fo\\b that have the least dupl\\fcate co\\bte\\bts to the \\f\\bformat\\fo\\b selected prev\\fously.","I\\b th\\fs study, we propose a \\bovel se\\bte\\bce-based extract\\fve approach. S\\f\\bce \\ft \\fs \\bot e\\bou\\th to select releva\\bt se\\bte\\bces from a s\\f\\b\\tle po\\f\\bt of v\\few a\\bd \\bo labeled releva\\bt or \\frreleva\\bt se\\bte\\bces are ava\\flable \\f\\b adva\\bce, the proposed approach f\\frst makes full use of the co-tra\\f\\b\\f\\b\\t al\\tor\\fthm to \\fde\\bt\\ffy the releva\\bt se\\bte\\bces o\\b two abu\\bda\\bt feature v\\fews w\\fth a small \\bumber of pseudo-labeled se\\bte\\bces. The\\b \\ft employs a ra\\bk\\f\\b\\t al\\tor\\fthm to sort the releva\\bt se\\bte\\bces a\\bd choose a certa\\f\\b \\bumber of represe\\btat\\fves w\\fth h\\f\\thest co\\bte\\bt sal\\fe\\bce a\\bd \\f\\bformat\\fo\\b d\\fvers\\fty for the f\\f\\bal summary. Exper\\fme\\btal results o\\b DUC2007 ma\\f\\b task dataset show that the proposed approach s\\f\\t\\b\\ff\\fca\\btly outperforms the basel\\f\\be approaches a\\bd ach\\feves comparable performa\\bce to the state-of-the-art systems.","The rema\\f\\bder of the paper \\fs or\\ta\\b\\fzed as follows. Sect\\fo\\b 2 d\\fscusses related work. The proposed summar\\fzat\\fo\\b approach \\fs descr\\fbed \\f\\b Sect\\fo\\b 3. The deta\\fls of the exper\\fme\\btat\\fo\\b are show\\b \\f\\b Sect\\fo\\b 4. Sect\\fo\\b 5 prese\\bts our co\\bclus\\fo\\b a\\bd future work."]},{"title":"2 Related\\fW\\brk\\f","paragraphs":["Most of mult\\f-docume\\bt summar\\fzat\\fo\\b methods ca\\b be cate\\tor\\fzed \\f\\bto two ma\\f\\b parad\\f\\tms, \\f.e. extract\\fve a\\bd abstract\\fve summar\\fzat\\fo\\b. Extract\\fve summar\\fzat\\fo\\b ofte\\b d\\frectly extracts \\fmporta\\bt se\\bte\\bces \\f\\b superv\\fsed, u\\bsuperv\\fsed or sem\\f-superv\\fsed way based o\\b the comb\\f\\bat\\fo\\b of a few \\fmpl\\fc\\ft or expl\\fc\\ft features (Goldste\\f\\b et al., 2000; Radev et al., 2004), wh\\fle abstract\\fve summar\\fzat\\fo\\b usually makes use of deep \\batural la\\b\\tua\\te u\\bdersta\\bd\\f\\b\\t or \\te\\berat\\fo\\b tech\\bolo\\ty to fuse or reformulate \\f\\bformat\\fo\\b (K\\b\\f\\tht a\\bd Marcu, 2000). I\\b th\\fs paper, we focus o\\b extract\\fve summar\\fzat\\fo\\b approach.","Compared to s\\f\\b\\tle-docume\\bt summar\\fzat\\fo\\b, \\ft \\fs more l\\fkely for mult\\f-docume\\bt summar\\fzat\\fo\\b to have repet\\ft\\fve co\\bte\\bts a\\bd d\\fverse subtop\\fcs across docume\\bts, so max\\fm\\fz\\f\\b\\t co\\bte\\bt sal\\fe\\bce a\\bd m\\f\\b\\fm\\fz\\f\\b\\t co\\bte\\bt redu\\bda\\bcy has bee\\b reco\\t\\b\\fzed as o\\be of the major d\\fff\\fcult\\fes. Ma\\by methods have bee\\b proposed to ach\\feve th\\fs \\toal. Max\\fmum mar\\t\\f\\bal releva\\bce (MMR) (Carbo\\bell a\\bd Goldste\\f\\b, 1998), GRASSHOPPER ra\\bk\\f\\b\\t (Zhu et al., 2007), d\\fvers\\fty pe\\balty (Zha\\b\\t et al., 2005) a\\bd m\\fxture models (Zha\\b\\t et al., 2002) are commo\\bly used approaches \\f\\bcorporat\\f\\b\\t \\f\\bformat\\fo\\b sal\\fe\\bce a\\bd d\\fvers\\fty \\f\\bto the ra\\bk\\f\\b\\t process. Amo\\b\\t these approaches, GRASSHOPPER ra\\bk\\f\\b\\t tr\\fes to e\\bcoura\\te the bala\\bce of sal\\fe\\bce a\\bd d\\fvers\\fty \\f\\b a u\\b\\ff\\fed framework, wh\\fle other approaches deal w\\fth them separately.","I\\bsp\\fred by Pa\\teRa\\bk a\\bd HITS al\\tor\\fthm, much focus has bee\\b put o\\b adopt\\f\\b\\t \\traph-based ra\\bk\\f\\b\\t al\\tor\\fthm l\\fke LexRa\\bk (Erka\\b a\\bd Radev, 2004) a\\bd TextRa\\bk (M\\fhalcea a\\bd Tarau, 2004) to mult\\f-docume\\bt summar\\fzat\\fo\\b. These al\\tor\\fthms \\te\\berally employ the \\tlobal \\f\\bformat\\fo\\b descr\\fbed by a passa\\te aff\\f\\b\\fty \\traph a\\bd recurs\\fvely calculate each passa\\te’s s\\f\\t\\b\\ff\\fca\\bce based o\\b l\\f\\bk structure a\\balys\\fs, stab\\fl\\fty-based ra\\bdom walk, \\tlobal co\\bs\\fste\\bcy or smooth\\bess-based label propa\\tat\\fo\\b o\\b the \\traph. Top\\fc-se\\bs\\ft\\fve LexRa\\bk (Havel\\fwala, 2003) exte\\bded the trad\\ft\\fo\\bal LexRa\\bk al\\tor\\fthm by \\f\\bte\\trat\\f\\b\\t the s\\fm\\flar\\fty betwee\\b se\\bte\\bces a\\bd the \\t\\fve\\b query. Wa\\b et al. (2007) adopted a ma\\b\\ffold-ra\\bk\\f\\b\\t al\\tor\\fthm to ra\\bk se\\bte\\bces by co\\bs\\fder\\f\\b\\t \\tlobal \\f\\bformat\\fo\\b a\\bd emphas\\fz\\f\\b\\t the h\\f\\th b\\fased \\f\\bformat\\fo\\b r\\fch\\bess \\f\\b a score propa\\tat\\fo\\b process.","Rece\\btly co-tra\\f\\b\\f\\b\\t al\\tor\\fthm has bee\\b successfully used \\f\\b ma\\by \\batural la\\b\\tua\\te process\\f\\b\\t appl\\fcat\\fo\\bs (Muller et al., 2002; Sarkar, 2001). Wo\\b\\t et al. (2008) appl\\fed co-191 tra\\f\\b\\f\\b\\t al\\tor\\fthm to \\te\\ber\\fc mult\\f-docume\\bt summar\\fzat\\fo\\b, wh\\fch tra\\f\\bs two d\\fffere\\bt class\\ff\\fers o\\b the same feature space to evaluate the \\fmporta\\bce of a se\\bte\\bce a\\bd \\beeds a few ma\\bually labeled examples as tra\\f\\b\\f\\b\\t data. However, there \\fs l\\fttle research \\f\\b apply\\f\\b\\t cotra\\f\\b\\f\\b\\t based lear\\b\\f\\b\\t al\\tor\\fthm to query-focused mult\\f-docume\\bt summar\\fzat\\fo\\b espec\\fally whe\\b ma\\bually labeled \\f\\bformat\\fo\\b \\fs abse\\bt. I\\b our approach, the major po\\f\\bt of co\\bcer\\b \\fs how to employ the co-tra\\f\\b\\f\\b\\t al\\tor\\fthm to support better choos\\f\\b\\t query releva\\bt se\\bte\\bces from two d\\fffere\\bt but abu\\bda\\bt feature v\\fews, wh\\fch ca\\b \\f\\bcorporate mult\\f-d\\fme\\bs\\fo\\bal compleme\\btary \\f\\bformat\\fo\\b to class\\ffy each se\\bte\\bce by levera\\t\\f\\b\\t both the \\f\\bd\\fv\\fdual \\f\\bformat\\fo\\b \\f\\b each se\\bte\\bce a\\bd the relat\\fo\\bsh\\fp \\f\\bformat\\fo\\b amo\\b\\t se\\bte\\bces."]},{"title":"3 The\\fPr\\bp\\bsed\\fAppr\\ba\\th\\f\\f 3.1 Overview\\f","paragraphs":["I\\b order to \\te\\berate a b\\fased summary w\\fth \\tood character\\fst\\fcs of releva\\bce, sal\\fe\\bce a\\bd d\\fvers\\fty, we f\\frst \\f\\bvest\\f\\tate the effect\\fve\\bess of comb\\f\\b\\f\\b\\t two k\\f\\bds of d\\fffere\\bt features \\f\\b a sem\\f-superv\\fsed lear\\b\\f\\b\\t process to dec\\fde wh\\fch se\\bte\\bces are releva\\bt to the query. After that, a se\\bte\\bce ra\\bk\\f\\b\\t al\\tor\\fthm w\\fth the emphas\\fs o\\b sal\\fe\\bce a\\bd d\\fvers\\fty \\fs employed o\\b these releva\\bt se\\bte\\bces so as to e\\bsure the top-ra\\bked se\\bte\\bces such character\\fst\\fcs.","The proposed approach ma\\f\\bly co\\bs\\fsts of two steps. The f\\frst step \\fs to class\\ffy all the se\\bte\\bces \\f\\b a docume\\bt set u\\bder two v\\few sett\\f\\b\\ts a\\bd select a \\bumber of se\\bte\\bces closely related to the query v\\fa the co-tra\\f\\b\\f\\b\\t based lear\\b\\f\\b\\t al\\tor\\fthm (Blum a\\bd M\\ftchell, 1998). The seco\\bd step \\fs to ra\\bk all the selected se\\bte\\bces v\\fa the Markov cha\\f\\b ra\\bdom walks (Zhu et al., 2007) a\\bd take the top o\\bes to create the f\\f\\bal summary, wh\\fch takes \\f\\bto accou\\bt co\\bte\\bt sal\\fe\\bce a\\bd \\f\\bformat\\fo\\b d\\fvers\\fty \\f\\b a u\\b\\ff\\fed framework."]},{"title":"3.2 C\\b-training\\fBased\\fLearning\\ff\\br\\fthe\\fSele\\tti\\bn\\f\\bf\\fQuery\\fRelevant\\fSenten\\tes\\f\\f","paragraphs":["I\\b query-focused mult\\f-docume\\bt summar\\fzat\\fo\\b, a user usually poses a query reflect\\f\\b\\t h\\fs perso\\bal\\fzed requ\\freme\\bt a\\bd asks the summar\\fzer to a\\bswer the query \\f\\b a co\\bc\\fse way. So how to f\\f\\bd the releva\\bt se\\bte\\bces becomes the pr\\fmary problem. Sem\\f-superv\\fsed lear\\b\\f\\b\\t \\fs a \\batural approach for th\\fs problem where all the se\\bte\\bces \\f\\b a docume\\bt set are requ\\fred to be class\\ff\\fed \\f\\bto pos\\ft\\fve se\\bte\\bces (\\f.e. query releva\\bt se\\bte\\bces) a\\bd \\be\\tat\\fve se\\bte\\bces (\\f.e. query \\frreleva\\bt se\\bte\\bces), but o\\bly o\\be pos\\ft\\fve labeled se\\bte\\bce (\\f.e. the query) \\fs ava\\flable.","Co-tra\\f\\b\\f\\b\\t \\fs a class\\fc sem\\f-superv\\fsed lear\\b\\f\\b\\t al\\tor\\fthm that ca\\b take adva\\bta\\te of u\\blabeled data to boost lear\\b\\f\\b\\t performa\\bce. Trad\\ft\\fo\\bal co-tra\\f\\b\\f\\b\\t works u\\bder a two-v\\few sett\\f\\b\\t a\\bd assumes that each example should be descr\\fbed by two d\\fffere\\bt a\\bd co\\bd\\ft\\fo\\bally \\f\\bdepe\\bde\\bt feature sets. Rece\\bt research has demo\\bstrated that the stro\\b\\t assumpt\\fo\\b of \\f\\bdepe\\bde\\bce betwee\\b two v\\fews \\fs \\bot \\becessary. However co-tra\\f\\b\\f\\b\\t ca\\b \\bot be effect\\fvely performed whe\\b there \\fs o\\bly o\\be labeled example, so our approach tr\\fes to choose a small \\bumber of se\\bte\\bces as pseudo labeled se\\bte\\bces. For pseudo releva\\bt se\\bte\\bces, we determ\\f\\be a few se\\bte\\bces w\\fth the h\\f\\thest s\\fm\\flar\\fty to the query; for pseudo \\frreleva\\bt o\\bes, we p\\fck a few se\\bte\\bces w\\fth the lowest s\\fm\\flar\\fty to the query. I\\b th\\fs paper, we focus o\\b how to make use of two suff\\fc\\fe\\bt features \\f\\b the co-tra\\f\\b\\f\\b\\t process to class\\ffy the se\\bte\\bces a\\bd automat\\fcally \\f\\bfer the labels for the u\\blabeled se\\bte\\bces.","G\\fve\\b a set of se\\bte\\bces S={s0, s1,...,s\\b-1}. Here s0 de\\botes the \\t\\fve\\b query that ca\\b be treated as a pseudo-se\\bte\\bce, a\\bd the rest de\\botes all the se\\bte\\bces \\f\\b the docume\\bts to be summar\\fzed. Let X a\\bd Y de\\bote two d\\fffere\\bt se\\bte\\bce features \\f\\bvest\\f\\tated \\f\\b our approach. Here X represe\\bts co\\bte\\bt feature that uses co\\bte\\bt bear\\f\\b\\t terms to descr\\fbe a se\\bte\\bce, a\\bd Y \\fs relat\\fo\\bsh\\fp feature that represe\\bts a se\\bte\\bce by \\fts pa\\fr-w\\fse s\\fm\\flar\\fty w\\fth other se\\bte\\bces. We use matr\\fx [M\\fj]\\b*m to descr\\fbe the se\\bte\\bce set that \\fs formally represe\\bted o\\b feature X w\\fth each e\\btry M\\fj correspo\\bd\\f\\b\\t to the we\\f\\tht assoc\\fated w\\fth term tj \\f\\b se\\bte\\bce s\\f, wh\\fch \\fs calculated by the TF\\fj*ISF\\f formula, where \\b \\fs the total \\bumber of se\\bte\\bces \\f\\bclud\\f\\b\\t the 192  query, m \\fs the total \\bumber of terms \\f\\b the docume\\bts, TF\\fj de\\botes the freque\\bcy of term tj appear\\f\\b\\t \\f\\b se\\bte\\bce s\\f, a\\bd ISF\\f \\fs the \\f\\bverse se\\bte\\bce freque\\bcy of term tj, wh\\fch \\fs calculated by 1+lo\\t(\\b/\\bj), where \\bj \\fs the \\bumber of the se\\bte\\bces that co\\bta\\f\\b term tj. So each se\\bte\\bce ca\\b be represe\\bted by a\\b m-d\\fme\\bs\\fo\\bal term vector. We also use a\\bother matr\\fx [N\\fj]\\b*\\b to descr\\fbe the se\\bte\\bces o\\b feature Y w\\fth each e\\btry N\\fj correspo\\bd\\f\\b\\t to the s\\fm\\flar\\fty betwee\\b se\\bte\\bce s\\f a\\bd sj, wh\\fch ca\\b reflect the pa\\fr-w\\fse relat\\fo\\bsh\\fp. Here [N\\fj]\\b*\\b \\fs calculated by formula 1,  \\fj"]},{"title":") N = || || || || 1 )","paragraphs":["i j i j \\b \\b \\b \\b"]},{"title":"\\t \\t i j \\t \\t i j  • ( ≠ \\b\\t  \\− ( = uuv uuv uuv uuv ","paragraphs":["(1)  where"]},{"title":",","paragraphs":["i j\\b \\b"]},{"title":"\\t \\t uuv uuv","paragraphs":["are the correspo\\bd\\f\\b\\t term vectors for se\\bte\\bce s\\f a\\bd sj. Whe\\b a certa\\f\\b \\bumber of pseudo-labeled se\\bte\\bces are ava\\flable1",", the \\bext task \\fs to","class\\ffy the rest u\\blabeled se\\bte\\bces \\f\\bto pos\\ft\\fve a\\bd \\be\\tat\\fve o\\bes. Table 1 \\t\\fves the co-","tra\\f\\b\\f\\b\\t based lear\\b\\f\\b\\t al\\tor\\fthm for the select\\fo\\b of query releva\\bt se\\bte\\bces."," Table\\f1: The co-tra\\f\\b\\f\\b\\t based lear\\b\\f\\b\\t al\\tor\\fthm for the select\\fo\\b of query releva\\bt se\\bte\\bces. Input:\\f\\f Matr\\fx [M\\fj]\\b*m a\\bd [N\\fj]\\b*\\b , wh\\fch de\\bote all the se\\bte\\bces’ formal represe\\btat\\fo\\bs o\\b","co\\bte\\bt feature v\\few X a\\bd relat\\fo\\bsh\\fp feature v\\few Y respect\\fvely. L \\fs the set of pseudo-labeled releva\\bt a\\bd \\frreleva\\bt se\\bte\\bces. U \\fs the set of u\\blabeled se\\bte\\bces. Output: The pred\\fcted labels for all the u\\blabeled se\\bte\\bces \\f\\b the docume\\bts a\\bd a \\bumber of","selected query releva\\bt se\\bte\\bces w\\fth the pos\\ft\\fve label. Pr\\b\\tess:\\f 1. Establ\\fsh the mapp\\f\\b\\t betwee\\b the se\\bte\\bces \\f\\b L, U a\\bd the row vectors \\f\\b [M\\fj]\\b*m a\\bd","[N\\fj]\\b*\\b.\\f 2. Create a\\b u\\blabeled se\\bte\\bce pool U’ by select\\f\\b\\t u se\\bte\\bces from U at ra\\bdom. 3. Loop wh\\fle there are st\\fll some u\\blabeled se\\bte\\bces \\f\\b U","Use L to tra\\f\\b a class\\ff\\fer Cx o\\b [M\\fj]\\b*m.","Use L to Tra\\f\\b a class\\ff\\fer Cy o\\b [N\\fj]\\b*\\b.","Use Cx to label p pos\\ft\\fve a\\bd \\b \\be\\tat\\fve se\\bte\\bces w\\fth the h\\f\\thest class\\ffy\\f\\b\\t","co\\bf\\fde\\bce from U’.","Use Cy to label p pos\\ft\\fve a\\bd \\b \\be\\tat\\fve se\\bte\\bces w\\fth the h\\f\\thest class\\ffy\\f\\b\\t","co\\bf\\fde\\bce from U’.","Add these labeled se\\bte\\bces to L a\\bd remove them from U.","Ra\\bdomly choose 2(p+\\b) se\\bte\\bces from U to reple\\b\\fsh U’.","","The above al\\tor\\fthm \\fs \\f\\btu\\ft\\fvely based o\\b the follow\\f\\b\\t assumpt\\fo\\bs: Assumpti\\bn\\f 1:\\fA se\\bte\\bce should be h\\f\\thly related to the query \\ff \\ft co\\bta\\f\\bs the same or","s\\fm\\flar co\\bte\\bt bear\\f\\b\\t terms \\f\\b the query. Assumpti\\bn\\f2:\\fA se\\bte\\bce should be h\\f\\thly related to the query \\ff \\ft has the same or s\\fm\\flar","relat\\fo\\bsh\\fp d\\fstr\\fbut\\fo\\b w\\fth other se\\bte\\bces l\\fke the query. Assumpti\\bn\\f 3:\\fco-tra\\f\\b\\f\\b\\t ca\\b explo\\ft the r\\fcher \\f\\bformat\\fo\\b descr\\fbed by two d\\fffere\\bt","features to tra\\f\\b class\\ff\\fers so as to select the releva\\bt se\\bte\\bces from u\\blabeled se\\bte\\bces.","\\a \\a","1","The \\t\\fve\\b query \\fs re\\tarded as a labeled releva\\bt (\\f.e. pos\\ft\\fve) se\\bte\\bce \\f\\b our approach. 193"]},{"title":"3.3 Rand\\bm\\f Walks\\f Based\\f Ranking\\f f\\br\\f the\\f Sele\\tti\\bn\\f \\bf\\f Salient\\f and\\f Diverse\\f Senten\\tes\\f","paragraphs":["The GRASSHOPPER ra\\bk\\f\\b\\t al\\tor\\fthm \\fs a \\te\\beral-purpose ra\\bk\\f\\b\\t method, wh\\fch focuses o\\b \\f\\bformat\\fo\\b d\\fvers\\fty dur\\f\\b\\t the ra\\bk\\f\\b\\t process. The u\\bderly\\f\\b\\t \\fdea of the al\\tor\\fthm \\fs that the \\ftems a\\bd \\f\\bter-\\ftem relat\\fo\\bsh\\fps ca\\b be e\\bcoded by a \\traph. We ca\\b def\\f\\be a ra\\bdom walk o\\b the \\traph correspo\\bd\\f\\b\\tly a\\bd determ\\f\\be the \\fmporta\\bce of a \\bode (\\f.e. \\ftem) by stat\\fo\\bary d\\fstr\\fbut\\fo\\b of ra\\bdom walk o\\b the \\traph. If a \\bode \\fs most s\\fm\\flar to ma\\by other \\bodes, \\ft w\\fll f\\frst become a h\\f\\thly ra\\bked o\\be a\\bd at the same t\\fme be adjusted \\f\\bto the absorb\\f\\b\\t state, wh\\fch w\\fll cut dow\\b the s\\f\\t\\b\\ff\\fca\\bce of s\\fm\\flar u\\bra\\bked \\bodes a\\bd e\\bcoura\\te d\\fvers\\fty. I\\b our study, the GRASSHOPPER ra\\bk\\f\\b\\t al\\tor\\fthm (Zhu et al., 2007) \\fs appl\\fed to ach\\feve both co\\bte\\bt sal\\fe\\bce a\\bd \\f\\bformat\\fo\\b d\\fvers\\fty \\f\\b a u\\b\\ff\\fed framework. The whole procedure of the ra\\bdom walks based ra\\bk\\f\\b\\t al\\tor\\fthm \\toes as follows:","","1. Co\\bstruct a\\b u\\bd\\frected aff\\f\\b\\fty \\traph Gr over the query releva\\bt se\\bte\\bces that have","bee\\b selected \\f\\b the co-tra\\f\\b\\f\\b\\t process, where each se\\bte\\bce \\fs co\\bs\\fdered as a \\bode a\\bd","ed\\tes are created betwee\\b two se\\bte\\bces \\ff the\\fr pa\\fr-w\\fse s\\fm\\flar\\fty exceeds 0.01.","2. Def\\f\\be a\\b adjace\\bcy matr\\fx Mr to represe\\bt Gr w\\fth each e\\btry correspo\\bd\\f\\b\\t to the","cos\\f\\be s\\fm\\flar\\fty of two correspo\\bd\\f\\b\\t se\\bte\\bce vectors.","3. Normal\\fze matr\\fx Mr to matr\\fx r"]},{"title":"M\\f ","paragraphs":["by d\\fv\\fd\\f\\b\\t each eleme\\bt \\f\\b Mr by the","correspo\\bd\\f\\b\\t row sum. 4. Use r"]},{"title":"M\\f","paragraphs":["to form a stochast\\fc matr\\fx Ms by \\f\\bte\\trat\\f\\b\\t a pr\\for ra\\bk\\f\\b\\t d\\fstr\\fbut\\fo\\b r o\\b","these se\\bte\\bces accord\\f\\b\\t to formula 2."," T r\\b"]},{"title":"r)(M\\fM 11 \\f\\f −+=","paragraphs":["(2)","\\a Ms ca\\b be co\\bs\\fdered as the tra\\bs\\ft\\fo\\b matr\\fx of a Markov cha\\f\\b w\\fth the e\\btry Ms(\\f,j) spec\\ffy\\f\\b\\t the tra\\bs\\ft\\fo\\b probab\\fl\\fty from state \\f (\\f.e. se\\bte\\bce s\\f) to state j (\\f.e. se\\bte\\bce sj) \\f\\b the correspo\\bd\\f\\b\\t Markov cha\\f\\b."]},{"title":"[0,1]\\f∈","paragraphs":["\\fs a damp\\f\\b\\t factor, 1 \\fs a\\b all-1 vector, a\\bd"]},{"title":"1","paragraphs":["T"]},{"title":"r","paragraphs":["de\\botes the pr\\for ra\\bk\\f\\b\\t that \\fs represe\\bted as a probab\\fl\\fty d\\fstr\\fbut\\fo\\b. The teleport\\f\\b\\t ra\\bdom walks based o\\b Ms act \\f\\b such a way that mov\\f\\b\\t to a\\b adjace\\bt state accord\\f\\b\\t to the e\\btry \\f\\b r"]},{"title":"M\\f","paragraphs":["w\\fth probab\\fl\\fty"]},{"title":"\\f","paragraphs":["or jump\\f\\b\\t to a ra\\bdom state accord\\f\\b\\t to the pr\\for ra\\bk\\f\\b\\t d\\fstr\\fbut\\fo\\b w\\fth probab\\fl\\fty"]},{"title":"1 \\f−","paragraphs":["at each step. 5. Compute \\b"]},{"title":"M","paragraphs":["’s stat\\fo\\bary d\\fstr\\fbut\\fo\\b a\\bd take the se\\bte\\bce (\\f.e. state) w\\fth the lar\\test","stat\\fo\\bary probab\\fl\\fty to be the top o\\be for the f\\f\\bal ra\\bk\\f\\b\\t.","6. Tur\\b ra\\bked se\\bte\\bces \\f\\bto absorb\\f\\b\\t states a\\bd compute the expected \\bumber of v\\fs\\fts","for all the rest se\\bte\\bces. The\\b p\\fck the \\bext h\\f\\ther ra\\bked se\\bte\\bce w\\fth the max\\fmum","expected \\bumber of v\\fs\\fts2",". Repeat step 6 u\\bt\\fl all the releva\\bt se\\bte\\bces are ra\\bked."," I\\b the above al\\tor\\fthm, the s\\fxth step \\fs cruc\\fal for e\\bcoura\\t\\f\\b\\t d\\fvers\\fty \\f\\b ra\\bk\\f\\b\\t because \\ft prefers those se\\bte\\bces that have more sal\\fe\\bt v\\fs\\ft opportu\\b\\ft\\fes a\\bd preve\\bts those that h\\f\\thly related to the h\\f\\ther ra\\bked se\\bte\\bces from \\tett\\f\\b\\t h\\f\\th score for the ra\\bdom walks are apt to be absorbed soo\\b after v\\fs\\ft\\f\\b\\t them. After the above ra\\bk\\f\\b\\t process, a \\bumber of query releva\\bt se\\bte\\bces w\\fth h\\f\\th co\\bte\\bt sal\\fe\\bce a\\bd \\f\\bformat\\fo\\b d\\fvers\\fty are extracted a\\bd co\\bcate\\bated to create the f\\f\\bal summary \\f\\b accorda\\bce w\\fth the le\\b\\tth l\\fm\\ft. \\a \\a 2 A\\b \\fllustrat\\fo\\b that the Markov cha\\f\\b w\\fth the stochast\\fc matr\\fx Ms w\\fll co\\bver\\te to a u\\b\\fque stat\\fo\\bary d\\fstr\\fbut\\fo\\b a\\bd the deta\\fled descr\\fpt\\fo\\b about how to compute the expected \\bumber of v\\fs\\fts \\f\\b a\\b absorbed Markov cha\\f\\b ca\\b be fou\\bd at the refere\\bce papers wr\\ftte\\b by Zhu et al., 2007. 194 "]},{"title":"4 Experiments\\f 4.1 Data\\fSet\\f\\f","paragraphs":["To evaluate the effect\\fve\\bess of the proposed approach, we exper\\fme\\bt o\\b DUC2007 ma\\f\\b task dataset. The dataset co\\bs\\fsts of 45 top\\fcs w\\fth each top\\fc compr\\fs\\f\\b\\t a query descr\\fpt\\fo\\b as top\\fc \\barrat\\fve, a set of 25 releva\\bt docume\\bts from the AQUAINT corpus a\\bd 4 huma\\b model summar\\fes for evaluat\\fo\\b. The ma\\f\\b task \\f\\b DUC2007 \\fs to create from the docume\\bt set a br\\fef, well-or\\ta\\b\\fzed, flue\\bt summary w\\fth \\fts le\\b\\tth \\bo lo\\b\\ter tha\\b 250 words wh\\fch a\\bswers the \\beed for \\f\\bformat\\fo\\b expressed \\f\\b the query."]},{"title":"4.2 Evaluati\\bn\\fMetri\\t\\f\\f","paragraphs":["The ROUGE toolk\\ft (L\\f\\b a\\bd Hovy, 2003), wh\\fch \\fs the most freque\\btly used automated summary evaluat\\fo\\b packa\\te \\f\\b a\\b\\bual DUC a\\bd TAC, \\fs adopted for evaluat\\f\\b\\t our exper\\fme\\bt results. Usually th\\fs toolk\\ft \\fs employed to measure how much of the co\\bte\\bts of a set of huma\\b-produced \"sta\\bdard\" summar\\fes are co\\bta\\f\\bed by a\\b automat\\fcally produced summary. By automat\\fcally compar\\f\\b\\t var\\fous levels of co\\bte\\bt u\\b\\ft's overlap betwee\\b the automat\\fcally created summary a\\bd the refere\\bce ma\\bual summar\\fes, a few recall-or\\fe\\bted ROUGE metr\\fcs have bee\\b proposed such as ROUGE-1 (u\\b\\f\\tram based metr\\fc), ROUGE-2 (b\\f\\tram based metr\\fc) a\\bd ROUGE-SU4(sk\\fp b\\f\\tram a\\bd u\\b\\f\\tram based metr\\fc w\\fth max\\fmum sk\\fp d\\fsta\\bce 4), etc. Amo\\b\\t them, ROUGE-1 metr\\fc has bee\\b show\\b to correlate w\\fth the huma\\b jud\\tme\\bt best. We prese\\bt the metr\\fc scores of ROUGE-1, ROUGE-2 a\\bd ROUGE-SU4 at the co\\bf\\fde\\bce level of 95% \\f\\b the follow\\f\\b\\t exper\\fme\\bt for they have bee\\b off\\fc\\fally used \\f\\b DUC2007 for system’s compar\\fso\\b."]},{"title":"4.3 Experimental\\fResults\\f\\f","paragraphs":["I\\b the follow\\f\\b\\t exper\\fme\\bts, quer\\fes a\\bd docume\\bts were se\\tme\\bted \\f\\bto se\\bte\\bces, stop-words were removed a\\bd the rema\\f\\b\\f\\b\\t words were stemmed by Porter Stemmer. All the se\\bte\\bces a\\bd the quer\\fes were represe\\bted as the term vectors accord\\f\\b\\t to TF*ISF scheme. The releva\\bce of a se\\bte\\bce to the query a\\bd other se\\bte\\bces were computed by cos\\f\\be s\\fm\\flar\\fty o\\b the\\fr correspo\\bd\\f\\b\\t term vectors. The proposed approach was f\\frst compared w\\fth two basel\\f\\be approaches a\\bd other systems part\\fc\\fpat\\f\\b\\t \\f\\b DUC2007 ma\\f\\b task.","Baseline\\f 1:\\fA s\\fmple summar\\fzer that retur\\bs the f\\frst 250 words of the most rece\\bt docume\\bt \\f\\b the top\\fc.","Baseline\\f 2:\\fA \\te\\ber\\fc mult\\f-docume\\bt summar\\fzer \\bamed CLASSY04, wh\\fch \\f\\t\\bores the query \\barrat\\fve \\f\\bformat\\fo\\b but has the h\\f\\thest evaluat\\fo\\b score \\f\\b Task 2 of DUC 2004.","I\\b our approach, the \\bumbers of pseudo releva\\bt a\\bd \\frreleva\\bt se\\bte\\bces, wh\\fch are determ\\f\\bed by the h\\f\\thest a\\bd lowest s\\fm\\flar\\fty to the query respect\\fvely, are set to 25 emp\\fr\\fcally. The select\\fo\\b of query releva\\bt se\\bte\\bces adopts the co-tra\\f\\b\\f\\b\\t based al\\tor\\fthm descr\\fbed \\f\\b Sect\\fo\\b 3.2. The parameters of the co-tra\\f\\b\\f\\b\\t al\\tor\\fthm are set as follows: p a\\bd \\b are set to 1, wh\\fch de\\bote the \\bumber of pos\\ft\\fve a\\bd \\be\\tat\\fve ca\\bd\\fdates \\f\\b each \\fterat\\fo\\b, u represe\\bts the pool s\\fze de\\bot\\f\\b\\t the \\bumber of se\\bte\\bces selected from the set of u\\blabeled se\\bte\\bces ra\\bdomly, wh\\fch \\fs set to 75, J48 (k\\bow\\b as C4.5) dec\\fs\\fo\\b tree class\\ff\\fer \\fmpleme\\bted \\f\\b Weka (W\\ftte\\b a\\bd Fra\\bk, 2005) \\fs used to tra\\f\\b the class\\ff\\fers Cx a\\bd Cy, a\\bd the class\\ffy\\f\\b\\t co\\bf\\fde\\bce threshold \\fs set to 0.95. The damp\\f\\b\\t factor"]},{"title":"\\f","paragraphs":["of the Markov cha\\f\\b ra\\bdom walks based ra\\bk\\f\\b\\t (k\\bow\\b as GRASSHOPPER) \\fs set to 0.9, a\\bd we let the pr\\for ra\\bk\\f\\b\\t"]},{"title":"1","paragraphs":["T"]},{"title":"r","paragraphs":["the u\\b\\fform probab\\fl\\fty d\\fstr\\fbut\\fo\\b vector because there \\fs \\bo expl\\fc\\ft pr\\for ra\\bk\\f\\b\\t","\\f\\b our co-tra\\f\\b\\f\\b\\t based select\\fo\\b process. Table 2 shows the compar\\fso\\b results.     195","","Table\\f2:\\fSystem compar\\fso\\b results","ROUGE-1\\f ROUGE-2\\f ROUGE-SU4\\f Basel\\f\\be 1 0.31250 0.06039 0.10507 Basel\\f\\be 2 0.40562 0.09382 0.14641 Best/worst","performa\\bce of","part\\fc\\fpat\\f\\b\\t systems 0.45258/ 0.24277 0.12448/ 0.03813 0.17711/ 0.07385 Mea\\b performa\\bce of part\\fc\\fpat\\f\\b\\t systems 0.39728 0.09486 0.14747","Our approach 0.42298\\f 0.10824\\f 0.16131\\f"," The ROUGE evaluat\\fo\\b results \\f\\b Table 2 show that the proposed approach ca\\b ach\\feve s\\f\\t\\b\\ff\\fca\\bt \\fmproveme\\bt over basel\\f\\be approaches a\\bd \\ta\\f\\b comparable performa\\bce to the state-of-the-art systems. The e\\bcoura\\t\\f\\b\\t performa\\bce ach\\feved by the proposed approach ca\\b be attr\\fbuted to the follow\\f\\b\\t factors.","1)\\fC\\b-training\\fbased\\fsele\\tti\\bn\\f\\bf\\fquery\\frelevant\\fsenten\\tes\\f\\f","The Co-tra\\f\\b\\f\\b\\t based al\\tor\\fthm ca\\b make full use of both the co\\bte\\bt feature a\\bd the relat\\fo\\bsh\\fp feature to lear\\b to class\\ffy se\\bte\\bces \\f\\bto two classes (\\f.e. query releva\\bt se\\bte\\bces a\\bd query \\frreleva\\bt se\\bte\\bces). It also allows a lar\\te amou\\bt of u\\blabeled se\\bte\\bces to au\\tme\\bt a much smaller set of pseudo-labeled se\\bte\\bces.","2)\\fGRASSHOPPER\\fbased\\fsele\\tti\\bn\\f\\bf\\fsalient\\fand\\fdiverse\\fsenten\\tes\\f\\f","GRASSHOPPER ra\\bk\\f\\b\\t \\fs a\\b alter\\bat\\fve to MMR a\\bd tr\\fes to ach\\feve sal\\fe\\bce a\\bd d\\fvers\\fty \\f\\b a u\\b\\ff\\fed framework. It ca\\b make use of the ra\\bdom walks \\f\\b a\\b absorb\\f\\b\\t Markov cha\\f\\b to ra\\bk a set of releva\\bt se\\bte\\bces so that the h\\f\\thly ra\\bked se\\bte\\bces have h\\f\\ther local ce\\btral\\fty a\\bd cover as ma\\by d\\fst\\f\\bct subtop\\fcs as poss\\fble."]},{"title":"4.4 Effe\\tt\\f\\bf\\fthe\\fSize\\f\\bf\\fthe\\fPseud\\b\\fRelevant\\fand\\fIrrelevant\\fSenten\\tes\\f","paragraphs":["To study the \\f\\bflue\\bce of the \\bumber of the pseudo releva\\bt a\\bd \\frreleva\\bt se\\bte\\bces \\f\\b the propose approach, we repeat our exper\\fme\\bts w\\fth d\\fffere\\bt s\\fze of pseudo labeled se\\bte\\bces wh\\fch var\\fes from 5 to 75 w\\fth the step set to 10. Due to pa\\te l\\fm\\ft, we o\\bly report ROUGE-1 performa\\bce as represe\\btat\\fve \\f\\b th\\fs exper\\fme\\bt. F\\f\\ture 1 demo\\bstrates the effect of the parameter wh\\fle other parameters rema\\f\\b u\\bcha\\b\\ted."," 0.39 0.4 0.41 0.42 0.43 5 15 25 35 45 55 65 75 Number of Pseudo-labeled Releva\\bt a\\bd Irreleva\\bt Se\\bte\\bces R O U G E - 1  P e r f o r ma \\b c e the Proposed Approach"," Figure\\f1: ROUGE-1 performa\\bce vs. \\bumber of pseudo-labeled releva\\bt a\\bd \\frreleva\\bt se\\bte\\bces. From F\\f\\ture 1, we ca\\b f\\f\\bd that the proposed approach ca\\b ach\\feve 0.405 o\\b ROUGE-1 metr\\fc whe\\b o\\bly f\\fve pseudo-labeled se\\bte\\bces are ava\\flable, wh\\fch \\fs better tha\\b the avera\\te performa\\bce of the part\\fc\\fpat\\f\\b\\t systems \\f\\b DUC2007 ma\\f\\b task a\\bd su\\t\\tests that a small 196  \\bumber of pseudo-labeled samples are e\\bou\\th for the approach. The ROUGE-1 score \\f\\bcreases sharply whe\\b the \\bumber of pseudo-labeled se\\bte\\bces var\\fes from 5 to 25 a\\bd ach\\feves the summ\\ft at 25. The\\b \\ft te\\bds to be \\tradually stab\\fl\\fzed at 0.42 arou\\bd, wh\\fch does\\b’t show a s\\f\\t\\b\\ff\\fca\\bt d\\fffere\\bce as the \\bumber of pseudo-labeled se\\bte\\bces \\f\\bcreases. O\\be poss\\fble expla\\bat\\fo\\b for the te\\bde\\bcy \\fs that more pseudo-labeled releva\\bt a\\bd \\frreleva\\bt se\\bte\\bces prov\\fded by the s\\fm\\flar\\fty based select\\fo\\b strate\\ty w\\fll also br\\f\\b\\t more \\bo\\fse that w\\fll \\f\\bflue\\bce the co-tra\\f\\b\\f\\b\\t performa\\bce afterward \\f\\b a certa\\f\\b de\\tree. Th\\fs also ver\\ff\\fes that the proposed co-tra\\f\\b\\f\\b\\t based summar\\fzat\\fo\\b method ca\\b ach\\feve prom\\fs\\f\\b\\t a\\bd robust performa\\bce whe\\b a\\b appropr\\fate amou\\bt of pseudo-labeled se\\bte\\bces are prov\\fded."]},{"title":"4.5 Effe\\tt\\f\\bf\\fthe\\fSele\\tti\\bn\\fStrategies\\ff\\br\\fQuery\\fRelevant\\fSenten\\tes\\f","paragraphs":["To explore the \\fmpact of d\\fffere\\bt select\\fo\\b strate\\t\\fes for releva\\bt se\\bte\\bces o\\b the evaluat\\fo\\b result, a\\bother approach (\\f.e. releva\\bce-based approach) \\fs \\fmpleme\\bted as refere\\bce, wh\\fch f\\frst computes the s\\fm\\flar\\fty-based releva\\bce betwee\\b the query a\\bd each se\\bte\\bce \\f\\b the docume\\bt set a\\bd chooses those se\\bte\\bces whose releva\\bce to the query exceeds zero as ca\\bd\\fdates. The\\b GRASSHOPPER ra\\bk\\f\\b\\t al\\tor\\fthm \\fs \\fmposed o\\b the ca\\bd\\fdate se\\bte\\bce set a\\bd the se\\bte\\bces w\\fth h\\f\\thest ra\\bk\\f\\b\\t scores are selected to create the f\\f\\bal summary.","I\\b releva\\bce-based approach the damp\\f\\b\\t factor"]},{"title":"\\f","paragraphs":["of the GRASSHOPPER ra\\bk\\f\\b\\t \\fs set to 0.5 because a\\b expl\\fc\\ft pr\\for ra\\bk\\f\\b\\t (\\f.e. the s\\fm\\flar\\fty releva\\bce) for each releva\\bt se\\bte\\bce ca\\b be ut\\fl\\fzed a\\bd \\ft may co\\btr\\fbute to the f\\f\\bal ra\\bk\\f\\b\\t score equally as a\\bother factor e\\bcoded by the aff\\f\\b\\fty \\traph does.  0.42298 0.10824 0.16131 0.39916 0.0928 0.147 00.050.10.150.20.250.30.350.40.45 ROUGE-1 ROUGE-2 ROUGE-SU4 Rou\\te Metr\\fcs P e r f o r m a \\b c e the Proposed Approach Releva\\bce-based Approach","","Figure\\f2: ROUGE performa\\bce compar\\fso\\b betwee\\b the proposed approach a\\bd releva\\bce-based approach.  From F\\f\\ture 2, \\ft ca\\b be fou\\bd that the co-tra\\f\\b\\f\\b\\t based al\\tor\\fthm \\fs better tha\\b the purely releva\\bce-based strate\\ty whe\\b select\\f\\b\\t a \\bumber of query releva\\bt se\\bte\\bces. It \\f\\bd\\fcates that comb\\f\\b\\f\\b\\t the co-tra\\f\\bed \\f\\bformat\\fo\\b from both co\\bte\\bt feature a\\bd relat\\fo\\bsh\\fp feature ca\\b prov\\fde better heur\\fst\\fcs for the select\\fo\\b process a\\bd lead to better performa\\bce."]},{"title":"4.6 Effe\\tt\\f\\bf\\fthe\\fSele\\tti\\bn\\fStrategies\\ff\\br\\fSalient\\fand\\fDiverse\\fSenten\\tes\\f","paragraphs":["If the proposed approach does \\bot co\\bduct the ra\\bdom walks based ra\\bk\\f\\b\\t (\\f.e. let"]},{"title":"\\f","paragraphs":["=0 \\f\\b GRASSHOPPER ra\\bk\\f\\b\\t) o\\b those selected releva\\bt se\\bte\\bces, we observe that the ROUGE-1 score w\\fll decrease dramat\\fcally from 0.42298 to 0.39268 because ma\\by se\\bte\\bces w\\fth h\\f\\th 197 query releva\\bce w\\fll be selected as the summary se\\bte\\bces but they may co\\bvey the s\\fm\\flar or eve\\b the same \\f\\bformat\\fo\\b about the same top\\fc. The result clearly shows that \\ff the proposed approach does \\bot take \\f\\bto accou\\bt the co\\bte\\bt sal\\fe\\bce a\\bd \\f\\bformat\\fo\\b d\\fvers\\fty amo\\b\\t the releva\\bt se\\bte\\bces, \\ft w\\fll deter\\forate the f\\f\\bal performa\\bce ev\\fde\\btly. However, whe\\b the pr\\for ra\\bk\\f\\b\\t of releva\\bt se\\bte\\bces \\fs \\bot co\\bs\\fdered (\\f.e. let"]},{"title":"\\f","paragraphs":["=1 \\f\\b GRASSHOPPER ra\\bk\\f\\b\\t), the performa\\bces of both approaches are st\\fll well."]},{"title":"5 C\\bn\\tlusi\\bn\\fand\\fFuture\\fW\\brk\\f\\f","paragraphs":["Th\\fs paper proposes a \\bovel extract\\fve approach to query-focused mult\\f-docume\\bt summar\\fzat\\fo\\b. The proposed approach ca\\b make full use of the co-tra\\f\\b\\f\\b\\t based sem\\fsuperv\\fsed lear\\b\\f\\b\\t al\\tor\\fthm to \\fde\\bt\\ffy the releva\\bt se\\bte\\bces o\\b two abu\\bda\\bt feature v\\fews w\\fth a small \\bumber of pseudo-labeled se\\bte\\bces. The f\\f\\bal summary created by the approach ca\\b keep a bala\\bce amo\\b\\t query releva\\bce, co\\bte\\bt sal\\fe\\bce a\\bd \\f\\bformat\\fo\\b d\\fvers\\fty \\f\\b a u\\b\\ff\\fed framework. Exper\\fme\\btal results o\\b DUC2007 ma\\f\\b task dataset demo\\bstrate the effect\\fve\\bess of the proposed approach a\\bd ver\\ffy the pote\\bt\\fal of the co-tra\\f\\b\\f\\b\\t based lear\\b\\f\\b\\t al\\tor\\fthm \\f\\b query-focused summar\\fzat\\fo\\b.","I\\b future work, we w\\fll apply the co-tra\\f\\b\\f\\b\\t base method to other summar\\fzat\\fo\\b tasks such as update summar\\fzat\\fo\\b, op\\f\\b\\fo\\b summar\\fzat\\fo\\b, etc. Moreover, to show the adva\\bta\\te of us\\f\\b\\t co-tra\\f\\b\\f\\b\\t \\f\\b feature comb\\f\\bat\\fo\\b, we w\\fll make a compar\\fso\\b to trad\\ft\\fo\\bal comb\\f\\bat\\fo\\b approaches such as l\\f\\bear comb\\f\\bat\\fo\\b a\\bd mult\\fple modal\\ft\\fes fus\\fo\\b. Future work also \\f\\bcludes explor\\f\\b\\t how to use other d\\fffere\\bt feature v\\fews to extract query releva\\bt se\\bte\\bces a\\bd make the f\\f\\bal summary more \\f\\bformat\\fve, cohere\\bt a\\bd readable."]},{"title":"Referen\\tes\\f","paragraphs":["Blum, A. a\\bd T. M\\ftchell. 1998. Comb\\f\\b\\f\\b\\t Labeled a\\bd U\\blabeled Data w\\fth Co-Tra\\f\\b\\f\\b\\t. Proceeding\\b of the 11th Annual Conference on Computational Learning Theory (COLT'98), pp.92-100.","Carbo\\bell, J. a\\bd J. Goldste\\f\\b 1998. the Use of MMR, D\\fvers\\fty-Based Rera\\bk\\f\\b\\t for Reorder\\f\\b\\t Docume\\bts a\\bd Produc\\f\\b\\t Summar\\fes. Proceeding\\b of the 12th Annual International ACM SIGIR Conference on Re\\bearch and Development in Information Retrieval (SIGIR'98), pp.335–336.","Chr\\fstoph, M., S. Rapp a\\bd M. Strube. 2002. Apply\\f\\b\\t Co-Tra\\f\\b\\f\\b\\t to Refere\\bce Resolut\\fo\\b. Proceeding\\b of the 40th Annual Meeting of the A\\b\\bociation for Computational Lingui\\btic\\b (ACL'02), pp.352–359.","Erka\\b, G. a\\bd D.R. Radev. 2004. LexRa\\bk: Graph-Based Lex\\fcal Ce\\btral\\fty as Sal\\fe\\bce \\f\\b Text Summar\\fzat\\fo\\b. Journal of Artificial Intelligence Re\\bearch, 22:457-479.","Goldste\\f\\b, J., V. M\\fttal, J. Carbo\\bell, a\\bd J. Calla\\b. 2000. Mult\\f-Docume\\bt Summar\\fzat\\fo\\b by Se\\bte\\bce Extract\\fo\\b. Proceeding\\b of ANLP/NAACL Work\\bhop on Summarization, pp.40–48.","Havel\\fwala, T. H. 2003. Top\\fc-Se\\bs\\ft\\fve Pa\\teRa\\bk: A Co\\btext-Se\\bs\\ft\\fve Ra\\bk\\f\\b\\t Al\\tor\\fthm for Web Search. IEEE Tran\\baction\\b on Knowledge and Data Engineering, 15(4), 784-796.","K\\b\\f\\tht, K. a\\bd D. Marcu. 2000. Stat\\fst\\fcs-Based Summar\\fzat\\fo\\b - Step O\\be: Se\\bte\\bce Compress\\fo\\b. Proceeding\\b of the Seventeenth National Conference on Artificial Intelligence and Twelfth Conference on Innovative Application\\b of Artificial Intelligence (AAAI'00), pp.703-710.","L\\f\\b C.Y. a\\bd H. Eduard. 2003. Automat\\fc Evaluat\\fo\\b of Summar\\fes Us\\f\\b\\t N-Gram Co-Occurre\\bce Stat\\fst\\fcs. Proceeding\\b of the 2003 Conference of the North American Chapter of the A\\b\\bociation for Computational Lingui\\btic\\b (NAACL'03), pp.71–78. 198 ","M\\fhalcea, R. a\\bd P. Tarau. 2004. TextRa\\bk: Br\\f\\b\\t\\f\\b\\t Order \\f\\bto Texts. Proceeding\\b of the Conference on Empirical Method\\b in Natural Language Proce\\b\\bing (EMNLP'04), pp.404-411.","Muller, Chr\\fstoph , Stefa\\b Rapp a\\bd M\\fchael Strube. 2002. Apply\\f\\b\\t Co-Tra\\f\\b\\f\\b\\t to Refere\\bce Resolut\\fo\\b. Proceeding\\b of the 40th Annual Meeting on A\\b\\bociation for Computational Lingui\\btic\\b.","Radev, D.R., H.Y. J\\f\\b\\t, M. Stys a\\bd D.Tam. 2004. Ce\\btro\\fd-Based Summar\\fzat\\fo\\b of Mult\\fple Docume\\bts. Information Proce\\b\\bing and Management, 40:919-938.","Sarkar, A. 2001. Apply\\f\\b\\t Co-Tra\\f\\b\\f\\b\\t Methods to Stat\\fst\\fcal Pars\\f\\b\\t. Proceeding\\b of the 2nd Conference of the North American Chapter of the A\\b\\bociation for Computational Lingui\\btic\\b (NAACL'01), pp.175–182.","Wa\\b, X.J., J.W. Ya\\b\\t a\\bd J.G. X\\fao. 2007. Ma\\b\\ffold-Ra\\bk\\f\\b\\t Based Top\\fc-Focused Mult\\f-Docume\\bt Summar\\fzat\\fo\\b. Proceeding\\b of the 20th International Joint Conference on Artificial Intelligence (IJCAI 07), pp.2903-2908.","W\\ftte\\b, I.H. a\\bd E. Fra\\bk. 2005. Data Mining:Practical Machine Learning Tool\\b and Technique\\b,2nd Edition, Mor\\ta\\b Kaufma\\b\\b, Sa\\b Fra\\bc\\fsco.","Wo\\b\\t, K.F., M.L. Wu a\\bd W.J. L\\f. 2008. Extract\\fve Summar\\fzat\\fo\\b Us\\f\\b\\t Superv\\fsed a\\bd Sem\\f-Superv\\fsed Lear\\b\\f\\b\\t. Proceeding\\b of the International Conference on Computational Lingui\\btic\\b (COLING'08), pp.985-992.","Zha\\b\\t, B.Y., H. L\\f, Y. L\\fu, L. J\\f, W.S. X\\f, W.G. Fa\\b, Z. Che\\b a\\bd W.Y. Ma. 2005. Improv\\f\\b\\t Web Search Results Us\\f\\b\\t Aff\\f\\b\\fty Graph. Proceeding\\b of the 28th Annual International ACM SIGIR Conference on Re\\bearch and Development in Information Retrieval (SIGIR’05), pp.504–511.","Zha\\b\\t, Y., J. Calla\\b a\\bd T. M\\f\\bka. 2002. Novelty a\\bd Redu\\bda\\bcy Detect\\fo\\b \\f\\b Adapt\\fve F\\flter\\f\\b\\t. Proceeding\\b of the 25th Annual International ACM SIGIR Conference on Re\\bearch and Development in Information Retrieval(SIGIR'02), pp.81–88.","Zhu, X.J., A. Goldber\\t, J.V. Gael a\\bd D. A\\bdrzejewsk\\f. 2007. Improv\\f\\b\\t D\\fvers\\fty \\f\\b Ra\\bk\\f\\b\\t Us\\f\\b\\t Absorb\\f\\b\\t Ra\\bdom Walks. Proceeding\\b of HLT-NAACL'07, pp.97–104. 199"]}]}