{"sections":[{"title":"      Cause E\\be\\tt Re\\frese\\ttatio\\ts for Ha\\f\\fi\\tess a\\td Sur\\frise ","paragraphs":["Sophia \\ba\\t Mei \\feea , \\bing Chena",", and Chu-Ren Huanga,b  a","Depar\\tmen\\t of Chinese and Bilingual S\\tudies,","The Hong Kong Poly\\technic Universi\\ty, Hong Kong","{sophiaym, chenying3176, churenhuang}@gmail.com","b","Ins\\ti\\tu\\te of \\finguis\\tics,","Academia Sinica, Taipei Abstract. This paper presen\\ts a linguis\\tic analysis of emo\\tions by in\\troducing some concre\\te linguis\\tic rules in iden\\tifying \\the impor\\tan\\t elemen\\ts of an emo\\tion, which are \\the experiencer and \\the cause. I\\t specifically discusses \\two primary emo\\tions, happi\\b\\tss and su\\fp\\fis\\t, in Chinese. These rules can be very useful for emo\\tion de\\tec\\tion and classifica\\tion. We also examine \\the fea\\tures of a cause even\\t according \\to i\\ts degree of \\transi\\tivi\\ty, namely agen\\tivi\\ty, kinesis, and even\\t par\\ticipa\\tion. We find \\tha\\t \\the emo\\tion classes (happi\\b\\tss vs. su\\fp\\fis\\t) override \\the emo\\tion verb \\types (change-of-s\\ta\\te verb vs. homogeneous verb) in \\terms of cause even\\t fea\\tures. We believe \\tha\\t \\this s\\tudy will have some implica\\tions for \\the linguis\\tic accoun\\t of causal even\\ts as well as \\the \\theory of emo\\tions in general. We also hope \\tha\\t \\this work will shed ligh\\ts in \\the au\\toma\\tic de\\tec\\tion and classifica\\tion of emo\\tion in language \\technology. Keywords: emo\\tion, cause even\\t, experiencer, happiness, surprise."]},{"title":"1 I\\ttroductio\\t1 ","paragraphs":["Emo\\tions have been widely s\\tudied in and across various disciplines. Various linguis\\tic and psychological \\theories of emo\\tions were proposed previously (e.g. Plu\\tchik 1980, Frijda 1986, Weiss and Cropanozano 1996). They are generally considered \\the leas\\t \\tangible aspec\\ts of human experience, bu\\t exer\\t powerful influence upon our \\though\\ts and ac\\tions, and even physical appearance and physiological processes occurring wi\\thin our bodies (Harkins and Wierzbicka 2001). Wi\\th i\\ts complex na\\ture, \\there have been considerable deba\\tes among \\the \\theories on \\the defini\\tion as well as \\the classifica\\tion of emo\\tions. None\\theless, mos\\t \\theories agree \\tha\\t an emo\\tion is composed of or s\\timula\\ted by a cause even\\t and \\tha\\t \\the cause even\\ts are \\the mos\\t \\tangible componen\\t of emo\\tion (Wierzbicka 1996). As no objec\\tive cri\\teria have been offered ye\\t \\to define and classify cause even\\ts empirically, \\this s\\tudy aims \\to examine \\the in\\terac\\tion be\\tween emo\\tions and cause even\\ts.","As for real world applica\\tions, \\the informa\\tion of who \\the experiencer of an emo\\tion is and wha\\t \\triggers such an emo\\tion is an essen\\tial elemen\\t for N\\fP. Such informa\\tion is par\\ticularly impor\\tan\\t for economic and poli\\tical evalua\\tions as well as produc\\t reviews. However, iden\\tifying \\the experiencer and \\the causes of an emo\\tion is very challenging in N\\fP. We believe \\tha\\t a linguis\\tic analysis of cause even\\ts may help generalize some useful pa\\t\\terns for au\\toma\\tic emo\\tion de\\tec\\tion and classifica\\tion.","In \\this paper, we presen\\t a linguis\\tic analysis of emo\\tions in \\terms of \\their experiencers and causes. Causes refer \\to \\the explici\\tly expressed argumen\\ts or even\\ts \\tha\\t \\trigger \\the presence of \\the corresponding emo\\tions, which are usually expressed by means of verbs, nominaliza\\tions, \\, \\,  Copyrigh\\t 2009 by Sophia \\ba\\t Mei \\fee, \\bing Chen, and Chu-Ren Huang 345 23rd Pacific Asia Conference on Language, Information and Computation, pages 345–354       and can some\\times be even\\t nominals (Sauri e\\t al. 2006). We specifically look a\\t \\two primary emo\\tions, happi\\b\\tss and su\\fp\\fis\\t, in Chinese. Sec\\tion 2 discusses \\the previous \\theories concerning emo\\tion s\\tudies and Sec\\tion 3 describes \\the da\\ta used in \\the s\\tudy. Sec\\tion 4 examines how \\the experiencers and \\the causes of happi\\b\\tss and su\\fp\\fis\\t can be iden\\tified linguis\\tically by in\\troducing some concre\\te linguis\\tic rules. We also discuss \\the correla\\tions be\\tween \\the causes and \\the corresponding emo\\tions based on \\the degree of \\transi\\tivi\\ty in Sec\\tion 5. Sec\\tion 6 concludes \\the paper."]},{"title":"2 Emotio\\t Theories","paragraphs":["Researchers have a\\t\\temp\\ted \\to s\\tudy \\the emo\\tion classifica\\tion wi\\th differen\\t approaches in differen\\t fields, varying from linguis\\tics, neuropsychology, \\to compu\\ter science, as well as varying from language \\to language. \\be\\t, \\there is no consensus on \\the classifica\\tion of emo\\tions. In \\this sec\\tion, we discuss \\the emo\\tion classifica\\tion \\tha\\t \\there was \\the mos\\t agreemen\\t on, and \\the emo\\tion verb classes in Chinese."]},{"title":"2.1 Ha\\f\\fi\\tess a\\td Sur\\frise as Primary Emotio\\ts","paragraphs":["I\\t is assumed \\tha\\t a small number of emo\\tions are considered primary emo\\tions, and \\tha\\t o\\ther emo\\tions are secondary emo\\tions which are \\the mix\\tures of \\the primary emo\\tions. Many differen\\t lis\\ts of basic emo\\tions have been proposed, \\there is, none\\theless, no agreemen\\t nei\\ther on \\the number of basic emo\\tions nor \\the classes of emo\\tions. For example, Kemper (1987) sugges\\ts \\tha\\t \\there are a\\t leas\\t four basic emo\\tions, i.e. f\\ta\\f, a\\bg\\t\\f, sad\\b\\tss, and satisfactio\\b. The ra\\tionales for considering \\them as basic are \\tha\\t (1) \\they can be observed in mos\\t animals; (2) \\tha\\t \\they are universally found in all cul\\tures; (3) \\they appear early in \\the course of human developmen\\t; (4) \\they are ou\\tcomes of power and s\\ta\\tus in\\terac\\tions; (5) \\they are associa\\ted wi\\th dis\\tinc\\t au\\toma\\tic pa\\t\\terns of physiological changes. Similar \\to Kemper, Or\\tony and Turner (1990) also give reasons for assuming \\the exis\\tence of basic emo\\tions: (1) some emo\\tions appear \\to exis\\t in all cul\\tures; (2) some can be iden\\tified in higher animals; (3) some have charac\\teris\\tic facial expressions; and (4) some seem \\to increase \\the chances of survival.","Various researchers have a\\t\\temp\\ted \\to propose \\the lis\\t of basic emo\\tions, which varies from \\two \\to \\ten basic emo\\tions. F\\ta\\f and a\\bg\\t\\f appear on every lis\\t, whereas happi\\b\\tss and sad\\b\\tss appear on mos\\t of \\the lis\\ts. These four emo\\tions, i.e. f\\ta\\f, a\\bg\\t\\f, happi\\b\\tss, and sad\\b\\tss, are \\the mos\\t common primary emo\\tions. O\\ther less common primary emo\\tions are su\\fp\\fis\\t, disgust, sham\\t, dist\\f\\tss, guilt, i\\bt\\t\\f\\tst, pai\\b, and acc\\tpta\\bc\\t.","In our s\\tudy, we adop\\t Turner’s emo\\tion classifica\\tion (Turner 2000), which iden\\tifies five primary emo\\tions, namely happi\\b\\tss, sad\\b\\tss, f\\ta\\f, a\\bg\\t\\f, and su\\fp\\fis\\t, and various complex emo\\tions. In \\this classifica\\tion, su\\fp\\fis\\t is considered op\\tional. The inclusion of su\\fp\\fis\\t in our s\\tudy are mainly a\\t\\tribu\\ted \\to \\the fac\\t \\tha\\t, in Chinese, ji\\bg “surprise” appears \\to be a produc\\tive emo\\tion word which has a s\\trong abili\\ty \\to compose complex emo\\tion words such as ji\\bgxi “surprise+happiness” and ji\\bgxia “surprise+fear” (Chen e\\t al. 2009). "]},{"title":"2.2 Emotio\\t Verb Classes i\\t Chi\\tese","paragraphs":["In \\the li\\tera\\ture, \\there has been some work done on \\the classifica\\tion of Chinese emo\\tions. Based on a corpus s\\tudy using Academia Sinica Balanced Corpus (Sinica Corpus), which con\\tains five million Chinese words, Chang e\\t al. (1999) proposed seven se\\ts of mos\\t frequen\\t emo\\tion verbs namely happy, d\\tp\\f\\tss\\td, sad, \\f\\tg\\f\\tt, a\\bg\\fy, af\\faid, and wo\\f\\fi\\td. They iden\\tified a \\to\\tal of 33 verbs in \\the seven \\types of emo\\tion verbs, each wi\\th a frequency of over 40 in \\the Sinica Corpus. They \\then proposed a dicho\\tomy of emo\\tion verbs in \\the seven sub\\types of Chinese emo\\tion verbs, as shown in Table 1:   346        Table 1: The Dicho\\tomy of \\the Emo\\tion Verbs in Chinese Sub\\type Change-of-S\\ta\\te Homogeneous Happy Gaoxing 高興(699)","Kaixin 開心(152) Kuaile 快樂(942) \\bukuai 愉快(271) Xiyue 喜悅(156) Huanle 歡樂(141) Huanxi 歡喜(107) Kuaihuo 快活(48) Tongkuai 痛快(40)","Depressed Nanguo 難過(232) Tongxin 痛心(48) Tongku 痛苦(443) Chenzhong 沈重(83) Jusang 沮喪(62)","Sad Shangxin 傷心(134) Beishang 悲傷(52)","Regre\\t Houhui 後悔(102) \\bihan 遺憾(198)","Angry Shengqi 生氣(307) Fennu 憤怒(112) Qifen 氣憤(49)","Afraid Haipa 害怕(261) Kongju 恐懼(149) Weiju 畏懼(40)","Worried Danxin 擔心(609) Danyou 擔憂(64) Fannao煩惱(199) Kunao 苦惱(45) ","For each sub\\type, \\there are \\two \\types of emo\\tion verbs: change-of-s\\ta\\te emo\\tion verbs and homogeneous s\\ta\\te emo\\tion verbs. Chang e\\t al. found \\tha\\t change-of-s\\ta\\te and homeogeneous s\\ta\\te verbs behave differen\\tly in \\terms of five cri\\teria: 1) \\their gramma\\tical func\\tions; 2) \\their cooccurrence res\\tric\\tions; 3) \\the appropria\\teness in \\the impera\\tive and evalua\\tive cons\\truc\\tion; 4) \\the verbal aspec\\t; and 5) \\the \\transi\\tivi\\ty.","Since su\\fp\\fis\\t was no\\t examined in Chang e\\t al.’s analysis, we \\tes\\t \\the emo\\tion verbs of su\\fp\\fis\\t in Chinese according \\to \\the five cri\\teria based on \\the Sinica Corpus (which will be discussed in Sec\\tion 3). We find \\tha\\t \\the \\two mos\\t frequen\\t verbs of su\\fp\\fis\\t are ji\\bgya and zh\\t\\bji\\bg, and \\tha\\t ji\\bgya behaves more like a change-of-s\\ta\\te emo\\tion verb whereas zh\\t\\bji\\bg is more of a homogeneous emo\\tion verb.","Wi\\th \\this accoun\\t of emo\\tion verbs, we examine \\the mos\\t frequen\\t verbs of happi\\b\\tss and su\\fp\\fis\\t, one from each group, i.e. ji\\bgya and zh\\t\\bji\\bg for surprise, and gaoxi\\bg and kuail\\t for happiness. Based on \\this dicho\\tomy, we explore whe\\ther \\the causes of \\the \\two groups of emo\\tion verbs are expressed differen\\tly, i.e. ji\\bgya and gaoxi\\bg vs. zh\\t\\bji\\bg and kuail\\t."]},{"title":"3 Data","paragraphs":["We give a corpus-based s\\tudy on emo\\tion analysis. I\\t provides a sys\\tema\\tic analysis of au\\then\\tic examples of Chinese from a varie\\ty of genres. Ins\\tead of illus\\tra\\ting wi\\th in\\trospec\\tive examples, corpus da\\ta serve as evidence from na\\turally occurring da\\ta. By observing \\the \\tex\\t in \\the corpus wi\\th \\the help of da\\ta collec\\tion \\tools, we can make relevan\\t generaliza\\tions.","The da\\ta used in \\this paper are \\taken from \\the Sinica Corpus, which is a \\tagged Mandarin corpus con\\taining a \\to\\tal of \\ten million words. The \\tex\\ts in \\the corpus are collec\\ted from differen\\t sources and in various \\topics such as Philosophy, Science, Ar\\ts, e\\tc. We aim a\\t analyzing 100 emo\\tional sen\\tences wi\\th cause even\\ts for each group of emo\\tion verbs of happi\\b\\tss and su\\fp\\fis\\t.","The Chinese Word Ske\\tch genera\\tes linguis\\tically meaningful colloca\\tions au\\toma\\tically from \\the Sinica corpus, and provides rich lexicon-based gramma\\tical informa\\tion wi\\th s\\tochas\\tic informa\\tion. Using Chinese Word Ske\\tch, we randomly ex\\trac\\t sen\\tences of each of emo\\tion verbs from \\the Sinica Corpus, \\toge\\ther wi\\th \\their con\\tex\\ts in which \\the causes of \\the 347       emo\\tions appear. Please no\\te \\tha\\t sen\\tences con\\taining emo\\tion verbs do no\\t necessary emo\\tional. Hence, we fil\\ter ou\\t non-emo\\tional sen\\tences as well as emo\\tional sen\\tences wi\\th no explici\\t cause. Examples of emo\\tional sen\\tences con\\taining corresponding cause even\\ts are given in Table 2:  Table 2: Example Sen\\tences wi\\th \\the Emo\\tions and \\the Corresponding Causes Emo\\tions Change-of-S\\ta\\te Homogeneous","Happy Gaoxing高興 今天我很高興高興高興高興說了這麼多中國話。 “I am very happy \\tha\\t I was able \\to speak much Chinese \\today.”  Kuaile快樂 幾天後,就可看到我的傑作了,真是快樂快樂快樂快樂呀! “I am happy \\tha\\t I can see my mas\\terpiece few days la\\ter!”","Surprise Jingya驚訝 他很驚訝驚訝驚訝驚訝台灣竟然有這麼大型又美麗的鳥。 “He was surprised \\tha\\t \\there is such a large and beau\\tiful bird in Taiwan.”  Zhenjing震驚 沒想到她所說的都是真話,讓他震驚震驚震驚震驚不已。 “Wha\\t she said was, unexpec\\tedly, \\the \\tru\\th, he was very surprised.\""]},{"title":"4 Ide\\ttificatio\\t of Emotio\\t Ex\\ferie\\tcers a\\td Causes","paragraphs":["By examining \\the 100 emo\\tional sen\\tences of each emo\\tion verb ex\\trac\\ted from Sinica Corpus, we generalize some rules for iden\\tifying \\the experiencer and \\the cause of \\the corresponding emo\\tion verb. We consider \\the cause as a proposi\\tion. I\\t is generally assumed \\tha\\t a proposi\\tion has a verb which op\\tionally \\takes a noun occurring before i\\t as \\the subjec\\t and a noun af\\ter i\\t as \\the objec\\t. However, as men\\tioned earlier, a cause can also be expressed as a nominaliza\\tion or nominal. We also iden\\tify \\the posi\\tion of \\the proposi\\tion as well as \\the experiencer, which can occur in \\the clause con\\taining \\the emo\\tion verb (focus clause), \\the clause before \\the focus clause, or \\the clause af\\ter \\the focus clause. The abbrevia\\tions used in \\the rules are given as follows:","","P = Proposi\\tion/cause even\\t","E = Experiencer","K = Keyword/emo\\tion verb","","B = Clause before \\the focus clause","F = Focus clause/\\the clause con\\taining \\the emo\\tion verb","A = Clause af\\ter \\the focus clause ","In \\the following sub-sec\\tions, we summarize \\the generalized rules for each of \\the emo\\tion verbs in ques\\tion, i.e. zh\\t\\bji\\bg, ji\\bgya, kuail\\t, and gaoxi\\bg. The rules are presen\\ted in order of specifici\\ty, and each is illus\\tra\\ted wi\\th an example. For simplici\\ty, an example of \\the rule descrip\\tion is given in Rule 1 of zh\\t\\bji\\bg."]},{"title":"4.1 Zhe\\tji\\tg","paragraphs":["Rule 1: i) P (B/F) + 讓/令/使‘\\to cause’(F) + E(F) + K(F) ii) E = \\the neares\\t Na/Nb/Nc/Nh af\\ter讓/令/使 in F iii) P = \\the neares\\t (N)+V+(N) before 讓/令/使 in F/B  Rule 1 indica\\tes \\tha\\t \\the experiencer appears \\to be \\the neares\\t Na (common noun)/Nb (proper noun)/Nc (place noun)/Nh (pronoun) af\\ter \\the preposi\\tion 讓,令 or 使 in \\the focus clause, while 348       a\\t \\the same \\time comes before zh\\t\\bji\\bg. Besides, \\the cause (P) comes before 讓,令 or 使. We simplify P as a s\\truc\\ture of (N)+V+(N), and P is very likely \\to con\\tain \\the cause even\\t. In iden\\tifying P, we firs\\t look for \\the neares\\t verb occurring before讓,令 or 使 in \\the focus sen\\tence or \\the clause before \\the focus clause, and consider \\this verb as an anchor. From \\this verb, we search \\to \\the lef\\t for \\the neares\\t noun, and consider i\\t as \\the subjec\\t; we \\then search \\to \\the righ\\t for \\the neares\\t noun un\\til \\the presence of 讓,令 or 使, and consider i\\t as \\the objec\\t. Please no\\te \\tha\\t \\the bracke\\ted nouns in \\the rules are op\\tional. The de\\tec\\ted subjec\\t, verb, and objec\\t form \\the cause even\\t. An example is given in (1):  (1) [P]伊拉克細菌武器秘密的曝光 ,使 [E]聯合國大為[K]震驚震驚震驚震驚 。","“The reveal of Iraq's secre\\t bac\\teriological weapons shocked \\the Uni\\ted Na\\tions.”  Rule 2: i) E(F) + 對‘preposi\\tion’(F) + P(F) + K(F) ii) E = \\the neares\\t Na/Nb/Nc/Nh before對 in F iii) P = \\the neares\\t N+N+V/V+N/V+的+N/N+之+N before K in F (2) [E]國際間對 [P]北韓糧荒之嚴重深感[K]震驚震驚震驚震驚 。","“The in\\terna\\tional communi\\ty was deeply shocked by serious food shor\\tages in Nor\\th","Korea.”  Rule 3: i) E(F) + K(F) + 於‘preposi\\tion’(F) + P(F) ii) E = \\the neares\\t Na/Nb/Nc/Nh before K in F iii) P = \\the neares\\t N+V+N af\\ter於 in F (3) 當[E]我還[K]震驚震驚震驚震驚於 [P]自己那絲毫不加思索的鐵定回答,又被他的一聲奚笑,擊得啞","口無言 。","“While I was s\\till shocked by my own firm answer, his laugh\\ter made me speechless.”  Rule 4: i) K(F) + E(F) + 的 ‘possession’(F) + P(F) ii) E = \\the neares\\t Na/Nb/Nc/Nh af\\ter K in F iii) P = \\the neares\\t N+V+N/N+的+N af\\ter的 in F (4) 一九七九年 ,台灣爆發了[K]震驚震驚震驚震驚 [E]海內外的 [P]「 美麗島事件 」 。","“In 1979, ‘Formosa Inciden\\t’ broke ou\\t in Taiwan, which shocked wi\\thin and abroad \\the","coun\\try.”  Rule 5: i) P(B) + K(F) + E(F) ii) E = \\the neares\\t Na/Nb/Nc/Nh af\\ter K in F iii) P = \\the neares\\t (N)+V+(N) before K in B (5) [P]這個怪異的情景立刻 [K]震驚震驚震驚震驚了[E]全市民...","“The bizarre scene shocked \\the whole communi\\ty a\\t once...”"," Rule 6: i) P(B) + E(F) + K(F) ii) E = \\the neares\\t Na/Nb/Nc/Nh before K in F iii) P = \\the neares\\t N+V+N before K in B (6) [P]金帝完顏亮南侵 ,[E]宋朝廷[K]震驚震驚震驚震驚 ,一時群情激憤 。","“Emperor Jin, Wanyan \\fiang, invaded \\the sou\\th, Song cour\\t was shocked and enraged.” 349      "]},{"title":"4.2 Ji\\tgya","paragraphs":["Rule 1: i) 令/使/讓/教‘\\to cause’(F) + E(F) + K(F) + P(F) ii) E = \\the neares\\t Na/Nb/Nc/Nh af\\ter令 in F iii) P = \\the neares\\t N+V+N af\\ter K in F/A (7) 但令 [E]人[K]驚訝驚訝驚訝驚訝的是 ,[P]那位老人居然不識字 。","“Bu\\t wha\\t is surprising is \\tha\\t \\the old man is ac\\tually illi\\tera\\te.”  Rule 2: i) E(F) + K(F) + 的是‘is \\tha\\t’+ P(F) ii) E = \\the neares\\t Na/Nb/Nc/Nh before K in F iii) P = \\the neares\\t N+V+N af\\ter的是 in F/A (8) [E]我[K]驚訝驚訝驚訝驚訝的是 ,[P]居然有候選人以這種方式來合理化對女性參政的歧視。","“I was surprised \\tha\\t \\there were candida\\tes who ra\\tionalized \\the discrimina\\tion agains\\t","women in poli\\tics in \\this way.”  Rule 3: i) E(F) + K(F) + 發現‘\\to find’(F) + P(F) ii) E = a: \\the neares\\t Na/Nb/Nc/Nh before K in F; b: \\the firs\\t Na/Nb/Nc/Nh in B iii) P = \\the neares\\t Na/Nb/Nc/Nh af\\ter發現 in F (9) [E]他[K]驚訝驚訝驚訝驚訝的發現 [P] 所有的人都在談亞洲。","“He was surprised \\to find \\tha\\t all \\the people were \\talking abou\\t Asia.”  Rule 4: i) E(F) + 對‘preposi\\tion’(F) + P(F) + K(F) ii) E = \\the neares\\t Na/Nb/Nc/Nh before對 in F iii) P = \\the neares\\t N+V+N/N+的+N af\\ter對 in F (10) [E]他對 [P]謠言散布之快感到[K]驚訝驚訝驚訝驚訝 。","“He was surprised by \\the fas\\t spreading of rumors.”  Rule 5: i) P(B) + E(F) + K(F) ii) E = \\the neares\\t Na/Nb/Nc/Nh before K in F iii) P = \\the neares\\t N+V+N before K in B (11) 可能[P]我在囗氣上有明顯的不是之處 ,使[E]對方頓感[K]驚訝驚訝驚訝驚訝 和困惑。","“Perhaps I sounded rude so \\tha\\t s/he was surprised and puzzled.”"]},{"title":"4.3 Kuaile","paragraphs":["Rule 1: i) E(B) + P(B) + K(F) ii) E = \\the firs\\t Na/Nb/Nc/Nh in B iii) P = \\the neares\\t (N)+V+N before K in B (12) [E]我[P]聽到音樂的那一剎那 ,心裡很[K]快樂快樂快樂快樂 。","“The momen\\t \\tha\\t I heard \\the music, I fel\\t very happy.”  Rule 2: i) P(B) + E(F) + K(F) ii) E = \\the neares\\t Na/Nb/Nc/Nh before K in F iii) P = \\the neares\\t (N)+V+N before K in B 350       (13) 一 [P]看到爸爸的笑容,[E]我心裡就很[K]快樂快樂快樂快樂。","“When I saw my fa\\ther's smile, I was very happy.”"," Rule 3: i) E(F) + K(F) + P(A) ii) E = \\the neares\\t Na/Nb/Nc/Nh before K in F iii) P = \\the neares\\t N+V+N af\\ter K in A (14) [E]老鷹很[K]快樂快樂快樂快樂 ,因為[P]他的孩子會飛了 。","“The eagle was very happy, because his children could fly.”",""]},{"title":"4.4 Gaoxi\\tg","paragraphs":["Rule 1: i) E(B/F) + K(F) + 的是/能/有/看/見/聽/來/收 ‘is \\tha\\t/can/\\to have/\\to see/\\to see/\\to hear/\\to","come/\\to receive’ (F) + P(F) ii) E = \\the neares\\t Na/Nb/Nc/Nh before K in B/F iii) P = \\the neares\\t (N)+(V)+N af\\ter的是/能/看/見/聽/來/收有 in F (15) [E]我實在太 [K] 高興高興高興高興了,能[P]贏得這個獎讓我備感光榮!","“I am very happy \\tha\\t I could win \\this award which I feel honoured.”  Rule 2: i) E(F) + K(F) + P(F) ii) E = \\the neares\\t Na/Nb/Nc/Nh before K in F iii) P = \\the neares\\t (N)+V+N af\\ter K in F (16) [E]我們很[K] 高興高興高興高興 [P]創刊號終於發行了。","“We are very happy \\tha\\t \\the firs\\t issue was finally released.”  Rule 3: i) E(B) + P(B) + K(F) ii) E = \\the firs\\t Na/Nb/Nc/Nh in B iii) P = \\the neares\\t (N)+V+N before K in B (17) [E]農夫[P]聽到這句話 ,心裡非常[K]高興高興高興高興 。","“When \\the farmer heard \\this, he was very happy.”  Rule 4: i) P(B) + E(F) + K(F) ii) E = \\the neares\\t Na/Nb/Nc/Nh before K in F iii) P = \\the neares\\t N+V+N before K in B (18) [P]他們給我一條肉乾做獎品 。[E]父親[K]高興高興高興高興極了。","“They gave me a piece of dried mea\\t as \\the prize. My fa\\ther was very happy.”"]},{"title":"5 Cause E\\be\\tt Features","paragraphs":["On \\top of iden\\tifying \\the posi\\tion and \\the syn\\tac\\tic s\\truc\\ture of \\the cause of an emo\\tion, i\\t is significan\\t \\to examine how \\the cause affec\\ts \\the experiencer of \\the emo\\tion. In order \\to do so, we give an in-dep\\th analysis of causes based on i\\ts degree of \\transi\\tivi\\ty (\\fee and Huang 2009)."]},{"title":"5.1 Tra\\tsiti\\bity of Causes","paragraphs":["Transi\\tivi\\ty is \\tradi\\tionally unders\\tood \\to be a proper\\ty of verbs \\tha\\t de\\termines whe\\ther or no\\t a verb can \\take direc\\t objec\\ts. This is of\\ten classified as \\transi\\tive verbs such as kick and b\\tat \\tha\\t \\take a direc\\t objec\\t, and in\\transi\\tive verbs such as c\\fy and sl\\t\\tp \\tha\\t canno\\t \\take a direc\\t 351       objec\\t. However, \\transi\\tivi\\ty is some\\times considered \\to be a con\\tinuum ra\\ther \\than a binary ca\\tegory. This approach \\takes in\\to accoun\\t \\the degree \\to which an ac\\tion affec\\ts i\\ts objec\\t. For example, \\the verb h\\ta\\f is described as having \"lower \\transi\\tivi\\ty\" \\than \\the verb hit.","Ins\\tead of simply focusing on \\the presence of an objec\\t of \\the verb, Hopper and Thompson (1980) argue \\tha\\t \\transi\\tivi\\ty involves a number of componen\\ts. They iden\\tify \\the \\ten parame\\ters \\tha\\t de\\termine \\the \\transi\\tivi\\ty of a sen\\tence, as shown in Table 3:"," Table 3: Transi\\tivi\\ty Parame\\ters Cri\\terion High Transi\\tivi\\ty \\fow Transi\\tivi\\ty A. Par\\ticipan\\ts 2 or more, agen\\t and objec\\t 1 par\\ticipan\\t B. Kinesis Ac\\tion Non-ac\\tion C. Aspec\\t Telic A\\telic D. Punc\\tuali\\ty Punc\\tual Non-punc\\tual E. Voli\\tionali\\ty Voli\\tional Non-voli\\tional F. Affirma\\tion Affirma\\tive Nega\\tive G. Mode Realis Irrealis H. Agency A high in po\\tency A low in po\\tency I. Affec\\tedness of Objec\\t To\\tally affec\\ted No\\t affec\\ted J. Individua\\tion of Objec\\t Highly individua\\ted Non-individua\\ted  The \\ten parame\\ters de\\termine whe\\ther an ac\\tion is \\transferred from an agen\\t \\to a pa\\tien\\t. To","give an in-dep\\th analysis of \\the causes based on i\\ts degree of \\transi\\tivi\\ty, we specifically focus","on \\the \\three componen\\ts of causes, namely ag\\t\\btivity, ki\\b\\tsis, and pa\\fticipatio\\b, wi\\th some","modifica\\tions. The agen\\tivi\\ty of \\the subjec\\t of \\the cause even\\t shows \\the in\\ten\\tion of \\the subjec\\t \\to affec\\t","\\the experiencer. We iden\\tify \\the subjec\\t of \\the cause even\\t as one of \\the \\two basic pro\\to\\typical","role \\types, namely Agen\\t-Pro\\to role or Pa\\tien\\t-Pro\\to role, according \\to a lis\\t of Pro\\to-role","proper\\ties proposed by Dow\\ty (1991). Dow\\ty (1991) argues \\tha\\t role \\types are no\\t discre\\te","ca\\tegories; ins\\tead, argumen\\ts may have differen\\t degree of membership in a role \\type. Hence,","he believes \\tha\\t i\\t is efficien\\t \\to have only \\two role \\types \\to describe argumen\\t selec\\tion, which","are Pro\\to-Agen\\t and Pro\\to-pa\\tien\\t. The Pro\\to-Agen\\t and Pro\\to-pa\\tien\\t argumen\\t roles have","differen\\t lis\\t of con\\tribu\\ting proper\\ties, as given in (19) and (20).  (19) Con\\tribu\\ting Proper\\ties for \\the Agen\\t Pro\\to-Role:","a. voli\\tional involvemen\\t in \\the even\\t or s\\ta\\te","b. sen\\t[i]ence (and/or percep\\tion)","c. causing an even\\t or change of s\\ta\\te in ano\\ther par\\ticipan\\t","d. movemen\\t (rela\\tive \\to \\the posi\\tion of ano\\ther par\\ticipan\\t)","e. (exis\\ts independen\\tly of \\the even\\t named by \\the verb)","","(20) Con\\tribu\\ting Proper\\ties for \\the Pa\\tien\\t Pro\\to-Role: a. undergoes change of s\\ta\\te b. incremen\\tal \\theme c. causally affec\\ted by ano\\ther par\\ticipan\\t d. s\\ta\\tionary rela\\tive \\to movemen\\t of ano\\ther par\\ticipan\\t e. (does no\\t exis\\t independen\\tly of \\the even\\t, or no\\t a\\t all)  The subjec\\t of \\the cause is considered more agen\\t-like or pa\\tien\\t-like according \\to \\the number of Agen\\t or Pa\\tien\\t Pro\\to-role proper\\ties \\they fulfill. The more agen\\t-like \\the subjec\\t is, \\the higher in\\ten\\tion \\the subjec\\t is \\to affec\\t \\the experiencer. 352      ","Kinesis refers \\to whe\\ther \\the cause even\\t is an ac\\tion or non-ac\\tion. Ac\\tions can be \\transferred from one par\\ticipan\\t \\to ano\\ther, \\therefore, an ac\\tion cause even\\t is more likely \\to direc\\tly affec\\t \\the experiencer. Non-ac\\tion even\\ts, on \\the o\\ther hand, \\tend \\to affec\\t \\the experiencer more indirec\\tly.","Par\\ticipa\\tion indica\\tes whe\\ther \\the experiencer is involved in \\the cause even\\t. We examine whe\\ther \\the experiencer of \\the emo\\tion is one of \\the par\\ticipan\\ts of \\the cause even\\t."]},{"title":"5.2 Results a\\td A\\talysis","paragraphs":["A summary of \\the cause fea\\ture \\tendency of each emo\\tion is presen\\ted in Tables 4 and 5:  Table 4: Dis\\tribu\\tional Tendency of Cause Fea\\tures of Change-of-S\\ta\\te Emo\\tion Verbs Agen\\tivi\\ty Kinesis Par\\ticipa\\tion Emo\\tions Pro\\to-agen\\t Pro\\to-pa\\tien\\t Mo\\tion Non-mo\\tion \\bes No Gaoxing 高興 * (high) * * Jingya 驚訝 * (low) * *  Table 5: Dis\\tribu\\tional Tendency of Cause Fea\\tures of Homogeneous Emo\\tion Verbs Agen\\tivi\\ty Kinesis Par\\ticipa\\tion Emo\\tions Pro\\to-agen\\t Pro\\to-pa\\tien\\t Mo\\tion Non-mo\\tion \\bes No Kuaile 快樂 * (high) * * Zhenjing 震驚 * (low) * *","","As shown in Tables 4 and 5, we find \\tha\\t \\there are some correla\\tions be\\tween \\the \\types of emo\\tions and \\the cause fea\\tures. Bo\\th gaoxi\\bg and kuail\\t \\tend \\to have pro\\to-agen\\t subjec\\ts wi\\th high agen\\tivi\\ty in \\the cause even\\t. They also \\tend \\to involve mo\\tion even\\ts. In addi\\tion, \\the emo\\tion experiencers usually par\\ticipa\\te in \\the cause even\\ts. Same as verbs of happi\\b\\tss, ji\\bgya and zh\\t\\bji\\bg mos\\tly have pro\\to-agen\\t subjec\\ts in \\the cause even\\ts, however, \\they are usually associa\\ted wi\\th low agen\\tivi\\ty subjec\\ts. In addi\\tion, \\the causes of bo\\th ji\\bgya and zh\\t\\bji\\bg \\tend \\to involve non-mo\\tion even\\ts, and \\the experiencers do no\\t usually par\\ticipa\\te in \\the cause even\\ts.","As for \\the emo\\tion verb \\types, i.e. change-of-s\\ta\\te vs. homogeneous verbs, \\the resul\\ts show no difference for bo\\th happi\\b\\tss and su\\fp\\fis\\t. This indica\\tes \\tha\\t \\the emo\\tion classes (happi\\b\\tss vs. su\\fp\\fis\\t) override \\the emo\\tion verb \\types (change-of-s\\ta\\te verb vs. homogeneous verb) in \\terms of cause even\\t fea\\tures. The resul\\ts allow us \\to rewri\\te \\the rules in Sec\\tion 4 by incorpora\\ting \\the cause even\\t fea\\tures in (21), and an example of \\the revised rule for zh\\t\\bji\\bg is given in (22):  (21) Cause Even\\t Fea\\tures Happiness: P (gaoxi\\bg) = [+agen\\t, +mo\\tion, +par\\ticipa\\tion] P (kuail\\t) = [+agen\\t, +mo\\tion, +par\\ticipa\\tion] Surprise: P (zh\\t\\bji\\bg) = [+agen\\t, -mo\\tion, -par\\ticipa\\tion] P (kuail\\t) = [+agen\\t, -mo\\tion, -par\\ticipa\\tion]  (22) Zh\\t\\bji\\bg Rule 1: 353       i) P (B/F) + 讓/令/使‘\\to cause’(F) + E(F) + K(F) ii) E = \\the neares\\t Na/Nb/Nc/Nh af\\ter讓/令/使 in F iii) P = \\the neares\\t (N)+V+(N) [+agen\\t, -mo\\tion, -par\\ticipa\\tion] before 讓/令/使 in F/B"]},{"title":"6 Co\\tclusio\\t a\\td Future Work","paragraphs":["In \\this paper, we provide some concre\\te linguis\\tic rules in iden\\tifying \\the impor\\tan\\t elemen\\ts of an emo\\tion (happi\\b\\tss and su\\fp\\fis\\t), which are \\the experiencer and \\the cause. These rules can be very useful for emo\\tion de\\tec\\tion and classifica\\tion. For example, a rule-based sys\\tem can be developed using \\these rules; or \\the value of each rule serves as a fea\\ture in a s\\ta\\tis\\tical sys\\tem. I\\t is very common \\tha\\t an emo\\tion is expressed wi\\thou\\t an emo\\tion keyword in web da\\ta, such as web blog and online cha\\t. The possible way \\to de\\tec\\t emo\\tions in \\this kind of da\\ta is \\to rely on \\the de\\tec\\tion of \\the cause even\\ts in \\the con\\tex\\ts.","We also examine \\the fea\\tures of a cause even\\t according \\to i\\ts degree of \\transi\\tivi\\ty, namely agen\\tivi\\ty, kinesis, and even\\t par\\ticipa\\tion. We find \\tha\\t \\the emo\\tion classes (happi\\b\\tss vs. su\\fp\\fis\\t) override \\the emo\\tion verb \\types (change-of-s\\ta\\te verb vs. homogeneous verb) in \\terms of cause even\\t fea\\tures. In order \\to au\\toma\\tically de\\tec\\t cause even\\ts based on \\these \\three fea\\tures, more work need \\to be done, for ins\\tances, providing a verb lis\\t \\tha\\t \\takes a mo\\tion even\\t, iden\\tifying \\the seman\\tic roles of \\the nouns using a seman\\tic parser, e\\tc."]},{"title":"Refere\\tces","paragraphs":["Chang, \\f. \\f., K. J. Chen, and C. R. Huang. 2000. Al\\terna\\tion Across Seman\\tic Field: A S\\tudy of Mandarin Verbs of Emo\\tion. In \\bung-O Biq. (Ed.) Special Issue on Chinese Verbal Seman\\tics. Computatio\\bal Li\\bguistics a\\bd Chi\\b\\ts\\t La\\bguag\\t P\\foc\\tssi\\bg. 5.1.61-80.","Chen, \\b., S. \\b. M. \\fee and C. R. Huang. 2009. A Cogni\\tive-based Anno\\ta\\tion Sys\\tem for Emo\\tion Compu\\ting. Th\\t Thi\\fd Li\\bguistic A\\b\\botatio\\b Wo\\fkshop (Th\\t LAW III), AC\\f 2009. Singapore.","Dow\\ty, D. 1991. Thema\\tic Pro\\to-Roles and Argumen\\t Selec\\tion. La\\bguag\\t, Vol. 67, 3:547-619.","Frijda, N. H. 1986. Th\\t Emotio\\bs. Maison des Sciences de l'Homme and Cambridge Universi\\ty Press.","Harkins, J. and A. Wierzbicka (eds.), 2001. Emotio\\bs i\\b C\\fossli\\bguistic P\\t\\fsp\\tctiv\\t, Mou\\ton de Gruy\\ter, Berlin, New \\bork.","Hopper, P. J. and S. A. Thompson. 1980. Transi\\tivi\\ty in Grammar and Discourse. La\\bguag\\t 56, 251-299.","\\fee, S. \\b. M. and C. R. Huang. 2009. A \\finguis\\tic Seman\\tic Analysis of Cause Even\\ts of Emo\\tions. Th\\t 10th","Chi\\b\\ts\\t L\\txical S\\tma\\btics Wo\\fkshop. \\ban\\tai.","Or\\tony, A. and T. J. Turner. 1990. Wha\\t's Basic abou\\t Basic Emo\\tions? Psychological R\\tvi\\tw, 97: 315-331","Plu\\tchik, R. 1980. A general psychoevolu\\tionary \\theory of emo\\tion. In R. Plu\\tchik & H. Kellerman (Eds.), Emotio\\b: Th\\to\\fy, \\f\\ts\\ta\\fch, a\\bd \\txp\\t\\fi\\t\\bc\\t: Vol. 1. Th\\to\\fi\\ts of \\tmotio\\b (pp. 3–33). New \\bork: Academic.","Sauri, R. J. \\fi\\t\\tman, B. Knippen, R. Gaizauskas, A. Se\\tzer, and J. Pus\\tejovsky. 2006. Tim\\tML A\\b\\botatio\\b Guid\\tli\\b\\ts. Version 1.2.1.","Turner, J. H. 2000. O\\b th\\t O\\figi\\bs of Huma\\b Emotio\\bs: A Sociological I\\bqui\\fy i\\bto th\\t Evolutio\\b of Huma\\b Aff\\tct. S\\tanford: S\\tanford Universi\\ty Press.","Weiss, H. M. and R. Cropanzano. 1996. Affec\\tive even\\ts \\theory: A \\theore\\tical discussion of \\the s\\truc\\ture, causes and consequences of affec\\tive experiences a\\t work. In B. M. S\\taw & \\f. \\f. Cummings (Eds.), R\\ts\\ta\\fch I\\b O\\fga\\bizatio\\bal B\\thavio\\f, Vol. 19: 1-74. Greenwich, CT: JAI Press.","Wierzbicka, A. 1996. S\\tma\\btics: P\\fim\\ts a\\bd U\\biv\\t\\fsals. Oxford: Oxford Universi\\ty Press. 354"]}]}