{"sections":[{"title":"An Expe\\b\\tment\\fl Synt\\fct\\tc Study of B\\tnd\\tng: A C\\fse Study of Ko\\be\\fn Long-D\\tst\\fnce An\\fpho\\b caki ∗∗∗∗ ","paragraphs":["Ji-Hye \\bi\\ta an\\f Ja\\tes H. Yoonb ","a","Depart\\tent of English Literature an\\f Language, Sung\\byunkwan University,","Myongruyn\\fong 3-53, Chongno-gu, Seoul, South \\borea","jki\\t38ster@g\\tail.co\\t","b Depart\\tent of Linguistics, University of Illinois at Urbana-Cha\\tpaign, 4080 FLB, 707 South Mathews Ave, Urbana, IL 61801, U.S.A.","jyoon@illinois.e\\fu Abst\\b\\fct. This stu\\fy investigates the bin\\fing behavior of the \\borean anaphor ‘caki’, which has been regar\\fe\\f thus far as a long-\\fistance anaphor (LDA). However, given that even local anaphors can be boun\\f long-\\fistance when they function as exe\\tpt anaphors in certain languages (Pollar\\f an\\f Sag 1992; \\bi\\t an\\f Yoon 2009), we investigate\\f the bin\\fing behavior of LD-boun\\f ‘caki’, in or\\fer to \\feter\\tine whether LD-boun\\f ‘caki’ \\fiffers fro\\t LD-boun\\f ‘caki-casin’. In the experi\\tent, subjects were require\\f to rate the acceptability of \\borean sentences representing various types of LD bin\\fing of ‘caki’ an\\f to \\feter\\tine whether the sloppy or the strict rea\\fing was \\tore pro\\tinent in elliptical VPs containing the anaphor. The results are \\fiscusse\\f with respect to the typology of LDAs propose\\f by Cole, Her\\ton an\\f Huang (2001). Keywo\\bds: long-\\fistance (LD) bin\\fing, \\borean bin\\fing, anaphor bin\\fing, bin\\fing of ‘caki’, strict vs. sloppy rea\\fing, VP ellipsis, logophoricity, exe\\tpt bin\\fing \\s \\s ∗ Acknowle\\fg\\tents: This stu\\fy is a part of a \\fissertation project supporte\\f by National Science Foun\\fation (NSF)","\\fissertation grant (ID# 0616432).  Copyright 2009 by Ji-Hye \\bi\\t an\\f Ja\\tes H. Yoon "]},{"title":"1 Int\\boduct\\ton","paragraphs":["Pollar\\f an\\f Sag (1992) an\\f Reinhart an\\f Reulan\\f (1993) argue\\f that local anaphors can be LD-boun\\f or be unboun\\f in certain contexts as shown in (1). In sentences shown below, the English local anaphor hims\\b\\tf is boun\\f outsi\\fe the \\tini\\tal GC (cf. 1a, 1b) or unboun\\f (cf. 1c) an\\f yet the sentences are acceptable."," (1) a. Bill re\\te\\tbere\\f that [the Ti\\tes ha\\f printe\\f [a picture of hims\\b\\tf] in its Sun\\fay e\\fition].","b. John thinks that [an article written by hims\\b\\tf] cause\\f the uproar.","c. [Physicist like y\\furs\\b\\tf] are a go\\fsen\\f.","\\f. [Incri\\tinating pictures of hims\\b\\tf] worry Bill.","","The above researchers posit a \\fistinction between c\\fr\\b or grammatica\\t bin\\fing on the one han\\f an\\f \\bx\\bmpt or \\t\\fg\\fph\\fric bin\\fing on the other to explicate how local anaphors can so\\teti\\tes occur in structures where the core constraints on anaphor bin\\fing—locality an\\f cco\\t\\tan\\f—are see\\tingly violate\\f. The proposal that these researchers \\take is that not all anaphors are license\\f gra\\t\\tar-internally. Anaphors that are license\\f gra\\t\\tar-internally are calle\\f c\\fr\\b/grammatica\\t anaph\\frs, while anaphors license\\f by extra-gra\\t\\tatical \\techanis\\ts 250 23rd Pacific Asia Conference on Language, Information and Computation, pages 250–259 ","are categorize\\f as \\bx\\bmpt anaph\\frs/\\t\\fg\\fph\\frs. In the theory of Pollar\\f & Sag (1992), an","anaphor is exe\\tpt when it \\foes not have a \\tore pro\\tinent co-argu\\tent in its argu\\tent","structure. However, in the presence of such a co-argu\\tent, the anaphor \\tust be boun\\f","gra\\t\\tar-internally as a core anaphor. The brackete\\f NPs within which anaphors occur in (1)a-","\\f above \\fo not contain a \\tore pro\\tinent co-argu\\tent (i.e., the Possessor), an\\f hence, the","anaphor is license\\f as an exe\\tpt anaphor, free\\f fro\\t the constraints on core bin\\fing. More generally, exe\\tpt anaphors \\fisplay a cluster of properties that \\fistinguish the\\t fro\\t","core anaphors, which inclu\\fe the following:  (2) a. Exe\\tpt anaphors \\tay be unboun\\f or \\fiscourse-boun\\f (cf. 1c). b. Exe\\tpt anaphors \\fo not nee\\f c-co\\t\\tan\\fing antece\\fents (cf. 1\\f). c. Exe\\tpt anaphors \\tay take antece\\fents outsi\\fe the local \\fo\\tain (the Governing Category) for local bin\\fing (cf. 1a,b). \\f. Exe\\tpt anaphors allow strict rea\\fings in VP ellipsis contexts.  The sloppy-strict a\\tbiguity (cf. 2\\f) was e\\tploye\\f as another \\fiagnostic of the core-exe\\tpt","\\fistinction in Huang & Liu (2001).1","This is pre\\ficate\\f on the observation that elliptical VPs2","","containing core anaphors are pre\\fo\\tinantly interprete\\f sloppily, whereas those containing","exe\\tpt anaphors allow strict rea\\fings. For exa\\tple, in (3a), the anaphor hims\\b\\tf is a core","anaphor since it is boun\\f within the local GC. The elliptical VP ‘\\fi\\f so, too’ is interprete\\f","sloppily (i.e. as \\teaning ‘Bill \\fefen\\fe\\f Bill’). The strict rea\\fing is highly \\targinal, if available","at all . On the other han\\f, in case of exe\\tpt bin\\fing shown in (3b), the strict rea\\fing (i.e. Bill","thinks that an article written by John...) is \\tuch easier to obtain for the elliptical VP, an\\f \\tay","in\\fee\\f be \\tore pro\\tinent than the sloppy rea\\fing.  (3) a. John \\fefen\\fe\\f hims\\b\\tf against the co\\t\\tittee’s accusations. Bi\\t\\t did s\\f, t\\f\\f (=Bill \\fefen\\fe\\f B\\tll >*?John...). b. John thinks that an article written by hims\\b\\tf cause\\f the uproar. Bi\\t\\t d\\f\\bs s\\f, t\\f\\f (= Bill thinks that an article written by John >Bill...).  While exe\\tpt anaphors can escape the strictures of syntactic con\\fitions that constrain core","anaphors, their licensing is nevertheless subject to \\fiscourse-prag\\tatic con\\fitions known as","\\t\\fg\\fph\\fricity (Sells 1987, Huang an\\f Liu 2001). Antece\\fents of exe\\tpt anaphors are opti\\tal","if they can be associate\\f with a logophoric role. In Sells (1987), three logophoric roles are","intro\\fuce\\f--Source, Self, an\\f Pivot--with the following characterizations.  (4) Logophoric roles (Sells 1987): SOURCE: the agent co\\t\\tunicating the propositional content SELF: one whose \\tental state or attitu\\fe the content of the proposition \\fescribes PIVOT: one with respect to whose (space-ti\\te) location the content of the proposition is","evaluate\\f  Researchers investigating logophoricity have further\\tore argue\\f that there is canonical","hierarchy of logophoric roles. SOURCE is \\tore canonical than the other two roles, while","PIVOT is less canonical than SELF or SOURCE (Sells 1987, Huang & Liu 2001). This is","reflecte\\f in the ease with which antece\\fents of logophoric anaphors can be license\\f. For","exa\\tple, exe\\tpt anaphors are \\tore easily license\\f by SOURCE antece\\fents than by PIVOTs. \\s \\s 1 Runner et al. (2002) verifie\\f this \\fiagnostic in their e\\tpirical experi\\tental stu\\fy. 2 We \\fo not \\fistinguish between VPs that are elliptical an\\f those that contain pro-for\\ts, referring to both as","‘elliptical’, so\\tewhat \\tislea\\fingly. In \\borean, there is no VP-ellipsis per se, but there is a VP pro-for\\t. The","strict-sloppy a\\tbiguity is observe\\f in both ellipsis an\\f pro-for\\ts, as is well-known. 251","Since exe\\tpt bin\\fing has been investigate\\f \\tostly for English, a language that \\foes not have genuine LDAs, questions such as whether a language like \\borean, which possesses \\tultiple anaphors (i.e., the long-\\fistance anaphor ‘caki’ as well as local anaphors such as ‘caki-casin’ – \\bang 1998), still allows local anaphors to be license\\f as exe\\tpt anaphors naturally arise. \\bi\\t & Yoon (2006, 2009) investigate\\f this question with the \\borean local anaphor ‘caki-casin’ an\\f foun\\f that native speakers of \\borean allow the local anaphor ‘caki-casin’ to be LD-boun\\f in contexts known to license exe\\tpt anaphors in English. When LD boun\\f, ‘caki-casin’ showe\\f a strong preference for the strict rea\\fing in VP-ellipsis contexts, i\\tplying that the speakers treate\\f LD-boun\\f ‘caki-casin’ as an exe\\tpt anaphor. Finally, the \\fegree of well-for\\te\\fness of the exe\\tpt bin\\fing reflecte\\f the Sells (1987)’s canonical hierarchy of logophoric roles, in that bin\\fing of ‘caki-casin’ by a logophoric SOURCE got the highest acceptability rating, while that by a PIVOT antece\\fent got a \\tuch lower rating.","The results of \\bi\\t an\\f Yoon (2009) invite further questions. If the local anaphor ‘caki-casin’ can be boun\\f as LD an exe\\tpt anaphor, satisfying logophoric con\\fitions, what are the properties of genuine LDAs (such as ‘caki’) when they are LD boun\\f? Do the anaphors which have been treate\\f as LDA’s behave \\fifferently fro\\t the local anaphor ‘caki-casin’ when the latter is LD-boun\\f? Are genuine LDAs also sensitive to logophoric factors when they are boun\\f by LD antece\\fents?","The present stu\\fy seeks to investigate whether the interpretations that speakers assign to this anaphor \\fiffers syste\\tatically fro\\t those that native speakers assign to ‘caki-casin’ when it is boun\\f LD as an exe\\tpt anaphor.3 The specific research questions a\\f\\fresse\\f in the present stu\\fy are the following:  1) Does LD-boun\\f ‘caki’ behave \\fifferently fro\\t LD-boun\\f exe\\tpt anaphor ‘caki-casin’? 2) Does LD-boun\\f ‘caki’ show sensitivity to logophoric factors? "]},{"title":"2 The Study 2.1 Hypothes\\ts \\fnd P\\bed\\tct\\tons","paragraphs":["Before presenting the e\\tpirical stu\\fy, we nee\\f to \\fiscuss the theoretical backgroun\\f of the paper. The \\tost refine\\f typology of LDAs to \\fate that also incorporates the core-exe\\tpt \\fistinction is Cole, Her\\ton an\\f Huang (2001, 2006). Therefore, we will atte\\tpt to interpret the results of the e\\tpirical stu\\fy in light of the proposal \\ta\\fe by these researchers.","Cole et al. propose a three-way typology of LDAs. The first type of LDA, or Type I LDA, is a core anaphor that is boun\\f in a larger \\fo\\tain than a local anaphor.4","They clai\\t that LDAs in languages like \\banna\\fa an\\f Hin\\fi-Ur\\fu are of this type. Type I LDA is characterize\\f by the following properties: 1) The antece\\fent \\tust c-co\\t\\tan\\f the LDA; 2) The antece\\fent \\tust be clause-internal; 3) Sloppy rea\\fings are require\\f an\\f/or preferre\\f in VP ellipsis contexts. That is, except for being boun\\f in a larger \\fo\\tain than local (core) anaphors, these LDAs \\tust be boun\\f gra\\t\\tar-internally. Their status as core anaphor is verifie\\f by the pre\\fo\\tinance of sloppy interpretation in VP ellipsis.","Type II LDAs are anaphoric expressions that represent a for\\t neutral between anaphor an\\f pronoun. This class of anaphors is foun\\f in Malay an\\f Turkish an\\f shows the following characteristics: 1) The anaphor nee\\f not have a c-co\\t\\tan\\fing antece\\fent; 2) The LDA can have a \\fiscourse antece\\fent; 3) Both sloppy an\\f strict rea\\fings are allowe\\f in VP ellipsis. Crucially, these properties characterize Type II LDAs in both local an\\f LD bin\\fing. \\s \\s 3 The subjects teste\\f for the present stu\\fy are \\fifferent fro\\t those who took part in \\bi\\t an\\f Yoon (2006, 2009). 4 That is, if we take the TSC an\\f SSC to be operative in \\fefining the GC for local anaphors, the GC for Type I","LDA \\tight involve the suspension of TSC an\\f/or SSC. 252 ","Type III LDAs are pri\\tarily local anaphors, but which can be converte\\f to a pronoun-like (exe\\tpt/logophoric) usage in specific syntactic or \\fiscourse contexts. Anaphors like Icelan\\fic LDA in subjunctive co\\tple\\tents, LD-boun\\f Chinese ‘ziji’ (accor\\fing to Huang an\\f Liu 2001, though not Pollar\\f an\\f Xue 2001) an\\f English exe\\tpt anaphors fall into this category an\\f show the following properties: 1) The LDA nee\\f not have c-co\\t\\tan\\fing antece\\fent; 2) The LDAs have an antece\\fent outsi\\fe the sentence; 3) Both sloppy an\\f strict rea\\fings are allowe\\f in VP ellipsis when the anaphor is LD-boun\\f. However, unlike Type II anaphors, Type III anaphors behave like a core anaphor in a local \\fo\\tain.","\\bi\\t an\\f Yoon (2009) argue\\f that ‘caki-casin’ is a Type III anaphor, by showing that the anaphor allows LD-bin\\fing in contexts known to license exe\\tpt anaphors. LD-boun\\f ‘cakicasin’ was also shown to be sensitive to logophoric factors an\\f to a\\f\\tit strict rea\\fings in VP ellipsis.","The question that we are a\\f\\fressing now is the status of ‘caki’ within the typology set forth by Cole et al. The following hypotheses suggest the\\tselves:","","Hypothes\\ts A: ‘Caki’ is a Type I LDA. In other wor\\fs, it is a core anaphor with a larger GC than ‘caki-casin’ (i.e., neither the TSC nor the SSC \\fefines its GC). If so, it is pre\\ficte\\f to behave in the following way: i) ‘caki’ will require a c-co\\t\\tan\\fing clause-internal antece\\fent while \\fisallowing \\fiscourse antece\\fents; ii) ‘caki’ will show a preference for sloppy rea\\fings in VP-ellipsis contexts; iii) ‘caki’ \\tay not be sensitive to logophoric con\\fitions on the antece\\fent even in LD-bin\\fing, since it is core anaphor.5","These properties are pre\\ficte\\f to hol\\f of ‘caki’ in both local an\\f LD-bin\\fing.","","Hypothes\\ts B: ‘Caki’ is a Type II LDA, a for\\t that is neutral between pronouns an\\f anaphors. If so, i) ‘caki’ will not require c-co\\t\\tan\\fing antece\\fents an\\f allow \\fiscourse antece\\fents; ii) ‘caki’ will not show a preference for either the strict or the sloppy rea\\fing in VP-ellipsis contexts; iii) ‘caki’ \\tay not be sensitive to logophoricity. As with Hypothesis A, these properties are pre\\ficte\\f to hol\\f of ‘caki’ regar\\fless of whether it is LD-boun\\f or locally boun\\f.","","Hypothes\\ts C: ‘Caki’ is a Type III anaphor like ‘caki-casin’, but with a larger core GC than ‘caki-casin’ (i.e. it can violate SSC an\\f TSC, qua a core anaphor). If so, i) ‘caki’ will allow \\fiscourse or non-c-co\\t\\tan\\fing antece\\fents when there is no (potential) c-co\\t\\tan\\fing antece\\fent; ii) ‘caki’ will yiel\\f \\fo\\tinant sloppy rea\\fings in VP ellipsis when its antece\\fent cco\\t\\tan\\fs it, but not when the antece\\fent \\foes not; iii) ‘caki’ \\tay not be sensitive to logophoricity when it is boun\\f by a c-co\\t\\tan\\fing antece\\fent, but \\tay show logophoricity effects when its antece\\fent \\foes not c-co\\t\\tan\\f it.6"," ","\\s \\s","5","Cole et al. \\fo not rule out the possibility that there \\tay be prag\\tatic con\\fitions on core anaphors with a larger GC (Type I LDAs). If that is the case, the applicability of prag\\tatic con\\fitions on LD-boun\\f ‘caki’ will not be \\fecisive in \\feter\\tining which hypothesis is vali\\f.","6","However, see previous note on the relevance of logophoricity to the \\feter\\tination of the core-exe\\tpt \\fistinction. In a\\f\\fition to the three hypotheses given here, there is another possibility—na\\tely, that ‘caki’ is just like ‘cakicasin’. It is pri\\tarily a local anaphor with the sa\\te core GC as ‘caki-casin’ (\\fefine\\f by SSC, but not TSC, since all anaphors in \\borean violate TSC), an\\f is turne\\f into an exe\\tpt anaphor only when it is LD-boun\\f (that is, when it violates SSC). This is essentially the position that Huang an\\f Liu (2001) take with respect to the Man\\farin Chinese LDA ‘ziji’. While we cannot \\fiscount this possibility, it is well-known that while LD-bin\\fing of ‘caki-casin’ is rare, ‘caki’ occurs quite freely with LD antece\\fents (\\bang 1998). If the two are i\\fentical in ter\\ts of their categorization, this \\fifference is har\\f to account for. Despite this \\fifficulty, without a \\firect co\\tparison of the two anaphors in the sa\\te contexts an\\f structures, we cannot rule out this scenario. In\\fee\\f, the results of our stu\\fy, when consi\\fere\\f together with that of \\bi\\t an\\f Yoon (2006, 2009) see\\t to suggest no essential \\fifference between ‘caki’ an\\f ‘caki-casin’. We shall revisit this issue in section 3. 253"]},{"title":"2.2 The Expe\\b\\tment 2.2.1. Method Partici\\ba\\tts","paragraphs":["Thirty native speakers of \\borean resi\\fing in an\\f aroun\\f Seoul, South \\borea (age: 20-50)","participate\\f in the experi\\tent.","","Task\\fa\\td\\fMaterials\\f","The \\tain task was an Acceptability Rating Task using the 5-point Likert scale, couple\\f with a","Preferential Sentence Interpretation Task. Both tests were e\\tploye\\f in \\bi\\t & Yoon (2006,","2009). Each task containe\\f two parts, the first of which aske\\f the participants to rate the \\fegree","of acceptability of a given sentence where ‘caki’ occurs with a long-\\fistance antece\\fent, while","the secon\\f aske\\f the\\t to choose the \\tost salient interpretation (fro\\t a\\tong sloppy, strict an\\f","neither) of a sentence containing VP-ellipsis that i\\t\\te\\fiately follows the sentence they just","rate\\f.","The test \\taterials were co\\tpose\\f of 54 \\borean sentences (39 target ite\\ts an\\f 15 non-","target ite\\ts) illustrating various types of sentences containing LD-boun\\f ‘caki’. Specifically,","the target ite\\ts inclu\\fe\\f sentences with LD-boun\\f ‘caki’ that involve\\f only TSC violations,","those with both SSC an\\f TSC violations, sentences where the LD antece\\fents \\fiffere\\f in ter\\ts","of their logophoric role (SOURCE, SELF, PIVOT an\\f Less Logophoric antece\\fent), sentences","instantiating \\fifferent gra\\t\\tatical relations an\\f structural relationships of antece\\fents vis-à-vis","the anaphor (i.e. c-co\\t\\tan\\fing vs. non-c-co\\t\\tan\\fing antece\\fent, etc).","The sa\\tple sentences exe\\tplifying the \\fifferent logophoric roles of antece\\fents of LD-","boun\\f ‘caki’ are shown in (5).","In (5a), the only possible antece\\fent of the anaphor caki is the \\tatrix subject Inphy\\f, since","the intervening subject ‘the police agency’ is not a possible antece\\fent since it is inani\\tate but","caki requires ani\\tate antece\\fents. The LD antece\\fent Inphy\\f is logophoric SOURCE, since he","is the speaker of the e\\tbe\\f\\fe\\f proposition. The \\tatrix subject Sangh\\f in (5b) an\\f Ch\\b\\tswu in","(5c) serve as antece\\fents of caki, an\\f has the role of SELF in the event \\fescribe\\f, an\\f by being","the one whose point of view is \\fescribe\\f in the proposition (i.e. PIVOT), respectively.  (5) a. LD antece\\fent: SOURCE Inphy\\f-nun [kyengchalcheng -i caki-ka swu\\tki-n cungke\\twul-ul chacanay-Inphyo-top the police.agency-no\\t self-no\\t hi\\fe-rel exhibit–acc fin\\fess-ta]-ko \\talhay-ss-ta past-\\fecl co\\tp say-past-\\fecl ‘Inphyo sai\\f that the Police foun\\f out the exhibit he (self) ha\\f hi\\f\\fen.’  b. LD antece\\fent: SELF Sangh\\f-nun [tongchanghoy \\tey\\tpe-tul-i caki-uy kyelhon nalcca-lul i\\ti Sangho-top alu\\tni.assoc \\te\\tbers-no\\t self-gen we\\f\\fing \\fate-acc alrea\\fy palphyohaypeli–ess-ta]-ko \\tit-ko iss-ta. announce\\f-co\\tp believe-\\fecl ‘Sangho believes that the alu\\tni association alrea\\fy announce\\f his (self’s) we\\f\\fing \\fate.’  c. LD antece\\fent: PIVOT [Chelswu-ka caki-\\tu\\t chaca o-ass-ul ttay], Y\\bnghi-nun (pr\\f -ul) \\taywu Chelswu-no\\t self-acc seek-co\\te-rel when Yenghi-top (Chelswu-acc) very pankapkey \\tac-a cwu-ess-ta. gla\\fly greet-pst-\\fecl. ‘When Chelswu ca\\te to see her (= self, Yenghi), Yenghi greete\\f (Chelswu) very gla\\fly.’ 254   \\f. LD antece\\fent: less logophoric [Chelswu-ka caki-\\tu\\t chaca ka-ss-ul ttay], Y\\bnghi-nun (pr\\f -ul) \\taywu Chelswu-no\\t self-acc seek-went-rel when Yenghi-top (Chelswu-acc) very pankapkey \\tac-a cwu-ess-ta. gla\\fly greet-pst-\\fecl. ‘When Chelswu went to see her (= self, Yenghi), Yenghi greete\\f (Chelswu) very gla\\fly.’  Exa\\tples in (5c) an\\f (5\\f) nee\\f further clarification. Sentences containing PIVOT","antece\\fents were constructe\\f following Sells (1987), who use\\f \\firectional auxiliaries \\f-ta","‘co\\te’ an\\f ka-ta ‘go’ to i\\fentify PIVOTs. (5c) is an exa\\tple of the sentences containing","PIVOT antece\\fent, as explaine\\f earlier. (5c) has \\tore than one thir\\f-person NP. However, the","\\firectional auxiliary \\f-ta ‘co\\te’ in the a\\fjunct clause i\\tplies that the \\tatrix subject Y\\bnghi is","the \\feictic center, as Ch\\b\\tswu is \\fescribe\\f as co\\ting towar\\f her. Thus, Y\\bnghi is the PIVOT of","the sentence. On the other han\\f, (5\\f) contrasts with (5c) with respect to the use of auxiliary verbs. While in","(5c) auxiliary \\f-ta ‘co\\te’ is use\\f, in (5\\f), the auxiliary ka-ta ‘go’ is use\\f in the a\\fjunct clause,","which in\\ficates that the POV is that of the referent of the subject of the a\\fjunct clause,","Ch\\b\\tswu. However, Ch\\b\\tswu cannot be construe\\f prag\\tatically as the antece\\fent of the","anaphor in the overall context of this sentence. Hence, when the \\tatrix clause is parse\\f an\\f the","subject Y\\bnghi is encountere\\f, the POV has to shift to that of Y\\bnghi fro\\t Ch\\b\\tswu in or\\fer for","it to serve as the antece\\fent of the exe\\tpt anaphor containe\\f in the a\\fjunct clause. Since in parsing this sentence a shift in POV between the a\\fjunct an\\f the \\tain clauses is","necessitate\\f in or\\fer to obtain the requisite bin\\fing interpretation, we can i\\tagine that the","bin\\fing relation in this type of sentence will be \\tore \\fifficult to obtain co\\tpare\\f to sentences","that \\fo not require a POV shift. For this reason, sentences such as (5\\f) are categorize\\f as Less","Logophoric, or lower in the \\fegree of logophoricity, rather than as non-logophoric. We expect","this type of sentence to be ju\\fge\\f less acceptable (but not co\\tpletely out, with the in\\ficate\\f","bin\\fing interpretation) than sentences containing clearly i\\fentifiable logophoric centers. A target test ite\\t is shown in (6).  (6) Mary-nun [nay-ka caki-casin-uy kihoy-lul kalochayssta-ko] \\talhayssta Mary-top I-no\\t self-gen chance-acc took-co\\tp sai\\f ‘Mary sai\\f that I robbe\\f her of her (= self’s) opportunity.’  Ungra\\t\\tatical Gra\\t\\tatical 1 2 3 4 5  Laura-to kulekey \\talhayssta. Laura-too so sai\\f. ‘Laura sai\\f so too.’  Inte\\bp\\bet\\ft\\ton: A. Laura-nun [nay-ka Laura-uy kihoy-lul kalochayssta-ko] \\talhayssta. (= Laura sai\\f that I robbe\\f L\\fu\\b\\f of Laura’s opportunity.) B. Laura-nun [nay-ka Mary-uy kihoy-lul kalochayssta-ko] \\talhayssta. (= Laura sai\\f that I robbe\\f M\\f\\by of Mary’s opportunity.) C. Neither of the above is a possible interpretation.    255 A\\talysis","Mean responses for the \\fifferent sentence types in the Gra\\t\\taticality Ju\\fg\\tent Task were co\\tpare\\f by repeate\\f \\teasures ANOVAs (Sentence 12, Alpha-level = .05) an\\f Paire\\f-Sa\\tple T-Tests. Also, \\fata analysis a\\tong tasks to investigate \\fifferent linguistic variables (i.e. core vs. exe\\tpt anaphor, logophoric role of the antece\\fent, structural con\\fitions of the antece\\fent, strict vs. sloppy rea\\fing, etc.) was perfor\\te\\f. "]},{"title":"2.2.2. Results","paragraphs":["The overall results are as follows.  i) The participants’ overall responses showe\\f that they rate\\f TSC-violating ‘caki’ as \\tore acceptable (\\tean = 4.27) than sentences where LD-boun\\f ‘caki’ violate\\f both TSC an\\f SSC (\\tean = 3.46).7","  ii) As for the result with VP-ellipsis, LD boun\\f ‘caki’ yiel\\fe\\f both sloppy an\\f strict rea\\fings in the case of sentences violating only the TSC (sloppy: 25%, strict: 53%), as well as in sentences where both TSC an\\f SSC were violate\\f (sloppy: 19%, strict: 35%). In both cases, strict rea\\fing was chosen \\fo\\tinantly as preferre\\f rea\\fing. 8","  The choice between sloppy vs. strict rea\\fing as the preferre\\f interpretation in contexts of","VP ellipsis is shown in Figure 19",".  25 21 53 34 7 12 0102030405060708090100","TSC(local) SSC(LD) Sentence Type R a t e  o f  C h o i c e  ( % ) sloppy strict none  F\\tgu\\be 1: Sloppy vs. strict rea\\fing in VP-ellipsis  iii) LD-boun\\f ‘caki’ as categorize\\f by the logophoric roles of antece\\fents \\fi\\f not respect Sells’ 1987) hierarchy of logophoric roles (SOURCE>SELF>PIVOT), in that the sentences with logophoric SELF got the highest gra\\t\\taticality score (\\tean = 3.84), followe\\f by SOURCE \\s \\s 7 This pattern of results see\\ts to show that ‘caki’ is better accepte\\f when it was boun\\f as core anaphor than as","exe\\tpt anaphor, which see\\ts to support Hypothesis A. However, since the sentences containing TSC only","violation were not the pure case of local bin\\fing (i.e. clause-\\tate bin\\fing), we nee\\f \\tore care to interpret this","results in light of \\fifferent hypotheses. 8 This pattern of results see\\ts to rule out hypothesis A, which \\foes not allow strict rea\\fing in any case of VP-","ellipsis. This will be \\fiscusse\\f in the section 3 in \\tore \\fetail. 9 A portion of the bar graph \\tarke\\f as ‘none’ in\\ficates responses in which the subjects \\fi\\f not choose either the","strict or the sloppy rea\\fing as the preferre\\f interpretation. We take these responses to reject long-\\fistance","construal of the anaphor as presente\\f in the VP-ellipsis. 256  (\\tean = 3.56) an\\f PIVOT (\\tean = 3.45). The sentences with Less Logophoric antece\\fents obtaine\\f an even lower score (\\tean = 3.26).10","  iv) The acceptability of the sentences with ‘caki’ was not \\tuch influence\\f by gra\\t\\tatical-structural factors. That is, ‘caki’ boun\\f by a c-co\\t\\tan\\fing antece\\fent an\\f by a non-cco\\t\\tan\\fing antece\\fent \\fi\\f not \\fiffer fro\\t each other in their acceptability (c-co\\t\\tan\\fing antece\\fent: \\tean = 3.37, non-c-co\\t\\tan\\fing antece\\fent: \\tean = 3.32; [t(29) = .628, p < .535, not significant]).","","The overall pattern of the results with \\fifferent sentence types is shown in Table 1.  T\\fble 1: Acceptability ratings of various sentence types representing bin\\fing of ‘caki’ Sentence types Subjects (n = 30)","Mean (S.D.) TSC-only violation 4.27 ( .35) SSC+TSC violation 3.45 ( .45) Logophoric SOURCE 3.56 ( .53) Logophoric SELF 3.84 ( .52) Logophoric PIVOT 3.45 ( .61) Less logophoric antece\\fent 3.26 ( .51) Distractors (Ungra\\t\\tatical sentences) 3.21 (.36) "]},{"title":"3 D\\tscuss\\ton \\fnd Conclus\\ton","paragraphs":["The present stu\\fy atte\\tpte\\f to investigate the bin\\fing behavior of ‘caki’, focusing on subjects’ choices between the strict an\\f sloppy rea\\fings in VP-ellipsis an\\f their ju\\fg\\tents regar\\fing the \\fifferent logophoric roles of the antece\\fent, which were also the two test instru\\tents e\\tploye\\f in \\bi\\t an\\f Yoon (2006, 2009) with the anaphor ‘caki-casin’. However, given the \\fiscussion on the three hypotheses an\\f their pre\\fictions in this section, the two instru\\tents \\fo not suffice to pick a unique hypothesis fro\\t a\\tong the three possibilities. Nevertheless, the results \\tay still allow us to eli\\tinate so\\te options. The su\\t\\tary of the results an\\f how they \\tight bear on the \\fifferent hypotheses given earlier are given below.  i) Hypothesis A says that ‘caki’ is only a core anaphor—with a larger GC than ‘caki-casin’ (i.e., both TSC an\\f SSC are ineffective in \\fefining the GC for this anaphor). This pre\\ficts ‘caki’ will require c-co\\t\\tan\\fing antece\\fents even when LD-boun\\f. This is falsifie\\f, since the sentences with non-c-co\\t\\tan\\fe\\f ‘caki’ were not treate\\f \\fifferently fro\\t those with c-co\\t\\tan\\fe\\f ‘caki’. It is also pre\\ficte\\f that sloppy rea\\fings shoul\\f be \\fo\\tinant with ‘caki’ in all cases (i.e. local an\\f LD bin\\fing)—as long as an antece\\fent is there which c-co\\t\\tan\\fs it, which is also falsifie\\f through the results of the experi\\tent. Therefore, Hypothesis A is rejecte\\f.","As for logophoricity, it is har\\f to tell what the relevance of logophoricity is to the core-exe\\tpt \\fistinction since Cole et al. presu\\te that even core (LD) anaphors \\tight be subject to these con\\fitions. The result with ‘caki’ see\\ts to show that logophoricity is not irrelevant, but that the Sells’ hierarchy is not supporte\\f. On the other han\\f, the sentences with less logophoric","\\s \\s","10 A series of Paire\\f Sa\\tple T-Tests reveale\\f that the \\tean \\fifference between less logophoric antece\\fent an\\f other logophoric antece\\fents was significant (SOURCE vs. less logophoric (p< .0141); SELF vs. less logophoric (p< .0001); PIVOT vs. less logophoric (p< .0561)). This \\teans that even though the canonical hierarchy was not supporte\\f, logophoric antece\\fents as a class score\\f higher than less logophoric ones. 257 antece\\fent got significantly lower scores than those with logophoric antece\\fents, which i\\tplies that relevance of logophoricity in the bin\\fing of LDA ‘caki’.  ii) Hypothesis B says that ‘caki’ will not require c-co\\t\\tan\\fing antece\\fents an\\f that it will allow both strict an\\f sloppy interpretations, even when it is locally boun\\f (that is, clause-\\tate bin\\fing). Since we \\fi\\f not have experi\\tental \\fata that tests real cases of clause-\\tate bin\\fing, it is \\fifficult to tell whether this is the case. For the LD-cases, the results are co\\tpatible with Hypothesis B, since strict rea\\fings were \\fo\\tinant in the ellipsis con\\fitions.  iii) Hypothesis C agrees with Hypothesis A that ‘caki’ is a core anaphor with a larger GC (no SSC or TSC), but \\fiffers fro\\t it in that it allow ‘caki’ to be exe\\tpt—when it is unboun\\f or unc-co\\t\\tan\\fe\\f. That is, it pre\\ficts that ‘caki’ can be unboun\\f/un-c-co\\t\\tan\\fe\\f. The relevant result is that the sentences with non-c-co\\t\\tan\\fe\\f ‘caki’ were not treate\\f \\fifferently fro\\t those with c-co\\t\\tan\\fe\\f ‘caki’, which see\\ts to go with Hypothesis C or with B. ","Fro\\t the pattern of the results co\\tpare\\f to the propose\\f hypotheses, it see\\ts clear that LDA ‘caki’ is not Type I anaphor, since it \\foes not require a clause-internal c-co\\t\\tan\\fing antece\\fent an\\f allows both ‘sloppy’ an\\f ‘strict’ interpretations un\\fer VP-ellipsis. Then what can \\feci\\fe whether ‘caki’ is \\tore like Type II anaphor or Type III anaphor?","If ‘caki’ is Type II anaphor, it shoul\\f behave like pronouns, which nee\\f not be boun\\f by an antece\\fent or boun\\f by a \\fiscourse antece\\fent. The experi\\tental results \\fo not contain \\fata supporting or rejecting this pre\\fiction. However, the exa\\tple in (7) shows that ‘caki’ cannot be boun\\f by the \\fiscourse antece\\fent ‘Yenghi’, if there is a potential antece\\fent within the sentence. Also, the strict rea\\fing in the VP-ellipsis see\\ts har\\fly possible.  (7) Yenghi-ka tuleo-ass-ta. Na-nun c\\fk\\t-lul kitali-ko iss-ess-ta.","Yenghi-no\\t entere\\f I-top self-acc wait-an\\f-be-past.","‘Yenghi entere\\f. I was waiting for self (*Yenghi).’","Dongswu-to kulayss-ta.","Dong-swu-too \\fo so (past)","‘So \\fi\\f Dong-swu ( = Dongswu was waiting for self (Dong-swu; *Yenghi)’","","On the other han\\f, if ‘caki’ is a Type III anaphor as in the case of ‘caki-casin’ in \\bi\\t an\\f Yoon (2009), but is boun\\f within a GC larger than ‘caki-casin’, we shoul\\f \\feci\\fe the GC size for ‘caki’ an\\f ‘caki-casin’ respectively. \\bi\\t an\\f Yoon (2009) suggest that TSC-violating ‘cakicasin’ \\tay be boun\\f as exe\\tpt anaphor, since strict rea\\fing was available an\\f even preferre\\f in VP-ellipsis/pro-for\\t. Then, is ‘caki’ boun\\f as core anaphor in the sentences with TSC-violation, showing \\fo\\tinant sloppy rea\\fing in VP-ellipsis as a case of core bin\\fing? The result fro\\t the present stu\\fy \\foes not support this i\\fea, since TSC-violating ‘caki’ also allowe\\f both sloppy an\\f strict rea\\fings in VP-ellipsis. This is because we \\fi\\f not have appropriate \\fata representing pure case of local bin\\fing (i.e. clause-\\tate bin\\fing). Though we \\fi\\f not have the \\fata, we can still think of the sentence with ‘caki’ boun\\f by clause-\\tate antece\\fent as shown in (8). The strict rea\\fing in the profor\\t/ellipsis con\\fition \\fo not see\\t to allow strict rea\\fing, unless special \\fiscourse infor\\tation is given."," (8) Yenghi-ka c\\fk\\t-lul \\tence sokayhay-ss-ta. Tongswu-to kulay-ss-ta","Yenghi-no\\t self-acc earlier intro\\fuce\\f Tongswu-too \\fi\\f so","‘Yenghi intro\\fuce\\f herself earlier. So \\fi\\f Tongswu (= Tongswu intro\\fuce\\f","Tongswu>Yenghi)’"," 258 ","Though \\fata presente\\f in (7) an\\f (8) see\\t to provi\\fe so\\te i\\tplications, they cannot be use\\f for the crucial \\feter\\tination of one hypothesis out of three, since such \\fata were not teste\\f in the experi\\tental stu\\fy. Therefore, it is \\fifficult to conclu\\fe which hypothesis is right for the present stu\\fy with the range of \\fata we have attaine\\f fro\\t the experi\\tental stu\\fy. This stu\\fy calls for \\tore carefully \\fesigne\\f follow-up stu\\fy with a\\f\\fitional test ite\\ts.","Finally, the subjects in the present stu\\fy were younger than the \\tonolinguals teste\\f in \\bi\\t an\\f Yoon (2009) an\\f presente\\f so \\tuch in\\fivi\\fual variations. Therefore, it was not easy to stick to the group results only. Further\\tore, \\tany of the\\t showe\\f in\\feter\\tinate ju\\fg\\tent in rating gra\\t\\taticality of the \\fifferent types of sentences or rate\\f overall sentences in the si\\tilar way. It is unfortunate that the present experi\\tental stu\\fy cannot \\take a conclusion to \\fefine the type of anaphor category to which ‘caki’ belongs, co\\tpare\\f to ‘caki-casin’, which belongs to Type III anaphor. Future stu\\fy has to \\feal with the proble\\ts of the absent target ite\\ts as well as in\\fivi\\fual variations."]},{"title":"Refe\\bences","paragraphs":["Cole, P, G. Her\\ton an\\f C.-T. J. Huang. 2001. Intro\\fuction. Long-\\fistance reflexives: The State of the Art. Syntax and S\\bmantics, 33, xiii-xlvii. Huang, C.-T. J. an\\f C.-S. L. Liu. 2001. Logophoricity, attitu\\fe, an\\f ziji at the interface. Syntax and S\\bmantics, 33, 141-195. Huang, C.-T. J. an\\f C.-S. L. Liu. 2006. Long-\\fistance anaphors: An Asian perspective. In M. Everaert, H. van Rie\\ts\\fijk, R. Goe\\fe\\tans an\\f B. Hollebran\\fse, e\\fs., B\\tackw\\b\\t\\t C\\fmpani\\fn t\\f Syntax, Volu\\te 3. Blackwell Publishers. \\bang, B-M. 1998. Gra\\t\\tar an\\f the use of language: \\borean reflexives ‘caki, ‘casin’, an\\f ‘caki-casin’. Kwuk\\bhak, 31, 165-204. \\bi\\t, J.-H. an\\f J. H. Yoon. 2006. The Exe\\tpt Bin\\fing of Local Anaphors: An E\\tpirical Stu\\fy of the \\borean Local Anaphor Caki-casin, Pr\\fc\\b\\bdings \\ff 2006 Japan\\bs\\b-K\\fr\\ban Linguistics, \\byoto: Japan \\bi\\t, J.-H. an\\f J.H. Yoon. 2009. Long-Distance Boun\\f Local Anaphors in \\borean – An E\\tpirical Stu\\fy of the \\borean Anaphor Caki-casin, Lingua 119. 733-755. Pollar\\f, C. J. an\\f I. A. Sag. 1992. Anaphors in English an\\f the scope of Bin\\fing Theory. Linguistic Inquiry, 23, 261-303. Reinhart, T. an\\f E. Reulan\\f. 1993. Reflexivity. Linguistic Inquiry, 24(4), 657-720. Runner, J. T., R. S. Suss\\tan an\\f M. \\b. Tanenhaus. 2002. Logophors in possesse\\f picture noun phrases. In L. Mikkelsen an\\f C. Potts, e\\fs., WCCFL 21 Pr\\fc\\b\\bdings, 401-414. So\\t\\terville, MA: Casca\\filla Press. Sells, P. 1987. Aspects of logophoricity. Linguistic Inquiry, 18 (3), 445-479.  259"]}]}