{"sections":[{"title":"Building\\b\\tnline\\bC\\frp\\fra\\b\\ff\\bPhilippine\\bLanguages* \\b ","paragraphs":["Shirle\\b \\t. Di\\faa , Rachel Edi\\fa O. Roxasb",", and Paul Inven\\fadob ","a","Depar\\fmen\\f of English and Applied Linguis\\fics, De La Salle Universi\\f\\b","2401 Taf\\f Avenue, Manila, Philippines","shirle\\b.di\\fa@dlsu.edu.ph","b College of Compu\\fer S\\fudies, De La Salle Universi\\f\\b","2401 Taf\\f Avenue, Manila, Philippines {rachel.roxas, paul.inven\\fado}@dlsu.edu.ph  Abstract. This paper aims a\\f describing \\fhe building of \\fhe online corpora on Philippine languages as par\\f of \\fhe online reposi\\for\\b s\\bs\\fem called Palit\\b\\t There are five componen\\fs of \\fhe corpora: \\fhe \\fop four major Philippine languages which are Tagalog, Cebuano, Ilocano and Hiliga\\bnon and \\fhe Filipino Sign Language (FSL). The four languages are composed of 250,000-word wri\\f\\fen \\fex\\fs each, whereas \\fhe FSL is composed of seven \\fhousand signs in video forma\\f. Ca\\fegories of \\fhe wri\\f\\fen \\fex\\fs include crea\\five wri\\fing (such as novels and s\\fories) and religious \\fex\\fs (such as \\fhe Bible). Au\\foma\\fed \\fools are provided for language anal\\bsis such as word coun\\f, colloca\\fes, and o\\fhers. This is par\\f of a bigger corpora building projec\\f for Philippine languages \\fha\\f would consider \\fex\\f, speech and video forms, and \\fhe corresponding developmen\\f of au\\foma\\fed \\fools for language anal\\bsis of \\fhese various forms. Keyw\\frds:\\bcorpora, Philippine languages, corpus-building, concordancer, sign language   \\a \\a  Cop\\brigh\\f 2009 b\\b Shirle\\b \\t. Di\\fa, Rachel Edi\\fa O. Roxas, and Paul Inven\\fado"]},{"title":"1 Intr\\fducti\\fn\\b","paragraphs":["Wi\\fh 168 languages spoken na\\fivel\\b in \\fhe archipelago (Gordon 2005), Philippine linguis\\fics has persis\\fen\\fl\\b become a fer\\file ground for inves\\figa\\fion. Foreign linguis\\fs exhibi\\f a remarkable in\\feres\\f on \\fhe richness of Philippine languages. The s\\fudies of Cons\\fan\\fino (1971), McKaughan (1971), Reid (1981), Quakenbush (2005), and Liao (2006) have ou\\flined \\fhe developmen\\f of Philippine linguis\\fics in \\fhe las\\f 25 \\bears. Wi\\fh all \\fhe researches \\fha\\f have been done, Liao (2006) underscores \\fhe pressing need \\fo documen\\f major and minor languages in \\fhe Philippines. And since \\fhe vas\\f majori\\f\\b of s\\fudies in Philippine languages are done b\\b non-Filipinos, Liao emphasizes \\fhe demand for Filipino linguis\\fs \\fo be involved in \\fhe documen\\fa\\fion of Philippine languages. Addi\\fionall\\b, she highligh\\fs \\fha\\f in \\fhe las\\f 25 \\bears, \\fhere had been 14 M.A. \\fheses and 16 Ph.D. disser\\fa\\fions wri\\f\\fen abou\\f Philippine-\\f\\bpe languages, bu\\f onl\\b one of \\fhem was wri\\f\\fen b\\b a Filipino (i.e., Daguman 2004).","Researchers from all par\\fs of \\fhe world have con\\finuall\\b visi\\fed \\fhe Philippines \\fo ga\\fher da\\fa for \\fheir s\\fudies. O\\fhers, however, have \\fo resor\\f \\fo o\\fher means \\fo ob\\fain \\fhe needed da\\fa. For ins\\fance, Davis, Baker, Spi\\fz and Baek (1998) came up wi\\fh a grammar of Yogad (spoken in nor\\fhern Luzon) in which \\fhe basis was jus\\f a na\\five speaker of \\fhe language who now resides in Texas. Some would use published \\fex\\fs as corpus for \\fheir s\\fud\\b (cf. Liao 2004). O\\fhers (cf. Ruffolo 2005; Rubino 1997; among o\\fhers) would have a \\frip or \\fwo onl\\b \\fo \\fhe coun\\fr\\b for da\\fa ga\\fhering due \\fo \\fravel nuisances. Thus, \\fhe accessibili\\f\\b of da\\fabank on 646 23rd Pacific Asia Conference on Language, Information and Computation, pages 646–653 Philippine languages is a major concern for \\fhose in\\feres\\fed \\fo fur\\fher explore issues concerning Philippine linguis\\fics.","The online corpora of Philippine languages projec\\f poses several benefi\\fs. I\\f is especiall\\b of grea\\f impor\\fance \\fo \\fhose in\\feres\\fed in Philippine languages, bo\\fh locall\\b and in\\ferna\\fionall\\b. For \\fhe local researchers, \\fhe availabili\\f\\b of Philippine da\\fa will en\\fhuse linguis\\fs \\fo delve in\\fo \\fheir own languages. For foreign researchers, \\fhe da\\fabank will expedi\\fe \\fheir s\\fudies on \\fhe one hand, and will pave wa\\b for o\\fher areas of s\\fudies, on \\fhe o\\fher. Wi\\fh \\fhis projec\\f, \\fhose in\\feres\\fed wi\\fh Philippine languages need no\\f come personall\\b \\fo \\fhe Philippines \\fo ga\\fher necessar\\b da\\fa. Hence, eas\\b access \\fo Philippine da\\fa, as Di\\fa (2007) conjec\\fures, will pave \\fhe wa\\b \\fo more researches on various fields such as s\\bn\\fax, seman\\fics, pragma\\fics, sociolinguis\\fics, and o\\fhers. The online da\\fa on Philippine languages is \\fhen a valuable source \\fo an\\b linguis\\f, or researcher, for \\fha\\f ma\\f\\fer. As Me\\ber (2002:11) pu\\fs i\\f, “linguis\\fs of all persuasions have discovered \\fha\\f corpora can be ver\\b useful resources for pursuing various linguis\\fic agendas.”","Thus, a language corpus is an indispensable componen\\f in researches on various aspec\\fs of \\fhe s\\fud\\b of \\fhe na\\fure and func\\fions of na\\fural language, and i\\fs mul\\fi-face\\fed applica\\fions such as language educa\\fion, lexicograph\\b, and na\\fural language processing. There have been various applica\\fions being developed across \\fhe coun\\fr\\b which are an English-Filipino machine \\fransla\\fion s\\bs\\fem (which includes par\\f-of-speech \\faggers, morphological anal\\bzers and genera\\fors, English-Filipino lexicon for \\fransla\\fion), and spell checkers for Tagalog, \\fo name a few.","A corpus is a collec\\fion of documen\\fs in a par\\ficular language or languages \\fha\\f are \\fo be s\\fored, managed and anal\\bzed in digi\\fal form. Francis (1982:7) defines corpus as “a collec\\fion of \\fex\\fs assumed \\fo be represen\\fa\\five of a given language, dialec\\f, or o\\fher subse\\f of language, \\fo be used for linguis\\fic anal\\bsis.” In addi\\fion, Engwall (1992:167) gives ano\\fher defini\\fion of corpus: “a closed se\\f of \\fex\\fs in machine-readable form es\\fablished for general or specific purposes b\\b previousl\\b defined cri\\feria.” I\\f is indispensable in researches on various aspec\\fs of \\fhe s\\fud\\b of \\fhe na\\fure and func\\fion of na\\fural language, and i\\fs mul\\fi-face\\fed applica\\fions such as language educa\\fion, lexicograph\\b, and na\\fural language processing. In \\fhe las\\f \\fhree decades or so, inves\\figa\\fions of language use have focused on corpus-base approaches as \\fhese “provide a means of handling large amoun\\fs of language and keeping \\frack of man\\b con\\fex\\fual fac\\fors a\\f \\fhe same \\fime” (Biber, Conrad, & Reppen 1998).","The In\\ferna\\fional Corpus of English (ICE) which s\\far\\fed in mid-1990s has been one of \\fhe seminal works of corpus linguis\\fics. Wi\\fh almos\\f 20 coun\\fries par\\ficipa\\fing in \\fhis projec\\f, \\fhe ICE has provided a compara\\five s\\fud\\b of \\fhe differen\\f Englishes of \\fhe world. Greenbaum (1996) provides a comprehensive discussion of \\fhe common design of ICE corpora in which all coun\\fries should prescribe \\fo. Al\\fhough \\fhe majori\\f\\b of \\fhe member coun\\fries have comple\\fed \\fhe projec\\f, some are s\\fill working for \\fhe comple\\fion of \\fhese corpora. This fac\\f clearl\\b illus\\fra\\fes \\fha\\f corpus building is no mean fea\\f.","The availabili\\f\\b and accessibili\\f\\b of \\fhe Philippine componen\\f of \\fhe In\\ferna\\fional Corpus of English (ICE-PHI) paved \\fhe wa\\b \\fo various researches b\\b linguis\\fs worldwide. The coun\\fless possibili\\fies of corpus linguis\\fics and \\fhe de\\failed descrip\\fion of \\fhe crea\\fion and comple\\fion of \\fhe ICE-PHI, as provided b\\b Bau\\fis\\fa (2004), have been \\fhe impe\\fus for \\fhe online corpora of Philippine languages.","Corpora have been developed since \\fhen on o\\fher languages, bo\\fh major and minor languages such as Spanish, German, Chinese, Japanese, Mala\\b and Thai. The Mala\\b corpus which is focused on \\fhe s\\fud\\b of classical Mala\\b li\\fera\\fure fea\\fures more \\fhan 4 million words and 95 \\fex\\fs, including 80,000 verses. The LOTUS (Large vOcabular\\b Thai con\\finuous Speech Corpus) Thai corpus has 5,000 vocabularies for speech recogni\\fion. Ano\\fher Thai corpus has 44,000 images of handwri\\f\\fen charac\\fers. 647","Wi\\fh \\fhe exis\\fing infras\\fruc\\fure as provided b\\b \\fhe In\\ferne\\f \\fha\\f vir\\fuall\\b connec\\fs people from various ph\\bsical loca\\fions, con\\fribu\\fing \\fo developmen\\f of such collec\\fion of documen\\fs is now a reali\\f\\b."]},{"title":"2 The\\bPr\\fject\\b 2.1 An\\b\\fverview\\b","paragraphs":["This projec\\f, called \\fhe online corpora of Philippine languages, is divided in\\fo five componen\\fs: four of \\fhese represen\\f \\fhe \\fop four languages spoken in \\fhe Philippines, i.e., Tagalog, Cebuano, Ilocano, and Hiliga\\bnon and \\fhe fif\\fh componen\\f represen\\fs \\fhe Filipino Sign Language (FSL). The \\fechnical aspec\\f of \\fhe projec\\f is ac\\fuall\\b considered ano\\fher componen\\f. This in\\ferdisciplinar\\b projec\\f is a join\\f effor\\f of \\fhe following depar\\fmen\\fs and ins\\fi\\fu\\fions: \\fhe \\ta\\fional Commission for \\fhe Cul\\fure and Ar\\fs (\\tCCA), \\fhe Komis\\bon sa Wikang Filipino (KWF); \\fhe Philippine Federa\\fion of \\fhe Deaf and \\fhe Philippine Deaf Resource Cen\\fer, \\fhe College of Compu\\fer S\\fudies, \\fhe Depar\\fmen\\f of English and Applied Linguis\\fics, \\fhe Depar\\fmen\\f of Li\\fera\\fure, and \\fhe Depar\\fmen\\f of Filipino, respec\\fivel\\b.","The projec\\f was given \\fhree mon\\fhs for \\fhe da\\fa ga\\fhering and comple\\fion. Al\\fhough \\fhe original plan was \\fo come up wi\\fh one million words of \\fhe \\fop four Philippine languages, as pa\\f\\ferned af\\fer \\fhe ICE design, \\fhe \\fime cons\\frain\\f compelled \\fhe projec\\f direc\\for and coordina\\fors \\fo reduce \\fhe number of words \\fo 250,000 and \\fo scrap al\\foge\\fher \\fhe spoken aspec\\f of \\fhe corpus. To achieve comparabili\\f\\b of \\fhe four languages, \\fhe 250,000-corpus has onl\\b \\fwo componen\\fs: li\\ferar\\b \\fex\\fs and religious \\fex\\fs. The Philippine Sign Language, on \\fhe o\\fher hand, boas\\fs 7,000 signs in video forma\\f. The \\fechnical aspec\\f of \\fhe projec\\f is discussed in separa\\fe sec\\fion, see sec\\fion 3.0."]},{"title":"2.2 Sc\\fpe\\band\\blimitati\\fn\\b","paragraphs":["There had been several issues \\fha\\f needed \\fo be se\\f\\fled before \\fhe projec\\f was finalized. Among \\fhese issues are \\fhe \\f\\bpes of \\fex\\fs \\fha\\f should be included in i\\f, \\fhe number of samples for each \\fex\\f \\f\\bpe and \\fhe leng\\fh of each \\fex\\f sample.","A number of limi\\fa\\fions were seen inevi\\fable in \\fhe projec\\f. The issue of comparabili\\f\\b was a major concern. Since \\fhe presen\\f projec\\f would even\\fuall\\b become a par\\f of a bigger projec\\f, \\fhe \\fex\\f \\f\\bpe was a crucial issue in \\fhe corpus building. O\\fher Philippine languages ma\\b no\\f have some \\fex\\f \\f\\bpes \\fha\\f some languages have. Hence, \\fhe corpus onl\\b included li\\ferar\\b and religious \\f\\bpes. Li\\ferar\\b \\fex\\fs comprise 150,000 and religious comprise 100,000 of \\fhe corpus. Included in \\fhe li\\ferar\\b \\fex\\fs should onl\\b be prose forms such as novels or shor\\f s\\fories, legends, or epics. Songs, proverbs, riddles, and poems are \\fherefore no\\f included in \\fhe scope of li\\ferar\\b \\fex\\fs as \\fhese \\f\\bpes of li\\fera\\fure exhibi\\f deviances in lexicon, seman\\fics and s\\bn\\fax. On \\fhe o\\fher hand, religious \\fex\\fs come mainl\\b from bible verses. Pra\\bers, religious songs or chan\\fs are \\fherefore no\\f allowed due \\fo \\fhe na\\fure of \\fheir cons\\fruc\\fion.","Wi\\fh \\fhese \\fwo \\fex\\f \\f\\bpes included in \\fhe corpus-building, \\fhe issue of represen\\fa\\fiveness is ano\\fher problem. The samples in \\fhe corpus ma\\b no\\f be a represen\\fa\\five of \\fhe \\f\\bpe and \\fime of \\fhe collec\\fed \\fex\\fs. As Biber (1993) opines, \\fhe ex\\fen\\f \\fo which a sample includes \\fhe full range of variabili\\f\\b in a popula\\fion. Sampling is \\fhen an imminen\\f limi\\fa\\fion of a corpus building. As is well es\\fablished \\fha\\f a corpus can never be full\\b represen\\fa\\five, Leech (1991) clarifies \\fha\\f wha\\fever findings \\fhe corpus \\bield can be generalized \\fo a larger h\\bpo\\fhe\\fical corpus.","In addi\\fion, \\fhe corpus onl\\b con\\fains wri\\f\\fen \\fex\\fs, given \\fhe in\\fricacies of collec\\fing and, even\\fuall\\b, \\franscribing spoken \\fex\\fs. However, \\fhere is a s\\frong recommenda\\fion \\fo include spoken \\fex\\fs in \\fhe expansion of \\fhe projec\\f. As \\fhis projec\\f is \\fhe ini\\fial work \\fo a larger Philippine Languages Corpora, i\\f is hoped \\fha\\f spoken \\fex\\fs be included in \\fhe succeeding projec\\fs. 648","I\\f should be no\\fed \\fha\\f \\fhe corpus does no\\f provide an English \\fransla\\fion of \\fhe languages. In keeping wi\\fh \\fhe objec\\five of \\fhe projec\\f which is \\fo provide a digi\\fal corpus for \\fhose in\\feres\\fed in Philippine languages, \\fhe projec\\f \\fhus focuses on \\fhe na\\five languages onl\\b."]},{"title":"2.3 Philippine\\bLanguages\\bC\\frp\\fra\\bText\\bType\\band\\bCateg\\fries\\b","paragraphs":["The \\f\\bpes and ca\\fegories \\fha\\f have been agreed upon b\\b \\fhe projec\\f coordina\\fors wen\\f \\fhrough several revisions. As earlier men\\fioned, \\fhe original plan was \\fo pa\\f\\fern af\\fer \\fhe ICE-PHI’s \\fex\\f \\f\\bpes: wri\\f\\fen and spoken. Bu\\f wi\\fh \\fhe \\fime cons\\frain\\f dic\\fa\\fed b\\b \\fhe projec\\f, \\fhe number of words was halved and \\fhe \\fex\\f \\f\\bpe was reduced \\fo wri\\f\\fen \\fex\\fs onl\\b. Of \\fhe wri\\f\\fen \\fex\\fs, i\\f was no\\f possible \\fo subdivide i\\f fur\\fher \\fo prin\\fed and non-prin\\fed since o\\fher Philippine languages ma\\b no\\f have \\fhese \\f\\bpes. Hence, \\fhe ca\\fegories under wri\\f\\fen \\fex\\fs were simplified in\\fo li\\ferar\\b and religious \\fex\\fs, respec\\fivel\\b. The li\\ferar\\b ca\\fegor\\b included onl\\b prose forms. As is \\fhe na\\fure of poe\\fr\\b, \\fhe ex\\fen\\f of an u\\f\\ferance is no\\f defini\\fe. I\\f is ra\\fher difficul\\f \\fo iden\\fif\\b \\fhe number of sen\\fences or \\fhe end of sen\\fences.","The li\\ferar\\b \\fex\\fs cons\\fi\\fu\\fed a bigger par\\f of \\fhe corpus, \\fha\\f is, 150,000 words. The religious \\fex\\fs, on \\fhe o\\fher hand, comprised \\fhe o\\fher 100,000 words. Jus\\f like \\fhe li\\ferar\\b \\fex\\fs, religious \\fex\\fs included onl\\b \\fhe prose forms. Bible verses are \\fhe bes\\f represen\\fa\\five of \\fhis \\f\\bpe. Pra\\bers and religious songs do no\\f also have clear-cu\\f sen\\fence end and ma\\b \\fherefore \\bield problems in \\fhe fu\\fure.","Ano\\fher ra\\fionale \\fha\\f promp\\fed \\fhe choice for religious and li\\ferar\\b \\fex\\fs is \\fhe \\fime componen\\f of \\fhe u\\f\\ferances. The language of \\fhe li\\ferar\\b \\fex\\fs is more con\\femporar\\b, whereas, \\fhe religious is more formal and an\\fiqua\\fed. Such charac\\feris\\fic ma\\b be helpful for an\\b comparison or con\\fras\\f of \\fhe languages of \\fhese \\fex\\f \\f\\bpes.","The Philippine Sign Language was composed of illus\\fra\\fions of le\\f\\fers, basic \\ferms and basic expressions. As is \\fhe na\\fure of sign language, \\fhe le\\f\\fers or words are illus\\fra\\fed in \\fhe form of an ac\\fion which is cap\\fured in video. A cap\\fion of \\fhe foregoing accompanies \\fhe ac\\fions."]},{"title":"2.4 Meth\\fd\\b\\ff\\btext\\bc\\fllecti\\fn\\b","paragraphs":["Of all \\fhe componen\\fs, \\fhe collec\\fion of Philippine sign languages was indeed \\fhe mos\\f difficul\\f \\fask. \\to\\f onl\\b did i\\f necessi\\fa\\fe elabora\\fe room se\\f-up, i\\f also demanded more human resources as \\fhe \\fechnical assis\\fance is more complex. The in\\fricacies of digi\\fizing \\fhe signs called for \\fhe exper\\fise of qui\\fe a number of people. The Philippine Deaf Resource Cen\\fer kindl\\b managed all \\fhese de\\fails of \\fex\\f collec\\fion.","As for \\fhe Philippine languages, \\fhe ini\\fial s\\fage of \\fhe projec\\f was devo\\fed \\fo looking for po\\fen\\fial ma\\ferials for inclusion in \\fhe corpus. The issue on cop\\brigh\\f of published ma\\ferials was mainl\\b \\fhe difficul\\f\\b \\fha\\f \\fhe coordina\\fors had \\fo deal wi\\fh. Af\\fer iden\\fif\\bing \\fhe ma\\ferials \\fha\\f qualified under each ca\\fegor\\b, securing permission from au\\fhors and publishers came nex\\f, \\fhen \\fhe collec\\fed ma\\ferials were encoded b\\b \\fhe research assis\\fan\\fs followed b\\b a careful proofreading of \\fhe \\fex\\fs.","The markup of \\fhe corpus came af\\fer \\fhe da\\fa collec\\fion s\\fage. Tex\\fual markup, as \\telson (1996) sugges\\fs, is necessar\\b since \\fhe fea\\fures of \\fhe original \\fex\\f are los\\f when i\\f is conver\\fed in\\fo a compu\\ferized \\fex\\f file. A lis\\f of charac\\fers \\fha\\f need special coding was provided. Among \\fhese include \\fhe s\\f\\bles of forma\\f\\fing such as ‘bold’, ‘underlined’, and ‘i\\falicized.’ Likewise, charac\\fers such as non-end sen\\fence periods and labels called for special codes. The mark-up of \\fhe \\fex\\fs was carefull\\b edi\\fed and checked b\\b \\fhe language coordina\\fors of each componen\\f."]},{"title":"2.5 S\\fme\\bcaveats\\b","paragraphs":["Wi\\fh \\fhe aforemen\\fioned limi\\fa\\fions of \\fhis projec\\f, i\\f is jus\\f appropria\\fe \\fo men\\fion some cavea\\fs. Jus\\f like in \\fhe building of ICE-PHI, Bau\\fis\\fa (2004) has explained \\fha\\f onl\\b convenience sampling presen\\fed a feasible wa\\b of building corpus. Wi\\fh \\fhis, \\fhe samples 649 included in \\fhis corpus were \\fhe ones \\fha\\f are readil\\b available \\fo \\fhe language coordina\\fors and \\fhose whose au\\fhors and publishers willingl\\b resolve cop\\brigh\\f issues. For ins\\fance, some of \\fhe Hiliga\\bnon \\fex\\fs came from \\fhe language coordina\\for’s own publica\\fions. Hence, \\fhere is no claim a\\f all of represen\\fa\\fiveness of samples included in \\fhis corpus.","The or\\fhograph\\b u\\filized b\\b \\fhe \\fex\\fs is also preserved. If some bible verses exhibi\\f an\\fiqua\\fed language or Spanish or\\fhograph\\b, such charac\\feris\\fics were regarded as fea\\fure of \\fhe language in a par\\ficular period of \\fime. The \\frea\\fmen\\f and anal\\bsis of \\fhe da\\fa \\fhen lie in \\fhe hands of linguis\\fs who would be u\\filizing \\fhe corpus for \\fheir own researches.","In addi\\fion, \\fhe \\fex\\fs included in \\fhe corpus are au\\fhen\\fic and \\fhe ins\\fances of code swi\\fches are \\fherefore inevi\\fable. There was no a\\f\\femp\\f \\fo edi\\f \\fhese u\\f\\ferances.","The FSL, on \\fhe o\\fher hand, provides basic \\ferms, expressions and discourse in video form.","The mark-up of \\fhe \\fex\\fs does no\\f guaran\\fee 100% accurac\\b, \\foo. Al\\fhough \\fhe language coordina\\fors have diligen\\fl\\b proofread \\fhe \\fex\\fs, \\fhere are s\\fill possibili\\fies of errors. Even wi\\fh \\fhese shor\\fcomings, \\fhe corpus s\\fill promises \\fo be significan\\f and can be a solid basis for an\\b linguis\\fic inves\\figa\\fion or anal\\bsis on Philippine languages."]},{"title":"3 The\\bTechnical\\bAspect\\b 3.1 C\\frp\\fra\\bData\\b","paragraphs":["The projec\\f direc\\for will oversee \\fhe five projec\\fs, one for each language (Tagalog, Cebuano, Ilocano and Hiliga\\bnon), one for \\fhe Filipino sign language, and one for \\fhe \\fechnical projec\\f. For each of \\fhe languages (including \\fhe Filipino sign language), \\fhe projec\\f coordina\\for is responsible for \\fhe collec\\fion, valida\\fion, and uploading of \\fhe documen\\fs in\\fo \\fhe Philippine corpus por\\fal. The developmen\\f of \\fhe websi\\fe and \\fhe se\\f\\fing of \\fhe s\\fandards and forma\\fs for \\fhe documen\\fs will be se\\f b\\b \\fhe \\fechnical projec\\f coordina\\for. 3.2"]},{"title":"\\tnline\\bRep\\fsit\\fry\\b","paragraphs":["A ver\\b impor\\fan\\f aspec\\f of da\\fa collec\\fion is s\\foring da\\fa and keeping \\frack of i\\f. Thanks \\fo new \\fechnologies, digi\\fizing da\\fa allows a lo\\f of func\\fionali\\fies \\fha\\f make s\\foring and \\fracking da\\fa easier. Moreover, \\fhrough \\fhe power of \\fhe in\\ferne\\f, da\\fa is made even more accessible \\fo an\\bone around \\fhe world. The purpose of \\fhe online reposi\\for\\b is \\fo use \\fhese \\fechnologies as leverage in \\fhe da\\fa collec\\fion process. Figure 1 shows \\fhe screen sho\\f of \\fhe online reposi\\for\\b called PAL\\fTO.   Figure\\b1: Screensho\\f of Pali\\fo’s fron\\f Page  The online reposi\\for\\b allows i\\fs users \\fo submi\\f \\fheir documen\\fs in\\fo \\fhe reposi\\for\\b for s\\forage. The reposi\\for\\b au\\foma\\ficall\\b indexes \\fhese documen\\fs so \\fhe\\b can easil\\b be \\fracked.","Users of \\fhe reposi\\for\\b can now look for specific documen\\fs using i\\fs in\\fernal search engine and mos\\f impor\\fan\\fl\\b use differen\\f linguis\\fic \\fools \\fha\\f are ver\\b useful for language research. 650","One available \\fool is \\fhe documen\\f search fea\\fure which allows users \\fo look for specific documen\\fs in \\fhe reposi\\for\\b. A screensho\\f is shown in Figure 2 where all songs in \\fhe reposi\\for\\b are lis\\fed.   Figure\\b2: Searching for documen\\fs in Pali\\fo  Ano\\fher fea\\fure is \\fhe word frequenc\\b fea\\fure which displa\\bs \\fhe number of word occurrences in a single documen\\f or a group of documen\\fs. This is shown in Figure 3 where all words con\\faining “ng” is lis\\fed. "," Figure\\b3: Looking a\\f word frequencies in a documen\\f  Las\\fl\\b, one of \\fhe mos\\f impor\\fan\\f \\fools in \\fhe reposi\\for\\b is \\fhe concordancer. I\\f genera\\fes a concordance, which is lis\\f of \\fhe occurrences of a specified word in a documen\\f or a group of documen\\fs, wi\\fh i\\fs immedia\\fe con\\fex\\f. Figure 4 shows an example of a concordancer search for \\fhe word “puso” (hear\\f) on a documen\\f. As seen, i\\f lis\\fs all occurrences of \\fhe word i\\fs corresponding immedia\\fe con\\fex\\f.   Figure\\b4: Using concordancer on a documen\\f\\b  These will no\\f be \\fhe onl\\b \\fools presen\\f in \\fhe reposi\\for\\b since more \\fools will be developed in \\fhe fu\\fure \\fo make research and anal\\bsis much easier. The\\b also serve as incen\\five for users in building \\fhe online reposi\\for\\b b\\b submi\\f\\fing \\fheir documen\\fs, as i\\f becomes easier for \\fhem \\fo anal\\bze \\fheir own documen\\fs apar\\f from access \\fo documen\\fs submi\\f\\fed b\\b o\\fher users.   651"]},{"title":"3.3 Aut\\fmated\\bT\\f\\fls\\b","paragraphs":["A concordancer is a sof\\fware \\fhe au\\foma\\ficall\\b cons\\fruc\\fs a concordance, which is an alphabe\\fical lis\\f of \\fhe principal words used in a book or bod\\b of work, wi\\fh \\fheir immedia\\fe con\\fex\\fs. Exis\\fing concordancers include An\\fConc, ApSIC Xbench, WordSmi\\fh, MonoConc, Glossa\\te\\f, and CorpusE\\be. To illus\\fra\\fe \\fhe use of a concordance, le\\f’s consider An\\fConc. An\\fConc is a concordancer for Windows, Mac OS X, and Linux s\\bs\\fems developed b\\b Laurence An\\fhon\\b of Waseda Universi\\f\\b, Japan. An\\fConc can genera\\fe “ke\\bword-in-con\\fex\\f” concordance lines and concordance dis\\fribu\\fion plo\\fs. I\\f also has \\fools \\fo anal\\bze word clus\\fers (lexical bundles), n-grams, colloca\\fes, word frequencies, and ke\\bwords. Al\\fhough \\fhe An\\fConc was originall\\b designed for use in classrooms, i\\f has a powerful se\\f of \\fools \\fha\\f are useful \\fo researchers, including wildcard and regular expression searches. One useful fea\\fure of \\fhe program is \\fhe abili\\f\\b \\fo process \\fex\\fs in almos\\f an\\b language in \\fhe world, including Asian languages, such as Chinese, Japanese, and Korean.","Aside from \\fhe da\\fa in \\fhe Philippine corpus, \\fhe sof\\fware \\fools will also aid language researchers ever\\bwhere \\fo anal\\bze \\fhe Philippine languages, such as comparing differen\\f usages of \\fhe same word; anal\\bzing ke\\bwords; anal\\bzing word frequencies; and finding and anal\\bzing phrases and idioms."]},{"title":"4 C\\fnclusi\\fns\\band\\bRec\\fmmendati\\fns\\b","paragraphs":["This paper has presen\\fed a de\\failed descrip\\fion of \\fhe projec\\f, “Online corpora of Philippine languages.” The overview, scope and limi\\fa\\fions, \\fex\\f \\f\\bpes and ca\\fegories, me\\fhod of da\\fa collec\\fion, including \\fhe cavea\\fs were provided in order \\fo poin\\f ou\\f \\fhe in\\fricacies of corpus-building projec\\fs. Wi\\fh \\fhese, direc\\fions for fu\\fure s\\fudies can be made. As clearl\\b es\\fablished, \\fhe presen\\f projec\\f is an in\\froduc\\for\\b projec\\f \\fowards \\fhe building of PALITO, an online reposi\\for\\b of Philippine languages. I\\f is \\fherefore recommended \\fha\\f similar corpus be buil\\f for \\fhe o\\fher Philippine languages; firs\\f, \\fhe o\\fher major languages, \\fhen even\\fuall\\b, \\fhe minor Philippine languages.","In addi\\fion, a corpus canno\\f be called such wi\\fhou\\f \\fhe spoken componen\\f of i\\f. I\\f is \\fherefore highl\\b recommended \\fha\\f spoken da\\fa be included in \\fhe corpus building.","The inclusion of as man\\b Philippine languages is \\fhe ul\\fima\\fe objec\\five of \\fhis corpus-building projec\\f. This goal can onl\\b be a\\f\\fained wi\\fh \\fhe coopera\\fion and involvemen\\f of more linguis\\fs and researchers who are willing \\fo documen\\f as man\\b Philippine languages as possible."]},{"title":"References\\b","paragraphs":["Bau\\fis\\fa, M.L.S. 2004. An Overview of \\fhe Philippine Componen\\f of \\fhe In\\ferna\\fional Corpus of English (ICE-PHI). Asian Englishes, 7(2), 8-26.","Biber, D. 1993. Represen\\fa\\fiveness in corpus design. Literary and Linguistic C\\bmputing, 8(4), 243-257.","Biber, D., S. Conrad, and R. Reppen. 1998. C\\brpus linguistics: \\fnvestigating language structure and use. Cambridge: Cambridge Universi\\f\\b Press.","Cons\\fan\\fino, E. 1971. Tagalog and o\\fher major languages of \\fhe Philippines. In T. A. Sebeok, ed., Current Trends in Linguistics, V\\bl\\t 8: Linguistics in Oceania, pp.112-154. The Hague and Paris: Mou\\fon.","Daguman, J. 2004. A grammar \\bf N\\brthern Subanen\\t Ph.D. \\fhesis, Le Trobe Universi\\f\\b, Aus\\fralia.","Davis, P, J. Baker, W. Spi\\fz and M. Baek. 1998. The grammar \\bf Y\\bgad: A functi\\bnal explanati\\bn. LI\\tCOM S\\fudies in Aus\\fronesian Linguis\\fics 01. München and \\tewcas\\fle: Lincom Europa. 652","Di\\fa, S. \\t. 2007. A reference grammar \\bf \\fbanag. Ph.D. \\fhesis, De La Salle Universi\\f\\b, Philippines.","Engwall, G. 1992. Commen\\fs. In J. Svar\\fvik, ed., Directi\\bns in C\\brpus Linguistics: Pr\\bceedings \\bf N\\bbel Symp\\bsium 1992, pp. 164-169. \\tew York and Berlin: Mou\\fon de Gru\\b\\fer.","Francis, G. 1982. Problems of assembling and compu\\ferizing large corpora. In S. Johansson, ed., C\\bmputer c\\brp\\bra in English language research, (7-24). Bergen: \\torwegian Compu\\fer Cen\\fer for \\fhe Humani\\fies.","Gordon, R. G., Jr., ed. 2005. Ethn\\bl\\bgue: Languages \\bf the W\\brld, Fif\\feen\\fh edi\\fion. Dallas,Texas: SIL In\\ferna\\fional. Online version: h\\f\\fp://www.e\\fhnologue.com/","Leech, G. 1991. The s\\fa\\fe of \\fhe ar\\f in corpus linguis\\fics. In K. Ajmer and B. Al\\fenberg, eds., English C\\brpus Linguistics: Linguistic Studies in H\\bn\\br \\bf Jan Svartvik, (8-29). London: Longman.","Liao, H. 2004. Transi\\fivi\\f\\b and erga\\fivi\\f\\b in Formosan and Philippine languages. Ph. D. \\fhesis, Universi\\f\\b of Hawaii a\\f Manoa.","Liao, H. 2006. Philippine linguis\\fics: The s\\fa\\fe of \\fhe ar\\f (1981-2005). Paper presen\\fed a\\f \\fhe Annual Lec\\fure of \\fhe Bonifacio P. Siba\\ban Dis\\finguished Professorial Chair in Applied Linguis\\fics, and \\fhe Andrew Gonzalez, FSC Dis\\finguished Professorial Chair in Linguis\\fics and Language Educa\\fion on March 4, 2006, De La Salle Universi\\f\\b, Manila.","McKaughan, H. P. 1971. Minor languages of \\fhe Philippines. In T. A. Sebeok, ed., Current Trends in Linguistics, V\\bl\\t 8: Linguistics in Oceania, pp.155-167. The Hague and Paris: Mou\\fon.","Me\\ber, C. F. 2002. English c\\brpus linguistics: An intr\\bducti\\bn. Cambridge: Cambridge Universi\\f\\b Press.","\\telson, G. 1996. Markup s\\bs\\fems. In S. Greenbaum, ed., C\\bmparing English w\\brldwide: The \\fnternati\\bnal C\\brpus \\bf English, pp. 36-53. Oxford: Oxford Universi\\f\\b Press.","Quakenbush, J. 2005. Philippine linguis\\fics from an SIL perspec\\five: Trends and prospec\\fs. In Hsiu-chuan Liao and Carl R. Galvez Rubino (eds.), Current issues in Philippine linguistics and anthr\\bp\\bl\\bgy: Parangal kay Lawrence A\\t Reid, 3-27. Manila: Linguis\\fic Socie\\f\\b of \\fhe Philippines and SIL Philippines.","Reid, L. 1981. Philippine linguis\\fics: The s\\fa\\fe of \\fhe ar\\f: 1970-1980. In Don V. Har\\f (ed.), Philippine Studies: P\\blitical science, ec\\bn\\bmics, and linguistics, 212-273. DeKalb: Cen\\fer for Sou\\fheas\\f Asian S\\fudies, \\tor\\fhern Illinois Universi\\f\\b.","Rubino, C. R. G. 1997. A Reference Grammar \\bf \\fl\\bcan\\b. PhD \\fhesis, Universi\\f\\b of California, San\\fa Barbara.","Ruffolo, Rober\\fa. 2004. T\\bpics in the m\\brph\\b-syntax \\bf \\fbal\\by, N\\brthern Philippines. Ph.D. \\fhesis, Aus\\fralian \\ta\\fional Universi\\f\\b.    653"]}]}