{"sections":[{"title":"On the So-Called Thematic Use of Wa: Reconsideration and Reconciliation ⋆","paragraphs":["David Y. Oshima","International Student Center, Ibaraki University, 2-1-1 Bunkyo, Mito 310-8512, Japan","oshima@mx.ibaraki.ac.jp Abstract. In past studies, there have been two major lines of analyses of the function/meaning of the particle wa in Japanese in its thematic use. Some scholars argue that it marks a topic, while others claim that it marks ground (old, presupposed, or backgrounded information). I demonstrate, testing their predictions against empirical data, that neither the topichood-based approach nor the groundhood-based approach constitutes a complete theory of wa in its thematic use, and argue that the two approaches need to be combined in an adequate fashion. Namely, I propose that wa indicates topichood only when it is associated with certain grammatical functions, such as direct object, while it merely indicates groundhood when it is associated with others, including subject. Keywords: Japanese discourse, information structure, topic, focus"]},{"title":"1 Introduction","paragraphs":["This paper develops a semantic analysis of (some major functions of) the particle wa in Japanese, which integrates and reconciles two major lines of analyses in the existing literature: the topichood-based approach and the groundhood-based approach.","There have been a great deal of studies of information packaging strategies in Japanese, including and especially the use of the putative ‘topic-marker’ wa (see Noda 1996, Fry 2003, and Heycock 2008 for literature surveys). Most previous studies of wa start from the assumption that, although wa is often (and indeed, most frequently, according to Fry’s (2003) corpus-based survey) attached to a subject, wa is not a subject-marker. This assumption is based on the fact that wa can be attached to constituents other than subjects, such as (direct or indirect) objects, (temporal or locative) modifiers, and even modifiers of nominal constituents; the sentences in (1) are adapted from Noda (1996:2), and the one in (2) from Mikami (1963:13).1","(1) a. Kodomo-tachi-wa child-Pl-wa karê-o curry-Acc tsukutte-i-mas-u. make-Asp-Polite-Pres ‘The kids are making curry.’ (wa occurring on a subject) ⋆ Part of the present paper was presented at the Semantics Research Group meeting held at Hirosaki Gakuin University on October 26th, 2007 and the Ibaraki University Linguistics Research Group meeting held at Ibaraki University on May 30th, 2008. I would like to thank the audiences for valuable feedback. I benefited greatly from the insightful comments of Makoto Kanazawa, Christopher Tancredi, Ikumi Imani, Kiyomi Kusumoto, Fumio Fujii, Kunio Nishiyama, Takuya Goro, and Takayasu Namiki. Copyright 2009 by David Y. Oshima 1 Throughout the paper, the English translations of Japanese examples are meant to be rough approximations, rather than propositional and information-structural equivalents. The abbreviations used in glosses are: Acc = accusative, Asp = aspect, Aux = auxiliary, Ben = benefactive, Cl = classifier, Dat = dative, Gen = genitive, Hon = honorific, Imp = imperative, Nom = nominative, Pl = plural, Pres = present, Pro = pronoun, Q = question marker, SFP = sentence final particle. 405 23rd Pacific Asia Conference on Language, Information and Computation, pages 405–414","b. Karê-wa curry-wa kodomo-tachi-ga child-Pl-Nom","tsukutte-i-mas-u.","make-Asp-Polite-Pres ‘As for the curry, the kids are making it.’ (wa occurring on a direct object)","c. Kawara-de-wa riverside-Loc-wa kodomo-tachi-ga child-Pl-Nom karê-o curry-Acc tsukutte-i-mas-u. make-Asp-Polite-Pres ‘On the riverside, the kids are making curry.’ (wa occurring on a locative modifier)","(2) Zô-wa elephant-wa hana-ga nose-Nom","naga-i.","be.long-Pres","‘An elephant has a long nose; An elephant is such that its nose is long.’","(wa occurring on a nominal modifier of a subject.) Scholars generally (though not unanimously) agree that wa has at least two functions: thematic and contrastive (Kuno 1972 among others). Opinions are divided, however, on the exact function/meaning of the thematic use of wa.2","Some scholars argue that it marks a topic (Mikami 1963; Kuno 1973; Noda 1996; Portner and Yabushita 1998; among others), while others claim that it marks a constituent carrying given, old, or backgrounded information (Martin 1975; Ono 1978; Makino 1982; Fiengo and McClure 2002, among others). The term ‘thematic wa’ turns out to be handy in this respect, as ‘theme (thematic)’ is used ambiguously in the literature, sometimes in the sense of topic (as intended by Kuno), and sometimes in the sense of (back)ground, i.e. as a notion opposing to focus.","The task to identify the function(s) of wa is made difficult partly by the ‘terminological jungle’ in the theory of information structure, where such fundamental terms/concepts as topic, old, given, ground, etc., have been given various labels, definitions, and interpretations in different frameworks and by different scholars. As a consequence, it is often difficult to evaluate individual analyses of wa in terms of their ability of making correct predictions and correct predictions only. On the other hand, recent years have seen important progresses toward an adequate theory of information structure, where insights from the accumulating works are integrated and problematic conceptual confounds are resolved (e.g. Lambrecht 1994; Vallduvı́ and Engdahl 1996). On this ground, this article demonstrates that neither the topichood-based analysis nor the groundhood-based (givenness-based) analysis constitutes a complete theory of wa in its thematic use, testing their predictions against empirical data. This is, however, not to say that we need to introduce a third concept; what we need instead is to combine the two approaches in an adequate fashion.","In Section 2, I present working definitions of some fundamental pragmatic concepts to be adopted in the present work. In Section 3, I briefly review the two existing major analyses of wa (the topichood-based analysis and the groundhood-based analysis) and point out their problems. In Section 4, I put forth an alternative analysis which integrates insights from previous studies and can account for a fuller range of data. Namely, I argue against the widely held assumption that (thematic) wa has a uniform function, say topic-marker or ground-marker, and propose that wa marks a topic only when it is associated with certain grammatical functions (GF’s), such as direct object, while it merely indicates groundhood (givenness) when it is associated others, including subject. In other words, I propose that what has been traditionally called thematic wa is an amalgam of ‘topic-marking wa’ and ‘ground-marking wa’."]},{"title":"2 The Tripartite Structure of Pragmatic Functions","paragraphs":["Messages conveyed by individual utterances can be partitioned into informational subcomponents, or pragmatic functions. In the literature, it has been generally agreed that a single bipartite struc-2 This is not to say that the function/meaning of the contrastive use of wa is a straightforward matter; see Oshima (2008) among others. 406 ture (say, theme-rheme) is not fine-grained enough to explain various facts in natural languages, and we need at least two pairs of opposing concepts: topic-comment and ground-focus. Furthermore, in recent studies, it is commonplace to conflate two oppositions into one tripartite structure, where topic is construed as part of ground (Lambrecht 1994; Vallduvı́ and Engdahl 1996). I too adopt this view, and postulate five pragmatic categories in a message conveyed by a single utterance, with the working definitions presented below.","(3) a. focus: informative and newsy material; material that completes an open proposition","provided by ground and/or the discourse context b. ground: non-informative and expected material; material that provides an open propo-","sition to be completed by focus c. topic: an entity presented as something the message is ‘about’; an entity that the hearer","is expected or directed to give attention to as the location of information update d. tail: the complement of the topic in the ground (i.e., tail = ground − topic) e. comment: the complement of the topic in the utterance (i.e., comment = link + focus) An utterance may consist of focus only, focus-tail, focus-topic, or focus-tail-topic; it is impossible, on the other hand, for an utterance to consist of ground elements only. That is, an utterance may be topic-less or ground-less, but cannot be all-ground. (4) is an example of an utterance in English that contains all five pragmatic categories:","(4) [I will meet Prof. Brown at the airport myself.] As for Prof. Smith, Ken will go pick him up.","(5) a. focus: ken b. ground: λy[pick.up(y, smith)] c. topic: smith d. tail: λx[λy[pick.up(y, x)]] e. comment: λx[pick.up(ken, x)]"]},{"title":"3 Previous Studies of Wa","paragraphs":["This section discusses limitations of the major existing analyses of wa. The discussions to follow will be limited to thematic wa-marking in affirmative contexts and in the matrix environment;3","that is, contrastive wa-marking and wa-marking in a negative or subordinate clause will not be considered, based on the assumptions (i) that the thematic and contrastive uses of wa are semantically distinct, and thematic and contrastive wa-phrases can be distinguished on phonological grounds (Nakanishi 2001; Oshima 2008, 2009), and (ii) that conditions on wa-marking are different in affirmative and negative clauses, as well as in matrix and subordinate environments (McGloin 1987; Noda 1996; Oshima 2009).","There have been two major lines of analyses on the so-called thematic use of wa: (i) the topichood-based analysis: ‘Wa marks a topic’ (e.g., Mikami 1963; Kuno 1973; Noda 1996; Portner and Yabushita 1998) and (ii) the groundhood-based analysis: ‘Wa marks given/old information’ (e.g., Martin 1975; Ono 1978; Makino 1982; Fiengo and McClure 2002).4","That is, a major portion of existing analyses of wa amount to the following, two competing hypotheses. 3 Hereafter, I will take the liberty to refer to ‘wa in its thematic use’ simply as ‘wa’. 4 Scholars like Kuroda (1972, 2005) and Shibatani (1990) claim that sentences with and without a wa-phrase instantiate two different ways to perceive a proposition. Sentences with a wa-phrase express a categorical (or predicational, experiential, etc.) judgment, where presentation of certain material and predication over it are conceptualized as two distinct processes; sentences without a wa-phrase, on the other hand, express a thetic (or descriptive, perceptual, etc.) judgment, where a proposition is grasped as an undivided whole. I consider this view a variant of analysis (6ii), the categorical judgment corresponding to the ground-focus configuration and the thetic judgment corresponding to the all-focus configuration. 407","(6) (i) Wa indicates topichood. (ii) Wa indicates groundhood. Typically, these two hypotheses are paired with and complemented by their respective contraposition; i.e.,","(7) (i’) The absence of wa indicates the absence of a topic (unless the presence of a topic is","indicated by some other means).","(ii’) The absence of wa indicates focushood (unless groundhood is indicated by some other","means). In the following, I will examine these two hypotheses, and argue that neither of them is sufficient by itself and that they must be combined with each other appropriately to account for a full range of data."]},{"title":"3.1 Groundhood and Wa-Marking","paragraphs":["Let us first examine hypothesis (6ii): ‘Wa indicates ground’. There are two natural ways to elaborate this hypothesis.","(8) (i) Wa marks all portions/the whole of ground. (All portions of ground must be marked","by wa.)","(ii) Wa marks all nominals that are part of ground. (All nominals that are part of ground","must be marked by wa.) It can be shown, with rather simple data, that neither generalization holds. Consider the following wh-question (boldface indicates focushood).","(9) (Context: The three graduate students, Ken, Hiroshi, and Shingo, recently read Iliad, Odyssey, and Theogony.) Ken-ga Ken-Nom Iriasu-o Iliad-Acc yon-da read-Past no-wa Pro-wa itsu when des-u-ka? be.Polite-Pres-Q ‘When is it that Ken read Iliad?’ In reply to (9), one can felicitously utter either (10a) or (10b).","(10) a. Ken-wa Ken-wa Iriasu-o Iliad-Acc gogatsu-ni May-in yomi-mashi-ta. read-Polite-Past ‘Ken read Iliad in May.’","b. Iriasu-o Iliad-Acc Ken-wa Ken-wa gogatsu-ni May-in yomi-mashi-ta. read-Polite-Past ‘Ken read Iliad in May.’ In (10), the phrase gogatsu-ni, which corresponds to the wh-phrase in the question, matches the focus, and all other constituents form ground. Neither generalization (8i) nor (8ii) is compatible with such data, where the nominal Iriasu-o is, despite being a nominal and part of the ground, not marked by wa. From this observation, we can conclude that groundhood is not (always) the determining factor for the presence of wa-marking (a similar point is made by Heycock 2008:65-66)."]},{"title":"3.2 Topichood and Wa-Marking","paragraphs":["Let us now turn to hypothesis (6i): ‘Wa indicates topichood’. A problem with this hypothesis can be illustrated with data like the following: 408 (11) (in reply to (9))","a. ??Ken-ga Ken-Nom Iriasu-{o/wa} Iliad-Acc/wa gogatsu-ni May-in yomi-mashi-ta. read-polite-Past (Ken read Iliad in May.)","b. ??Iriasu-{o/wa} Iliad-Acc/wa Ken-ga Ken-Nom gogatsu-ni May-in yomi-mashi-ta. read-polite-Past (Ken read Iliad in May.) The utterances in (11a,b) are awkward in the context in question (see Kuno 1972:287-288, 1973:215 for a similar observation).","If we adopt hypothesis (6i) at face value, the data given in (11) would entail that in the context in question, the subject must be presented as a topic (while the object need not to). To account for such data, one might claim that: (12) A subject must be a topic unless it is (part of) the focus.","Such a solution, however, is rather unpalatable, as there is no obvious reason why the speaker cannot opt not to topicalize a subject within ground, while he may leave an object within ground untopicalized. True, a subject tends to be a topic, and a topic tends to be a subject (Lambrecht 1994, among others). That a subject tends to be a topic and that a subject must be a topic, however, are two separate things. In the following, I will present and argue for a more sensible alternative to (12)."]},{"title":"4 The Asymmetry Hypothesis","paragraphs":["The problems with the topichood-based analysis and the groundhood-based analysis of wa discussed so far can be summarized as follows: (i) the groundhood-based analysis overgenerates wa-marking on a direct object, and (ii) the topichood-based analysis undergenerates wa-marking on a subject. To solve this dilemma, it seems necessary to abandon the commonly held assumption that wa has a uniform function whether it occurs on one grammatical function or another."]},{"title":"4.1 An Alternative Analysis","paragraphs":["I propose (i) that wa-marking on a subject merely indicates that the subject is part or the whole of ground (so that a wa-marked subject may but need not be a topic), and (ii) that wa-marking on a direct object indicates that the direct object is not only part of the ground, but a topic (so that a wa-marked object must be a topic). This proposal, which I hereafter call the asymmetry hypothesis, amounts to say that what has been traditionally called thematic wa is an amalgam of two different uses of wa: (i) wa1, a ground-marker, and (ii) wa2, a topic-marker. Wa1 can occur on a subject (and possibly some other GF’s) but not on a direct object; wa2, on the hand, is presumably not subject to such a GF-based constraint.","For a large range of data, the asymmetry analysis leads to the same predictions as Kuno’s (1972, 1973) analysis of wa and ga, whose essence is summarized below: (13) Kuno’s analysis of wa and ga (i) Wa-marking indicates a topic (theme, in his terminology) (ii) Ga-marking on a subject indicates that the subject is part or the whole of the focus.5","I take the view, contra Kuno, that ga is a mere nominative marker and by itself does not indicate a particular pragmatic function (see Amano 1998 for similar remarks). The effect of (13ii), 5 Kuno refers to ga marking a proper subpart of the focus as ‘ga of neutral description’, and to ga marking the whole of the focus as ‘ga of exhaustive listing’. 409 however, follows from the asymmetry hypothesis; from (i) the assumption that wa-marking on a subject indicates groundhood and the absence thererof indicates focushood, and (ii) the fact that ga-marking entails the absence of wa-marking, it follows that ga-marking indicates focushood. The two analyses differ, however, in that only my analysis but not Kuno’s leaves room for a tail-subject, i.e., a subject that is neither a topic nor (part of) a focus. In (relatively formal styles of) Japanese, a subject as a rule must be marked either by wa or ga. Thus, Kuno’s analysis, where wa indicates topichood and ga indicates focushood, in effect predicts that a subject must be either a topic or (part of) a focus and cannot be (part of) tail. I find it a defect of Kuno’s analysis, as it seems quite unlikely for a language to have such a ‘design flaw’ in its expressive capacity."]},{"title":"4.2 The As For-Test","paragraphs":["The asymmetry hypothesis is supported by the observation that a wa-marked direct object in an affirmative statement generally passes what Lambrecht (1994) calls the as for-test, while the same is not the case for a wa-marked subject in the same environment.","The as for-test is a diagnostic test that can be used to identify an expression that serves as an information-structural topic, and has the form presented below:","(14) The as for-test: If an utterance of the form: [S1 . . . X . . .] can be felicitously paraphrased as [As for X, S2] where S2 is identical to S1 except that X is replaced by a pronominal or empty form anaphoric to X, X in S1 is a topic. To give an example, if an utterance: ‘I saw your brother yesterday’ is intuitively felt to be roughly equivalent to (or be paraphrasable as) ‘As for your brother, I saw him yesterday’, one may conclude that your brother is a topic (of the original utterance).6","The as for-test can be applied to Japanese data too with expressions like ni-tsuite-wa, which can be taken to be a relatively faithful translation of as for.7","(15) a. Ken-ni-tsuite-wa, Ken-ni-tsuite-wa Iriasu-o Iliad-Acc yomi-mashi-ta. read-Polite-Past ‘As for Ken, he read Iliad.’","b. Iriasu-ni-tsuite-wa, Iliad-ni-tsuite-wa Ken-ga Ken-Nom yomi-mashi-ta. read-Polite-Past ‘As for Iliad, Ken read it.’","A crucial observation here is that a wa-marked direct object generally can be paraphrased with","ni-tsuite-wa, while the same does not hold for a wa-marked subject.8 6 Lambrecht (1994) takes the view that not all topics pass the as for-test, while those expressions that pass it can be safely regarded as a topic. In other words, he does not adopt the stronger, biconditional version of the as for-test, i.e. ‘an expression can be identified as a topic if and only if it can be felicitously marked by as for’. 7 One may be tempted to parse ni-tsuite-wa as [ni-tsuite ‘about’ + wa]. There are, indeed, cases where wa attaches to a phrase headed by ni-tsuite to form the sequence ni-tsuite-wa.","(i) a. Kono this mondai-ni-tsuite problem-about kinô yesterday","giron-shi-ta.","discuss-Past ‘We discussed this problem yesterday.’","b. Kono this mondai-ni-tsuite-wa problem-about-wa kinô yesterday giron-shi-ta. discuss-Past","‘As for this problem, we discussed it yesterday.’ Ni-tsuite-wa in the sense of ‘as for’, however, must be recognized as a single phrasal expression, as it can occur in an environment where a phrase headed by ni-tsuite is not selected for, too; compare (15a) and (ii).","(ii) Ken-{ga/*ni-tsuite} Ken-{Nom/ni-tsuite}Iriasu-o","Iliad-Acc","yomi-mashi-ta.","read-Polite-Past","8","Two types of apparent counterevidence are discussed in Oshima (2009). The first is wa-marked direct objects 410","In (16) are passages from novel texts that exemplify a wa-marked object that passes the as for-test.","(16) a. Kodomo-wa child-wa","(≈ kodomo-ni-tsuite-wa) tonari-no next.door okusan-ni wife-Dat azukatte-itadaki-mashi-ta. look.after-Ben-Polite-Past ‘As for my daughter, I asked a neighbor of mine to look after her while I am out.’ (from Eida by Masaki Yamada)","b. Kozutsumi-ni parcel-Dat hatte-at-ta attach-Asp-Past fûtô-wa envelope-wa","(≈ fûtô-ni-tsuite-wa) hagitotte tear.off danro-ni stove-Dat kubete put","moshi-ta.","burn-Past ‘As for the envelope attached to the parcel, I tore it off and burned it in the stove.’ (from Sôjô no tsumikiuta by Masaki Yamada)","c. Mô-hitotsu-no other-one-Gen ranpu-wa lamp-wa","(≈ ranpu-ni-tsuite-wa) watashi-ga I-Nom","motte-i-ta.","hold-Asp-Pres","‘As for the other lamp, I was holding it.’ (from Suishô no piramiddo by Soji Shi-","mada) The passage in (17), on the other hand, exemplifies a wa-marked subject that does not pass the as for-test.","(17) Shin-no true-be higeki-dat-ta. tragedy-be-Past Fune-ni-wa ship-Dat-wa 2,200-nin-no 2,200-Cl-Gen ningen-ga people-Nom notte-i-ta-ga, board-Asp-Past-although kyûmeibôto-wa life.saving.boat-wa saidai at.most 1,178-nin-bun-shika 1,178-Cl-worth-but nakat-ta. not.exist-Past Soredemo still Taitanikku-wa Titanic-wa Eikokutsûshôiinkai-no British.Trade.Committee-Gen sadame-ru determine-Pres kitei-yori regulation-than zutto by.far ôku-no many bôto-o boat-Acc","tsunde-i-ta-nodear-u.","carry-Asp-Past-Aux-Pres ‘It was a real tragedy. On the ship [= the Titanic] were 2,200 people, but there were life saving boats for at most 1,178 people only. Still, the Titanic carried far more boats than required by the regulations of the British Trade Committee.’ (from Suishô no piramiddo by Soji Shimada) occurring in sentences carrying an illocutionary force other than statement (e.g., question, request, promise), as in (i).","(i) Kore-wa this-wa minasan-de all-by tabete-kudasa-i. eat-Ben-Imp","‘I would like you all to eat this.’ It appears that the conditions on wa-marking in questions, requests, etc. pattern the same with those in negative statements.","The second is what I call the property attribution construction, which is exemplified in (ii).","(ii) Enryakuji-wa Enryakuji-wa Saichô-ga Saicho-Nom 788-nen-ni 788-year-in konryû-shi-ta. build-Past","‘Enryakuji Temple was founded by Priest Saicho in 788.’ In a sentence like (ii), the initial wa-phrase appears to be an object and yet does not (necessarily) allow paraphrasing with ni-tsuite-wa. Such a sentence can be analyzed as a disguised ‘multiple subject construction’ (Heycock 1993 among others), where the initial phrase is a ‘major subject’, rather than an object.","See Oshima (2009) for fuller discussion of these points. 411"]},{"title":"4.3 The Focus-Fronting Construction","paragraphs":["Another interesting issue in connection with wa-marking on a subject within ground (as in (10a,b)) is the fact observed by Kuno (1972:288-289, 1973:214-215) that it becomes optional when the focus phrase is fronted, as shown in (19).","(18) Ken-ga Ken-Nom yon-da read-Past no-wa Pro-wa dono which hon book des-u-ka? be.Polite-Pres-Q ‘Which book is it that Ken read?’ (19) (In reply to (18))","a. Ken-{??ga/wa} Ken-Nom/wa Iriasu-o Iliad-Acc yomi-mashi-ta. read-Polite-Past-Q ‘Ken read Iliad.’","b. Iriasu-o Iliad-Acc Ken-{ga/wa} Ken-Nom/wa yomi-mashi-ta. read-Polite-Past-Q ‘Ken read Iliad.’","Kuno (1973) argues, to account for this phenomenon, that fronting of a focus phrase results in a complex structure along the lines of (20), and accordingly the part following the fronted focus phrase acquires characteristics of a subordinate-clause, where, as is well-known (Noda 1996; Kuroda 2005), the opposition of wa and ga may be neutralized. (20) [S Iriasu-o [S Ken-ga yomi-mashi-ta]] (= (19b))","Under the hypothesis that wa occurring on a subject indicates groundhood, we can find a functional account of this phenomenon. In Japanese, the location of a focus can be indicated by the following four means (Kori 1997; Oshima 2006), which all involve manipulation of pitch movements occasioned by lexical and phrasal tones (accents):9","(21) a. deaccenting of (suppression of pitch movements within) the phrases following the","last focus phrase b. deaccenting of the phrases preceding the first focus phrase c. expansion of pitch movements within a focus phrase d. a rising tone (known as a prominence-lending rise) at the end of a focus phrase Among these four means, the first is obligatorily enforced while the other three are optional. The following generalizations thus hold:","(22) a. When the sentence-initial phrase (and nothing else) is a focus, the focus-ground","configuration is always unambiguously specified by the tonal configuration.","b. When a sentence-medial phrase is a focus or part thereof, the focus-ground configu-","ration may not be entirely specified by the tonal configuration. A possible tonal configuration of (19b), for example, is as follows (boldface, as before, indicates information-structural focus; curly brackets indicate accent phrase boundaries):","(23) {Iriasu-o} (not deaccented) {Ken-ga/wa} (deaccented) {yomi-mashi-ta} (deaccented) Additionally, the phrase Iriasu-o can be accompanied by expansion of pitch movements and/or a prominence-lending rise. In any event, from the tonal information indicated in (23), one may infer 9 The term phrase in (21) refers to an accent phrase, which typically corresponds to what has been called bunsetsu in traditional Japanese grammar. Adjacent accent phrases form a larger phonological unit called an intonation phrase. 412 that the initial phrase and nothing else is a focus.","Consider next a possible tonal configuration of sentence (19a), a variant of (19b) with canonical word order.","(24) {Ken-wa} (not deaccented) {Iriasu-o} (not deaccented) {yomi-mashi-ta} (deaccented) A crucial point here is that the initial phrase, which is part of the ground, may but need not be deaccented. Thus, from the tonal configuration alone, one cannot always determine whether the initial phrase is part of the focus or of the ground. It is only with the presence of wa and the constraint that a subject must be marked by wa when it is part of ground that the hearer can infer that the initial phrase is part of the ground, rather than of the focus.","In sum, under the asymmetry hypothesis, wa-marking on a ground-subject and fronting of a focus can be understood as alternative means of pragmatic function coding. When one is used in an utterance, the enforcement of the other may be suspended. If, on the other hand, we pursue the hypothesis that wa invariably marks a topic, we will be forced either to adopt the syntax-based account illustrated above, or else to postulate the following generalization, which is a modified version of (12): (25) A subject must be a topic unless it is part of the focus or is preceded by the focus. (25) is a rather ad hoc constraint, for which I cannot think of any sensible motivation."]},{"title":"5 Conclusion","paragraphs":["In this work I argued that the so-called thematic use of wa in Japanese, which has been extensively studied for decades, is an amalgam of two functions: the topic-marking use and the ground-marking use. Wa can be interpreted as a ground-marker only in combination with certain grammatical functions, in particular the subject, while wa as a topic-marker is not subject to such a GF-based constraint. This hypothesis (the asymmetry hypothesis) reconciles, so to speak, the dispute between the two competing analyses of wa: the topichood-based analysis and the groundhood-based analysis.","The proposed analysis has significant implications on the typology of information packaging, as Japanese has often been taken as a paradigmatic case of a topic-prominent language, where the sentence structure is determined primarily based on the topic-comment relation, rather than the argument-predicate relation (Li and Thompson 1976). Under the proposed analysis, many occur-rences of wa-phrases are not topics, which entails that the topic is not as prominent (abundant) in Japanese discourse as many scholars have believed. It seems quite possible, indeed, that the frequency at which an utterance in Japanese contains an explicitly and unambiguously indicated topic is no higher than the frequency at which an utterance in English does so with an expression like as for, the so-called B-accent, etc. If Japanese is not a topic-prominent language as has been commonly believed, is there any topic-prominent language? It is a rather interesting question whether the asymmetry analysis of wa is applicable to putative topic-markers, including topic positions and topic-marking contours, in other languages."]},{"title":"References","paragraphs":["Amano, M. 1998. Zentei/syôten kôzô kara mita wa to ga no kinô [An analysis of the functions of the particles wa and ga based on the concept of the presupposition/focus structure]. Nihongo Kagaku 3(4), 67-85.","Fiengo, R. and W. McClure. 2002. On How to Use -wa, Journal of East Asian Linguistics 11(4), 5-41 413 Fry, J. 2003. Ellipsis and Wa-Marking in Japanese Conversation. New York: Routledge.","Heycock, C. 1993. Syntactic Predication in Japanese Journal of East Asian Linguistics 2(2), 167-211.","Heycock, C. 2008. Japanese -wa, -ga, and Information Structure In S. Miyagawa and M. Saito, eds., The Oxford Handbook of Japanese Linguistics, pp.54-83, Oxford University Press.","Kori, S. 1997. Nihongo no intonêsyon: kata to kinô [Intonation in Japanese: Patterns and functions]. In T. Kunihiro, ed., Akusento, intonêsyon, rizumu to pôzu [Accent, intonation, rythm and pause], pp.169-202, Sanseido.","Kuno, S. 1972. Functional Sentence Perspective: A Case Study from Japanese and English. Linguistic Inquiry 3(3), 269-320. Kuno, S. 1973. Nihon bunpô kenkyû [Studies of the Japanese grammar]. Tokyo: Taishukan.","Kuroda, S.-Y. 1972. The Categorial and the Thetic Judgments. Foundations of Language 9(2), 153-185.","Kuroda, S.-Y. 2005. Focusing on the Matter of Topic: A Study of Wa and Ga in Japanese. Journal of East Asian Linguistics 14(1), 1-58.","Lambrecht, K. 1994. Information Structure and Sentence Form. Cambridge: Cambridge University Press. Makino, S. 1982. Japanese Grammar and Functional Grammar. Lingua 57(2), 125-173. Martin, S.E. 1975. A Reference Grammar of Japanese. Tokyo: Tuttle.","McGloin, N.H. 1987. The Role of Wa in Negation. In J. Hinds, S. Iwasaki, and S.K. Maynard, eds., Perspectives on Topicalization: The Case of Japanese WA, pp.166-183, John Benjamins.","Mikami, A. 1963. Nihongo no ronri: Wa to ga [The logic of the Japanese language: Wa and ga]. Tokyo: Kurosio.","Nakanishi, K. 2001. Prosody and Information Structure in Japanese: A Case Study of Topic Marker Wa. In N. Akatsuka and S. Strauss, eds., Japanese/Korean Linguistics, vol. 10, pp.434-447. CSLI Publications. Noda, H. 1996. Wa to ga [Wa and ga]. Tokyo: Kurosio.","Ono, S. 1978. Nihongo no bunpô o kangaeru [On the grammar of the Japanese language]. Tokyo: Iwanami.","Oshima, D.Y. 2006. Boundary Tones or Prominent Particles?: Variation in Japanese Focus-Marking Contours. In Proceedings of Berkeley Linguistics Society, vol. 31, pp.453-464.","Oshima, D.Y. 2008. Morphological vs. Phonological Contrastive Topic Marking. In Proceedings of Chicago Linguistic Society, vol. 41 (Main Session), pp.371-384.","Oshima, D.Y. 2009. Topichood, Givenness, and the Particle Wa in Japanese: Reconsideration and Reconciliation. Manuscript, Ibaraki University.","Porter, P. and K. Yabushita. 1998. The Semantics and Pragmatics of Topic Phrases. Linguistics and Philosophy 21(2), 117-157. Shibatani, M. 1990. The Languages of Japan. Cambridge: Cambridge University Press.","Vallduvı́, E. and E. Engdahl. 1996. The Linguistic Realization of Information Packaging. Linguistics 34(3), 459-519. 414"]}]}