{"sections":[{"title":"  Chinese \\b\\trd\\fet D\\tmains: B\\t\\ttstrapping Chinese \\b\\trd\\fet with Semantic D\\tmain Labels ∗∗∗∗ ","paragraphs":["Lung-H\\b\\t Leea , \\fu-Ting \\fua",", \\bnd Chu-Ren Hu\\bnga,b  a","Institute \\tf Linguistics, Ac\\bdemi\\b Sinic\\b,","128 Ac\\bdemi\\b R\\t\\bd, Secti\\tn 2, T\\bipei 115, T\\biw\\bn {lungh\\b\\t, tin\\b0822, churen}@g\\bte.sinic\\b.edu.tw","b","Dep\\brtment \\tf Chinese & Bilingu\\bl Studies, The H\\tng K\\tng P\\tlytechnic University,","Hung H\\tm, K\\twl\\t\\tn, H\\tng K\\tng","churen.hu\\bng@inet.p\\tlyu.edu.hk Abstract. We b\\t\\ttstr\\bpped Chinese W\\trdNet with sem\\bntic d\\tm\\bin l\\bbels \\tf W\\trdNet D\\tm\\bins f\\tr c\\tnstructing \\b l\\bngu\\bge res\\turce c\\blled Chinese W\\trdNet D\\tm\\bins. The b\\t\\ttstr\\bpping meth\\tds w\\trk fr\\tm three \\bspects: 1) Princet\\tn W\\trdNet \\blignment, 2) lexic\\bl sem\\bntic rel\\bti\\tns \\bnd 3) d\\tm\\bin t\\bx\\tn\\tmy m\\bpping. Experiment\\bl results \\tf \\tur pr\\tp\\tsed b\\t\\ttstr\\bpping b\\bsed d\\tm\\bin predic\\bti\\tn \\bchieve s\\btisfying effects. We believe the resulting Chinese W\\trdNet D\\tm\\bins will be the first \\trient\\bl l\\bngu\\bge res\\turce, which c\\bn be used t\\t inter\\tper\\bte with the existing W\\trdNet D\\tm\\bins \\tf sever\\bl l\\bngu\\bges \\bnd benefits f\\tr cr\\tss-l\\bngu\\bge \\bnd d\\tm\\bin-specific rese\\brches \\bnd \\bpplic\\bti\\tns. In \\bdditi\\tn, we \\bls\\t pl\\bn t\\t rele\\bse resulting Chinese W\\trdNet D\\tm\\bins t\\t the c\\tmmunity f\\tr rese\\brch purp\\tses. Keyw\\trds: B\\t\\ttstr\\bpping, Chinese W\\trdNet, W\\trdNet D\\tm\\bins, Multi-l\\bbel. \\T \\T ∗ This w\\trk w\\bs funded by N\\bti\\tn\\bl Science C\\tuncil, T\\biw\\bn under Gr\\bnts NSC 97-2923-I-001-001-M\\f3, \\bnd","\\bls\\t c\\t\\tper\\bted with EU-FP7 K\\fOTO pr\\tject.  C\\tpyright 2009 by Lung-H\\b\\t Lee, \\fu-Ting \\fu, \\bnd Chu-Ren Hu\\bng"]},{"title":"1 Intr\\tducti\\tn","paragraphs":["Princet\\tn W\\trdNet is \\bn English lexic\\bl d\\bt\\bb\\bse th\\bt gr\\tups n\\tuns, verbs, \\bdjectives \\bnd \\bdverbs int\\t sets \\tf c\\tgnitive syn\\tnyms, which \\bre n\\bmed \\bs synsets (Fellb\\bum, 1998; Miller, 1995). The Gl\\tb\\bl W\\trdNet Ass\\tci\\bti\\tn (GWA), built \\tn the results \\tf Princet\\tn W\\trdNet \\bnd Eur\\t W\\trdNet (V\\tssen, 2004), is \\b free \\bnd public \\bss\\tci\\bti\\tn th\\bt pr\\tvides \\b pl\\btf\\trm th\\bt sh\\bres \\bnd c\\tnnects \\bll l\\bngu\\bges in the w\\trld. F\\tr M\\bnd\\brin Chinese in T\\biw\\bn, Hu\\bng et \\bl. (2004\\b) c\\tnstructed the Ac\\bdemi\\b Sinic\\b Bilingu\\bl Ont\\tl\\tgic\\bl W\\trdnet (Sinic\\b BOW), which integr\\btes W\\trdNet, English-Chinese Tr\\bnsl\\bti\\tn Equiv\\blents D\\bt\\bb\\bse (ECTED) \\bnd SUMO f\\tr cr\\tss-l\\bngu\\bge linguistic studies. As \\b f\\tll\\tw-up, Chinese W\\trdNet h\\bs been built \\bs \\b r\\tbust lexic\\bl kn\\twledge system which emb\\tdies \\b precise expressi\\tn \\tf sense \\bnd sense rel\\bti\\tns \\bs well (Hu\\bng et \\bl., 2008b). In recent ye\\brs, W\\trdNet-like res\\turces h\\bve bec\\tme \\tne \\tf the m\\tst reli\\bble \\bnd essenti\\bl res\\turce f\\tr linguistic studies f\\tr \\bll l\\bngu\\bges (Niles \\bnd Pe\\bse, 2003; Bud\\bnitsky \\bnd Hirst, 2006; S\\tri\\b et \\bl., 2009\\b ).","Sem\\bntic d\\tm\\bin l\\bbels, ch\\br\\bcterized by d\\tm\\bin-specific lexic\\b, \\bre pr\\tfit\\bbly used t\\t describe texts \\bnd w\\trd senses \\bcc\\trding t\\t gener\\bl subjects, such \\bs sp\\trt, fin\\bnce, \\bnd p\\tlitics. W\\trdNet D\\tm\\bins (M\\bgnini \\bnd C\\bv\\bgli\\b, 2000) w\\bs cre\\bted by extending the Princet\\tn W\\trdNet with d\\tm\\bins l\\bbels. Synsets h\\bve been semi-\\but\\tm\\btic\\blly \\bnn\\tt\\bted with \\bt le\\bst \\tne d\\tm\\bin l\\bbel. A d\\tm\\bin c\\bn include synsets \\tf different p\\brt-\\tf-speech \\bnd fr\\tm different W\\trdNet sub-hier\\brchies. S\\t f\\br the existing W\\trdNets such \\bs It\\bli\\bn W\\trdNet, 288 23rd Pacific Asia Conference on Language, Information and Computation, pages 288–296   Sp\\bin W\\trdNet, Hebrew W\\trdNet, \\bnd R\\tm\\bni\\bn W\\trdNet \\bre \\bnn\\tt\\bted with the s\\bme d\\tm\\bins l\\bbels fr\\tm W\\trdNet D\\tm\\bins. W\\trdNet D\\tm\\bins h\\bs been viewed \\bs \\bn imp\\trt\\bnt l\\bngu\\bge res\\turce f\\tr d\\tm\\bin-b\\bsed l\\bngu\\bge pr\\tcessing (M\\bgnini et \\bl, 2002\\b; 2002b; Gli\\tzz\\t, 2006).","In this study, we use b\\t\\ttstr\\bpping meth\\tds t\\t \\but\\tm\\btic\\blly \\bnn\\tt\\bte w\\trd senses \\tf Chinese W\\trdNet using sem\\bntic l\\bbels \\tf W\\trdNet D\\tm\\bins. The b\\t\\ttstr\\bpping meth\\tds w\\trk fr\\tm three \\bspects: 1) Princet\\tn W\\trdNet \\blignment, 2) lexic\\bl sem\\bntic rel\\bti\\tns \\bnd 3) d\\tm\\bin t\\bx\\tn\\tmy m\\bpping. We believe the resulting Chinese W\\trdNet D\\tm\\bins will be the first \\trient\\bl l\\bngu\\bge res\\turce, which c\\bn be used t\\t inter\\tper\\bte with existing \\tf W\\trdNet D\\tm\\bins \\tf sever\\bl l\\bngu\\bges \\bnd benefit f\\tr cr\\tss-l\\bngu\\bge \\bnd d\\tm\\bin-specific rese\\brches \\bnd \\bpplic\\bti\\tns.","The rest \\tf this p\\bper is \\trg\\bnized \\bs f\\tll\\tws: Secti\\tn 2 intr\\tduces rel\\bted studies \\tn Chinese W\\trdNet \\bnd W\\trdNet D\\tm\\bins. Secti\\tn 3 describes the b\\t\\ttstr\\bpping meth\\tds f\\tr \\but\\tm\\btic\\blly \\bnn\\tt\\bting sem\\bntic d\\tm\\bin l\\bbels using Chinese W\\trdNet \\bnd W\\trdNet D\\tm\\bins. Perf\\trm\\bnce ev\\blu\\bti\\tn \\bnd experiment\\bl results \\bre presented in Secti\\tn 4. We discuss the resulting Chinese W\\trdNet D\\tm\\bins \\bnd its \\bpplic\\bti\\tn scen\\bri\\ts in Secti\\tn 5. Secti\\tn 6 c\\tncludes this study with future rese\\brch"]},{"title":"2 Related \\b\\trk","paragraphs":["The secti\\tn is dev\\tted t\\t relev\\bnt studies \\tn Chinese W\\trdNet \\bnd W\\trdNet D\\tm\\bins."]},{"title":"2.1 Chinese \\b\\trd\\fet","paragraphs":["Cre\\bting \\b sem\\bntic rel\\bti\\tn-b\\bsed l\\bngu\\bge res\\turce is \\b time c\\tnsuming \\bnd l\\bb\\tr intensive t\\bsk, especi\\blly f\\tr Chinese, due t\\t the un\\tbvi\\tus definiti\\tn \\bnd distincti\\tn \\bm\\tng ch\\br\\bcters, m\\trphemes \\bnd w\\trds. Chinese W\\trdNet1","(CWN) is built by Ac\\bdemi\\b Sinic\\b \\bnd h\\bs successively extended its sc\\tpe s\\t f\\br. Lemm\\bs included in CWN m\\binly f\\bll \\tn the medium frequency w\\trds. E\\bch lexic\\bl entry is \\bn\\blyzed \\bcc\\trding t\\t the guidelines \\tf Chinese w\\trd sense distincti\\tns (CKIP, 2003; Hu\\bng et \\bl. 2003\\b) which c\\tnt\\bin inf\\trm\\bti\\tn including P\\brt- \\tf-Speech, sense definiti\\tn, ex\\bmple sentences, c\\trresp\\tnding English synset(s) fr\\tm Princet\\tn W\\trdNet, lexic\\bl sem\\bntic rel\\bti\\tns \\bnd s\\t \\tn. Unlike Princet\\tn W\\trdNet, CWN h\\bs n\\tt been c\\tnstructed m\\binly \\tn the synsets \\bnd sem\\bntic rel\\bti\\tns. R\\bther, it f\\tcuses t\\t pr\\tvide precise expressi\\tn f\\tr the Chinese sense divisi\\tn \\bnd the sem\\bntic rel\\bti\\tns needs t\\t be b\\bsed \\tn the linguistic the\\tries, especi\\blly lexic\\bl sem\\bntics (Hu\\bng et \\bl., 2008b). M\\tre\\tver, Hu\\bng et \\bl. (2005\\b) designed \\bnd implemented the Sinic\\b Sense M\\bn\\bgement System (SSMS) t\\t st\\tre \\bnd m\\bn\\bge w\\trd sense d\\bt\\b gener\\bted in the \\bn\\blysis st\\bge. SSMS is me\\bning-driven. E\\bch sense \\tf \\b lemm\\b is identified specific\\blly using \\b unique identifier \\bnd given \\b sep\\br\\bte entry. There \\bre 8,628 lemm\\bs /25,938 senses \\bn\\blyzed \\bnd st\\tred in SSMS until December 2008. Lee et \\bl (2009) used W\\trdNet-LMF (S\\tri\\b et \\bl., 2009b) t\\t represent lexic\\bl sem\\bntics in Chinese W\\trdNet. The c\\tmpiled CWN-LMF will be rele\\bsed t\\t the c\\tmmunity f\\tr linguistic rese\\brches. Figure 1 sh\\tws the result \\tf the n\\tun 植物 (zhi2 wu4, pl\\bnt) in Chinese W\\trdNet.","Hu\\bng et \\bl. (2004b) pr\\tp\\tsed D\\tm\\bin Lexic\\t-T\\bx\\tn\\tmy (DLT) \\bs \\b d\\tm\\bin t\\bx\\tn\\tmy p\\tpul\\bted with lexic\\bl entries. By using DLT with Chinese W\\trdNet \\bnd D\\tm\\bin T\\bx\\tn\\tmy, there were 2,541 Chinese senses th\\bt \\bre linked with \\bnd distributed in 141 d\\tm\\bin n\\tdes. In \\bdditi\\tn, Hu\\bng et \\bl. (2005b) further \\bpplied DLT \\bppr\\t\\bch t\\t \\b Chinese thes\\burus c\\blled CiLin \\bnd sh\\twed with ev\\blu\\bti\\tn th\\bt DLT \\bppr\\t\\bch is r\\tbust since the size \\bnd number \\tf d\\tm\\bin lexic\\b incre\\bsed effectively. \\T \\T 1 Chinese W\\trdNet, \\bv\\bil\\bble \\tnline \\bt http://cwn.ling.sinic\\b.edu.tw/ 289    Figure 1: The three senses \\tf the n\\tun 植物 (zhi2 wu4, pl\\bnt) return by Chinese W\\trdNet. "]},{"title":"2.2 \\b\\trd\\fet D\\tmains","paragraphs":["W\\trdNet D\\tm\\bins2","is \\b linguistic res\\turce c\\tnstructed by ITC-IRST where the Princet\\tn W\\trdNet is \\bugmented with d\\tm\\bin l\\bbels (M\\bgnini \\bnd C\\bv\\bgli\\b, 2000). Synsets h\\bve been semi-\\but\\tm\\btic\\blly \\bnn\\tt\\bted with \\bt le\\bst \\tne d\\tm\\bin l\\bbels. These d\\tm\\bin l\\bbels, such \\bs Music, Tr\\bnsp\\trt, \\bnd L\\bw, \\bre selected fr\\tm \\b set \\tf \\bb\\tut 200 l\\bbels th\\bt \\bre hier\\brch\\blly \\trg\\bnized referred t\\t the Dewey Decim\\bl Cl\\bssific\\bti\\tn (DDC). M\\bgnini \\bnd C\\bv\\bgli\\b (2000) m\\bnu\\blly \\bnn\\tt\\bted \\b sm\\bll number \\tf high level synsets with their d\\tm\\bin l\\bbels. Then, \\bn \\but\\tm\\btic pr\\tcedure expl\\tited s\\tme \\tf the W\\trdNet rel\\bti\\tns t\\t extend the m\\bnu\\bl \\bssignment t\\t the re\\bch\\bble synsets. In \\bdditi\\tn, \\bn excepti\\tn pr\\tcedure w\\bs used t\\t prevent \\b wr\\tng pr\\tp\\bg\\bti\\tn. Bentiv\\tgli et \\bl. (2004) further revised the W\\trdNet D\\tm\\bins Hier\\brchy (WDH) with \\b cle\\br sem\\bntics \\bnd ev\\blu\\bted the c\\tver\\bge \\bnd b\\bl\\bncing \\tf B\\bsic D\\tm\\bins \\tf WDH. The l\\btest versi\\tn, W\\trdNet D\\tm\\bins 3.2, c\\tnt\\bins the m\\bpping between Princet\\tn W\\trdNet 2.0 synsets \\bnd their c\\trresp\\tnding d\\tm\\bins. 45 B\\bsic D\\tm\\bins \\tf t\\tt\\bl 168 d\\tm\\bins \\bre used t\\t \\bnn\\tt\\bte W\\trdNet synsets. T\\bke “00197005-n hist\\try l\\bw” f\\tr ex\\bmple, “00197005-n” is the synset \\tff set \\bnd P\\brt-\\tf-Speech \\bnd “hist\\try l\\bw” is the list \\tf d\\tm\\bins \\bss\\tci\\bted t\\t the synset. N\\ttice th\\bt \\bn \\bdditi\\tn\\bl l\\bbel n\\bmed \\bs “F\\bct\\ttum” w\\bs \\bssign t\\t Generic synset, which w\\bs h\\brd t\\t cl\\bssify in \\b specific d\\tm\\bin \\bnd St\\tp senses synsets, which \\bppe\\bred frequently in different c\\tntexts, such \\bs c\\tl\\trs, numbers, week d\\bys \\bnd s\\t f\\trth. S\\t f\\br the existing W\\trdnets such \\bs It\\bli\\bn W\\trdnet, Sp\\bin W\\trdNet, Hebrew W\\trdnet, \\bnd R\\tm\\bni\\bn W\\trdnet \\bre \\bnn\\tt\\bted with the s\\bme d\\tm\\bin l\\bbels fr\\tm W\\trdNet D\\tm\\bins. M\\tre\\tver, W\\trdNet D\\tm\\bins h\\bs been expl\\tited in the fr\\bmew\\trk \\tf MultiW\\trdNet (Pi\\bnt\\b et \\bl., 2002) \\bnd c\\tnsidered \\b cruci\\bl l\\bngu\\bge res\\turce f\\tr NLP t\\bsks, such \\bs W\\trd Sense Dis\\bmbigu\\bti\\tn (Gli\\tzz\\t et \\bl. 2004; K\\tlte \\bnd Bhirud, 2008; M\\bgnini et \\bl. 2002b) \\bnd Text C\\bteg\\triz\\bti\\tn (K\\btsi\\tuli et \\bl. 2007; Vázquez et \\bl. 2006). \\T \\T 2 W\\trdNet D\\tm\\bins, \\bv\\bil\\bble \\tnline \\bt http://wnd\\tm\\bins.itc.it/w\\trdnetd\\tm\\bins.html 290  "]},{"title":"3 B\\t\\ttstrapping Semantic D\\tmain Labels","paragraphs":["The secti\\tn describes \\tur pr\\tp\\tsed b\\t\\ttstr\\bpping meth\\tds using Chinese W\\trdNet \\bnd W\\trdNet D\\tm\\bins. Chinese W\\trdNet f\\tcuses t\\t pr\\tvide precise expressi\\tn f\\tr the Chinese sense divisi\\tn \\bnd lexic\\bl sem\\bntic rel\\bti\\tns. In \\bdditi\\tn, p\\brti\\bl senses \\bre \\bnn\\tt\\bted with d\\tm\\bin n\\tdes fr\\tm D\\tm\\bin Lexic\\t-T\\bx\\tn\\tmy. W\\trdNet D\\tm\\bins c\\tnt\\bins the m\\bpping between Princet\\tn W\\trdNet 2.0 synsets \\bnd their c\\trresp\\tnding d\\tm\\bins. Synsets h\\bve been semi-\\but\\tm\\btic\\blly \\bnn\\tt\\bted with \\bt le\\bst \\tne d\\tm\\bin l\\bbel, which is selected fr\\tm Dewey Decim\\bl Cl\\bssific\\bti\\tn (DDC).","Since cr\\tss-lingu\\bl lexic\\bl sem\\bntic rel\\bti\\tn inferences were ex\\bmined by b\\t\\ttstr\\bpping \\b Sinic\\b BOW with Princet\\tn W\\trdNet (Hu\\bng et \\bl. 2002; 2003b), we decide t\\t use b\\t\\ttstr\\bpping meth\\tds f\\tr c\\tnstructing \\b l\\bngu\\bge res\\turces n\\bmed \\bs Chinese W\\trdNet D\\tm\\bins. By using \\bn existing W\\trdNet D\\tm\\bins \\bs \\b medium, we \\but\\tm\\btic\\blly \\bnn\\tt\\bte w\\trd senses \\tf Chinese W\\trdNet with sem\\bntic d\\tm\\bin l\\bbels fr\\tm three \\bspects: 1) Princet\\tn W\\trdNet \\blignment, 2) lexic\\bl sem\\bntic rel\\bti\\tns \\bnd 3) d\\tm\\bin t\\bx\\tn\\tmy m\\bpping. Det\\bils will be described \\bs the f\\tll\\twing subsecti\\tns."]},{"title":"3.1 Alignment-mediated D\\tmain Predicti\\tn","paragraphs":["W\\trd senses \\tf Chinese W\\trdNet \\bre strictly \\bligned with the c\\trresp\\tnding synsets \\tf Princet\\tn W\\trdNet; theref\\tre, we c\\bn use \\blignment-medi\\bted inf\\trm\\bti\\tn t\\t b\\t\\ttstr\\bp \\b Chinese versi\\tn \\tf W\\trdNet D\\tm\\bins. Figure 2 dem\\tnstr\\btes the b\\t\\ttstr\\bpping meth\\td b\\bsed \\tn \\blignment-medi\\bted d\\tm\\bin predicti\\tn: CW1 st\\bnds f\\tr the Chinese sense which c\\bn be \\bligned t\\t English sense, EW1, thr\\tugh equ\\bl syn\\tnymy rel\\bti\\tn. DDC represents the Dewey Decim\\bl Cl\\bssific\\bti\\tn where the d\\tm\\bin l\\bbels \\bre selected fr\\tm. If EW1 is \\bnn\\tt\\bted with \\bt le\\bst \\tne sem\\bntic d\\tm\\bin selected fr\\tm DDC, \\bnd EW1 is \\bligned t\\t CW1, then CW1 c\\bn be predic\\bted with the s\\bme d\\tm\\bin l\\bbels \\tf EW1. F\\tr ex\\bmple, “04071401-n” is the first sense \\tf the lemm\\b 愛迪生 (Edis\\tn), which is \\bligned t\\t Princet\\tn W\\trdNet 2.0 synset “10235982n”. In W\\trdNet D\\tm\\bins, “pers\\tn” is the list \\tf d\\tm\\bins \\bss\\tci\\bted t\\t the synset “10235982-n”. B\\bse \\tn \\blignment-medi\\bted d\\tm\\bin predicti\\tn, 04071401-n (“愛 迪 生 _1”) \\tf Chinese W\\trdNet will be \\bnn\\tt\\bted with d\\tm\\bin “pers\\tn”. "," Figure 2: Alignment-medi\\bted d\\tm\\bin predicti\\tn."]},{"title":"3.2 LSR-mediated D\\tmain Predicti\\tn","paragraphs":["In Chinese W\\trdNet, sever\\bl lexic\\bl sem\\bntic rel\\bti\\tns, including syn\\tnym, hypernym, hyp\\tnym, \\bnt\\tnym \\bnd s\\t f\\trth, \\bre m\\bnu\\blly \\bnn\\tt\\bted t\\t the c\\trresp\\tnding senses. If \\b sense h\\bs been \\bnn\\tt\\bted with d\\tm\\bin l\\bbels \\tf W\\trdNet D\\tm\\bins b\\bsed \\tn \\blignment-medi\\bted 291   d\\tm\\bin predicti\\tn, we c\\bn further infer the d\\tm\\bin l\\bbels t\\t senses which \\bre n\\tt t\\bgged thr\\tugh well-defined lexic\\bl sem\\bntic rel\\bti\\tns.","Figure 3 illustr\\btes Lexic\\bl Sem\\bntic Rel\\bti\\tns (LSRs) b\\bsed d\\tm\\bin predicti\\tn. CW1 represents the Chinese sense th\\bt is \\bnn\\tt\\bted with sem\\bntic d\\tm\\bins fr\\tm DDC by \\blignmentmedi\\bted d\\tm\\bin predicti\\tn. If there \\bre existing LSRs between CW1 \\bnd CW2, CW2 will be predic\\bted with the s\\bme d\\tm\\bin l\\bbels \\tf CW1 thr\\tugh LSRs. We used f\\tur LSRs \\tf Chinese W\\trdNet t\\t infer d\\tm\\bin l\\bbels, i.e. syn\\tnymy, ne\\br- syn\\tnymy, p\\br\\bnymy \\bnd v\\bri\\bnts. Am\\tng these LSRs, the sem\\bntic rel\\bti\\tn p\\br\\bnymy is used t\\t refer t\\t rel\\bti\\tn between \\bny tw\\t lexic\\bl items bel\\tnging t\\t the s\\bme sem\\bntic cl\\bssific\\bti\\tn (Hu\\bng et \\bl. 2008\\b). F\\tr ex\\bmple, the set \\tf “spring/summer/f\\bll/winter” h\\bs p\\br\\bnymy rel\\bti\\tn \\tf m\\bin c\\tncept \\tf “se\\bs\\tns in \\b ye\\br”. Furtherm\\tre, the rel\\bti\\tn v\\bri\\bnts den\\tte the v\\bri\\bti\\tn \\tf Chinese ch\\br\\bcters (H\\tng et \\bl. 2005). F\\tr inst\\bnce, “為什麼” \\bnd “為甚麼” b\\tth represent the me\\bning “why” but use different writing n\\tt\\bti\\tn t\\t st\\bnd f\\tr the sec\\tnd ch\\br\\bcter. T\\bke the sec\\tnd sense \\tf the lemm\\b “水瓶座” (Aqu\\brius) f\\tr ex\\bmple, since “05085502-n” (水瓶座_2) h\\bs been \\bnn\\tt\\bted \\bs “\\bstr\\tl\\tgy” fr\\tm \\blignment-medi\\bted d\\tm\\bin predicti\\tn, \\bnd “05181002-n” (摩 羯 座 _2, C\\bpric\\trns) is the p\\br\\bnymy \\tf “05085502-n”, s\\t the d\\tm\\bin l\\bbels \\tf “05181002-n” is determined \\bs “\\bstr\\tl\\tgy” b\\bsed \\tn LSR-medi\\bted d\\tm\\bin predicti\\tn.",""]},{"title":"CW","paragraphs":["1"]},{"title":"CW","paragraphs":["2"]},{"title":"DDC LSRs   Figure 3:","paragraphs":["LSR-medi\\bted d\\tm\\bin predicti\\tn."]},{"title":"3.3 Mapping-mediated D\\tmain Predicti\\tn","paragraphs":["S\\t f\\br s\\tme senses \\tf Chinese W\\trdNet \\bre \\bnn\\tt\\bted with d\\tm\\bin n\\tdes fr\\tm D\\tm\\bin Lexic\\t-T\\bx\\tn\\tmy (DLT) (Hu\\bng et \\bl. 2004b). If the m\\bpping \\tf d\\tm\\bin n\\tdes \\tf DLT \\bnd sem\\bntic d\\tm\\bins fr\\tm DDC is well-defined, we c\\bn \\bnn\\tt\\bte the senses with sem\\bntic d\\tm\\bins \\tf W\\trdNet D\\tm\\bins b\\bsed \\tn m\\bpping-medi\\bted d\\tm\\bin predicti\\tn.","Figure 4 dem\\tnstr\\btes the b\\t\\ttstr\\bpping meth\\td b\\bsed \\tn m\\bpping-medi\\bted d\\tm\\bin predicti\\tn: CW1 represents the Chinese sense which is \\bnn\\tt\\bted with d\\tm\\bin n\\tdes fr\\tm DLT. If the m\\bpping \\tf DLT \\bnd DDC c\\bn be c\\tnstructed, CW1 will be predic\\bted with d\\tm\\bin l\\bbels \\tf DDC thr\\tugh DLT-m\\bpping. F\\tr ex\\bmple, “06736101-n” is the first sense \\tf the first lemm\\b 佛 (Buddh\\b), \\bnd “06736101-n” (佛 1_1) is \\bnn\\tt\\bted with the d\\tm\\bin n\\tde 佛教 (Buddhism). After m\\bpping \\tf DLT \\bnd DDC, 佛教 (Buddhism) is m\\bpped int\\t “religi\\tn”, s\\t “06736101-n” is \\bnn\\tt\\bted with “religi\\tn” fr\\tm W\\trdNet D\\tm\\bins."," 292  "]},{"title":"CW","paragraphs":["1"]},{"title":"DDCM\\bppingDLT   Figure 4:","paragraphs":["M\\bpping-medi\\bted d\\tm\\bin predicti\\tn."]},{"title":"4 Experiments and Perf\\trmance Evaluati\\tn 4.1 Data Sets","paragraphs":["We used Chinese W\\trdNet 1.6 \\bnd W\\trdNet D\\tm\\bins 3.2 t\\t b\\t\\ttstr\\bp the resulting Chinese W\\trdNet D\\tm\\bins. In Chinese W\\trdNet 1.6, 8,628 lemm\\bs / 25,938 senses h\\bve been \\bn\\blyzed. Am\\tng these senses, there \\bre 18,789 syn\\tnyms, 1,801 ne\\br-syn\\tnyms, 3,029 p\\br\\bnyms \\bnd 923 v\\bri\\bnts. In \\bdditi\\tn, 2,541 senses in Chinese W\\trdNet 1.6 h\\bve been \\bnn\\tt\\bted with d\\tm\\bin l\\bbels fr\\tm DLT. W\\trdNet D\\tm\\bins 3.2 c\\tnt\\bins the m\\bpping between Princet\\tn W\\trdNet 2.0 synsets \\bnd their c\\trresp\\tnding d\\tm\\bins. 45 B\\bsic D\\tm\\bins \\tf t\\tt\\bl 168 d\\tm\\bins \\bre used t\\t \\bnn\\tt\\bte W\\trdNet synsets. 115,424 synsets in Princet\\tn W\\trdNet 2.0 synsets h\\bve been \\bnn\\tt\\bted with \\bt le\\bst \\tne d\\tm\\bin l\\bbels fr\\tm DDC. Am\\tng these \\bnn\\tt\\bted synsets, 40,995 synsets h\\bve d\\tm\\bin l\\bbel, “F\\bct\\ttum,” representing synsets th\\bt d\\t n\\tt bel\\tng t\\t \\bny specific sem\\bntic d\\tm\\bins."]},{"title":"4.2 Evaluati\\tn Criteria","paragraphs":["F\\tr e\\bch sense in Chinese W\\trdNet 1.6, the b\\t\\ttstr\\bpping meth\\tds gener\\bte \\b list \\tf l\\bbels – the sem\\bntic d\\tm\\bins t\\t which the sense p\\tssibly bel\\tngs. In \\trder t\\t me\\bsure the perf\\trm\\bnces \\tf \\tur pr\\tp\\tsed meth\\tds, we used the next three me\\bsures: multi-l\\bbel precisi\\tn, multi-l\\bbel rec\\bll, \\bnd multi-l\\bbel F-me\\bsure, which \\bre well-kn\\twn in multi-l\\bbel cl\\bssific\\bti\\tn pr\\tblem. We defined these me\\bsures \\bs the f\\tll\\twing equ\\bti\\tns with n\\tt\\bti\\tns \\bd\\bpted t\\t \\tur pr\\tblem. "]},{"title":"labels\\b\\tedi\\fated labels\\b\\tedi\\fatedlabels\\fo\\t\\te\\ft e\\fision _ __ Pr I =","paragraphs":["(1) "]},{"title":"labels\\fo\\t\\te\\ft labels\\b\\tedi\\fatedlabels\\fo\\t\\te\\ft \\fall _ __ Re I =","paragraphs":["(2) "]},{"title":"\\falle\\fision \\falle\\fision measu\\teF RePr Re*Pr*2 +=−","paragraphs":["(3)  293   Where labels\\b\\tedi\\fated_ den\\ttes the number \\tf \\b list \\tf l\\bbels predic\\bted f\\tr \\b sense by \\tur pr\\tp\\tsed b\\t\\ttstr\\bpping meth\\tds; labels\\fo\\t\\te\\ft_ is the number \\tf kn\\twn c\\trrect list \\tf l\\bbels f\\tr \\b sense; labels\\b\\tedi\\fatedlabels\\fo\\t\\te\\ft __ I is the number \\tf c\\trrectly predic\\bted list \\tf l\\bbels f\\tr \\b sense. F\\tr ex\\bmple, if well kn\\twn c\\trrect list \\tf l\\bbels \\tf \\b sense is A, B, C, D \\bnd \\tur pr\\tp\\tsed meth\\td predic\\bted \\bs B, C, E, in this c\\bse,","labels\\b\\tedi\\fated_ is 3 (i.e. B, C, E); labels\\fo\\t\\te\\ft_ is 4 (i.e. A, B, C, D);","labels\\b\\tedi\\fatedlabels\\fo\\t\\te\\ft __ I is 2 (i.e. B, C), s\\t the precisi\\tn is 0.67 \\bnd the rec\\bll is 0.5. A precisi\\tn \\tf 0.67 me\\bns th\\bt \\bt le\\bst tw\\t l\\bbels is c\\trrect if \\tur pr\\tp\\tsed meth\\td predic\\bted \\b list \\tf 3 l\\bbels \\bs \\tutput. Simil\\brly, we get \\b rec\\bll \\tf 0.5 when \\b h\\blf \\tf d\\tm\\bin l\\bbels c\\bn be c\\trrectly predicted. We use m\\bcr\\t-\\bver\\bging precisi\\tn, rec\\bll, \\bnd F-me\\bsure \\bs \\tur experiment\\bl ev\\blu\\bti\\tn criteri\\b."]},{"title":"4.3 Experimental Results","paragraphs":["We m\\bnu\\blly \\bnn\\tt\\bted the senses which \\bre n\\tt predic\\bted \\bs “F\\bct\\ttum” \\bs gr\\tund truth f\\tr perf\\trm\\bnce ev\\blu\\bti\\tn"]},{"title":".","paragraphs":["T\\bble 1 sh\\tws the perf\\trm\\bnce ev\\blu\\bti\\tn \\tf \\tur pr\\tp\\tsed b\\t\\ttstr\\bpping meth\\tds. Our pr\\tp\\tsed m\\bpping-medi\\bted d\\tm\\bin predic\\bti\\tn \\bchieved the best results, which sc\\tred \\b precisi\\tn \\tf 97.15%, \\b rec\\bll \\tf 96.33% \\bnd \\bn F me\\bsure \\tf 96.6%. In \\bdditi\\tn, experiment\\bl results indic\\bted \\blignment-medi\\bted d\\tm\\bin predic\\bti\\tn sc\\tred \\b precisi\\tn \\tf 83.86%, \\b rec\\bll \\tf 82.72%, \\bnd \\bn F me\\bsure \\tf 82.46% \\bs c\\tmp\\bred t\\t \\b precisi\\tn \\tf 70.4%, \\b rec\\bll \\tf 69.83%, \\bnd \\b F me\\bsure \\tf 69.54% f\\tr LSR-medi\\bted d\\tm\\bin predic\\bti\\tn. Table 1: Perf\\trm\\bnce ev\\blu\\bti\\tn \\tf \\tur pr\\tp\\tsed b\\t\\ttstr\\bpping meth\\tds.","Meth\\tds #Sense Precisi\\tn (%) Rec\\bll (%) F me\\bsure (%)","Alignment-medi\\bted 6,669 83.86 82.72 82.46 LSR-medi\\bted 174 70.4 69.83 69.54 M\\bpping-medi\\bted 2,350 97.15 96.33 96.6"]},{"title":"5 Discussi\\tn","paragraphs":["Experiment\\bl results indic\\bted m\\bpping-medi\\bted d\\tm\\bin predicti\\tn c\\bn \\bchieve the best effects. It is bec\\buse d\\tm\\bin t\\bx\\tn\\tmy m\\bpping is m\\tre cl\\brifying if the senses \\bre \\blre\\bdy m\\bnu\\blly \\bnn\\tt\\bting with \\trigin\\bl d\\tm\\bin t\\bx\\tn\\tmy. On the \\tther h\\bnd, LSR-medi\\bted d\\tm\\bin predicti\\tn \\bchieved the w\\trse effect. The m\\bin re\\bs\\tn f\\tr this c\\bse is th\\bt LSR-medi\\bted is b\\bsed \\tn \\blignment-medi\\bted d\\tm\\bin predicti\\tn meth\\td. Theref\\tre, it c\\bnn\\tt \\tbt\\bin better results th\\bn \\blignment-medi\\bted b\\t\\ttstr\\bpping. Since m\\bnu\\blly c\\tnstructed l\\bngu\\bge res\\turces c\\tnt\\bin inc\\tnsistencies \\bnd err\\trs, \\tur pr\\tp\\tsed meth\\tds use Chinese W\\trdNet \\bnd W\\trdNet D\\tm\\bins t\\t \\but\\tm\\btic\\blly b\\t\\ttstr\\bp sem\\bntic d\\tm\\bin l\\bbels \\tbt\\bin \\bt le\\bst s\\btisfying effects.","We c\\bn further use the resulting Chinese W\\trdNet D\\tm\\bins \\bs the t\\t\\tl f\\tr qu\\blity \\bssur\\bnce \\tf Chinese W\\trdNet \\bnd W\\trdNet D\\tm\\bins. F\\tr ex\\bmple, we c\\bn check the inc\\tnsistencies \\tf writing v\\bri\\bnts \\tf the s\\bme sense with the different sem\\bntic d\\tm\\bin l\\bbels t\\t verify the c\\trrectness \\tf lexic\\bl sem\\bntic rel\\bti\\tns \\bnd sense \\blignment t\\t Princet\\tn W\\trdNet in Chinese W\\trdNet. M\\tre\\tver, we c\\bn inter\\tper\\bte \\bnd exch\\bnge linguistic inf\\trm\\bti\\tn in Chinese W\\trdNet D\\tm\\bins with W\\trdNet D\\tm\\bins \\tf sever\\bl l\\bngu\\bges t\\t f\\trm cr\\tss-l\\bngu\\bge res\\turces f\\tr rese\\brch purp\\tses. In \\bdditi\\tn, we c\\bn put the senses with the s\\bme d\\tm\\bin l\\bbel t\\tgether \\bs d\\tm\\bin-specific lexic\\tns f\\tr d\\tm\\bin-specific \\bpplic\\bti\\tns.",""," 294  "]},{"title":"6 C\\tnclusi\\tns","paragraphs":["We b\\t\\ttstr\\bpped Chinese W\\trdNet with sem\\bntic d\\tm\\bin l\\bbels using W\\trdNet D\\tm\\bins t\\t c\\tnstruct \\b l\\bngu\\bge res\\turce c\\blled \\bs Chinese W\\trdNet D\\tm\\bins. The b\\t\\ttstr\\bpping meth\\tds w\\trk fr\\tm three \\bspects: 1) Princet\\tn W\\trdNet \\blignment, 2) lexic\\bl sem\\bntic rel\\bti\\tns \\bnd 3) d\\tm\\bin t\\bx\\tn\\tmy m\\bpping. Experiment\\bl results indic\\bted \\tur pr\\tp\\tsed b\\t\\ttstr\\bpping b\\bsed d\\tm\\bin predic\\bti\\tn \\bchieve s\\btisfying effects. We believe the resulting Chinese W\\trdNet D\\tm\\bins will be the first \\trient\\bl l\\bngu\\bge res\\turce, which c\\bn be used t\\t inter\\tper\\bte with existing \\tf W\\trdNet D\\tm\\bins \\tf sever\\bl l\\bngu\\bges \\bnd benefit f\\tr cr\\tss-l\\bngu\\bge \\bnd d\\tm\\bin-specific rese\\brches \\bnd \\bpplic\\bti\\tns.","Future w\\trk is investig\\bted \\bl\\tng sever\\bl directi\\tns. An \\bttempt t\\t use Chinese W\\trdNet D\\tm\\bins \\bs extern\\bl res\\turces f\\tr d\\tm\\bin-specific sem\\bntic se\\brch is \\tng\\ting. In \\bdditi\\tn, since W\\trdNet \\tf sever\\bl l\\bngu\\bges h\\bve been \\bnn\\tt\\bted with the s\\bme d\\tm\\bin l\\bbels, cr\\tssl\\bngu\\bge inf\\trm\\bti\\tn retriev\\bl using Chinese W\\trdNet D\\tm\\bins will \\bls\\t be investig\\bted. Fin\\blly, we \\bls\\t pl\\bn t\\t rele\\bse resulting Chinese W\\trdNet D\\tm\\bins t\\t the c\\tmmunity f\\tr rese\\brch purp\\tses."]},{"title":"References","paragraphs":["Bentiv\\tgli, L., P. F\\trner, B. M\\bgnini \\bnd E. Pi\\bnt\\b. 2004. Revising W\\trdNet D\\tm\\bins Hier\\brchy: Sem\\bntics, C\\tver\\bge, \\bnd B\\bl\\bncing. P\\to\\feedings of COLING Wo\\tksho\\b on Multilingual Linguisti\\f Resou\\t\\fes. Bud\\bnitsky, A. \\bnd G. Hirst. 2006. Ev\\blu\\bting W\\trdNet-b\\bsed Me\\bsures \\tf Lexic\\bl Sem\\bntic Rel\\btedness. Com\\butational Linguisti\\fs, 32(1), 13-47. CKIP. 2003. Sense and Sensibility Vol. I. Technic\\bl Rep\\trt 03-01. T\\bipei: Ac\\bdemi\\b Sinic\\b. Fellb\\bum, C. 1998. Wo\\tdNet: an Ele\\ft\\toni\\f Lexi\\fal Database. The MIT Press.","Gli\\tzz\\t, A., C. Str\\bpp\\br\\bv\\b \\bnd I. D\\bg\\bn. 2004. Unsupervised \\bnd Supervised Expl\\tit\\bti\\tn \\tf Sem\\bntic D\\tm\\bins in Lexic\\bl Dis\\bmbigu\\bti\\tn. Com\\bute\\t S\\bee\\fh and Language, 18(3), 275-299.","Gli\\tzz\\t, A. 2006. Sem\\bntic D\\tm\\bins \\bnd Linguistic The\\try. P\\to\\feedings of the LREC Wo\\tksho\\b on Towa\\td Com\\butational Models of Lite\\ta\\ty Analysis.","H\\tng, J.-F., C.-R. Hu\\bng \\bnd \\f.-J. Wu. 2005. T\\tw\\brds \\b Study \\tn the lexic\\bl Sem\\bntics \\tf Ch\\br\\bcter- \\bnd W\\trd- V\\bri\\bnts. P\\to\\feedings of the 6th","Chinese Lexi\\fal Semanti\\fs Wo\\tksho\\b.","Hu\\bng, C.-R., B. S. Ts\\bi, C.-X. Weng, N.-X. Chu, W.-R. H\\t, L.-W. Hu\\bng \\bnd I.-N. Ts\\bi. 2003\\b. Sense \\bnd Me\\bning F\\bcet: Criteri\\b \\bnd Oper\\bti\\tn\\bl Guidelines f\\tr Chinese Sense Distincti\\tn. P\\to\\feedings of the 4th","Chinese Lexi\\fal Semanti\\fs Wo\\tksho\\b.","Hu\\bng, C.-R., C.-L. Chen, C.-X. Weng, X.-B. Li, \\f.-X. Chen \\bnd K.-J. Chen. 2005\\b. The Sinic\\b Sense M\\bn\\bgement System: Design \\bnd Implement\\bti\\tn. Com\\butational Linguisti\\fs and Chinese Language P\\to\\fessing, 10(4), 417-430.","Hu\\bng, C.-R., I.-J. Tseng \\bnd B. S. Ts\\bi. 2002. Tr\\bnsl\\bting Lexic\\bl Sem\\bntic Rel\\bti\\tns: The First Step t\\tw\\brds Multilingu\\bl W\\trdNets. P\\to\\feedings of the COLING Wo\\tksho\\b on SemaNet: Building and Using Semanti\\f Netwo\\tks.","Hu\\bng, C.-R., I.-J. Tseng, B. S. Ts\\bi \\bnd B. Murphy. 2003b. Cr\\tss-lingu\\bl P\\trt\\bbility \\tf Sem\\bntic Rel\\bti\\tns: B\\t\\tstr\\bpping Chinese W\\trdNet with English W\\trdNet Rel\\bti\\tns. Language and Linguisti\\fs, 4(3), 509-532.","Hu\\bng, C.-R., I.-L. Su, P.-\\f. Hsi\\b\\t \\bnd X.-L. Ke. 2008. P\\br\\bnymy: Enriching Ont\\tl\\tgic\\bl Kn\\twledge in W\\trdNets. P\\to\\feedings of the 4th","Global Wo\\tdNet Confe\\ten\\fe. 295  ","Hu\\bng, C.-R., R.-\\f. Ch\\bng \\bnd X.-B. Li. 2004\\b. Sinic\\b BOW (Bilingu\\bl Ont\\tl\\tgic\\bl W\\trdnet): Integr\\bti\\tn \\tf Bilingu\\bl W\\trdNet \\bnd SUMO. P\\to\\feedings of the 4th","Inte\\tnational Confe\\ten\\fe on Language Resou\\t\\fes and Evaluation.","Hu\\bng, C.-R., S.-K. Hsieh, J.-F. H\\tng, \\f.-Z. Chen, I-L. Su, \\f.-X. Chen \\bnd S.-W. Hu\\bng. 2008b. Chinese W\\trdnet: Design, Implement\\bti\\tn, \\bnd Applic\\bti\\tn \\tf \\bn Infr\\bstructure f\\tr Cr\\tss-lingu\\bl Kn\\twledge Pr\\tcessing. P\\to\\feedings of the 9th","Chinese Lexi\\fal Semanti\\fs Wo\\tksho\\b.","Hu\\bng, C.-R., X.-B. Li \\bnd J.-F. H\\tng. 2004b. D\\tm\\bin Lexic\\t-T\\bx\\tn\\tmy: \\bn Appr\\t\\bch T\\tw\\brds Multi-d\\tm\\bin L\\bngu\\bge Pr\\tcessing. P\\to\\feedings of the Asian Sym\\bosium on Natu\\tal Language P\\to\\fessing to Ove\\t\\fome Language Ba\\t\\tie\\ts.","Hu\\bng, C.-R., X.-B. Li \\bnd J.-F. H\\tng. 2005b. The R\\tbustness \\tf D\\tm\\bin Lexic\\t-T\\bx\\tn\\tmy: Exp\\bnding D\\tm\\bin Lexic\\tn with Cilin. P\\to\\feedings of the 4th","ACL SIGHAN Wo\\tksho\\b on Chinese Language P\\to\\fessing.","K\\btsi\\tuli, P., V. Tsets\\ts \\bnd S. H\\bdjiefthymi\\bdes. 2007. Sem\\bntic Vide\\t Cl\\bssific\\bti\\tn B\\bsed \\tn Subtitles \\bnd D\\tm\\bin Termin\\tl\\tgies. P\\to\\feedings of SAMT Wo\\tksho\\b on Knowledge A\\fquisition f\\tom Multimedia Content.","K\\tlte, S. G. \\bnd S. G. Bhirud. 2008. W\\trd Sense Dis\\bmbigu\\bti\\tn Using W\\trdNet D\\tm\\bins. P\\to\\feedings of the 1st","IEEE Inte\\tnational Confe\\ten\\fe on Eme\\tging T\\tends in Enginee\\ting and Te\\fhnology.","Lee, L.-H., S.-K. Hsieh \\bnd C.-R. Hu\\bng. 2009. CWN-LMF: Chinese W\\trdNet in the Lexic\\bl M\\brkup Fr\\bmew\\trk. P\\to\\feedings of the 7th","Wo\\tksho\\b on Asian Language Resou\\t\\fes.","M\\bgnini, B. \\bnd G. C\\bv\\bgli\\b. 2000. Integr\\bting Subject Field C\\tdes int\\t W\\trdNet. P\\to\\feedings of the 2nd","Inte\\tnational Confe\\ten\\fe on Language Resou\\t\\fes and Evaluation.","M\\bgnini, B., C. Str\\bpp\\br\\bv\\b, G. Pezzul\\t \\bnd A. Gli\\tzz\\t. 2002\\b. C\\tmp\\bring Ont\\tl\\tgy-B\\bsed \\bnd C\\trpus-b\\bsed D\\tm\\bin Ann\\tt\\bti\\tns in W\\trdNet. P\\to\\feedings of the 1st","Inte\\tnational Wo\\tdNet Confe\\ten\\fe.","M\\bgnini, B., C. Str\\bpp\\br\\bv\\b, G. Pezzul\\t \\bnd A. Gli\\tzz\\t. 2002b. The R\\tle \\tf D\\tm\\bin Inf\\trm\\bti\\tn in W\\trd Sense Dis\\bmbigu\\bti\\tn. Natu\\tal Language Enginee\\ting, 8(4), 359-373.","Miller, G. A. 1995. W\\trdNet: \\b Lexic\\bl D\\bt\\bb\\bse f\\tr English. Communi\\fations of the ACM, 38(11), 39-41.","Niles, I. \\bnd A. Pe\\bse. 2003. Linking Lexic\\tns \\bnd Ont\\tl\\tgies: M\\bpping W\\trdNet t\\t the Suggested Upper Merged Ont\\tl\\tgy. P\\to\\feedings of the Inte\\tnational Confe\\ten\\fe on Info\\tmation and Knowledge Enginee\\ting.","Pi\\bnt\\b, E., L. Bentiv\\tgli \\bnd C. Gir\\brdi. 2002. MultiW\\trdNet: Devel\\tping \\bn Aligned Multilingu\\bl D\\bt\\bb\\bse. P\\to\\feedings of the 1st","Global Wo\\tdNet Confe\\ten\\fe.","S\\tri\\b, C., M. M\\tn\\bchini, F. Bert\\bgn\\b, N. C\\blz\\tl\\bri, C.-R. Hu\\bng, S.-K. Hsieh, A. M\\brchetti \\bnd M. Tesc\\tni. 2009\\b. Expl\\tring Inter\\tper\\bbility \\tf L\\bngu\\bge Res\\turces: the C\\bse \\tf Cr\\tsslingu\\bl Semi\\but\\tm\\btic Enrichment \\tf W\\trdnets. Language Resou\\t\\fes and Evaluation, 43(1), 87-96.","S\\tri\\b, C., M. M\\tn\\bchini \\bnd P. V\\tssen. 2009b. W\\trdnet-LMF: Fleshing \\tut \\b St\\bnd\\brdized F\\trm\\bt f\\tr W\\trdnet Inter\\tper\\bbility. P\\to\\feedings of the ACM Wo\\tksho\\b on Inte\\t\\fultu\\tal Collabo\\tation.","Vázquez, S., Z. K\\tz\\brev\\b \\bnd A. M\\tnt\\ty\\t. 2006. Textu\\bl Ent\\bilment bey\\tnd Sem\\bntic Simil\\brity Inf\\trm\\bti\\tn. Le\\ftu\\te Notes in Com\\bute\\t S\\fien\\fe, 4293, 900-910.","V\\tssen, P. 2004. Eur\\tW\\trdNet: \\b Multilingu\\bl D\\bt\\bb\\bse \\tf Aut\\tn\\tm\\tus \\bnd L\\bngu\\bge-specific W\\trdnets C\\tnnected vi\\b \\bn Inter-Lingu\\bl-Index. Inte\\tnational Jou\\tnal of Linguisti\\fs, 17(2), 1-23  296"]}]}