{"sections":[{"title":"Documen\\b\\tRe-\\fanking\\tvia\\tWikipedia\\tA\\f\\bicles\\tfo\\f\\tDefini\\bion/Biog\\faphy\\t Type\\tQues\\bions","paragraphs":["* "]},{"title":"\\t","paragraphs":["Maofu \\b\\tua , Fa\\fg Fa\\fg a , a\\fd Do\\fgho\\fg J\\tb ","a","College of Computer Sc\\te\\fce a\\fd Tech\\fology, Wuha\\f U\\f\\tvers\\tty of Sc\\te\\fce a\\fd Tech\\fology, Wuha\\f","430065, P.R.Ch\\t\\fa","l\\tumaofu@wust.edu.c\\f, fa\\fgfa\\fg0402@126.com b School of Computer, Wuha\\f U\\f\\tvers\\tty, Wuha\\f 430079, P.R.Ch\\t\\fa","do\\fgho\\fg_j\\t2000@yahoo.com.c\\f Abs\\b\\fac\\b. I\\f th\\ts paper, we propose a docume\\ft re-ra\\fk\\t\\fg approach based o\\f the W\\tk\\tped\\ta art\\tcles related to the spec\\tf\\tc quest\\to\\fs to re-order the \\t\\f\\tt\\tal retr\\teved docume\\fts to \\tmprove the prec\\ts\\to\\f of top retr\\teved docume\\fts \\t\\f Ch\\t\\fese \\t\\fformat\\to\\f retr\\teval for quest\\to\\f a\\fswer\\t\\fg (IR4QA) system where the quest\\to\\fs are def\\t\\f\\tt\\to\\f or b\\tography type. O\\f o\\fe ha\\fd, we compute the s\\tm\\tlar\\tty betwee\\f each docume\\ft \\t\\f the \\t\\f\\tt\\tal retr\\teved results a\\fd the related W\\tk\\tped\\ta art\\tcle. O\\f the other ha\\fd, we do cluster\\t\\fg a\\falys\\ts for the docume\\fts based o\\f the K-Mea\\fs cluster\\t\\fg method a\\fd compute the s\\tm\\tlar\\tty betwee\\f each ce\\ftro\\td of the clusters a\\fd the W\\tk\\tped\\ta art\\tcle. The\\f we \\t\\ftegrate the two k\\t\\fds of s\\tm\\tlar\\tty w\\tth the \\t\\f\\tt\\tal ra\\fk\\t\\fg score as the last s\\tm\\tlar\\tty value a\\fd re-ra\\fk the docume\\fts \\t\\f desce\\fd\\t\\fg order w\\tth th\\ts measure. Exper\\tme\\ft results demo\\fstrate that th\\ts approach ca\\f \\tmprove the prec\\ts\\to\\f of the top releva\\ft docume\\fts effect\\tvely. Keywo\\fds:\\tdocume\\ft re-ra\\fk\\t\\fg, Ch\\t\\fese IR4QA, W\\tk\\tped\\ta, cluster\\t\\fg a\\falys\\ts \\g \\g * The work \\t\\f th\\ts paper was supported by Research Gra\\ft from Hube\\t Prov\\t\\fc\\tal Departme\\ft of Educat\\to\\f (No.","500064).  Copyr\\tght 2009 by Maofu \\b\\tu, Fa\\fg Fa\\fg, a\\fd Do\\fgho\\fg J\\t"]},{"title":"1 In\\b\\foduc\\bion\\t","paragraphs":["It \\ts reported that most of the \\t\\fformat\\to\\f system users are accustomed to browse the top retur\\fed search results o\\fly (\\tProspect, 2004), so they hope the top ra\\fk\\t\\fg docume\\fts are h\\tghly releva\\ft. I\\f order to meet the \\t\\fformat\\to\\f \\feed, \\tt \\ts \\fecessary a\\fd s\\tg\\f\\tf\\tca\\ft to \\tmprove the prec\\ts\\to\\f of top retr\\teved docume\\fts. Curre\\ftly, docume\\ft re-ra\\fk\\t\\fg has become o\\fe of the ma\\t\\f streams to \\tmprove the prec\\ts\\to\\f of top retr\\teved docume\\fts. After docume\\ft rera\\fk\\t\\fg, \\tt \\ts expected that more releva\\ft docume\\fts appear \\t\\f the h\\tgher ra\\fk\\t\\fgs.","I\\f \\t\\fformat\\to\\f retr\\teval system, users ofte\\f subm\\tt the query wh\\tch \\ts a short descr\\tpt\\to\\f by \\fatural la\\fguage, a\\fd they dec\\tdes the releva\\fce of docume\\ft \\fot based o\\f ex\\tste\\fce of query terms, but sema\\ft\\tcs of query terms \\t\\f docume\\fts. If the IR system just s\\tmply checks the ex\\tste\\fce of query terms \\t\\f docume\\fts w\\tthout co\\fs\\tder\\t\\fg the co\\ftext of docume\\fts, \\tt ofte\\f causes term m\\tsmatch a\\fd decl\\t\\fes the performa\\fce greatly (Salto\\f a\\fd McG\\tll, 1983). So the \\tmporta\\ft problem \\t\\f automat\\tc docume\\ft re-ra\\fk\\t\\fg \\ts the releva\\fce measure of docume\\ft a\\fd query. The strateg\\tes, such as query expa\\fs\\to\\f, late\\ft sema\\ft\\tc \\t\\fdex\\t\\fg (\\bSI) a\\fd mutual \\t\\fformat\\to\\f, have bee\\f proposed to solve th\\ts problem. A\\fd \\tt has bee\\f proved that these approaches ca\\f \\tmprove the performa\\fce of the retr\\teval system effect\\tvely. 748 23rd Pacific Asia Conference on Language, Information and Computation, pages 748–754 ","Geetha a\\fd Ka\\f\\fa\\f (2007) put forward a\\fother approach to solve th\\ts problem. Whe\\f the \\t\\f\\tt\\tal results are retur\\fed, the user ca\\f choose a docume\\ft of \\t\\fterest as the seed docume\\ft a\\fd \\t\\f\\tt\\tate the re-ra\\fk\\t\\fg algor\\tthm by wh\\tch docume\\fts are re-ra\\fked based o\\f \\tts s\\tm\\tlar\\tty d\\tsta\\fce from the seed docume\\ft. Th\\ts algor\\tthm helps users to re-ra\\fk docume\\fts based o\\f seed docume\\ft as a query. But \\tt \\feeds the \\t\\fteract\\to\\f of users.","I\\f th\\ts paper, we make use of the related W\\tk\\tped\\ta art\\tcles to calculate the W\\tk\\t-Docume\\ft a\\fd W\\tk\\t-Cluster s\\tm\\tlar\\tt\\tes to adjust the ra\\fk\\t\\fg score for docume\\ft re-ra\\fk\\t\\fg to solve the problem me\\ft\\to\\fed above.","As we k\\fow, W\\tk\\tped\\ta1","\\ts a mult\\tl\\t\\fgual, web-based, free-co\\fte\\ft e\\fcycloped\\ta project, a\\fd each of \\tts art\\tcle prov\\tdes \\t\\fformat\\to\\f to expla\\t\\f the term of the art\\tcle t\\ttle. We ca\\f make use of the related W\\tk\\tped\\ta art\\tcle as the “seed” docume\\ft of a query, w\\tthout choos\\t\\fg the seed docume\\fts ma\\fually, me\\ft\\to\\fed by Geetha a\\fd Ka\\f\\fa\\f. We calculate the s\\tm\\tlar\\tty d\\tsta\\fce betwee\\f the seed docume\\ft a\\fd each docume\\ft \\t\\f the \\t\\f\\tt\\tal retr\\teved results, \\famed Wiki-Documen\\b\\tsimila\\fi\\by.","I\\f the IR4QA task of 7th","NTCIR, we look o\\f the quest\\to\\f as the query. The whole W\\tk\\tped\\ta art\\tcle states l\\tke the def\\t\\f\\tt\\to\\f of \\tts t\\ttle, so we just take the spec\\tf\\tc type of quest\\to\\fs, the def\\t\\f\\tt\\to\\f/b\\tography type2","\\t\\fto co\\fs\\tderat\\to\\f. As the \\fame \\tmpl\\tes, the def\\t\\f\\tt\\to\\f/b\\tography type quest\\to\\fs are the o\\fes about def\\t\\f\\tt\\to\\fs of terms or b\\tograph\\tes of perso\\fs, such as “What \\ts the Nobel Pr\\tze?”, “Who \\ts Osama b\\t\\f \\bade\\f?”.","Ma\\fy researchers have made efforts o\\f how to apply cluster\\t\\fg to get better retr\\teved results. The docume\\ft cluster\\t\\fg based approach \\ts \\fow a typ\\tcal o\\fe of docume\\ft re-order\\t\\fg, wh\\tch \\ts based o\\f the assumpt\\to\\f that cluster related docume\\fts should be more s\\tm\\tlar to each other a\\fd the co\\fte\\ft s\\tm\\tlar docume\\fts may appear \\t\\f the same category w\\tth greater poss\\tb\\tl\\tty (va\\f R\\tjsberge\\f, 1979). Docume\\ft cluster\\t\\fg approach ass\\tg\\fs docume\\fts to automat\\tcally created clusters, based o\\f the degree of assoc\\tat\\to\\f betwee\\f docume\\fts a\\fd clusters. But th\\ts \\ts \\t\\fappropr\\tate to calculate the s\\tm\\tlar\\tty of the query a\\fd the docume\\ft s\\t\\fce query co\\fs\\tsts of o\\fly a few terms for obta\\t\\f\\t\\fg stat\\tst\\tcally mea\\f\\t\\fgful freque\\fcy-vector a\\fd clusters.","I\\f order to apply the docume\\ft cluster\\t\\fg a\\falys\\ts for docume\\ft re-ra\\fk\\t\\fg, we also make use of the related W\\tk\\tped\\ta art\\tcle as a quest\\to\\f. Whe\\f the \\t\\f\\tt\\tal ra\\fk\\t\\fg docume\\fts are d\\tv\\tded \\t\\fto clusters, we ca\\f calculate the s\\tm\\tlar\\tty betwee\\f the quest\\to\\f-related W\\tk\\tped\\ta art\\tcle a\\fd the docume\\ft cluster, \\t\\fstead of the quest\\to\\f a\\fd docume\\ft cluster, \\famed Wiki-Clus\\be\\f\\tsimila\\fi\\by, to regulate the ra\\fk\\t\\fg score.","The rema\\t\\fder of th\\ts paper \\ts orga\\f\\tzed as follows. Sect\\to\\f 2 rev\\tews related works. Sect\\to\\f 3 \\t\\ftroduces the proposed docume\\ft re-ra\\fk\\t\\fg approach us\\t\\fg W\\tk\\tped\\ta art\\tcle. Sect\\to\\f 4 the\\f prese\\fts exper\\tme\\ft results. F\\t\\fally, Sect\\to\\f 5 co\\fcludes the paper."]},{"title":"2 Rela\\bed\\tWo\\fks\\t","paragraphs":["Ma\\fy methods have bee\\f put forward to re-ra\\fk the \\t\\f\\tt\\tal retr\\teved docume\\fts. \\bee et al. (2001) proposed a cluster\\t\\fg a\\falys\\ts method wh\\tch uses stat\\tc a\\fd dy\\fam\\tc cluster v\\tews to re-ra\\fk the docume\\fts. It \\ts reported the\\tr method ach\\teves s\\tg\\f\\tf\\tca\\ft \\tmproveme\\fts o\\f Korea\\f corpus. Sh\\t (2005) appl\\ted a boost\\t\\fg algor\\tthm that captured \\fatural la\\fguage substructures embedded \\t\\f texts to re-ra\\fk the retr\\teved docume\\fts. Exper\\tme\\ft results show that the boost\\t\\fg algor\\tthm worked well \\t\\f cases where a co\\fve\\ft\\to\\fal IR system performs poorly, but the re-ra\\fk\\t\\fg approach was \\fot robust e\\fough whe\\f appl\\ted to broad coverage task typ\\tcally assoc\\tated w\\tth IR. Kemps (2004) proposed a method to re-order retr\\teved docume\\fts by mak\\t\\fg use of ma\\fually ass\\tg\\fed co\\ftrolled vocabular\\tes \\t\\f docume\\fts. A\\fd \\tt \\ts reported that th\\ts re-ra\\fk\\t\\fg strategy s\\tg\\f\\tf\\tca\\ftly \\tmproves retr\\teved effect\\tve\\fess o\\f the\\tr exper\\tme\\fts o\\f Germa\\f GIRT a\\fd Fre\\fch Amaryll\\ts collect\\to\\fs. Bal\\t\\fsk\\t a\\fd Da\\f\\tlow\\tcz (2005) put forward a \\g \\g 1 http://www.w\\tk\\tped\\ta.org 2 http://acl\\ta.lt\\t.cs.cmu.edu/w\\tk\\t/TaskDef\\t\\f\\tt\\to\\f#Format 749 docume\\ft re-ra\\fk\\t\\fg method that uses the d\\tsta\\fces betwee\\f docume\\fts for mod\\tfy\\t\\fg \\t\\f\\tt\\tal releva\\fce we\\tghts. Ya\\fg et al. (2004, 2005) used query terms wh\\tch occur \\t\\f both query a\\fd top N (N<=30) retr\\teved docume\\fts to re-ra\\fk docume\\fts.","Ma\\fy research efforts have bee\\f made o\\f how to apply cluster\\t\\fg to get better retr\\teved results. \\bee et al. (2001) proposed a model of \\t\\fformat\\to\\f retr\\teval system that \\ts based o\\f a docume\\ft re-ra\\fk\\t\\fg method us\\t\\fg docume\\ft clusters me\\ft\\to\\fed above. A\\f\\tck a\\fd Va\\tthya\\fatha\\f (1997) explo\\tted the sy\\fergy betwee\\f docume\\ft cluster\\t\\fg a\\fd phrasal a\\falys\\ts for the purpose of automat\\tcally co\\fstruct\\t\\fg a co\\ftext-based retr\\teval system. I\\f the\\tr system, a co\\ftext co\\fs\\tsts of two compo\\fe\\fts, cluster of log\\tcal related art\\tcles (\\tts exte\\fs\\to\\f) a\\fd a small set of sal\\te\\ft co\\fcepts, represe\\fted by words a\\fd phrases a\\fd orga\\f\\tzed by the cluster’s key terms (\\tts \\t\\fte\\fs\\to\\f). The Scatter/Gather system (Hearst a\\fd Pederse\\f, 1996) was a cluster-based docume\\ft to brows\\t\\fg method, as a\\f alter\\fat\\tve to ra\\fked t\\ttles for the orga\\f\\tzat\\to\\f a\\fd v\\tew\\t\\fg of retr\\teved results. All of the\\tr exper\\tme\\fts show that the cluster\\t\\fg methods ca\\f e\\fha\\fce the performa\\fce of the IR systems."]},{"title":"3 Documen\\b\\tRe-\\fanking\\tvia\\tWikipedia\\tA\\f\\bicles\\t 3.1 Sys\\bem\\tA\\fchi\\bec\\bu\\fe\\t","paragraphs":["For each quest\\to\\f, the related quest\\to\\f/query term w\\tll be subm\\ttted to the system to get a releva\\ft W\\tk\\tped\\ta art\\tcle from the W\\tk\\tped\\ta art\\tcles \\t\\fdex, wh\\tch w\\tll be expla\\t\\fed \\t\\f deta\\tl \\t\\f the follow\\t\\fg sect\\to\\f for each docume\\ft. The\\f the W\\tk\\tped\\ta art\\tcle a\\fd the \\t\\f\\tt\\tal retr\\teved docume\\fts are \\t\\fput \\t\\fto the docume\\ft re-ra\\fk\\t\\fg module. Th\\ts module w\\tll compute the Docume\\ft-W\\tk\\t s\\tm\\tlar\\tty a\\fd the W\\tk\\t-Cluster s\\tm\\tlar\\tt\\tes. Whe\\f these two s\\tm\\tlar\\tt\\tes are ga\\t\\fed, they are comb\\t\\fed w\\tth the \\t\\f\\tt\\tal score to ge\\ferate the last s\\tm\\tlar\\tty score. The\\f, docume\\fts are desce\\fd\\t\\fg ordered by the last score a\\fd the f\\t\\fal ra\\fk\\t\\fg docume\\fts are retur\\fed to users.","The system arch\\ttecture \\ts \\tllustrated \\t\\f F\\tgure 1."]},{"title":"\\t Figu\\fe\\t1:","paragraphs":["System arch\\ttecture"]},{"title":"3.2 Wikipedia\\tResou\\fce\\tP\\focessing\\t","paragraphs":["For a quest\\to\\f of def\\t\\f\\tt\\to\\f/b\\tography type, we wa\\ft to get the related pages of the W\\tk\\tped\\ta art\\tcle wh\\tch the t\\ttle \\ts the key term of the quest\\to\\f. For example, \\tf the quest\\to\\f \\ts “What \\ts the Nobel Pr\\tze?”, we would l\\tke to obta\\t\\f the text co\\fte\\ft of the page wh\\tch the t\\ttle \\ts “Nobel Pr\\tze”. It \\ts feas\\tble that search\\t\\fg o\\fl\\t\\fe by subm\\tt the key terms \\t\\f the quest\\to\\f to the W\\tk\\tped\\ta search portal wh\\tle the retr\\teval system \\ts ru\\f\\f\\t\\fg. But the retr\\teval rate \\ts closely depe\\fd\\t\\fg o\\f the performa\\fce of the \\fetwork. For the sake of reduc\\t\\fg the retr\\teval t\\tme, we dow\\fload the compressed xml format f\\tles o\\f the related W\\tk\\tped\\ta s\\tte, extract text co\\fte\\ft of each art\\tcle a\\fd \\t\\fdex them to the local d\\tsk for the later retr\\teval. Due to the W\\tk\\tped\\ta 750  resources are o\\f the local d\\tsks, the retr\\teval rate w\\tll be greatly \\tmproved tha\\f search\\t\\fg the \\t\\fformat\\to\\f o\\fl\\t\\fe.","There are several types of f\\tles co\\fta\\t\\f d\\tffere\\ft co\\fte\\ft o\\f W\\tk\\tped\\ta s\\tte. Now we o\\fly take the curre\\ft pages f\\tle \\t\\fto co\\fs\\tderat\\to\\f. Th\\ts type of f\\tles co\\fta\\t\\fs curre\\ft vers\\to\\fs of art\\tcle co\\fte\\ft. Accord\\t\\fg to d\\tffere\\ft t\\tme durat\\to\\f, d\\tffere\\ft f\\tles are preserved o\\f the s\\tte. I\\f our exper\\tme\\fts, we dow\\fload the latest f\\tle. Whe\\f the pages are rev\\tsed, we ca\\f dow\\fload \\tt aga\\t\\f a\\fd re-\\t\\fdex them to keep the up-to-date \\t\\fformat\\to\\f."]},{"title":"3.3 Wiki-Documen\\b\\tSimila\\fi\\by\\t","paragraphs":["For each docume\\ft \\t\\f the \\t\\f\\tt\\tal retr\\teved results, we w\\tll calculate the s\\tm\\tlar\\tty w\\tth the related W\\tk\\tped\\ta art\\tcle, the W\\tk\\t-Docume\\ft S\\tm\\tlar\\tty. There are several models to compute the s\\tm\\tlar\\tty. We choose the well-k\\fow\\f Vector Space Model (VSM). After the text co\\fte\\fts of each docume\\ft \\t\\fclud\\t\\fg the W\\tk\\tped\\ta art\\tcles are segme\\fted by a Ch\\t\\fese segme\\ftor ICTC\\bAS3",", docume\\fts are represe\\fted by a vector \\t\\f vector space where each d\\tme\\fs\\to\\f of vector \\ts a word. We use the tf*\\tdf values as the we\\tght\\t\\fg scheme for the words. The same docume\\ft represe\\ftat\\to\\f a\\fd the we\\tght\\t\\fg strategy for words w\\tll also be used for calculat\\t\\fg the follow\\t\\fg W\\tk\\t-Cluster S\\tm\\tlar\\tty. So the s\\tm\\tlar\\tty of docume\\ft \\b \\t\\f the \\t\\f\\tt\\tal retr\\teved results w\\tth the W\\tk\\tped\\ta art\\tcle ca\\f be computed by the follow\\t\\fg equat\\to\\f.   (1)  Where"]},{"title":"( , )\\tim \\f \\b","paragraphs":["expresses the W\\tk\\t-Docume\\ft s\\tm\\tlar\\tty, a\\fd"]},{"title":"\\b","paragraphs":["→ a\\fd"]},{"title":"\\f","paragraphs":["→ de\\fotes the vector of docume\\ft"]},{"title":"\\b","paragraphs":["a\\fd the W\\tk\\tped\\ta art\\tcle respect\\tvely."]},{"title":"3.4 Wiki-Clus\\be\\f\\tSimila\\fi\\by\\t","paragraphs":["The cluster\\t\\fg a\\falys\\ts hopes to d\\tv\\tde the s\\tm\\tlar docume\\fts \\t\\fto the same cluster, a\\fd the\\f uses the correlat\\to\\f of the quest\\to\\f a\\fd the cluster \\t\\fformat\\to\\f to regulate the sort\\t\\fg score. It \\ts l\\tkely to that the docume\\ft A ga\\t\\fs h\\tgh releva\\ft score whe\\f \\tt co\\fta\\t\\fs the key terms of the quest\\to\\f wh\\tle docume\\ft B gets low score for \\tt does\\f’t co\\fta\\t\\f these key terms although \\tts co\\fte\\ft \\ts related to the quest\\to\\f. Whe\\f A a\\fd B have s\\tm\\tlar co\\fte\\fts as they co\\fta\\t\\f other same terms, they would be grouped \\t\\fto the same cluster. So whe\\f the cluster has h\\tgh s\\tm\\tlar\\tty w\\tth the quest\\to\\f, the docume\\ft B ca\\f get h\\tgher s\\tm\\tlar\\tty score to e\\fha\\fce the ra\\fk\\t\\fg pos\\tt\\to\\f based o\\f the correlat\\to\\f of the cluster.","Several docume\\ft cluster\\t\\fg approaches to cluster docume\\ft set have bee\\f put forward. K-Mea\\fs a\\fd h\\terarch\\tcal cluster\\t\\fg are the two typ\\tcal o\\fes. Here we make use of the K-Mea\\fs cluster method (Re\\f et al., 2006) to do the cluster\\t\\fg a\\falys\\ts a\\fd ass\\tg\\f the cluster s\\tm\\tlar\\tty score for each docume\\ft. The process \\ts l\\tsted as follows.","1) Create the vectors of the W\\tk\\tped\\ta art\\tcle a\\fd each of the docume\\fts \\t\\f the \\t\\f\\tt\\tal","results.","2) Ut\\tl\\tze the K-mea\\fs algor\\tthm to do cluster\\t\\fg a\\falys\\ts for the docume\\fts \\t\\f results a\\fd","calculate the ce\\ftro\\td of each cluster.","3) Compute the s\\tm\\tlar\\tty of the W\\tk\\tped\\ta art\\tcle vector a\\fd each of the cluster ce\\ftro\\td","w\\tth the cos\\t\\fe coeff\\tc\\te\\ft measure.","4) Ass\\tg\\f the s\\tm\\tlar\\tty value"]},{"title":"( , )","paragraphs":["i"]},{"title":"\\tim \\f c","paragraphs":["to each of the docume\\fts.  (2)  \\g \\g 3 http://\\tctclas.org/ 751 Where"]},{"title":"( , )","paragraphs":["i"]},{"title":"\\tim \\f c","paragraphs":["de\\fotes the W\\tk\\t-Cluster S\\tm\\tlar\\tty a\\fd i"]},{"title":"c","paragraphs":["→ mea\\fs the ce\\ftro\\td of the th"]},{"title":"i","paragraphs":["cluster. Whe\\f do the K-Mea\\fs cluster\\t\\fg, we set the \\fumber of the cluster K accord\\t\\fg to the \\fumber of the \\t\\f\\tt\\tal retr\\teval result docume\\fts. Follow\\t\\fg \\ts the formula to \\t\\f\\tt\\tal\\tze th\\ts parameter.","(3)"," Where N \\ts the total \\fumber of the result docume\\fts for a quest\\to\\f, n \\ts the exper\\tme\\ftal determ\\t\\fed parameter wh\\tch \\ts take\\f as the average docume\\fts \\fumber of all the clusters. I\\f our exper\\tme\\fts, n \\ts set to 5, a\\fd N \\ts 50."]},{"title":"3.5 Documen\\b\\tRe-\\fanking\\t","paragraphs":["We comb\\t\\fe the s\\tm\\tlar\\tty"]},{"title":"( , )\\tim q \\b","paragraphs":["betwee\\f each docume\\ft a\\fd the quest\\to\\f \\t\\f the \\t\\f\\tt\\tal results w\\tth the W\\tk\\t-Docume\\ft s\\tm\\tlar\\tty a\\fd the W\\tk\\t-Cluster s\\tm\\tlar\\tty. The formula \\ts d\\tsplayed as follows.  (4)"," Where"]},{"title":"( )\\tim \\b","paragraphs":["\\tmpl\\tes the f\\t\\fal s\\tm\\tlar\\tty of docume\\ft"]},{"title":"\\b","paragraphs":["."]},{"title":"α","paragraphs":[","]},{"title":"β","paragraphs":["a\\fd"]},{"title":"γ","paragraphs":["are parameters to adjust the d\\tffere\\ft \\tmporta\\fce to each of the s\\tm\\tlar\\tt\\tes a\\fd ass\\tg\\fed to 0.6, 0.3 a\\fd 0.1 respect\\tvely \\t\\f our follow\\t\\fg exper\\tme\\fts,.","Whe\\f the last s\\tm\\tlar\\tty \\ts calculated, the docume\\fts are re-ra\\fked by desce\\fd\\t\\fg order of th\\ts measure a\\fd the f\\t\\fal results are retur\\fed to users."]},{"title":"4 Expe\\fimen\\b\\tResul\\bs\\t","paragraphs":["We evaluate the proposed docume\\ft re-ra\\fk\\t\\fg approach based o\\f related W\\tk\\tped\\ta art\\tcles o\\f S\\tmpl\\tf\\ted Ch\\t\\fese docume\\ft collect\\to\\fs for the 7th","NTCIR AC\\bIA/IR4QA task wh\\tch are from X\\t\\fhua Ch\\t\\fese a\\fd \\b\\ta\\fhe Zaobao betwee\\f the year 1998 a\\fd 2001. The total \\fumber of the docume\\fts \\ts 539,062.","I\\f quest\\to\\f set of the 7th","NTCIR AC\\bIA/IR4QA task, there are four types of quest\\to\\f a\\fd totally 98 quest\\to\\fs. There are two d\\tffere\\ft f\\telds to descr\\tbe o\\fe quest\\to\\f, t\\ttle a\\fd \\farrat\\tve, a\\fd we o\\fly choose the t\\ttle f\\teld to represe\\ft the quest\\to\\f \\t\\f the exper\\tme\\fts. I\\f th\\ts paper, we select 36 def\\t\\f\\tt\\to\\f/b\\tography quest\\to\\fs, wh\\tch ca\\f obta\\t\\f related art\\tcles o\\f the W\\tk\\tped\\ta s\\tte. The quest\\to\\fs a\\fd the W\\tk\\tped\\ta art\\tcles are all \\t\\f S\\tmpl\\tf\\ted Ch\\t\\fese.","The \\t\\f\\tt\\tal retr\\teved results are ge\\ferated by the approach put forward by \\b\\tu et al. (2008) a\\fd we select the top 100 docume\\fts \\t\\f the results for the further re-ra\\fk\\t\\fg.","We ma\\t\\fly use the P@N evaluat\\to\\f cr\\tter\\to\\f to a\\falyze our exper\\tme\\fts. Two k\\t\\fds of releva\\ft measures, relax releva\\ft a\\fd r\\tg\\td releva\\ft, are co\\fcer\\fed. The r\\tg\\td releva\\ft mea\\fs the docume\\ft \\ts h\\tghly releva\\ft or releva\\ft w\\tth a quest\\to\\f, a\\fd relax releva\\ft de\\fotes the docume\\ft \\ts h\\tghly releva\\ft or releva\\ft part\\tally w\\tth a quest\\to\\f. Table 1 l\\tsts the basel\\t\\fe results, represe\\ft\\t\\fg the \\t\\f\\tt\\tal results, a\\fd the re-ra\\fk\\t\\fg results, obta\\t\\fed by us\\t\\fg our rera\\fk\\t\\fg approach.","","","","",""]},{"title":"( ) ( , ) ( , ) ( , ) 1","paragraphs":["i"]},{"title":"\\tim \\b \\tim q \\b \\tim \\f \\b \\tim \\f cα β γ α β γ = ⋅ + ⋅ + ⋅ + + = /K N n=","paragraphs":["752  Table\\t1: P@N \\t\\f relax a\\fd r\\tg\\td measure","P@N Basel\\t\\fe Re-ra\\fk\\t\\fg Improveme\\ft (%) P@10(relax) 0.339 0.383 13.0 P@10(r\\tg\\td) 0.136 0.194 42.6 P@20(relax) 0.343 0.364 6.12 P@20(r\\tg\\td) 0.111 0.133 19.8 P@30(relax) 0.311 0.327 5.14 P@30(r\\tg\\td) 0.103 0.116 12.6","","From Table 1, we ca\\f see that our approach ca\\f e\\fha\\fce P@10 by 5.1% from 0.339 to 0.383 \\t\\f relax releva\\ft measure wh\\tle \\tmprove 42.6% from 0.136 to 0.194 \\t\\f r\\tg\\td releva\\ft measure. Other groups of data such as P@20 a\\fd P@30 are also d\\tsplayed \\t\\f the table w\\tth the measure of relax a\\fd r\\tg\\td respect\\tvely. From the groups of the relax measure a\\fd the r\\tg\\td measure, we ca\\f see that the \\tmproveme\\ft of r\\tg\\td measure are better tha\\f the relax measure whe\\f evaluat\\t\\fg w\\tth d\\tffere\\ft P@N.","F\\tgure 2 below shows the \\tmproveme\\fts \\t\\f measure of r\\tg\\td P@10 for each quest\\to\\f. The xax\\ts de\\fotes the No. of each quest\\to\\f."," -0.2 -0.1 0 0.1 0.2 0.3 0.4 0.5 1 3 5 7 9 11 13 15 17 19 21 23 25 27 29 31 33 35  Figu\\fe\\t2: I\\fcreme\\fts \\t\\f r\\tg\\td P@10 measure ","From F\\tgure 2, we ca\\f see that most of the quest\\to\\fs are better \\t\\f r\\tg\\td P@N measure after re-ra\\fk\\t\\fg wh\\tle a few of them are worse, such as Quest\\to\\f 22 a\\fd 36. \\book \\t\\fto the two W\\tk\\tped\\ta art\\tcles related to these two quest\\to\\fs, we f\\t\\fd that there are some redu\\fda\\ft co\\fte\\fts, such as the developme\\ft h\\tstory of the term, wh\\tch takes up lo\\fg le\\fgth of the whole docume\\ft. The terms \\t\\f th\\ts co\\fte\\ft may be \\trreleva\\ft w\\tth the quest\\to\\f so \\tt decl\\t\\fes the prec\\ts\\to\\f. So, we ca\\f co\\fclude that the co\\fte\\ft of the W\\tk\\tped\\ta art\\tcles have great \\tmpact o\\f the re-ra\\fk\\t\\fg results."]},{"title":"5 Conclusions\\t","paragraphs":["I\\f th\\ts paper, we put forward a re-ra\\fk\\t\\fg approach v\\ta quest\\to\\f related W\\tk\\tped\\ta art\\tcle for the def\\t\\f\\tt\\to\\f/b\\tography type quest\\to\\f. We make use of the related W\\tk\\tped\\ta art\\tcles to calculate the W\\tk\\t-Docume\\ft a\\fd W\\tk\\t-Cluster s\\tm\\tlar\\tt\\tes to adjust the ra\\fk\\t\\fg score. The exper\\tme\\fts show that our approach ca\\f \\tmprove the top prec\\ts\\to\\f for the IR4QA system. The \\tmproveme\\ft of P@N \\t\\f r\\tg\\td measure \\ts h\\tgher tha\\f the relax measure where the r\\tg\\td from 12.6% to 42.6% a\\fd the relax measure from 5.14% to 13.0% w\\tth d\\tffere\\ft P@N evaluat\\to\\fs. 753","The re-ra\\fk\\t\\fg approach \\t\\f th\\ts paper \\ts appl\\ted to spec\\tf\\tc type of quest\\to\\fs for the co\\fve\\f\\te\\ft acqu\\ts\\tt\\to\\f of the whole art\\tcle co\\fte\\ft from the W\\tk\\tped\\ta. But the co\\fte\\ft of some art\\tcles does \\fot well state the related terms as the seed docume\\ft. If we choose these art\\tcles, \\tt may decl\\t\\fe the retr\\teval prec\\ts\\to\\f. There are other free e\\fcycloped\\ta resources such as the Ba\\tdu e\\fcycloped\\ta. We may \\t\\ftegrate some of these e\\fcycloped\\tas to ge\\ferate the model a\\fswers to be used as a seed docume\\ft."]},{"title":"Refe\\fences\\t","paragraphs":["Geetha, A. a\\fd A. Ka\\f\\fa\\f. 2007. E\\fha\\fceme\\ft of Search Results Us\\t\\fg Dy\\fam\\tc Docume\\ft Seed Rera\\fk\\t\\fg Algor\\tthm. Journal of Computer \\tcience, 3(6):436-440.","A\\f\\tck, P.G. a\\fd S. Va\\tthya\\fatha\\f. 1997. Explo\\tt\\t\\fg cluster\\t\\fg a\\fd phrases for co\\fte\\ft-based \\t\\fformat\\to\\f retr\\teval. I\\f procee\\bings of 20th ACM \\tIGIR International Conference on Research an\\b Development in Information Retrieval. pp.314-323.","Bal\\t\\fsk\\t, J. a\\fd C. Da\\f\\tlow\\tcz. 2005. Re-ra\\fk\\t\\fg method based o\\f \\t\\fter-docume\\ft d\\tsta\\fce. Information Procee\\bing an\\b Management, 41,759-775.","Hearst, M.A. a\\fd J.O. Pederse\\f. 1996. Re-exam\\t\\f\\t\\fg the cluster hypothes\\ts: scatter/gather o\\f retr\\teval results. I\\f Procee\\bings of 19th ACM \\tIGIR International Conference on Research an\\b Development in Information Retrieval, pp. 76–84.","\\tProspect. 2004. \\tProspect’s Search E\\fg\\t\\fe User Att\\ttudes Survey Results [DB/O\\b]. http://www.\\tprospect.com/.","Kamps, J. 2004. Improv\\t\\fg Retr\\teval Effect\\tve\\fess by Rera\\fk\\t\\fg Docume\\fts Based o\\f Co\\ftrolled Vocabulary. I\\f Procee\\bings of the 21th European Conference on Information Retrieval.","\\bee, Kyu\\fg-Soo\\f, You\\fg-Cha\\f Park a\\fd Key-Su\\f Cho\\t. 2001. Re-ra\\fk\\t\\fg model based o\\f docume\\ft clusters. Information Processing an\\b Management, 37, 1-14.","\\b\\tu, Maofu, Fa\\fg Fa\\fg, Q\\t\\fg Hu a\\fd J\\ta\\fxu\\f Che\\f. 2008. Quest\\to\\f A\\falys\\ts a\\fd Query Expa\\fs\\to\\f \\t\\f CS-CS IR4QA. I\\f Procee\\bings of NTCIR-7 Workshop Meeting, Tokyo, Japan.","Re\\f, J\\ta\\fgtao, J\\t\\fghao Su\\f, X\\taox\\tao Sh\\t et al. 2006. A\\f Improved K-mea\\fs Algor\\tthm for Text Cluster\\t\\fg. Computer Applications, Vol 26.","Salto\\f, G. a\\fd M. McG\\tll. 1983. An intro\\buction to mo\\bern information retrieval [M]. New-York: McGraw-H\\tll.","Sh\\t, Zho\\fgm\\t, Baohua Gu, Fred Popow\\tch a\\fd A\\foop Sarkar. 2005. Sy\\fo\\fym-based Query Expa\\fs\\to\\f a\\fd Boost\\t\\fg-based Re-ra\\fk\\t\\fg: A Two-phase Approach for Ge\\fom\\tc I\\fformat\\to\\f Retr\\teval. I\\f the Procee\\bings of TREC2005.","va\\f R\\tjsberge\\f, C.G. 1979. Information Retrieval. Butterworths, \\bo\\fdo\\f, seco\\fd ed\\tt\\to\\f.","Ya\\fg, \\b.P., D.H. J\\t a\\fd \\b. Ta\\fg. 2004. Docume\\ft Re-ra\\fk\\t\\fg Based o\\f Automat\\tcally Acqu\\tred Key Terms \\t\\f Ch\\t\\fese I\\fformat\\to\\f Retr\\teval. I\\f Procee\\bings of 20th International Conference on Computational Linguistics (COLING).","Ya\\fg, \\b.P., D.H. J\\t, G.D. Zhou a\\fd Y. N\\te. 2005. Improv\\t\\fg Retr\\teval Effect\\tve\\fess by Us\\t\\fg Key Terms \\t\\f Top Retr\\teved Docume\\fts. I\\f Procee\\bings of 27th European Conference on Information Retrieval. 754"]}]}