{"sections":[{"title":"  Customi\\bi\\tg \\f\\t E\\tglish-Kore\\f\\t M\\fchi\\te Tr\\f\\tsl\\ftio\\t System for P\\fte\\tt/Tech\\tic\\fl Docume\\tts Tr\\f\\tsl\\ftio\\t **  ","paragraphs":["Oh-Woo\\b \\twon\\f Sun\\b-\\twon Choi\\f \\ti-Youn\\b Lee\\f Yoon-Hyun\\b Roh\\f and Youn\\b-Gil \\tim","","Natural Lan\\bua\\be Processin\\b Team\\f Electronics and Telecommunications Research Institute 161 Gajeon\\b-don\\b\\f Youseon\\b-\\bu\\f Daejon\\f \\torea {ohwoo\\b\\f choisk\\f leeky\\f yhnoh\\f kimyk}@etri.re.kr Abstr\\fct. This paper addresses a method for customizin\\b an En\\blish-\\torean machine translation system from \\beneral domain to patent or technical document domain. The customizin\\b method includes the followin\\bs: (1) adaptin\\b the probabilities of POS ta\\b\\ber trained from \\beneral domain to the specific domain\\f (2) syntactically analyzin\\b lon\\b and complex sentences by reco\\bnizin\\b coordinate structures\\f and (3) selectin\\b a proper tar\\bet word usin\\b domain-specific bilin\\bual dictionary and collocation knowled\\be extracted from patent or technical document corpus. The translation accuracy of the customized En\\blish- \\torean patent translation system is 82.43% on the avera\\be in 5 patent cate\\bories accordin\\b to the evaluation of 7 professional patent translators. The translation accuracy of the customized En\\blish-\\torean technical document translation system is 81.10% and its BLEU score is 0.5185 in the evaluation test set where the avera\\be BLEU score of cross-evaluation between references is 0.6615. Keywords: Machine Translation\\f Customization for MT\\f Patent Translation\\f Technical Document Translation. \\S \\S * The work reported in this paper was supported by the IT R&D pro\\bram of M\\tE\\f “Development of Machine","Translation Technolo\\by for \\torean/Chinese/En\\blish Spoken Lan\\bua\\be and Business Documents”.  Copyri\\bht 2009 by Oh-Woo\\b \\twon\\f Sun\\b-\\twon Choi\\f \\ti-Youn\\b Lee\\f Yoon-Hyun\\b Roh\\f and Youn\\b-Gil \\tim"]},{"title":"1 I\\ttroductio\\t","paragraphs":["We often look for the forei\\bn patents or technical documents for acquirin\\b the current trends and new information. When we try to translate the forei\\bn patents or documents in order to just acquire the information\\f we want to require the rapidity of the translation and the understandable translation quality\\f rather than the completeness of the translation quality. Such users’ demand has become a hot research issue in the MT community.","It is well known that sentence style and dominant translation for a word vary with domains. Therefore\\f if the domain to be translated is fixed to patents or technical documents\\f bilin\\bual dictionary adaptation to the domain and customizin\\b natural lan\\bua\\be analyzers to the lin\\buistic specificity of the domain’s style are effective ways to improve the translation quality of MT system. There have been studies concerned specifically with patent MT usin\\b these domain-specific advanta\\bes (Shinmori et al.\\f 2003; Hon\\b et al.\\f 2005).","Thou\\bh intensive research has been made on MT for the domain-specific advanta\\bes\\f there still remain many issues to be tackled. In this paper\\f we focus on the several issues: (1) domain-specific probabilities of POS ta\\b\\ber\\f (2) lon\\b and complex sentence analysis\\f and (3) tar\\bet word selection.","This paper addresses the customization of an E-\\t(En\\blish-\\torean) MT system for patent and technical documents translation. The E-\\t patent MT system “FromTo-E\\t/PAT” and The E-\\t technical paper MT system “FromTo-E\\t/PAP” described in this paper is based on an E-\\t MT system developed for the web translation in a \\beneral domain. We first customized our \\beneral E-\\t MT system for patent translation\\f and then customized E-\\t patent MT system to technical document domain. 718 23rd Pacific Asia Conference on Language, Information and Computation, pages 718–725  ","Our E-\\t MT system belon\\bs to basically the pattern-based methodolo\\by for machine translation. It has the formalism that does En\\blish sentence analysis in which En\\blish domain-specific patterns are used\\f matches the En\\blish domain-specific pattern with its \\torean domain-specific pattern\\f and then \\benerates a \\torean sentence from it. E-\\t MT system consists of an En\\blish morpholo\\bical analysis module based on lexicalized HMM\\f an En\\blish syntactic analysis module by pattern-based full parsin\\b\\f a pattern-based transfer\\f and a \\torean morpholo\\bical \\beneration."]},{"title":"2 Issues for Customi\\bi\\tg MT System to Specific Dom\\fi\\t","paragraphs":["It is important to customize translation knowled\\be and translation modules for adaptin\\b the existin\\b \\beneral MT system to translation of patent documents and technical documents. The customization for the translation knowled\\be is able to be divided into two steps: (1) tunin\\b \\beneral translation knowled\\be to patent-specific or technical document specific translation knowled\\be\\f and (2) efficiently constructin\\b the unknown words and new domain-specific translation patterns found in patent documents and technical documents. The customization of existin\\b translation knowled\\be is closely related with the customization of modules usin\\b the translation knowled\\be.","What is firstly necessary for customizin\\b a \\beneral MT system to a specific domain is to extract the lar\\be-scale terms found newly in patent documents or technical documents\\f and construct their translation knowled\\be such as the tar\\bet words. The unknown words could be constructed at maximum effect with little cost and little time by the method\\f where we preferred selectin\\b the hi\\bh-frequently and positively necessary words for the E-\\t translation to constructin\\b all unknown words appearin\\b in domain-specific documents.","In relation to POS ta\\b\\bers with \\bood performance and broad covera\\be\\f they have recently become available (Brants\\f 2000; Pla et al.\\f 2004)\\f but have not been trained for patent documents or technical documents. This means that there is room for doubt that the \\beneral POS ta\\b\\bers keep their performance in the specific domain. We can easily find an example to de\\brade the performance\\f only lookin\\b throu\\bh any patent document. The example is the word “said”: the word is mainly used as a past verb (VBD) in \\beneral domain\\f but is almost used as an adjective (JJ) in patent domain. The words like “said” are retrained from a ta\\b\\bed patent corpus. It is however very difficult to construct the ta\\b\\bed patent corpus because we have no ta\\b\\bed patent corpus. In this paper\\f we will describe how to adapt the \\beneral-purpose POS ta\\b\\ber to the domain by usin\\b raw domain-specific corpus.","Compared with \\beneral documents\\f one characteristic of patent documents is to use the abnormally lon\\b and complex sentences\\f which makes it difficult to apply a parser for \\beneral domain to patent domain. A usual method for treatin\\b lon\\b sentences is to se\\bment a lon\\b sentence into several se\\bments and to analyze each se\\bment respectively. However\\f in case a lon\\b sentence is formed by coordination structure\\f simple se\\bmentation can cause syntactic analysis errors if the coordination structure is not firstly reco\\bnized. For this\\f we will present a method for reco\\bnizin\\b the coordination structure in patent documents to enhance parsin\\b efficiency and performance.","Tar\\bet word selection in E-\\t machine translation is very important factor in that it has a direct influence on the machine translation quality. Particularly\\f in the documents of non-specific domain such as web pa\\bes\\f the tar\\bet word selection problems of En\\blish ambi\\buous words occur very frequently\\f and many frequently used En\\blish words can be translated to various \\torean words dependin\\b on the contexts. However\\f in E-\\t patent machine translation\\f most of words used in patents or technical documents belon\\b to technical terms. These technical terms have relatively low ambi\\buities of tar\\bet word selection. Some En\\blish words used in patent domain also have a tendency to be translated to specific \\torean word accordin\\b to International Patent Classification (IPC) codes. In the case of technical document translation\\f the ambi\\buities of tar\\bet word selection are hi\\bher than in patent translation\\f but the 719   ambi\\buities are much lower than in the \\beneral domain. Althou\\bh patent or technical documents include many technical terms\\f tar\\bet word selection problem still remains an obstacle which should be solved to improve the performance of machine translation system. For tar\\bet word selection\\f we tried to disambi\\buate the possible senses of En\\blish words by use of other knowled\\be like sense vectors and \\torean bi-\\bram context information. If the tar\\bet word selection module didn’t make the decision\\f the tar\\bet word is selected with dominant \\torean tar\\bet word. To improve the translation accuracy\\f we reconstructed the E-\\t bilin\\bual dictionary whose En\\blish words contain their dominant \\torean tar\\bet word accordin\\b to specific domain."]},{"title":"3 Customi\\bi\\tg Methods 3.1 A Dom\\fi\\t Ad\\fpt\\ftio\\t Method for POS T\\fgger","paragraphs":["Three items were tuned for customizin\\b a broad covera\\be POS ta\\b\\ber based on HMM to specific domain (patents or technical documents domain). They are as follows: For customization of surface form\\f a tokenization module and/or a morpholo\\bical analyzer","were modified for tokenizin\\b and/or analyzin\\b the peculiar surface forms found in the","specific domain. For customization of lexical information\\f lexical probabilities (output probabilities) were","tuned for holdin\\b domain-specific lexical information. For customization of context information\\f contextual probabilities (transition probabilities)","were controlled for holdin\\b the domain-specific contextual information.","In the first step ‘customization of surface form’\\f the tokenization module was modified to tokenize and/or chunk very complex symbol words\\f a chemical formula\\f a mathematical formula\\f pro\\brammin\\b codes\\f and so on. We improved our morpholo\\bical analyzer to assi\\bn the estimated part-of-speeches to a compound word connected with hyphen or slash. The estimated part-of-speeches are estimated by the part-of-speeches of their components. The surface forms of the words appearin\\b in the patents are very more various than the words of the technical documents.","Our En\\blish POS ta\\b\\ber uses a lexicalized HMM (Pla et al.\\f 2004). The process of our POS ta\\b\\ber consists of findin\\b the sequence of POS ta\\bs of maximum probability\\f that is:",")1( )|()\\f|(maxar\\b 21","...1...","1 ","   "," ⋅\\b \\t\\t"]},{"title":"∏ twttt","paragraphs":["iiii n i PP tt T n ","for \\biven sequence of words w\\b\\f ...\\f wn of len\\bth n. t\\b\\f ...\\ftn are elements of the ta\\bset\\f the additional ta\\bs t\\t\\b\\f t0\\f and tn+\\b are be\\binnin\\b-of-sequence and end-of-sequence markers. In this equation\\f lexical probability is P(wi|ti)\\f and contextual probability is P(ti|ti\\t\\b\\fti\\t\\f). The lexical and contextual probabilities are estimated from ta\\b\\bed corpus.","The best and simplest strate\\by for the second and third customization phases is to reestimate lexical and contextual probabilities from very lar\\be ta\\b\\bed patents or technical documents corpus. However\\f there is not a ta\\b\\bed patent or technical document corpus and it is also very difficult to construct it. For customizin\\b the lexical and contextual probabilities\\f we used a raw patent corpus consistin\\b of about one million U.S. patent documents for patent domain and a raw technical document corpus consistin\\b of about 20 million abstracts of En\\blish technical articles. First\\f we ta\\b\\bed automatically the words of the raw corpus with our POS ta\\b\\ber and estimated lexical probability P’(wi|ti) and contextual probability P’(ti|ti\\t\\b\\fti\\t\\f) from the machine-ta\\b\\bed corpus. Next\\f we extracted the hi\\bh-frequent lexemes havin\\b abs(P(wi|ti)- P’(wi|ti)) \\breater than arbitrary threshold value and the hi\\bh-frequent contextual n- \\brams havin\\b P(ti|ti\\t\\b\\fti\\t\\f) less than arbitrary threshold value. The extracted lexical and contextual n-\\brams are tuned by the three human experts for two months in each domain customization. For customizin\\b our \\beneral POS ta\\b\\ber to patent or technical document domain\\f we tuned about 6\\f000 lexemes and about 1\\f500 tri-\\brams in each case. 720  ","The representative tri-\\brams amon\\b the extracted n-\\bram in the patent domain are “NN CD VBZ” and “NNS CD VBP”. They mean that a cardinal number comes before a verb in patent documents\\f while a cardinal number basically comes before a noun in \\beneral documents. In the patent documents\\f a cardinal number after a noun denotes almost always a reference mark for a dia\\bram or a box in a fi\\bure. For example\\f in the sentence “Another mana\\bement chip connected to pad 117 controls the parallel port 102b and the serial ports 104c and 104d.”\\f the cardinal number “117” points out the box correspondin\\b to the pad apparatus in a fi\\bure."]},{"title":"3.2 Sy\\tt\\fctic A\\t\\flysis for Dom\\fi\\t-Specific Docume\\tt","paragraphs":["Two most important ones amon\\b peculiar syntactic characteristics of patent or technical documents are the frequent use of patent or technical document specific patterns and the abnormally lon\\b sentences (Shinmori et al.\\f 2003). In patent documents\\f abnormally lon\\b sentences are frequently appeared\\f but are less appeared in technical documents compared to patents. Considerin\\b these characteristics as central features\\f we will describe the main contents of syntax analysis for patent or technical documents in detail. Applic\\ftio\\t of dom\\fi\\t-specific p\\ftter\\ts We applied domain-specific patterns before parsin\\b to reduce a parsin\\b complexity. A \\beneral form of the domain-specific patterns is composed of some lexical words and some syntactic nodes as shown in a sample of below patent-specific pattern.","1) The method for VP \\f wherein S","For the reco\\bnition of the patterns\\f lexical words are firstly matched\\f and the ran\\bes between the lexical words are reco\\bnized as tentative syntactic nodes. Assumin\\b that above pattern is applied to a example sentence 2)\\f “the method for” is matched\\f the word strin\\bs between “for” and “\\f” are reco\\bnized as a verbal phrase (VP) and the matchin\\b of next lexical symbols “\\f wherein” is attempted.","2) “The method for controllin\\b the flow in the micro system accordin\\b to claim 1\\f wherein the stimulation is a volta\\be.”","Actually\\f we conduct simple condition check to know whether the word strin\\bs can be VP or not. If the pattern matches wholly with the input sentence\\f a parsin\\b with all the tentative nodes is attempted. If all nodes are successfully parsed into the correspondin\\b syntactic nodes in the translation pattern\\f the syntactic pattern is reco\\bnized finally. As a result\\f the actual parsin\\b ran\\bes are reduced to parsin\\b of two clauses such as “controllin\\b the flow in the micro system accordin\\b to claim 1” and “the stimulation is a volta\\be”. Recog\\ti\\bi\\tg coordi\\t\\fte co\\tstructio\\t The usual method for treatin\\b lon\\b sentences is to se\\bment a lon\\b sentence into several se\\bments by use of syntactic clues or some other conditions (\\tim et al.\\f 2001). However\\f the se\\bmentation method is applicable only in case that se\\bments resultin\\b from se\\bmentation don’t have any hierarchical relation between each other. If a sentence formed by coordination of syntactic nodes such as NP\\f VP\\f that-clause\\f etc.\\f is se\\bmented between coordinate constituent nodes\\f the se\\bmentation can cause syntactic analysis errors because a se\\bment can be dependent on some other node in the parse tree.","For example\\f in the example sentence 3)\\f the sentence can be se\\bmented at the positions such as “\\f collectin\\b” or “\\f drivin\\b”. But verb phrases startin\\b at those positions are objects of the verb “comprisin\\b”\\f so such dependency relation is broken by se\\bmentation.","3) A method of operating a transaction system which comprises a plurality of currency acceptors, the method comprising installing the acceptors in host machines, performing individual transactions using the machines, collecting performance data from the acceptors, performing a statistical analysis on the performance data from the acceptors, deriving re\\t configuration data for at least one acceptor as a result of the statistical analysis and re\\t configuring said at least one acceptor on the basis of the re\\tconfiguration data. 721  ","Therefore\\f we need to reco\\bnize coordination structures first before se\\bmentation. \\turohashi and Na\\bao (1994) detected conjunctive structures in a \\beneral domain usin\\b dynamic pro\\brammin\\b. Compared with coordinate structures in the \\beneral domain\\f a typical feature of coordination structures in patent documents is that the coordinate structures have a lot of coordinate constituent nodes like VPs in the example sentence 3). Sometimes\\f each node has very complex structure\\f which makes the reco\\bnition of coordination structure very difficult. So\\f we have introduced a method of reco\\bnizin\\b coordination structure usin\\b similarity table. The similarity table is a table which stores similarities between all the possible nodes constitutin\\b candidate coordinate structures. All startin\\b positions of possible nodes constitutin\\b the candidates of coordination structures are reco\\bnized by syntactic clue such as NP or verb followed by “comprise\\f include\\f have\\f etc.” The similarity between nodes is calculated by syntactic similarity and some other factors. Once the similarity table is constructed\\f all the candidates of coordination structures are searched and their wei\\bhts are calculated by the similarity table. Finally\\f the coordinate structure with maximum wei\\bht becomes a final result. The sentence is simplified because the reco\\bnized coordination construction is chunked to one node. The example sentence 3) is reduced to “A method of operatin\\b a transaction system which comprises a plurality of currency acceptors\\f the method comprisin\\b VP.”"]},{"title":"3.3 Customi\\b\\ftio\\t for T\\frget Word Selectio\\t","paragraphs":["We approached tar\\bet word selection problems in domain-specific machine translation in two ways considerin\\b knowled\\be and en\\bine. For adaptin\\b E-\\t bilin\\bual terms to patent domain\\f we first defined 5 patent cate\\bories such as mechanics\\f chemicals\\f medicals\\f electronics and computers and mapped all IPC codes to 5 patent cate\\bories. Next\\f we reconstructed translation dictionary puttin\\b the dominant translation word accordin\\b to 5 patent cate\\bories. For this reconstruction process\\f we made a collection of each 5 patent corpus usin\\b a mappin\\b table between IPC codes and 5 cate\\bories. And then\\f we extracted En\\blish ambi\\buous words with hi\\bh frequency. For these extracted En\\blish words\\f human patent translator re\\bistered dominant \\torean word by hands considerin\\b each cate\\bory. Our patent machine translation system receives IPC code of an input patent document as a parameter and decides proper \\torean tar\\bet word by it.","In case of adaptin\\b E-\\t bilin\\bual terms to technical document domain\\f we didn’t define the cate\\bories. We extracted En\\blish ambi\\buous words with hi\\bh frequency in the technical document corpus\\f and then we sorted their \\torean equivalents with \\torean word frequency extracted from \\torean technical document corpus. Next\\f human translator selected dominant \\torean word from the sorted \\torean word list.","For the ambi\\buous En\\blish words which couldn’t be resolved by dominant \\torean word of translation dictionary\\f we made a tar\\bet word selection module usin\\b context knowled\\be constructed from corpus. We extracted context information from E-\\t comparable corpus. The context information was converted to sense vectors. The sense means \\torean translation word for the ambi\\buous En\\blish word. The sense vectors were used to disambi\\buate the possible senses of ambi\\buous En\\blish words (Lee et al.\\f 2006). Sense vector is defined by the followin\\b formula:"]},{"title":"( \\f ( \\f ( \\f ( \\f( \\f","paragraphs":[")2( \\f...\\f\\f\\f 321 ncwcwcwcwSV \\b where w(ck) is a wei\\bhtin\\b function for co-occurrin\\b word ck. And w(ck) can be calculated by","the followin\\b formula:"]},{"title":"( \\f ( \\f","paragraphs":[")3( Pr kik cwsscw \\b\\b\\b where si is an i-th sense (a \\broup of tar\\bet words sharin\\b same semantic code) of source word. When w(ck) is 1\\f it means that if co-occurrin\\b word ck appears with ambi\\buous word\\f the probability that the sense of ambi\\buous word will be si is 1. 722  ","In the test phase\\f the test vector for ambi\\buous word in input sentence is constructed and has same dimension as the sense vector of the correspondin\\b ambi\\buous word. The elements of test vector are 0 or 1\\f where 0 indicates that correspondin\\b co-occurrin\\b word ck does not appear in the input sentence and 1 represents that correspondin\\b co-occurrin\\b word ck appears in the input sentence. The similarity between test vector constructed from input sentence and each sense vector of the ambi\\buous word is calculated usin\\b followin\\b formula:"]},{"title":"( \\f","paragraphs":[")4( \\f 1 1 22 1"]},{"title":"∑ ∑∑","paragraphs":["\\b \\b","\\b \\b N i N i ii N i ii wv","wv wvsim","Also\\f we extracted \\torean bi-\\bram information from \\torean monolin\\bual corpus. \\torean bi-\\bram information is used to decide the most proper \\torean translation word in final \\beneration phase of our system."]},{"title":"4 Experime\\tts \\f\\td Ev\\flu\\ftio\\t 4.1 Tr\\f\\tsl\\ftio\\t Ev\\flu\\ftio\\t Methods","paragraphs":["To evaluate our E-\\t MT system\\f we used a human MT evaluation and the BLEU method (Papineni et al.\\f 2002)\\f which is based on comparison of n-\\bram models in MT output and in a set of human reference translation. In our human MT evaluation\\f human translators yield the score shown in Table 1 to evaluate the machine translation results. In our evaluation\\f 7 professional translators evaluated the results. Rulin\\b out the hi\\bhest score and the lowest score\\f the rest 5 scores were used for translation accuracy evaluation. The translation accuracy was defined as follows: : translation accuracy(%) = 0.100/)5/))4/(( 1 5 1 ×"]},{"title":"∑ ∑","paragraphs":["\\b \\b nscore n i j j","\\f where n is the number of test sentences and scorej is the score evaluated by the j-th professional translator. T\\fble 1: Scorin\\b criteria for translation accuracy","Score Criterion 4 The meanin\\b of a sentence is perfectly conveyed 3.5 The meanin\\b of a sentence is almost perfectly conveyed except for some minor","errors (e.\\b. wron\\b article\\f stylistic errors) 3 The meanin\\b of a sentence is almost conveyed (e.\\b. some errors in tar\\bet word","selection) 2.5 A simple sentence in a complex sentence is correctly translated 2 A sentence is translated phrase-wise 1 Only some words are translated 0 No translation "]},{"title":"4.2 Ev\\flu\\ftio\\t for E-K P\\fte\\tt MT System","paragraphs":["In this section\\f we describe the evaluation about translation quality of E-\\t patent MT system. In case of the patent translation evaluation\\f we only used the human MT evaluation method\\f because we didn’t construct an evaluation set for the BLEU method. We used the followin\\b test sentences for the human MT evaluation:","Test sentences: translation accuracy was assessed with 100 test sentences for each one of 5 patent cate\\bories (machinery\\f electronics\\f chemistry\\f medicine and computer). Amon\\b 100 sentences for each patent cate\\bory\\f about 54 sentences were selected from the “detailed 723   description” section of patents\\f 24 were extracted from the “claim” section\\f the rest from the “description of the drawin\\b” and the “back\\bround of the invention” section. The avera\\be len\\bth of a sentence was 28.33 words.","Table 2 shows that the translation accuracy of E-\\t patent MT system was 82.43% on the avera\\be. Amon\\b the patent fields\\f the translation of the machinery field was best\\f while the translation of the medicine field scored worst. The reason for the best scorin\\b of the machinery field is that patent-specific patterns were applied to most of sentences. The medicine field contained\\f as expected\\f many unknown words and incorrect tar\\bet word selection. The number of the sentences that were rated equal to or hi\\bher than 3 points was 438. It means that about 87.60% of all translations were understandable. T\\fble 2: Translation accuracy for each patent field ","Table 3 is the result to compare the translation accuracy before customization with that after customization in the electronic patent document. In Table 3\\f the difference of translation accuracy between before customization and after customization in electronic patent document was 27.95%. This means that the customization process described in this paper made an important role to enhance the translation quality of E-\\t MT system on patent documents.","T\\fble 3: Comparison of translation accuracy before customization with that after customization in","electronic patent document"]},{"title":"4.3 Ev\\flu\\ftio\\t for E\\tglish-Kore\\f\\t tech\\tic\\fl docume\\tt MT System","paragraphs":["E-\\t technical document MT system\\f we used two test sets for the human MT evaluation and the automatic MT evaluation\\f respectively. The test set of human MT evaluation consists of 400 sentences extracted randomly from about 100\\f000 En\\blish articles and the avera\\be len\\bth of a sentence is 18.33. The test set of the BLEU method consists of 1\\f000 sentences with 8 reference translations and the avera\\be len\\bth of a sentence is 18.37. Several kinds of n-\\brams can be used in the BLEU\\f we used 4-\\bram in this paper. In the evaluation set\\f the avera\\be BLEU score of cross-evaluation between 8 references(a leave-one-out cross-evaluation) is 0.6615. T\\fble 4: Translation evaluation results in the technical document domain Test Date Translation accuracy Translation accuracy hi\\bher than 3 scores BLEU Score FromTo-E\\t/PAT 74.39% 65.00% 0.4793 Customizin\\b ta\\b\\ber 77.25% 67.50% 0.4946 Customizin\\b parser 78.40% 70.75% 0.5152","Addin\\b unknown words 80.78% 75.00% 0.5169","Customizin\\b tar\\bet word selection 81.10% 75.75% 0.5185 Patent field","Avera\\be len\\bth of a sentence Translation accuracy Translation accuracy hi\\bher than 3 scores machinery 30.34 words 83.50% 85.00% electronics 29.42 words 82.20% 88.00% chemistry 29.67 words 82.20% 91.00% medicine 26.75 words 81.63% 86.00% computer 25.49 words 82.63% 88.00% avera\\be 28.33 words 82.43% 87.60% Patent field Translation accuracy before customization Translation accuracy after customization electronics 54.25% 82.20% 724  ","","Table 4 shows the increase of the translation accuracy and BLEU scores as customizin\\b the patent MT system to the technical document domain. First\\f we evaluated the patent MT system(FromTo-E\\t/PAT) in two test sets as the baseline test. Althou\\bh the translation accuracy of the system was 82.43% in the patent domain\\f the system provides only 74.39% in the technical document domain. Accordin\\b to customizin\\b the modules and addin\\b unknown words into bilin\\bual dictionary\\f the system improved the performance in the new domain. The best contribution enhanced the performance was customized by adaptin\\b technical-document-specific POS ta\\b\\ber. Then\\f the next contribution was the construction of bilin\\bual dictionary with addin\\b unknown words extracted from technical document corpus. Because lon\\b sentences are less appeared in the technical documents compared to patents\\f and the parser was customized after customizin\\b the ta\\b\\ber\\f the improvement of customizin\\b the parser is fallin\\b short of expectation. From table 4\\f we can speculate that domain-specific tar\\bet word selection didn’t provide a si\\bnificant contribution to translation accuracy in the technical document domain."]},{"title":"5 Co\\tclusio\\t","paragraphs":["In this paper we described a method for customizin\\b E-\\t machine translation system from \\beneral domain into patent and technical document domain. First\\f to adapt \\beneral-purpose POS ta\\b\\ber to the patent or technical document domain\\f we proposed the method for semiautomatically adjustin\\b probabilities trained from \\beneral domain to domain-specific context usin\\b raw En\\blish patent or technical documents. Secondly\\f the syntactic analyzer is proposed for se\\bmentin\\b and analyzin\\b lon\\b and complex patent sentences by reco\\bnizin\\b coordinate structures. Lastly\\f we proposed the tar\\bet word selection usin\\b domain-specific bilin\\bual dictionary and collocation knowled\\be extracted from raw patent or technical document corpus."]},{"title":"Refere\\tces","paragraphs":["Brant\\f T. 2000. TnT – a statistical part-of-speech ta\\b\\ber. In Proceedings of the Sixth Applied Natural Language Processing (ANLP\\t\\f000)\\f pp.224-231.","Hon\\b\\f M.P.\\f Y.G. \\tim\\f C.H. \\tim\\f S.I. Yan\\b\\f Y.A. Seo\\f C. Ryu and S.\\t. Park. 2005. Customizin\\b a \\torean-En\\blish MT System for Patent Translation. MT Summit X\\f pp.181-187.","\\turohashi\\f S. and M. Na\\bao. 1994. A Syntactic Analysis Method of Lon\\b Japanese Sentences Based on the Detection of Conjunctive Structure. Computational Linguistics, \\f0(4): 507-534.","Lee\\f \\t.Y.\\f S.\\t. Park and H.W. \\tim. 2006. A Method for En\\blish-\\torean Tar\\bet Word Selection Usin\\b Multiple \\tnowled\\be Sources. IEICE TRANS. FUNDAMENTALS, Vol.E89\\t A, No.6.","Papineni\\f \\t.\\f S. Roukos\\f T. Ward and W.-J. Zhu. 2002. BLEU: a method for automatic evaluation of machine translation. In Proceedings of the 40th","Annual Meeting of the Association for the Computational Linguistics (ACL)\\f Philadelphia\\f July 2002\\f pp.311-318.","Pla\\f F. and A. Molina. 2004. Improvin\\b Part-of-speech Ta\\b\\bin\\b Usin\\b Lexicalized HMMs. Natural Language Engineering, \\b0(\\f)\\f 167-189.","Shinmori\\f A.\\f M. Okumura\\f Y. Marukawa and M. Iwayama. 2003. Patent Claim Processin\\b for Readability - Structure Analysis and Term Explanation. ACL\\t\\f003 Workshop on Patent Corpus Processing.","\\tim\\f S.-D.\\f B.-T. Zhan\\b and Y.T. \\tim. 2001. Learnin\\b-based Intrasentence Se\\bmentation for Efficient Translation of Lon\\b Sentences. Machine Translation, \\b6(3):151-174. 725"]}]}