{"sections":[{"title":"BOOK REVIEWS THE WORDTREE ® Henry G. Burger (author, compiler, and editor)","paragraphs":["Merriam, Kansas: The Wordtree, 1984, 380 pp. $149.00 The Wordtree is a combination of a knowledge representation system and a thesaurus. Although it claims that it is \"the word system for solving physical and social problems branch by branch,\" it appears to be primarily an organization of English words, plus some rare and made-up words, according to actions. A complete hierarchy, starting with create, is defined for 20,000 transitive verbs. Every transitive verb is defined by giving two other verbs: one which is more general, and the other which when combined with the more general term selects the particular word being defined. Thus each node in the hierarchy is a particular verb; its parent is a more general verb, which is related to the node in question by combination with another specific verb. From each node you can find a more general verb (except, of course, for the root); or, by looking underneath the node, you can find a list of more specific verbs. Noun-like concepts are indexed into the verbs that produce them. For many verbs, suitable nouns to act as instrumentalities or objects are given.","For example, suppose one wishes to use The Wordtree to produce world peace (the book claims \"to maneuver or change the world, use the Wordtree\"). You look up peace, and it tells you that it is produced by pacify and negotiate. How do you do either of those things? You look them up and it refers you to pacify at number 17477, a subclass of emotionize distinguished by please, i.e., to pacify people or things, you should simultaneously emotionize them and please them. Similarly, negotiate (9191) is the combination of maneuver and effect. Strings like emotionize, which are not common English, appear frequently: this one is in the hierarchy as brain and ekphore, where ekphore is the negative of excess and louden. The message then, is that one can pacify by communicating quietly and pleasantly; one can negotiate by maneuvering with effect. Or, to quote Teddy Roosevelt, \"speak softly and carry a big stick.\"","The reduction of all concepts to a hierarchical structure, with the expectation of great benefits, has been tried before. John Wilkins wrote in 1668, \"the reducing of all things and notions, to such kind of Tables, as are here proposed (were it as compleatly done as it might be) would prove the shortest and plainest way for the attainment of real Knowledge, that hath been yet offered to the World.\" This is from the introduction to his Essay Towards a Real Character and a Philosophical Language (reprinted by Scolar Press Ltd, 1968). Wilkins used a two-dimensional tabular representation of his hierarchy. Compared to the linearized hierarchy printed in The Wordtree, Wilkins's table is much easier to scan. Also, Wilkins's book is printed in upper and lower case and in a large type size; Burger uses a tiny, upper-case only, six-column format that is hard to read (in fairness, as a result his book is much easier to carry). The Wordtree is also made less accessible by the rare or made-up words; I open at random to page 128 and find items like zipcodesequence, enmagazine, satevepost, bodge, encist, ecphorize, and vorlauf. Burger's linearization of the hierarchy also produces some strange results; for page after page, for example, the chemical elements, listed in order, are interleaved with parts of the world. On page 114, as an example, one finds the following \"words\" in the following order: scotchify, promethiate, hispaniolize, gaelicize, samariate, westindianize, europiate, gadolinate (where europiate is from the chemical element europium, and is to be distinguished from europeanize). Yes, the hierarchical relations, if you track the numbers, are keeping the lists of elements and of countries distinct; but the result is that The Wordtree is hard to browse, requiring constant references to the category numbers and/or the index to find things.","I tried a sample word problem. A friend asked over lunch for an alternative to represent in contexts similar to \"In electronic mail anger is sometimes represented by capital letters.\" I thought offhand of manifest and then returned to look this up. A conventional Roget's Thesaurus gave almost immediately such words as indicate, illuminate, emphasize, show, brandish, disclose, flaunt, dramatize, reflect, feature, demonstrate, symbolize, evidence, personify, highlight, express, formulate under the heading for manifest that included represent. In The Wordtree I find manifest (5611) as show and unclose. Under it are activate, feature, landmark and other less relevant words. Above manifest I track back through the sequence show (5179), reveal (4792), illuminate (4440), luminate (4075), lumine (3727), light (3354) [at this point, thinking of Genesis 1:3 I hoped I was near the beginning of the hierarchy, but no such luck], ir (3104), microwave (2909), shortwave (2708), radio (2567), heat (2352), warm (1990), tepefy (1482), thermalize (990), agitate (718), alternate (456), interchange (251), mutualize (151), affect (95), change (54), and create (1). Above represent the sequence goes through intend, halfintend, mind, perceive, sense, morse [as in Morse code], encode, cipher, substitute, favor, like, aestheticize, acculturate, accustom, habituate, characterize, pattern, model, represent and we have reached a circularity (noted in the book). Underneath represent were exaggerate, model, bewrite, Computational Linguistics, Volume 13, Numbers 1-2, January-June 1987 69 Book Reviews The Wordtree"]},{"title":"gerrymander, dummy, sample, foist, portray, belie, mirror, depict, typify, hippodrome, describe, describble, lament, paraphrase, blackbox, blazon","paragraphs":["and other words. Finding the words for this paragraph took an hour, and required looking at many pages of the book. Note that there is no common parent of"]},{"title":"represent","paragraphs":["and"]},{"title":"manifest.","paragraphs":["What about Wilkins?"]},{"title":"Represent","paragraphs":["is under \"Transcendental Relations of Action\" along with"]},{"title":"manifest","paragraphs":["(respectively under the subheadings"]},{"title":"comparate","paragraphs":["and"]},{"title":"simple","paragraphs":["transcendental relations). They are on facing pages and in the immediate vicinity of these two words are"]},{"title":"declare, show, exhibit, present, reveal, set forth, come to light,. render, demonstrate,","paragraphs":["and"]},{"title":"disclose.","paragraphs":["So I would rather have the older book, which also does not begin with dire warnings about what will happen to anyone who even reads a photocopy, much less makes one. FASTEN = HOLD t STAY 12510 FASTEH ENCZRCLEO OBJECT = HANK (12940) FASTEN GROUNDED OBJECT = STAKE (12935) FASTEN ZNTRUDEO OBJECT : NEOGE (12920) FASTEN LINKED OBJECT = CHAZH (15297) FASTEH PZERCED OBJECT = BRAD (129391 FASTEN SOCKETED OBJECT = DOP (12945) FASTEN STACKED OBJECT = LOCKSTACK (129371 FASTEN STRAPPED OBJECT = THOHG (15352) FASTEN STRETCHED OBJECT = RACK (12917) FASTEN SURROUNOEO OBJECT = CLASP (12943) FASTEN TAUTENED OBJECT = ORLRISTRETCH (12941| FASTEN UPROLLED OBJECT = FURL (129311 FASTEN NOUNO OBJECT = BITT (12927) FASTEN & EHCLOSE = COPS (12923) FASTEN & FZRLt = FIX (12938) FASTEN & ORNAHENT = BROOCH (14962) FASTENING CAUSE ~ COHTROL, UHLOOSE FASTENING EFFECT & SNUG FASTEHZHG IHSTRUIIENT & CLEAT, STICKY Example of entry fromThe Wordtree. The basic idea of"]},{"title":"The Wordtree,","paragraphs":["to represent a hierarchy exclusively of actions, and connect all objects to the actions by the correct case relation, is an interesting one. This conforms with general linguistic ideas of predicates as dominating sentences, and it permits a different approach to a word list than any conventional alphabetical ordering. However, in order to make a strict hierarchy, it has been necessary to oversimplify considerably. For example to"]},{"title":"fish","paragraphs":["is defined as to"]},{"title":"catch","paragraphs":["and"]},{"title":"draw;","paragraphs":["this would seem to cover a great many types of capturing beyond conventional fishing (consider photography, tempting, stealing, harvesting, etc.). The word"]},{"title":"lasso,","paragraphs":["which might also be thought to cover catching and drawing, is defined as"]},{"title":"springe","paragraphs":["and"]},{"title":"target","paragraphs":["where"]},{"title":"springe","paragraphs":["is"]},{"title":"intercept","paragraphs":["and"]},{"title":"snare.","paragraphs":["The sense of"]},{"title":"catch","paragraphs":["meaning to"]},{"title":"stop","paragraphs":["or"]},{"title":"halt","paragraphs":["is, I think,"]},{"title":"snaggle (interrupt","paragraphs":["and"]},{"title":"catch).","paragraphs":["It may be that there is no simple way to print a book of this information and only a proper interactive computer display would serve. But I doubt that any format change can deal with the impossibility of placing each word in a unique position in a hierarchy of actions, which must inevitably suppress many shades of meaning and connotation.","It would greatly improve"]},{"title":"The Wordtree","paragraphs":["if the hierarchical structure could be displayed somehow; I found it very tedious to track back and find the parents of the words I had. It would also be easier to read if printed in larger tyl~e, and if the quantity of unusual words were decreased. But even so, I find the organization of the word lists so unusual and so personal that I am not sure I could make much use of them anyway. Part of the pro b - lem may be that since each word has only one spot in the hierarchy, new words are made up to handle the other senses of the ambiguous words, and the result is sometimes hard to understand. Yes,"]},{"title":"throw","paragraphs":["has many meanings, but does using"]},{"title":"pepperoni","paragraphs":["for"]},{"title":"throw","paragraphs":["and"]},{"title":"maneuver","paragraphs":["help the reader? Although"]},{"title":"The Wordtree","paragraphs":["is definitely something new, I do not find the exclusively verb-based structure convenient. It clashes, in many cases, with traditional and familiar arrangements of countries, chemical elements, and so forth. On balance I would recommend those with good libraries to read the work of Bishop Wilkins instead. As an example of idea classification for lofty and ambitious goals, it is more accessible to the reader and of historical as well as linguistic interest."]},{"title":"Michael Lesk","paragraphs":["Bell Communications Research Morristown, NJ LECTURE ON CONTEMPORARY SYNTACTIC THEORIES: AN INTRODUCTION TO GOVERNMENT-BINDING THEORY, GENERALIZED PHRASE STRUCTURE GRAMMAR, AND LEXI-CAL-FUNCTIONAL GRAMMAR (CSLI lecture notes number 4) Peter Sells Center for the Study of Language and Information, \"Stanford University, 1986, viii+214 pp. [Distributed by the University of Chicago Press] no ISBN. Cloth $23.95; paper $11.95 AN INTRODUCTION TO UNIFICATION-BASED APPROACHES TO GRAMMAR (CSLI lecture notes number 3) Stuart M. Shieber Center for the Study of Language and Information, Stan-","ford University, 1985, iv+ 106 pp. [Distributed by the","University of Chicago Press] Cloth ISBN 0-937073-01-6, $17.95; paper ISBN 0-937073-00-8, $8.95 These books, hereafter CSLI-3 and CSLI-4, are two volumes in the Lecture Notes series from the Center for the Study of Language and Information, Stanford University.","A first remark on CSLI-3: Chapter 5, a postscript written by Thomas Wasow, constitutes the best and most extensive review of the book itself. CSLI-3 is organized as follows: Chapter 1 is concerned with basic concepts of syntax. Chapters 2, 3, and 4 present, respectively, Chomsky's Government-Binding theory (GB), Gazdar's Generalized Phrase Structure Grammars (GPSG) [in fact 70 Computational Linguistics, Volume 13, Numbers 1-2, January-June 1987"]}]}