{"sections":[{"title":"Book Reviews The Wordtree gerrymander, dummy, sample, foist, portray, belie, mirror, depict, typify, hippodrome, describe, describble, lament, paraphrase, blackbox, blazon","paragraphs":["and other words. Finding the words for this paragraph took an hour, and required looking at many pages of the book. Note that there is no common parent of"]},{"title":"represent","paragraphs":["and"]},{"title":"manifest.","paragraphs":["What about Wilkins?"]},{"title":"Represent","paragraphs":["is under \"Transcendental Relations of Action\" along with"]},{"title":"manifest","paragraphs":["(respectively under the subheadings"]},{"title":"comparate","paragraphs":["and"]},{"title":"simple","paragraphs":["transcendental relations). They are on facing pages and in the immediate vicinity of these two words are"]},{"title":"declare, show, exhibit, present, reveal, set forth, come to light,. render, demonstrate,","paragraphs":["and"]},{"title":"disclose.","paragraphs":["So I would rather have the older book, which also does not begin with dire warnings about what will happen to anyone who even reads a photocopy, much less makes one. FASTEN = HOLD t STAY 12510 FASTEH ENCZRCLEO OBJECT = HANK (12940) FASTEN GROUNDED OBJECT = STAKE (12935) FASTEN ZNTRUDEO OBJECT : NEOGE (12920) FASTEN LINKED OBJECT = CHAZH (15297) FASTEH PZERCED OBJECT = BRAD (129391 FASTEN SOCKETED OBJECT = DOP (12945) FASTEN STACKED OBJECT = LOCKSTACK (129371 FASTEN STRAPPED OBJECT = THOHG (15352) FASTEN STRETCHED OBJECT = RACK (12917) FASTEN SURROUNOEO OBJECT = CLASP (12943) FASTEN TAUTENED OBJECT = ORLRISTRETCH (12941| FASTEN UPROLLED OBJECT = FURL (129311 FASTEN NOUNO OBJECT = BITT (12927) FASTEN & EHCLOSE = COPS (12923) FASTEN & FZRLt = FIX (12938) FASTEN & ORNAHENT = BROOCH (14962) FASTENING CAUSE ~ COHTROL, UHLOOSE FASTENING EFFECT & SNUG FASTEHZHG IHSTRUIIENT & CLEAT, STICKY Example of entry fromThe Wordtree. The basic idea of"]},{"title":"The Wordtree,","paragraphs":["to represent a hierarchy exclusively of actions, and connect all objects to the actions by the correct case relation, is an interesting one. This conforms with general linguistic ideas of predicates as dominating sentences, and it permits a different approach to a word list than any conventional alphabetical ordering. However, in order to make a strict hierarchy, it has been necessary to oversimplify considerably. For example to"]},{"title":"fish","paragraphs":["is defined as to"]},{"title":"catch","paragraphs":["and"]},{"title":"draw;","paragraphs":["this would seem to cover a great many types of capturing beyond conventional fishing (consider photography, tempting, stealing, harvesting, etc.). The word"]},{"title":"lasso,","paragraphs":["which might also be thought to cover catching and drawing, is defined as"]},{"title":"springe","paragraphs":["and"]},{"title":"target","paragraphs":["where"]},{"title":"springe","paragraphs":["is"]},{"title":"intercept","paragraphs":["and"]},{"title":"snare.","paragraphs":["The sense of"]},{"title":"catch","paragraphs":["meaning to"]},{"title":"stop","paragraphs":["or"]},{"title":"halt","paragraphs":["is, I think,"]},{"title":"snaggle (interrupt","paragraphs":["and"]},{"title":"catch).","paragraphs":["It may be that there is no simple way to print a book of this information and only a proper interactive computer display would serve. But I doubt that any format change can deal with the impossibility of placing each word in a unique position in a hierarchy of actions, which must inevitably suppress many shades of meaning and connotation.","It would greatly improve"]},{"title":"The Wordtree","paragraphs":["if the hierarchical structure could be displayed somehow; I found it very tedious to track back and find the parents of the words I had. It would also be easier to read if printed in larger tyl~e, and if the quantity of unusual words were decreased. But even so, I find the organization of the word lists so unusual and so personal that I am not sure I could make much use of them anyway. Part of the pro b - lem may be that since each word has only one spot in the hierarchy, new words are made up to handle the other senses of the ambiguous words, and the result is some-times hard to understand. Yes,"]},{"title":"throw","paragraphs":["has many meanings, but does using"]},{"title":"pepperoni","paragraphs":["for"]},{"title":"throw","paragraphs":["and"]},{"title":"maneuver","paragraphs":["help the reader? Although"]},{"title":"The Wordtree","paragraphs":["is definitely something new, I do not find the exclusively verb-based structure convenient. It clashes, in many cases, with traditional and familiar arrangements of countries, chemical elements, and so forth. On balance I would recommend those with good libraries to read the work of Bishop Wilkins instead. As an example of idea classification for lofty and ambitious goals, it is more accessible to the reader and of historical as well as linguistic interest."]},{"title":"Michael Lesk","paragraphs":["Bell Communications Research Morristown, NJ LECTURE ON CONTEMPORARY SYNTACTIC THEORIES: AN INTRODUCTION TO GOVERNMENT-BINDING THEORY, GENERALIZED PHRASE STRUCTURE GRAMMAR, AND LEXI-CAL-FUNCTIONAL GRAMMAR (CSLI lecture notes number 4) Peter Sells Center for the Study of Language and Information, \"Stanford University, 1986, viii+214 pp. [Distributed by the University of Chicago Press] no ISBN. Cloth $23.95; paper $11.95 AN INTRODUCTION TO UNIFICATION-BASED APPROACHES TO GRAMMAR (CSLI lecture notes number 3) Stuart M. Shieber Center for the Study of Language and Information, Stan-","ford University, 1985, iv+ 106 pp. [Distributed by the","University of Chicago Press] Cloth ISBN 0-937073-01-6, $17.95; paper ISBN 0-937073-00-8, $8.95 These books, hereafter CSLI-3 and CSLI-4, are two volumes in the Lecture Notes series from the Center for the Study of Language and Information, Stanford University.","A first remark on CSLI-3: Chapter 5, a postscript written by Thomas Wasow, constitutes the best and most extensive review of the book itself. CSLI-3 is organized as follows: Chapter 1 is concerned with basic concepts of syntax. Chapters 2, 3, and 4 present, respectively, Chomsky's Government-Binding theory (GB), Gazdar's Generalized Phrase Structure Grammars (GPSG) [in fact 70 Computational Linguistics, Volume 13, Numbers 1-2, January-June 1987 • Book Reviews CSL! Lecture Notes: Sells and Shieber CG.azdar et al. 1985], and Bresnan and Kaplan's Lexical-Functional Grammars LFG.","CSLI-4 makes a perfect couple with CSLI-3, continuing to present syntactic approaches and unification-based implementation, suitable for all the grammatical formalisms discussed in the books.","The landscape in the valley of syntax is governed by GB, as the highest achievement towards universality. GB realizes a rich set of universal principles, the grammars of the particular languages being obtained as parametdzations of a Universal Grammar. All the other syntactic approaches (including GPSG, LFG, logic-based grammars) could be labeled as stages in the evolution of Chomsky's ideas from observational to descriptive and to explanatory adequacy. In their trend to universality, explicitness, and rigor, they inevitably decreased in specification of empirical detail. The linguistic pole for all the contemporary syntactic theories or tools is the effort to attain the lexical meaning, as a min-max (or equilibrium) principle: minimality, coming from semantics, and maximality, coming from syntax. Another basic idea is that clause structure is largely predictable from the semantics of predicates: these theories agree in deriving canonical structures from lexical semantics and it is (somehow) surprising \"how little needs to be stipulated beyond lexical meaning\" (T. Wasow).","CSLI-4 reveals the strong developments in unification-based implementations, stemming from different research directions but converging to grammars in which declarative and procedural interpretations can coexist. The grammatical version of unification, viewed as a (directed acyclic) graph-combinir~'g process, suggests many other linguistically and logically relevant operations: generalization (as the dual of unification), disjunction, negation, overwriting. Along with GPSG and LFG, Martin Kay's Functional Unification Grammar, logic-based grammars (Definite Clause Grammar, Extraposition Grammar, Gapping Grammar, etc. [Dahl and Saint-Dizier 1985]), Shieber's PATR-II grammars represent a \"least common denominator\" of the various unification-based formalisms but are still powerful. Appendix A in CSLI-4 contains the machine-interpretable form as an instructive example, handling increasingly complex constructs. As a corollary of all the formalisms and implementations, even those not (strictly) based on unification, like Wehrli (1984), is the emphasis on lexical properties in syntax and semantics.","This pair of books represents an important and useful effort on the part of the authors to bring these linguistic theories and tools, as well as the implementation trends, to the computational linguistics community. Neculai Curteanu \"AI. I. Cuza\" University Department of Mathematics and Computer Center 6600 Ia~i, Romania REFERENCES","Dahl, Veronica and Saint-Dizier, Patrick, Eds. 1985 Natural Language Understanding and Logic Programming. North-Holland, Amsterdam, New York, Oxford.","Gazdar, Gerald; Klein, Ewan; Pullum, Geoffrey; and Sag, Ivan 1985 Generalized Phrase Structure Grammar. Harvard University Press, Cambridge, Massachusetts.","Wehrli, Eric 1984 A Government-Binding Parser for French. Working Papers No. 48, Institut pour les l~tudes Semantiques et Cognitives, Universit6 de Gen~ve. MULTILINGUAL ASPECTS OF INFORMATION TECHNOLOGY Paul A. Bennett, Rod L. Johnson, John McNaught, Jeanette Pugh, J.C. Sager, and Harold L. Somers Aldershot: Gower, 1986, ix+ 146 pp ISBN 0-566-03513-8; £17.50 This is a book for a first acquaintance with computational linguistics. It gives an overview of some of the main fields of interest, namely machine translation, natural language interfaces, and the lexicon.","The book is directed towards user-oriented applications, especially systems on the market and under development. Some basic theoretical linguistic questions encountered in such development work are mentioned rather than discussed, and the book does not tell its read-ers too much about more fundamental research.","In accordance with this practical scope, the topic of the lexicon is presented in two distinct chapters, one on general lexicology and lexicography and the other one on terminology and terminography, and no link is established on a level of word linguistics.","The machine translation chapter introduces the basic terms, for instance in the field of system design (interlingual, transfer, direct; or machine-aided human vs. human-aided machine translation). This chapter is also the most explicit one with respect to implementation principles. The authors mention, among others, the advantages of modularity in structured programming. Another type of structured modularity is undoubtedly as important as this: the conceptual distinction between grammar and programming, with a formalism level as the interface. There are too many publications on the market which do not distinguish for example syntax, parsing formalism, and parser in a clean way. The authors of this book seem to make distinctions of this kind, and they also advocate a sound degree of modularity between the various parts of grammar (syntax, semantics .... ). In an introductory book, however, the principles of these distinctions should, to my taste, be made explicit. There are so many bad examples.","As a first superficial introduction to computational linguistics the book is certainly good, but the word \"multilingual\" in the title appears to be a bit misleading. Machine translation is of course multilingual, but what the authors report about terminography and natural language interfaces is only in some accidental cases more Computational Linguistics, Volume 13, Numbers 1-2, January-June 1987 71"]}]}