{"sections":[{"title":"THE FINITE STRING NEWSLETTER","paragraphs":["CALLS FOR PAPERS LOGIC AND COMPUTER SCIENCE WORKSHOP 9-14 June 1985 Lexington, Kentucky The workshop will cover those areas of Computer Science where an active part is played by logic-inclined researchers, in particular: • Theory of Computation • Theory of Data Bases • Artificial Intelligence • Theory of Operating Systems (Temporal Logic) • Program Verification • Logic Programming","To date, the following have accepted invitations to speak: K. R. Apt (Paris VII - IBM), P. Clote (Boston College), R. Fagin (IBM, San Jose), T. Imielinski (Rutgers), H. Lewis (Harvard), V. Lifschitz (San Jose State), J. Minker (Maryland), R. Reiter (British Columbia), R. Smith (Florida), S. Szpakowciz (Kentucky), and M. Vardi (Stanford).","In addition to the invited speakers, there will be sessions for contributed papers. Those who wish to deliver a paper should send three copies of an extended abstract to the conference address (below) before March 1. Notification of acceptance will be mailed before April 10.","A grant from the National Science Foundation makes it possible to offer a number of stipends for participants. For further information, write to the address below. (Graduate students should include letters from their advisors.) Logic and Computer Science Department of Computer Science University of Kentucky Lexington, KY 40506-0027 Organizational Committee: Forbes Lewis, Wiktor Marek, Anil Nerode. SECOND IEEE DATA ENGINEERING CONFERENCE 4-6 February 1986 Los Angeles, California SCOPE Data Engineering is concerned with the role of data and knowledge about data in the design, development, management, and utilization of information systems. As such, it encompasses traditional aspects of databases, knowledge bases, and data management in general. The purpose of this conference is to continue to provide a forum for the sharing of experience, practice, and theory of automated data and knowledge management from an engineering point-of-view. The effectiveness and productivity of future information systems will depend critically on improvements in their design, organization, and management.","We are actively soliciting industrial contributions. We believe that it is critically important to share practical experience. We look forwards to reports of experiments, evaluation, and problems in achieving the objectives of information systems. Papers which are identified as such will be processed, scheduled, and published in a distinct track. TOPICS OF INTEREST • Logical and physical database design • Design of knowledge-based systems • Data management methodologies • Architectures for data- and knowledge-based systems • Distribution of data and information • Performance Evaluation • Data engineering tools We also are planning a special workshop track: • Performance models and measurement of relational","database systems and solicit papers that report or evaluate such findings. A WARDS, STUDENT PAPERS, AND SUBSEQUENT PUBLICATION An award will be given for the best paper at the conference. Up to three awards of $500 each to help defray travel costs will be given for outstanding papers authored by students. Outstanding papers will be considered for publication in the IEEE Computer Magazine, the Transactions on Computers, and the Transactions on Software Engineering. For more information, contact the General Chairman.","CONFERENCE TIMETABLE","I JULY 1985","Deadline for receipt of four copies of paper by Second Data Engineering Conference IEEE Computer Society 1109 Spring Street, Suite 300 Silver Spring MD 20910 (301 598-8142)","! OCTOBER 1985 Acceptance letters sent. 15 NOVEMBER 1985 Camera-ready copy due. 3 FEBRUARY 1986 Tutorials 4-6 FEBRUARY 1986 Conference","PEOPLE","HONORARY CHAIRMAN C. V. Ramamoorty University of California Berkeley, CA 40 Computational Linguistics, Volume l 1, Number l, January-March 1985 The FINITE STRING Newsletter Calls for Papers","GENERAL CHAIRMAN P. Bruce Berra Syracuse University Syracuse, NY [315] 423-4445","PROGRAM CHAIRMAN Gio Wiederhold Dept. of Computer Science Stanford University Stanford, CA 94305 [415] 497-0685 Wiederhold@ sumex-aim.arpa","PROGRAM CO-CHAIRPERSONS Iris Kameny SDC Santa Monica, CA 90406 Ming T. (Mike) Liu Ohio State University Columbus, OH 43210 Richard L. Shuey Schenectady, NY 12309 Benjamin Wah Purdue University West Lafayette, IN 47907","INTERNATIONAL COORDINATION Tadeo Ichikawa Hiroshima University Faculty of Engineering, Shitami Saijo-Cho Higashi-Hiroshima 724, Japan Herbert Weber Universitaet Dortmund Fachbereich Informatik, August Schmidt Strasse 4600 Dortmund, F.R.Germany","TUTORIALS Peter Ng University of Missouri Columbia, MO","AWARDS Ming T. (Mike) Liu State University of Ohio Columbus, OH","TREASURERS Lily Chow IEEE Silver Spring, MD 20910 Aldo Castillo TR W Redondo Park, CA 90278","LOCAL ARRANGEMENTS Walter Bond Cal State University 1000 East Victoria Street Dominquez Hills CA 90747 [213] 516-3580/3398","PUBLICITY Mas Tsuchiya TRW, Bldg.02/2361 One Space Park Redondo Beach, CA 90278 [213]-536-8330 EPILOG The correct design and implementation of data systems requires attention to principles from data bases, knowledge bases, software engineering, and system evaluation. We hope you will participate.","THEORETICAL ASPECTS OF REASONING ABOUT KNOWLEDGE 9-11 March 1986 Asilomer Conference Center, Monterey, CA While traditionally research in the area of theoretical aspects of reasoning about knowledge was mainly done by philosophers, recently it has been shown to be of great relevance to computer science, especially in such areas as artificial intelligence, distributed systems, database systems, and cryptography. There has also been interest in the area among linguists and economists. The aim of this conference is to bring together researchers from these various disciplines with the intent of further-ing our theoretical understanding of reasoning about knowledge.","Topics of interest include, but are not limited to: • Semantic models for knowledge and belief • Resource-bounded knowledge (appropriate for model-","ling reasoners with limited reasoning power and","reasoning about cryptographic protocols) • Using knowledge to specify and reason about distrib-","uted systems • Semantic models of knowledge acquisition and learning • Nonmonotonic reasoning Please send 8 copies of a detailed abstract not exceeding 10 double-spaced typewritten pages in length (not a full paper), by 15 September 1985, to the program chair: Dr. J. Halpern IBM Research, K51/281 5600 Cottle Rd. San Jose, CA 95193 The abstract should include a clear description of the problem being addressed, comparisons with extant work, and a section on major original contributions of this work. The abstract must provide sufficient detail for the program committee to make a decision. Papers will be chosen on the basis of scientific merit, originality, and appropriateness for this conference.","Authors will be notified of acceptance by 1 November 1985. Accepted papers typed on special pages will be due at the above address by 15 December 1985.","We hope to allow enough time between the talks during the conference for private discussions and small Computational Linguistics, Volume I 1, Number 1, January-March 1985 41 The FINITE STRING Newsletter Calls for Paper,, group meetings. In order to ensure that the conference remains relatively small, attendance will be limited to invited participants and authors of accepted papers. Support for the conference has been received from IBM and AAAI; an application for further support is pending at ONR.","PROGRAM COMMI'FI~EE M. Fischer,"]},{"title":"Yale","paragraphs":["J. Halpern,"]},{"title":"IBM San Jose","paragraphs":["H. Levesque,"]},{"title":"University of Toronto","paragraphs":["R. Moore,"]},{"title":"SRI","paragraphs":["R. Parikh,"]},{"title":"CUNY/Brooklyn College","paragraphs":["R. Stalnaker,"]},{"title":"Cornell","paragraphs":["R. Thomason,"]},{"title":"University of Pittsburgh","paragraphs":["M. Vardi,"]},{"title":"Stanford/CSLI","paragraphs":["FIRST INTERNATIONAL CONFERENCE ON EXPERT DATABASE SYSTEMS 1-4 April 1986 Charleston, South Carolina","Sponsored by: Institute of Information Management, Technology, and Policy, College of Business Administration, University of South Carolina","In cooperation with: American Association for Artificial Intelligence; Associaton for Computing Machine - SIGMOD, SIGART, and SIGPLAN; IEEE Technical Committee on Data Base Engineering; Agence de l'Informatique, France","Conference General Chairman: Donald A. Marchand, Director, Institute of Information Management, Technology, and Policy Tutorial Chairman: Jonathan King, Teknowledge,,Inc. Panel Coordinator: Arun Sen, Univ. of South Carolina","Conference Coordinator: Cathie L. Huges, IIMTP (803) 777-5766 CONFERENCE OBJECTIVES: The goal of this conference is to explore both the theoretical and practical issues of Expert Database Systems. These systems represent the"]},{"title":"confluence","paragraphs":["of R&D activities in Artificial Intelligence, Logic, and Database Management. Expert Database Systems will play an ever-increasing role in scientific, governmental, and business applications by • providing intelligent knowledge-based access to large shared data bases through novel user interfaces and natural-language question-answering facilities. • endowing database systems with reasoning, planning, and justification capabilities. • creating knowledge-base management bools and techniques to support the creation, manipulation, indexing, and evolution of large knowledge bases, and • integrating AI and QB functional requirements into new hardware and software environments for the specification, prototyping, testing, and debugging of knowledge-based applications.","In order to foster the"]},{"title":"cross fertilization","paragraphs":["of ideas from AI, Logic, and Data Bases, the conference will be composed of tutorial sessions, paper sessions, and panel discussions. TOPICS OF INTEREST","The Program Committee invites original papers (of","approximately 5000 words) addressing (but not limited","to) the following areas: • Theory of Knowledge Bases (including knowledge representation, knowledge models, recursive data models, object-oriented models, knowledge indexing and transformation) • Knowledge Engineering (including acquisition, maintenance, learning, knowledge-directed dtabase specification and design methodologies, case studies) • Knowledge Base Management (including architectures and langauges, constraint and rule management, recta-data management, extensible data dictionaries) • Reasoning on Large Data/Knowledge Bases (including inexact and fuzzy reasoning, non-monotonic reasoning, deductive data bases, logic-based query languages, semantic query optimization, constraint-directed reasoning) • Natural Language Interactions (including question-an-swering, extended responses, cooperative behavior, explanation and justification) • Intelligent Database Interfaces (including expert system - database communication, knowledge gateways, knowledgeable user agents, browsers, videotex) • Knowledge-Based Environments (including Decision Support Systems, CAD/CAM, VLSI design) • Organizational Issues (including technology transfer, procurement of expert database sysems, knowledge administration, knowledge certification) PAPER SUBMISSION Please send five (5) copies of papers by September 12, 1985 to Larry Kerschberg, Program Chairman College of Business Administration University of South Carolina Colubmia, SC 29208 Conference proceedings will be available at the conference and subsequently will appear in book form. IMPORTANT DATES Submission Deadline Acceptance Notification Final Version Due Conference 12 September 1985 25 November 1985 10 January 1986 1-4 April 1986 42 Computational Linguistics, Volume 11, Number 1, January-March 1985 The FINITE STRING Newsletter Calls for Papers","EIGHTH EUROPEAN MEETING ON CYBERNETICS AND SYSTEMS RESEARCH 1-4 April 1986 University of Vienna, Austria Organized by Austrian Society for Cybernetic Studies PLENARY LECTURES AND SYMPOSIA ON • General System Methodology • Cross-Disciplinary and Empirical Refinement of Isomorphies • Designing and Systems • Humanity, Architecture, and Conceptualisation • Cybernetics in Biology and Medicine • Cybernetics of Socio-economic Systems • Computers in Health Care • Fuzzy Sets - Meeting of the EURO Working Group • Systems Engineering for Design Automation • Communication, Computers, and Networking • Methodological Improvements and New Applications","of Expert Systems • Knowledge-Based Natural Language Processing In conjunction with this conference, a SPECIAL MEETING will be held on • Future and Impacts of Artificial Intelligence PAPER SUBMISSION Send three copies of the full paper (up to eight A4 pages, single-spaced), in English Submissions should include the selected symposium or special meeting Papers must be received not later than 1 October 1985. SUBMISSIONS~ENQUIRIES should be sent to the Chairman: Robert Trappl Department of Medical Cybernetics and Artificial Intelligence University of Vienna Freyung 6/2 A- 1010 Vienna AUSTRIA","CANADIAN ARTIFICIAL INTELLIGENCE CONFERENCE (CSCSI-86) 21-23 May 1986 Montreal, Canada Sponsored by Canadian Society for Computational","Studies of Intelligence The Sixth National Conference of the CSCSI invites submission of theoretical and applied research papers in all areas of Artificial Intelligence research, particularly: • Knowledge Representation • Computer Vision • Natural Language Understanding • Expert Systems and Applications • Logic Programming and Formal Reasoning • Robotics • Planning, Problem Solving and Learning • Cognitive Science • Social Aspects of AI • AI Architecture, Languages and Tools","All submissions will be fully refereed by the program committee. Authors are requested to prepare full papers of no more than 5000 words in length and specify in which area they wish their papers reviewed. All papers should contain concise clear descriptions of significant contributions to Artificial Intelligence research with proper references to the relevant literature. Figures and illustrations should be professionally drawn.","Three copies of each submitted paper must be in the hands of the Program Chairman by December 31, 1985. Electronic submissions are unfortunately not acceptable. All accepted papers will be published in the conference proceedings.","Correspondence should be addressed to either the General Chair or the Program Chair, as appropriate.","GENERAL CHAIR Renato De Mori Department of Computer Science Concordia University Montreal, P.Q. H3G 1M8 CANADA","PROGRAM CHAIR Bill Havens Department of Computer Science University of British Columbia Vancouver, B.C. V6T lW5 CANADA Network Address: havens@ubc.CSNET COLING 86","THE Xlth INTERNATIONAL CONFERENCE ON COMPUTATIONAL LINGUISTICS 25-29 August 1986 University of Bonn (West Germany)","NATIONAL ORGANIZING COMMIT rEE Istvfin S Bfitofi, Koblenz Peter Hoschka, Bonn Jtirgen Krause, Regensburg Rainer Kuhlen, Konstanz Winfried Lenders, Bonn Christian Rohrer, Stuttgart Helmut Schnelle, Bochum (Chairman) Wolfgang Wahlster, Saarbriicken TOPICS: computational linguistics in general, syntax, parsing, language generation, semantics, phonological and morphosyntactical analysis, speech analysis and synthesis, discourse analysis, machine translation, machine-aided translation, representation of knowledge, computational models of understanding, linguistic theoriesand computational models, software tools and programming languages for computational linguistics, hardware for natural language processing, dictionaries, lexical data bases.","Authors wishing to present a contribution should submit five copies of draft of their paper (maximum Computational Linguistics, Volume I 1, Number 1, January-March 1985 43 The FINITE STRING Newsletter Programs 8000 words), double-spaced, by 1 December 1985, to the Chairman of the Program Committee: Prof. Makoto Nagao (Kyoto) Dept. of Electrical Engineering Kyoto University Sakyo-ku, Kyoto, 606, Japan","The Program Committee will respond before 15 March","1986. The complete text of the revised papers in camera-","ready form should be sent before 1 May 1986 to Winfried Lenders Institut for Kommunikationsforschung und Phonetik","der Universit~it Bonn Poppelsdorfer Allee 47 D-5300 Bonn 1 PROGRAMS ACL EUROPEAN CHAPTER: SECOND CONFERENCE 28 MARCH 1985 MORNING Opening Session: Invited Speaker Kornai - Natural languages and the Chomsky hierarchy Hess -","How does Natural Language Quantify Stifling - Distributives, quantifiers, and a multiplicity of","events Slocum and Bennett - An evaluation of METAL Root -","A two-way approach to structural transfer in MT Boitet et al. - Various representations of texts for EURO-","TRA A FTER NOON Descles - Predication and topicalisation: a formal study in","the framework of applicative languages Bainbridge - Montagovian definite clause grammar Des Tombe et al. - Specification of time in natural","language Fum - Natural language processing and the automatic","acquisition of language Wilks - Right attachment and preference semantics Dunin- Keplica - How to restrict ambiguity of discourse Haugeneder - An ATN treatment of WH-movement Popowich - SAUMER: Sentence analysis using METArules Ramsay -","A self improving parser for generalised phrase","structure grammars Lehtola - A language based environment for natural","language parsing","Bestougeff, Ligozat - Parametrised abstract objects for linguistic information processing","Salton -","On the representation of query term relations by soft Boolean operators 29 MARCH MORNING Altman - The resolution of local syntactic ambuiguity by","the human sentence processing mechanism Pulman -","A parser that doesn't Delmonte -","Parsing difficulties and phonological processing","in Italian Izumida et al. - A natural language interface using a world","model Berry-Rogghe - Interpreting singular definite descriptions","in database queries Bree, Smit - Non-standard uses of if Wehrli - Design and implementation of a lexical data base Maistros, Kotsanis - Lexifamis: A lexical analyser of","modern Greek Beale - Grammatical analysis by computer of the","Lancaster-Oslo/Bergen corpus Fimbel et al. - Using a text model for analysis and gener-","ation Gillott - The simulation of stress patterns in synthetic","speech - a two level problem Johnston, Altman - Automatic speech recognition: a","framework for research .4 FTER NOON Garside - A probabflistic parser Boguraev, Briscoe - Toward a dictionary support environ-","ment for real time parsing Koktova - Towards a new type of morphemic analysis Fum et al. - A rule based approach to evaluating impor-","tance in descriptive texts Patten -","A problem solving approach to generating text","from systematic grammar Parisi, Giorgi - GEMS: a model of sentence production McDonald, Pustejovskh - SAMSON: A computational","theory of prose style in generation Tait -","An English generator for a case-labelled dependency","representation Muraki et al. - Augmented dependency grammar Hajicova, Sgall - Towards an automatic identification of","topic and focus Mofik - User modelling, dialog structure, and dialog strut-","egy in HAM-ANS Narin'Yani, Simonova - Communicative context of","dialogue interaction 44 Computational Linguistics, Volume 11, Number I, January-March 1985"]}]}