{"sections":[{"title":"The","paragraphs":["FINITE STRING Newsletter Minutes of the 1985 ACL Meeting Position Papers Position papers are informal notes with new ideas, stimulating criticism, or speculations on future directions. They will form the basis of discussion sessions. Position papers will be collected in a separate volume and made available to participants of the conference. DEADLINE FOR POSITION PAPERS: 1 MARCH 1986 All submissions should be sent to the programme chairman. Further inquiries about registration or other matters may be obtained from the general chairman. COGNITIVE SCIENCE Eighth Annual Conference of the Cognitive Science Society 15-17 August 1986, University of Massachusetts, Amherst","Conference Chairman Charles Clifton Department of Psychology University of Massachusetts Amherst, MA 01003 This conference will feature invited addresses and symposia in three focal areas: • Neuroscience and Cognitive Science • Formal Analyses of Language • Intelligent Systems Major addresses will be delivered by Bruce Buchanan, Stanford University; Barbara Gross, SRI International; and Vernon Mountcastle, Johns Hopkins University. A Presidential Address will be delivered by Zenon Pylyshyn, University of Western Ontario. The conference will also offer workshops on a variety of topics.","The conference schedule will include paper sessions and a poster session, covering the full range of the cognitive sciences. Cognitive scientists are invited to submit papers or posters on substantial, original, previously unreported research. All papers and posters will be reviewed by experts in appropriate topic areas. Acceptance will be based on originality and significance of the reported research, as well as on the quality of its presentation. Papers and posters will be published by Lawrence Erlbaum Associates in a Conference Proceedings.","Full information about accommodation, travel arrangements, registration, etc. will be made available in January 1986.","Submissions should be sent to the Conference Chairman, for receipt by 14 March 1986. and must include the following: - Author's name, address, and telephone number - Set of no more than four topic area keywords - Four copies of a short abstract (100-250 words) - Four copies of the full paper (4,000 words maximum)","or poster (2,000 words maximum) - An indication of preference for paper or poster session","DEADLINES Submissions Notification of acceptance Camera-ready copy 14 March 1986 16 May 1986 9 June 1986 MINUTES OF THE 1985 ACL MEETING Following are the minutes of the 23rd Annual Business Meeting of the Association for Computational Linguistics, held 10 July 1985 at the University of Chicago in Chicago, Illinois. Madeleine Bates, ACL President, presided. ACL85 Meeting Report Bill Mann, Program Committee Chair, reported on special features of the program. The Committee was divided into two Panels, one devoted to theory, the other to applications. A deliberate attempt was made to encourage more submissions in the latter category, but they were not forthcoming. Forty of the 61 papers submitted were accepted. A tutorial program was introduced for the first time at a regular ACL meeting (one had been held at the Conference on Applied Natural Language Processing in 1983, and COLING84 had a \"mini-summer school\" during the week preceding that conference). The exhibits program was larger and more extensive than the one at COLING84, with a number of demonstrations from university and industry groups. [NOTE: The final attendance figures show that 363 people registered for the meeting. The 332 page proceedings is available from the ACL office at $15 for members, $20 for nonmembers. The tutorials also proved to be quite successful: 83 attended the Parser tutorial by Jonathan Slocum; 62 were at Prolog by Fernando Pereira; 16 at Speech by Beatrice Oshika and Jared Bernstein; 58 at Interfaces by Norman Sondheimer and Madeleine Bates; and 112 at Unification by Stuart Shieber.] Secretary-Treasurer's Report Don Walker reported that income for the year 1984 exceeded expenditures by almost $50,000 ($178,579 against $129,080), resulting in accumulated assets of $153,927 for the period. Some progress has been made toward setting up cost centers, but it is still not possible to allocate expenses accurately. With that qualification, proceedings sales and conference income help offset losses to the membership account. However, the largest source of income is the distribution of surplus from the National Computer Conference by AFIPS, an amount almost equal to the ACL surplus. Preliminary figures for the first half of 1985 show an even greater surplus, but relatively few expenses have been incurred yet for the year. The total number of personal members at the end of the year was 1355, down slightly from 1983. Institutional membership was up slightly, to 325. A new membership drive under the direction of Alan Biermann 250 Computational Linguistics, Volume 11, Number 4, October-December 1985 The FINITE STRING Newsletter Minutes of 1985 ACL Meeting is in progress, so personal membership is likely to increase substantially. [NOTE: The 1984 Financial Status is summarized at the end of the minutes.]"]},{"title":"Editor's Report: COMPUTATIONAL LINGUISTICS","paragraphs":["James Allen reported that the first three issues of the journal, representing a set of papers on machine translation, were almost ready for the printers. The final issue could be ready before the end of the year. Almost half of the 35 papers submitted between June 1984 and June 1985 were accepted, which is more than the usual one-third rate. He encouraged the organization of special issues focused on particular topics. He also noted that The FINITE STRING was beginning to publish site reports and move notices, and requested that people submit information for those purposes."]},{"title":"Editor's Report: Studies in Natural Language Processing","paragraphs":["Aravind Joshi reported that two volumes are in print, a third in page proof, and three others in various draft stages. Two more are under review and four proposals have been received. Four other proposals have been rejected, although one may be revised and resubmitted. He encouraged additional manuscript submissions. In response to a question from the audience, he said that paperbacks were possible, and that efforts were being made to reduce the prices. [NOTE: Listings of the Cambridge University Press Series volumes are now being provided at the end of each journal issue.]"]},{"title":"Nominating Committee Report","paragraphs":["Ray Perrault presented the following slate of officers on behalf of the Nominating Committee (Perrault, Jane Robinson, and Martha Evens):"]},{"title":"President (1986)","paragraphs":["Ralph Weischedel, Bolt Beranek and Newman Inc.","Vice President (1986) William Mann, USC/Information Sciences Institute"]},{"title":"Secretary-Treasurer","paragraphs":["(1986) Don Walker, Bell Communications Research"]},{"title":"Executive Committee (1986-1988)","paragraphs":["Barbara Grosz, SRI International","Nominating Committee (1986-1988) Madeleine Bates, Bolt Beranek and Newman Inc."]},{"title":"ACL","paragraphs":["Meetings The 1986 Annual Meeting is scheduled for Columbia University, 10-13 June. Alan Biermann will chair the Program Committee; Kathleen McKeown and Cecile Paris are responsible for local arrangements. It will be followed by the Linguistic Society of America's annual Linguistic Institute.","The 1987 Annual Meeting will also be held in conjunction with an LSA Linguistic Institute, this time at Stanford University. The dates are set for 6-10 July."]},{"title":"European Chapter","paragraphs":["The Second Conference of the European Chapter was held 28-29 March 1985 at the University of Geneva in Geneva, Switzerland. There were 221 registrants, including over 100 new members. [NOTE: The Proceedings, which contains 41 papers (276 pages), was published in September and is available for $15 to members and $20 to nonmembers.]","The Third European Chapter Conference will be held in Copenhagen in the spring of 1987."]},{"title":"AFIPS Developments","paragraphs":["Norm Sondheimer, the ACL Representative on the AFIPS Board, noted that although the ACL was the smallest AFIPS constituent society, it was one of the oldest. Reporting on recent developments, he stated that Egils Milberg, a former Deputy Undersecretary of Commerce, had been appointed Executive Director. Active programs in government activities, education, and publications are in progress.","Martha Evens, who represents the ACL on both the Awards and the NCC Program Planning Committee, reminded the audience that two ACL sessions were scheduled at the National Computer Conference, which was to be held in Chicago the following week. She had organized a session on \"Microcomputer Databases that Understand English\"; Kathleen McKeown had arranged one on \"Computer-Text Generation - Communicating in English\". [NOTE: The people and papers presented are listed on pages 46-47 of COMPUTATIONAL LINGUISTICS Volume 11, Number 1, January-March 1985.] Evens invited suggestions for sessions at the 1986 NCC, which will be held in Las Vegas."]},{"title":"Other Business","paragraphs":["Mary Dee Harris, newly appointed to chair the Association for Computers and the Humanities, pointed out the overlapping interests of the ACH and the ACL, suggesting that there should be more effective coordination. She also recommended that the ACL consider holding a meeting in conjunction with the Association for Literary and Linguistic Computing.","Efforts are under way to increase cooperation with the Linguistic Society of America, as the scheduling of meetings for 1986 and 1987 referred to above demonstrates. The ACL is considering co-sponsoring the 1987 Linguistic Institute.","Recognizing the imminence of the ACL 25th Anniversary in 1987, plans are being made to reflect on its history.","Robin Cohen announced that she plans to conduct a survey of course contents in computational linguistics. It will be reported in a future issue of the journal.","Klaus Obermeier reported the establishment of a Clearinghouse on Natural Language Processing Systems and Intelligent User Interfaces at Battelle Columbus Laboratories. He offered to send a questionnaire to Computational Linguistics, Volume 11, Number 4, October-December 1985 251 The FINITE STRING Newsletter Announcements anyone who wished to participate. [See COMPUTATIONAL LINGUISTICS, Volume 11, Numbers 2-3, April-September 1985, page 190, for further information and an address.]","David Weber suggested that some of the ACL surplus might be used to encourage computational studies of languages that would otherwise not be supported by research grants. He was asked to formulate a more specific proposal. Resolutions Committee Report Ralph Weischedel expressed the appreciation of the ACL to the increasingly large number of members who were involved in the affairs of the Association over the past year.","The meeting was adjourned.","DonaM E. Walker Secretary-Treasurer 1984 FINANCIAL STATUS Membership Proceedings COLING MT Workshop AFIPS International Fund Interest TOTALS Difference ASSETS INCOME EXPENSES 32,863 57,677 12,367 1,892 76,551 63,911 1,000 1,806 46,812 1,268 1,284 2,526 7,702 178,579 129,080 + 49,499","1983 1984 104,428 153,927 INCOME Dues Back orders Mail fees Labels Misc 1984 MEMBERSHIP ACCOUNT","EXPENSES","27,380 Services 7,478","1,031 Journal 20,661","3,913 Editorial 3,000","127 Post/Ship 12,164","412 Supplies 7,300","Travel 4,131","Membership Drive 2,280","Bank 453","Misc 210 TOTALS 32,863 57,677 ANNOUNCEMENTS BROADENING THE USE OF THE INTERNATIONAL FUND The International Fund was set up to make ACL memberships and publications available to colleagues who have difficulty in using their national currencies for international transactions. Recently, we have broadened it to allow us to reach people whose current financial situation makes it impossible for them to join the Association. One recent member in this category, a student in India, provides an appropriate model to justify this form of participation. He states that when he is further along in his graduate studies, he will reimburse the International Fund for its support. While there should be no requirement to do that, it is a way of ensuring that access to these sources of information are made widely available. If anyone knows of others in similar situations in any part of the world, please provide the ACL office with names and addresses. And do not hesitate to make contributions directly to the International Fund to enable us to extend this program. SPECIAL ISSUE ON COURSE CONTENT IN CL Robin Cohen is soliciting information for a special issue of Computational Linguistics that will focus on the content of computational linguistics courses. Her interest is in what topics are covered, what references are used, the format chosen for teaching, and the workload assigned. For further information, or for electronic submission of your information: Robin Cohen Computer Science University of Waterlook Waterloo, Ont. N2L 3(31 CANADA rcohen%water@waterloo.csnet or ihnp4!watmath!waterIrcohen Cohen's survey will complement the Directory of Graduate Programs, which was published in 1983. A second edition of that Directory is also in preparation. Formal solicitation of information will begin in January 1986. If you are not an ACL member and wish to be included in the mailing, contact Martha E~ens Computer Science Illinois Institute of Technology 10 West 31st Street Chicago, IL 60616 USA evens@sri-ai.arpa 252 Computational Linguistics, Volume 11, Number 4, October-December 1985"]}]}