{"sections":[{"title":"A MACHINE(-AIDED) TRANSLATION BIBLIOGRAPHY Generally restricted to currently accessible documents written in English, French, or German during the years 1973-1984","paragraphs":["AAT 1984 Fujitsu has 2-way Translator System. AAT Report 66. Advanced American Technology, Inc., Los Angeles, California: 8.","AAT 1984 Hitachi develops English-to-Japanese Translating Machine. AAT Report 66, Advanced American Technology, Inc., Los Angeles, California: 8.","Addis, T.R. 1977 Machine Understanding of Natural Language. International Journal for Man-Machine Studies 9(2): 207-222.","Adorni, G. and Massone, L. 1984 Production of Sentences: A General Algorithm and Case Studies. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","ALPAC 1966 Languages and Machines: Computers in Translation and Linguistics. Report of the Automatic Language Processing Advisory Committee, Division of Behavioral Sciences, National Academy of Sciences. National Research Council Publication 1416, Washington, D.C.","Amano, S. 1982 Machine Translation Project at Toshiba Corporation. Technical note, R & D Center, Information Systems Laboratory, Toshiba Corporation, Kawasaki, Japan.","Ambrosi, A.; Ayotte, R.; Bellert, I.; Dansereau, J.; Kittredge, R.; Poulin, G.; and Stewart, G. 1973 Le syst~me de traduction automatique de l'Universit6 de Montr6al (T.A.U.M.). Meta 18(1-2): 277-289.","Ananiadou, E. and Warwick, S. 1984 An Overview of Post-ALPAC Developments. Presented at the ISSCO Tutorial on Machine Translation, Lugano, Switzerland (2-6 April).","Andreyewski, A. 1981 Translation: Aids, Robots, and Automation. Meta 26(1): 57-66.","Andreyewski, A. 1980 Whither Automation and the Translator. ATA Chronicle 9(2): 3-4.","Arnold, D. and Johnson, R.L. 1984 Robust Processing in Machine Translation. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","Arnold, D. and Johnson, R.L. 1984 Robust Processing in Machine Translation. In: COLING84: 472-475.","Arthern, P.J. 1981 Aids Unlimited: The Scope for Machine Aids in a Large Organization. Machine Aids for Translators: ASL1B Proceedings 33(7-8).","Arthern, P.J. 1979 Machine Translation and Computerized Terminology Systems: A Translator's Viewpoint. In: Snell, B.M., Ed., 1979.","Asakura, S. and Nakano, S. 1974 An Experimental System of Machine Translation by the Programmed Sentence Scan Method. Mere. Chubu Institute of Technology 10A: 73-84.","Ashman, B.D. 1982 Production Systems and Their Application to Machine Translation: Transfer Report. Report no. 82-9, Centre for Computational Linguistics, UMIST.","ACM 1973 Natural Language Translation by Computer Emerges from Government Research Stage. CACM 16(3): 196.","Austin, W.M., Ed. 1967 Papers in Linguistics in Honor of Leon Dostert. Mouton, The Hague.","Bachut, D. and Verastegui, N. 1984 Software Tools for the Environment of a Computer Aided Translation System. In: COLING84: 330-333.","Bar-Hillel, Y. 1971 Some Reflections on the Present Outlook for High-Quality Machine Translation. In: Lehmann, W.P. and Stachowitz, R., Eds., Feasibility Study on Fully Automatic High Quality Translation. Final technical report RADC-TR-71-295, Linguistics Research Center, University of Texas at Austin.","Bar-Hillel, Y. 1960 The Present Status of Automatic Translation of Languages. In: Alt, F.L., Ed., Advances in Computers, Vol. 1. Academic Press, New York: 91-163.","Barnes, A.M.N. 1983 An Investigation into the Syntactic Structures of Abstracts, and the Definition of an \"Interlingua\" for their Translation by Machine. MSc. thesis, Centre for Computational Linguistics, UMIST.","Baudot, Jean et aI. 1981 Un modele de mini-banque de terminologie bilingue. Meta 26(4): 315-331.","Bektaev, K.B.; Kenesbaev, S.K.; and Piotrovskii, R.G. 1973 Discussion of Engineering Linguistics. Joint Publications Research Service, Arlington, Virginia.","Bennett, W.S. 1982 The Linguistic Component of METAL. Working Paper LRC-82-2, Linguistics Research Center, University of Texas, Austin, Texas.","Bennett, W.S., and Slocum, J. 1985 The LRC Machine Translation System. Computational Linguistics 11(2-3): 112-121.","Berg, H.-H. 1973 Uebersicht zur maschinellen Verarbeitung von Texten des \"neueren\" Deutsch. In: Berg, H.-H. and Lenders, W., Eds., Bericht ueber die Arbeiten der Clearingstellen zum aelteren und neueren Deutsch, Institut fuer deutsche Sprache, Abteilung Linguistische Datenverarbeitung, Mannheim: 8-69.","Bertsch, E. 1977 Automatische Lexikographie, Analyse und Uebersetzung: Resume einer Fachtagung (Automatic Lexicography, Analysis, and Translation: Summary of a Symposium). Sprache und Daten verarbeitung 1(1): 74-75.","Bevan, N. 1982 Psychological and Ergonomic Factors in Machine Translation. In: Lawson, V., Ed., 1982: 75-78.","Bevan, N. 1980 Human Factors in the Use of Eurodicautom and Systran. Report on the CETIL workshop for the Commission of Eui'opean Communities, Luxembourg.","Biewer, A.; Feneyrol, C.; Ritzke, J.; and Stegentritt, E. 1985 ASCOF - A Modular Multilevel System for French-German Translation. Computational Linguistics 11 (2-3): 137-154.","Blatt, A. 1983 Nominalanalyse des Englischen im Uebersetzungssystem SUSY. Dokumentation K7, SFB-100-K.","Boitet, C. 1984 Research and Development on MT and Related Techniques at Grenoble University (GETA). 170 Computational Linguistics, Volume 11, Numbers 2-3, April-September 1985 A Machine(-aided) Translation Bibliography Presented at the ISSCO Tutorial on Machine Translation, Lugano, Switzerland (2-6 April).","Boitet, C. 1979 Automatic Production of CF and CS Analyzers using a General Tree-Transducer. Presented at the Second International Colloquium on Machine Translation, Lexicography, and Analysis, Saarbruecken, West Germany (16-17 November).","Boitet, C. 1977 Where Does GETA Stand at the Beginning of 1977? In: Commission of the European Communities 1977: 88-120.","Boitet, C. 1977 Wo steht die GETA Anfang 1977? Dritter Europaeischer Kongress ueber Dokumentationssysteme und -netze, Luxembourg (3-6 Mai 1977). Verlag Dokumentation, Munich.","Boitet, C. 1977 Ou enest le GETA debut 1977? T.A. Informations 18: 3-20.","Boitet, C. 1977 Mechanical Translation and the Problem of Understanding Natural Languages. Table-Ronde IFIP, Toronto (August), and Colloque Franco-Sovietique sur la TA, Moscow (December).","Boitet, C. 1976 Un essai de reponse a quelques questions theoriques et pratiques liees a la traduction automatique: Definition d'un systeme prototype. Doctoral thesis. Universite de Grenoble, France.","Boitet, C. 1976 Methodes semantiques en traduction automatique. T.A. Informations 17(1): 3-42.","Boitet, C. 1976 Problemes actuels en traduction automatique: un essai de reponse. Also in AJCL (2, microfiche 48): 68.","Boitet, C. 1976 Towards an Adaptive and Interactive System in Automatic Translation. In: Zampolli, A., Ed., 1976.","Boitet, C.; Chatelin, P.; and Daun Fraga, P. 1980 Present and Future Paradigms in the Automatized Translation of Natural Languages. In: COLING 80: 430-436.","Boitet, C. and Gerber, R. 1984 Expert Systems and Other New Techiques in MT. In: COLING84:: 468-471.","Boitet, C.; Guillaume, P.; and Quezel-Ambrunaz, M. 1982 Implementation and Conversational Environment of ARIANE-78.4, An Integrated System for Automated Translation and Human Revision. In: COLING82: 19-27.","Boitet, C.; Guillaume, P.; and Quezel-Ambrunaz, M. 1978 Manipulations d'arborescences et parallelisme: le systeme ROBRA. In: COLING78.","Boitet, C. and N. Nedobejkine, N. 1982 Russian-French Machine Translation at Grenoble: A General Software Used for Implementing a Particular Linguistic Strategy. Linguistics.","Boitet, C. and Nedobejkine, N. 1981 Recent Developments in Russian-French Machine Translation at Grenoble. Linguistics 19: 199-271.","Boitet, C. and Nedobejkine, N. 1980 Russian-French at GETA: Outline of the Method and Detailed Example. In: COLING80.","Bonner, M. 1981 Report of the Saarbruecken Colloquium, 2. Internationales Kolloquium \"Maschinelle Uebersetzung, Lexikographie und Analyse\", Saarbruecken (16-17 November 1979). ALLC Bulletin 9(3): 11-12.","Booth, A.D., Ed. 1967 Machine Translation. North Holland, Amsterdam.","Bostad, D.A. 1982 Quality Control Procedures in Modifica-tion of the Air Force Russian-English MT System. In: Lawson, V., Ed., 1982: 129-133.","Bourbeau, L., Ed. 1981 Linguistic Documentation of the Computerised Translation Chain of the TAUM-AVIATION Translation System. TAUM, University of Montreal.","Brinkmann, K.-H. 1980 Terminology Data Banks as a Basis for High-Quality Translation. In COLING80.","Brinkmann, K.-H. 1979 Perspectives d'avenir de la traduction automatique (Future Prospects for Machine Translation). Meta 24(3): 315-325.","Brinkmann, K.-H. 1978 Perspectives of Machine Translation. Nachrichten fuer Dokumentation 29 (3): 104-108.","Brinkmann, K.-H. 1975 The TEAM Program System. Ph!lips Terminology Bulletin 4(2/3): 20-37.","Brinkmann, K.-H. 1974 On the Development and Operation of Terminology Data Banks as a Requirement for Machine-Aided Translation. Nachrichten fuer Dokumentation 25(3): 99-104.","Brinkmann, K.-H. 1974 Terminologists, Lexicographers, and Computers. Philips Terminology Bulletin 3(3/4): 8-9.","Brinkmann, K.-H. 1974 Ueberlegungen zum Aufbau und Betrieb von Terminologie-Datenbanken als Voraussetzung der maschinenunterstuetzten Uebersetzung. Nachrichten fuer Dokumentation 25: 99-105.","Brinkmann, K.-H. and Tanke, E. 1976 The TEAM Program System and International Co-operation in Terminology (Le systeme des programmes TEAM et la cooperation internationale dans le domaine de la terminologie). Presented at the First Infoterm Symposium on International Co-operation in Terminology, Vienna (9-11 April 1975). Infoterm Series, Vol. 3. Munich: 180-192.","Brockhaus, K. 1976 Zum formalen Aufbau einer Grammatik fuer automatische Uebersetzungsverfahren (unter Beruecksichtigung der Programmierung). Presented at the Internationales Kolloquium 'Automatische Lexikographie, Analyse und Uebersetzung', Saarbruecken (23-25 September).","Brown, G.P. 1974 Some Problems in German to English Machine Translation. Master's thesis. Massachusetts Institute of Technology, Cambridge, Massachusetts.","Bruderer, H.E. 1978 Handbuch der maschinellen und maschinenunterstuetzten Sprachuebersetzung: Automatische Uebersetzung natuerlicher Sprachen und mehrsprachige Terminologiedatenbanken. Verlag Dokumentation, Munich.","Bruderer, H.E. 1978 Handbuch des Maschinenunterstutzten Sprachubersetzung. Munchen, New York: 100.","Bruderer, H.E. 1977 Handbook of Machine Translation and Machine-Aided Translation: Automatic Translation of Natural Languages and Multilingual Terminology Data Banks. North-Holland, Amsterdam.","Bruderer, H.E. 1977 The Present State of Machine and Machine-Assisted Translation. In: Commission of the European Communities 1977: 529-556.","Bruderer, H.E. 1977 Automatic Language Processing in Switzerland: A State of the Art Report (Nov. 1976). Sprache und Datenverarbeitung 1 (1): 76-77.","Bruderer, H.E. 1976 A Register of Machine Translation and Machine-Aided Translation Projects. Computers and the Humanities 10(1): 45.","Bruderer, H.E. 1975 Control of an Automatic Translation System in the Computer Centre of Zurich University. ALLC Bulletin 3(3): 197-200.","Bruderer, H.E. 1975 Maschinelle Sprachuebersetzung fuer den Apollo-Sojus-Flug. Neue Zuercher Zeitung 156: 42.","Bruderer, H.E. 1975 The Present State of Machine Translation and Machine-Aided Translation..4LLC Bulletin 3(3): 258-261.","Bruderer, H.E. 1975 Vorfuehrung eines automatischen Uebersetzungsverfahrens im Rechenzentrum der Universitaet Zuerich (Developing an Automatic Translation System at Computational Linguistics, Volume 11, Numbers 2-3, April-September 1985 171 A Machine(-aided) Translation Bibliography the Computing Centre of the University of Zurich). ALLC Bulletin 3: 197-200.","Bruderer, H.E. and Hays, D.G. 1975 LATSEC Shows MT in Zuerich. AJCL (4, microfiche 29): 9","Buchmann, B. 1984 Early History of Machine Translation. Presented at the ISSCO Tutorial on Machine Translation, Lugano, Switzerland (2-6 April).","Buchmann, B.; Warwick, S.; and Shann, P. 1984 Design of a Machine Translation System for a Sublanguage. In: COLING84: 334-337.","Burden, D. 1981 Natural Human Languages Automatically Translated by Computer: The SYSTRAN II System. Computers and People 30 (5-6): 12-15, 24.","Burge, J. 1978 The TARGET Project's Interactive Computerized Multilingual Dictionary. AJCL (June). Also available from the Translation and English Language Center, Carnegie-Mellon University, Pittsburgh.","Bush, C. 1974 Structural Passives and the \"Massive Passive\" Transfer. M.A. thesis. Brigham Young University, Provo, Utah.","Buttelmann, H.W. 1974 Semantic Directed Translation of Context Free Languages. Technical report, Computer and Information Science Research Center, Ohio State University, Columbus, Ohio. Also AJCL microfiche 7: 1-22.","Carbonell, J.G.; Cullingford, R.E.; and Gershman, A.V. 1981 Steps Toward Knowledge-Based Machine Translation. IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI) 3 (4): 376-392.","Carbonell, J.G.; Cullingford, R.E.; and Gershman, A.V. 1978 Towards Knowledge-Based Machine Translation. In: COLING 78. Also available as NTIS Report RR-146.","Case, R. and Berglund, L. 1976 FTD Edit System. Final technical report, January 1974-June 1976, Operating Systems, Inc., Woodland, California.","Chafe, W.L. 1976 Foundations of Machine Translation, Linguistics. AJCL (2, microfiche 46): 8-9.","Chafe s W.L. 1974 An Approach to Verbalization and Translation by Machine. Final report RADC-TR-74-271, Department .of Linguistics, University of California at Berkeley. Also in AJCL (3, microfiche 10): 1-94.","Chaloupka, B. 1976 [excerpt from presentation on] Xonics MT System. AJCL (2, microfiche 46): 37-39.","Chandioux, J. 1976 Leibniz, a Multilingual System. AJCL (2, microfiche 46): 25.","Chandioux, J. 1976 METEO: An Operational System for the Translation of Public Weather Forecasts. AJCL (2, microfiche 46): 27-36.","Chandioux, J. 1976 METEO: un systeme operationnel pour la traduction automatique des bulletins meteorologiques destines au grand public. Meta 21(2): 127-133.","Chandioux, J. and Gueraud, M. 1981 METEO: un systeme a l'epreuve du temps. Meta 26(1): 18-22.","Chauche, J. 1976 Vers un modele algorithmique pour le traitement automatique des langues naturelles. ,4JCL (2, microfiche 48): 25.","Chauche, J. 1975 Les systemes ATEF et CETA. T.,4. lnforma-tions 16(2): 27-38.","Chauche, J. 1975 The ATEF and CETA Systems. AJCL (2, microfiche 17): 21-40.","Chauche, J. 1974 Transducteurs et arborescences: Etude et realisation de systemes appliques aux grammaires transformationnelles. These Docteur Es-Sciences Mathematiques. Universite de Grenoble, France.","Chauche, J.; Guillaume, P.; and Quezel-Ambrunaz, M. 1973 Le systeme ATEF. GETA report G-2600-A. Universite de Grenoble, France.","Chaumier, J.; Mallen, M.C.; and Van Slype, G. 1977 Evaluation du systeme de traduction automatique SYSTRAN. Commission des Communautes Europeenes, Luxembourg.","Chevalier, M.; Dansereau, J.; and Poulin, G. 1978 TAUM-ME-TEO: description du systeme. Groupe TAUM, Universite de Montreal.","Chevalier, M.; Isabelle, P.; Labelle, F.; and Laine, C. 1981 La traductologie appliquee a la traduction automatique. Meta 26(1): 35-47.","Clark, R. 1981 Machine Aids: A Small User's Reaction. Machine Aids for Translators: ASLIB Proceedings 33 (7-8).","COLING84 1984 Proceedings of the Tenth ICCL and the Twenty-second Annual Meeting of the ACL, Stanford University, California.","COLING82 1982 Proceedings of the Ninth ICCL, Prague.","COLING80 1980 Proceedings of the Eighth ICCL, Tokyo.","COLING78 1978 Proceedings of the Seventh 1CCL, Bergen, Norway.","COLING76 1976 Proceedings of the Sixth 1CCL, Ottawa, Canada.","Cochard, J.-L. 1984 Software Background for Machine Translation, Part I. Presented at the ISSCO Tutorial on Machine Translation, Lugano, Switzerland (2-6 April).","Commission of the European Communities. 1982 The EUROTRA Council Decision. Official Journal of the European Communities, no. L 317/21.","Commission of the European Communities. 1978 Overcoming the Language Barrier [Proceedings of the Third European Congress on Information Systems and Networks (Luxembourg, 3-6 May)]. Volume 2. Verlag Dokumentation, Munich.","Commission of .the European Communities. 1977 Overcoming the Language Barrier [Proceedings of the Third European Congress on Information Systems and Networks (Luxembourg, 3-6 May)]. Volume 1. Verlag Dokumentation, Munich.","Commission of the European Communities. 1976 Plan of Action for the Improvement of the Transfer of Information between European Languages. Brussels.","Cordier, M.O. and Moghrabi, C. 1982 An Experiment Towards More Efficient Automatic Translation. Proceedings of ECAI-82, Orsay, France: 228-231.","Couture, B. 1976 La Banque de terminologie au service de l'entreprise. Meta 21(1): 100-109.","Crawford, T.D. 1974 A Review of the Cardiff Machine Translation Project. In: Zampolli, A., Ed., 1974.","Crawford, T.D. 1974 Project BABEL: Machine Translation with English as the Target Language. In: Zampolli, A., Ed., 1974.","Crawford, T.D. 1974 Machine Translation: The Development of BABEL Program. Lettera 8: 54-60.","Culhane, P.T. 1977 Semantics via Machine Translation. Russian Language Journal 31 (108): 35-42.","Daley, D.H. and Vachino, R.F. 1973 The West German Federal Bureau of Languages and Machine-Aided Translation in Germany. Federal Linguist 5(3-4): 14-18.","Dansereau, J. 1978 Traduction automatique et terminologie automatique. Meta 23(2): 132-140.","Dostert, L.E., Ed. 1957 Research in Machine Translation. Georgetown University Press, Washington, D.C. 172 Computational Linguistics, Volume 11, Numbers 2-3, April-September 1985 A Machine(-aided) Translation Bibliography","Du Feu, V.M. 1975 Acta Mathematica Sinica (review). ALLC Bulletin 3(3): 277.","Dubuc, R. and Gregoire, J.-F. 1974 Banque de terminologie et traduction. Babel20(4): 180-184.","Duckitt, P. 1981 Translating and Online. Machine Aids for Translators: ASLIB Proceedings 33(7-8).","Ducrot, J.-M. 1984 TITUS IV System: systeme de traduction automatique et simultanee en quatre langues. In: Taylor, P.J. and Cronin, B., Ed., Information Management Research in Europe: Proceedings of the EURIM 5 Conference (Versailles, 12-14 May 1982). ASLIB, London.","Ducrot, J.-M. 1974 Perspectives et avantages offerts par la traduction automatique des analyses de documents selon la methode \"TITUS\". In: ler Congres national francais sur l'information et la documentation, Communications (Paris): 321-333.","Earp, R. and Cherinka, J. 1978 Getting Started in a Natural Language Translation Project. Journal of Educational Data Processing 15(2): 25-34.","Edmonds, E. 1984 A Software Tool for Implementing Machine Translation. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","Edmundson, H.P., Ed. 1961 Proceedings of the National Symposium on Machine Translation. Prentice-Hall, Englewood Cliffs, New Jersey.","Eggers, H. 1981 Das Lemmatisierungssystem SALEM des Sonderforschungsbereichs 90 \"Elektronische Sprachforschung\" in Saarbruecken. ALLC Bulletin 9(2): 9-15.","Eggers, H. 1980 Maschinelle Uebersetzung, Lexikographie und Analyse. 2 vols. Saarland University, Saarbruecken.","Eggers, H. 1976 Probleme der Identifikationsgrammatik und ihrer Anwendung. Vorabdrucke des Internationalen Kolloquiums \"Automatische Lexikographie, Analyse und Uebersetzung\". Saarbruecken (23-25 September): 24-29.","Elliston, J.S.G. 1979 Computer Aided Translation: A Business Viewpoint. In: Snell, B.M., Ed., 1979: 149-158.","Eman, H. and Clarke, D. 1984 Machine Translation of English into Persion. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","Euvrard, A. and Lecomte, J. 1979 Elaboration d'une chaine de traduetion automatique d'anglais en francais: bilan d'une experience. Report no. 36, Centre de Recherches et d'Applications Linguistiques, Nancy, France.","Faiss, K. 1973 Uebersetzung und Sprachwissenschaft - eine Orientierung. Babel 19(2): 75-86.","Farrington, B. 1984 A Microcomputer Program for checking English/French Translation at Sentence Level. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","Feng, Z.W. 1982 Memoire pour une tentative de traduction multilingue du Chinois en Francais, Anglais, Japonais, Russe et Allemand. In: COLING82.","Francois, P. 1977 La banque de donnees terminologiques EURODICAUTOM de la Commission des Communautes Europeennes: Le resultat d'un travail pluri-disciplinaire. Comptes rendus du Colloque international de terminologie, Terminologies 76, Paris-La Defense (15-18 June 1976). Association francaise de terminologie, Paris.","Freigang, K.-H. and Schmitz, K.-D. 1982 Woerterbucherstellung, Woerterbuchsuche und Flexionsanalyse im Uebersetzungssystem Englisch-Deutsch. Dokumentation KI2, SFB-100-K, Universitaet des Saarlandes, Saarbruecken.","Freigang, K.-H. et al. 1979 Der Stand der Forschung auf dem Gebiet der maschinellen Uebersetzung. Universitaet des Saarlandes, Saarbruecken.","Ganeshsundaram, P.C. 1978 Automatic Translation from English into Hindi Using the PCG-Theory and a Scheme of Pre-Editing. Series: AILA 1978 0124, Foreign Languages Section, Indian Institute of Science, Bangalore.","Garside, R.G. 1984 The Grammatical Tagging of Unrestricted English Text. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","Geens, D. 1981 Machine Translation: Evaluation of the Eurotra Interface Mechanism. Universite Libre de Bruxelles Rapport d'Activites de l'Institut de Phonetique, 15: 67-108.","Gerrard, M. 1976 Regular Use of Machine Translation of Russian at Oak Ridge National Laboratory. AJCL (2, microfiche 46): 53-56.","Gervais A. 1981 Evaluation of the TAUM-AVIATION Machine Translation Pilot System. Secretary of State, Ottawa, Ontario, Canada.","Gibb, D.K. 1976 Interactive Analysis: A Synergistic Approach. AJCL (2, microfiche 48): 45.","Gobeil, F. 1981 La traduction automatique au Canada. L'Actualite terminologique 14(5).","Gobeil, F. 1981 Machine Translation Feasibility Study. Translation Bureau, Ottawa.","Godden, K.S. 1982 Montague Grammar and Machine Translation between Thai and English. Ph.D. dissertation, University of Kansas.","Goetschalckx, J. 1979 Eurodicautom. In: Snell, B.M., Ed., 1979: 71-76.","Goetschalckx, J. 1974 Translation, Terminology, and Documentation in International Organizations. Babel 20 (4): 185-187.","Green, R. 1982 The MT Errors which Cause Most Trouble to Posteditors. In: Lawson, V., Ed., 1982: 101-104.","Greenfield, C.C. and Serain, D. 1977 Machine-Aided Translation: From Terminology Banks to Interactive Translation Systems. Department of Computer Science, Carnegie-Mellon University, Pittsburgh, Pennsylvania, and Institut de Recherche en Informatique et Automatique, Paris, France. Available from EDRS.","Gross, M. 1973 Notes on the Feasibiity of High Quality Mechanical Translation. Final scientific report, Laboratoire D'Automatique Documentaire et Linguistique, University of Paris, France.","Guilbaud, J.-P. 1984 Principles and Results of a German to French MT System at Grenoble University (GETA). Presented at the ISSCO Tutorial on Machine Translation, Lugano, Switzerland (2-6 April).","Guilbaud, J.-P. 1980 Analyse morphologique de l'allemand en vue de la traduction par ordinateur de textes techniques specialises. These de Troisieme Cycle, L'Universite de la Sorbonne nouveUe, Paris.","Halliday, T.C. and Briss, E.A. 1977 The Evaluation and Systems Analysis of the SYSTRAN Machine Translation System. Final technical report RADC-TR-76-399, November 1974-August 1976. Battelle Columbus Laboratories, Ohio. Available as NTIS report AD-A036 070/1GA. Computational Linguistics, Volume 11, Numbers 2-3, April-September 1985 173 A Machine(°aided) Translation Bibliography","Hardt, S.L. 1983 Automated Text Translation and the Organization of Conceptual and Lexical Information. Proceedings of Trends and Applications 1983: Automating Intelligent Behavior--Applications and Frontiers. IEEE, New York: 261-262.","Hauenschild, C.; Huckert, E.; and Maier, R. 1979 SALAT: Machine Translation via Semantic Representation. In: Baeuerie, R.; Egli, U.; and von Stechow, A., Eds., Semantics From Different Points of View. Springer Verlag, Berlin: 324-352.","Hays, D.G. and Mathias, J., Eds. 1976 Summary Proceedings of the FBIS Seminar on Machine Translation. Rosslyn Virginia (8-9 March). AJCL (2, microfiche 46): 1-96.","Henisz-Dostert, B. 1979 A Review of the State of Machine Translation. Available from EDRS.","Henisz-Dostert, B.; Macdonald, R.R.; and Zarechnak, M. 1979 Machine Translation. Mouton, The Hague.","Heriard Dubreuil, S. 1979 Automatic Translation and Computer-Assisted Translation. Inf. and Gestion 107(June-July): 49-54.","Hitachi 1981 Research on Machine Translation in Hitachi Ltd. Technical note, Systems Development Laboratory, Hitachi Ltd., Tama-ku, Kawasaki.","Hoffman, T. 1978 Semantics in Aid of Automatic Translation. In: COLING78.","Hoffman, T. 1976 Semantics in Aid of Automatic Translation. In: COLING76. Also in AJCL (2, microfiche 48): 27.","Huang, X.-M. 1984 Dealing with Conjunction in a Machine Translation Environment. In: COLING84: 243-246.","Huang, X.-M. 1984 The Generation of Chinese Sentences from the Semantic Representation of the Input English Text. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","Huang, X.-M. 1983 Dealing with Conjunctions in a Machine Translation Environment. Proceedings of the ACL European Chapter Meeting, Pisa, Italy.","Hubert, J.; Ibuki, J.; Kume, M.; and Nagao, M. 1983 A System of Japanese-French Automatic Translation for Paper Titles. Presented at the 26th Annual Convention of the Information Processing Society of Japan.","Hundt, M.G. 1982 Working with the Weidner Machine-Aided Translation System. In: Lawson, V., Ed., 1982: 45-51.","Hutchins, W.J. 1984 Elements of Linguistic Methods of Analysis. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","Hutchins, W.J. 1982 The Evolution of Machine Translation Systems. In: Lawson, V., Ed., 1982: 21-37.","Hutchins, W.J. 1979 Linguistic Models in Machine Translation. University of East Anglia Papers in Linguistics 9: 29-52.","Hutchins, W.J. 1978 Progress in Documentation: Machine Translation and Machine-Aided Translation. Journal of Documentation 34(2): 119-159.","Hutton, F.C. 1976 Georgetown University MT System Usage. AJCL (2, microfiche 46): 57.","Ibrahim, M. 1984 A Generalized Computer-assisted Language Translation Model: English to Arabic - Problems and Solutions. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","Iida, H.; Ogura, K.; and Nomura, H. 1984 A Case Analysis Method Cooperating with ATNG and Its Application to Machine Translation. In: COL1NG84: 154-158.","Isabelle, P. 1984 Machine Translation at the TAUM Group. Presented at the ISSCO Tutorial on Machine Translation, Lugano, Switzerland (2-6 April).","Isabelle, P. 1981 Some Views on the Future of the TAUM Group and the TAUM-AVIATION System. TAUM Group, University of Montreal.","Isabelle, P. and Bourbeau, L. 1985 TAUM-AVIATION: Its Technical Features and Some Experimental Results. Computational Linguistics 11 ( 1 ): 18-27.","Isabelle, P.; Bourbeau, L.; Cheval, M.; and Lepage, S. 1978 TAUM-AVIATION: description d'un systeme de traduction automatisee des manuels d'entretien en aeronautique. In: COLING78.","Jelinek, J. and Hawgood, J. 1984 The Automatic Integrated Dictionary Systems. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","Johnson, R.L. 1983 Parsing- an MT Perspective. In: Sparck Jones, K. and Wilks, Y., Eds. Automatic Natural Language Parsing. Ellis Horwood, Ltd., Chichester, Great Britain.","Johnson, R.L. 1980 Contemporary Perspectives in Machine Translation. In: Hanon, S. and Pedersen, V.H., Eds., Human Translation Machine Translation (Noter og Kommentarer 39). Romansk Institut, Odense Universitet: 133-147.","Johnson, R.L. and Rosner, M. A. 1984 Machine Translation and Software Tools. Presented at the ISSCO Tutorial on Machine Translation, Lugano, Switzerland (2-6 April).","Johnson, R.L.; King, M.; and des Tombe, L. 1985 EUROTRA A Multilingual System under Development. Computational Linguistics 11(2-3): 155-183.","Johnson, R.L.; Krauwer, S.; Rosner, M.A.; and Varile, G.B. 1984 The Design of the Kernel Architecture for the EUROTRA Software. COLING84: 226-235.","Jordan, S.R.; Brown, A.F.R.; and Hutton, F.C. 1977 SLC Primer for Russian Translation Users. Computer Sciences Division, Oak Ridge National Laboratory, Oak Ridge, Tennessee.","Jordan, S.R.; Brown, A.F.R.; and Hutton, F.C. 1976 Computerized Russian Translation at ORNL. Proceedings of the ASIS Annual Meeting, San Francisco: 163. Also in AS1S Journal 28(1): 26-33.","JPRS 1977 Machine-Assisted Translation in West Germany. [Translations of articles in German by various authors] NTIS document JPRS-68726.","Kanchanawan, N. 1983 Automatic Translation of English to Thai. Presented at the 31st International Congress of Human Sciences in Asia and North Africa, Tokyo- Kyoto (1 August - 7 September).","Kay, M. 1984 Functional Unification Grammar: A Formalism for Machine Translation. In: COLING84: 75-78.","Kay, M. 1982 Machine Translation. AJCL 8(2): 74-78.","Kay, M. 1980 The Proper Place of Men and Machines in Language and Translation. Technical report CSL-80-11. Xerox Palo Alto Research Center, California.","Kay, M. 1976 The Proper Place of Man and Machines in Translation. AJCL (2, michrofiche 46).","Kay, M. 1973 Automatic Translation of Natural Languages. Daedalus 102(3): 217-230. Reprinted in: Haugen, E. and Bloomfield, M., Eds., Language as a Human Problem. Lutterworth, Guildford: 219-232. 174 Computational Linguistics, Volume 11, Numbers 2-3, April-September 1985 A Machine(-aided) Translation Bibliography","Keil, G.C. 1979 Machine Translation Software. Presented at BCS 79, London (4-6 January).","Kertesz, F. 1974 How to Cope with the Foreign-Language Problems: Experience Gained at a Multidisciplinary Laboratory. AS1S Journal 25 (2): 86-104.","King, M. 1982 EUROTRA: An Attempt to Achieve Multilingual MT. In: Lawson, V., Ed., 1982: 139-147.","King, M. 1981 Design Characteristics of a Machine Translation System. Proceedings of the Seventh IJCAI, Vancouver, B.C., Canada (August): 43-46.","King, M. 1981 EUROTRA - A European System for Machine Translation. Lebende Sprachen 26: 12-14.","King, M. 1981 Semantics and Artificial Intelligence in Machine Translation. In: Sprache und Datenverarbeitung: 5-8.","King, M. and Perschke, S. 1984 EUROTRA. Presented at the ISSCO Tutorial on Machine Translation, Lugano, Switzerland (2-6 April).","King, M. and Perschke, S. 1982 EUROTRA and its Objectives. Multilingua 1 (1): 27-32.","Kirschner, Z. 1982 On a Device in Dictionary Operations in Machine Translation. In: COLING82: 157-160.","Kittredge, R.; Ayotte, R.; Stewart, G.; Dansereau, J.; Poulin, G.; Ambrosi, A.; and Bellert, I. 1973 TAUM 73. Projet de Traduction Automatique de l'Universite de Montreal. Publications internes (January): 1-262.","Kittredge, R.; Bourbeau, L.; and Isabelle, P. 1976 Design and Implementation of an English-French Transfer Grammar. In: COLING76. Also in AJCL 2(microfiche 48): 69.","Knowles, F.E. 1984 Machine-aided Translation and Lexical Strategies. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","Knowles, F.E. 1982 The Pivotal Role of the Various Dictionaries in an MT System. In: Lawson, V., Ed., 1982: 149-162.","Knowles, F.E. 1979 Error Analysis of SYSTRAN Output: A Suggested Criterion for the \"Internal\" Evaluation of Translation Quality and a Possible Corrective for System Design. In: Snell, B.M., Ed., 1979: 109-133.","Knowles, F.E. 1979 Re-emergence of Interest in Machine Translation (MT). Presented at BCS 79, London (4-6 January).","Korovina, T.I. 1978 Multilingual Word-for-Word Translation Using a Display. Cybernetics 14(2): 282-283.","Kraass, K.-H. 1974 Computer sind Dolmetscher der Zukunft. Zeitschrift fuer Phonetik, Sprachwissenschaft und Kommunikationsforschung 27(4): 334-335.","Krauwer, S. and des Tombe, L. 1984 Transfer in a Multilingual MT System. In: COLING84: 464-467.","Krollmann, F. 1981 Computer Aids to Translation. Meta 26(1): 85-94.","Krollmann, F. 1977 Benutzeraspekte beim Umgang mit einer maschinellen Uebersetzungshilfe aus der Sicht eines grossen Sprachendienstes. Dritter Europaeischer Kongress ueber Dokumentationssysteme und -netze, Luxembourg (3-6 May 1977), vol. 1. Munich: 201-214.","Krollmann, F. 1977 User Aspects of an Automatic Aid to Translation as Employed in a Large Translation Service. In: Commission of the European Communities 1977.","Krollmann, F. 1976 Translation Aids. ,4JCL (2, microfiche 48): 58.","Krollmann, F. 1974 Data Processing at the Translator's Service. Babel 20(3): 121-129.","Kulagina, O.S. 1976 History and Present State of Machine Translation. Cybernetics (November-December): 937-944.","Landsbergen, J. 1984 Isomorphic Grammars and Their Use in the Rosetta Translation System. Presented at the ISSCO Tutorial on Machine Translation, Lugano, Switzerland (2-6 April).","Landsbergen, J. 1982 Machine Translation Based on Logically Isomorphic Montague Grammars. In: COLING82: 175-181.","LATSEC 1975 Technical Proposal for Further Development of the SYSTRAN English-French Machine Translation System and Initial Development of the SYSTRAN French-English Translation System. Latsec Incorporated, La Jolla, California.","Laubsch, J.; Roesner, D.; Hanakata, K.; and Lesniewski, A. 1984 Language Generation from Conceptual Structure: Synthesis of German in a Japanese/German MT Project. In: COLING84: 491-494.","Laurian, A.-M. 1984 Machine Translation: What Type of Post-Editing on What Type of Documenlfs for What Type of Users. In: COLING84: 236-238.","Lavorel, B. 1982 Experience in English-French Post-Editing. In: Lawson, V., Ed., 1982: 105-109.","Lawson, V. 1984 A Basic Survey of Practical MT. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","Lawson, V., Ed. 1982 Practical Experience of Machine Translation. [Proceedings of a conference held in London, 5-6 November 1981.] North-Holland, Amsterdam.","Lawson, V 1982 Machine Translation and People. In: Lawson, V., Ed., 1982: 3-9.","Lawson, V. 1981 Introduction: Help from the Computer. Machine Aids for Translators: ASLIB Proceedings 33(7-8): 265-267.","Lawson, V. 1980 Final Report on EEC Study Contract TH-21 (Feasibility Study on the Applicability of the Systran system of Computer-Aided Translation to Patent Texts). Commission of the European Communities, Luxembourg.","Lawson, V. 1979 Tigers and Polar Bears, Or: Translating and the Computer. The Incorporated Linguist 18: 81-85.","Lee, K.-F. 1976 Review of \"Machine Translation\" by S.-C. Loh et al. ,4LLC Bulletin 4(3): 267-268.","Lehmann, W.P. 1978 Machine Translation. Encyclopedia of Computer Science and Technology. Dekker, New York (Vol. 10): 151-164.","Lehmann, W.P.; Bennett, W.S.; Slocum, J.; Smith, H.; Pfluger, S.M.V.; and Eveland, S.A. 1981 The METAL System. Final technical report RADC-TR-80-374, Linguistics Research Center, University of Texas at Austin. Available as NTIS report AO-97896.","Lehmann, W.P. and Stachowitz, R.A. 1974 Development of German-English Machine Translation System. Final report RADC-TR-75-2, Linguistics Research Center, University of Texas at Austin. Available as NTIS report AD-A008-525.","Lehmann, W.P. and Stachowitz, R.A. 1973 Development of German-English Machine Translation System. Final report RADC-TR-73-309, Linguistics Research Center, University of Texas at Austin. Available as NTIS report AD-774-564.","Lehrberger, J. 1982 Automatic Translation and the Concept of Sublanguage. In: Kittredge, R. and Lehrberger, J., Eds., Sublanguage: Studies of Language in Restricted Semantic Domains. De Gruyter, Berlin: 81-106.","Lehrberger, J., Ed. 1981 Possibilites d'extension du systeme TAUM-AVIATION. Groupe TAUM, Universite de Montreal. Computational Linguistics, Volume 11, Numbers 2-3, April-September 1985 175 A Machine(-aided) Translation Bibliography","Lenders, W. 1975 Das Problem d6s Verstehens in der maschinellen Uebersetzung. Abstracts of the Fourth International Congress on Applied Linguistics, Stuttgart (25-30 August): 22.","Leon, M. 1984 Development of English-Spanish Machine Translation. Technical Report, Pan American Health Organization.","Lippmann, E.O. 1980 Human Factors in the Design of Computer Aids for Translators. ,4TA Chronicle 9(6): 5.","Lippmann, E.O. 1977 Computer Aids for the Human Translator. Presented at the Eighth World Congress of FIT, Montreal.","Lippmann, E.O. 1976 Experimental On-Line Computer Aids for the Human Translator. AJCL (2, microfiche 46): 11-13.","Lippmann, E.O. 1975 On-Line Generation of Terminological Digests in Language Translation: An Aid in Terminology Processing. IEEE Transactions on Professional Communications 18(4): 309-319.","Lippmann, E.O. 1974 On Computational Linguistics and Computer-Aided Translation. ATA Chronicle 3(5): 7-8.","Liu, S.S. 1984 Translation of English into Chinese on a Microcomputer. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","Liu, Y.-Q. 1982 Aspects of Chinese Information Processing. Presented at the Conference on International Cooperation in Chinese Bibliographical Automation, Canberra, Australia (29 Aug.-1 Sept.).","Liu, Y.-Q. 1981 The System of Intermediate Constituents in Machine Translation from Foreign Languages into Chinese. Presented at the Conference on Chinese Language Use, The Australian National University (29-30 August).","Liu, Y.-Q. 1980 Machine Translation in China - A Report. ALLC Journal 1 (2): 60-66.","Ljudskanov, A. 1975 Mensch und Maschine als Uebersetzer. Niemeyer, Halle.","Locke, W.N. 1975 Machine Translation. Encyclopedia of Library and Information Science. Marcel Dekker, New York (Vol. 16): 414-444.","Locke, W.N. and Booth, A.D., Eds., 1955 Machine Translation of Languages. Wiley, New York.","Loh, S.-C. 1976 CULT: Chinese University Language Translator. In FBIS Seminar on Machine Translation, AJCL (2, microfiche 46): 46-50.","Loh, S.-C. 1976 Translation of Three Chinese Scientific Texts into English by Computer. ALLC Bulletin 4(2): 104-105.","Loh, S.-C. 1976 Machine Translation: Past, Present, and Future. ALLC Bulletin 4(2): 105-114.","Loh, S.-C. 1975 Final Report on Machine Translation Project. Department of Computer Science, Chinese University of Hong Kong.","Loh, S.-C. 1975 Computer Translation of Chinese Journals. AJCL (3, microfiche 22): 43.","Loh, S.-C. 1975 Computer Translation of Chinese Scientific Journ~ds. ALLC Bulletin 3(3): 258.","Loh, S.-C. and Kong, L. 1984 A New Dictionary Structure for Bi-directional MT System. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","Loh, S.-C. and Kong, L. 1979 An Interactive On-Line Machine Translation System (Chinese into English). In: Snell, B.M., Ed., 1979: 135-148.","Loh, S.-C. and Kong, L. 1977 Automatische Uebersetzung chinesischer wissenschaftlicher Zeitschriften. Dritter Europaeischer Kongress ueber Dokumentationssysteme und Dokumentationsnetze, Luxembourg (3-6 May). Munich (Vol. 1): 563-578.","Loh, S.-C. and Kong, L. 1977 Computer Translation of Chinese Scientific Journals. In Commission of the European Communities 1977: 631-646.","Loh, S.-C.; Kong, L.; and Hung, H.-S. 1978 Machine Translation of Chinese Mathematical Articles. ALLC Bulletin 6(2): 111-120.","Luckhardt, H.-D. 1984 Erste Ueberlegungen zur Verwendung des Sublanguage-Konzepts in SUSY. Multilingua.","Luckhardt, H.-D. 1984 Valenz und Tiefenkasus in der Maschinellen Ubersetzung. Ms., SFB 100/A2, Universitaet des Saarlandes, Saarbruecken.","Luckhardt, H.-D. 1982 SUSY - Capabilities and Range of Application. Multilingua 1-4.","Luckhardt, H.-D. 1980 Weshalb SUSY mehrsprachig ist. LA Neue Folge 3.2, Saarbruecken.","Luckhardt, H.-D.; Maas, H.-D.; and Thiel, M. in press The SUSY-E Machine Translation System.","Luther, D.A.; Montgomery, C.; and Case, R.M. 1977 An",". Interactive Text-Editing System in Support of Russian Translation by Machine. IFIPS National Computer Conference Proceedings. AFIPS Press, Montvale, New Jersey (Vol. 46): 789-790.","Lytinen, S. and Schanck, R.C. 1982 Representation and Translation. Yale AI Project Research Report 234.","Lytle, E.G. 1976 Automatic Language Processing Project. AJCL (2, microfiche 46): 14-23.","Lytle, E.G. and Packard, D. 1974 Junction Grammar as a Base for Automatic Language Processing. Preprint of the 12th Annual Meeting of the ACL, Amherst, Massachusetts (26-27 July).","Lytle, E.G.; Packard, D.; Gibb, D.; Melby, A.K.; and Billings, F.H. 1975 Junction Grammar as a Base for Natural Language Processing. AJCL (3, microfiche 26): 1-73.","Maas, H.-D. 1984 Control and Data Structures in the MT System SUSY-E. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","Maas, H.-D. 1984 The MT System SUSY. Presented at the ISSCO Tutorial on Machine Translation, Lugano, Switzerland (2-6 April).","Maas, H.-D. 1983 Anforderungen an Datenstruktureen in einem Maschinellen Uebersetzungssystem. Zeitschrift fur Sprachwiss. und Kommunikationsforschung 36.","Maas, H.-D. 1983 SUSY I and SUSY II - Verschiedene Analysestrategien in der Maschinellen Uebersetzung. Sprache und Daten verarbeitung 1981.","Maas, H.-D. 1982 Repraesentation und Strategic bei der Automatischen Analyse mit SUSY Sprache und Information Band 4.","Maas, H.-D. 1980 Zur Entwicklung des Uebersetzungssystems SUSY und seiner Einzelen Komponenten. LA Neue Folge 3.1.","Maas, H.-D. 1978 Zum Stand der automatischen Uebersetzung im Sonderforschungsbereich (SFB) 100. Das Uebersetzungssystem SUSY. In: Krallmann, D., Ed., Kolloquium zur Lage der linguistischen Datenverarbeitung. Essen.","Maas, H.-D. 1978 Das Saarbruecker Uebersetzungssystem SUSY, Sprache und Datenverarbeitung 1 (4): 43-62. 176 Computational Linguistics, Volume 11, Numbers 2-3, April-September 1985 A Machine(-aided) Translation Bibliography","Maas, H.-D. 1977 The Saarbruecken Automatic Translation System (SUSY). In Commission of the European Communities 1977: 585-592.","Maas, H.-D. 1977 Das Saarbruecker automatische Uebersetzungssystem SUSY. Dritter Europaeischer Kongress ueber Dokumentationssysteme und -netze, Luxembourg (3-6 May 1977). Munich (Vol. 1): 527-535.","Maas, H.-D. 1977 Die Transformationelle Synthese Deutscher Saetze im Saarbruecker Verfahren der Maschinellen Uebersetzung. LA 25, Saarbruecken.","Maas, H.-D. 1977 Maschinelle Uebersetzung mit dem Saarbruecker System SUSY. Sprache und Datenverarbeitung 1 (2).","Maas, H.-D. 1976 Die Synthesedeutscher Saetze im Rahmen der automatischen Uebersetzung. Vorabdrucke des Internationalen Kolloquiums \"Automatische Lexikographie, Analyse und Uebersetzung\", Saarbruecken (23-25 September): 30-35.","Macdonald, R.R. 1981 A Study of the PAHO Machine Translation System. Report of short-term consultant under Personal Services Contract APO-09435(WU1). Pan American Health Organization, Washington, D.C.","Macdonald, R.R. 1979 The Problem of Machine Translation. In Henisz-Dostert et al. 1979: 89-145.","Macklovitch, E. 1984 Recent Canadian Experience in MT. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","Maegaard, B. 1976 The Recognition of Finite Verbs in French Texts. ALLC Bulletin 4(1): 49-52.","Mankin, R. 1984 How to Boldly Split Infinitives. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","Marchuk, Y.N. 1984 Machine Translation in the U.S.S.R. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","Marcus, R.S. and Reintjes, J.F. 1981 A Translating Computer Interface for End-User Operation of Heterogeneous Retrieval Systems, I: Design. ASIS 32(4): 287-303.","Marcus, R.S. and Reintjes, J.F. 1981 A Translating Computer Interface for End-User Operation of Heterogeneous Retrieval Systems, II: Evaluations. ASIS 32(4): 304-317.","Masterman, M. 1982 The Limits of Innovation in Machine Translation. In: Lawson, V., Ed., 1982: 163-186.","Masterman, M. 1979 Essential Mechanism of Machine Translation. Presented at BCS 79, London (4-6 January).","Masterman, M. 1979 The Essential Skills to Be Acquired for Machine Translation. In: Snell, B.M., Ed., 1979: 159-180.","Masterman, M. and Smith, R.J. The Automatic Annotation of SYSTRAN Final Report TH-29, Cambridge Language Research Unit, Cambridge.","Masterman, M. and Williams, B. 1984 The Nature of Proof in Machine Translation. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England ( 13-15 February).","Mathias, J. 1973 Some Computer Functions for Machine-Aided Translation. In: Gould, S., Ed., Proceedings of the First International Symposium on Computers and the Chinese Input~Output Systems, Taipei, Taiwan (14-16 August). Academia Sinica 13: 589-592.","Mathias, J. 1973 The Chinese-English Translation Assistance Group and Its Computerized Glossary Project. Federal Linguist 5(3-4): 7-13.","Mbaeyi, P.N.O. 1984 What is the Language of Memory? Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","McNaught, J. 1981 Terminological Data Banks: A Model for a British Linguistic Data Bank (LDB). Machine Aids for Translators: ASLIB Proceedings 33 (7-8).","Mel'~uk, I.A. 1974 Grammatical Meanings in Interlinguas for Automatic Translation and the Concept of Grammatical Meaning. In: Rozencvejg, V.J., Ed., Machine Translation . . • (Vol. I): 95-113.","Melby, A.K. 1984 Machine Translation with Post-editing vs. a Tri-level Integrated Translator Aid System. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","Melby, A.K. 1984 Recipe for a Translator Work Station. Presented at the ISSCO Tutorial on Machine Translation, Lugano, Switzerland (2-6 April).","Melby, A.K. 1983 Computer-Assisted Translation Systems: The Standard Design and a Multi-Level Design. Proceedings of the ACL-NRL Conference on Applied Natural Language Processing, Santa Monica, California (1-3 February): 174-177.","Melby, A.K. 1982 Multi-level Translation Aids in a Distributed System. In: COLING82: 215-220.","Melby, A.K. 1981 A Suggestion Box Translator Aid. Proceedings of the DLLS Symposium, Brigham Young University, Provo, Utah (March).","Melby, A.K. 1981 Translators and Machines - Can They Co-operate? Meta 26 (l): 23-34.","Melby, A.K. 1981 Linguistics and Machine Translation. In: Copeland, J. and Davis, P., Eds., The Seventh LACUS Forum 1980.Hornbeam Press, Columbia, South Carolina.","Melby, A.K. 1980 Design and Implementation of a Computer-Assisted Translation System. BCS Natural Language Translation Specialist Group, Newsletter 9:7-19.","Melby, A.K. 1976 Junction Grammar and Machine Assisted Translation. In: Zampolli, A., Ed., 1976.","Melby, A.K. 1974 Forming and Testing Syntactic Transfers. M. A. thesis, Brigham Young University, Provo, Utah.","Melby, A.K.; Smith, M.R.; and Peterson, J. 1980 ITS: Interactive Translation System. In: COLING80: 424-429.","Meyer, E. 1976 The Storage and Retrieval of Alpha-Numeric Information. Rechentechnische Datenverarbeitung 13(5): 43-47.","Morton, S.E. 1978 Designing a Multilingual Terminology Bank for United States Translators. AS1S 29(6): 297-303.","Morton, S.E. 1978 Multilingual Terminology Banks Here and Abroad: Online Terminology Dissemination as an Aid to Translation. In Brenner, E.H., Comp., The Information Age in Perspective. Proceedings of the ASIS Annual Meeting (Vol. 15): 242-244.","Muraki, K. 1982 On a Semantic Model for Multi-Lingual Paraphrasing. In: COLING82: 239-244.","Muraki, K. and Ichiyama, S. 1982 An Overview of Machine Translation Project at NEC. Corporation. Technical note, NEC Corporation, C & C Systems Research Laboratories.","Nagao, M. 1983 La Traduction Automatique. La Recherche 150. Computational Linguistics, Volume I 1, Numbers 2-3, April-September 1985 177 A Machine(-aided) Translation Bibliography","Nagao, M. 1983 Natural Language Processing and Machine Translation in Japan. -Digest of Papers: Spring COMPCON 83, Intellectual Leverage for the Information Society. IEEE, New York: 306-307.","Nagao, M. 1982 A Survey of Natural Language Processing and Machine Translation in Japan, 1980-1982. In: Kitagawa, T., Ed., Computer Science and Technologies. North-Holland, Amsterdam: 64-70.","Nagao, M.; Nishida, T.; and Tsujii, J. 1984 Dealing with Incompleteness of Linguistic Knowledge in Language Translation: Transfer and Generation Stage of Mu Machine Translation Project. In: COLING84: 420-427.","Nagao, M. and Tsujii, J. 1980 Some Topics of Language Processing for Machine Translation. Presented at the International Forum on Information and Documentation (Vol. 5, no. 2).","Nagao, M., and Tsujii, J. 1979 A Machine Translation System from English into Japanese for Titles of Scientific Papers. Presented at the Second International Seminar on Machine Translation, Moscow.","Nagao, M. and Tsujii, J. 1979 PLATON (A Programming Language for Tree Operation). Presented at the Second International Seminar on Machine Translation, Moscow.","Nagao, M.; Tsujii, J.; Mitamura, K.; Hirakawa, H.; and Kume, M. 1980 A Machine Translation System from Japanese into English: Another Perspective of MT Systems. In: COL1NG80.","Nagao, M.; Tsujii, J.; and Nakamura, J. 1985 The Japanese Government Project for Machine Translation. Computational Linguistics 11(2-3): 91-110.","Nagao, M.; Tsujii, J.; Yada, K.; and Kakimoto, J. 1982 An English Japanese Machine Translation System of the Titles of Scientific and Engineering Papers. In: COLING82: 245-252.","Nakamura, J.-I. and Nagao, M. 1984 A Software System for Describing a Grammar of Machine Translation: GRADE. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","Nakamura, J.; Tsujii, J.; and Nagao, M. 1984 Grammar Writing System (GRADE) of Mu-Machine Translation Project and its Characteristics. In: COLING84: 338-343.","Nancarrow, P.H. 1978 The Chinese University Language Translator (CULT) - A Report. ALLC Bulletin 6(2): 121.","Nedobejkine, N. 1976 Application du systeme A.T.E.F. a l'analyse morphologique de textes russes. In: Zampolli, A., Ed., 1976 (Vol. 2).","Nedobejkine, N. 1976 Niveaux d'interpretation dans une traduction multilingue: Application a l'analyse du russe. In: COLING76. Also in AJCL (2, microfiche 48): 36.","Newmark, P. 1981 Approaches to Translation. Pergamon, Oxford.","Nikolova, B. and Nenova, I. 1982 Termservice - An Automated System for Terminology Services. In: COLING82: 265-269.","Nishida, F.; Kiyono, M.; and Doshita, S. 1981 An English-Japanese Machine Translation System Based on Formal Semantics of Natural Languages. Technical Report, Tokyo University.","Nishida, F. and Takamatsu, S. 1982 Japanese-English Translation Through Internal Expressions. In: COLING82: 271-276.","Nishida, F.; Takamatsu, S.; and Kuroki, H. 1980 English-Japanese Translation through Case-Structure Conversion. In: COLING80: 447-454.","Nishida, T. 1983 Studies on the Application of Formal Semantics to English-Japanese Machine Translation. Ph.D. Dissertation, Department of Information Science, Faculty of Engineering, Kyoto University, Japan.","Nishida, T. and Doshita, S. 1983 An Application of Montague Grammar to English-Japanese Machine Translation. Proceedings of the ACL-NRL Conference on Applied Natural Language Processing, Santa Monica, California (February): 156-165.","Nishida, T. and Doshita, S. 1982 An English-Japanese Machine Translation System Based on Formal Semantics of Natural Language. In: COLING82: 277-282.","Nitta, Y.; Okajima, A.; Yamano, F.; and Ishihara, K. 1982 A Heuristic Approach to English-Into-Japanese Machine Translation. In: COLING82: 283-288.","Nitta, Y.; Okajima, A.; Kaji, H.; Hidano, Y.; and Ishihara, K. 1984 A Proper Treatment of Syntax and Semantics in Machine Translation. In: COLING84: 159-166.","Noel, J. 1975 Document Analysis Algorithms and Machine Translation Research. Revue des Langues Vivantes 41(3): 237-260.","Nomura, H. 1983 Towards ttie High Ability Machine Translation. Presented at the EUROTRA Joint Japanese-European Workshop, Brussels (November).","Nomura, H.; Iida, H.; and Ogura, K. 1981 Identification Method of Presupposed Items for References. Technical note, Musashino Electric Communication Laboratory. November 1981.","Nomura, H., and Shimazu, A. 1982 Machine Translation in Japan. Technical note, Nippon Telegraph and Telephone Public Corporation, Musashino Electrical Communication Laboratory, Tokyo.","Nomura, H.; Shimazu, A.; Iida, H.; Katagiri, Y.; Saito, Y.; Naito, S.; Ogura, K.; Yokoo, A.; and Mikami, M. 1982 Introduction to LUTE (Language Understander, Translator & Editor). Technical note, Musashino Electrical Communication Laboratory, Research Division, Nippon Telegraph and Telephone Public Corporation, Tokyo.","Oh, Y.-O. 1979 Maschinelle Uebersetzung der Sprachen Koreanisch und Deutsch: Syntaktische Basis fuer die kontrastive Linguistik. Dhak Yonku (Language Research) 15: 169-183.","Oubine, I.I. and Tikhomirov, B.D. 1982 Machine Translation Systems and Computer Dictionaries in the Information Service: Ways of Their Development and Operation. In: COLING82: 289-294.","Panevova, J. and Sgall, P. 1973 Review of P. Garvin, \"On Machine Translation: Selected Papers\". The Prague Bulletin of Mathematical Linguistics 19: 59-64.","Pankowicz, Z.L. 1978 Facts of Life in Assessment of Machine Translation. Report on CETIL Workshop on Evaluation Problems in Machine Translation, Luxembourg (28 February).","Pankowicz, Z.L. 1976 Commentary on ALPAC Report. RADC.","Pare, M. 1980 Y-a-t-il toujours une machine a traduire? Babel 26(2): 77-82.","Pare, M. 1977 La banque de terminologie de l'Universite de Montreal. Comptes rendus du Colloque international de terminologie, Terminologies 76, Paris-La Defense (15-18 June). Association francaise de terminologie, Paris. 178 Computational Linguistics, Volume 11, Numbers 2-3, April-September 1985 A Machine(-aided) Translation Bibliography","Pare, M. 1976 Les banques automatisees de terminologies multilingues et les organismes de normalisation. First Infoterm Symposium on International Cooperation in Terminology, Vienna (9-11 April 1975). Munich (Infoterm Series, Vol. 3): 224-234.","Pare, M. 1975 Computerized Multilingual Word Banks Can Provide Terminological Assistance to International Stand-ards Organization. Presented at the Symposium on International Cooperation in Terminology, Vienna (9-11 April).","Pare, M. 1974 La banque de terminologie de l'Universite de Montreal. Etudes francaises dans le monde 2(3): 9.","Pericliev, V. 1984 Handling Syntactical Ambiguity in Machine Translation. In: COLING84: 521-524.","Perschke, S.; Fassone, G.; Geoffrion, C.; Kolar, W.; and Fangmeyer, H. 1974 The SLC-II System Language Translator Package Concepts and Facilities. Commission of the European Communities, Luxembourg, 1974. Bericht EUR 5116e, Joint Nuclear Research Centre, Scientific Data Processing Centre, CETIS, Ispra, Italy.","Perschke, S. et al. 1974 Les travaux du CETIS dans le domaine de l'informatique documentaire. Documentaliste (numero special): 47-57.","Pertsov, N.V. 1973 Automatic Translation Research at Montreal University. Nauchno-Tekh. Inf. 2(1): 36-44.","Perusse, D. 1983 Machine Translation. ATA Chronicle 12(8): 6-8.","Petrick, S.R. 1976 Summary: FBIS Seminar on Machine Translation. AJCL (2, microfiche 46): 72-76.","Pigott, I.M. 1984 The Difficulty of Developing Logical Algorithms for the Machine Translation of Natural Language. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England ( 13-15 February).","Pigott, I.M. 1983 Recent Developments in Practical MT. Presented at the ASLIB Conference, London.","Pigott, I.M. 1982 The Importance of Feedback from Translators in the Development of High-Quality Machine Translation. In: Lawson, V., Ed., 1982: 61-73.","Pigott, I.M. 1980 How does SYSTRAN Translate? Presented to the BCS Natural Language Translation Specialist Group (23 April).","Pigott, I.M. 1979 Theoretical Options and Practical Limita-tions of Using Semantics to Solve Problems of Natural Language Analysis and Machine Translation. In: MacCafferty, M. and Gray, K., Eds., The Analysis of Meaning: Informatics 5. ASLIB, London: 239-268.","Plum, T. 1974 The State of Machine Translation. Translators and Translating: Selected Essays from the American Translators\" Association. State University of New York, Binghamton: 37-42.","Quezel-Ambrunaz, A. and P. Guillaume. 1976 Analyse automatique de textes par un systeme d'etats finis. In: Zampolli, A., Ed., 1976.","Quezel-Ambrunaz, M. 1979 Transfert en ARIANE-78: Le modele TRANSF.","Quezel-Ambrun~z, M. 1978 ARIANE: Systeme interactif pour la traduction automatique multilingue, Version II. Report G.3400.A., Universite de Grenoble, France.","Roberts, A.H. and Zarechnak, M. 1974 Mechanical Translation. In: Sebeok, T.A., Ed., Current Trends in Linguistics, vol. 12: Linguistics and Adjacent Arts and Sciences. Mouton, The Hague (pt. 4): 2825-2868.","Rolling, L.N. 1981 The Second Birth of Machine Translation: a Timely Event for Database Suppliers and Operators. Electronic Publishing Revue 1 (3).","Rolling, L.N. 1980 Automatic Translation Today and Tomorrow: The Computer Is Cheaper Than Human Translation. In: Taylor, P.J., Ed., New Trends in Documentation and Information [Proceedings of the 39th FID Congress]: 333-338.","Rolling, L.N. 1979 The Second Birth of Machine Translation. Presented at the Seventh Cranfield International Conference on Mechanised Information Storage and Retrieval Systems (July).","Rolling, L.N. 1978 The Facts About Automatic Translation. Proceedings of the Sixth Annual CAIS Conference on Information Science, Montreal (10-13 May). Ottawa, Ontario, Canada: 267-269.","Rommel, B. 1984 Language or Information: a New Role for the Translator? Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","Rosenthal, J. 1979 Idiom Recognition for Machine Translation and Information Storage and Retrieval. Ph.D. dissertation, Georgetown University, Washington, D.C.","Rossi, F. 1982 The Impact of Posteditors' Feedback on the Quality of MT. In: Lawson, V., Ed., 1982: 113-117.","Rozencveig, V.J., Ed. 1974 Essays on Lexical Semantics. Skriptor, Stockholm.","Rozencveig, V.J., Ed. 1974 Machine Translation and Applied Linguistics. Athenaeum, Frankfurt am Main.","Ruffino, J.R. 1982 Coping with Machine Translation. In: Lawson, V., Ed., 1982: 57-60.","Sager, J.C. 1982 Types of Translation and Text Forms in the Environment of Machine Translation. In: Lawson, V., Ed., 1982: 11-19.","Sager, J.C. 1981 New Developments in Information Technology for Interlingual Communication. . Machine Aids for Translators: ASLIB Proceedings 33(7-8).","Sager, J.C. 1979 Multilingual Communication: Chairman's Introductory Review of Translation and the Computer. In Snell, B.M., Ed., 1979: 1-25.","Saito, Y. and Nomura, H. 1983 JMACS: Screen Editor for Japanese and English and Programs - A Kernal for Unified Research Environment. Presented at 1CTP, Tokyo.","Sakamoto, Y. 1970 Automatic Language Processing System - Natural Language Dictionary for Machine Translation. Res. Electrotech. Lab. no. 707: 1-132.","Sakamoto, Y.; Satoh, M.; and Ishikawa, T. 1984 Lexicon Features for Japanese Syntactic Analysis in Mu-Project-JE, In: COLING84, 42-46.","Samuelsdorf, P.O. 1977 Relation of Machine Translation to Linguistics Exemplified by an English-German Translation Project. Proceedings of the Third International Conference on Computers in the Humanities, Waterloo, Ontario, Canada (2-5 August).","Sawai,,S.; Fukushima, H.; Sugimoto, M.; and Ukai, N. 1982 Knowledge Representation and Machine Translation. In: COLING82:351-356.","Sawai, S.; Sugimoto, M.; and Ukai, N. 1982 Knowledge Representaion and Machine Translation. Fujitsu Science and Technology Journal 18(1): 117-134.","Schneider, T. 1984 Maschinenuebersetzung. Stand der Kunst 1983. High Tech 1(1). Computational Linguistics, Volume I 1, Numbers 2-3, April-September 1985 179 A Machine(-aided) Translation Bibliography","Schneider, T. 1983 Maschinelle Uebersetzungshilfen. Terminologie, Bulletin no. 43, Commission des Communautes Europeennes, Luxembourg: 15-21.","Schneider, T. 1983 Some Notes on Machine Aids for Translators. Meta 28(4).","Schulz, J. 1977 Eine Terminologiedatenbank fuer Uebersetzer: Abfragemoeglichkeiten im System TEAM. Dritter Europaeischer Kongress ueber Dokumentationssysteme und -netze, Luxembourg (3-6 May). Munich (Vol. 1): 97-140.","Schulz, J. 1976 Automatische Abfrage einer Terminologie-Datenbank. NachrichtenfuerDokumentation 27(2): 62-66.","Schulz, J. 1975 Der Computer hilft dem Uebersetzer: Ein Verfahren zur Abfrage eines auf Magnetband gespeieherten mehrsprachigen Fachwoerterbuchs. Lebende Sprachen 20(4): 99-103.","Schwanke, P.G. 1973 On Machine Translation: A Difference in Postulates. Eco-logos 19(70): 3-7.","Seelbach, D. 1975 Maschinelle Uebersetzung yon Key-Phrases. Computerlinguistik und Dokumentation. Munich: 132-146.","Sereda, S.P. 1982 Practical Experience of Machine Translation. In: Lawson, V., Ed., 1982: 119-123.","Shaak, B. Machine Translation. Comp. Bull 2(16): 24-25.","Shalyapina, Z.M. 1980 Automatic Translation as a Model of the Human Translation Activity. International Forum on Information and Documentation 5(2): 18-23.","Shalyapina, Z.M. 1980 Problems of Formal Representation of Text Structure from the Point of View of Automatic Translation. In: COL1NG80: 174-182.","Shann, P. 1984 AI Approaches to MT. Presented at the ISSCO Tutorial on Machine Translation, Lugano, Switzerland (2-6 April).","Sigurd, B. 1978 Machine Translation: State of the Art. In: Theory and Practice of Translation. Peter Lang, Stockholm: 33-47.","Sinaiko, H. W., and Brislin, R.W. 1973 Evaluating Langauge Translations: Experiments of Three Assessment Methods. Journal of Applied Psychology 57(3): 328-334.","Sinaiko, H.W. and Klare, G.R. 1973 Further Experiments in Language Translation: A Second Evaluation of the Readability of Computer Translations. 1TL 19: 29-52.","Sinaiko, H.W. and Klare, G.R. 1972 Further Experiments in Language Translation: Readability of Computer Translations. ITL 15: 1-29.","Slocum, J. 1985 Machine Translation. Computers and the Humanities 19(2).","Slocum, J. 1985 A Survey of Machine Translation: Its History, Current Status, and Future Prospects. Computational Linguistics 11(1): 1-17.","Slocum, J. 1984 Machine Translation: its History, Current Status, and Future Prospects. In: COLING84: 546-561. Also available as Working Paper LRC-84-3, Linguistics Research Center, University of Texas, Austin.","Slocum, J. 1984 METAL: The LRC Machine Translation System. Presented at the ISSCO Tutorial on Machine Translation, Lugano, Switzerland (2-6 April). Also available as Working Paper LRC-84-2, Linguistics Research Center, University of Texas, Austin.","Slocum, J. 1983 A Status Report on the LRC Machine Translation System. Proceedings of the ACL-NRL Conference on Applied Natural Language Processing, Santa Monica, California (1-3 February): 166-173.","Slocum, J. 1982 The LRC Machine Translation System: An Application of State-of-the-Art Text and Natural Language Processing Techniques. In: COLING82.","Slocum, J. 1981 A Practical Comparison of Parsing Strategies for Machine Translation and Other Natural Language Processing Purposes. Ph.D. dissertation, University of Texas. Available from University Microfilms International, Ann Arbor, Michigan.","Slocum, J. 1981 The METAL Parsing System. Working Paper LRC-81-2, Linguistics Research Center, University of Texas, Austin.","Slocum, J. 1981 A Practical Comparison of Parsing Strategies. Proceedings of the Nineteenth Annual Meeting of the ACL, Stanford University (29 June - 1 July): 1-6.","Slocum, J. 1980 An Experiment in Machine Translation. Proceedings of the Eighteenth Annual Meeting of the ACL, Philadelphia (19-22 June): 163-167.","Slocum, J. and Aristar, A. 1985 The Treatment of Grammatical Categories and Word Order in MT. Presented at the International Workshop on CAT, Saudi Arabian National Center for Science and Technology, Riyadh (16-19 March).","Slocum, J. and Bennett, W.S. 1982 The LRC Machine Translation System: An Application of State-of-the-Art Text and Natural Language Processing Techniques to the Translation of Technical Manuals. Working Paper LRC-82-1, Linguistics Research Center, University of Texas, Austin.","Slocum, J.; Bennett, W.S.; Whiffin, L.; and Norcross, E. 1985 An Evaluation of METAL: the LRC Machine Translation System. Presented at the Second Annual Conference of the European Chapter of the Association for Computational Linguistics, University of Geneva, Switzerland (28-29 March).","Slocum, J. and Whiffila, L. 1985 Machine Translation: View-points from Both Sides. AILA Bulletin.","Smith, J. 1984 Searching Single-word and Multi-word Dictionaries. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","Snell, B.M. 1980 Electronic Translation. ASLIB Proceedings 32(4): 179-186.","Snell, B.M., Ed. 1979 Translating and the Computer. [Proceedings of a seminar held in London (14 November 1978).] North-Holland, Amsterdam.","Somers, H.L. 1983 Investigating the Possibility of a Microprocessor-Based Machine Translation System. Proceedings of the Conference on Applied Natural Language Processing, Santa Monica, California (February): 149-155.","Somers, H.L. 1981 Bede - The CCL/UMIST Machine Translation System: Rule-Writing Formalism (3rd revision). Report no. 81-5, Centre for Computational Linguistics, UMIST.","Somers, H.L. and McNaught, J. 1980 The Translator as a Computer User. The Incorporated Linguist 19: 49-53.","Stachowitz, R.A. 1976 Beyond the Feasibility Study: Lexicographic Progress. In: Zampolli, A., Ed., 1976 (Vol. 1).","Stachowitz, R.A. 1976 Beyond the Feasibility Study: Syntax and Semantics. In: Zampolli, A., Ed., 1976 (Vol. 2).","StachQwitz, R.A. 1973 Voraussetzungen fuer maschinelle Uebersetzung: Probleme, Loesungen, Aussichten. Athenaeum Skripten, Frankfurt am Main.","Stegentritt, E. 1980 Die Komplementanalyse im Saarbruecker Uebersetzungs-system, dargestellt am Franzoesischen. LA Neue Folge 3.2. 180 Computational Linguistics, Volume 11, Numbers 2-3, April-September 1985 A Machine(-aided) Translation Bibliography","Steiff, S. 1979 The Development of the \"Titus\" Four-Language Automatic Translation Method. International Forum on Information and Documentation 4, (May): 20-26.","Stessel, J.P. 1973 Une Methode Practique de Decodage des Messages Meteorologiques. Institut Royal Meteorologique de Belgique, Brussels. Available from NTIS.","Stiegler, A.D. 1981 Machine Aids for Translators: A Review. Machine Aids for Translators: .4SLIB Proceedings 33 (7-8).","Straub, J.R. and Rogers, C.A. 1979 Computer Analysis of Basic English as a First Step in Machine Translation. In: Trappl, R.; Hanika, F.; and Pichler, F.R., Eds., Progress in Cybernetics and Systems Research (Vol. 5): 491-494.","Stutzman, W. J., \"Organizing Knowledge for English-Chinese Translation,\" In: COLING76. Also in AJCL (2, microfiche 48): 28.","Sugita, S. 1973 Mechanical Translation Between English and Japanese. In: Gould, S., Ed., Proceedings of the First International Symposium on Computers and the Chinese Input~Output Systems [Taipei, Taiwan (14-16 August)]. Academia Sinica 13: 555-572.","Tanaka, H.; Ishihara, H.; and Yasukawa, H. 1983 An English-Japanese Machine Translation System using the Active Dictionary. Technical report, Electro-Technical Laboratory, Ibaraki, Japan.","Tanke, E. 1979 Implementing Machine Aids to Translation. In: Snell, B.M., Ed., 1979: 45-70.","Tanke, E. 1975 Electronic Data Processing in the Service of Translators, Terminologists, and Lexicographers. Philips Terminology Bulletin 4(2/3): 3-19.","Tanke, E. 1975 Future Developments - Three Lectures Given at the Seminar on Computer Aids to Human Translation, Eindhoven (25-26 September 1974). Philips Terminology Bulletin 4(2/3): 38-48.","Thiel, M. 1983 Systemarchitektur von SUSY unter benutzerspezifischem Aspekt. Sprache und Datenverarbeitung 1981.","Thouin, B. 1984 Machine Translation, from Designers to Users: Management Problems and Solutions. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","Thouin, B. 1982 The Meteo System. In: Lawson, V., Ed., 1982: 39-44.","Thouin, B. 1979 The Future of Computer Translation. C1PS Revue 3(6): 18-19.","Thouin, B. 1976 Systeme informatique pour la generation morphologique de langues naturelles en etats finis. In: COLING76. Also in AJCL (2, microfiche 48): 56.","Toma, P. 1984 Generations of MT Systems: Historical Review and Perspectives for the Future. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","Toma, P. 1977 SYSTRAN as a Multi-lingual Machine Translation System. In: Commission of the European Communities 1977: 569-581.","Toma, P. 1977 SYSTRAN: A Third-Generation Machine Translation System. Sprache und Datenverarbeitung 1(1): 38-46.","Toma, P. 1976 SYSTRAN In: FBIS on Machine Translation. AJCL (2, microfiche 46): 40-45.","Toma, P. 1976 An Operational Machine Translation System. In: Brislin, R.W., Ed., Translation: Applications and Research. Gardner Press, New York: 247-259.","Toma, P. 1974 Computer Translation: In Its Own Right. Kommunikationsforschung und Phonetik: IKP-Forschungsberichte. Buske, Hamburg (Vol. 40): 155-164.","Toma, P.; Carlson, J.A.; Stoughton, D.R.; and Ryan, J.P. 1973 Machine-Aided Editing. Final Report RADC-TR-73-368, LATSEC, Inc., La Jolla, California.","Toma, P.; Garrett, L.; Kozlik, L.A.; Perwin, D.; and Starr, C. 1974 Some Semantic Considerations in Russian-English Machine Translation. Final Report RADC-TR-74-189, LATSEC, Inc., La Jolla, California. Available as NTIS Report AD-787-67 I.","Toma, P. and Kozlik, L.A. 1973 Rand Corporation Data in SYSTRAN. Final Report RADC-TR-73-262, LATSEC, Inc., La Jolla, California.","Toma, P.; Kozlik, L.A.; and Perwin, D.G. 1974 Optimization of SYSTRAN System. Final Technical Report RADC-TR-73-155-rev, LATSEC, Inc., La Jolla, California. Available as NTIS report AD-777-850.","Tomita, M. 1984 The Design Philosophy of a Personal Machine Translation System. Technical Report CMU-CS-84-142, Department of Computer Science, Carnegie-Mellon University, Pittsburgh, Pennsylvania.","Troike, R.C. 1976 The Future of MT. AJCL (3, microfiche 51): 47-49.","Troike, R.C. 1976 The View from the Center: The Future of MT. The Linguistic Reporter 18(9): 2.","Tsujii, J. 1983 Technical Outlines of Japanese National MT Project. Presented at the Joint Eurotra-Japanese Workshop, Brussels.","Tsujii, J. 1982 The Transfer Phase in an English-Japanese Translation System. In: COLING82: 383-390.","Tsujii, J.; Nakamura, J.; and Nagao, M. 1984 Analysis Grammar of Japanese in the MU-Project: a Procedural Approach to Analysis Grammar. In: COLING84: 267-274.","Tucker, A.B. 1984 A Perspective on Machine Translation: Theory and Practice. C.4CM 27(4).","Tucker, A.B. and Nirenburg, S. 1984 Machine Translation: A Contemporary View..4RIST 19: 129-160.","Tucker, A.B.; Vasconeeilos, M.; and Le6n, M. 1980 PAHO Machine Translation System: Introduction and Users' Manual. Pan American Health Organization, Washington, D.C.","Tucker, A. et al. 1979 Implementation Considerations for Machine Translation. Proceedings of the ACM National Computer Conference.","Uchida, H. and Sugiyama, K. 1984 A Machine Translation System from Japanese into English Based on Conceptual Structure. In: COLING80: 455-462.","Usui, T. 1982 An Experimental Grammar for Translating English to Japanese. Technical Report TR-201, Department of Computer Sciences, University of Texas, Austin.","van Hoof, H. 1973 Machine Translation. International Bibliography of Translation Verlag Dokumentation, Munich: 464-504.","van Slype, G. 1982 Economic Aspects of Machine Translation. In: Lawson, V., Ed., 1982: 79-83.","van Slype, G. 1979 Critical Study of Methods for Evaluating the Quality of Machine Translation. Final report, Commission des Communautes Europeenes, Brussels/Luxembourg.","van Slype, G. 1979 Evaluation by the EEC Commission of the SYSTRAN Automatic Translation System, 1978 Version. International Forum on Information and Documentation 4: 27-35.","van Slype, G. 1979 Evaluation du systeme de traduetion automatique SYSTRAN anglais-francais, version 1978, de la Computational Linguistics, Volume ! 1, Numbers 2-3, April-September 1985 181 A Machine(-aided) Translation Bibliography Commission des communautes Europeennes. Babel 25(3): 157-162.","van Slype, G. 1978 Second Evaluation of the SYSTRAN Automatic Translation System. Final report, Commission des Communautes Europeenes, Luxembourg.","van Slype, G. and Pigott, I. Description du systeme de traduction automatique SYSTRAN de la Commission des Communautes Europeennes. Documentaliste 16(4): 150-159.","Vasconcellos, M. 1984 Machine Translation at the Pan American Health Organization: A Review of Highlights and Insights. Newsletter, BCS Natural Language Translation Specialist Group 14.","Vasconcellos, M. 1983 Management of the Machine Translation Environment. Proceedings of the ASLIB Conference on Translating and the Computer, London.","Vasconcellos, M. 1983 Management of the Machine Translation Environment: Interaction of Functions at the Pan American Health Organization. Pan American Health Organization, Washington, D.C.","Vasconcellos, M. and Le6n, M. 1985 SPANAM and ENGSPAN: Machine Translation at the Pan American Health Organiza-tion (PAHO). Computational Linguistics 11(2-3): 122-136.","Vauquois, B. 1983 Automatic Translation. Proceedings of the Summer School \"The Computer and the Arabic Language\", Rabat: Ch. 9: 8-17.","Vauquois, B. 1981 L'informatique au service de la traduction. Meta 26(1).","Vauquois, B. 1979 Aspects of Mechanical Translation in 1979. Conference for Japan IBM Scientific Program, GETA, Institut de Recherches et Mathematiques Avancees, Universite Scientifique et Medicale de Grenoble.","Vauquois, B. 1978 L'evolution des logiciels et des modeles linguistiques pour la traduction automatisee. T.A. In forma-tions 19.","Vauquois, B. 1976 Automatic Translation - A Survey of Different Approaches. Statistical Methods in Linguistics 1: 127-135.","Vauquois, B. 1976 Les procedes formels de representation des structures profondes. In: Preprints of the International Colloquium \"Automatische Lexikographie, Analyse und Uebersetzung,\" Saarbruecken (23-25 September): 67-69.","Vauquois, B. 1975 La traduction automatique a Grenoble. Dunod, Paris.","Vauquois, B. and Boitet, C. 1985 Automated Translation at Grenoble University. Computational Linguistics 11(1): 28-36.","Verastegui, N. 1982 Etude du parallelisme applique a la traduction automatisee par ordinateur. STAR-PALE: un system paraUele. These de Docteur-Ingenieur, USMG & INPG, Grenoble.","Vernimb, C.O. 1977 The European Network for Scientific, Technical, Economic, and Social Information. Nachrichten fuer Dokumentation 28(1): 11-18.","Wang, W.S.Y. 1976 Chinese-English Machine Translation. AJCL (2, microfiche 46): 24.","Wang, W.S.Y. and Chan, S.W. 1974 Development of Chinese-English Machine Translation System. Final Technical Report RADC-TR-74-22, University of California at Berkeley.","Wang, W.S.Y.; Chan, S.W.; and Robyn, P. 1976 Chinese-English Machine Translation System. Final Technical Report RADC-TR-76-21, Department of Linguistics, University of California at Berkeley.","Wang, W.S.Y.; Chan, S.W.; and T'sou, B.K. 1973 Chinese Linguistics and the Computer. Linguistics 118: 89-117.","Wang, W.S.Y. et al. 1975 Chinese-English Machine Translation System. Final Technical Report RADC-TR-75-109, Department of Linguistics, University of California at Berkeley. Available as NTIS Report AD-A011-715.","Weaver, W. 1955 Translation. Reprinted in: Locke, W.N. and Booth, A.D., Eds., Machine Translation of Languages. Wiley, New York: 15-23.","Weber, H.-J. 1976 Semantische Merkmale zur Identifikation yon Satz- und Textstrukturen. Vorabdrucke des Internationalen Kolloquiums \"Automatische Lexikographie, Analyse und Uebersetzung\", Saarbruecken (23-25 September): 70-79.","Wehrli, E. 1984 Recent Developments in Theoretical Linguistics and Implications for Machine Translation. Presented at the ISSCO Tutorial on Machine Translation, Lugano, Switzerland (2-6 April).","Weissenborn, J. 1976 Zur Strategie der automatischen Analyse des Franzoesischen im Hinblick auf die maschinelle Uebersetzung. Vorabdrucke des Internationalen Kolloquiums \"Automatische Lexikographie, Analyse und Uebersetzung\", Saarbruecken (23-25 September): 80-88.","Wheeler, P.J. 1984 Changes and Improvements to the European Commission's SYSTRAN MT System 1976-1983. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","Wheeler, P.J. 1984 SYSTRAN Presented at the ISSCO Tutorial on Machine Translation, Lugano, Switzerland (2-6 April).","Wheeler, P.J. 1983 The Errant Avocado (Approaches to Ambiguity in SYSTRAN Translation). Newsletter 13, BCS Natural Language Translation Specialist Group.","Whitelock, P.J. and Kilby, K.J. 1983 Linguistic and Computational Techniques in Machine Translation System Design. Final Report submitted to Science and Engineering Research Council/Social Studies Research Council Joint Committee, Contract No. GR/C 01276, Centre for Computational Linguistics, UMIST.","Whitelock, P.J. and Kilby, K.J. 1982 An In-depth Study of Machine Translation Techniques. Interim Report submitted to Science and Engineering Research Council/Social Studies Research Council Joint Committee.","Widmann, R.L. 1975 Trends in Computer Applications to Literature. Computers and the Humanities 9(5): 231-235.","Wilks, Y. 1979 Machine Translation and Artificial Intelligence. In: Snell, B.M., Ed., 1979: 27-43.","Wilks, Y. 1979 Machine Translation and Artificial Intelligence. Presented at BCS 79, London (4-6 January).","Wilks, Y. 1977 Four Generations of Machine Translation Reearch and Prospects for the Future. Presented at the NATO Symposium, Venice, Italy (25 September - 1 October).","Wilks, Y. 1977 Frames for Machine Translation. New Scientist 76: 802-803.","Wilks, Y. 1976 Semantic and World Knowledge in MT. AJCL (2, microfiche 46): 67-69.","Wilks, Y. 1973 An Artificial Intelligence Approach to Machine Translation. In Schank, R.C. and Colby, K.M., Eds., Computer Models of Thought and Language. W.H. Freeman, San Francisco: 114-151.","Wilks, Y. 1973 The Stanford Machine Translation Project. In: Rustin, R., Ed., Natural Language Processing: Courant 182 Computational Linguistics, Volume 11, Numbers 2-3, April-September 1985 A Machine(-aided) Translation Bibliography Computer Science Symposium, no. 8, 20-21 December 1971. Algorithmics Press, New York: 243-290.","Wilks, Y. and LATSEC, Inc. 1978 Comparative Translation Quality Analysis. Final report on contract F 33657-77-C-0695.","Wilss, W. 1977 Uebersetzungswissenschaft: Probleme und Methoden. Klett, Stuttgart.","Witkam, A.P.M. 1984 Distributed Language Translation, Another MT System. Presented at the International Conference on the Methodology and Techniques of Machine Translation, Cranfield Institute of Technology, England (13-15 February).","Witkam, A.P.M. 1983 Distributed Language Translation: Feasibility Study of a Multilingual Facility for Videotex Information Networks. Buro voor Systeem-ontwickkeling, Utrecht, The Netherlands.","Wyckoff, S.K. 1979 Computer-Assisted Translation: Mainframe to Microprocessor. Proceedings of COMPCON 79: AJCL Using Microprocessors - Extending Our Reach. Washing- ALLC ton, D.C. (4-7 September): 472-476. ASIS","Xyzyx Information Corporation 1974 Computer Aided ATA Language Translation System, English to French. Canoga Park, California. Babel","Yang, C,J. 1981 High Level Memory Structures and Text BCS Coherence in Translation. Proceedings of the Seventh ACL IJCAI, Vancouver, B.C., Canada (August) Vol. 1: 47-49. CACM","Yoshida, S. 1984 A Consideration on the Concepts Structure and Language in Relation to Selections of Translation CAIS Equivalents of Verbs in Machine Translation Systems. In: COLING84: 167-169. Daedalus","Young, M.E. 1981 Machine Translation 1964 - May 1981 (Citations from the NTIS Data Base). NTIS report ECAI PB81-806507. EDRS","Young, M.E. 1978 Machine Translation (A Bibliography with Abstracts). NTIS report PS-78/0448/7GA. FBIS","Zachary, W.W. 1980 Translation Databases: Their Content, Use, and Structure. In: Raben, J. and Marks, G., Eds., Data FTD Bases in the Humanities and Social Sciences. North-Holland, Amsterdam: 217-221. GETA","Zachary, W.W. 1979 A Survey of Approaches and Issues in Machine-Aided Translation Systems. Computers and the ICCL Humanities 13(1): 13-28.","Zachary, W.W. 1978 Machine Aids to Translation: A Concise IEEE State-of-the-Art Bibliography. AJCL 3(microfiche 77): 1JCAI 34-40.","Zampolli, A., Ed. 1976 Computational and Mathematical ISSCO Linguistics. (Proceedings of the ICCL, Pisa,. 27 August-1 September 1973). Florence. ITL","Zampolli, A., Ed. 1974 Computational and Mathematical Linguistics [Proceedings of the Third Symposium on the Use JPRS of Computers in Literary and Linguistic Research, Cardiff.]","Zarechnak, M. 1980 Machine Translation: Past, Present, and LRC Future. ATA Chronicle 6(7): 10-12.","Zarechnak, M. 1979 The History of Machine Translation. In: Meta Henisz-Dostert et al., 1979: 1-87. NTIS","Zarechnak, M. 1976 Russian-English System, Georgetown University. In: FBIS Seminar on Machine Translation. ,4JCL RADC (2, microfiche 46): 51-52.","Zingel, H.-J. 1978 Experiences with TITUS II. Int. Classif. UMIST 5(1): 33-37.","Zingel, H.-J. 1975 TITUS, Eine viersprachige Datenbank des VDI ueber Dokumentationen der Chemiefaser, Textil- und Bekleidungsindustrie. Presented at the IBM Seminar Dialogverarbeitung mit Bildschirmen in der Chemiefaser-, Textil- und Bekleidungsindustrie, Sindelfingen (4-6 June).","Zingel, H.-J. 1975 Das TITUS-System--die Fachdatenbank Textil--entstanden durch internationale Kooperation, internationales Analysesystem und automatische Uebersetzung. Bericht von der Tagung der Deutschen Gesellschaft fuer Dokumentation am 1. Oktober, Muenchen.","Zingel, H.-J. 1975 TITUS, Internationale Dokumentation der Textilindustrie und Bekleidungsindustrie. Nachrichten fuer Dokumentation 26(2): 77-78.","Zingel, H.-J. 1974 Computer spricht vier Sprachen: Der Textildokumentation gelingt erstmals automatische Uebersetzung wissenschaftlicher Texte. VD1-Nachrichten 16: 2-6. ABBREVIATIONS, TITLES, AND ACRONYMS American Journal of Computational Linguistics Association for Literary and Linguistic Computing American Society for Information Science American Translators Association, Ossining, New York, USA International Journal of Translation British Computer Society, London, England Association for Computational Linguistics Communications of the Association for Computing Machinery Canadian Association for Information Science, Ottawa, Ontario, Canada Journal of the American Academy of Arts and Sciences European Conference on Artificial Intelligence ERIC Document Reproduction Service, Arlington, Virginia, USA Foreign Broadcast Information Service, Washington, D.C. USAF Foreign Technology Division, Wright Patterson AFB, Ohio, USA Groupe d'Etudes pour la Traduction Automatique, Grenoble, France International Conference on Computational Linguistics [COLING] Institute of Electronics and Electrical Engineers International Joint Conference on Artificial Intelligence Institute for the Study of Semantics and Cognition, Geneva Review of the Institute of Applied Linguistics, Louvain, Belgium Joint Publications Research Service, Washington, D.C. Linguistics Research Center, University of Texas, Austin, Texas, USA Journal des traducteurs (Translators' Journal) National Technical Information Service, Spring-field, Virginia, USA Rome Air Development Center, Griffiss Air Force Base, New York, USA University of Manchester Institute of Science and Technology, U.K. Compiled by Jonathan Slocum Computational Linguistics, Volume 11, Numbers 2-3, April-September 1985 183"]}]}