{"sections":[{"title":"","paragraphs":["Proceedings of PACLIC 19, the 19th Asia-Pacific Conference on Language, Information and Computation "]},{"title":"Repair Structures in Web-based Conversation  Ruowei Yang","paragraphs":["School of Education and Languages The Open University of Hong Kong 30 Good Shepherd Street, Kowloon, Hong Kong rwyang@ouhk.edu.hk ","Abstract The paper attempts to demonstrate how Conversation Analysis (CA) can help us pragmatically to explore the repair organization of human talk-in-interaction via the Web, and reports on a case study of conversational repair structures for Chinese academic discussion through Web. The data collection was based on naturally occurring written interaction on Web-based discussion boards from teacher education courses. Over 4,000 postings containing nearly half million Chinese characters were captured and analysed to assist in understanding how conversational repair sequences possibly structured, in the Web-based discussion setting. Findings suggested that while description of repair structure introduced by Schegloff et al. (1977) is still a fundamental framework applicable to the repair in Web-based conversation, some different features of repair structure from which has been described for ordinary conversation exist. Detailed examination showed that successful repair in Web-based conversation can take the same four possible structures as in ordinary conversation, and efforts at repair sometimes can fail in possible structure of issuing from either self-initiation or other-initiation. Six special features on repair organization in Web-based conversation have been identified. The research provided fresh data differently from CA traditional source of data for analysis of how repair is sequentially organized in conversation taking place in Web.  1. Introduction The language used in Computer Mediated Communication (CMC) is similar in nature to both spoken and written language (e.g. DuBartell, 1995; Yates, 1996, Crystal, 2001). Some writers have even called such language use ‘written speech’ (Elmer-Dewitt, 1994) or ‘writing talking’ (Davis and Brewer, 1997). Because conversation through Webs as one kind of CMC has created huge amounts of text in modern society, and has attracted great attention and interest, Web-based conversation may be viewed from the perspective of Conversation Analysis (CA), which involves the systematic analysis of the kinds of talk produced in everyday naturally-occurring situations of social interaction. Thus this study is motivated to try to employ CA theories and methodology when dealing with the data from the Web, and explore repair operation in its structure in Web-based conversation.  2. Repair — Schegloff et al.’s (1977) framework The term ‘repair’ is first introduced by Schegloff et al. in an article in 1977, which is regarded as classics in the field of CA. In the article (p. 361), they address issues related to recurring problems in speaking, hearing and understanding, and examine how speakers correct mistakes or errors occurring in conversation. In order for the analysis to have more general applicability, they introduced the term ‘repair’, which covers a wide range of ‘repairable’, not only the correction of mistakes and errors, but also imagined mistakes, misunderstanding, mishearing or non-hearing, self-editing to make the expression more exact and precise. The ‘self-righting mechanism’ (Schegloff et al. 1977, p.381) of repair allows talk-in-interaction to keep itself going in the face of various ‘problems’. The organization of a repair activity is composed of two parts, of which one is most importantly a repair initiation, and the other is a repair outcome. The initiation marks possible disjunctions with the immediately preceding talk, and the outcome includes solutions or abandonment of the problem. Repair structures are characterized by 1) who (self or other) initiates the repair; 2) who (self or other) accomplishes the repair work. ‘Self’ refers to the speaker of the trouble source, and ‘other’ refers to anyone other than the speaker of the problematic utterance. According to Schegloff et al’s. (1977) observation, which has been re-examined by other researchers, successful repair sequences can take four possible structures, viz. self-repair can issue from self-initiation, self-repair can issue from other-initiation, other-repair can issue from self-initiation, other-repair can issue from other-initiation. Schegloff et al. (1977, p.363) also introduced the concept of ‘failure’ in repair. ‘Failure’ refers to cases in which a repair procedure is initiated but does not produce a successful solution. Self- and other-initiation can yield failure which also features in possible structures. The issue for this study is to examine whether the structures described are applicable to conversation taking place in the Web and if there is any difference in repair structures between ordinary conversation and the Web-based conversation.  3. Data collection and analysis This study is based on naturally occurring written interaction on the Web-based discussion boards for two education courses for in-service teachers at the Open University of Hong Kong. The discussion boards are presented in the written form in Chinese. A total of 400 participants, including students, tutors, and the Course Coordinator (CC), took part in the two boards. These participants created more than 4,000 postings containing nearly half million Chinese characters. 351 repair cases have been identified from the main body of the data, which contains 1525 postings of two public groups amongst total seventeen groups in the two boards. The data presented in this paper is in English, which is translated by","Proceedings of PACLIC 19, the 19th Asia-Pacific Conference on Language, Information and Computation  the author, but original Chinese texts are followed to facilitate presentation and proofreading of the data. Some notations used in the transcription assist presenting the data analysis. 1   4. Possible structures for repair in Web-based conversation Four possible structures for successful repair and two possible structures for failure of repair as identified by Schegloff et al. (1977) in ordinary conversation conducted in English have also been found in Web-based conversation in Chinese.  4.1 Self-initiation self-repair Excerpt 1: Data code Date/time Sender Title Content P019 2002/07/23 01:17PM","Ms Chan (S)","Re: (3) Curriculum development ((The screen shows all Chinese characters in an illegible code)) P020 2002/07/23 01:20PM","Ms Chan (S)","Re: (3) Curriculum development","Let me make a response. 讓我來回應。 P021 2002/07/23 01:21PM","Ms Chan (S)","Re: (4) Curriculum development","Let me make a response. ‘Please see attachment’ ((with no attachment)) 讓我來回應。<請看附件 ((並無附件)) P023 2002/07/23 03:09PM","Ms Chan (S)","Re: (5) Curriculum development","Let me make a response. ‘Please see attachment’. ((with an attachment)) 讓我來回應。<請看附件. ((有附件)) In this extract, Ms Chan, a student in the discussion group, responded to the discussion topic ‘Curriculum development’. As her first response (P019) was typed straight on to the Web in Chinese using a special code, the screen showed all the Chinese characters she typed as being illegible when she posted them on the discussion board at 01:17PM, 23 July, 2002. Three minutes later, 01:20PM, Ms Chan sent a second posting saying ‘let me make a response’. This was obviously an attempt to make her response again to repair the trouble source of her prior posting. Then, after one minute, 01:21PM, Ms Chan found that the second response was incomplete, because she should have attached a file. So, she sent a third posting, which added ‘Please see attachment’ (P021). However, as in P020, while the third posting was a repair to prior postings, it also became a trouble source, as there was no file attached, even though the  1 Transcription conventions in this study: (...) data cut-off by transcriptionist (( )) commentary by transcriptionist → points out a phenomenon under scrutiny Underline highlights parts related to the phenomenon under scrutiny Re: original mark in the Web-based discussion board in front of topic line indicated the posting being in","reply. Re: (2) the number in parentheses indicates the position of focusing posting in the sequence for responding (T) posting sent by tutor (S) posting sent by student (CC) posting sent by Course Coordinator    posting said there would be. Late on, at 03:09PM, Ms Chan sent her fourth posting with an attachment, which contained her response with the text could be displayed on screen. The result was that the last repair accomplishment eventually solved the problem in Ms Chan’s prior turns in response to the topic. In Excerpt 1, initiation for repair was all issued by the speaker of the trouble source herself, and the repair was also accomplished by her. This is typical of self-repair issued from self-initiation.  4.2 Other-initiation self-repair Excerpt 2: P2541 2002/05/13 01:05 AM   Mr Wan (T) Re: (5) Problem-solving   (...)The precious aspect of the process of “teaching” and “learning” is to help the students to obtain the key to tackle difficulties (...) (...)\"教\"與\"學\"的過程, 寶貴在於引導學生掌握開啟困難的鑰匙(...) P2550 2002/05/13 10:07 PM   Mr Lau (T) Re: (6) Problem-solving  ","Is there any difference between problem-solving and ((tackle)) difficulties? 「解難」與((開啟))困難」是否有分別呢? P2553 2002/05/13 10:37 PM   Mr Wan (T) Re: (7) Problem-solving ((both are)) Solving the difficulties. ((都是)) 解決困難 In Excerpt 2, Mr Wan used the term ‘tackle difficulties’ (P2541) in his turn instead of the term ‘problem solving’, which was commonly being used by participants in the discussion process. Mr Lau then issued initiation by asking a question involving identifying the difference between the two terms – ‘problem-solving’ and ‘tackle difficulties’ (P2550). Subsequently, the speaker of the trouble source, Mr Wan, accomplished self-repair by clarifying that ‘((both are)) solving problems’ (P2553). This is an example of other-initiation yielding self-repair.  4.3 Self-initiation other-repair Excerpt 3: P2496 2002/05/06 07:13 PM","Ms Lau (S)","Teacher’s role in “Central curriculum” and “School based curriculum” Teacher’s role in “Central curriculum”: 1. To take central curriculum as a blueprint, and adapt it according to individual school’s situation; 2. To make some reflections on central curriculum. ...Do you agree with my points? Do you have any supplementary viewpoint on them? 教師在「中央課程」中所扮演的角色: 1.以中央課程為藍本,因應學校的背景作適當的調適及剪裁; 2.對中央課程作出反思。......你們同意嗎? 或有沒有其他的補 充呢? P2501 2002/05/07 09:08 AM","Mr Tang (CC)   Re: Teacher’s role in “Central curriculum” and “School based curriculum” If we can really reflect on the central curriculum, then the central curriculum would not be the blueprint. If the central curriculum must be the blueprint, it need not be reflected on. 如果可以對中央課程作真正的反思, 那中央課程便有可能不 是藍本了。如果中央課程必然是藍本, 那並沒有反思的需要。 Excerpt 3 is an example of self-initiation other-repair. The other speaker (CC) accomplished a repair in his turn P2501 following an initiation issued by the trouble-source speaker herself, which was shown by two questions asking for confirmation and complementary views.","Proceedings of PACLIC 19, the 19th Asia-Pacific Conference on Language, Information and Computation   4.4 Other-initiation other-repair Excerpt 4: P2403 2002/04/12 12:04 AM Mr Li (S) Re:(12) Where are the teachers heading For?      I totally agree with the notion “cooperation requires everyone’s willingness to give”. The problem is that some teachers still believe they should be off duty after school. Who has the ability to balance this situation? Education Bureau? Headmaster? Or... 我非常贊成「合作要大家都願意付出才可以達成成果的。」但問 題是有些教師還停留在放學就是下班的思想,想問一問誰有能力 去平衡這個現象? 教署?校長?還是.... P2405 2002/04/14 06:46 PM Mr Lau (T) Re:(13) Where are the teachers heading for? I don’t understand what you’re talking about “off duty after school”. Why shouldn’t the teachers be off duty after school? 我不明你所指「放學就是下班的思想」是甚麼意思。放學了為什 麼不可以下班呢 P2407 2002/04/15 12:40 AM Ms Lam (S) Re:(14) Where are the teachers heading for (...)The curriculum reform is school-based. It requires the participation of all teachers in the school in order to succeed. This is where the problem lies! Is everybody willing to spend time and effort to complete this enormous task? Is everybody going in the same direction? Saying “off duty after school” just reveals the key issue (of the reform). (...)教改是校本的,需要全校教師齊心參與、策動,才能成功, 問題就在此!是否人人都願意花心力從事如此艱巨的工作?彼此 方向真的一致嗎?「放學就是下班」這句話說出問題的癥結所在。 In Excerpt 4, repair initiation was issued by Mr Lau (P2405), who had trouble in understanding what Mr Li was talking about in saying ‘some teachers still believe they should be off duty after school’ (P2403). A speaker other than the trouble-source speaker, Ms Lam, provided an explanation as a response (P2407) to Mr Lau. In this case, the initiation and the outcome of repair were both conducted by speakers other than the trouble-source speaker.  4.5 Self-initiation with failure of repair Excerpt 5: P136 2002/08/13 11:28PM Mr Lau (T) Re: The map of treasure hunting in the dark    (...)I have read it ((the map of treasure hunting in the dark)) briefly and I really appreciate your thoughtfulness and understanding of curriculum reform(....)We can use this map as a reference, but we shouldn’t copy it. If we reference it, we’ll acknowledge it. What do all you think? (...)我簡略看了一次,欣賞你的心思,對課改重點的掌握, 下了一番苦功做了這份簡佈表。.(...)簡佈表可作參考,不能 抄考,若引用你的部份影片應列明出處。大家意見如何? P140 2002/08/14 11:02PM Ms Wong (S)   Re: (3) The map of treasure hunting in the dark From what you’ve shared with us, I can say that you have made a lot of effort. I appreciate your knowledge of curriculum. I hope we can continue to share – perhaps this is also the purpose of taking this course! 從你的分享, 可知你下過不少功夫, 亦欣賞你對課程的認識, 希望日後大家可繼續交流, 這也是參加這個課程的意義吧! The above discussion sequence started when a participant in the group offered her self-made ‘map’ which was useful for understanding curriculum reform in Hong Kong. In P136, Mr Lau initiated the repairable item with his own suggestion (‘We can use this map as reference, but   we shouldn’t copy it. If we reference it, we’ll acknowledge it. What do you think?’), but, the other speaker, Ms Wong, in P140 failed to answer the question Mr Lau asked.  4.6 Other-initiation with failure of repair Excerpt 6: P2439 2002/04/21 07:54 AM Ms Wong (S) Re: (2) Project learning We have tried doing projects by grouping students. The project group has to constantly report on progress. The grades given are based on the group dynamics (data collection, synergy, communication), plus peers’ assessment and parents’ assessment. The final product of the project will receive a small portion of the overall result. 曾嘗試以小組形式進行,小組定時匯報其研習過程,而分數比例 重在 分享內容(蒐集能力.協作能力.溝通能力)再加上學生同組互評及家長 自評分,至於最後繳交的結果只佔少部分分數 P2448 2002/04/22 09:24 AM Mr Tang (CC) Re: (3) Project learning   This is a good way ((assessment based on the learning dynamics)) as well. When you are awarding marks to each student (for their performance in the group work) for their sharing, do you give the grade directly to students, or just let students grade each other? 這也是好方法。 你在做分享內容分數時, 是由教師直接評分還是由同學互評呢? P2450 2002/04/22 04:45 PM Ms Wang (S) Re:(4) Project learning Our school has implemented projects for years as well. In the past, the teachers gave the topics to the students and the topics were related to general knowledge subjects mostly (...) 我校也推行「專題研習」多年了,以往是由老師出題目,而題目大多 數是以常識科有關的(...) In Excerpt 6, the Course Coordinator issued an initiation (P2448) to the trouble-source speaker in the previous turn P2439, requesting clarification of the method used for assessing student outcomes in project learning. However, the trouble-source speaker never responded; and another speaker, Ms Wang, who did not clarify the problem raised by the Course Coordinator, offered a failure of repair in her turn (P2450).  5 Special features of repair organization in Web-based conversation Six special features of repair organization in Web-based conversation differ from that in ordinary face-to-face conversation have been found from the data.  5.1 Other-initiation one after another Excerpt 7: P031 2002/07/23 10:16PM Ms Ng (S) Re: (5) Curriculum development    (...)If teachers can add the 3C elements to the class, communicate with students and lead students in “learning to learn”, we can break the traditional classroom constraints. (...)若老師能在課堂灌進 3C 原素,多與學生透過課程溝 通、引導學會學習,亦可打破傳統課堂的柜柜((規矩))。 P034 2002/07/24 01:16AM Mr Lau (T)   Re: (6) Curriculum development    What are 3C elements? 甚麼是 3C 原素? P035 2002/07/24 Mr Sun (S) Re: (7) Curriculum development  ","Creativity, Critical thinking, Communication ((original text produced in English))","Proceedings of PACLIC 19, the 19th Asia-Pacific Conference on Language, Information and Computation  01:45AM P036 2002/07/24 04:41PM Ms Lau (S) Re: (7) Curriculum development    Mr. Lau (tutor), Thanks a lot! I think 3C means Critical thinking, Communication and Creativity. Is that right? ((original text produced in English)) P037 2002/07/24 06:26PM Mr Wan (T) Re: (8) Curriculum development    Very interesting. I’d like to know where 3C comes from? (...) 相當有趣, 我想知道 3C 出自何處? (...) P038 2002/07/24 10:00PM Ms Chan (S) Re: (9) Curriculum development    ","Not only 3C, but 4C, which includes critical thinking, communication, creativity AND COLLABORATION SKILL. This can be found from Learning to Learn – The way forward in curriculum development in the section which mentions the ability – GENERIC SKILLS 不單止 3 個 C <是 4C,包括 Critical thinking, Communication ,Creativity AND COLLABORATION SKILL< 可見於<學會學習----課程發展路向>提及的共同能力– GENERIC SKILLS This segment provides clear evidence — other-initiation can be issued by several speakers one after another. The first initiation (P034) issued by Mr Lau indicate the repairable item in the prior turn P031. After two responses to the question were received, Mr Wan (P037)and Ms Chan (P038) then issued their different initiations one after another.  5.2 Other-repair one after another: An example of this special feature has been seen already in Excerpt 7. After repair initiation issued by Mr Lau (P034) to show his trouble in understanding ‘3C elements’ in the prior turn P031, both Mr Sun and Ms Lau accomplished repair one after another separately. And Ms Chan in her turn P038 also accomplished repair by responding to the two initiations issued in prior turns (P034 and P037) by answering their questions in the same turn.  5.3 Self-initiation in more than one turn In Excerpt 1, after Ms Chan found her responding posting became a trouble source, she started to make efforts to self-initiation self-repair. However, her self-initiation was issued in three turns, P020, P021 and P023 (the term ‘turn’ in this paper is treated as the same as a single posting), not just within one turn, though these initiations were for the trouble source P019 and also for its following postings, P020 and P021.  5.4 Self-repair in more than one turn Excerpt 1 also can be used as an example for self-repair accomplished not only in one turn, but in several turns. Ms Chan accomplished self-initiation, also self-repair in three turns (P020, P021, P023), eventually succeed.  5.5 Repair-initiation with no response 42 repair initiation with no response cases are found from the main body of the data for this   study. These cases displayed that though initiation issued, the repair was not accomplished.  5.6 Duplicate posting – a form of self-repair 34 duplicate posting cases in the two discussion boards have been found. This is another special practice in Web-based conversation for repair which is a form of repeat for self-repair.  6. Conclusion While Web-based conversation shares the same possible structures for repair as those have been described for ordinary conversation in English, some special features of repair organization in Web-based conversation do not, or rarely, appear in face-to-face oral conversation. This study shows that CA is a powerful means for analysing human interactional communication through the Web, and also provides technologists with criteria for developing technology for communication which are based on natural language use.  7. Acknowledgments I am extremely grateful to Dr Peter Martin, who gave me much advice and oversaw the progress of my study. My heartfelt thanks specially go to Professor Ronnie Carr for commenting on an earlier version of the paper. I would also like to record my sincere thanks to friends, colleagues, teachers and students who have been so helpful and accommodating.  8. References Crystal, D. 2001. Language and the Internet. Cambridge: Cambridge University Press. Davis, B H and J.P. Brewer. 1997. Electronic Discourse: Linguistic Individuals in Virtual Space. Albany, NY: State University of New York Press. DuBartell, D. 1995. ‘Discourse Features of Computer-Mediated Communication: “Spoken Like” and “Written Like”’, in B Warvik et al (eds.) Organization in Discourse. Turku: University of Turku, pp.231-41. Elmer-Dewitt, P. 1994. ‘Bards of the Internet’, Time, 4 July, pp.66-7, cited in Crystal, D. 2001. Schegloff, E.A., G. Jefferson and H. Sacks 1977. ‘The Preference for Self-Correction in the Organization of Repair in Conversation’, Language 53 (2), pp. 351-82. Yates, S J (1996) ‘Oral and Written Linguistic Aspects of Computer Conferencing: A Corpus Based Study’. In Herring, S. C. (ed.), Computer-Mediated Communication: Linguistic, Social and Cross-Cultural Perspectives. Amsterdam: Benjamins, pp.29-46. "]}]}