{"sections":[{"title":"","paragraphs":["Proceedings of PACLIC19, the 19th Asia-Pacific Conference on Language, Information and Computation."]},{"title":"Japanese Bare Nouns as Weak Indefinites Keiko Yoshida","paragraphs":["Department of English Language and Literature, School of Education, Waseda University 1-6-1 Nishi-waseda","Shinjuku, Tokyo 182-0011 JAPAN yoshidak@waseda.jp","Abstract Japanese Bare Nouns (JBNs) appear to behave like indefinites in some contexts, and mass nouns in some other contexts. For example, when accomplishment verbs have JBNs as their theme, they are modified by both in-adverbs and for-adverbs. This paper first claims that JBNs are weak indefinites and introduce a variable to be bound by Existential Closure. Second, it shows how telic predicates are derived when accomplishment verbs take JBNs as their theme. Third, we observe that verbs of creation do not appear with for-adverbs when coupled with JBNs, and that an event is considered repeated when accomplishments appear with for-adverbs. Two possible explanations for the facts follow; (i) JBNs are not inherently kinds; (ii) sum-formation is restricted in Japanese. 1. Introduction This paper discusses the behavior of Japanese Bare Nouns (JBNs)","1",". In particular, we focus","on their interpretation when they appear as a theme of accomplishment verbs.","It is well known that in English, VPs headed by an accomplishment verb can be telic or","atelic, depending on the nominal expression the verb takes (Verkyul (1972), Dowty (1979),","Krifka (1998), Rothstein (2004) among others).","(1) a. Bill ate an apple in one minute/*for one minute. b. Bill ate bread *in one minute/for one minute. c. Bill ate apples *in one minute/for one minute. Adverbs of duration, which modify unbounded events, apply to VPs in which a mass noun or a bare plural is in the object position of accomplishments. Adverbs like ‘in one minute’ target bounded events and apply to VPs with indefinites.","Chierchia (1998) points out that JBNs are like English mass nouns. Both appear in the argument position without any determiner nor quantifier; both denote kinds; and both require  1 Japanese does not have a plural marker corresponding to ‘s’ in English. Thus JBNs are different from bare plurals in English. classifiers or measure phrases to count. However, they do not always behave like mass nouns. Fromkin (ed.) (2000) shows that JBNs can be used with both in- and for- adverbs. Consider (2)2",".","","(2) a. Bill-wa ip-pun-de pan/ringo-o tabe-ta.","-Top one-minute-in bread/apple-Acc eat-Past","‘Bill ate bread/apple in one minute.’","b. Bill-wa ip-pun-kan pan/ringo-o tabe-ta. -Top one-minute-for bread/apple-Acc eat-Past ‘Bill ate bread/apple for one minute.’ In (2a), Bill consumed in one minute a certain amount of bread/apples recognized as a unit or a group. (2b) implies that apple/bread-eating activity by Bill took place for one minute. Thus, JBNs seem to have dual roles; they sometimes behave like indefinites and sometimes behave like mass nouns3",". The question to be concerned here is what is semantics of JBNs and how they can appear with two types of adverbs. 2. JBNs as indefinites In section 2, we will first see Chierchia (1998)’s analysis of bare nouns. We will also examine how similar JBNs are to indefinites in English. Considering the fact that JBNs behaves like weak indefinites, we will propose that JBNs introduce a free variable to be bound and discuss how they can appear with ‘ip-pun-de (one-minute-in)’ as in (2a). 2.1. Chierchia (1998)’s semantics of DPs Chierchia (1998) argues that JBNs and English mass nouns denote ‘mass’ properties. Their extension is sets of what could be counted as a minimal portion and their pluralities.  2 Literal translation of JBNs is used in the English translation in the examples throughout the paper. They appear in italics. 3 JBNs can also be interpreted as definites. In English, ‘the’ (, as well as a pronoun,) is used to refer to something already mentioned as in (ia). But JBNs appear as bare, and still refer to things mentioned earlier as in (ib). (i) a. I ate bread/an apple yesterday. The bread/apple was sweet.","b. (Watashi-wa) pan/ringo-o tabe-ta. Pan/Ringo-wa ama-katta.","(I-Top) bread/apple-Acc eat-Past bread/apple-Top sweet-Past As shown in (ii), when ‘the’ is attached, mass nouns occur with in-adverbs (ii) I ate the bread in one minute. It is true that ‘pan’ or ‘ringo’ can be understood as a definite in (2), but when we hear this sentence out of the blue, we would understand that ‘pan’ would be a loaf, a bun, a slice of bread,...a unit of bread familiar to us, and as for ‘ringo’ we take it an ‘an apple’. Also notice that this sentence can be uttered in a situation such as in (iii) where English speakers use ‘a’ but not ‘the’. (iii) I randomly picked up an apple out of many on the table and ate it very fast and bragged; I ate an apple in ten seconds!.","Proceedings of PACLIC19, the 19th Asia-Pacific Conference on Language, Information and Computation. However, the singular/plural distinction is neutralized and what counts as an atom is somewhat vague and may be different from context to context.","We should note that in Chierchia, JBNs and English mass nouns are associated with mass properties in different ways. He proposes that Japanese nouns are inherently kinds and that we get properties corresponding to kinds by the type-shifting operation » , which is defined in (3).","(3) Let d be a kind. Then for any world/situation s,  » d = lx[x<ds], if ds is defined","lx[FALSE], otherwise.","where ds is the plural individual that comprises all of the atomic members of the kind (Chierchia 1998:350) English mass nouns are considered to denote properties inherently; the operation « is applied","to a property, and the corresponding kind is obtained. The operation « is defined in (4)4",".","(4) For any property P and world/situation s,  « P = ls iPs, if ls iPs is in K undefined, otherwise where Ps is the extension of P in s, K is the set of kinds defined in the domain.","(ibid.:351) Let us follow Chierchia for a moment and assume that JBNs start their lives as kinds and become properties by the » operation. How can we explain the indefinite-like behavior of JBNs? Note that Chierchia proposes the following principle.","(5) Blocking Principle (‘Type Shifting as Last Resort’) For any type-shifting operation t and any X, *t (X) if there is a determiner D such that for any set X in its domain, D(X) = t (X). (ibid.:360) This principle forbids a covert operation when there is a determiner that achieves the same effect. Japanese does not have indefinite markers as well as markers for properties. If type-shifting operations freely apply as long as they do not violate (5), generalized quantifiers are obtained in a way as shown in (6)5",".   4 English bare plurals (PL(X)) are assumed to have the set of pluralities as their extension. The operation « applied to a property («","PL(X)) yields the corresponding kind. »«","PL(X) denotes a mass property. 5 As for type shifting operations, Chierchia assumes those proposed in Partee (1987) and his »","and «",".","(6) Kind(k) - » -> Property( » k) - Covert type-shifting ($) -> $»","k = lP$x [ » k(x) Ÿ P(x)]","The type-shifting operation $ applies to properties derived from kinds in (6). It would seem at this point that we have found sources for the indefinite-like behavior","and the mass noun-like behavior of JBNs in (2); namely, $» k and k/","»","k6",". However, there are two sets of data that suggest that they might not be. First, in some environment, JBNs seem to behave like weak indefinites rather than indefinites marked with ‘a’. Second, they do not always appear with adverbs of duration. We will discuss the first problem in 2.2 and the second problem in 3.2. 2.2. JBNs as weak indefinites We have seen that VPs headed by an accomplishment verb are modified by in-adverbs when an indefinite marked with ‘a’ or a JBN is a theme of the verb. Borer (2005) points out that weak indefinites also appear in the relevant construction. (7) Bill ate sm apples in one minute/*for one minute. In fact, JBNs behave more like weak indefinites than ‘a N’s in some environment","7",".","Consider the scope interaction between indefinites and negation. Carlson (1977)","observes that indefinites in the object position may scope outside the domain of negation.","(8) Bill didn’t eat an apple on the table. Neg > an apple on the table an apple on the table >Neg Borer (2005) notes the contrast in (9). (9) a. *Bill ate sm apples and Bill didn’t eat sm apples.","b. Bill ate sóme apples and Bill didn’t eat sóme apples. (Borer 2005:144-145)  6 As stated above, mass nouns denote properties (P), which correspond to kinds («","P). 7 An earlier version of this paper studies the de re/de dicto ambiguity in (i) and (ii) as well as the scope interaction to be discussed. In (i), the indefinite can scope over the domain of the intensional verb. (i) Miles wants to meet a policeman. [both opaque and transparent] (Chierchia 1998:370) Nakanishi and Tomioka (2004) claim that in (ii) the bare noun can scope outside the domain of the intensional verb but that the opaque reading is strongly preferred. (ii) Sono byooin-wa kangohu-o sagasi-tei-ru.","That hospital-Top nurse-Acc look-Prog-Pres","‘That hospital is looking for nurse.’ (Nakanishi and Tomioka 2004:115) However, an anonymous abstract reviewer comments that the position-filling reading is pragmatically invited when ‘the hospital’ is in the subject position. The reviewer observes that the de re reading is easily obtained when the subject is changed to a pragmatically neutral term such as ‘Bill’.","An earlier version of this paper also reports that the de dicto reading is preferred when weak indefinites are in the object position. (iii) Miles wants to meet sm policemen.. However, the judgment is found controversial.","Proceedings of PACLIC19, the 19th Asia-Pacific Conference on Language, Information and Computation. Her account for the contrast is as follows. (9b) asserts contradiction since weak indefinites cannot have scope over negation. Strong indefinites may have scope over negation; two conjuncts in (9b) are not contradictory when ‘sóme apples’ has wider scope than negation.","JBNs behave like weak indefinites. They have scope under, but not over negation as (10) shows8",".","(10) a. Bill-wa (teeburu-no) ringo-o tabe-na-katta. Neg > apple (on the table) -Top (table-Gen) apple-Acc eat-not-Past *apple (on the table) > Neg ‘Bill didn’t eat apple (on the table).’","b. *Bill-wa ringo-o tabe, ringo-o tabe-na-katta. -Top apple-Acc eat, apple-Acc eat-not-Past ‘Bill ate apple, and didn’t eat apple.’ Considering this fact, this paper adopts the Heim/Kamp approach to indefinites for semantics of JBNs rather than assuming type-shifting from properties to GQs as in (6)9",". Assuming that JBNs introduce a free variable to be bound by Existential Closure, the following subsection discusses how ‘Bill-wa ringo-o tabeta (Bill ate apple)’ is interpreted when it is modified by in-adverbs such as ‘ip-pun-de (one-minute-in)’. 2.3 JBNs and the telic reading of VPs (11) shows a derivation that explains how we get the meaning of ‘Bill-wa ringo-o tabeta (Bill ate apple)’ when it is coupled with in-adverbs. The analysis here is based on Zucchi and White (2001), which accounts for telicity and atelicity of English sentences. They adopt Krifka (1998)’s proposal summarized in (12) and define ‘quantized (QUA)’ as in (13). (11) [NP ringo] => lPle[P(x)(e) Ÿ","»","APPLE(x)] (APPLE; apple as a kind) [V tabe] =>lxlyle[eat’(e) Ÿ Ag(e) = y Ÿ Th(e) = x] (by [V’ [NP a ][V b ]] = ly[a’(lx[b‘(x)(y)])]) [V’ ringo-o tabe] => lyle[eat’(e) Ÿ Ag(e,y) Ÿ Th(e,x) Ÿ » APPLE(x)]","[VP Bill-wa ringo-o tabe] => le[eat’(e) Ÿ Ag(e,b) Ÿ Th(e,x) Ÿ » APPLE(x)]","[S Bill-wa ringo-o tabe-ta] => le[eat’(e) Ÿ Ag(e,b) Ÿ Th(e,x) Ÿ","»","APPLE(x) Ÿ At(e,t)","Ÿ t < NOW] = Existential Closure =>","$e$x[eat’(e) Ÿ Ag(e,b) Ÿ Th(e,x) Ÿ » APPLE(x) Ÿ At(e,t) Ÿ t < NOW]  8 The pre-nominal modifier ‘teeburu-no (table-GEN)’ is attached to the bare noun, parallel to ‘(an) apple on the table ‘ in (8). It is put in parentheses since effects of pre-nominal modifiers are not discussed in this paper while they need to be examined carefully. 9 Indefinites marked with ‘a’ are translated in various ways. The Heim/Kamp approach captures one usage of them. In their approach, variables introduced by indefinites are existentially closed under negation.","(12) The domain of application of in-adverbs is restricted to quantized event predicates; the domain of application of for-adverbs is restricted to non-quantized event predicates.","(cf. Krifka (1998))","(13) QUA(P) iff for every Model M, assignment g, and individual a, b, if ||P||M.g(a) =1 and ||P||M.g(b) =1, then a is not a proper part of b. (Zucchi and White 2001:245) The important points here are that variables introduced by JBNs are closed at the discourse level and that quantization is relative to models and assignment functions. The predicate le[eat’(e) Ÿ Ag(e,b) Ÿ Th(e,x) Ÿ » APPLE(x)] is quantized because for any assignment g, there is no event a which is an event of Bill’s eating the apple(s) assigned by g to x, such that it can have, as a proper part, an event b of Bill’s eating the same apple(s). In-adverbs is allowed to apply to the predicate le[eat’(e) Ÿ Ag(e,b) Ÿ Th(e,x) Ÿ » APPLE(x)], without violating (12). 3. JBNs as kinds This subsection considers how JBNs contribute to the atelic reading of VPs. We will first present an analysis based on Chierchia’s Derived Kind Predication (DKP). Then counterexamples to the analysis will be shown, followed by two possible explanations for them. 3.1 JBNs and the atelic reading of VPs We can get the non-quantized predicate through Derived Kind Predication (DKP); when extensional verbs are combined with a kind, we assume there is some instance of the kind that has relation to the verb.  (14) DKP (Derived Kind Predication)","If R is an n-place function applying to objects and k is a kind, then","R(k) = lx1, .....lxn-1$y[ » k(y) Ÿ R(y)(x1)......(xn-1)] (Chierchia 1998:364) Zucchi and White (2001) also propose lexical rules similar to (14). However, a general rule is employed here as in Chierchia and the rule is made to apply to the event structure10",".","(15) If R is a predicate taking an object as its theme and k is a kind, \"e [R(e)‡ [Th(e, k) ‡ $x [ »","k(x) Ÿ Th(e, x)]]] (16) shows another derivation of the sentence ‘Bill-wa ringo-o tabeta (Bill ate apple)’. We start with a kind APPLE, which is of type e.  10 I thank to an anonymous reviewer for pointing out the error in the original formula of (15).","Proceedings of PACLIC19, the 19th Asia-Pacific Conference on Language, Information and Computation.","(16) [NP ringo] => APPLE [V tabe] =>lxlyle[eat’(e) Ÿ Ag(e, y)Ÿ Th(e, x)] (by [V’ [NP a ][V b ]] = b‘(a’) ) [V’ ringo-o tabe] => lyle[eat’(e) Ÿ Ag(e,y) Ÿ Th(e, APPLE)] = (15) =>","lyle$x[eat’(e) Ÿ Ag(e,y) Ÿ » APPLE(x) Ÿ Th(e,x)]]]]","[VP Bill-wa ringo-o tabe] => le$x[eat’(e) Ÿ Ag(e,b) Ÿ » APPLE(x) Ÿ Th(e,x)]","[S Bill-wa ringo-o tabe-ta] => le$x[eat’(e) Ÿ Ag(e,b) Ÿ","»","APPLE(x) Ÿ Th(e,x) Ÿ","At(e,t) Ÿ t < NOW] = Existential Closure =>","$e$x[eat’(e) Ÿ Ag(e,b) Ÿ » APPLE(x) Ÿ Th(e,x) Ÿ At(e,t) Ÿ t < NOW]"," After (15) has applied, we access to an instance of the kind and obtain the predicate le$x[eat’(e) Ÿ Ag(e,b) Ÿ Th(e,x) Ÿ » APPLE(x)]. This predicate is not quantized since an event of ‘Bill’s eating some apples’ has, as a proper part, an event of ‘Bill’s eating some apples’ 11 . For-adverbs apply to the predicate in accordance with (12). 3.2. Atelic activities and verbs of creation There is a set of data which cast a doubt on the analysis presented in 3.1. Verbs of creation do not get along easily with for-adverbs when they are coupled with bare nouns12,13",".","(17) a. ??Bill-wa hito-natu-juu ie-o tate-ta. -Top one-summer-through house-Acc build-Past ‘Bill built house all summer.’","b. ??Bill- wa ip-pun-kan en-o kai-ta. -Top one-minute-for circle-Acc write-Past ‘Bill drew circle for one minute.’","c. ??Bill-wa is-shuu-kan isu/kagu-o tukut-ta. -Top one-week-for chair/furniture-Acc make-Past ‘Bill made chair/furniture for one week.’  11 Recall that atoms and their pluralities are in the extension of mass properties. 12 In addition to consumption verbs such as ‘eat’, ‘read’ allows for-adverbs in the relevant construction. (i) Bill-wa go-hun-kan hon-o yon-da.","-Top five-minute-for book-Acc read-Past","‘Bill read book for five minutes.’ 13 These verbs of creation are not achievements. For example, ‘tate-ta (build-Past)’in (17a) does not correspond to ‘finish building’ in English. Japanese has an expression ‘teiru (is-in-the-state-of)’ that we can use to tell achievements from accomplishments. Achievements followed by ‘teiru’ describe the result state; accomplishments with ‘teiru’ have both the result state reading and the progressive reading. The verbs in (17) are counted among accomplishments based on this test. ‘Bill built houses all summer’ is expressed in Japanese by adding the verb ‘tuzuke (continue)’ to the verb ‘tate (build)’. If there are possible readings at all for (17), they are like the one that Verkyul (1972) describes as ‘repetition’ or ‘stretching of an event’. Let us take (17a) for an instance and consider what it means. If (17a) is interpretable at all, it implies repetition of a single event of building a house, or process toward the completion of a house, just like ‘Bill built a house all summer’ does.","We now have a question why VPs like ‘ringo-o tabe (apple-Acc eat)’ can be modified by for-adverbs, but not VPs like ‘ie-o tate (house-Acc build)’ are. The following subsections offer two different solutions as a way out of the dilemma, studying a secondary reading that Verkyul points out. 3.3 Repetition strategy In (16), [VP Bill-wa ringo-o tabe (Bill’s eating apple)] expresses sets of events of Bill’s eating apples. Let us adopt the semantics of ‘for x time’ in Rothstein in (20) (t(e) is an interval during which an event e runs). (19) is obtained when the VP is applied to ‘ip-pun kan (for one minute)’. (18) lP$e[t(e) = x-time’ Ÿ \"i v t(e) $e’[P(e’) Ÿ e v e’ Ÿ t(e’) = i]] (cf. Rothstein 2004:180) (19) $e[t(e) = one-minute’ Ÿ \"i v t(e)$e’[$x[eat’(e’) Ÿ Ag(e’,b) Ÿ » APPLE(x) Ÿ Th(e’,x)] Ÿ e v e’ Ÿ t(e’) = i]] In (19), ‘for one minute’ picks up sets of subevents described by ‘Bill’s eating apple’. Recall that Chierchia (1998) associates JBNs with mass properties and argues that mass properties are sets of atoms and their pluralities. An atom is a minimal portion that has a relevant property, but what could be counted as a minimal portion can be different from context to context. It is possible that an apple-wedge is taken as an atom of ‘ringo (apple)’. One of the subevents can be then an event of ‘Bill’s eating an apple-wedge’. An event of ‘Bill’s eating two apple-edges’ is included when a plural individual made from two apple-wedges is recognized.","There seems to be another way to express a situation described by (2b). Remember that sentences in (17) imply repetition of events. (2b) as well can be considered to describe repetition of a telic event described by [VP Bill-wa ringo-o tabe (Bill’s eating apple)]. An event of taking a bite of an apple can be such an event. Having seen Bill take a bite of an apple, we can make a statement: Bill-wa ringo-o tabe-ta (Bill ate apple)’. Taking a bite of an apple and another is what we most naturally associate with apple-eating activities. We expect repetition of such an event when apples are consumed.","It is not clear how to formulate repetition of events. (20) is given as an approximation for the relevant reading of (2b) (|x|C=1 is read as ‘e is atomic in a context c’ ) 14 .  14 I owe much to Rothstein (2004)’s semantics of atomic events and predicates as well as semantics of ‘for x","Proceedings of PACLIC19, the 19th Asia-Pacific Conference on Language, Information and Computation. (20) $e[t(e) = one-minute’ Ÿ \"i v t(e) $e’[$y[eat’(e’)Ÿ |e’|C=1] Ÿ Th(e’) = y Ÿ » APPLE(y) Ÿ |y|c=1 Ÿ Ag(e’) = b] (e’) Ÿ e v e’ Ÿ t(e’) = i]] For every subinterval i, a contextually-determined atomic event of eating runs, which involves a contextually-determined atomic apple.","Let us consider the case of creation verbs, taking (17a) as an example. When we talk about creating houses, we don’t consider ‘an event of building a portion of a house’ as an event of building ‘ie (house)’. In order to claim that ‘Bill-wa ie-o tateta (Bill built house)’, there must be at least a single whole house that has been built by Bill. (17a) implies repetition of an event of building a house at best. ‘Building a house and another’, unlike ‘laying a foundation’ or ‘roofing’, does not seem to be a typical activity associated with house-building. Laying a foundation and roofing can be a subevent of a house-building event, but repetition of such activities by themselves are not counted as a house-building event.","We have seen that (2a) is naturally associated with repetition of an event while (17a) is not. If it is the case that the DKP is not applied and thus (16) is not a possible derivation, only (2a) can be given a natural repetition reading. But if it is the case indeed, how could such a general principle not be employed? As a possible answer, we can suggest that JBNs are not inherently kinds nor are they typed-shifted into kinds like English mass nouns. Note that a kind reading of ‘ringo (apple)’ in (21) can be expressed as in (22) if JBNs introduce a variable to be bound by a generic operator (s stands for ‘situation’, C for ‘contain’ in (22)).","(21) Ringo-wa ama-i. APPLE-Top sweet-Pres ‘apple is sweet’ (22) Gn x,s [apple’(x) Ÿ C(x,s) ][sweet’(x,s)] (cf. Chierchia 1998:367) 3.4. Sums and distribution of events This subsection explores a way to explain the marginality of (18), maintaining that JBNs are inherently kinds.","Consider (23). In (23b), ‘ringo (apple)’ appears by itself since ‘san-ko (three-CL)’ is floated. (23) a. Bill ate three apples in ten minutes.","b. Bill-wa ringo-o jup-pun-de san-ko tabe-ta.","-Top apple-Acc ten-minute-in three-CL eat-Past","‘Bill ate three apples in ten minutes.’  time’ stated in (20). (20) is only an approximation and it can be an inference from a different formula. This paper therefore stays out to discuss how to derive (20). (23a) has both distributive and collective readings, but (23b) has only the latter; a group of three apples, but not an individual apple, was eaten in ten minutes15",". The contrast suggests a possibility that JBNs are not sums to be distributed when they are themes of accomplishments. Rothstein (2005) claims that ‘houses’ are distributed over building events when the sentence ‘Bill built houses for three months’ is interpreted. Suppose that the distribution is essential to the atelic reading. If JBNs cannot be sums when they are themes indeed, accomplishment verbs cannot form atelic predicates when coupled with JBNs. There are, however, questions to be answered if we pursue this approach. First, when they are not themes of accomplishments, JBNs seem to be associated with sums and distributed over events.","(24) Gakusei-ga san-nin mitibata-de hon-o hirot-ta. Student-Nom three-CL street-on book-Acc find-Past ‘Three students found a book on the street’ (Nakanishi 2003:235) Nakanishi (2003) observes that (24) has a distributive reading and associated with sums of finding-a-book event while it doesn’t seem to talk about an atomic event of finding a book by a group of three students. We must answer why JBNs are not distributed in the theme position. Second, (25) is ambiguous between distributive and collective readings.  (25) Bill-wa ringo-o ip-pun-de tabe-ta.","-Top apple-Acc one-minute-in eat-Past","‘Bill ate apple in one minute.’ We must answer why (25) is ambiguous and (23) is not.","Let us try an explanation. If we assume a covert temporal adverb ‘always’, (25) can be translated as: Whenever Bill ate an apple, he ate it in one minute. Multiple events of Bill’s eating one apple in one minute are possibly expressed in this way. If (25) has a floated quantifier ‘san-ko (three-CL)’, the following reading is expected to emerge: Whenever Bill ate three apples, he ate them in one minute. The reading describes multiple events of Bill’s eating a group of three apples in one minute. However, the distributive reading we are concerned with involves ‘three’ events of Bill’s eating ‘one’ apple in one minute.  15 The adverb ‘jup-pun de (ten-minute in)’ can be placed before ‘ringo (apple)’ or after ‘san-ko (three-CL)’. Its position does not affect the judgment. When ‘san-ko (three-CL)’ is not floated as in (i), both readings are available. (i) Bill-wa [san-ko-no ringo]-o jup-pun-de tabe-ta. -Top [three-CL-Gen apple]-Acc ten-minute-in eat-Past","Proceedings of PACLIC19, the 19th Asia-Pacific Conference on Language, Information and Computation. 4. Conclusion Let us summarize the discussion in this paper. First, JBNs are claimed to introduce a variable to be bound by Existential Closure. Second, it is shown how telic predicates are derived when accomplishment verbs take JBNs as their theme. Third, we have observed that an event is considered repeated when VPs appear with for-adverbs. Last, we have seen that JBNs are not always interpreted like mass nouns in English. We have shown that JBN’s behavior is explained if we assume (i) the DKP is not applicable or (ii) sum-formation is restricted in some way. However, we leave several questions unanswered. Further research is needed to decide which option is more plausible. Acknowledgements An earlier version of this paper was presented in the workshop ‘Theoretical and Crosslinguistic Approaches to the Semantics of Aspect’ at Bar-Ilan University in June 2005. I would like to thank to participants of the workshop, especially Maria Bittner, Barbara Partee and Hooi Ling Soh for their valuable comments. I am also grateful to John Whitman, Brent de Chene, Tomoyuki Yoshida, and an anonymous abstract reviewer of PACLIC 19. References Borer, H. (2005) Structuring Sense Volume II: The Normal Course of Events. Oxford","University Press, Oxford. Carlson, G. (1977) Reference to Kinds in English. Ph.D. dissertation, University of","Massachusetts, Amherst. [Published in 1980. Garland, New York.] Chierchia, G. (1998) Reference to Kinds across Languages. Natural Language Semantics 6,","339-405. Dowty, D. R. (1979) Word Meaning and Montague Grammar. D. Reidel, Dordrecht. Fromkin, A.V. (ed.) (2000) Linguistics: An Introduction to Linguistics Theory. Blackwell,","Oxford. Krifka, M. (1998) The Origin of Telicity. In S. Rothstein (ed.) Events and Grammar,","Kluwer, Dordrecht, 197-235. Nakanishi, K. (2003) The Semantics of Measure Phrases. NELS 33, 225-244. Nakanishi, K. and S. Tomioka (2004) Japanese Plurals are Exceptional. Journal of East Asian","Linguistics 13, 113-140. Partee, B. H. (1987) Noun Phrase Interpretation and Type-Shifting Principle. In J.","Groenendijk et al. (eds), Studies in Discourse Representation Theory and the Theory of","Generalized Quantifiers, Foris, Dordrecht. Rothstein, S. (2004) Structuring Events, Blackwell, Oxford. Verkyul, H. J. (1972) On the Compositional Nature of the Aspects. Kluwer, Dordrecht. Zucchi, S. and White, M. (2001) Twigs, Sequences and the Temporal Constitution of","Predicates. Linguistics and Philosophy 24, 223-270. "]}]}