{"sections":[{"title":"","paragraphs":["p.ll Author should read: p.30 Author should read: p.60 Author should read: p.84 Author should read: p.94 Author should read: ERRATA Christopher Riesbeck, Yale University George A. Miller, Rockefeller University Joseph D. Becker, Bolt Beranek and Newman","Sheldon Klein, Department of Linguistics, Department of Computer Science, University of Wisconsin Carl Hewitt, Artificial Intelligence Lab, MIT p.104 Author should read: Marvin Minsky, Artificial Intelligence Lab, MIT","p.142 First sentence of the final paragraph should read: \"What we are saying here is perhaps nothing more nor less than the conventional wisdom that the understanding process ought to be sensitive to the understander's style and purpose.\" p.198 Table should read: Act Name: Request Argument List: agent: A; recipient: R; message: M; requested response: X Can Conditions:","CI: A EXPECTS that A CAN CAUSE some action such that","that action results in R KNOWING A's message.","C2: A EXPECTS that R will CHOOSE to UNDERSTAND A's message","C3: A BELIEVES that R BELIEVES certain propositions;","AND","A EXPECTS that [R's KNOWING A's message AND R BELIEVING","certain propositions] will result in R BELIEVING:","(I) A WANTS X","(2) A WANTS R to CAUSE X","(3) A BELIEVES that R CAN CAUSE X","(4) A EXPECTS that A's REQUESTING may MOTIVATE","R to CAUSE X","(5) A BELIEVES that R was NOT MOTIVATED to","CAUSE X prior to A's REQUEST. Goal Hypotheses: GI: R BELIEVES that A WANTS R to CAUSE X G2: A's REQUEST may MOTIVATE R to CAUSE X Outcome Possibilities: O1: R will UNDERSTAND A's COMMUNICATIONACT 02: If Someone PERCEIVES A's message, then that","Someone CAN UNDERSTAND A's COMMUNICATIONACT Motivational Hypotheses: MI: A WANTS R to BELIEVE that A WANTS R to CAUSE X M2: A WANTS X M3: A WANTS R to CAUSE X Normative Obligations:","NI: If someone BELIEVES that A is COMMUNICATING then that someone BELIEVES that A OUGHT to UNDERSTAND A's message","N2: If R BELIEVES that A is COMMUNICATING to R then R BELIEVES that R CUGHT to UNDERSTAND A's message","N3: If R BELIEVES that A is REQUESTING that R CAUSE X AND R EXPECTS to NOT CAUSE X then R BELIEVES that R OUGHT to EXPLAIN to A why R EXPECTS to NOT CAUSE X TABLE I. Representation of the Action REQUEST 22."]}]}