{"sections":[{"title":"Are Topic Constructions Licensed by A’ Movement in Mandarin Chinese?—A Preliminary Study","paragraphs":["Hsin-chang Ho Department of English, National Taiwan Normal University No. 162, Sec. 1, Heping East Road, Taipei City 106, Taiwan 69421019@ntnu.edu.tw Abstract. Topic structures are conventionally classified into two types in Mandarin Chinese, namely dangling and non-dangling topics. The present study concurs that non-dangling topics might be licensed by A’ movement (e.g. Chen 1995), in the sense that they might be interpreted as an operator A’-binding their co-indexed variable, usually an empty category, in a corresponding comment clause. As regards so-called dangling topics, this study favors the traditional postulation of an A/A’ position and also lends support to the A’ movement analysis (e.g. Huang and Ting 2006)."]},{"title":"1. Introduction","paragraphs":["It is conventionally suggested that two types of topics exist in Mandarin Chinese: dangling topics (i.e. Chinese-style topics) and non-dangling topics. Non-dangling topics are accounted for in terms of an antecedent-pronominal analysis (e.g. by Xu and Langendeon 1985), but are interpreted as an instantiation of A’-movement (e.g. by Chen 1995, cf. Williams 1980). As for dangling topics, some studies treat them as semantically licensed (Li and Thompson 1976, Chafe 1976, Xu and Langendeon 1985, Tsao 1990), while some analyses propose that so-called dangling topics are syntactically licensed as non-dangling topics are (Shi 2000, Huang and Ting 2006, cf. Chen 1995). Given the controversy, the current study attempts to imply that A’ movement probably could account for both types of topics."]},{"title":"2. Non-dangling Topics","paragraphs":["Xu and Langendeon (1985) observe that topicalization in Mandarin is not subject to the subjacency condition, as illustrated in (1) where the EC (ei) crosses more than one bounding node, i.e. NP and S (or S’) but the example is acceptable. They advance that the EC (ei) in the comment clause, as in (1), should be interpreted as a non-overt pronominal whose antecedent is the coindexed topic (zhe-ben shui ‘this book’) rather than as a variable. 434 (1) [S’ Zhe-ben shui [S wo renwei [S[NP[S’ e’i [S ej du guo ei de ]] renj] bu duo]]]. This-CL book I think read ASP NOM man not many *‘This book, I think there aren’t many people who read.’ Despite Xu and Langendeon’s analysis, it has been argued that non-dangling topics occupy [Spec, CP] and are subject to the strong crossover condition (SCC) (Huang 1984) and to the empty category principle (ECP) (Chen 1995). The present study also notices some potential discrepancies between an EC coindexed with a topic constituent and a [+pronominal] element. To begin with, Xu and Langendeon regard the EC as a pronominal. There are two possible non-overt candidates associated with [+pronominal], viz. pro and PRO. It seems to turn out that the candidate PRO could be excluded, since the EC (ei) in (1) is not subject to the PRO theorem. The EC is governed by the verb du ‘read’, which violates the PRO theorem but is still grammatical. Hence, what Xu and Langendeon refer to as an empty pronominal is not a PRO but a pro. However, when an overt pronominal like ta ‘it’ is substituted for the EC (ei) in (1), the acceptability of the sentence seems to be lower. In addition, such an EC is not subject to the principle B of the binding theory. A pronoun can co-refer with an antecedent outside its governing category, but the EC (ei), as in (1), cannot be coindexed with any NP other than the topic, which is situated in an A’ position, [Spec, CP]. The EC acts as a wh-trace rather than as a pro. Furthermore, Italian, for example, is characterized by rich inflection, especially marked on verbs. V is a licenser of a pro in this language, and a verb-governed EC is interpreted as a pro, i.e. Arb interpretation (Rizzi 1986). Unlike Italian, Mandarin seems to have no legitimate head that can license an EC in the object position as a pro. In short, it appears that the EC coindexed with a topic constituent differs from a [+pronominal] element (neither a PRO nor a pro). This paper implies that the EC might be interpreted as a variable A’-bound by a coindexed topic, and that non-dangling topics might be thus licensed by A’ movement."]},{"title":"3. So-called Dangling Topics","paragraphs":["As far as so-called dangling topics are concerned, Xu and Langendeon (1985) account for semantic relations between dangling topics and comments, but do not explicate syntactic positions for the topics. Chen (1995) points out further two subtypes of dangling topics (or nongap topics termed by Chen) in Mandarin: general nongap topics, as the NP shuiguo in (2), and possessive-like nongap topics, as the NP Zhangsan in (3). A general nongap topic is proposed to be dominated by a maximal projection TopicP (TopicP ̆NP CP, where NP stands for such a topic), while a possessive-like nongap topic, adjoined to IP (p.86). It is observed that some NPs in [Spec, IP], traditionally an A position, are not theta-marked but merely case-marked, as the pronoun it in (4). Given this, Chen’s analysis of topics is predicated on an assumption that “an A position is either a Case position or a theta position” (by Brody 1993, as cited in Chen 1995:80). Chen maintains that a general nongap topic bears certain semantic relation to a 435 corresponding comment and therefore is ‘theta-marked’ and occupies an A position. A possessive-like nongap topic is adjoined to IP and is not excluded from IP; thus, the finite INFL can govern into the adjoined topic and assign case to it. A ‘case-marked’ possessive-like nongap topic is taken to occupy an A position. (2) Shuiguo, wo zui xihuan pingguo. fruit I most like apple ‘As for fruit, I like apples most.’ (3) Zhangsan, erzi mai le na-ben shu. Zhangsan son buy ASP that-CL book ‘Zhangsan’s son bought that book.’ (4) It is unclear whether Bernard will come. The current study concurs with Chen’s analysis of moved topics, which occupy an A’ position, [Spec, CP]. With reference to nongap topics, this study attempts to suggest some possible accounts from another perspective. In (4), the adjectival predicate unclear takes a clausal argument, i.e. whether Bernard will come. The pronoun it, though occupying [Spec, IP], need not be theta-marked in that the pronoun in the example is an expletive rather than an argument. The requirement of the expletive could be ascribed to the extended projection principle (EPP). In Mandarin, the structural subject is allowed to be non-overt in a sentence, as in xia-yu le ‘(It) rains’. English, in this respect, seems not on a par with Mandarin. Besides, the clausal argument in (4) could move to [Spec, IP], as in whether Bernard will come is unclear, and is theta-marked by the adjectival predicate, as it is in (4). (Note: A clausal argument is not subject to the case filter.) Hence, this study embraces the traditional proposal that an A position is an argument position, assumed to be both theta-marked and case-marked (Chomsky 1981). It is propounded that a general nongap topic has certain semantic linkage with a comment and thus is theta-marked and occupies an A position. From another angle, where two constituents bear some semantic relation, one constituent might not be theta-marked by the other in some cases, as in John studies Chinese at school. In this instance, the PP at school is semantically related to the predicate studies, whereas the PP is an adjunct rather than an argument. According to Huang and Ting (2006), general nongap topics could be interpreted as subjects, NP adverbials, PP reduced forms, or non-dangling topics (see also Shi 2000). Based on their analysis, the general nongap topic shuiguo ‘fruit’ in (2) would be treated as a reduced form of the PP zhai shuiguo zhizhong ‘among all kinds of fruits’ as in (5). The PP in this case is situated in an A’ position (ei) at D-structure and moves to another A’ position, [Spec, CP]. The A’ movement analysis seems consonant with the syntactic status of CP in the conventionally arboreal structures. (5) (Zhai) shuiguo (zhizhong)i, wo ei zui xihuan pingguo. (at) fruit among I most like apple 436 ‘Among all kinks of fruits, I like apples most.’ Possessive-like nongap topics, as in (3), are proposed to adjoin to IP and occupy an A position. As suggested by Chomsky (1981), an adjoined position is an A’ position. This study implies that possessive-like nongap topics might alternatively occupy [Spec, NP] at D-structure, and that a genitive morpheme de is elliptical."]},{"title":"4. Conclusion","paragraphs":["This paper focuses on the syntactic licensing concerning two types of topics in Mandarin Chinese. Xu and Langendeon put forth the pronominal analysis to deal with the issue as to non-dangling topics. The current study, nonetheless, observes some potential distinctions between an empty category coindexed with a topic constituent and a [+pronominal] element. In accord with Huang (1984) and Chen (1995), this study espouses the variable analysis that non-dangling topics might be licensed by A’ movement. With respect to dangling topics, Chen proposes that both subtypes of them occupy an A position. From another point of view, the present study smiles upon the traditional assumption of an A/A’ position (Chomsky 1981) and favors the A’ movement analysis (Huang and Ting 2006)."]},{"title":"References","paragraphs":["Chafe, Wallace. 1976. Givenness, contrastiveness, definiteness, subjects, topics and point of view. Subject and Topic, ed. by Charles Li, 27-55. New York: Academic Press. Chen, Chun-Yin Doris. 1995. Topics in Chinese: A or A’? Studies in English Literature and Linguistics 21:79-106. Chomsky, Noam. 1981. Lectures on Government and Binding. Dordrecht: Foris. Huang, C.-T. James. 1984. On the distribution of reference of empty pronouns. Linguistic Inquiry 15:531-574. Huang, Ray Rui-heng, and Jen Ting. 2006. Are there dangling topics in Mandarin Chinese? Concentric: Studies in Linguistics 32:119-146. Li, Charles, and Sandra Thompson. 1976. Subject and topic: A new typology of language. Subject and Topic, ed. by Charles Li, 457-489. New York: Academic Press. Rizzi, Luigi. 1986. Null objects in Italian and the theory of pro. Linguistic Inquiry 17:501-558. Shi, Dingxu. 2000. Topic and topic-comment constructions. Language 76:383-408. Tsao, Feng-fu. 1990. Sentence and Clause Structure in Chinese: A Functional Perspective. Taipei: Student Book Co. Williams, Edwin. 1980. Predication. Linguistic Inquiry 11:203-238. Xu, Liejiong, and D. Terence Langendeon. 1985. Topic structure in Chinese. Language 61:1-27. 437"]}]}