{"sections":[{"title":"SOFTWARE TECHNOLOGY TRANSFER FROM SLS David Talkin, Principal Investigator","paragraphs":["Entropic Research Laboratory","600 Pennsylvania Ave. S.E., Suite 202","Washington, D.C. 20003 PROJECT GOALS This summary describes a new project that is scheduled to start in March, 1992. In this project, Entropic will serve as a technology transfer agent for the Speech and Language Systems (SLS) program. Our ultimate goal is to make complete systems developed in the course of SLS research readily available to interested parties in government, education, and industry. An intermediate goal is to provide clean, well documented implementations of speech recognition systems such as SPHINX or BYBLOS for experimentation and application outside of the SLS program. The goals of the initial project are to create a technology transfer mechanism, to test it by means of a useful but modest-scale application of the mechanism, and to create a plan for the transfer of a full-scale speech-recognition system. RECENT RESULTS The end of the contracting gauntlet is in sight. PLANS FOR THE COMING YEAR Our first goal is to provide a portable implementa-tion of an \"acoustic feature\" front end. This program will accept sampled data in the SPHERE format developed at NIST, and produce a sequence of acoustic feature vectors. While there will be a wide variety of possible features that can be selected, there will be options to produce the acoustic feature sets that are used (prior to vector quantization) in the current systems at certain SLS sites. The tentative list of sites is: BBN, CMU, MIT-LCS, MIT-LL, and SRI. A second goal is to establish a software repository and distribution mechanism for the acoustic feature front end. This will be accomplished by an electronic mail server that will distribute informa-tion about the available software, and by ftp access for actual software transfer. For recipients without network access, tape distribution will be available at a nominal charge. A third goal is to create a plan (with cost and time estimates) for taking a full speech recognition system from within the SLS community and making it available to outside parties in a documented and supported form. To summarize, there will be three products of the initial effort: • an acoustic feature front end • a software repository and distribution mechanism; • a plan for transfer of a complete recognition system The transfer of a complete system is a possible follow-on project. Other possible follow-on projects include the transfer of additional analysis modules (e.g., HMM, VQ, etc.). The target modules would be chosen to be useful in constructing a specific speech recognizer while at the same time being technically interesting and useful on a stand-alone basis. 473"]}]}