{"sections":[{"title":"","paragraphs":["THE INTERPRETATION OF TENSE AND ASPECT IN ENGLISH","Mary Dalrymple Artificial Intelligence Center","SRI International 333 Ravenswood Avenue","Menlo Park, California 94025 USA ABSTRACT","An analysis of English tense and aspect is presented that specifies temporal precedence relations within a sentence. The relevant reference points for interpretation are taken to be the initial and terminal points of events in the world, as well as two \"hypothetical\" times: the"]},{"title":"perfect","paragraphs":["time (when a sentence contains perfect aspect) and the pro-"]},{"title":"gressive","paragraphs":["or"]},{"title":"during","paragraphs":["time. A method for providing temporal interpretation for nontensed elements in the sentence is also described. 1. Introduction","The analysis of tense and aspect requires specifying what relations can or cannot hold among times and events, given a sentence describing those events. 1 For example, a specification of the mean-ing of the past-tense sentence \"John ate a cake\" involves the fact that the time of the main event - in this case, the cake-eating event - precedes the time of utterance of the sentence. Various proposals have also been made regarding the analysis of aspect which involve auxiliary times or events, whereby the proper relationship of these auxiliary times or events to \"real\" main events is specified.","We provide an analysis of English tense and aspect that involves specifying relations among times rather than events. We also offer a means of interpreting tenseless elements like nouns and adjectives whose interpretation may be temporally dependent. For example, the noun phrase \"the warm cakes\" picks out different sets of cakes, depending on the time relative to which it'receives an interpretation.","The analysis presented here has been implemented with the Prolog data base query system","1The work presented here was supported by SP, I International. I am grateful to Phil Cohen, Bill Croft, Doug Edwards, Jerry Hobbe, Doug Moran, and Fernando Perelm for helpful discussion and comments. CHAT (Pereira 1983), and the representations are based on those used in that system. We shall show that an analysis of tense and aspect involving specification of relations among times rather than among events results in a clean analysis of various types of sentences. 2. Time Points","Harper and Charniak (1986) [henceforth H&C] provide an interesting and revealing analysis of English tense and aspect involving relations between events. There are several kinds of events: the"]},{"title":"u~terance","paragraphs":["event, which is associated with the time of the utterance; the"]},{"title":"main","paragraphs":["event, or the event being described by the main verb of the sentence; the"]},{"title":"perfecg","paragraphs":["event; and the"]},{"title":"progressivJe","paragraphs":["event. The representation of every sentence involves the utterance event and the main event; sentences with progressive or perfect aspect also involve progressive or perfect events.","This treatment is quite different from the Reichenbach (1947) conception of \"reference time\", which is assumed to be relevant for all sentences. To translate between the two systems, the reference time may be thought of as being represented by the perfect event in perfect sentences and by the progressive event in progressive sentences. In the case of perfect progressives, one might consider that there are two reference events, while in simple tenses there is no reference event at all. Alternatively, in a system like Webber (1987) in which reference points for each sentence are used to construct an event structure, the tensed event (what H&C call the \"anchor event\") is the relevant one: the perfect event for sentences with perfect aspect; for sentences with progressive but no perfect aspect, the progressive event; or the main event for simple tense sentences. 2","2 Although insta~s rather than events are used in the representation described here, a similar strategy would be employable in buildin 5 up a Webber-style event structure. 68","In accordance with H&C, we propose perfect reference points for sentences with perfect aspect and progressive reference points for sentences with progressive aspect. Thus, the interpretation of each sentence involves a number of relevant times: the beginning and end of the event described by the main verb for all sentences, the"]},{"title":"perfect","paragraphs":["time if it has perfect aspect, and the"]},{"title":"progressive","paragraphs":["time if it has progressive aspect. In our analysis, unlike H&C, what is relevant for the interpretation of sentences is not a set of events (which have potential duration and beginning and end points) but a set of times or instants. Instants, unlike events, have no beginning or end: they are one-dimensional points. This has several advantages over an analysis such as H&C, in which the perfect and progressive reference points are events.","First, if the reference points for perfect and progressive sentences are events rather than instants, it ought to be possible to predicate duration of them. However, this is not a possible option for perfect and progressive sentences; durational adjuncts are only interpreted relative to the main event. The sentence \"John has swum for three hours\" is only true when the duration of the main event (the swimming event) is three hours.","Second, relations among events in H&C's system reduce anyway to relations between instants: the starting and ending points of events. That is, the primitives of systems like H&C's are relations among times. There seems to be little to be gained from constructing hypothetical events based on these relations when a simpler and cleaner analysis can be constructed on the basis of these primitive notions alone.","There might seem to be the following objection to adopting times as relevant for the interpretation of sentences: given a sentence like 'John was frosting a cake from 3:00 to 4:00 yesterday', we know about the progressive reference point only that it lies between 3:00 and 4:00; there are in-finitely many instants satisfying that condition. It would be impossible to iterate over all of these times to determine the truth of any utterance. In fact, though, to determine whether a sentence containing perfect or progressive aspect is true, it is unnecessary to instantiate the perfect or progressive reference times to specific values; it suffices to show that an interval exists within which such a point can be found. That is, they are merely existentially quantified, not instantiated to a value. In this manner, perfect or progressive times may give the appearance of being similar to events with a starting and an ending point, because they are constrained only to exist within some nonnull interval. Checking whether or not the sentence is true involves determining whether the interval exists.","The following is the representation for the simple past sentence \"John frosted a cake\", with words in upper case representing variables and words in lower case representing predicate names or constants: (1)"]},{"title":"ezists X Start End holds(frost(john, X), Start, End)","paragraphs":["g_4"]},{"title":"cake(X) g~ precede(End, now)","paragraphs":["The predicate"]},{"title":"holds","paragraphs":["in the first clause of the representation takes three arguments, representing the predicate and the beginning and ending times of the event. In other words, John frosted X from time"]},{"title":"Start","paragraphs":["to time"]},{"title":"End.","paragraphs":["The predicate"]},{"title":"cake(X)","paragraphs":["specifies that the thing John frosted was a cake. We do not represent this with a"]},{"title":"holds","paragraphs":["predicate because we assume that the property of being a cake is a static property, not one that changes over time.S The predicate"]},{"title":"precede(End, now)","paragraphs":["specifies that the ending time"]},{"title":"End","paragraphs":["of the cake-frosting event must precede"]},{"title":"now,","paragraphs":["the current time. In the course of validating this logical form, the variable"]},{"title":"End","paragraphs":["will be instantiated to a numerical value, and the atom"]},{"title":"now","paragraphs":["will be replaced by the value of the current time. The predicate"]},{"title":"precede","paragraphs":["represents the less-than-or-equal-to relation, while the predicate"]},{"title":"strictly.precede","paragraphs":["represents the leas-than relation. Thus, the cake-frosting event must occur in the past.","Let us next consider the semantic representation of a sentence with perfect aspect, \"John will have frosted a cake\":"]},{"title":"(2) ezists X Start End Perfect holds(frost(john, X), Start, End) cake(X) g~ precede(End, Perfect) strictly_precede(now, Perfect)","paragraphs":["3Th]s is not a necessary part of the analysis; the representation has been chosen in part for the sake of simplicity. It would also be possible to represent the predicate cake(X) inside a holdJ predicate, with the Start and End tlmes reprosent~ag when the cake began and ceased to exist. 69 The interpretation of perfect sentences involves a perfect time"]},{"title":"Perfect.","paragraphs":["This time is constrained to follow the main event; this is enforced by the clause"]},{"title":"precede(End, Perfect).","paragraphs":["Since this is a future perfect sentence,"]},{"title":"Perfect","paragraphs":["is constrained to be in the future. The future tense is represented by the predicate"]},{"title":"strictly_precede;","paragraphs":["the perfect time must follow"]},{"title":"now","paragraphs":["(not coincide with it).","Note, therefore, that in the case of future perfect sentences the main event is required only to end before a time in the future, and that (as with H&C) it is not a contradiction to say \"John will have arrived by tomorrow, and he may already have arrived.\" Unlike analyses in which relations among all reference points are fully specified, this analysis allows the main event to be in the past even though the sentence itself is in the future perfect.","The following is a representation of the past progressive \"John was frosting a cake\":"]},{"title":"(3) e~ists X Start End Progressive holds(frost(john, X), Start, End) cake(X) precede(Start, Progressive) precede(Progressive, End) precede(Progressive, note)","paragraphs":["Here the progressive time, represented by the variable"]},{"title":"Progressive,","paragraphs":["must occur during the cake-frosting event; that is, it must occur after the start and before the end of the main event. Since the sentence is a past progressive, there is a final requirement on"]},{"title":"Progressive:","paragraphs":["it must precede"]},{"title":"note.","paragraphs":["Notice that past progressives differ from simple past sentences in that it is the progressive time and not the ending time of the main event that is required to be in the past. Consequently, as in H&~C, the interpretation of a past progressive like \"John was frosting a cake\" does not require that the main event lie entirely in the past, but only that some part of it he in the past. The present analysis allows for the possibility that sentences like the following can be true:"]},{"title":"(4) John was frosting a cake at 3:00, and he is still frosting it.","paragraphs":["We shall see in the next section that what was referred to as the"]},{"title":"progressive","paragraphs":["time in the forego-ing example actually appears in the representation not only of progressives, but of every sentence, as what we shall call the"]},{"title":"during","paragraphs":["time. The"]},{"title":"during","paragraphs":["time will be used in the temporal interpretation of nontensed elements in the sentence. For this reason, the above representations of the simple past and future perfect sentences above were only a first approximation; actually, their complete representations also contain a"]},{"title":"during","paragraphs":["time. Finally, the representation of a sentence with both progressive and perfect aspect, like \"John will have been frosting a cake\", is the following:"]},{"title":"(5) exists X Start End Progressive Perfect holds(frost(john, X), Start, End) cake(X) precede(Start, Progressive) precede(Progressive, End) precede(Progressive, Perfect) strictly.precede(now, Perfect) Progressive,","paragraphs":["the progressive or"]},{"title":"during","paragraphs":["time, occurs during the cake-frosting event."]},{"title":"Progressive","paragraphs":["is constrained by the clause"]},{"title":"precede(Progressive, Per- fect)","paragraphs":["to precede the perfect time"]},{"title":"Perfect.","paragraphs":["In other words, for a perfect progressive sentence, the requirement is that some portion of the main event lie before the perfect time. The perfect time is constrained by the clause"]},{"title":"strictly_precede(now, Per- fect)","paragraphs":["to lie in the future.","In this analysis, underspecification of relations among times yields results that match the naturallanguage semantics of sentences. 4 Use of a perfect and a progressive time allows uniform treatment of perfects and progressives without the complication of introducing unwarranted pseudo-events into the representation of simple tenses. Also, the progressive/during time is useful as an anchor for the interpretation of nontensed elements, as we will see below. 3. Temporal Interpretation of Nontensed Elements","Not only tensed verbs, but also other nontensed elements in the sentence - adjectives, nouns, prepositions, and so on - must be temporally interpreted. Consider the sentence \"Are there any warm cakes?\" The adjective \"warm\" must be interpreted relative to some time: in this case, the","4 We have not yet enriched the representation of individual predicates to include inherent aspect, as described in, for example, Pammneau (1987). We feel, though, that the resulting representatione will sti~ involve the tree of perfect and during times, and will still be amenable to the treat~ merit of nontensed elemclats described in the next section. 70 present. The question is about cakes that are currently warm.","The interpretation of nontensed elements does not always depend on the utterance time, though. The sentence \"The third-year students had to take an exam last year\" can be interpreted in two ways. Under one interpretation, those who were third-year students last year (the current fourth-year students) had to take a test last year. The interpretation of the noun phrase \"the third-year students\" is dependent on the tense of the main verb in this case. Under the other interpretation, those who are currently third-year students took a test last year, when they were second-year students.","However, the interpretation of nontensed elements with respect to the tense of the main verb in the sentence is not entirely unconstrained. Consider the sentence \"The wife of the president was working in K-Mart in 1975.\" \"Wife\" and '~)resident\" are both predicates that must be interpreted with respect to a particular time. The current president is not the same as the 1975 president; if he divorced and remarried, his 1975 wife is not necessarily the same person as his current wife. Given this, there ought to be four possible interpretations of this sentence. In fact, there are only three:","* He is the current president and she is his current wife","• He is the current president and she was his wife in 1975","• He was the president in 1975 and she was his wife then (but perhaps he is divorced and no longer president) The missing interpretation is that","• He was the president in 1975 and she is his current wife (but was not his wife then)","A skeletal tree for this example is shown in Figure 1. The sentence involves the syntactic embedding of one NP (\"the president\") inside another NP (\"the wife\"). The unavailable interpretation is one in which the embedded NP is interpreted with respect to the event time of the higher verb, whereas the intervening NP is not. That is, the unavailable interpretation involves interpreting a discontinuous portion of the parse tree of the sentence with respect to the main verb. 5","s As we will see in the next section, it is possible to construct ~ context in which the \"missing interpretation\" is in fact available for this sentence. The clahn ~,~]e here is that this interpretation is not available by means of the syntactic variable-passing mechanism discussed in this section, but","One may think of the main-verb event time as being passed or disseminated through the tree. It may be passed down to embedded predicates in the tree only when it is passed through intermediate predicates and used in their interpretation. If a predication is interpreted with respect to the current time rather than to the event time of the main verb, all predications that are syntactically subordinate to it are also interpreted with respect to the current time. When this happens, the main-verb event time ceases to be passed down and may not be reinstated for interpretation.","Note, however, that the verb time and the time with respect to which the nontensed elements are interpreted are not always completely coextensive. Consider again the example \"John will be frosting a warm cake at 3:00.\" Under the interpretation that the cake is warm while John is frosting it, the time span during which the cake is warm must include the time 3:00; however, the starting and ending points of the cake-frosting event need not coincide exactly with the starting and ending points of the interval at which the cake is warm. The only requirement is that both events must hold at 3:00.","Now consider the sentence \"John built a new house.\" The building event can be thought of as beginning before the event of the house's being new. At the start of the building event, there is no house, nor, obviously, is there is any event of the house's being new. In a situation like this, one does not want to require that the building event be coextensive with the event of the house's being new, but rather, merely to require that the two events should overlap.","Our claim is that, in general, temporal interpretation of nontensed elements relative to the tense of the main verb of the sentence requires only that the event denoted by the main verb overlap (not be coextensive with or be contained in) the events denoted by the nontensed elements. We shall accomplish this by positing a time for each tensed verb, the"]},{"title":"during","paragraphs":["time, and passing this time through the syntactic tree. The event denoted by the main verb, as well as the events denoted by any predicates interpreted relative to the main verb, must hold at this"]},{"title":"during","paragraphs":["time. For example, here is the logical form for the sen-","tence \"John frosted a warm cake\" : is only ~vailable by appea~ to the context constructed. The %nixing interpretation\" is missing when there is no context to refe~ to for addition~ interpretations. 71 S NP y ~pp thewife / ~ P NP t of tl~e president VP was working in K-Mart in 1975 Figure 1 (6)"]},{"title":"ezists X Startl End1 Slart~ End~ During holds(frost(john, X), Start1, End1) cake(X) precede(End1, now) precede(Start1, During) precede(Daring, End) hotdsCwarmCX), Szar~, End~) precede(S~artl, During) precede(Daring, End)","paragraphs":["There are two predicates in this example that are interpreted with respect to a temporal interval: warm and"]},{"title":"frost.","paragraphs":["There must be a"]},{"title":"during","paragraphs":["time"]},{"title":"During","paragraphs":["that occurs during both the cake-frosting event and the event of the cake's being warm: the two events must overlap.","We further note that all elements within a NP node are interpreted with respect to the same event. It is not possible, for example, to interpret some elements of a noun phrase with respect to the time of utterance, others with respect to the main verb's"]},{"title":"during","paragraphs":["time. Consider the sentence \"John frosted three stale warm cakes yesterday.\" Despite the pragmatic predilection for interpreting \"stale\" and \"warm\" at different times (it is hard to imagine how cakes that are still warm could already be stale), this sentence has only two interpretations:","• John frosted three cakes that were both stale and warm yesterday.","• John frosted three cakes yesterday that are both stale and warm now. It is not possible to give the sentence the interpretation that the cakes he frosted were warm yesterday and are stale now, or were stale yesterday and are warm now. Both adjectives must be interpreted with respect to the same time.","If a system like H&C, in which events and not instants are taken to be the relevant reference points, were extended to include interpretation of nontensed elements as described here, such a system might use primitives such as those of Allen (1984). However, none of the primitives of Allen's system is suitable for defining the relation of the"]},{"title":"during","paragraphs":["time to the main event:"]},{"title":"during(DuringEvent, MainEvent)","paragraphs":["is not sufficient, since Allen's \"during\" relation does not permit the DuringEvent to coincide with the beginning or end points of the main event. The example \"John built a new house\" shows that this is necessary; in this case, it is precisely the end point of the building event that coincides with the beginning of the event of the house being new. In a system using Allen's primitives, the proper relation between the DuringEvent and the MainEvent would be a disjunction: (7)"]},{"title":"during(DuringEvent, MainEvent) OR starts(DuringEvent, MainEvent) OR ends(DuringEvent, MainEvent)","paragraphs":["4. Passing the During Time: Rules for Temporal Interpretation","In the previous section, we examined the temporal interpretation of phrases with respect to the"]},{"title":"during","paragraphs":["time of the main verb. In addition, 72 we proposed a constraint on the passing of this"]},{"title":"during","paragraphs":["time from the verb through its arguments and adjuncts, according to which predicates interpreted according to the"]},{"title":"during","paragraphs":["time must occupy a nondiscontinuous portion of the tree. From the point of view of the tenseless phrase, however, the same process can be seen in a different light.","We may think of the interpretation of temporally dependent elements in.a phrase as proceeding in the following manner:","• The phrase is interpreted with respect to a temporal modifier internal to the phrase; otherwise","• The phrase is interpreted with respect to the closest higher tensed element (allowing for restrictions on the distribution of the during variable); otherwise","• The phrase is interpreted with respect to some contextually relevant time.","Temporally dependent nontensed elements in previous sections were always contained in phrases that lacked internal temporal modifiers, so the first option was not applicable. One of two interpretations was given for tenseless elements: they were interpreted either with respect to the"]},{"title":"during","paragraphs":["time of the main verb or with respect to now, the time of utterance. Interpretation with respect to now seems to be a particular instance of the general possibifity of interpretation with respect to a contextually relevant time; since no context was given for the examples in the previous sections, no other contextually relevant time was available. When a phrase contains a phrase-internal temporal modifier, the predicates in that phrase must be interpreted with respect to that modifier, as in the example \"The 1975 president is living in California.\" The modifier \"1975\" in the phrase \"the 1975 president\" provides the temporal interpretation of the phrase: it must be interpreted with respect to that time. It is not possible to interpret \"president\" relative to the"]},{"title":"during","paragraphs":["time of the main verb.","Hinrichs (1987) also proposes that noun phrases be interpreted relative to a time restricted by the context; the difference between his analysis and ours is that, of the three options presented above, he offers only the last. He contends that the only option for temporal interpretation of nontensed elements is the third one, namely, by reference to context.","Given an analysis like that of Hinrichs, it is difficult to explain the facts noted in the preceding section. In the absence of context (or when the sole context is the moment of utterance), Hinrichs would not predict the absence of one reading for sentences such as \"The wife of the president was working in K-Mart in 1975.\" In an analysis like the one presented here, where the interpretation of nontensed elements is determinable in some instances through syntactic processes, the absence of these readings is expected.","Enc (1981) and Hinrichs (1987) both argue convincingly that there are many instances in which a temporally dependent element is interpreted with respect to a time that is neither the"]},{"title":"during","paragraphs":["time nor"]},{"title":"now.","paragraphs":["Hinrichs furnishes the following example: (8)"]},{"title":"Oliver North's secretary testified before the committee.","paragraphs":["At the time she testified, she was no longer his secretary; she-was also not his secretary at the time this sentence was uttered. The sentence would receive the following interpretation: (9)"]},{"title":"exists X Startl End1 Duringl Start2 End~ During2 holds(secretary(north, X), Start1, End1) precede(Start1, Duringl) precede(During1, End1) ~4 hotdsOestify(X), StartS, End2) g~ precede(Start2, During~) g~ precede(During2, End~) precede(During2, now)","paragraphs":["There are two events described in the logical form of this sentence: the event of X being North's secretary and the event of X testifying."]},{"title":"Daring1","paragraphs":["is a time during the being-a-secretary event, and"]},{"title":"Dur- ing2","paragraphs":["is a time during the testifying event. The events are not required to overlap, and only the \"testify\" event is restricted by the tense of the sentence to occur in the past. In a more complete representation, appropriate restrictions would be imposed on"]},{"title":"During1:","paragraphs":["the time during which X is a secretary would be restricted by the context, in line with Hinrichs' suggestions. 5. Further Results It appears that the"]},{"title":"during","paragraphs":["time of the main clause is used in the interpretation of some tensed subordinate clauses: for example, in the interpretation of relative clauses. Consider the sentence \"He will catch the dog that is running.\" Under one interpretation of this sentence, the catching event is simultaneous with the running event - 73 both events take place in the future. In this case, the interpretation of the main verb in the relative clause depends on the during time of the main clause. There is also another interpretation, according to which the dog that will be caught later is running now. In this case, the interpretation of the relative clause depends on the time of utterance of the sentence.","One remaining task is to provide a reasonable analysis of the bare present using this system. We feel that such an analysis awaits the incorporation of a representation of inherent lexical aspect as in Passoneau (1987); without a representation of the distinction between (for example) states and activities, a coherent representation of simple present tense sentences is not possible. 7. Conclusion","We have shown that distributing an existentially quantified"]},{"title":"during~time","paragraphs":["variable throughout the tree enables interpretation of nontensed elements in the sentence according to the time of the main verb. Further, the"]},{"title":"during","paragraphs":["time is useful in the interpretation of several sentence types: progressivss, statives, and sentences containing relative clauses. Finally, an analysis that utilizes underspecified relations among times (not events) provides a good prospect for analyzing tense and aspect in English. rina Del Rey, California.: Information Sciences In-stitute. Passoneau, Rebecca. 1987. \"Situations and Intervals.\" Proceedings of the ACL Conference, Stanford University, Stanford, California.","Pereira, Fernando. 1983. \"Logic for Natural Language Analysis.\" Technical Note 275. Menlo Park, California.: SRI International. Reichenbach, Hans. 1947."]},{"title":"Elements of Symbolic Logic.","paragraphs":["New York, New York: Macmillan.","Webber, Bonnie. 1987. \"The Interpretation of Tense in Discourse.\" Proceedings of the ACL Conference, Stanford University, Stanford, California. References","Allen, James F. 1984. \"Towards a General The-ory of Action and Time.\" Artificial Intelligence 23:2, July 1984.","Enc, Murvet. 1981. \"Tense without Scope: An Analysis of Nouns as Indexicals.\" Ph.D. dissertation, University of Wisconsin, Madison, Wisconsin.","Harper, Mary P. and Eugene Charniak. 1986. \"Time and Tense in English.\" Proceedings of the ACL Conference, Columbia University, New York, New York.","Hinrichs, Erhard. 1987. \"A Compositional Semantics of Temporal Expressions in English.\" Proceedings of the ACL Conference, Stanford University, Stanford, California.","Mathiessen, Christian. 1984. \"Choosing Tense in English.\" ISI Research Report RR-84-143. Ma-74"]}]}
