{"sections":[{"title":"The FINITE STRING Newsletter Program for the 21st Annual Meeting of the ACL","paragraphs":["Nominating Committee (1984-1986): C. Raymond Perrault, University of Toronto Friday, 17 June, 9:00-12:00 PARSING A Framework for Processing Partially Free Word Order","Hans Uszkoreit, SRI International Sentence Disambiguation by a Shift-Reduce Parsing Technique","Stuart M. Shieber, SRI International Syntactic Constraints and Efficient Parsability","Robert C. Berwick, Amy S. Weinberg, Massachu-","setts Institute of Technology Deterministic Parsing of Syntactic Non-fluencies","Donald Hindle, Bell Laboratories D-Theory: Talking about Talking about Trees","Mitchell P. Marcus, Donald Hindle, Margaret","Fleck, Bell Laboratories Parsing as Deduction","Fernando C. N. Pereira, David H. D. Warren, SRI","International Friday, 17 June, 2:00-4:30 APPLICATIONS Design and Implementation of a Knowledge-Based Report Generator","Karen Kukich, Bell Laboratories Menu-Based Natural Language Understanding","Harry R. Tennant, Kenneth M. Ross, Richard M.","Saenz, Craig W. Thompson and James R. Miller,","Texas Instruments Knowledge Structures in UC, the UNIX 1 Consultant","David N. Chin, University of California, Berkeley Discourse Pragmatics in Task-Oriented Natural Language Interfaces","Jaime G. Carbonell, Carnegie-Mellon University Program for the Inaugural Meeting of the ACL European Chapter The first and inaugural meeting of the European Chapter of the Association for Computational Linguistics will be held 1-2 September 1983 in Pisa, Italy. It will be organized by the Italian National Research Council, the Istituto di Linguistica Computazionale of Pisa, and the Istituto di Elettrotecnica of the University of Genoa. Support is being provided by the Council of the European Communities, Perkin Elmer Italiana, the Cassa di Risparmio di Pisa, and the Ente Provinciale del Turismo di Pisa. 1 Trademark of Bell Laboratories. The first officials of the European Chapter are:","Chair Eva Hajicova, Charles University","Secretary Harry Somers, University of Manchester","Treasurer Mike Rosner, ISSCO","Executive Committee Remko Scha, Eindhoven, Netherlands Yorick Wilks, University of Essex Hubert Lehmann, IBM-Deutschland","Advisory Committee: Giacomo Ferrari, Istituto di Linguistica","Computazionale Gerald Gazdar, University of Sussex Peter Hellwig, University of Heidelberg Bente Maegaard, University of Copenhagen The Program Committee consisted of Giacomo Ferrari, Istituto di Linguistica Computazionale, Chair; Joust Breuker, COWO (Amsterdam); Gerald Gazdar, University of Sussex; Margaret King, ISSCO; Winfred Lenders, University of Bonn; Petr Sgall, Charles University; and Antonio Zampolli, Istituto di Linguistica Computazionale. Ferrari also is coordinating local arrangements for the Conference.","Copies of the Proceedings, at $15 each, will be available from","Donald E. Walker - ACL","SRI International","Menlo Park, CA 94025 USA Thursday, 1 September, 9:30-11:10 Abstract Control Structures and the Semantics of Quantifiers","Steven Cushing, St. Anselm College k'ldee de Grammaire avec le Contexte Naturel","Leszek Haduch, Technical University of Lodz Iterative Operations","Sac Yamada, Notre Dame Seishin University Structure of Sentence and Inferencing in Question Answering","Eva Hajicova and Petr Sgall, Charles University Thursday, 1 September, 11:30-12:50 A Phonological Processor for Italian","Rodolfo Delmonte, Universita degli Studi di Venezia An Expert System for the Production of Phoneme Strings from Unmarked English Text Using Machine-Induced Rules","Alberto Maria Segre, Bruce Arne Sherwood, and","Wayne B. Dickerson, University of Illinois Vocal Interface for a Man-Machine Dialog","Dominique Beroule, L/MS/ American Journal of Computational Linguistics, Volume 9, Number 1, January-March 1983 37 The FINITE STRING Newsletter Program for the Inaugural Meeting of the ACL European Chapter","Knowledge Engineering Approach to Morphological","Analysis Harri Jappinen, Aarno Lehtola, Esa Nelimarkka, and Matti Ylilammi, Helsinki University of Technology Thursday, 1 September, 14:30-16:10 A Prolog Implementation of Lexical Functional Grammar as a Base for a Natural Language Processing System","Werner Frey and Uwe Reyle, University of Stuttgart Extended Access to the Left Context in an ATN Parser","Irina Prodanoff and Giacomo Ferrari, Istituto di","Linguistica Computazionale (Pisa) An Experiment with Heuristic Parsing of Swedish","Benny Brodda, University of Stockholm Towards the Semantics of Sentence Adverbials","Eva Koktova, Tabor, Czechoslovakia Thursday, 1 September, 16:30-17:50 Dealing with Conjunctions in a Machine Translation Environment","Xiuming Huang, Chinese Academy of Social","Sciences Fallible Rationalism and Machine Translation","Geoffrey Sampson, University of Lancaster The Generation of Term Definitions from an On-Line Terminological Thesaurus","John McNaught, University of Manchester Relating Syntax and Semantics: The Syntactico-Semantic Lexicon of the System Vie-Lang","Ingeborg Steinacker and Ernst Buchberger, Univer-","sity of Vienna Thursday, 1 September, 17:50 ACL European Chapter General Meeting Friday, 2 September, 9:00-10:40 An Island Parsing Interpreter for the Full Augmented Transition Network Formalism John-A. Carroll, University of Cambridge WEDNESDAY: Parsing Flexible Word Order Languages Oliviero Stock, Cristiano Castelfranchi, and Domenico Parisi, Istituto di Psicologia (Roma) How to Parse Gaps in Spoken Utterances G. Goerz and C. Beckstein, Universitaet Erlangen-Nuernberg A Flexible Natural Language Parser Based on a Two-Level Representation of Syntax Leonardo Lesmo and Pietro Torasso, Universita di Torino Friday, 2 September, 11:00--12:20 An Approach to Natural Language in the SI-Nets Paradigm Amedeo Cappelli and Lorenzo Moretti, Istituto di Linguistica Computazionale (Pisa) An Experiment on Synthesis of Russian Parametric Constructions","I. S. Kononenko and E. L. Pershina, Siberian","Branch of the USSR Academy of Sciences Learning Translation Skills with a Knowledge-Based Tutor: French-Italian Conjunctions in Context","Stefano A. Cerri and Marie-France Merger, Univer-","sita di Pisa Friday, 2 September, 14:00-15:20","Toward Better Understanding of Anaphora Barbara Dunin-Keplicz, Warsaw University","Rules for Pronominalization Franz Guenthner and Hubert Lehmann, IBM Heidelberg Science Center","Local and Global Structures in Discourse","Understanding M. Koit, S. Litvak, H. Oim, T. Roosmaa, and M. Saluveer, Tartu State University","Systemic Grammar in Computation: The Nigel Case Christian M. I. M. Matthiessen, USC/Information Sciences Institute","Inquiry Semantics: A Functional Semantics of Nat-","ural Language Grammar William C. Mann, USC/Information Sciences Institute Friday, 2 September, 16:00-17:40","Natural Language Input for Scene Generation Giovanni Adorni and Mauro di Manzo, University of Genoa, and Giacomo Ferrari, Istituto di Linguistica Computazionale (Pisa) A Multilevel Approach to Handle Non-Standard Input Manfred Gehrke, University on BielefeM Case Role Filling as a Side Effect of Visual Search Heinz Marburger, University of Hamburg, and Wolf gang Wahlster, University of Saarbruecken Natural Language Information Retrieval Dialog L. Bole, K. Kochut, A. Lesniewski, T. Strzalkowski, Warsaw University Friday, 2 September, 17:40 Concluding Session 38 American Journal of Computational Linguistics, Volumeg, Number 1, January-March 1983"]}]}