{"sections":[{"title":"","paragraphs":["The FINITE STRING Newsletter Announcements Announcements Carl Engelman Memorial Fund Carl Engelman, one of the pioneers in artificial intelligence research, died of a heart attack at his home in Cambridge, Massachusetts, on November 26, 1983. He was the creator of MATHLAB, a program developed in the 1960s for the symbolic manipulation of mathematical expressions. His objective there was to supply the scientist with an interactive computational aid of a \"more intimate and liberating nature\" than anything available before. Many of the ideas generated in the development of MATHLAB have influenced the architecture of other systems for symbolic and algebraic manipulation.","Carl graduated from the City College of New York and then earned an MS Degree in Mathematics at the Massachusetts Institute of Technology. During most of his professional career, he worked at The MITRE Corporation in Bedford, Massachusetts. In 1973 he was on leave as a visiting professor at the Institute of Information Science of the University of Turin, under a grant from the Italian National Research Council.","At the time of his death, Carl was an Associate Department Head at MITRE, responsible for a number of research projects in artificial intelligence. His best known recent work was KNOBS, a knowledge-based system for interactive planning that was one of the first expert systems applied productively to military problems. Originally developed for the Air Force, KNOBS was then adapted for a Navy system and is currently being used in two NASA applications. Other activities under his direction included research on natural language understanding and automatic programming.","Carl published a number of papers in journals and books and gave presentations at many conferences. But he also illuminated every meeting he attended with his incisive analysis and his keen wit. While he will be remembered for his contributions to artificial intelligence, those who knew him personally will deeply miss his warmth and humor, which he generously shared with so many of us. Carl was particularly helpful to people who had professional problems or faced career choices; his paternal support, personal sponsorship, and private intervention made significant differences for many of his colleagues.","Carl was a member of the American Association for Artificial Intelligence, the American Institute of Aeronautics and Astronautics, the American Mathematical Society, the Association for Computational Linguistics, and the Association for Computing Machinery and its Special Interest Group on Artificial Intelligence.","Contributions to the \"Carl Engelman Memorial Fund\" should be sent to Judy Clapp at The MITRE Corporation, Bedford, Massachusetts 01730. A decision will be made later on how those funds will be used. 13 13 13 International Machine Translation Conference An \"International Conference on the Methodology and Techniques of Machine Translation (Processing from Words to Language)\" will be held 13-15 February 1984 at Cranfield Institute of Technology in England. It is organised by the Cranfield Institute in conjunction with the Natural Language Translation Specialist Group of the British Computer Society. The emphasis in the Conference will be on analytic and software techniques of MT, illustrated where possible by computer demonstrations of working MT systems. For further information, contact Douglas Clarke Department of Mathematics Cranfield Institute of Technology Cranfield, Bedford MK43 0AL, England. 13 13 13 A New Society and Journal for CAI CALICO (Computer-Assisted Language Learning and Instruction Consortium) has just been established as a scientific and professional society for people interested in that field. It will issue a quarterly, called CALICO JOURNAL; will be developing a data base to be accessed via computer printout, microfiche, floppy discs, and telephone modems; and will be holding annual meetings. The 1984 CALICO Symposium will be held in Columbia, Maryland, on 23-24 January 1984. Membership dues for individuals are $25 US and $35 outside of US; for institutions $50 US and $60 outside of US; and for corporations $100 US and $110 outside of US. For further information, contact CALICO 229 KBM Brigham Young University Provo, UT 84602, USA (telephone: 801:378-6533). 13 13 13 Call for Papers - IFAC"]},{"title":"Workshop","paragraphs":["The International Federation of Automatic Control (IFAC) has put out its first announcement and call for papers for the IFAC/IFORS/IFIP International Workshop on Artificial Intelligence in Economics and Management. 202 American Journal of Computational Linguistics, Volume 9, Numbers 3-4, July-December 1983 The FINITE STRING Newsletter Announcements SCOPE This workshop - to be help 12-14 March 1985, ETHZ, Zurich (Switzerland) - will be devoted to research, applications of artificial intelligence and pattern recognition in the area of economic and management studies, as well as banking and finance. Original methods, case studies, new applications, specific AI tools (hardware and software) will be presented and discussed. The aim of the workshop is both to highlight the state of the art in the field and to explore the most promising areas for further research and applications of AI in economics, management, and finance. WORKSHOP ADDRESS All correspondence should be sent to: L. F. Pau IFAC Workshop Battelle Memorial Institute 7, route de Drize CH- 1227 Carougc/Geneva SWITZERLAND Telephone: (41) (22) 43 98 31 Telex: 423 472 batel ch. SYMPOSIUM LANGUAGE The official workshop language is English. No simultaneous translation will be provided.","PAPERS AND COPYRIGHT","• The abstract (2 pages) should be submitted in English, typed single spaced, with 1 cm margins, on standard A4 paper. The top part should include, in this order: title of the paper, author(s) name(s) and affiliation(s), address(es). The title of the paper should be typed in capital letters, 4 cm below the top of the page and centered. Bibliographical references (maximum 4) are recommended. One original will be required with five reproductions. All registered participants will receive one volume of abstracts.","• It is planned to have Proceedings published in book form by Pergamon Press. Only papers that have actually been accepted, presented at the workshop, submitted in full length by the authors thereafter, and reviewed, will be included in the Proceedings. Only unpublished papers may be submitted. IFAC holds the copyright for publication of the papers.","• Accepted papers are considered to have been submitted for possible publication in the IFAC journal AUTOMATICA.","TIME SCHEDULE • Abstract submission in six copies (one original, five reproductions); see procedure above: -- 1 August 1984 • Case studies with documentation: -- 1 October 1984 • Final acceptance: -~ 1 December 1984 • Registration deadline for all participants:","1 February 1985 • Workshop: -~ 12-14 March 1985 • Submission of full papers for Proceedings: -~ 15 May 1985. 13 13 I:I Call for Papers - Workshop on Transportable Natural Language Processing The Computer Science Department of Duke University, in cooperation with the Association for Computational Linguistics, is organizing a Workshop on Transportable Natural Language Processing, to be held October 22-23, 1984. Funding is being provided by the National Science Foundation, and the workshop will include both invited and contributed presentations. The focus will be on problems, both theoretical and implementational, that arise when one seeks to adapt an existing natural language processor for a new application, for example, to operate with new types of data. An edited collection of papers based on workshop presentations will appear either in book form or as one or more special journal sections. Persons wishing to participate should send 3 copies of a 5-page summary for a talk, or a 2-page position statement for a panel session, to be received no later than July 31 to Dr. Bruce Ballard Dept. of Computer Science Duke University Durham, N.C. 27705 All submissions will be read by at least two invited participants, and contributors will be notified as to acceptance by September 7. Further information may be obtained by writing to the address above, by calling (919) 684-3048, or by sending mail on csnet to bwb@duke. ACL Sessions at NCC '84 Location: Las Vegas Time: Thursday morning, July 12 Two companion sessions on Computers That Understand English have been organized by the Association for Computational Linguistics: American Journal of Computational Linguistics, Volume 9, Numbers 3-4, July-December 1983 203 The FINITE STRING Newsletter Announcements Interfaces to Software Systems As more and more people use computers every day, it becomes increasingly important to make computers respond to commands and questions in English. This session will present the state of the art in natural language interfaces: Texas Instruments' Natural Language Menu System, Berkeley's UC (Unix Consultant System that explains UN1X 1 to its users), Duke's Layered Domain Class interface that can be retargeted for any system from data bases to desk calendars, and the UCLA system that is ready to argue at any time.","Session Organizer and Chair: Martha W. Evens, Illinois Institute of Technology","A Menu-Based Approach to Natural Language Interfaces Harry Tennant, Texas Instruments","An Analysis of Protocols Used in Writing Between Users and Computer Consultants David N. Chin, University of California, Berkeley","Transportable English-Language Processing for Office Environments Bruce W. Ballard, Duke University","Really Arguing with Your Computer in Natural Language Margot Flowers, University of California, Los Angeles (All four papers have been accepted for inclusion in the Proceedings.) 1 Trademark of Bell Laboratories. Aids to Document Preparation Now that text editors, formatters, and rudimentary spelling correction facilities have become available for large and small computing environments, users are beginning to want more"]},{"title":"natural","paragraphs":["means of creating, reviewing, and improving various kinds of documents and similar text files. This session focuses on techniques that enable computer systems to recognize the syntactic structure and understand at least some of the meaning of English texts. Its purpose is to communicate recent developments in applied natural language processing where English acts as the"]},{"title":"object","paragraphs":["of attention. The companion session (see above) considers systems where English acts as an"]},{"title":"interface","paragraphs":["to software services.","Session Organizer and Chair: Bruce W. Ballard, Duke University","Text Critiquing with the EPISTLE System Lance Miller/George Heidorn/Karen Jensen, IBM Thomas J. Watson Research Center","Introducing VIPS: A Voice-Interactive Processing System for Document Management Alan Biermann, Duke University","Experience with the Writer's Workbench {WWB} Nina MacDonald/Larry Frase, Bell Labs","Automatic Creation of Stereoptypic Legal Documents James Sprovol, Illinois Institute of Technology 204 American Journal of Computational Linguistics, Volume 9, Numbers 3-4, July-December 1983"]}]}