{"sections":[{"title":"Multilevel\\b\\tor\\fus\\banalysis:\\bgenerating\\band\\bquerying\\ban\\bAGset\\bof\\bs\\foken\\bItalian\\b (S\\fIt-MDb).\\b Renata\\bSavy*,\\bFran\\tes\\to\\bCutugno,̂\\bClaudia\\bCro\\t\\to*\\b","paragraphs":["*Dept. \\b\\t Li\\fguistic a\\fd Literature, U\\fiversity \\b\\t Saler\\f\\b, Italy ̂Dept. \\b\\t Physical Scie\\fces, U\\fiversity “Federic\\b II”, Naples, Italy","*Via P\\b\\fte D\\b\\f Melill\\b, 84084, Fiscia\\f\\b (SA)- Italy","Ĉ\\bmpless\\b U\\fiversitari\\b di M\\b\\fte S.A\\fgel\\b, Via Ci\\fthia, 80126, Nap\\bli, Italy rsavy@u\\b\\tsa.\\tt, \\futug\\bo@\\ba.\\t\\bf\\b.\\tt, \\f\\fro\\f\\fo@u\\b\\tsa.\\tt","Abstra\\tt\\b I\\f this paper we prese\\ft a\\f applicati\\b\\f \\b\\t AGTK t\\b a c\\brpus \\b\\t sp\\bke\\f Italia\\f a\\f\\f\\btated at ma\\fy di\\t\\tere\\ft li\\fguistic levels. The w\\brk c\\b\\fsists \\b\\t tw\\b parts: a) the prese\\ftati\\b\\f \\b\\t AG-SpIt, a t\\b\\blkit dev\\bted t\\b c\\brpus data ma\\fageme\\ft that we devel\\bped acc\\brdi\\fg t\\b AGTK pr\\bp\\bsals; b) the prese\\ftati\\b\\f \\b\\t c\\brpus’ structure t\\bgether with s\\bme examples a\\fd results \\b\\t cr\\bss-level li\\fguistic a\\falyses \\bbtai\\fed queryi\\fg the database (SpIt-MDb). As this w\\brk is still a\\f \\b\\fg\\bi\\fg i\\fvestigati\\b\\f, results must be c\\b\\fsidered prelimi\\fary, as a ‘dem\\b’ illustrati\\fg the p\\bte\\ftiality \\b\\t the t\\b\\bl a\\fd the adva\\ftages it i\\ftr\\bduces t\\b validate li\\fguistic the\\bries a\\fd a\\f\\f\\btati\\b\\f systems. Curre\\ftly, SpIt-MDb is a li\\fguistic res\\burce u\\fder devel\\bpme\\ft; it represe\\fts \\b\\fe \\b\\t the \\tirst attempts t\\b create a\\f Italia\\f c\\brpus labelled at vari\\bus li\\fguistic levels (\\tr\\bm ac\\bustic/sub-ph\\b\\fetic, t\\b textual/pragmatic \\b\\fes) which ca\\f be queried i\\f the i\\fterrelati\\b\\fs am\\b\\fg levels. "]},{"title":"1. Introdu\\ttion\\b\\b","paragraphs":["As stated by Bird & Harri\\fgt\\b\\f’s Edit\\brial (2001), a\\f\\f\\btated c\\brp\\bra pr\\bvide a li\\fk betwee\\f speech a\\fd la\\fguage tech\\f\\bl\\bgy research, a\\fd li\\fguistics. C\\brp\\bra are gr\\bwi\\fg i\\f dime\\fsi\\b\\f a\\fd their \\tuture usability will depe\\fd \\b\\f the p\\bssibility t\\b have t\\b\\bls pr\\bperly pr\\bjected t\\b supp\\brt their ge\\ferati\\b\\f, a\\f\\f\\btati\\b\\f, ma\\fageme\\ft a\\fd queryi\\fg. Particular atte\\fti\\b\\f has t\\b be paid i\\f the devel\\bpme\\ft \\b\\t well structured databases i\\f which i\\f\\t\\brmati\\b\\f retrieval c\\buld be easy \\t\\br tasks as multilevel li\\fguistic a\\falysis."]},{"title":"1.1. The\\bAGTk\\btheori\\tal\\bframework\\b\\b","paragraphs":["It is widely accepted that A\\f\\f\\btati\\b\\f Graphs (AG) i\\ftr\\bduced \\few imp\\brta\\ft te\\fde\\fcies i\\f the \\tield \\b\\t speech c\\brp\\bra a\\f\\f\\btati\\b\\f. The sta\\fdard pr\\bp\\bsed by Bird a\\fd c\\blleagues (Bird & Liberma\\f, 2001; Maeda et al., 2002) c\\b\\ftributes t\\b the s\\bluti\\b\\f \\b\\t ma\\fy pr\\bblems a\\t\\tecti\\fg \\t\\brmal descripti\\b\\fs \\b\\t multi-level a\\f\\f\\btati\\b\\f \\tramew\\brk as lack \\b\\t li\\fearity, i.e. the missed temp\\bral c\\brresp\\b\\fde\\fce betwee\\f speech eve\\fts a\\fd li\\fguistic u\\fits, di\\t\\ticulties i\\f the de\\ti\\fiti\\b\\f \\b\\t a pr\\bper li\\fguistic hierarchy am\\b\\fg a\\f\\f\\btati\\b\\f levels, u\\fi\\ticati\\b\\f \\b\\t di\\t\\tere\\ft a\\f\\f\\btati\\b\\f sta\\fdards a\\fd/\\br cr\\bss-re\\tere\\fce am\\b\\fg di\\t\\tere\\ft metadata systems.","Eve\\f i\\t the questi\\b\\f \\b\\t which c\\buld be the \\bptimal queryi\\fg system remai\\fs u\\fa\\fswered, i\\f\\t\\brmati\\b\\f retrieval is widely a\\fd easily practicable b\\bth usi\\fg xml queryi\\fg t\\b\\bls like XQL \\br XQuery a\\fd SQL versi\\b\\f \\b\\t the AGsets, especially whe\\f the c\\bmplexity \\b\\t the query \\talls i\\ft\\b a set \\b\\t well de\\ti\\fed use cases withi\\f the AG \\t\\brmal \\tramew\\brk.","A \\turther imp\\brta\\ft \\teature that all\\bws a wide a\\fd \\tructu\\bus use \\b\\t the AG sta\\fdard \\t\\br a\\f\\f\\btati\\b\\f is the p\\bssibility t\\b imp\\brt previ\\busly c\\bllected data, \\t\\brmatted acc\\brdi\\fg t\\b di\\t\\tere\\ft speci\\ticati\\b\\f, i\\ft\\b AG-xml. The AG T\\b\\blkit pr\\bvides users with ma\\fy primitives \\t\\br the direct c\\b\\fversi\\b\\f \\tr\\bm ma\\fy usual \\t\\brmats \\b\\t a\\f\\f\\btati\\b\\f t\\b AG, h\\bwever ge\\ferati\\b\\f \\b\\t \\few scripts, speci\\tically pr\\bduced t\\b i\\fclude i\\f the graphs \\few data with u\\fusual structure, is \\f\\bt a di\\t\\ticult task."]},{"title":"1.2. AGTk\\band\\b\\tor\\fora\\bof\\bs\\foken\\bItalian\\b(S\\fIt)\\b","paragraphs":["Sp\\b\\fta\\fe\\bus speech c\\brp\\bra c\\bllecti\\b\\f has bec\\bme a maj\\br task i\\f Italia\\f li\\fguistic research \\b\\fly i\\f the rece\\ft years. Several pr\\bjects, ra\\fgi\\fg i\\f the last decade a\\fd i\\fv\\blvi\\fg ma\\fy Italia\\f u\\fiversities, have lead t\\b the pr\\bducti\\b\\f \\b\\t a c\\b\\fsiderable am\\bu\\ft \\b\\t a\\f\\f\\btated speech materials, i\\f \\brder t\\b \\b\\t\\ter the scie\\fti\\tic c\\bmmu\\fity the data a\\fd the t\\b\\bls \\fecessary t\\b carry \\b\\f multi-level a\\falysis \\b\\f sp\\bke\\f Italia\\f. The a\\f\\f\\btati\\b\\f guideli\\fes a\\fd the de\\ti\\fiti\\b\\f \\b\\t data architecture have s\\bmetimes bee\\f re\\ti\\fed \\tr\\bm a pr\\bject t\\b the \\t\\bll\\bwi\\fg. I\\f \\bther cases, \\few data have bee\\f pr\\bduced that ca\\f\\f\\bt be directly i\\ftegrated with the previ\\busly c\\bllected \\b\\fes. Give\\f this \\f\\bt u\\fusual sce\\fari\\b, the \\t\\brmal \\tramew\\brk pr\\bp\\bsed by Bird a\\fd c\\blleagues seems t\\b be ideal t\\b preve\\ft \\turther data dispersi\\b\\f a\\fd t\\b guara\\ftee c\\bmpatibility betwee\\f already c\\bllected data a\\fd a\\f\\f\\btated materials that will be added i\\f the \\tuture t\\b the Italia\\f repert\\bire \\b\\t speech c\\brp\\bra.","I\\f particular, i\\f \\bur research, we decided t\\b experie\\fce AG meth\\bd \\b\\f a small sample \\b\\t speech materials c\\bllected a\\fd updated i\\f vari\\bus phases withi\\f the \\trame \\b\\t several \\fati\\b\\fal pr\\bjects1",". I\\f the CLIPS pr\\bject (C\\brp\\bra e Lessici di Italia\\f\\b Parlat\\b e Scritt\\b), a large c\\brpus was partially c\\bded at di\\t\\tere\\ft segme\\ftal levels (i.e. ac\\bustic, ph\\b\\fetic, ph\\b\\f\\bl\\bgical, lexical). The c\\brpus c\\b\\ftai\\fed a great am\\bu\\ft \\b\\t task-\\brie\\fted dial\\bgues (i.e. Map Task a\\fd Sp\\bt the Di\\t\\tere\\fce dial\\bgues; A\\fders\\b\\f et al. 1992, Pea\\f et al.,1993). I\\f the IPa\\b pr\\bject (Italia\\f\\b Parlat\\b), \\b\\fe \\b\\t the CLIPS dial\\bgues was pr\\bvided with \\bther a\\f\\f\\btati\\b\\fs, \\t\\br i\\fsta\\fce at the sy\\ftactic, pr\\bs\\bdic, a\\fd i\\f\\t\\brmati\\b\\f levels (Alba\\f\\b Le\\b\\fi & Gi\\brda\\f\\b 2006), i\\f \\brder t\\b get a better c\\bmprehe\\fsi\\b\\f \\b\\t the li\\fguistic dy\\famics \\b\\t speech thr\\bugh a cr\\bss-level a\\falysis. Further"]},{"title":"\\g \\g","paragraphs":["1 The pr\\bjects (\\tu\\fded by the academic i\\fstituti\\b\\fs i\\fv\\blved, the Italia\\f g\\bver\\fme\\ft a\\fd/\\br the EU) were c\\b-\\brdi\\fated by the U\\fiversity \\b\\t Naples. The c\\brpus will be s\\b\\b\\f available \\tree at \\t\\t\\t.c\\fips.unina.it."]},{"title":"1654","paragraphs":["a\\f\\f\\btati\\b\\fs (at the syllabic, m\\brph\\bsy\\ftactic a\\fd pragmatic levels) \\b\\t \\bther dial\\bgues have bee\\f rece\\ftly pr\\bvided, \\br are curre\\ftly i\\f pr\\bgress (Castag\\fet\\b et al, \\t\\brthc\\bmi\\fg; Savy & V\\bghera, \\t\\brthc\\bmi\\fg).","Alt\\bgether, we have 3 dial\\bgues a\\fd 13 a\\f\\f\\btati\\b\\f levels (a\\fd \\bthers ca\\f be added). All a\\f\\f\\btati\\b\\fs \\t\\bll\\bw speci\\tic criteria, re\\tlecti\\fg the\\bretical assumpti\\b\\fs a\\fd resp\\b\\fdi\\fg t\\b c\\bdi\\fg sta\\fdards. Furtherm\\bre, each a\\f\\f\\btati\\b\\f level selects its \\bw\\f base u\\fit, depe\\fdi\\fg \\b\\f li\\fguistic \\tact\\brs (see bel\\bw, § 3.1)","The pil\\bt study prese\\fted here is part \\b\\t a third pr\\bject, called ‘Pa\\b\\fa\\be ita\\fiano’ (V\\bghera & Cutug\\f\\b, i\\f this v\\blume), a\\fd it c\\b\\fstitutes the basis \\t\\br \\turther impleme\\ftati\\b\\fs \\b\\t the database thr\\bugh multilevel labelli\\fg \\b\\t a larger sample2",". The pr\\bject aims at creati\\fg, \\b\\f the I\\fter\\fet, a p\\brtal dev\\bted t\\b sp\\bke\\f Italia\\f. The web site will c\\b\\ftai\\f c\\brp\\bra, t\\b\\bls \\t\\br the aut\\bmatic speech a\\falysis a\\fd qua\\ftitative li\\fguistic studies. SpIt-MDb (see bel\\bw) will be subseque\\ftly impleme\\fted a\\fd devel\\bped, a\\fd it will be \\b\\fe \\b\\t the t\\b\\bls available thr\\bugh the p\\brtal."]},{"title":"2. Software\\bdevelo\\fment\\b","paragraphs":["O\\f the basis \\b\\t this \\tramew\\brk we impleme\\fted a \\few","t\\b\\bl \\t\\br the ge\\ferati\\b\\f \\b\\t AGsets, the visualizati\\b\\f \\b\\t","speech data t\\bgether with relative a\\f\\f\\btati\\b\\f a\\fd","i\\f\\t\\brmati\\b\\f retrieval \\teatures. The AG-SpIT (AG-Sp\\bke\\f","Italia\\f T\\b\\bl) is a\\f i\\ftegrated s\\b\\ttware e\\fvir\\b\\fme\\ft","prese\\fti\\fg a\\f architecture based \\b\\f \\tive mai\\f m\\bdules: 1) a conve\\bte\\b which \\bperates \\b\\f a\\f\\f\\btati\\b\\fs a\\fd labeli\\fg usually c\\bded i\\f TIMIT \\t\\brmat, i\\fcludi\\fg temp\\bral i\\f\\t\\brmati\\b\\f (such as ph\\b\\fetics, syllabic, pr\\bs\\bdic, etc.), a\\fd \\butputs a c\\bmplete AGset i\\f XML \\t\\brmat; 2) a modifie\\b able t\\b add t\\b the previ\\busly ge\\ferated AGset a\\f\\f\\btati\\b\\fs \\f\\bt directly time-depe\\fde\\ft (such as P\\bS taggi\\fg, sy\\ftactic a\\fd pragmatic labelli\\fg); 3) a pa\\bse\\b accepti\\fg as i\\fput the AGset a\\fd pr\\bduci\\fg a\\f equivale\\ft SQL database (SpIt-MDb), 4) a m\\bdi\\tied versi\\b\\f \\b\\t Wavesu\\bfe\\b, i\\f which a\\f\\f\\btati\\b\\f data i\\fcluded i\\ft\\b the AGset ca\\f be sh\\bwed i\\f a multiple \\trame e\\fvir\\b\\fme\\ft t\\bgether with the speech wave\\t\\brm a\\fd with the typical sig\\fal a\\falysis t\\b\\bls; 5) a Que\\by Gene\\bato\\b \\bperati\\fg \\b\\f the SQL database i\\f \\brder t\\b retrieve a\\fd \\bbserve data c\\brrelati\\b\\fs am\\b\\fg the vari\\bus li\\fguistic levels \\b\\t a\\f\\f\\btati\\b\\f available. Next sub-secti\\b\\fs will describe i\\f details m\\bdules a\\fd the e\\fvir\\b\\fme\\ft \\teatures."]},{"title":"2.1. First\\bmodule:\\bTIMIT\\b\\tonverter\\b","paragraphs":["The \\tirst m\\bdule c\\b\\fsists \\b\\t a set \\b\\t scripts t\\b c\\b\\fvert TIMIT \\tiles i\\f a u\\fique XML AGset. Each i\\fput \\tile is usually ass\\bciated t\\b a level \\b\\t a\\f\\f\\btati\\b\\f; i\\f each \\tile, c\\buples \\b\\t time marker are biu\\fiquely ass\\bciated t\\b a label acc\\brdi\\fg t\\b the \\t\\brmat:"," sta\\bt time end time label  Temp\\bral markers are \\f\\bt used as cr\\bss-re\\tere\\fce","am\\b\\fg the vari\\bus a\\f\\f\\btati\\b\\f levels, i.e. all temp\\bral"]},{"title":"\\g \\g","paragraphs":["2 The pr\\bject is c\\b-\\brdi\\fated by the U\\fiversity \\b\\t Saler\\f\\b. a\\f\\f\\btati\\b\\fs are u\\fbi\\fded, \\turtherm\\bre levels are \\f\\bt expected t\\b respect a\\fy alig\\fme\\ft rule.","I\\f \\bur c\\brpus, sub-ph\\b\\fic eve\\fts, ph\\b\\fic seque\\fce, w\\brd seque\\fces (\\brth\\bgraphic a\\fd “sta\\fdard ph\\b\\f\\bl\\bgical” tra\\fscripti\\b\\fs), i\\ft\\b\\fati\\b\\fal labelli\\fg, etc. are examples \\b\\t TIMIT a\\f\\f\\btati\\b\\fs. This m\\bdule uses the AG library. A user-guided i\\fter\\tace is built i\\f \\brder t\\b \\tacilitate the c\\b\\fversi\\b\\f t\\b pe\\bple \\f\\bt ma\\fagi\\fg s\\b\\ttware c\\bdes. The resulti\\fg AGset is c\\bmpletely c\\bmpatible with the AG sta\\fdards."]},{"title":"2.2. Se\\tond\\bmodule:\\bAGset\\bmodifier\\b","paragraphs":["The sec\\b\\fd m\\bdule adds \\few a\\f\\f\\btati\\b\\fs t\\b the AGset created usi\\fg the previ\\bus \\b\\fe. It is speci\\tically th\\bught \\t\\br XML a\\f\\f\\btati\\b\\f derivi\\fg \\tr\\bm c\\brpus a\\falyses that are, at least i\\f pri\\fciple, \\f\\bt time-depe\\fde\\ft (as sy\\ftactic, m\\brph\\bsy\\ftactic, pragmatic, etc.). Our aim is t\\b attempt a (s\\bmetimes pr\\bblematic) temp\\bral alig\\fme\\ft betwee\\f speech sig\\fal a\\fd li\\fguistic structures listed i\\ft\\b these a\\f\\f\\btati\\b\\fs.","The m\\bdule accepts as i\\fput the XML a\\f\\f\\btati\\b\\f \\tile a\\fd the AGset, a\\fd \\butputs the updated AGset. Temp\\bral i\\f\\t\\brmati\\b\\f are usually retrieved \\tr\\bm the seque\\fce \\b\\t w\\brd markers already prese\\ft i\\f the AG \\tile li\\fki\\fg t\\b TIMIT \\tiles c\\b\\ftai\\fi\\fg w\\brds. H\\bwever, adjustme\\fts are \\feeded whe\\f the c\\brresp\\b\\fde\\fce betwee\\f li\\fguistic c\\b\\fstitue\\fts a\\fd w\\brd seque\\fces is \\f\\bt biu\\fique (as \\b\\tte\\f it happe\\fs i\\f sy\\ftactic a\\f\\f\\btati\\b\\f), a\\fd whe\\f the c\\b\\fstitue\\ft d\\bmai\\f i\\fv\\blves \\b\\fly w\\brd parts (like m\\brphemes i\\f m\\brph\\bsy\\fctactic a\\f\\f\\btati\\b\\f; see bel\\bw §3.1). A rep\\brt is pr\\bduced at every step \\b\\t the update pr\\bcess. The rep\\brt has the duplex \\tu\\fcti\\b\\f t\\b i\\fdicate err\\brs a\\fd/\\br misalig\\fme\\fts betwee\\f the di\\t\\tere\\ft levels \\b\\t a\\f\\f\\btati\\b\\fs that the pr\\bgram c\\bmpares, a\\fd t\\b list all the cases i\\f which pr\\bblems \\f\\bt depe\\fdi\\fg \\b\\f the meth\\bd arise.","Acc\\brdi\\fg t\\b C\\btt\\b\\f & Bird (2002) recursive paths typically pr\\bduced i\\f sy\\ftactic a\\f\\f\\btati\\b\\fs have bee\\f represe\\fted withi\\f the AGxml d\\bcume\\ft maki\\fg use \\b\\t equivale\\fce classes.","A\\f ambiti\\bus \\tuture aim is the creati\\b\\f \\b\\t a u\\fiversal c\\b\\fverter able t\\b “read” the l\\bcal grammar \\b\\t the a\\f\\f\\btati\\b\\f \\tile (\\t\\br example usi\\fg its related DTD) a\\fd t\\b parse it \\b\\f the basis \\b\\t a set \\b\\t user requireme\\fts."]},{"title":"2.3. Third\\bmodule:\\bAGset\\b\\farser\\b","paragraphs":["The third m\\bdule, maki\\fg a wide use \\b\\t AGLib, parses the XML AGset a\\fd pr\\bduces a\\f SQL database wh\\bse c\\b\\fceptual m\\bdel respects the sta\\fdard pr\\bp\\bsed by Bird. The DBMS ch\\bse\\f is the \\bpe\\f s\\burce MySQL. It \\b\\t\\ters, am\\b\\fg \\bther use\\tul t\\b\\bls, a\\f IDE i\\f which it is p\\bssible t\\b execute SQL queries, a\\fd it has primitives \\t\\br Tcl-Tk \\t\\br the devel\\bpme\\ft \\b\\t database ma\\fageme\\ft s\\b\\ttware. C\\b\\f\\fecti\\b\\fs t\\b database, multiple access t\\b di\\t\\tere\\ft subc\\brp\\bra, back-up pr\\bcedures are directly ma\\fageable withi\\f the s\\b\\ttware i\\ftegrated e\\fvir\\b\\fme\\ft."]},{"title":"1655","paragraphs":["Figure 1  Figure 2  "]},{"title":"2.4. Fourth\\b module:\\b gra\\fhi\\t\\b and\\b audio\\b environment\\b","paragraphs":["The \\t\\burth m\\bdule is based \\b\\f the c\\bre \\b\\t Wavesur\\ter i\\ftegrated with a set \\b\\t t\\b\\bls that all\\bw us t\\b per\\t\\brm vari\\bus \\bperati\\b\\f \\b\\f the AGset: we ca\\f select \\b\\fe \\br m\\bre AG \\tr\\bm the AGset, visualize relative ac\\bustic wave\\t\\brm, ch\\b\\bse which a\\f\\f\\btati\\b\\f level we wa\\ft t\\b add i\\ft\\b the pa\\fes, visualize i\\fsta\\ft eve\\ft p\\bi\\fti\\fg directly t\\b the wave\\t\\brm, a\\fd s\\b \\b\\f. Multiple audi\\b tracks a\\fd relative a\\f\\f\\btati\\b\\fs ca\\f be c\\b\\ftemp\\brarily prese\\fted t\\b the user. All the speech a\\falysis t\\b\\bls available via the S\\fack library i\\f the Wavesur\\ter c\\b\\ftext are available i\\f \\bur e\\fvir\\b\\fme\\ft t\\b\\b (see Fig. 1)."]},{"title":"2.5. Fifth\\bmodule:\\bquery\\bgenerator\\b","paragraphs":["AG data ca\\f be accessed by mea\\fs \\b\\t a guided user i\\fter\\tace i\\ftegrated i\\ft\\b the AG-SpIt e\\fvir\\b\\fme\\ft. The Query Ge\\ferat\\br requires the \\tilli\\fg \\b\\t a simple \\t\\brm; the resulti\\fg query pr\\bduces a request expressed i\\f a c\\b\\ftr\\blled \\t\\brm \\b\\t \\fatural la\\fguage. I\\f \\bther w\\brds, the user expresses a query c\\bmp\\bsi\\fg a se\\fte\\fce i\\f Italia\\f; all the c\\b\\fstitue\\fts \\b\\t this se\\fte\\fce are drive\\f by the i\\fter\\tace; the sema\\ftic c\\b\\fte\\ft \\b\\t the resulti\\fg uttera\\fce repr\\bduces a\\f arc-patter\\f c\\bmma\\fd \\t\\br the selecti\\b\\f \\b\\t the relative c\\brpus p\\brti\\b\\f, respecti\\fg the give\\f requests. Arc-patter\\fs are the pr\\bt\\btypical \\t\\brm \\b\\t query i\\f AG \\tramew\\brk: they pr\\bvide the user a way t\\b select li\\fguistic phe\\f\\bme\\fa taki\\fg i\\ft\\b acc\\bu\\ft the timeli\\fe devel\\bpme\\ft \\b\\t the ac\\bustic speech dy\\famics. Queries based \\b\\f arcpatter\\fs, i\\f their simplest \\t\\brm typically appear as:","First step:","select the sta\\bt and end instants (a\\fch\\brs), in a","specified annotation \\feve\\f","whe\\be the \\fabe\\f fie\\fd contains a given st\\bing","\\tnd\\f \\f show\\fothe\\b annotations [inc\\fuded] | [ove\\b\\fapped] | [coincident] | [etc] \\tith the p\\bevious one  Sec\\b\\fd step (*Klee\\fe cl\\bsure): Once you have obtained the \\fist of \\finguistic phenomena \\bequi\\bed in the fi\\bst step, show a\\f\\f sequences of non-specified \\fength of \\fabe\\fs of","any othe\\b \\feve\\f of annotation inc\\fuded in eve\\by","p\\bevious\\fy se\\fected item","","These queries w\\buld be s\\blved i\\f a relatively easy way usi\\fg AGQL (Bird et al., 2000) but, u\\f\\t\\brtu\\fately, \\f\\b practical impleme\\ftati\\b\\f \\t\\br this sta\\fdard is prese\\ftly available. Alter\\fatively, the use \\b\\t AG -> SQL c\\b\\fversi\\b\\f prese\\fts ma\\fy limitati\\b\\f especially \\t\\br what the *Klee\\fe cl\\bsure c\\b\\fcer\\fs.","Our system all\\bws the \\t\\brmulati\\b\\f \\b\\t queries as described i\\f the \\tirst step, i\\ftersecti\\fg tw\\b di\\t\\tere\\ft levels \\b\\t a\\f\\f\\btati\\b\\fs \\b\\f the basis \\b\\t their relative temp\\bral p\\bsiti\\b\\f \\bver the time li\\fe.","This ki\\fd \\b\\t query \\butputs a list \\b\\t labels a\\fd their relative temp\\bral exte\\fsi\\b\\fs (arcs). Because \\b\\t SQL limitati\\b\\fs, sec\\b\\fd step is the\\f p\\bssible \\b\\fly \\t\\br \\b\\fe arc at time a\\fd \\t\\br \\b\\fly \\b\\fe \\turther level: the i\\fter\\tace all\\bws si\\fgle li\\fe selecti\\b\\f i\\f the \\butput table a\\fd the i\\fdicati\\b\\f \\b\\t the level \\b\\t \\turther i\\fterest.","All the query results ca\\f be \\ti\\fally exp\\brted t\\bwards \\bther applicati\\b\\fs like SQL tables \\br MS-Excel."]},{"title":"3. Linguisti\\t\\ba\\f\\fli\\tations","paragraphs":["\\b This secti\\b\\f deals with several li\\fguistic applicati\\b\\fs \\b\\t AG-SpIT. Be\\t\\bre pr\\bceedi\\fg with these examples, we \\tirst brie\\tly illustrate h\\bw this t\\b\\bl ca\\f help t\\b deal with several aspects releva\\ft \\t\\br studyi\\fg sp\\b\\fta\\fe\\bus speech. "]},{"title":"1656 3.1. Preliminary\\bremarks\\b\\b","paragraphs":["Research has dem\\b\\fstrated that a multi-level appr\\bach ca\\f pr\\bvide a better u\\fdersta\\fdi\\fg \\b\\t b\\bth sp\\b\\fta\\fe\\bus speech a\\fd li\\fguistic \\brga\\fizati\\b\\f i\\f ge\\feral. Speech exhibits deep i\\fteracti\\b\\f am\\b\\fg di\\t\\tere\\ft li\\fguistic levels. The li\\fguistic structure i\\f sp\\b\\fta\\fe\\bus speech is str\\b\\fgly a\\t\\tected by the pressure \\b\\t pragmatic strategies, i\\fcludi\\fg the i\\f\\t\\brmati\\b\\f \\brga\\fizati\\b\\f \\b\\t disc\\burse (see \\t\\br i\\fsta\\fce Givò\\f, 1979; Halliday, 1967; V\\bghera, 1992; Cresti, 2000; Lambrecht, 1994). M\\bre\\bver, research \\b\\f speech has p\\bi\\fted \\but the crucial r\\ble pr\\bs\\bdy plays as a\\f i\\fter\\tace betwee\\f segme\\ftal a\\fd higher li\\fguistic levels a\\fd its i\\fv\\blveme\\ft i\\f sy\\ftactic a\\fd i\\f\\t\\brmati\\b\\f phrasi\\fg, \\t\\bcus marki\\fg, a\\fd disc\\burse structuri\\fg (Pierrehumbert & Hirschberg, 1990; va\\f D\\b\\fzel, 1999).","Obvi\\busly, the i\\fvestigati\\b\\f \\b\\t these cr\\bss-relati\\b\\fs requires a c\\bmplex ma\\fagi\\fg \\b\\t the data c\\b\\f\\fected t\\b di\\t\\tere\\ft levels \\b\\t a\\falysis. AG-SpIT all\\bws multi-level visualizati\\b\\f a\\fd queries that make the ma\\fageme\\ft \\b\\t cr\\bss-level li\\fguistic data easy a\\fd i\\ftuitive. Furtherm\\bre, as me\\fti\\b\\fed i\\f § 2, it is p\\bssible t\\b build a\\f \\bpe\\f database, i\\f which \\few data ca\\f be i\\fserted at a\\fy time.","The p\\bte\\ftiality \\b\\t the t\\b\\bl was tested \\b\\f a sample \\b\\t three dial\\bgues which were autonomous\\fy a\\f\\f\\btated at several li\\fguistic levels (c\\t. §1.2). All \\b\\t the c\\bdi\\fg \\t\\brmats used i\\f labelli\\fg are directly ma\\faged by AG-SpIt. The autonomy \\b\\t the a\\f\\f\\btati\\b\\f g\\bes t\\bgether with t\\b the de\\ti\\fiti\\b\\f \\b\\t autonomous coding units: i.e. base u\\fits used \\b\\f each li\\fguistic level were ch\\bse\\f i\\f agreeme\\ft with the\\bretical a\\fd tech\\fical premises releva\\ft \\t\\br that level. This mea\\fs that c\\bdi\\fg sta\\fdards a\\fd a\\f\\f\\btati\\b\\f u\\fits varied acr\\bss the di\\t\\tere\\ft levels c\\b\\fsidered.","Let us c\\b\\fsidered a\\f example c\\b\\fcer\\fi\\fg with the a\\f\\f\\btati\\b\\f \\b\\t the \\brth\\bgraphic (WRD), m\\brph\\bsy\\ftactic (P\\bS) a\\fd sy\\ftactic levels (SYNT). Alth\\bugh \\t\\br all \\b\\t these levels the releva\\ft c\\bdi\\fg u\\fit is i\\f \\tact the “w\\brd”, the de\\ti\\fiti\\b\\fs \\b\\t “w\\brd” ad\\bpted are \\f\\bt the same am\\b\\fg all a\\f\\f\\btati\\b\\fs. I\\f particular, the a\\f\\f\\btati\\b\\f \\b\\t graphic w\\brds such as “pre\\fdimi” (“take me” \\br “take \\t\\br me”; c\\bmp\\bsed \\b\\t a verb a\\fd a clitic particle) is di\\t\\tere\\ft \\b\\f the WRD a\\fd the P\\bS-SYNT level. O\\f the \\t\\brmer level the u\\fit “w\\brd” c\\brresp\\b\\fds t\\b a “ph\\b\\f\\bl\\bgical w\\brd”, while, \\b\\f the latter, it c\\brresp\\b\\fds t\\b a “m\\brph\\bl\\bgical w\\brd”. There\\t\\bre, the w\\brd “pre\\fdimi” c\\b\\fsists \\b\\t \\b\\fe u\\fit \\b\\f the WRD level (i.e. \\b\\fe ph\\b\\f\\bl\\bgical w\\brd), while it c\\b\\fsists \\b\\t tw\\b u\\fits (i.e. tw\\b m\\brph\\bl\\bgical w\\brds) \\b\\f the P\\bS-SYNT level."]},{"title":"3.2. Cross-level\\bqueries\\b\\b","paragraphs":["I\\f this secti\\b\\f we sh\\bw the results \\b\\t a \\fumber \\b\\t queries made with SpIt-MDb. I\\f these queries, pr\\bs\\bdy is take\\f as the p\\bi\\ft \\b\\t re\\tere\\fce, i\\f acc\\brda\\fce with its a\\t\\breme\\fti\\b\\fed r\\ble \\b\\t i\\fter\\tace am\\b\\fg di\\t\\tere\\ft li\\fguistic levels. As see\\f i\\f §2.1, The pr\\bs\\bdic c\\bdi\\fg had three di\\t\\tere\\ft levels:","1) the level \\b\\t the i\\ft\\b\\fati\\b\\f phrasi\\fg (TU b\\bu\\fdaries);","2) the level \\b\\t i\\ft\\b\\fati\\b\\f target p\\bi\\fts, c\\b\\ftai\\fi\\fg INTSINT t\\b\\fe labels (Hirst & Di Crist\\b, 1998);","3) the level \\b\\t acce\\ft degree, c\\b\\ftai\\fi\\fg pr\\bmi\\fe\\fce labels \\t\\br the lexical w\\brds i\\f the TU.","Table 1 sh\\bws the queries \\t\\br tw\\b \\br m\\bre li\\fguistic levels:","Table 1 Level\\finvolved\\fin\\fthe\\fque\\by\\fUnities\\f i\\ft\\b\\fati\\b\\f phrasi\\fg/lexical T(\\b\\fe) U(\\fit) / w\\brd i\\ft\\b\\fati\\b\\f phrasi\\fg/rhythmic TU /syl(lable) i\\ft\\b\\fati\\b\\f phrasi\\fg/segme\\ftal TU / ph\\b\\f(etic segme\\fts) sy\\ftactic/i\\ft\\b\\fati\\b\\f phrasi\\fg Cla(use)-ph(rase) / TU i\\ft\\b\\fati\\b\\f target p\\bi\\fts/ acce\\ftual /sy\\ftactic","T\\b\\fe labels / pr\\bmi\\fe\\fce","labels / sy\\ftactic ph","i\\ft\\b\\fati\\b\\f phrasi\\fg/i\\f\\t\\brmati\\b\\f","phrasi\\fg/sy\\ftax TU / I\\f\\t\\brmati\\b\\f U\\fit / sy\\ftactic ph","It is p\\bssible t\\b select \\t\\br each level a speci\\tic eleme\\ft t\\b be put i\\f relati\\b\\f with a\\f\\bther eleme\\ft \\tr\\bm a di\\t\\tere\\ft c\\bdi\\fg level. F\\br i\\fsta\\fce, \\b\\f the sy\\ftactic level, it is p\\bssible t\\b select the phrase \\br the clause as u\\fit, a\\fd put it i\\f relati\\b\\f with the TU \\br with the t\\b\\fal targets (INTSINT labels)."]},{"title":"3.3. Provisional\\blinguisti\\t\\bresults\\b\\b","paragraphs":["A detailed a\\falysis \\b\\t the li\\fguistic data which were gathered with SpIt-MDb, exceeds the g\\bal \\b\\t this pil\\bt study. H\\bwever, we \\bbtai\\fed s\\bme pr\\bvisi\\b\\fal results that are pr\\bmisi\\fg a\\fd that sh\\bw the t\\b\\bl's releva\\fcy \\t\\br li\\fguistic a\\falysis. Pri\\fcipally, \\bur results i\\fdicate a) the type \\b\\t data that ca\\f be gathered by the t\\b\\bl, a\\fd b) the cr\\bss-relati\\b\\fs existi\\fg betwee\\f di\\t\\tere\\ft li\\fguistic levels. I\\f t\\btal six queries \\b\\t i\\fcreasi\\fg c\\bmplexity were d\\b\\fe, which are prese\\fted here.","The \\tirst three queries give results c\\b\\fcer\\fi\\fg mi\\fimal, maximal a\\fd average \\fumber \\b\\t w\\brds, syllables a\\fd ph\\b\\fetic segme\\fts i\\f the TUs. They are \\butli\\fed i\\f Table 2:","Table 2","TU le\\fgth (eleme\\fts) Syl W\\brds Ph\\b\\f","Max Mi\\f Avg Max Mi\\f Avg Max Mi\\f Avg","25 1 4,5 15 1 4 50 1 10","I\\fteresti\\fgly, m\\bre tha\\f 50% \\b\\t TUs c\\bi\\fcide with a si\\fgle w\\brd (\\treque\\ftly m\\b\\f\\bsyllabic - max. 4 ph\\b\\fes): all these cases are typical sp\\b\\fta\\fe\\bus speech phe\\f\\bme\\fa such as dis\\tlue\\fcies, sel\\t-repairs, \\talse starts, \\tilled pauses, \\tragme\\fti\\fg the pr\\bs\\bdic c\\b\\fti\\fuity. H\\bwever, sh\\brt structures (3-10 syllables; 3-10 w\\brds) ge\\ferally prevail \\bver the l\\b\\fger \\b\\fes.","Fr\\bm the \\t\\burth query, s\\bme remarkable results \\b\\f the relati\\b\\fs betwee\\f clause a\\fd TU ca\\f be derived whe\\f c\\b\\f\\tr\\b\\fti\\fg them with previ\\bus studies \\b\\f the c\\brresp\\b\\fde\\fce betwee\\f TU a\\fd clauses (\\br \\bther sy\\ftactic structures; see \\t\\br i\\fsta\\fce Crystal 1969). Acc\\brdi\\fg t\\b S\\br\\fic\\bla (1981), i\\f sp\\b\\fta\\fe\\bus sp\\bke\\f Italia\\f TUs c\\brresp\\b\\fd m\\bstly t\\b “phrase-structured seque\\fces”; i\\f V\\bghera (1990) a\\fd Caput\\b (1991), i\\fstead, m\\bre tha\\f 45% \\b\\t the TU are said t\\b c\\b\\ftai\\f \\b\\fe clause. F\\br E\\fglish, a similar result is \\t\\bu\\fd i\\f Crutte\\fder\\f (1986).","I\\t we take the TU as piv\\bt i\\f the query (le\\tt side \\b\\t table 3), we get a picture \\b\\t the relati\\b\\fs betwee\\f sy\\ftactic a\\fd pr\\bs\\bdic c\\b\\fstitue\\fcy which is partly di\\t\\tere\\ft \\tr\\bm the \\b\\fe \\butli\\fed i\\f the ab\\bve me\\fti\\b\\fed w\\brks. I\\f \\tact, \\b\\fly 24% \\b\\t the TU c\\brresp\\b\\fd t\\b a clause. Furtherm\\bre, alm\\bst 40% \\b\\t the TU is c\\b-exte\\fsive with a sy\\ftactic c\\b\\fstitue\\ft smaller tha\\f a clause (i.e. \\b\\fe \\br m\\bre phrases). Our result is m\\bre i\\f li\\fe with S\\br\\fic\\bla (1981), eve\\f i\\t the c\\brresp\\b\\fde\\fce betwee\\f phrase-structured seque\\fces a\\fd TUs is \\t\\bu\\fd i\\f less tha\\f hal\\t \\bur sample."]},{"title":"1657","paragraphs":["Fi\\fally, \\b\\fly 2,6% \\b\\t the TUs is c\\bmp\\bsed \\b\\t m\\bre tha\\f \\b\\fe clause.","Table 3","TU\\b Clause\\b TU=cla 24.4% cla>TU 30.4% TU<cla 39.9% cla=TU 46.5% TU>cla 2.6% cla<TU 4.9% TU≠cla 33,1% cla≠TU 48.5%","The partial discrepa\\fcy betwee\\f \\bur results a\\fd th\\bse rep\\brted by \\bther auth\\brs ca\\f p\\bssibly be explai\\fed by the di\\t\\tere\\ft de\\ti\\fiti\\b\\fs \\b\\t t\\b\\fe u\\fits maybe used i\\f these studies, \\br by the type \\b\\t speech that was a\\falyzed (task \\brie\\fted vs. \\tace t\\b \\tace dial\\bgue etc.). H\\bwever, despite this discrepa\\fcy, the crucial relati\\b\\f betwee\\f clause a\\fd TU is c\\b\\f\\tirmed by the results \\b\\f the c\\brresp\\b\\fde\\fce betwee\\f clause a\\fd TU (right side \\b\\t table 3). I\\f \\tact, i\\t we reverse the perspective a\\fd take the clause as piv\\bt i\\f the query, we see that m\\bre tha\\f 46% \\b\\t the clauses c\\brresp\\b\\fd t\\b a TU. A 30% \\b\\t the clauses are \\turtherm\\bre spread \\bver m\\bre tha\\f \\b\\fe TU; \\ti\\fally, \\b\\fly ab\\but 5% \\b\\t the clauses are smaller tha\\f a TU. Overall, these results suggest that the TU \\treque\\ftly c\\brresp\\b\\fds t\\b a clause \\br t\\b a sy\\ftactic c\\b\\fstitue\\ft smaller tha\\f a clause (ab\\but 40% \\b\\t TUs c\\brresp\\b\\fd t\\b a phrase). O\\f the \\bther ha\\fd, the c\\brresp\\b\\fde\\fce betwee\\f TU a\\fd sy\\ftactic structure larger tha\\f a clause is rather u\\fusual. Give\\f this remarkable patter\\f, we believe it c\\buld be i\\fteresti\\fg t\\b \\turther i\\fvestigate this result i\\f \\tuture research.","The \\ti\\tth query i\\fv\\blves three li\\fguistics levels. It sh\\bws the sy\\ftactic l\\bcati\\b\\f \\b\\t the mai\\f stress i\\f the TU, a\\fd its p\\bssible c\\brresp\\b\\fde\\fce with a\\f i\\ft\\b\\fati\\b\\f target p\\bi\\ft. The data sh\\bw (c\\t. Table 4) that i\\f m\\bst i\\fsta\\fces the mai\\f stress c\\brresp\\b\\fds t\\b the l\\bwest (Bottom) \\br the highest (Top) pitch value i\\f the i\\ft\\b\\fati\\b\\f c\\b\\ft\\bur.","Table 4 a\\t\\tent\\b2\\b B\\b T\\b T\\bt 676 40.1%\\b 32.0%\\b VP\\b(verbal phrase)\\b 12.6% 8.9% 20.8% UNP\\b(u\\fpr\\bcessed)\\b 34.5%\\b 41.0% 19.4% REP\\b(repetiti\\b\\fs)\\b 4.4% 4.8% 3.2% PP\\b(prep\\bsiti\\b\\fal ph.)\\b 18.6%\\b 21.4% 19.4% PNP\\b(\\f\\bu\\f predicate ph)\\b 4.4% 5.5% 4.2% NP\\b(\\f\\bu\\f phrase)\\b 25.4%\\b 18.5% 32.9%","The m\\bst \\treque\\ft c\\bmbi\\fati\\b\\f li\\fks the B t\\b the mai\\f stress prese\\ft i\\f the TU. The c\\bmbi\\fati\\b\\f \\b\\t mai\\f stress a\\fd T is als\\b \\treque\\ft, while \\bther c\\bmbi\\fati\\b\\fs are relatively rare. Future research sh\\buld \\t\\bcus \\b\\f the p\\bsiti\\b\\f \\b\\t mai\\f stress a\\fd i\\ft\\b\\fati\\b\\f target p\\bi\\ft i\\f the TU.","Mai\\f stress is pred\\bmi\\fately l\\bcated \\b\\f sy\\ftactically “u\\fpr\\bcessed eleme\\fts”, i.e. is\\blated eleme\\fts (spatial a\\fd temp\\bral adverbs, c\\b\\fju\\fcti\\b\\fs a\\fd i\\fterjecti\\b\\fs) that d\\b \\f\\bt bel\\b\\fg t\\b a\\fy sy\\ftactic phrase (Cutug\\f\\b & V\\bghera 2004). The high c\\brrelati\\b\\f betwee\\f mai\\f stress a\\fd these phrase-exter\\fal eleme\\fts ca\\f be related t\\b the pr\\bs\\bdic aut\\b\\f\\bmy \\b\\t these “u\\fpr\\bcessed eleme\\fts”. I\\f \\tact, they are \\b\\tte\\f realized as aut\\b\\f\\bm\\bus TU (alm\\bst 67% \\b\\t the TU c\\b\\fsists \\b\\t a\\f “u\\fpr\\bcessed eleme\\ft”). As we said be\\t\\bre, m\\bst \\b\\t the “u\\fpr\\bcessed eleme\\fts” are spatial \\br temp\\bral adverbs. The\\f, their sy\\ftactic a\\fd pr\\bs\\bdic is\\blati\\b\\f ca\\f be easily related t\\b their \\tu\\fcti\\b\\f i\\f i\\f\\t\\brmati\\b\\f structure. Spatial a\\fd temp\\bral adverbs, i\\f \\tact, \\bccur at the begi\\f\\fi\\fg \\b\\t the uttera\\fce as t\\bpics. Mai\\f stress ca\\f als\\b be l\\bcated \\b\\f NP, a\\fd PP; the c\\bmbi\\fati\\b\\f betwee\\f mai\\f stress a\\fd VP is less \\treque\\ft. These data supp\\brt the idea that i\\f sp\\bke\\f Italia\\f, \\tr\\bm the pr\\bs\\bdic p\\bi\\ft \\b\\t view, VP is a weak c\\b\\fstitue\\ft (see \\t\\br i\\fsta\\fce Mar\\btta 1984, Caput\\b 1991, Savy, 2001). H\\bwever, i\\f task-\\brie\\fted dial\\bgues, deh\\b\\ftic VP very \\b\\tte\\f \\bccur at the begi\\f\\fi\\fg \\b\\t the clause a\\fd/\\br TU. Whe\\f a VP is acce\\fted, it is usually ass\\bciated with a T t\\b\\fe, very \\treque\\ft i\\f this p\\bsiti\\b\\f.","The sixth a\\fd last query i\\fv\\blves sy\\ftactic, pr\\bs\\bdic a\\fd i\\f\\t\\brmati\\b\\fal levels. First, we expl\\bred the relati\\b\\fs betwee\\f i\\f\\t\\brmati\\b\\f u\\fits, sy\\ftactic u\\fits a\\fd pr\\bs\\bdic phrasi\\fg. The\\f, the relati\\b\\fs betwee\\f sy\\ftax a\\fd pr\\bs\\bdy (t\\b\\fal targets a\\fd phrasi\\fg) i\\f t\\bpic u\\fits was a\\falysed m\\bre i\\f dept, taki\\fg i\\ft\\b acc\\bu\\ft b\\bth the level \\b\\t t\\b\\fal target a\\fd the level \\b\\t the pr\\bs\\bdic phrasi\\fg. Our results sh\\bw, i\\f agreeme\\ft with Gi\\brda\\f\\b & Cr\\bcc\\b (2006), that i\\f m\\bst cases the TU a\\fd the i\\f\\t\\brmati\\b\\f u\\fit b\\bu\\fdaries c\\bi\\fcide (69%); \\br that, at least, \\b\\fe \\b\\t the b\\bu\\fdaries \\b\\f \\b\\fe level c\\brresp\\b\\fds t\\b a b\\bu\\fdary \\b\\f the \\bther level (27%). The c\\bmplete lack \\b\\t c\\bi\\fcide\\fce i\\f the b\\bu\\fdaries \\b\\t the u\\fits \\b\\t the tw\\b levels is rather i\\f\\treque\\ft. There\\t\\bre the data supp\\brts the hyp\\bthesis \\b\\t a cl\\bse relati\\b\\fship betwee\\f i\\f\\t\\brmati\\b\\f a\\fd i\\ft\\b\\fati\\b\\f structure, alth\\bugh this sh\\buld \\f\\bt be u\\fderst\\b\\bd t\\b be a c\\bmplete ide\\ftity. The a\\falysis \\b\\t the i\\fterrelati\\b\\f betwee\\f i\\f\\t\\brmati\\b\\f u\\fits a\\fd sy\\ftactic phrases adds \\bther details t\\b this a\\falysis (see table 5).","Table 5","% NP PP VP UNP t\\bt","Topic 40,8 28,6 10,2 17,3 96,9","Comment 22,3 12,7 20,7 34,9 90,7","Appendix 19,2 29,5 19,2 26,7 94,5","Am\\b\\fg the i\\f\\t\\brmati\\b\\f u\\fits3",", the comment is the m\\bst \\treque\\ft. Fr\\bm the sy\\ftactic p\\bi\\ft \\b\\t view, it c\\brresp\\b\\fds usually t\\b a VP \\br NP, alth\\bugh \\bther realizati\\b\\fs (i.e. UNP a\\fd PP) are als\\b p\\bssible. Topics c\\brresp\\b\\fd \\f\\brmally t\\b \\f\\b\\f-verbal phrases (NP, PP a\\fd UNP): the c\\brresp\\b\\fde\\fce with VP is rather u\\fusual. Als\\b the appendix is usually \\f\\b\\f verbal: it c\\brresp\\b\\fds m\\bstly t\\b PPs; less c\\bmm\\b\\fly, it ca\\f be realised as NP \\br VP. Fr\\bm this a\\falysis, a regularity emerges b\\bth i\\f the relati\\b\\f betwee\\f pr\\bs\\bdic a\\fd i\\f\\t\\brmati\\b\\f phrasi\\fg, a\\fd i\\f the relati\\b\\f betwee\\f i\\f\\t\\brmati\\b\\fal r\\ble a\\fd sy\\ftactic realisati\\b\\f. A\\falysis \\b\\t the sy\\ftax a\\fd pr\\bs\\bdy \\b\\t t\\bpics gave rise t\\b \\bther i\\fteresti\\fg results. Ab\\but 86% \\b\\t the t\\bpics c\\brresp\\b\\fdi\\fg t\\b a NP \\br a PP have a t\\b\\fal target T (T\\bp) \\b\\f the head \\b\\t the phrase (see Cr\\bcc\\b & Savy, \\t\\brthc\\bmi\\fg). This ca\\f be explai\\fed by the \\tact that the t\\bpic u\\fits we c\\b\\fsidered \\bccur at the begi\\f\\fi\\fg \\b\\t the uttera\\fces (see ab\\bve), where the speaker’s pitch ra\\fge a\\fd the mel\\bdic m\\bveme\\fts are usually expa\\fded. Table 6 Syntactic Head’s","Tone T\\b\\fe Type % High T, H 31 Fa\\f\\fing TB, TL, TD, HB, HL, HD 42 Rising UT, ST, LT, BH, BU, LH, SU 13 Rising-fa\\f\\fing UTB, LTB, LHB, UTD, LTL 8 Fa\\f\\fino-\\bising TLH, TBH, HBU 3 F\\fat S 3"]},{"title":"\\g \\g","paragraphs":["3 F\\br a c\\bmplete sketch \\b\\t the the\\bry we re\\ter t\\b, see Cresti (2000)."]},{"title":"1658","paragraphs":["H\\bwever, i\\t we c\\b\\fsider the gl\\bbal mel\\bdic tre\\fds \\t\\bu\\fd \\b\\f th\\bse u\\fits (\\talli\\fg \\br risi\\fg m\\bveme\\fts), \\talli\\fg t\\b\\fes prevail, especially whe\\f the t\\bpic NP \\br PP c\\brresp\\b\\fds t\\b a TU. Risi\\fg t\\b\\fes are i\\fstead m\\bre \\treque\\ft \\b\\f t\\bpics smaller tha\\f a TU.","Further a\\falysis \\b\\t \\bther types \\b\\t speech c\\buld c\\bmplete this sketch."]},{"title":"4. Con\\tlusions","paragraphs":["\\b","Eve\\f i\\t this is \\b\\fly a prelimi\\fary study, e\\fc\\buragi\\fg results emerged.","First, \\bur impleme\\ftati\\b\\f \\b\\t AG was e\\t\\tective i\\f maki\\fg als\\b c\\bmplex queries.","The\\f, eve\\f i\\t SpIT still \\feeds t\\b be \\bptimized, its reliability is already su\\t\\ticie\\ft t\\b apply i\\f li\\fguistic research: the queries pr\\bvided pr\\bmisi\\fg li\\fguistic results, i\\ftegrati\\fg di\\t\\tere\\ft levels \\b\\t a\\falysis. This i\\ftegrati\\b\\f is made p\\bssible by the AG: this t\\b\\bl d\\bes \\f\\bt request that the data are i\\ftegrated a p\\bio\\bi, duri\\fg the creati\\b\\f \\b\\t the c\\brpus. The structure \\b\\t the data ca\\f be i\\fstead de\\ti\\fed a poste\\bio\\bi, i\\f pr\\bgressive steps duri\\fg the creati\\b\\f \\b\\t the database with AGTK.",""]},{"title":"5. Attributions\\b","paragraphs":["Alth\\bugh the auth\\brs largely c\\b\\bperated, §§ 1.1 a\\fd 2 have t\\b be attributed t\\b F. Cutug\\f\\b; §§ 1.2, 3.1, 3.2 have t\\b be attributed t\\b R. Savy; § 3.3 has t\\b be attributed t\\b C. Cr\\bcc\\b. We wish t\\b tha\\fk L. D’A\\f\\fa, C. Del S\\brb\\b a\\fd A. Del Prete \\t\\br their c\\b\\ftributi\\b\\f t\\b s\\b\\ttware devel\\bpme\\ft."]},{"title":"6. Referen\\tes\\b","paragraphs":["AGlib: http://agtk.s\\burce\\t\\brge.\\fet","Alba\\f\\b Le\\b\\fi F., Gi\\brda\\f\\b R. (2006), (eds), Ita\\fiano Pa\\b\\fato: ana\\fisi di un dia\\fogo. Nap\\bli: Ligu\\bri.","A\\fders\\b\\f A.H., Bader M., Gurma\\f Bard E., B\\byle E., D\\bherty G., Garr\\bd S., Isard S., K\\bwtk\\b J., McAllister J., Miller J., S\\btill\\b C., Th\\bmps\\b\\f H., Wei\\fert R., (1992), The HCRC Map Task C\\brpus, HCRC, Resea\\bch Pape\\b 29, U\\fiv. \\b\\t Edi\\fburgh.","Bird S., Harri\\fgt\\b\\f J. (2001), Edit\\brial: Speech a\\f\\f\\btati\\b\\f a\\fd c\\brpus t\\b\\bls, Speech communication (specia\\f issue), 32, pp.1-4.","Bird S., Liberma\\f M. (2001), A \\t\\brmal \\tramew\\brk \\t\\br li\\fguistic a\\f\\f\\btati\\b\\f, Speech Communication, 33:23-60.","Bird, S., Bu\\fema\\f, P., Ta\\f, W.C. (2000), T\\bwards a query la\\fguage \\t\\br a\\f\\f\\btati\\b\\f graphs. I\\f P\\boceedings of the Second Inte\\bnationa\\f Confe\\bence on Language Resou\\bces and Eva\\fuation, pp. 807-814.","Caput\\b, M.R. (1991), Aspetti p\\bosodici de\\f\\f’ita\\fiano pa\\b\\fato. Un’ana\\fisi spett\\boacustica, U\\fpublished Master Degree thesis, U\\fiversità di Nap\\bli ‘Federic\\b II’.","Castag\\fet\\b, M., Savy, R., De Le\\b, S. (\\t\\brthc\\bmi\\fg), Schemi di a\\f\\f\\btazi\\b\\fe pragmatica a c\\b\\f\\tr\\b\\ft\\b: il test delle di\\t\\tere\\fze. I\\f P\\boceedings of the II Inte\\bnationa\\f Cong\\bess on ‘Comunicazione Pa\\b\\fata’, Nap\\bli, February 23-25 2006.","C\\btt\\b\\f, S., Bird, S. (2002), A\\f I\\ftegrated Framew\\brk \\t\\br Treeba\\fks a\\fd Multilayer A\\f\\f\\btati\\b\\fs. I\\f P\\boceedings of the Thi\\bd Inte\\bnationa\\f Confe\\bence on Language Resou\\bces and Eva\\fuation, Paris: Eur\\bpea\\f La\\fguage Res\\burces Ass\\bciati\\b\\f, pp. 1670-1677.","Cresti E. (2000), Co\\bpus di Ita\\fiano Pa\\b\\fato. Fire\\fze: Accademia della Crusca.","Cr\\bcc\\b C., Savy, R. (\\t\\brthc\\bmi\\fg), Attravers\\b la pr\\bs\\bdia: si\\ftassi e i\\f\\t\\brmazi\\b\\fe \\fel dial\\bg\\b. I\\f P\\boceedings of the II Inte\\bnationa\\f Cong\\bess on ‘Comunicazione Pa\\b\\fata’, Nap\\bli, February 23-25 2006.","Crutte\\fde\\f A. (1986), Intonation. Cambridge: Cambridge U\\fiversity Press.","Crystal, D. (1969), P\\bosodic Systems and Intonation in Eng\\fish. Cambridge: Cambridge U\\fiversity Press.","Cutug\\f\\b F., V\\bghera M. (2004), AN.ANA.S.: a\\falisi si\\ftattica e a\\f\\f\\btazi\\b\\fe XML a c\\b\\ftatt\\b. I\\f P\\boceedings of the Nationa\\f Confe\\bence ‘I\\f pa\\b\\fato Ita\\fiano’, CD-R\\bm, Nap\\bli: D’Auria Edit\\bre.","Gi\\brda\\f\\b R., Cr\\bcc\\b C. (2006), Artic\\blazi\\b\\fe i\\ft\\b\\fativa e artic\\blazi\\b\\fe i\\f\\t\\brmativa. I\\f Alba\\f\\b Le\\b\\fi F., Gi\\brda\\f\\b R., (eds), Ita\\fiano Pa\\b\\fato: ana\\fisi di un dia\\fogo, Nap\\bli: Ligu\\bri.","Givò\\f T. (1979), Fr\\bm Disc\\bure t\\b Sy\\ftax. Grammar as a Pr\\bcessi\\fg Strategy, Syntax and Semantics, 12, pp. 81-112.","Halliday M.A.K. (1967), N\\btes \\b\\f Tra\\fsitivity a\\fd Theme i\\f E\\fglish, part 2, Jou\\bna\\f of Linguistics, 3, pp.199-244.","Hirst, D., Di Crist\\b, A. (1998), (eds), Intonation Systems. A Su\\bvey of T\\tenty Languages. Cambridge: Cambridge U\\fiversity Press.","Lambrecht K. (1994), Info\\bmation st\\buctu\\be and sentence fo\\bm. Cambridge: Cambridge U\\fiversity Press.","Maeda, K., Bird, S., Ma, X., Lee, H. (2002), Creati\\fg A\\f\\f\\btati\\b\\f T\\b\\bls with the A\\f\\f\\btati\\b\\f Graph T\\b\\blkit. I\\f P\\boceedings of the Thi\\bd Inte\\bnationa\\f Confe\\bence on Language Resou\\bces and Eva\\fuation, Paris: Eur\\bpea\\f La\\fguage Res\\burces Ass\\bciati\\b\\f, pp. 1914-1921.","Mar\\btta, G. (1984), Aspetti de\\f\\fa st\\buttu\\ba \\bitmicotempo\\ba\\fe in ita\\fiano, Pisa: ETS.","Pea\\f V., Williams S., Eske\\fazy M. (1993), The desig\\f a\\fd rec\\brdi\\fg \\b\\t ICY, a c\\brpus \\t\\br the study \\b\\t i\\ftraspeaker variability a\\fd the characterisati\\b\\f \\b\\t speaki\\fg styles. I\\f P\\boceedings of Eu\\bospeech 1993, Berli\\f, pp. 627-630.","Pierrehumbert J., Hirschberg J. (1990), The Mea\\fi\\fg \\b\\t I\\ft\\b\\fati\\b\\fal C\\b\\ft\\burs i\\f the I\\fterpretati\\b\\f \\b\\t Disc\\burse. I\\f C\\bhe\\f, M\\brga\\f, P\\bllack (eds), Intentions in Communication. MIT Press, pp. 271-310.","Savy R. (2001), L’i\\fter\\taccia tra livelli di a\\falisi del parlat\\b: rapp\\brti tra riduzi\\b\\fi seme\\ftali e schemi pr\\bs\\bdici. I\\f P\\boceedings. of XXXIII Cong\\besso SLI, R\\bma: Bulz\\b\\fi, pp. 309-328.","Savy, R., V\\bghera, M. (\\t\\brthc\\bmi\\fg), Si\\ftassi i\\f pr\\bs\\bdia. I\\f P\\boc. of the II Inte\\bnationa\\f Cong\\bess on ‘Comunicazione Pa\\b\\fata’, Nap\\bli, February 23-25 2006.","S\\br\\fic\\bla R. (1981), Su\\f pa\\b\\fato, B\\bl\\bg\\fa: Il Muli\\f\\b.","Va\\f D\\b\\fzel M. (1999), P\\bosodic aspects of info\\bmation st\\buctu\\be in discou\\bse. Le Hague: H\\blla\\fd Academics Graphics.","V\\bghera M. (1990), Gruppi t\\b\\fali e strutture si\\ftattiche dell’italia\\f\\b c\\b\\ftemp\\bra\\fe\\b, The Ita\\fianist, 10:175-203.","V\\bghera, M. (1992), Sintassi e intonazione de\\f\\f’ita\\fiano pa\\b\\fato. B\\bl\\bg\\fa: Il Muli\\f\\b.","V\\bghera, M., Cutug\\f\\b, F. (i\\f this v\\blume), A\\f \\bbservat\\bry \\b\\f Sp\\bke\\f Italia\\f li\\fguistic res\\burces a\\fd descriptive sta\\fdards.","Wavesur\\ter: www.speech.kth.se"]},{"title":"1659","paragraphs":[]}]}