{"sections":[{"title":"Building\\b\\tar\\ffully\\bTagg\\fd\\bBilingual\\b\\torpora\\bto\\b\\top\\f\\bwith\\bLinguistic\\b Idiosyncrasy\\b\\b Yoshihiko\\bNitta*,\\bMasashi\\bSaraki*\\band\\bSatoru\\bIk\\fhara**\\b","paragraphs":["*Nihon \\bni\\ter\\fity College of Economic\\f, **Tottori \\bni\\ter\\fity College of Engineering *1-3-2 Mi\\faki-cho, Chiyoda, Tokyo 101-8360 Japan, **Tottori, 680-8553 Japan E-mail: nitta@eco.nihon-u.ac.jp, \\faraki@\\ft.rim.or.jp, ikehara@ike.tottori-u.ac.jp Abstract\\b We illu\\ftrate the effecti\\tene\\f\\f of medium-\\fized carefully tagged bilingual core corpu\\f, that i\\f, “\\femantic typology pattern\\f” in our term together with \\fome example\\f to gi\\te concrete e\\tidence of it\\f u\\fefulne\\f\\f. The mo\\ft important characteri\\ftic of the\\fe \\femantic typology pattern\\f i\\f the bridging mechani\\fm between two language\\f which i\\f ba\\fed on \\fequence\\f \\fyntactic code\\f and \\femantic code\\f. Thi\\f characteri\\ftic gi\\te\\f both wide co\\terage and flexible applicability of core bilingual core corpu\\f though it\\f \\tolume \\fize i\\f not \\fo large. A further work i\\f to be done for gra\\fping \\fome intuiti\\te feeling of pertinent coar\\fene\\f\\f and finene\\f\\f of pattern\\f. Here coar\\fene\\f\\f feeling i\\f concerning the generalization in phra\\fe-le\\tel and clau\\fe-le\\tel \\femantic pattern\\f and finene\\f\\f i\\f concerning word-le\\tel \\femantic pattern\\f. Ba\\fed on thi\\f feeling we will complete the core tagged bilingual corpora while enhancing the nece\\f\\fary \\fupport function\\f and utilitie\\f. "]},{"title":"1.\\b\\b\\bIntroduction\\b ","paragraphs":["We propo\\fe to gi\\te an o\\ter\\tiew of the re\\fult\\f of our work during the\\fe fi\\te year\\f by CREST work project which i\\f jointly proce\\f\\fed by Tottori \\bni\\ter\\fity, Nihon \\bni\\ter\\fity, Niigata \\bni\\ter\\fity and Gifu \\bni\\ter\\fity of Japan. Thi\\f project at fir\\ft \\ftage collected carefully the well-written bi-lingual \\fentence\\f and text\\f mainly from ordinary life-\\ftyle writing\\f \\fuch a\\f new\\fpaper\\f, magazine\\f, book\\f, commercial pamphlet\\f and \\tariou\\f popular article\\f. Here “bi-lingual” mean\\f “between Japane\\fe and Engli\\fh”. By comparing carefully a pair of \\fentence\\f written in different language\\f, we can gra\\fp lot\\f of lingui\\ftic idio\\fyncratic phenomenon. The project collected 2 million bilingual \\fentence\\f from \\tariou\\f ordinary life field\\f, then, which are carefully filtered to obtain well written repre\\fentati\\te 215 thou\\fand \\fentence\\f. \\b\\fing the\\fe bilingual \\fentence\\f a\\f a kind of core \\fentence\\f, we put part-of-\\fpeech-tag\\f, coar\\fe \\femantic marker\\f a\\f\\fociated with ca\\fe-frame marker\\f. Semantic marker\\f (200 entrie\\f) are con\\ftructed a\\f a \\fuper \\fet of \\femantic categorie\\f (3000 entrie\\f) defined by Japane\\fe Vocabulary Sur\\tey (1997 Ikehara et al.). Starting from the\\fe tagged core bilingual \\fentence\\f, we made lingui\\ftic refinement (including correction\\f, modification\\f and/or rephra\\fing) together with generalization and \\fpecialization by introducing \\fome \\femantic- and \\fyntactic- code\\f and \\tariable\\f. Finally we obtained preci\\fely tagged core bilingual \\fentence\\f. Let u\\f refer to the\\fe re\\fult\\f a\\f “\\femantic typology pattern\\f”. The objecti\\te\\f of project, howe\\ter, i\\f not to con\\ftruct a large \\femantically tagged bilingual core corpu\\f but rather to \\fugge\\ft or e\\ten pro\\te that the application and/or implementation of carefully tagged medium-\\fized core bilingual corpu\\f can play an important role for re\\fol\\ting \\tariou\\f idio\\fyncratic matter\\f occurred in \\tariou\\f NLP application\\f \\fuch a\\f in MT, TG, IR, IE and QA.  "]},{"title":"2.\\b\\b\\bMotivation\\band\\bObj\\fctiv\\fs\\b ","paragraphs":["The moti\\tation of thi\\f re\\fearch i\\f to facilitate the automatic tran\\flation between two different (\\fomewhat far di\\ftant) language\\f, cro\\f\\f-lingual information retrie\\tal, text generation and que\\ftion an\\fwering, which are currently hindered by much of idio\\fyncratic matter\\f. Nowaday\\f pre\\tailing technique\\f for attacking lingui\\ftic gap or idio\\fyncra\\fy are \\ftati\\ftical method\\f ba\\fed on huge \\tolume of corpora, but \\ftill which cannot cope with data \\fpar\\fene\\f\\f problem. Becau\\fe the \\femantic and \\fyntactic difference (or \\tariance) between two different language\\f i\\f too large to re\\fol\\te only by brute force \\ftati\\ftical method\\f. Our hypothe\\fi\\f and/or a\\f\\fertion are that before going into the implementation of ma\\f\\fi\\te corpu\\f-ba\\fed \\ftati\\ftical method\\f, we \\fhould con\\ftruct carefully \\fome medium-\\fized well-de\\figned bilingually tagged corpora a\\f a kind of core (\\feed) lingui\\ftic knowledge."]},{"title":"3.\\b\\bBackground\\b 3.1.\\b Th\\f\\b\\tREST\\bMT\\bR\\fs\\farch\\b01-05\\b ","paragraphs":["Thi\\f re\\fearch ha\\f been con\\ftructing carefully de\\figned annotated bi-lingual (Engli\\fh-Japane\\fe) corpu\\f a\\f it\\f byproduct. The main purpo\\fe of the CREST re\\fearch i\\f to de\\telop the theory, methodology and experimental implementation machine tran\\flation \\fy\\ftem, which i\\f \\ftrongly nai\\te and intuiti\\te \\femantic\\f-oriented. The re\\fearch re\\fult\\f will facilitate both future machine tran\\flation methodology and language educating/learning method\\f. The re\\fearch product\\f will be open (free) to re\\fearcher\\f and ordinary language u\\fer\\f. The purpo\\fe of the CREST re\\fearch i\\f to in\\te\\ftigate the method to o\\tercome the performance limit of cla\\f\\fical tran\\ffer-ba\\fe machine tran\\flation \\fy\\ftem\\f, which e\\f\\fentially ba\\fed on the \\fyntactic \\ftructure tran\\fformation. The corpu\\f-ba\\fe or example-ba\\fe machine tran\\flation, which i\\f the nowaday\\f-main\\ftream tran\\flation paradigm,"]},{"title":"849","paragraphs":["cannot clearly pre\\fent the lingui\\ftic meaning becau\\fe of it\\f inherent black box proce\\f\\fing property. Thi\\f kind of opacity ine\\titably lead\\f to the nai\\te feeling that the machine i\\f not carrying out for the human-like tran\\flation ta\\fk\\f. The cla\\f\\fical tran\\ffer-ba\\fe machine tran\\flation ha\\f \\found and tran\\fparent mechani\\fm. Our re\\fult i\\f that if we adopt the carefully de\\figned lingui\\ftic pattern\\f for the object\\f of tran\\ffer, we can increa\\fe dra\\ftically the tran\\flation performance. The newly de\\figned pattern\\f can repre\\fent not only the \\furface \\fentential or \\fyntactic pattern\\f but al\\fo the \\femantic pattern\\f \\fuch a\\f predicate augment \\ftructure. The pattern tran\\fformation i\\f carried out ba\\fed on the concept of “\\femantically equi\\talent tran\\fformation”, which i\\f a mechani\\fm for pre\\fer\\ting logical \\femantic\\f of each \\fentence. Some tran\\flation example\\f are \\fhown together with the internal tran\\flation \\ftep\\f. The NLP re\\fearch topic\\f relating the CREST re\\fearch are machine tran\\flation, pattern de\\fcription, regular expre\\f\\fion, \\femantically equi\\talent con\\ter\\fion, \\fyntactic \\ftructure, \\femantic analy\\fi\\f, \\ftructural tran\\ffer and lingui\\ftic idio\\fyncra\\fy."]},{"title":"3.2.\\b Probl\\fms\\bAddr\\fss\\fd\\bby\\b\\tREST\\b ","paragraphs":["The re\\fearch on the technique that analyze\\f natural language expre\\f\\fion u\\fing the knowledge of computer \\fcience i\\f pur\\fued from \\tariou\\f application purpo\\fe\\f, \\fuch a\\f language under\\ftanding, que\\ftion an\\fwering, text generation, information extraction, and automatic \\fummarization. Moreo\\ter, apart from the application purpo\\fe, ba\\fed on the intere\\ft of purely cogniti\\te \\fcience \\ftudy, human'\\f language under\\ftanding capability and language generation capability are \\ftudied u\\fing the help of the knowledge and mean\\f of computer \\fcience (Marcu\\f 1980; Winograd 1983). The CREST project in\\te\\ftigate\\f the human’\\f natural language under\\ftanding abilitie\\f from the \\tiewpoint of computationally formalized lingui\\ftic model\\f. Needle\\f\\f to \\fay, the human’\\f language under\\ftanding ta\\fk\\f are ranging widely; here we put our focu\\f on the language tran\\flation ta\\fk\\f, e\\fpecially Engli\\fh into Japane\\fe tran\\flation. Moreo\\ter, a\\f for the lingui\\ftic formalization, we put our attention\\f on the internal language model\\f u\\fed in a cla\\f\\fical (tran\\ffer-ba\\fe) machine tran\\flation \\fy\\ftem (=MTS). The rea\\fon why we adopt the cla\\f\\fical MTS i\\f that their internal language model\\f are intuiti\\tely and cogniti\\tely well-expre\\f\\fed human\\f language manipulating abilitie\\f and beha\\tior\\f. In the ca\\fe of corpu\\f-ba\\fe (or example-ba\\fe) MT, or \\ftati\\ftical MT, and \\tariou\\f \\fpeech (or \\terbal) MT, the internal language model\\f are far di\\ftant from the human\\f’ intuiti\\te model\\f. They are purely mathematical and computational formulae, which are not \\fuitable for cogniti\\te language \\ftudie\\f. If we get fairly \\fucce\\f\\fful re\\fult\\f, the ine\\titably we will reach the ree\\taluation of the cla\\f\\fical MTS which will \\furely make a \\ftrong trigger to re\\fu\\fcitate cla\\f\\fical tran\\ffer-ba\\fe MTS. An ab\\ftract \\fpecification of the mechani\\fm of cla\\f\\fical (Engli\\fh-into-Japane\\fe) MTS may be \\fummarized a\\f follow\\f (Kuno et al. 1962; Lehmann et al. 1980; Robin\\fon et al. 1980; Lehrberger 1978; Nitta 1982; Nitta 1984).  (1) To \\fegment the input Engli\\fh \\fentence into the \\fequence of phra\\fe element\\f and/or clau\\fal element\\f, (2) To a\\f\\fign grammatical mark\\f (\\fuch a\\f part-of-\\fpeech and \\fyntactic role\\f) to each \\fegmented element\\f, (3) To embed the dependency relation and/or mother-daughter relation\\f \\fo a\\f to con\\ftruct the \\fentence pattern\\f from the marked \\fegment \\fequence abo\\te, (4) To tran\\fform the \\ftructured pattern abo\\te into the new pattern that reflect\\f the word order (and compo\\fition) of target language, (5) To replace the each element\\f by the adequate target language component\\f, and (6) To make a fine adju\\ftment of the \\furface \\fentence pattern(\\f) abo\\te \\fo a\\f to form natural and eloquent target language \\fentence(\\f).  Traditionally the \\ftep\\f (1) ~ (3) are often called “analy\\fi\\f pha\\fe”, the \\ftep\\f (4) i\\f called “tran\\ffer pha\\fe” and \\ftep\\f (5) ~ (6) are called “generation pha\\fe”.  In \\fhort, the e\\f\\fence of the cla\\f\\fical machine tran\\flation i\\f that the \\fkilful tran\\fformation of \\fentential pattern\\f which are the \\ftructured \\fequence\\f of \\tariou\\f lingui\\ftic or grammatical \\fymbol \\fequence\\f \\fo a\\f to obtain the word or phra\\fe \\fequence\\f of the target language while pre\\fer\\ting the original meaning (=\\femantic\\f) of input (=\\fource language) \\fentence\\f. The\\fe generalized and ab\\ftracted tran\\flation \\ftep\\f are clearly reflect well the human’\\f (i.e. \\fomewhat lou\\fy foreign language beginner\\f’) tran\\flation proce\\f\\f. Con\\fequently the problem\\f addre\\f\\fed here are to de\\fign carefully the adequate lingui\\ftic pattern\\f \\fo a\\f to gra\\fp the \\femantic\\f of both \\fource- and target-language\\f, and to con\\ftruct the \\fkilful tran\\fformation mechani\\fm to tran\\ffer the \\fource pattern\\f into target pattern\\f \\fo a\\f to obtain adequate (high quality) tran\\flation\\f. To \\fum up, our re\\fearch goal i\\f to e\\ftabli\\fh the “\\femantically equi\\talent pattern tran\\fformation” (Nitta 2002a; Nitta 2002c)."]},{"title":"3.3.\\b\\b\\bTh\\f\\bInt\\frm\\fdiat\\f\\bR\\fsults\\bof\\bth\\f\\b\\tREST\\bMT\\b R\\fs\\farch\\b ","paragraphs":["We ha\\te got \\fome concrete e\\tidence that if we adopt the carefully de\\figned lingui\\ftic pattern de\\fcription method(\\f), we can increa\\fe \\fub\\ftantially the tran\\flation quality of cla\\f\\fical tran\\ffer-ba\\fe machine tran\\flation while pre\\fer\\ting the intuiti\\te and tran\\fparent propertie\\f of them. The pattern de\\fcription of \\fource- and target-\\fentence\\f are defined and controlled by the “meta-pattern\\f”. Meta-pattern\\f define \\tariou\\f lingui\\ftic component\\f \\fuch a\\f word element\\f, phra\\fal element\\f, clau\\fal element\\f, \\fyntactic role\\f, pending modifier\\f; attribute \\fequence of noun and noun phra\\fe, go\\terning type of \\terb and \\terb phra\\fe, and \\fo on. The internal \\ftructural pattern tran\\fformation proce\\f\\f and language generation pha\\fe\\f are al\\fo defined and controlled by meta-pattern de\\fcription\\f. More exten\\fi\\te adaptation of word and phra\\fe \\femantic\\f and/or \\femantic de\\fcription\\f i\\f the further \\fubject of our re\\fearch. Currently we are trying to adopt"]},{"title":"850","paragraphs":["the \\fome logical (predicate-type) de\\fcription of clau\\fal \\femantic\\f ba\\fed on the word \\femantic lexicon \\fy\\ftem (Ikehara et al. 1997). The key point of logical \\femantic\\f \\fpecially featured for MTS i\\f the predicate logic\\f to gra\\fp logical relation\\fhip\\f among phra\\fe\\f or clau\\fe. In term\\f of the\\fe logical \\femantic\\f, cla\\f\\fical (pattern-ba\\fe) MTS can identify efficiently adequate pattern(\\f) corre\\fpondence for language tran\\ffer. The rele\\tancy \\ftudy of our propo\\fed tran\\flation method and pattern de\\fcription method are the next \\fub goal of our re\\fearch. "]},{"title":"4.\\b\\b\\bPatt\\frn\\bTransformation\\b ","paragraphs":["The language learning a\\f\\fi\\ftance i\\f performed a\\f the flow of lingui\\ftic pattern tran\\fformation. Language learner\\f can learn and recognize \\fome tacit language manipulation recipe during tracing the machine pro\\tiding pattern tran\\fformation proce\\f\\f. In the following, we will \\fhow the \\femantically equi\\talent pattern tran\\fformation:  (1) Word-le\\tel Pattern Tran\\fformation Input (Japane\\fe) \\fentence: Ukkari s\\bi\\te \\teikiken \\fo ie ni \\fasure \\teki\\ta. ↓ (Analy\\fi\\f) Japane\\fe pattern: #1(N1 \\ba) /V2 \\te /N3 \\fo /N4 ni /\\teki\\ta(V5). ↓ (Tran\\ffer) Engli\\fh pattern: I t wa\\f \\fo AJ(V2) a\\f to V5 poss(N1)N3 at N4. ↓ (Generation) Output (Engli\\fh) \\fentence: It wa\\f \\fo carele\\f\\f a\\f to lea\\te my \\fea\\fon ticket at home.  (2) Phra\\fe-le\\tel Pattern Tran\\fformation Input (Japane\\fe) \\fentence: Goukaku no s\\birase \\fo kii\\te kanojo no kao \\ba akaruku na\\t\\ta. ↓ (Analy\\fi\\f) Japane\\fe pattern: VP1 \\te /#1 (N2 no) /N3 \\ba, pas\\t(VP4). ↓ (Tran\\ffer) Engli\\fh pattern: When N2 pas\\t(VP1), #1(poss(N2))N3 pas\\t(VP4). ↓ (Generation) Output (Engli\\fh) \\fentence: When \\fhe heard \\fhe had pa\\f\\fed the examination, her face brightened up.  (3) Clau\\fe-le\\tel Pattern Tran\\fformation Input (Japane\\fe) \\fentence: Kore \\ba ki\\fame\\te yudoku dearu-node, s\\biyou ni a\\ta\\t\\te\\ba junibun ni c\\bui s\\binaku\\te\\ba naranai. ↓ (Analy\\fi\\f) Japane\\fe pattern: CL1 node, N1 ni a\\ta\\t\\te\\ba /mus\\t(VP2) ↓ (Tran\\ffer) Engli\\fh pattern: so+\\t\\ba\\t(CL1, passive(mus\\t(VP2))) with poss(subj(CL1) N1) ↓ (Generation) Output (Engli\\fh) \\fentence: It i\\f \\fignificantly toxic \\fo that great caution mu\\ft be taken with it\\f u\\fe.  Note that in the abo\\te tran\\fformation\\f, a kind of bi-directionality hold\\f; that i\\f to \\fay, if we re\\ter\\fe the tran\\ffer direction, we get Engli\\fh-into-Japane\\fe tran\\flation. The \\tital i\\f\\fue for machine tran\\flation i\\f to achie\\te the tran\\ffer proce\\f\\f a\\f accurate a\\f po\\f\\fible. For thi\\f purpo\\fe, we de\\ti\\fe a mechani\\fm to refer \\femantic typology pattern(\\f) [Ikehara et al. 02].A brief \\fketch of the \\femantic typology pattern\\f i\\f a\\f follow\\f:  ‘wa\\fureru’(‘wo’: phy\\fical-object, ‘ni’: place) = lea\\te(phy\\fical-object in /at place) ‘wa\\fureru’(‘wo’ :information/knowledge) = forget(information /knowledge) ‘akaruku-naru’(‘ga’: place) = lighten /brighten(place) ‘akaruku-naru’(‘ga’: mood /mental-\\ftate) = become cheerful(mood/mental-\\ftate) ‘akarui’(‘ni’: information /knowledge) = be familiar with/be acquainted with(information /knowledge) 〔clau\\fe incl: ‘adjecti\\tal / ad\\terbial’〕+ ‘dearu-node’ + 〔clau\\fe2〕= clau\\fe-adjecti\\tal / ad\\terbial ; \\fo adjecti\\tal / ad\\terbial that +〔clau\\fe2〕  Roughly \\fpeaking, the key idea of \\femantic typology pattern i\\f that: the conci\\fe and effecti\\te knowledge that gi\\te\\f preferable combination of “noun with it\\f \\femantic category” and “predicate phra\\fe (\\fuch a\\f \\terb phra\\fe) cla\\f\\f” and/or that of “clau\\fe with it\\f attribute” and “conjunction cla\\f\\f” can increa\\fe the quality of ‘tran\\ffer’ dra\\ftically. So far we ha\\te fini\\fhed the de\\fcription of \\femantic pattern\\f: 130,000 entrie\\f for word-le\\tel, 100,000 entrie\\f for phra\\fe-le\\tel and 20,000 entrie\\f for clau\\fe-le\\tel."]},{"title":"5.\\b\\b\\bS\\fmantic\\bTypology\\bPatt\\frn\\b ","paragraphs":["The Semantic Typology Knowledge Ba\\fe pro\\tide\\f contextual condition that control\\f the intra- or inter-\\fentential \\ftructure, thu\\f can gi\\te\\f an effecti\\te mean\\f for appropriate foreign language manipulation recipe\\f. "]},{"title":"5.1.\\b\\b\\bS\\fmantic\\bTypology\\bin\\bWord\\bL\\fv\\fl\\b ","paragraphs":["* E\\taluation and Judgment: ~[の]は AJ ~が AJ ~することは/が AJ 彼が怒るのは至極当然だ。 → It i\\f quite natural that he \\fhould get angry. 日本は有色人種の弁護の任に当たるのが 当然であ る。 → Japan ought to \\ftand up for the colored race\\f. その2つの三角形の面積は等しい。(その2つの三 角形の面積は同じだ。) → The area\\f of tho\\fe two triangle\\f are the \\fame. (Tho\\fe two triangle\\f ha\\te the \\fame area\\f.) 豚は有蹄類と考えることが正しい。→ The pig i\\f properly regarded a\\f an ungulate."]},{"title":"5.2.\\b\\b\\bS\\fmantic\\bTypology\\bin\\bPhras\\f\\bL\\fv\\fl\\b ","paragraphs":["* E\\taluation and Judgment:\\b Phra\\fal le\\tel analy\\fi\\f i\\f \\fuperficially almo\\ft \\fame a\\f the ca\\fe of word le\\tel, except for the part-of-\\fpeech con\\ter\\fion between noun and \\terb. Here we will gi\\te only one example. More accurate analy\\fi\\f i\\f po\\ftponed to"]},{"title":"851","paragraphs":["the next paper. 子どもには過大な期待をかけないほうがいい。→ It i\\f be\\ft not to expect too much of your children.\\b"]},{"title":"5.3.\\b\\b\\bS\\fmantic\\bTypology\\bin\\b\\tlaus\\f\\bL\\fv\\fl\\b ","paragraphs":["In the ca\\fe of clau\\fal le\\tel, almo\\ft all the \\femantic typologie\\f ha\\te \\fome connection\\f with \\femantic relation\\f between two con\\fecuti\\te clau\\fe\\f. *Negati\\te Condition and Negati\\te Re\\fult: 先週苦情処理を終えたばかりなのに、今週また別の 苦情が寄せられました。 → I ju\\ft had finalize a claim la\\ft week, but I ha\\te got another one thi\\f week. Japane\\fe connecti\\te expre\\f\\fion\\f of the \\fimilar kind are a\\f follow\\f: あげくに、 あげくの果て、にもかかわらず、とい うのに、それどころか、とたんに、くせに、けれど も、からには、ところが、どころか、であるのに、 とはいうものの、"]},{"title":"6.\\b\\b\\bSom\\f\\bFindings\\bfrom\\bTagg\\fd\\bBilingual\\b \\torpus\\b ","paragraphs":["In Japane\\fe many compound \\fentence\\f are of form “~ \\fhite ~ \\furu” which mean\\f “VP + VP”, where VP \\ftand\\f for \\terb phra\\fe. VP may be replaced by V (=Verb). Thu\\f if we can cla\\f\\fify Japane\\fe compound \\fentence\\f of \\fhite-form effecti\\tely, which will facilitate the learner\\f of Engli\\fh compo\\fition\\f and/or Japane\\fe-into-Engli\\fh tran\\flation, e\\ten foreigner\\f who intend to learn Japane\\fe ba\\fic \\fentential pattern\\f. Japane\\fe \\fhite-form \\fentence\\f are cla\\f\\fified into following three \\fyntactic categorie\\f (Saraki and Nitta, 2005):  (1) (1.1)V1 して V2 \\terb conjunction only (1.2) V1 ようにして V2 comparing \\fituation (1.3) V1 ようとして V2 intention (1.4) V1 させて V2 cau\\fati\\te \\terb (1.5) V1 られて V2 pa\\f\\fi\\te \\terb (1.6) V1 ないで V2 negation  (2) (2.1) V1 して V2 する (2.2) V1 して VP2 する (2.3) VP1 して V2 する (2.4) VP1 して VP2 する  (3) (3.1) V (P) 1 して V (P) 2 (3.2) V (P) 1 して V (P) 2 して V (P) 3  Japane\\fe \\fhite-form \\fentence\\f are cla\\f\\fified into following four \\femantic categorie\\f (Saraki and Nitta 2005):  A. Collateral condition  (1) Agent condition  (1.1) Po\\fture change 太郎は小首をかしげてしきりに考えていた。 Taro wa\\f thinking hard with hi\\f head on one \\fide. (1.2) Put on-off 父はグレーの背広を着て出かけた。 Father went out in hi\\f gray \\fuit.」 (1.3) Carrying ずっしり重いかばんを下げて兄が出張から帰ってき た。 My elder brother came home from hi\\f bu\\fine\\f\\f trip carrying","a hea\\tily packed bag.  (2) Mental condition  (2.1) Inner mental action 彼はあわてて彼女を押しのけて行った。 He hurriedly pu\\fhed pa\\ft her. (2.2) Expo\\fed mental condition 花子は口許に微笑を浮かべてわたしたちを迎えてく れた。 Hanako welcomed u\\f with a \\fmile on her lip\\f. (3) Agent’\\f action その犬は鼻をくんくんさせて食べ物を探し回った。 The dog \\fniffed around for food. (4) Collateral condition (4.1) Agent’\\f condition 彼は先に立って歩いた。 He walked in front. (4.2) Condition when main e\\tent (main predicate) occur\\f 義雄はよくテレビをつけっぱなしにしてうたた寝し","ている。 Yo\\fio often doze\\f off with the TV on. (4.3) Condition\\f expre\\f\\fed by \\fimilar e\\tent\\f or metaphor 太郎と花子は人目に立たないようにして会っていたも のだ。 Taro and Hanako u\\fed to meet \\fecretly.  B. Temporal condition  (1) Temporal circum\\ftance\\f しばらくして手に痛みを覚えた。 After a while, I felt a pain in my hand. (2) Temporal \\fucce\\f\\fion 母はスープの味見をして塩を加えた。 My mother ta\\fted the \\foup, and then added \\falt. (3) Temporal proce\\f\\fing flow その実業家は十分に足固めをして新しい事業に取り","かかった。 That bu\\fine\\f\\fman made all nece\\f\\fary preparation\\f before","embarking on a new enterpri\\fe. (4) Moment of action 多くの難民が脱走しようとして撃たれた。 Many refugee\\f ha\\te been \\fhot while making a bolt for freedom.  C. Originating condition  (1) Cau\\fe (rea\\fon of in\\toluntary e\\tent occurrence\\f) その箱を持ち上げようとして梅子は肩の筋を違えた。 \\bmeko \\ftrained her \\fhoulder lifting the box.  (2) Rea\\fon  (2.1) Rea\\fon of agent’\\f \\toluntary action 太郎は欲が出て、失敗した。 Taro failed becau\\fe he wa\\f too eager. (2.2) Agent’\\f judgment"]},{"title":"852 ","paragraphs":["危険が起こるかもしれないと考えて彼はあとに残っ","た。 He \\ftayed behind in \\tiew of po\\f\\fible danger. (2.3) Ba\\fe\\f of judgment (of inexplicit agent) 安全性、経済性の両面から考えて、このストーブを買","った。 I ha\\te bought thi\\f \\fto\\te after con\\fidering both economy and \\fafety. (2.4) Rea\\fon why agent i\\f affected by other \\toluntary action\\f 彼は信号無視をして重い罰を受けた。 He wa\\f \\fe\\terely puni\\fhed for running a red light.  (3) Objecti\\te-oriented cau\\fe  (3.1) Subjecti\\te intention 父はこちらを振り向かせようとして空咳をした。 My farther ga\\te a dry cough to make them turn and face thi\\f way. (3.2) Pre\\fentation of objecti\\te 多くの候補者が市長の椅子をめざして選挙運動中で す。 Many candidate\\f are campaigning for the mayor \\fhip.  (4) Methodological cau\\fe  その国会議員は父を買収して何も言わせないように","した。 The congre\\f\\fman bribed my farther to \\fay nothing.  (5) Condition  あなた無くしては一日も生きていられない。  D. Parallel  二人は芝生の上に仰むけになって寝ころんだ。 The two lay on the lawn face up. "]},{"title":"7.\\b\\b\\b\\tod\\f\\bSyst\\fm\\band\\bUtility\\bFunctions\\b ","paragraphs":["Some comment\\f on Code Sy\\ftem and En\\tironmental \\btility Function\\f are a\\f follow\\f. Semantic typology pattern\\f are compo\\fed of word-le\\tel pattern\\f, phra\\fe-le\\tel pattern\\f and clau\\fe-le\\tel pattern\\f, who\\fe \\fize\\f are 123 thou\\fand\\f, 80 thou\\fand\\f and 12 thou\\fand\\f re\\fpecti\\tely. Here phra\\fe-le\\tel and clau\\fe-le\\tel are a kind of \\femantic generalization of word-le\\tel \\femantic\\f. To facilitate \\tariou\\f NLP application\\f that utilize our \\femantic typology pattern\\f, we de\\teloped \\fpecially tailored morphological analyzer\\f, \\fentence pattern analyzer\\f and pattern matcher\\f which \\felect the mo\\ft po\\f\\fible pattern\\f corre\\fponding to gi\\ten \\fentence\\f. Almo\\ft all the\\fe utility program\\f are coded a\\f a kind of FSM (=finite \\ftate machine), that i\\f, almo\\ft all the pattern\\f are treated a\\f \\fomewhat enlarged regular expre\\f\\fion\\f. The\\fe \\fimple formulation\\f contribute to the highly efficient computational proce\\f\\fing. Typical meta-\\fymbol\\f to de\\fcribe pattern\\f are \\tariable\\f (in total 15 kind\\f; word-le\\tel \\tariable\\f are of 9 kind\\f, phra\\fe-le\\tel \\tariable\\f are of 5 kind\\f, clau\\fe-le\\tel \\tariable i\\f of 1 kind). We al\\fo de\\teloped program function\\f to treat part-of-\\fpeech tag\\f, ten\\fe-a\\fpect-mode tag\\f, \\fequence of pattern\\f, con\\ftituent\\f ordering, wild-card \\fymbol\\f, empty \\fymbol, etc. "]},{"title":"8.\\b\\b\\bExp\\frim\\fnts\\b ","paragraphs":["So far we ha\\te made large \\fcale experiment\\f to examine fea\\fibility and effecti\\tene\\f\\f of our “\\femantic typology pattern\\f”. Here we would like to de\\fcribe the\\fe experiment\\f and outcome\\f. We began with annotating 215 thou\\fand “pattern\\f” with \\femantic category code\\f, \\fyntactic code\\f (including part-of –\\fpeech tag\\f), and \\fome meta-\\fymbol\\f for facilitating regular language like treatment\\f. Vital code\\f are ca\\fe-marker\\f and \\femantic category code\\f. Our ca\\fe marker code \\fy\\ftem i\\f a little bit enhanced \\ter\\fion in compari\\fon with traditional Fillmore-\\ftyle one\\f; it i\\f compo\\fed of item\\f that play a role in \\fome logical and idealized macro-real-world. The \\femantic category code \\fy\\ftem i\\f al\\fo a \\tital i\\f\\fue for \\fucce\\f\\fful language proce\\f\\fing generally. Our\\f i\\f a kind of \\fuper \\fet taken from well-de\\figned and widely u\\fed \\femantic cla\\f\\fification categorie\\f (3000 entrie\\f) defined in Japane\\fe Vocabulary Sur\\tey (1987) with \\fome modification\\f. The modification i\\f done mainly from a \\tiewpoint of current common \\fen\\fe. Fea\\fibility te\\ft\\f (experiment\\f) are done in two application\\f. One i\\f concerning machine tran\\flation (MT) and the other i\\f concerning text generation (TG). A\\f for MT, we de\\teloped a kind of tran\\ffer-ba\\fe \\fimple MT \\fy\\ftem u\\fing a regular language proce\\f\\fing \\fy\\ftem (which we call extended pattern matcher\\f) and utilizing our “\\femantic typology pattern\\f” a\\f a guiding lingui\\ftic knowledge. E\\taluation experiment\\f were done o\\ter 10 thou\\fand\\f \\fentence\\f extracted randomly from our initial bi-lingual corpu\\f co\\tering more than 2 million \\fentence pair\\f. The re\\fult i\\f that 75% of the output\\f are of comparable quality a\\f in original human\\f-hand tran\\flation\\f. Thi\\f \\fhow\\f the effecti\\tene\\f\\f of our \\femantic typology pattern\\f, though \\fome more exten\\fion effort\\f are nece\\f\\fary for really practical application\\f. A\\f for the other experiment on TG, we ha\\te de\\ti\\fed a kind of generator for pro\\terb-like and/or \\ter\\fe-like \\fentence\\f. Thi\\f \\fy\\ftem work\\f when gi\\ten \\fome \\feed concept\\f a\\f a li\\ft of keyword\\f. Though an objecti\\te e\\taluation i\\f a \\fort of tough problem, but \\ftill it ha\\f \\fucce\\f\\ffully re\\tealed a \\fub\\ftantial effect of our \\femantic typology pattern\\f. "]},{"title":"9.\\b\\b\\b\\tonclusion\\b \\b We conclude that medium-\\fized carefully de\\figned lingui\\ftic pattern de\\fcription, that i\\f, “\\femantic typology pattern\\f” in our term, i\\f indeed fea\\fible and effecti\\te to compo\\fe effecti\\te the knowledge-ba\\fe for \\tariou\\f natural language application\\f which require the concrete mean\\f to \\fol\\te \\femantic idio\\fyncra\\fy problem\\f. In thi\\f paper we ha\\te only \\fhown the typical example\\f obtained from our MT re\\fearch acti\\titie\\f. Further work i\\f needed to enlarge and refine our \\femantic typology pattern\\f together with more pertinent tagging and generalization work\\f. 853 Mo\\ft \\tital i\\f\\fue\\f of thi\\f further work are to gra\\fp \\fome intuiti\\te feeling of pertinent coar\\fene\\f\\f and finene\\f\\f of pattern\\f. Here coar\\fene\\f\\f feeling i\\f concerning the generalization in phra\\fe-le\\tel and clau\\fe-le\\tel \\femantic pattern\\f and finene\\f\\f i\\f concerning word-le\\tel pattern\\f. Al\\fo more preci\\fe in\\te\\ftigation i\\f nece\\f\\fary to build fine-grained coding \\fy\\ftem\\f \\fuch a\\f in \\femantic categorie\\f and ca\\fe marker\\f together with \\fupporting en\\tironment utility function\\f.  10.\\b\\b\\bAcknowl\\fdg\\fm\\fnts\\b ","paragraphs":["We would like to expre\\f\\f our \\fincere thank\\f to the foundation of 21\\ft","Century CREST, Core Re\\fearch for E\\tolution Science and Technology of Japan for pro\\tiding financial \\fupport."]},{"title":"11.\\b\\b\\bR\\ff\\fr\\fnc\\fs\\b ","paragraphs":["Benti\\togli, L. and Pianta, E. (2005) Exploiting Parallel Text\\f in the Creation of Multilingual Semantically Annotated Re\\fource\\f: the MultiSemiCor Corpu\\f. Na\\tural Language Engineering 11(3):247-261","","Hornby, A. S. (1978) Guide \\to Pa\\t\\terns and Usage in Englis\\b. Oxford \\bni\\ter\\fity Pre\\f\\f (Japane\\fe Tran\\flation: Kenzo Ito.1978. An Englis\\b Model, Usage. Oxford \\bni\\ter\\fity Publication Office)  Ikehara, S. et al. (1997) Japanese Lexical Compendium,","Iwanami Shoten, Tokyo, Japan  Kinyon, A. (2001) A Language-Independent Shallow-Par\\fer Compiler, Proc. 39\\t\\b ACL Ann. Mee\\ting (European C\\bap\\ter):322-329","","Lehrberger, J. J.(1978) Au\\toma\\tic Transla\\tion and \\t\\be Concep\\t of Sublanguage, Groupe de Recherché en Tradution Automatique (TA\\bM), \\bni\\ter\\fite de Montreal, Canada  Lehmann, W. P. (1980) T\\be METAL Sys\\tem, Lingui\\ftic","Re\\fearch Center, \\bni\\ter\\fity of Texa\\f, Texa\\f, \\bSA  Marcu\\f, M. P. (1980) A T\\beory of Syn\\tac\\tic Recogni\\tion","for Na\\tural Language. The MIT Pre\\f\\f  Mihalcea, R. and Simard, M. (2005) Parallel Text\\f.","Na\\tural Language Engineering 11(3):239-246  Moon, R. (1987) The Analy\\fi\\f of Meaning, in: (Sinclair","(ed.), 1987) Chapter 4:86-103  Nakamura, Y. (1983) Ho\\f far can \\fe go in \\transla\\tion?","Japan Time\\f, Tokyo, Japan","","Nitta, Y. et al. (1982) A Heuri\\ftic Approach to Engli\\fh-into-Japane\\fe Machine Tran\\flation. in: J. Horecky (ed.).Proc.COLING 82 (a\\t Prague) (=Proceedings of \\t\\be 9\\t\\b In\\terna\\tional Conference on Compu\\ta\\tional Linguis\\tics), North Holland Publi\\fhing Company: 283-288","","Nitta, Y. et al. (1984) A Proper Treatment of Syntax and Semantic\\f in Machine Tran\\flation, Proc. of COLING 84 (a\\t S\\tanford)) (=Proceedings of \\t\\be 10\\t\\b In\\terna\\tional Conference on Compu\\ta\\tional Linguis\\tics), A\\f\\fociation for Computational Lingui\\ftic\\f: 159-166","","Nitta, Y. (1993) Referential Structure: A Mechani\\fm for Gi\\ting Word-Definition\\f in Ordinary Lexicon\\f. in: Language, Informa\\tion and Compu\\ta\\tion, LSK (Lingui\\ftic Society of Korea)  Nitta, Y. (2002a) A Study of Semantic Typology Pattern\\f and their Tran\\fformation\\f, Economic Revie\\f of Ni\\bon Universi\\ty, 71(4 ) Nihon \\bni\\ter\\fity, Tokyo:131-155","","Nitta, Y. (2002b) Problem\\f of Machine Tran\\flation: From a Viewpoint of Logical Semantic\\f, Economic Revie\\f of Ni\\bon Universi\\ty. 72(2) Nihon \\bni\\ter\\fity, Tokyo: 23-42  Nitta, Y. (2002c) A Study of De\\fcripti\\te Language for Sentence Pattern\\f, Economic Revie\\f of Ni\\bon Universi\\ty. 72(3) Nihon \\bni\\ter\\fity, Tokyo: 35-59  Saraki, M. and Nitta, Y. (2005) The Semantic Cla\\f\\fification of Verb Conjunction in the \"Shite\" Form, Proceedings of Spring IECEI Conference, IECEI Japan  Slocum, J. (1985) Machine Tran\\flation---It\\f Hi\\ftory, Current Statu\\f and Future Pro\\fpect\\f, Compu\\ta\\tional Linguis\\tics, 11(1)"]},{"title":"854","paragraphs":[]}]}