{"sections":[{"title":"   PC-Based 臺灣手語轉語音溝通輔助系統    邱毓賢、吳宗憲、郭啟祥、*鍾高基 國立成功大學資訊工程研究所、*醫學工程研究所      Page 223 ~ 242 Proceedings of Research on Computational Linguistics Conference XIII (ROCLING XIII) Taipei, Taiwan 2000-08-24/2000-08-25 ","paragraphs":["223"]},{"title":"PC-Based 台灣手語轉語音溝通輔助系統","paragraphs":["邱毓賢、吳宗憲、郭啟祥、*鍾高基  國立成功大學資訊工程研究所、*醫學工程研究所 Email:p7888107@ccmail.ncku.edu.tw, chwu@csie.ncku.edu.tw Fax:+886-6-274-7076"]},{"title":"摘 要","paragraphs":["聲音或語言機能喪失的聽語障礙者,常常發生難以與一般人正常溝通或溝通時發生明顯 的障礙。本研究乃考量本土聽語障礙族群實際溝通輔助的需求,研發符合本土化 PC-based 台 灣手語轉語音溝通輔助系統,包括 1).手語鍵盤,依據 Row-Column Scanning 及考量認知、注 意集中及學習反應之階層式安置(Hierarchical Arrangement)的策略,以作為操作輸入媒介; 2).運用詞頻預測、詞性篩選、句型預測及注音縮寫模組等機制來輔助關鍵詞彙輸入與手語符 號搜尋;3).結合句型樣版及概念從屬之語格文法來建立關鍵詞彙預測完整文句之轉譯系統。 在系統功能性評估部分,由特教老師選取日常生活 1000 句對話語料(平均長度為 4.9 字/句)。 免除虛詞輸入可節省 26.25%按鍵數;加入詞彙、句型預測及注音縮寫等輔助構句方式,與未 加任何預測功能之檢索速度改善率分別為 67.71%、79.50%、96.87%。在適用性評估部分,經 由教學、調適及評估時期的訓練,構句成功率分別為 47.37%、65.0%、68.38%;構句速度與 主觀滿意度評量亦有顯著改善。因此,未來可提供符合本土所需之輔助手語訓練與教學系統。 關鍵字:聽語障礙、溝通輔助系統、手語鍵盤、關鍵詞彙預測、句型樣板"]},{"title":"1. 緒論","paragraphs":["聽語障礙指聲音或語言功能性的損傷,因而造成難以與一般人正常溝通,或溝通時發生 明顯的障礙,且由於溝通障礙者在溝通問題上呈現很大的個別差異,有時又難以鑑別,在實 際生活中,難以使用聽語功能表達基本生理需求;在求學階段中,也造成許多的學習障礙。 歐美先進國家在 1970 年代開始研發可提供語言學習及溝通替代殘障輔助復健科技與輔具 (Augmentative and Alternative Communication, AAC),主要發展與改良簡易型溝通板、電腦操作輸 入介面及輔助性周邊裝置。1980 年代,由於電腦、語音訊號處理及殘障輔助科技的發展,全力 整合工程、復健、醫療及教育訓練來改善聽語障礙者日常生活的功能性。1990 年代,則著重應 用先前輔助科技與輔具提供之經驗於教育訓練與臨床運用[Reichle, 1991; Webster, et.al., 1985; David and Mirendan, 1992]。 224 反觀台灣,現階段資訊相關技術已相當成熟,卻未能妥善應用於特殊教育與殘障溝通輔 具的研發,主要原因乃是西方的語言/語音特性與台灣本土日常生活所慣用的中文全然不同, 使得歐美國家所發展的先進語音科技無法直接移轉為國人所使用[古鴻炎、許文龍,民 85 年; 吳宗憲、陳昭宏、林超群,民 85 年]。大多數聽語障礙者最為常用的溝通方式以手語為主, 但是由於聽人不懂手語語言,所以不瞭解聽語障礙者所表達的內容,且大部分聽語障礙者聽 不到一般自然的口語,而無法進行有效的溝通。 台灣的手語分為中文文法式手語及自然手語[史文漢,民 89 年]。符合中文文法結構的手 語,主要應用於口語溝通、中文教學及會議;自然手語則以其特殊的文法結構獨樹一幟,主 要為聾人之間的手語溝通方式,且無一定的規範。其中手語語言結構為影響手語轉譯的主要 問題,包括:1).詞序:手語的用法習慣、表示集、詞序沒有一定的規律,往往隨著環境、地 區性、年齡、教育程度而異。一般常見的結構有 SVO(主體-動詞-客體)、SOV(主體- 客體-動詞)及 OSV(客體-主體-動詞);2).同時性:指主客體需依據動詞特性同時存在 手勢符號序列中,否則難以表示手語的意圖,因此會產生類似詞序的問題;3).單位詞:中文 的單位詞形形色色、變化萬千,手語則因受限於僅能表達簡單的單位詞或因語言慣用規則不 同,而將單位詞省略。 目前歐美國家相關溝通輔助科技的研究,主要朝向 1.)針對嚴重肢體功能性障礙族群發展 高操作效率之虛擬鍵盤(Virtual Keyboard)[Reichle, 1991; Simpson and Koester, 1999; Webster, et. al., 1985; David and Mirendan, 1992],透過前詞預測後詞(Word Prediction)[ Koester and Levine, 1994; Hunnicut, 1990]、英文詞彙簡稱(Abbreviation Expansion)[ Vanderheiden, 1984]、 語意編碼(Semantic Coding, e.g. Consumer Product- Minspeak System)[ Chang, 1992; Baker, 1982],其主要目的乃輔助大量詞彙庫中選取特定詞彙,然而其設計之根本以詞彙語意為基 礎,使用者必須記憶大量的詞彙及其對應符號,造成認知上的負擔;2.)由北美復健工程協 會(RESNA)所提出之 Sentence Compansion(compress/expansion)的觀念[ Demasco, et. al., 1989; Demasco and McCoy, 1992],使用者輸入少量詞彙資訊(uninflected content words),乃根據英文 文法結構與特性的分析,擴展出符合語法/語意的簡短語句(well-formed sentence)。但是由於西 方語言、語音、手語的特性(如美國手語 American Sign Language/ASL)與複雜的中文及台灣手 語全然不同,所研發的輔助性工具無法直接移轉為國人使用,因此,發展符合本土化溝通輔 助系統實乃刻不容緩。"]},{"title":"2. 研究目的與重要性 ","paragraphs":["225 本研究目的為應用自然語言處理、中文語音訊號處理科技及本土聽語障礙族群實際溝通 輔助需求之考量,系統化研發 PC-based 擴大及替代式本土化溝通輔助科技系統 – 台灣手語 轉語音溝通輔具,透過簡易及人性化的操作介面,以提供聽語障礙者在就醫、就養、就學、 就業等不同需求的溝通輔具,並改善其日常生活中的溝通表達。其特定目標為:1).針對聽障 學童日常生活/學校溝通輔助的實際功能需求,發展及建立本土化口語/語音資料庫、手語符號 階層式認知資料庫及相關教材之彙整;2).考量聽障學童視聽覺回饋之感覺認知發展,設計合 適之參數可調式人機溝通界面,以符合個別化學習之反應;3).完全根據本土化的中文語言/ 台灣手語背景來研發,系統化的建立 PC-based 台灣手語轉語音溝通輔助系統(AAC),解決了 手語轉譯之斷詞、詞序、補綴等中文文句生成的問題,且可提供符合中文文法式之手語輔助 教學與訓練之用。本研究之重要性為鑑於台灣目前缺乏適當的本土化聽語障礙者溝通輔助及 訓練系統,希望藉由本研究蒐集電腦輔助相關教材、特殊教育語言教材與國語母語教材,作 一整理分析,以建立一貼切且有效之訓練教材,並且利用現今之電腦科技,研發一語音多媒 體電腦輔助訓練系統,協助進行溝通訓練與語言學習的活動。另外在聽語障礙者輔具上,我 們將針對國人之語音特性,收集並建立一資料庫,並對其作分析,以便建立一方便實用之本 土化語音合成溝通輔具,帶給聽語障礙者一個方便有尊嚴之生活環境。"]},{"title":"3. 系統設計與發展","paragraphs":["本研究所發展的「關鍵詞彙預測完整語句之台灣手語溝通輔具轉譯系統」,如圖一所示:","Interface Unit NLP Unit Output Unit","Icon (K eyw ord) Sequences","Well-Formed Sentences Learning Sentence Model How-Net","CKIP Auto-Tagging A bbreviation Expansion","Model","Prediction Model TTS Model Sign Display Model Start Syntactic Parser Sem antic A nalyzer","V isu al/A u d io Feedback  圖一 系統架構圖 226 主要包括 1).手語符號鍵盤模組,採用分頁及分列檢索的模式,結合由上而下、由左而右 的檢視策略,並結合詞彙序列動態配置手語符號鍵盤上的手語符號;2).手語詞彙預測機制, 透過詞頻預測、詞性篩選、句型預測、注音縮寫查詢等機制,提供快速手語符號檢索;3).文 句生成模組:關鍵詞彙預測完整文句核心,依據 Sentence Compansion 及 Bottom-Up Parsing with Top-Down Filtering 的觀念,以中研院自動斷詞程式及知網(How-Net)為基礎,句型樣版及 概念從屬之語格文法為構句基本架構,透過語法剖析、語意分析以及虛詞補綴(介詞、副詞、 語助詞、連接詞)等自然語言理解理論/技術的處理,建立此手語符號/詞彙預測完整文句之轉 譯系統,並輸出符合中文文法的手語符號序列及合成的中文語音,以達成溝通表達的目標。"]},{"title":"3-1. 手語鍵盤模組之建立","paragraphs":["手語鍵盤為使用者與輔具溝通的橋樑,基於運用視覺化語言的呈現模式以及聽語障族群 實際溝通的訴求,本研究以聽語障礙者所熟悉的手語作為輔具溝通媒介,透過智慧型動態配 置之手語符號鍵盤的設計,讓使用者點選安置於手語鍵盤上的手語符號,作為關鍵詞彙輸入, 同時配合詞彙分類、詞頻預測、詞性篩選以及注音縮寫查詢等方式輔助使用者於大量手語資 料庫中選取所需之手語關鍵詞彙。 3-1-1. 手語鍵盤設計 本研究以聽語障礙者所熟悉的手語為基礎,設計一套智慧型之手語鍵盤,讓使用者透過 點選動態安置於手語鍵盤上的手語圖像,作為關鍵詞彙輸入。手語鍵盤之設計採用分頁的方 式,配合由左而右、由上而下的檢視策略,並依據詞彙序列動態配置手語圖案於鍵盤之上, 以供使用者操作輸入手語關鍵詞彙。 手語詞彙分類,本研究透過 1.)屬性分類:即使用者聯想的詞彙所對應之屬性類別,以教 育部手語畫冊為例,其根據手語屬性分為:人物、動物、植物、地名、時令、...等類別;2.) 詞性分類:聯想的詞彙所對應之詞性類別,偏向語言學的分類方式,依使用者認知程度而定, 例如單純的以動詞、名詞、形容詞為分類標準等。 高頻詞彙優先,乃應用統計式語言預測模式將最常出現的手語詞彙置前,讓使用者以最 少的檢視次數選取詞彙。首先統計分析對話語料,依照詞頻將詞彙序列對應之手語圖案依序 安置並呈現於手語鍵盤上,以加快使用者詞彙選取的速度。 詞性篩選策略,經由實際觀察對話語料得知構句模式中同詞性的出現機率不高,因此, 已使用過之同詞性的高頻詞彙,將不安置於手語鍵盤。 3-1-2. 句型預測模組 227 基於中文文法修正的考量,本模組係透過文句生成模組來輔助修正及預測文法,將符合 之句型記錄於句型預測樹,其預測模式乃利用 Variable N-Gram 詞性模組預測下一個最有可能 的詞性,同時結合高頻詞彙策略,將符合詞性的高頻詞彙置前。本研究所採用的 Va r i a b l e N-Gram 詞性模組乃以詞性(POS)為基本單位(依中研院詞性分類定義),每一個內部節點 皆代表一個詞性樣本,第 n 個節點出現的機率可用下列式子來描述: )( )( )|( 11 1 11 − − = n n nn POSPOSP POSPOSP POSPOSPOSP L","L L (1) 其中,C(POS1...POSn)代表 POS1...POSn 詞性串列出現的次數。其處理流程圖三所示 構句開始 句型預測模組","Variable N-Gram 詞彙擷取 構句結束 詞彙資料庫","高頻 詞彙序列 是 否 更新詞頻 文法更正 更新句型資料庫 文句生成 詞彙選取  圖二 句型預測模組處理流程圖 舉例來說,系統依據使用者之前的構句-『我去台北開會』、『我去高雄玩』、『我喜歡花』、 『我喜歡吃冰淇淋』,建立了一個 Variable N-grams 詞性模組,如圖三所示: Root Nh VCL Nc VA VC 我 去 台北 開會 玩 VK VC Na 喜歡 吃 冰淇淋 Na 花 高雄 P(.|Nh)=1 P(.|Nh VCL)=0.5 P(.|Nh VK)=0.5 P(.|Nh VK VC)=0.5 P(.|Nh VK VC Na)=1 P(.|Nh VK Na)=0.5 P(.|Nh VCL Nc)=1 P(.|Nh VCL Nc VC)=0.5P(.|Nh VCL Nc VA)=0.5"," 圖三 Variable N-grams 詞性模組 228 3-1-3. 注音縮寫輔助查詢 採類似英文縮寫方式,透過完整注音或連續啟始音輸入,幫助具注音認知能力的使用者 從龐大的手語資料庫中擷取所需的詞字彙。本研究乃根據中文文句與音韻特性,運用 Augmented Transition Network 設計架構(圖四),以擷取對應的字/詞。建構規則為:1).連續 兩個同類音相接,為詞;2).First Vowel 接 Consonant,為 詞;3).Second Vowel 接 Consonant 或 First Vowel,為詞;4).無聲調(1 聲),可能為詞;5).包含 2~5 聲調,必為字。"]},{"title":"0 1 2 3 4 Start consonant consonant first vowel second vowel first vowel tone tone Return character Return word 5 second vowel Null consonant first vowel 6 7 8Null consonant first vowel second vowel tone ","paragraphs":["圖四 注音縮寫模組之 AT N 架構圖"]},{"title":"3-2. 文句生成模組之建立","paragraphs":["針對台灣手語轉譯所遭遇之文法結構問題,提出以關鍵詞彙之句型樣版匹配方式來預測 完整語句,其設計理念乃依據 Sentence Compansion 及 Bottom-Up Parsing/Top-Down filtering 的觀念;以中研院自動斷詞及知網(HowNet)知識為基礎,句型樣版及概念從屬之語格文法 為構句基本架構,透過語法剖析、語意分析以及 Va r i a b l e N - g r a m s 補詞等自然語言處理技術, 將使用者經由手語鍵盤模組輸入的關鍵詞彙轉為自然完整的語句。 3-2-1. 詞性分析及知網知識之應用 中研院自動斷詞程式,乃結合其斷詞系統與語法剖析器,針對語句做斷詞及詞性標記的 工作。本研究所定義的關鍵詞為動詞(V 開頭的詞性)及名詞(N 開頭的詞性),其餘詞類則 定義為虛詞。中研院自動斷詞已可達到 96%以上的準確度,但因本研究的詞彙單位為手語詞 彙,基於斷詞標準一致性的考量,本研究採用長詞優先的斷詞原則,作為人工修正斷詞及詞 性標記的依據。知網是設計智慧軟體的雙語常識知識庫,詳盡地描述概念定義以及屬性之間 229 的關係,知網的特徵分為兩層:主要特徵及次要特徵,前者為物件最重要特性,後者則描述 物件之屬性。舉例來說:『弟弟』在知網裡的定義為【DEF=human|人,family|家,male|男】,其 中『human|人』為弟弟的主要特徵,其餘則為次要特徵。利用物件的主要特徵,引用語格文 法之概念從屬的觀念,不僅描述動詞與其他語格(keyword slot)的關係,且也用以尋找屬性 相似語格及匹配節點,避免單純以詞性為考量所造成的缺失。 3-2-2. 句型樣版樹之建立 句型樣版樹以實際收集彙整之 1000 句日常生活對話語料庫為基礎(平均 4.9 字/句),利 用中研院自動斷詞程式取得語句之斷詞結果、詞性(POS)及語法資訊,透過知網(How-Net) 取得詞彙之概念從屬屬性後,接著經由觀察對話使用習慣及評估語法延伸之合理性,歸納句 型延伸規則,遞迴建立結合語句、語法及語意資訊的句型樣版樹,以提供日後句型比對以及 虛詞補綴之依據,以 Nh + Nd → Nd(省略 Nh)為例。透過句型延伸及結構化處理對話語料 的方式,不僅可以彌補對話句型不足之缺失,更可縮減對話語料資料庫的儲存空間、動態更 新/延伸對話句型及加快句型搜尋速度。 句型樣版樹之節點資料結構 I. 起始節點(root),為句型起始位置,所有句型樣版皆由此開始延伸,有多組子節點。 II. 內部節點(internal node),包含 1.)屬性,同屬性的詞彙可同時存在於同一節點;2.)詞 性,同詞性的詞彙可同時存在於同一節點;3.)參考次數,記錄節點對應的參考次數; 4.)詞彙組,節點內可同時存在多組詞彙;5.)詞彙參考次數,節點內所有詞彙皆有其對 應的參考次數;6.)父節點,只有唯一的父節點;7.)子節點,可有多組子節點。 III. 外部節點(external node、terminal node),為句型結束位置,包含 1.)參考次數,記錄 句型樣版出現次數;2.)節點個數,句型的節點個數;3.)名詞個數,句型的名詞總數; 4.)動詞個數,句型的動詞總數;5.)虛詞個數,句型的虛詞總數;6.)唯一的父節點。 句型樣版樹之建構流程,如圖五所示,其建構原則為: 1. 節點匹配嘗試:1).若屬性符合,則匹配之;2).若詞性符合,匹配之;3).節點匹配 者,若詞彙已存在於節點之中,則詞彙參考次數加 1;否則,將新詞彙加入節點 之中,新詞彙參考次數設為 1。 2. 廣度優先搜尋句型是否存在:1).若句型存在,句型樣版出現次數加 1;2).若句型 不存在,則繼續延伸路徑直到句型生成為止;3).句型生成後,產生外部節點,句 型樣版出現次數設為 1。目前本研究所建立之句型樣版樹包含 553 條句型路徑, 平均路徑長度 3.5 個節點。 230 中研院自動斷詞系統 詞彙/詞性/句型","修正斷詞結果及 詞性標記 How-Net 搜尋句型是否存在 節點匹配策略句型存在 句型延伸規則 句型樣版樹延伸 遞迴延伸結束? 對話語料 否 是 是 否 延伸之句型 還有語料未處理 結束否 是  圖五 句型樣版樹建構流程圖 3-2-3. 文句生成機制之建立 以句型樣版樹為依據,經由以下步驟:1.)針對使用者輸入之關鍵詞串,根據剖析規則 做片語合併及單位詞嵌入之處理,找出關鍵詞串對應的片語,作為節點匹配之基本單位;2.) 依據語意分析及節點匹配策略將關鍵詞所組成的片語填入句型樣版的節點之中;接著依照節 點屬性匹配程度以及句型樣版參考次數之統計資料,篩選出合適的句型樣版;3.)參照句型 樣版,透過時間、地方片語之樣版嵌入以及 Variable N-Gram 虛詞補綴等處理,生成合乎語法 及語意的自然完整語句。 節點匹配原則 基於降低語法複雜度及縮減搜尋空間之考量,本研究透過片語合併及 單位詞嵌入規則,先找出關鍵詞串對應的片語,節點匹配單位。處理原則為:1).片語 合併:分別處理人、時、地、物等類別,人、物類別在語言學裡稱為 argument,時、 地等類別稱為 adjunct;簡言之,時間及地方片語並非構句初期所需物件。因此,在節 點匹配時可暫時忽略時間或地方片語,等到語句生成時,再利用片語嵌入的方式,將未 作節點匹配的時間及地方片語併入句型樣版中,並同時繼承被修飾者的屬性及詞性。 231 如:甜/蘋果⇒甜的蘋果;2).單位詞嵌入:台灣手語並無單位詞,因此,採用單位詞對 應表,並搭配語法規則,將單位詞嵌入名詞片語之中,如:二/鞋子⇒兩雙鞋子。 句型樣版匹配 由於台灣手語文法輸入詞序的問題,本文以關鍵詞合併後的片語組 為節點匹配單位,配合節點匹配策略將關鍵片語組填入句型樣版之中;接著參照節點屬 性匹配程度以及句型樣版參考次數之統計資料,篩選出合適的句型樣版,以提供自然語 句生成之依據。其處理策略為:1).節點匹配策略:透過屬性或詞性比對,將所有未匹 配的關鍵片語與句型樣版的節點作一匹配嘗試。本研究以中研院簡化的 46 類詞類作為 節點之詞性標記,其動詞詞類分為 12 類(VA 〜VL),其詳盡的動詞分類固然有助於降 低語法的不明確性,卻也造成句型侷限以及句型匹配不易之缺失。例如,若單純以詞性 為匹配依據,則『愛(VL)』與『喜歡(VK)』詞性不同;若放寬動詞詞性限制,其兩 者皆屬於狀態及物類動詞。因此,本研究將節點匹配條件適度放寬,若屬性相符,則匹 配之;否則,若名詞詞性相符,匹配之;若動詞詞性相似,匹配之。2).句型樣版匹配: 以句型樣版樹為依據,配合節點匹配策略及比對程序,將關鍵片語組填入合適的句型樣 版。基於虛詞補綴之需求及縮減搜尋空間之考量,其條件限制為:樣版動詞個數等於關 鍵片語動詞個數、樣版名詞個數小於關鍵片語名詞個數、樣版虛詞個數小於 2。其中, 關鍵片語個數係指使用者輸入之關鍵詞彙合併後的片語個數。依據以上限制,從句型樣 版樹中挑選出條件符合的句型樣版之後,開始作句型樣版比對,其比對程序如下: i. 樣版匹配開始,將所有關鍵片語設為未匹配。 ii. 由 root 節點開始,配合節點匹配策略,檢查所有未匹配的關鍵片語中,是否有符合 其子節點匹配條件。 iii. 若有符合之片語,則將片語填入其子節點之中,回到步驟 ii.繼續下一節點之匹配。 iv. 若無符合之片語,則檢查其子節點是否為關鍵節點(詞性為 V 或 N 的節點),如果 不是關鍵節點,則跳過此子節點,回到步驟 ii.繼續下一節點之匹配;否則,中斷此 句型樣版之比對。 v. 完成比對之條件為:所有關鍵片語(時間、地方片語除外),皆有匹配之節點;最後 節點的子節點為外部節點(terminal node)。 句型樣版計分處理與篩選 由於節點匹配策略將動詞詞性限制放寬,雖增加句型成 功匹配的機率;但放寬限制亦增加錯誤匹配的可能性。因此,本研究提出初步的統計 計分機制,透過節點屬性相似度及句型樣版參考次數之統計資料,作為候選句型樣版 232 排名及篩選的評估,計分公式為: n fbaSN tternScoreSentencePa n i ji ∗      ="]},{"title":"∑","paragraphs":["=1 , )( (2) 其中 ai 為第 i 個節點;bj 為與節點 ai 匹配之關鍵詞彙;n 為句型樣版節點個數;f:句 型樣版的出現機率(即句型樣版終端節點之參考次數);SN(ai, bj)為節點相似度,其 配分值為:      ≠ ≠ == = otherwise bposstateaposstateif bposclsssaposclassif wordfunctionalisaposif battributeaattributeorbposaposif baSN ji ji i jiji ji 75.0 )(_)(_5.0 )(_)(_25.0 )(9.0 )()()()(1 )( , (3) 節點相似度係根據 1.)中研院動詞結構(如圖六所示,其參數值乃參照詞性階層式屬 性分類的限制程度而定),動詞詞性相似度依關鍵詞與節點屬性關聯程度而異,達到α1 層級為 0.25 分,α2 層級為 0.5 分,α3 層級為 0.75 分; 動 詞 動 作 狀 態 不 及 物 不 及 物 及 物 及 物 VA VB VC VD VE VF VG VH VI VJ VK VL","α 1 α 2 α 3"," 圖六 中研院動詞分類樹狀結構圖 2.)結合虛詞(functional word)省略策略,將無關鍵詞匹配的虛詞節點訂為 0.9 分;3.) 與關鍵詞屬性相符或詞性相同的節點訂為 1.0 分,如圖七所示,其中 node(a)代表句型樣 版的節點,token(b)代表與該節點匹配之關鍵詞,依據節點匹配策略:1.)首先,檢查關 鍵詞 b 與節點 a 之屬性或詞性是否相符;2.)否則,檢查節點 a 是否為虛詞;3.)否則, 進行關鍵詞 b 與節點 a 之動詞相似度比對。 233","POS(ai) =POS(bj) or attribute(ai)=attribute(bj) POS(ai) is Functional Word POS(ai) & POS(bj) is Verb class_POS(ai) = class_POS(bj) state_POS(ai) = state_POS(bj) node(ai), token(bj) No No No Yes Yes No Yes + 0.25 Yes + 0.25 Yes + 0.25 SN(ai,bj)=1.0 SN(ai,bj)=0.9 SN(ai,bj)=0.25 SN(ai,bj)=0.5 SN(ai,bj)=0.75  圖七 節點相似度比對流程圖 自然語句生成 以篩選出的候選句型樣版為依據,利用片語嵌入規則,將之前未做 節點匹配的時間及地方片語嵌入句型樣本,生成合乎語法及語意的語句,並透過 Variable N-Gram 語言模型虛詞補綴的技術,讓生成之語句更加自然完整。 Step1.)片語嵌入:根據所歸納之時間及地方片語的嵌入規則為:時間片語乃置於行 為者(agent)之前或之後,否則,置於句首;地方片語乃置於動作類動詞 之前,否則,置於句尾,如圖八所示。 root","我 (agent ) 溜冰VA 去VCL terminal node 昨天 Nd 公園 Nc  圖八 時間及地方片語之嵌入 234 Step2.) 補虛詞(Functional Word Addition):依據『關鍵詞彙預測完整語句』之設 計理念及生成合乎語法及語意之語句的基本訴求,本研究利用句型樣板之 Variable N-Gram 資訊,針對虛詞節點做適當之補綴,讓生成之語句更加自然 完整,同時亦可達到免除虛詞輸入,加快構句速度,如圖九所示。 root","你 ( agent ) 吃VC 喜歡VK terminal node 蘋果Na 非常、很Dfa unigram 2-gram 3-gram 4-gram 5-gram 6-gram嗎、吧T  圖九 Variable N-grams 補詞範例 3-2-4. 自動學習機制 基於為使用者量身訂製輔具的訴求,本研究自動記錄使用者構句時常用的手語詞彙及句型 樣版,引用統計學習機制的觀念來動態更新詞頻資料庫及句型樣版樹相關的節點資訊,將常 用的詞彙及句型置前,以降低手語詞彙檢索次數,加快構句速度;同時透過詞彙淘汰策略, 將較少使用的詞彙從手語鍵盤之詞彙序列中移除,以降低搜尋空間,加快手語詞彙選取,系 統自動學習流程如圖十所示。 動態更新 本研究依據對話語料庫統計手語詞彙出現頻率後,建立預設之詞頻資料 庫,提供詞彙預測之用。基於個別化設計理念之考量,輔具必須隨著個人的使用習慣 而調適,因此,本研究根據使用者實際構句所使用的手語詞彙及句型樣版,動態更新 詞頻資料庫及句型樣版樹資訊,將常用的手語詞彙及句型置前,加快使用者操作選 235 擇。其功能為:1).詞頻更新模式,其原則為所選取的手語詞彙詞頻加 1、與所選取之 手語詞彙具相同詞性之手語詞彙詞頻減 1;2).句型樣版次數更新,使用的句型樣版參 考次數加 1,配合句型樣版計分方式,將常用的句型提前。 詞彙淘汰策略 較少使用的手語詞彙,應適時地從高詞彙序列中移除,以減少手語 詞彙的搜尋空間。本研究配合詞頻更新方式,將出現頻率低於 1 次的詞彙從手語鍵盤 之詞彙序列中移除,縮減詞彙檢索空間,加快詞彙搜尋速度。  構句開始 構句結束 對話語句輸入 詞頻資料庫高頻詞彙序列 自然語言處理單元 句型樣版 樹 是 否 更新詞頻 更新句型樣版參考次數 詞彙淘汰策略 詞彙預測模組 手語詞彙選取 對話語句選取 語音及手語輸出 記錄詞性  圖十 自動學習機制架構圖"]},{"title":"3-3. 視聽覺回饋輸出模組","paragraphs":["將文句生成模組所產生的中文文法語句,透過視聽覺回饋之手語(visual)及語音(auditory) 互動式顯示呈現給使用者及其溝通對象,以達到生活溝通及手語學習之目的。基於多樣化口 語語音溝通的需求,本研究透過語音合成參數的調整,讓聽人『聽到』不同聽語障礙者的聲 音;透過靜動態手語圖案呈現方式,讓聽語障礙者『看到』聽人的言語內容。 3-3-1. 手語教學模組與靜動態顯示策略 基於手語視覺回饋之考量,本研究透過文字轉手語模組,將文字形式的對話語句轉換成 圖形介面的中文文法手語,回饋給使用者,其特點為:1).文法修正處理策略:本研究透過句 236 型樣版將關鍵詞串轉為合乎語法及語意的完整語句,不僅修正自然手語文法結構的問題,其 對應的中文文法結構更可提供使用者學習中文文法之用;2).手語學習理念:對話語句經由文 字轉手語模組轉換後,所對應之合乎中文文法的手語序列,即代表對話語句的手語表達方式, 因此,對於不懂手語的聽人而言,亦是一種手語學習的途徑。 3-3-2. 文字轉手語模組 文字轉手語模組以手語詞庫為斷詞依據,透過文字斷詞後,找出詞彙對應的手語圖案, 並依序將其安置於手語鍵盤;若無對應的手語圖案,則以中文字代替顯示。本研究採用的斷 詞原則為 1.)長詞優先;2.)左詞優先。其功能為:1).靜動態顯示策略:本研究基於教學觀點 之考量,除了靜態顯示方式之外,亦配合特教老師意見,採用動態顯示手語圖像的方式,並 經由顯示速度的調整觀察學同學反應的行為,其特點為吸引使用者的注意力、生動地模擬連 續手語動作、增加使用者學習興趣。 3-3-3. 中文語音合成及變聲模組之設計與嵌入 語音是聽語障礙者與正常人溝通的重要替代工具,一套適用於群體的溝通輔具系統,必 須讓使用者擁有個別化的聲音,才能達到個體區別及群體溝通的目的,針對此點,本研究整 合了成功大學資訊工程研究所研發之中文語音合成系統,透過共振峰(formant)、音高 (pitch)、說話速度等合成參數的調整,將合成聲音多樣化,讓聽人可以聽到不同人的聲音。"]},{"title":"4. 實驗結果與討論","paragraphs":["本研究之智慧型台灣手語轉語音溝通輔助系統(如圖十一所示),乃以教育部之手語畫冊 及現代經典出版之手語大師為手語教材,共有 1185 個手語符號,研發平台為 Pentium-III 450 筆記型/個人電腦、64MB RAM,作業系統為 Win98/WinNT,開發工具為 Microsoft Visual C++ 6.0。系統效能評估主要包括: 1). 構句操作輸入速度(Rate Enhancement)之評估:主要探討系統 所提供之預測機制的效能; 2). 構句正確性(Accuracy Enhancement)之評估: 經由實際個案評 估之規劃,探討本系統實際使用之可行性。 4-1. 系統功能評估 主要著重於構句速度改善之探討,本實驗透過虛詞省略與否以及不同模式之預測策略評估 系統效能:1).虛詞省略(Functional Word Deletion):本研究採用之語料庫(corpus)乃為台 南師範學院特教系及台南啟聰學校特教老師所提供之 1000 句對話語句(平均長 4.9 字/句), 包含上課教材以及學生日常生活對話。本研究採用關鍵詞(N、V)構句,免除虛詞輸入,估 計約可節省 26.25%的 Keystroke,如表一所示。 237  圖十一 智慧型 PC-based 台灣手語轉語音溝通輔助系統 (手語符號取自現代經典文化出版之手語大師叢書) Keystroke Numbers Keystroke","Saving Rate","關鍵詞+虛詞 2777 Baseline","關鍵詞 2048 26.25% 表一 虛詞省略之 Keystroke Saving Rate 2).詞彙選取(Keyword Selection Steps):依據 Row-column Scanning 策略,採用(2*4)分 頁的方式,並結合由上而下、由左而右的檢視策略,將最常用的手語詞彙置前。檢視次數為 搜尋手語詞彙所需檢視步驟(頁→列→行),相當於手語詞彙所在的位置,計算方式為:"]},{"title":"∑∑","paragraphs":["== ++= N i st j jjjav i i CRP stN KSS 1 )( 1 * )(11 μ (4) 其中,N 表示測試語句個數;t(Si)表示關鍵詞個數;μ表示分頁的單位(本系統為 8 個手語詞 彙);Pj 、Rj 、Cj 分別表示頁次、列位、行位;如採用本研究所提供之詞彙預測、句型預測 及注音縮寫查詢等輔助構句的方式,檢視次數最多可縮減達 96.87%左右,如表二所示。 Average Scanning Step Improvement Rate Without Prediction 39.27 Baseline Word Prediction 12.68 67.71% Syntax Prediction 8.05 79.50%","Abbreviation 1.23 96.87% 表二 各詞彙預測模式之 Scanning Improvement Rate"]},{"title":"關鍵詞彙輸入 對話語句內容 中文文法手語輸出 詞彙類別 對話類別 ","paragraphs":["238 4-2. 個案適用性評估 影響溝通輔具效能的因素很多-包括使用者對語言的認知能力、中文文法概念、構句複 雜度,以及系統核心技術、介面設計的問題等,因此,本研究透過實際個案適用的方式,將 溝通輔具實際應用於聽語障礙者的日常生活之中,經由系統化的教學與訓練過程中,發掘個 案適用所產生的問題,進而提供系統核心技術的改進及輔具介面的設計,讓輔具符合適用個 案的需求,達成生活溝通的目的。同時透過適用個案的構句結果,進一步評估系統構句速度 及文句生成之正確性。 4-2-1. 適用性評估之規劃 本溝通輔具以聽語障礙者與聽人之相互溝通為研究重點。在此階段性研發的過程,本研究 以台南啟聰學校的學生為適用對象,為期 3 個月時間,透過日常生活對話的方式,讓學生實 際使用本輔具與聽人相互溝通,以實際評估系統效能。同時,透過三期階段(教學期、調適 期、評估期)的實驗,發掘個案適用所產生的問題,分階段性地修改系統核心技術及介面安 置設計,以符合使用族群個別化的需求。 4-2-2. 個案篩選程序 由於本輔具適用之個案除了必須熟悉手語而且沒有語言認知的問題之外,對於中文文法 概念仍須有一定程度的認知,因此,本研究透過讓學生看圖手寫造句的方式,作為個案選取 之考量,其篩選程序為:1).情境語料選取:由南聰特教老師選取 14 張教學及生活圖片;2). 測試對象選取:由南聰特教老師評量學生活動反應及語文能力,挑選 4 位候選聽障學生;3). 測驗方式:讓學生看圖手寫造句(可造兩句以上);4).篩選標準:由特教老師解譯及分析學生 手稿,選取構句錯誤率最低者。所謂『構句錯誤』係指詞序重組之後,正常人仍然無法理解 的語句,如『貓生氣是兔子可怕』;構句錯誤發生之原因,主要是由於個案對於中文文法認知 上的問題及多意圖之表達所造成,基於個案適用性之考量,本實驗以構句錯誤率最低者為優 先選擇。經過以上的個案篩選程序後,本實驗選取 1 位四年級學童作為個案適用對象。 4-2-3. 試用評估程序 本研究之實驗採用的對話題材為一般日常生活常用對話,主要分為:個人基本資料、家 庭類、學校類、興趣類等等。聽語障礙者與不懂手語的聽人透過本溝通輔具,針對不同題材 相互對話,其溝通方式為 1.)採用互動問答模式;2.)聽語障礙者以關鍵詞構句後,透過語 音合成器將語句傳達給不懂手語的聽人『聽』;3.)聽人輸入語句後,透過手語轉換器將語句 轉成對應的手語傳達給聽語障礙者『看』。以此模式讓輔具實際應用於聽語障礙者的生活中, 拉近聽語障礙者與聽人之間的距離之外,更是評估系統效能的最佳方式,因為唯有透過實際 239 的應用,才能確實評估實際的系統效能。 4-2-4. 輔具效能評估方式 評估方式分為兩部分:輸入速度之改善及構句正確性之評估。本研究依照上述實驗程 序,分三個研究時期收集聽語障礙者之對話語句評估系統效能,並且經由系統化的教學與訓 練過程中,發掘個案適用所產生的問題,修正系統核心技術及介面設計方向: i. 教學時期(Training Phase):教學時期著重在 1.)輔具功能及使用方式之說明,2.) 系統功能之補強及輔具介面之改良。本時期需配合手語老師進行,因為,手語老師 最瞭解學生學習的問題所在,而且其教育背景與教學經驗,更是我們輔具設計寶貴 意見的來源。 ii. 調適時期(Adaptation Phase):調適時期著重在 1.)熟悉輔具的功能及使用方式, 2.)系統自動學習,3.)系統除錯。本時期讓學生自己摸索並熟悉輔具操作方式, 透過學生實際操作溝通輔具,系統自動學習個案的使用習慣;而且在實際操作過程 之中,更可發現之前未注意到的系統錯誤,在此一併修正之。 iii. 評估時期(Evaluation Phase):評估時期著重在 1.)輔具操作效能之探討,2.)輔 具效能瓶頸之分析。本時期為系統效能發揮之時期,因此,除了探討系統操作是否 趨向於平穩狀態之外,分析造成系統效能瓶頸的原因,更是提供未來輔具效能改善 的重要參考指標。 本實驗依據不同時期所收集的對話語句,評估構句速度的改善,並透過構句成功率及構句 滿意度分析,評估系統構句之正確性:1).構句成功率:所謂『構句成功』是指系統成功地利 用句型樣版將關鍵詞串轉為完整語句。當系統無法順利產生語句時,系統仍然保留一組由關 鍵詞串組合而成的預設語句,供正常人猜想聽語障礙者可能要表達的意思;2).構句滿意度: 所謂『構句滿意度』是指正常人對於系統所產生語句的滿意程度。本研究將構句滿意度分為 5 個等級:5 表示優良(excellent)、4 表示良好(good)、3 表示尚可(fair)、2 表示差 (poor)、1 表示極差(unsatisfactory)。構句滿意度由與聽語障礙者溝通的教師或照顧者來評分,當系統『構 句成功』時,正常人針對系統構句結果做一評比。 4-3. 適用結果與分析 本研究經過三個時期的對話語料收集之後,彙整出構句速度、構句成功率以及構句滿意 度評量表,分別探討比較:1).教學時期:由於學生對於輔具功能及操作方式完全陌生,本時 期需配合特教老師說明並引導學生使用本輔具,因此,本時期的對話語料以自我介紹主題。 學生一開始會以類似平常手寫造句的方式來構句,因為學生對於系統關鍵詞構句的方式一時 240 還無法適應,所以本時期的平均關鍵詞個數偏高,同時也是造成構句成功率偏低的部分原因; 另外,由於學生對於系統操作方式的不熟悉以及系統功能的不足,導致本時期的平均構句時 間偏長;至於構句滿意度以及構句成功率,因系統核心尚未成熟,本時期的構句成功率偏低, 而且構句滿意度也稍差;2).調適時期:根據教學時期特教老師的建議,系統在核心部分以及 輔具介面設計皆有修正及補強。本時期之對話語句著重在個人基本資料的相互詢問。本時期 學生對於系統操作方式已漸趨熟悉,加上關鍵詞輸入方式及輔具介面的改善,因此,平均構 句時間已縮短許多;學生構句方式漸漸以關鍵詞的方式來構句,因此本時期的平均關鍵詞個 數較教學時期為少,同時,也是構句成功率提升的部分原因;至於構句滿意度以及構句成功 率,因系統核心之修正及補強,本時期之構句滿意度及構句成功率皆有上升的趨勢;3).評估 時期:經過調適時期的適用,系統已自動學習使用者的使用習慣到達近似穩定的狀態,此時 期的系統正處於使用者最為熟悉的狀態,因此,本時期的平均構句時間最短,而對話語料則 著重在個人興趣以及生活趣事的討論。因為學生已能掌握關鍵詞構句的訣竅,本時期幾乎皆 以關鍵詞的方式來構句,因此,本時期的平均關鍵詞個數較前兩個時期為少,同時,也是構 句成功率趨向穩定的部份原因;至於構句滿意度以及構句成功率,因系統核心在適應時期已 大致底定,本時期之構句滿意度及構句成功率皆已趨向穩定的狀態。探討系統構句失敗的原 因,多來自於複雜構句,因此,系統若朝解決複雜句型的方向研究,相信,對於構句成功率 將有顯著的提升。"]},{"title":"5. 結論","paragraphs":["本 PC-based 擴大及替代式本土化溝通輔助(AAC)科技系統 – 台灣手語轉語音溝通輔具 之研發,應用現階段自然語言理解/技術、語意解析、語音訊號處理及多媒體處理的科技,且 實際考量聽語障礙者不同臨床殘障功能性需求、台灣手語轉譯模式、中文文法/手語斷詞處 理、語言生成處理、人因工程及人機介面設計之最佳化匹配,提供本系統初步的雛形系統發 展,且針對台灣手語及中文文法相互轉譯之特性,初步解決了詞序、綴語、Agent/Theme 等 問題。初步個案適用性評估結果顯示:雖然本雛形系統之手語認知符號預測選取、文句生成 構句處理等基本功能性已能符合實際聽障學童之需求,但距離輔具研發之終極目標-互動式語 音雙向溝通,此系統仍尚待改良。然而在進行系統適用性評估的過程,由於聽語障相關的教 材相當缺乏,使得目前文句生成仍侷限較簡單的對話語句。 有鑑於語音溝通輔助系統設計及發展為需整合不同學門,其研發以符合個人需求、高功 能性、高擴充性、低複雜度及具教育臨床療效為考量重點,因此,仍具相當大的發展空間與 241 研究方向,以提供更符合國內聽語障礙者所需之溝通輔助工具。而針對目前國內相當缺乏適 當的本土化聽語障礙者所需之相關教材、特殊教育語言教材與國語母語教材,本研究提供一 多媒體電腦輔助訓練系統,以協助進行溝通訓練與語言學習的活動,更可擴展於輔助手語教 學與訓練之用,以期能改善國內聽語障礙者之日常生活溝通表達。"]},{"title":"誌 謝 ","paragraphs":["承蒙中華民國聾人協會顧玉山老師、台南師範學院邢敏華教授及台南啟聰學校陳衫吉老 師在手語教材、教育訓練方面的協助及提供研究所需之重要參考資料,本文得以完成。感謝 國科會 NSC89-2614-H-006-003-F20 經費補助,特此致謝。"]},{"title":"參考文獻","paragraphs":["Reichle, Joe, \"Implementing Augmentative and Alternative Communication: strategies for learners with severe disabilities.”, Paul H.Bookes Publishing Co.,1992. Simpson, R. C. and Koester, H. H., “ Adaptive One-Switch Row-Column Scanning”, IEEE Transaction on Rehabilitation Engineering, Vol. 7, No. 4., 1999. Webster, J.G., et. al., “ Electronic Devices for Rehabilitation”, John Wiley & Sons, Inc., 1985. David, R. B. and Mirendan, Pat, \"Augmentative and Aternative Communication\", Paul H. Bookes Publishing Co., 1992. Koester, H. H. and Levine, S. P., “Modeling the Speed of Text Entry with a Word Prediction Interface”, IEEE Transaction on Rehabilitation Engineering, Vol. 2, No. 3., 1994. Hunnicut, S., “Word Prediction: Exploring the Use of Semantic information”, Augmentative and Alternative Communication, Vol. 6, No. 2., 1990. Vanderheiden, G. C., “A High-Efficiency Flexible Keyboard Input Acceleration Technigues: SPEEDKEY”, Proceedings of the Second International Conference on Rehabilitation Engineering, RESNA, pp. 353-354., 1984. Chang, S. K., et. al., “ A Methodology for Iconic Language Design with Application to Augmentative Communication”, Preceedings of the 1992 IEEE Workshop on Visual Language, pp110-116., 1992. 史文漢,台灣手語語言學概論,台北市政府勞工局手語翻譯員培訓班教材,民國 89 年。 Baker, B., “Minspeak”, Byte., 1982. Demasco, P., et. al., ”Towards More Intelligent AAC Interfaces: The Use of Natural Language Processing”, The12th Annual Conference of RESNA, 1989. Demasco, P. and McCoy, K. F., “Generating Text from Compressed Input: An Intelligent Interface for Prople with Severe Motor Impairements”, Communication of the ACM, Vol. 35, No. 5., 1992. 242 古鴻炎、許文龍,”時間比例基週波形內差-ㄧ個國語音節信號合成之新方法”,第九屆計算 語言學研討會,pp.61-83,民國 85 年。 吳宗憲、陳昭宏、林超群,”中文文句翻語音系統中連音處理之研究”,第九屆計算語言學 研討會,pp.85-104,民國 85 年。"]}]}