{"sections":[{"title":"","paragraphs":["December 2000 Volume 26, Number 4"]},{"title":"Computational Linguistics Articles Automatic Text Categorization in Terms of Genre and Author Bidirectional Contextual Resolution An Empirically Based System for Processing Definite Descriptions Learning Methods to Combine Linguistic Indicators: Improving Aspectual Classification and Revealing Linguistic Insights Squibs and Discussions On Coreferring: Coreference in MUC and Related Annotation Schemes Book Reviews Speech and Language Processing: An Introduction to Natural Language Processing, Computational Linguistics, and Speech Recognition","paragraphs":["by Daniel Jurafsky and James H. Martin Artificial Intelligence and Literary Creativity: Inside the Mind of BRUTUS, a Storytelling Machine by Selmer Bringsjord and David A. Ferrucci Architectures and Mechanisms for Language Processing edited by Matthew W. Crocker, Martin Pickering, and Charles Clifton, Jr. Breadth and Depth of Semantic Lexicons edited by Evelyne Viegas Briefly Noted Publications Received Index to Volume 26 Efstathios Stamatatos, Nikos Fakotakis, and George Kokkinakis Stephen G. Pulman Renata Vieira and Massimo Poesio Eric V. Siegel and Kathleen R. McKeown Kees van Deemter and Rodger Kibble Reviewed by Virginia Teller Reviewed by Ronald de Sousa Reviewed by Amy Weinberg Reviewed by John S. White 471 497 539 595 629 638 642 648 652 657 659 66l Published Quarterly by the MIT Press for the Association for Computational Linguistics"]},{"title":"Copyright ©2001 by the Association for Computational Linguistics.","paragraphs":["Permission to photocopy articles for internal or personal use, or the internal or personal use of specific clients, is granted by the copyright owner for users registered with the Copyright Clearance Center (CCC) Transactional Reporting Service, provided that the fee of $3.00 per article-copy is paid directly to CCC, 222 Rosewood Drive, Danvers, MA 01923. The fee code for users of the Transactional Reporting Service is 0891-2017/00 $3.00. For those organizations that have been granted a photocopy license with CCC, a separate system of payment has been arranged. Such permission requests and other permission inquiries should be addressed to the Managing Editor at the address given on the inside front cover of this issue."]},{"title":"Computational Linguistics","paragraphs":["is abstracted and/or indexed in the following publications:"]},{"title":"Annual Review of Information Science and Technology, CompuMath Citation Index, Computer Abstracts, Computing Reviews, Current Contents: Social and Behavioral Sciences, Engineering Index, Knowledge Engineering Review, Language and Language Behavior Abstracts, Linguistic Abstracts, Linguistic Bibliography, Research Alert, Science Abstracts","paragraphs":["(INSPEC Section C),"]},{"title":"SciSearch, Social Sciences Citation Index,","paragraphs":["and"]},{"title":"Social SciSearch.","paragraphs":["Volume 14 and subsequent volumes of"]},{"title":"Computational Linguistics","paragraphs":["are available on microfilm through University Microfilms International, 300 North Zeeb Road, Ann Arbor, MI 48106, USA. Send advertising and mailing list inquiries to Marketing Dept., MIT Press Journals, Five Cambridge Center, Cambridge, MA 02142-1407; Phone: (617) 253-2866; fax: (617) 258-5028; e-mail: journals-info@mit.edu."]},{"title":"Individual Subscriptions to Computational Linguistics","paragraphs":["are available only with membership in the Association for Computational Linguistics (ACL). Annual Membership Dues are as follows:"]},{"title":"regular,","paragraphs":["$50.00;"]},{"title":"student --","paragraphs":["taking a full-time program of courses and not earning a regular income, $30.00;"]},{"title":"retired,","paragraphs":["$30.00;"]},{"title":"joint --","paragraphs":["for couples receiving one subscription, $60.00. A membership application together with an order form for back issues and conference proceedings is included at the end of this issue. Send membership applications and address changes to Priscilla Rasmussen, Association for Computational Linguistics (ACL), P.O. Box 6090, Somerset, NJ 08875, USA. However, note that it is also possible to pay by credit card (both by e-mail and by postal mail) and through banks in Switzerland and Japan. An electronic, full-text version of"]},{"title":"Computational Linguistics","paragraphs":["is available from the MIT Press. Institutional subscription rates: Electronic only--S126.00. Canadians add the 7% GST."]},{"title":"Print and Electronic-- $140.00.","paragraphs":["Outside the U.S. and Canada add $20.00 for postage and handling. Canadians add the 7% GST. Single copies of current and back issues are $36.00. Outside the U.S. and Canada add $5.00 per issue for postage and handling. Canadians add the 7% GST. Send institutional subscription orders and address changes to MIT Press Journals, Five Cambridge Center, Cambridge, MA 02142-1407; phone: (617) 253-2889; fax: (617) 577-1545; e-mail: journals-orders@mit.edu. Claims for missing issues will be honored free of charge if made within three months after the publication date of the issue. Claims may be emailed to: journals-claims@mit.edu. Prices subject to change without notice. Institutions should order back issues before 1988 and all proceedings from the ACL at the address above. http://mitpress.mit.edu/COLI"]}]}