{"sections":[{"title":"Publications Received","paragraphs":["Books listed below that are marked with a t have been selected for review in a future issue, and reviewers have been assigned to each.","Authors and publishers who wish their publications to be considered for review in"]},{"title":"Computational Linguistics","paragraphs":["should send a copy to the book review editor, Graeme Hirst, Department of Computer Science, University of Toronto, Toronto, Canada M5S 3G4. All relevant books received will be listed, but not all can be reviewed. Technical reports (other than dissertations) will not be listed or reviewed. Authors should be aware that some publishers will not send books for review (even when instructed to do so); authors wish-ing to enquire as to whether their book has been received for review may contact the book review editor.","Readers who wish to be considered as book reviewers for the journal should contact the book review editor, outlining their qualifications, by sending electronic mail to"]},{"title":"gh@cs. toronto.edu","paragraphs":["or by writing to the address above. tComputing Meaning, volume 1 Harry Bunt and Reinhard Muskens (editors) (Tilburg University) Dordrecht: Kluwer Academic Publishers (Studies in linguistics and philosophy, edited by Gennaro Chierchia, Pauline Jacobson, and Francis J. Pellefier, volume 73), 1999, vi+360 pp; hardbound, ISBN 0-7923-6108-3, $149.00, £93.00, Dfl 280.00 Cross-linguistic Perspectives on Language Processing Marica De Vincenzi and Vincenzo Lombardo (editors) (Universita di Chieti and Universit~i del Piemonte Orientale 'A. Avogadro') Dordrecht: Kluwer Academic Publishers (Studies in theoretical psycholinguistics, edited by Lyn Frazier, Thomas Roeper, and Kenneth Wexler, volume 25), 2000, vi+258 pp; hardbound, ISBN 0-7923-6146-6, $106.00, £66.00, Dfl 200.00 Cognitive Dynamics: Conceptual and representational change in humans and machines Eric Dietrich and Arthur B. Markman (editors) (Binghamton University and University of Texas, Austin) Mahwah, NJ: Lawrence Erlbaum Associates, 2000, xiii+380 pp; hardbound, ISBN 0-8058-3408-7, $89.95 ($34.50 prepaid) ~Construing Experience through Meaning: A language-based approach to cognition M. A. K. Halliday and Christian M. I. M. Matthiessen (University of Sydney and Macquarie University) London: Cassell (Open linguistics series, edited by Robin Fawcett), 1999, xiii+657 pp; paperbound, ISBN 0-304-70490-3, £65.00 Coarticulation: Theory, data and techniques William J. Hardcastle and Nigel Hewlett (editors) (Queen Margaret University College, Edinburgh) Cambridge University Press, 1999, xiv+386 pp; hardbound, ISBN 0-521-44027-0, $64.95 German Sentence Processing Barbara Hemforth and Lars Konieczny (editors) (Freiburg University and University of the Saarland) Dordrecht: Kluwer Academic Publishers (Studies in theoretical psycholinguistics, edited by Lyn Frazier, Thomas Roeper, and Kenneth Wexler, volume 24), 2000, ix+319 pp; hardbound, ISBN 0-7923-6104-0, $138.00, £86.00, Dfl 260.00 Speaking of Events James Higginbotham, Fabio Pianesi, and Achille C. Varzi (editors) (Oxford University, IRST, and Columbia University) Oxford University Press, 2000, vii+295 pp; hardbound, ISBN 0-19-512807-9, $55.00, £47.00; paperbound, ISBN 0-19-512811-7, $24.95, £23.50 tSpeech and Language Processing Daniel Jurafsky and James H. Martin (University of Colorado, Boulder) Upper Saddle River, NJ: Prentice Hall (Prentice Hall series in artifical intelligence, edited by Stuart Russell and Peter Norvig), 2000, xxvi+934 pp; hardbound, ISBN 0-13-095069-6, $64.00 Corpora Galore: Analyses and techniques in describing English [Papers from the Nineteenth International Conference on English Language Research on Computerized Corpora (ICAME 1998)] John M. Kirk (editor) (The Queen's University of Belfast) Amsterdam: Editions Rodopi (Language and computers: Studies in practical linguistics, edited by Jan Aarts and Willem 468 Publications Received Meijs, volume 30), 2000, xv+344 pp; hardbound, ISBN 90-420-0419-3, $97.00, £52.50, Dfl 170; paperbound, ISBN 90-420-0409-6, $33.00, £18.00, Dfl 60.00 Studies in Contemporary Phrase Structure Grammar Robert D. Levine and Georgia M. Green (The Ohio State University and University of Illinois at Urbana-Champaign) Cambridge University Press, 1999, v+335 pp; hardbound, ISBN 0-521-65107-7, $64.95 ~Automatic Indexing and Abstracting of Document Texts Marie-Francine Moens (Katholieke Universiteit Leuven) Dordrecht: Kluwer Academic Publishers (The Kluwer international series on information retrieval, edited by W. Bruce Croft), 2000, xvi+265 pp; hardbound, ISBN 0-7923-7793-1, $110.00, £76.00, Dfl 260.00 Causality: Models, reasoning, and inference Judea Pearl (University of California, Los Angeles) Cambridge University Press, 2000, xvi+384 pp; hardbound, ISBN 0-521-77362-8, $39.95 tBuilding Natural Language Generation Systems Ehud Reiter and Robert Dale (University of Aberdeen and Macquarie University) Cambridge University Press (Studies in natural language processing), 2000, xxi+248 pp; hardbound, ISBN 0-521-62036-8, $59.95 tKnowledge Representation: Logical, philosophical, and computational foundations John E Sowa Pacific Grove, CA: Brooks/Cole, 2000, xiv+594 pp; hardbound, ISBN 0-534-94965-7, $62.95 tThe Syntactic Process Mark Steedman (University of Edinburgh) Cambridge, MA: The MIT Press (Language, speech, and communication series), 2000, xiv+330 pp; hardbound, ISBN 0-262-19420-1, $35.00 469"]}]}