{"sections":[{"title":"\"~:~","paragraphs":[",~."]},{"title":"Truth from Trash How Learning Makes Sense","paragraphs":["Chris Thornton Analyzes how we sort through the morass of data we receive and decide what is worth retaining. Complex Adaptive Systems series A Bradford Book 224 pp. $37.50"]},{"title":"Embodied Conversational Agents","paragraphs":["edited by Justine Cassell, Joseph Sullivan, Scott Prevost, and Elizabeth Churchill Describes research in all aspects of the design, implementation, and evaluation of embodied conversational agents, 352 pp. $42 To order call 800-356-0343 (US & Canada) or 617-625-8569. Prices subject to change without notice."]},{"title":"Converging Methods for Understanding Reading and Dyslexia","paragraphs":["edited by Raymond M. Klein and Patricia A. McMullen Describes both normal and impaired reading processes: how reading ability is acquired, how it is sometimes lost, and how dyslexia can be remediated. Language, Speech, and Communication series A Bradford Book 536 pp. $60"]},{"title":"Learnability in Optimality Theory","paragraphs":["Bruce Tesar and Paul Smolensky \"Arguably the most clear-minded and far-reaching current research program on the application of formal learning theory to the problem of language acquisition.\" -- Stefano Bertolo, MIT 172 pp. $25"]},{"title":"The MIT Press http://mitpress.mit.edu Toward a Cognitive Semantics Volume 1: Concept Structuring Systems Volume 2: Typology and Process in Concept Structuring","paragraphs":["Leonard Talmy \"At last we have all these classic papers in one place! This collection finally makes it possible to appreciate the full scope and originality of Talmy's pioneering work in cognitive linguistics.\" -- Ray Jackendoff, Professor of Linguistics, Brandeis University Language, Speech and Communication series A Bradford Book Vol. 1:480 pp. $60 Vol. 2:412 pp. $60 Set: $110"]},{"title":"Finding Out About","paragraphs":["A Cognitive Perspective on Search Engine Technology and the Richard K. Belew The World Wide Web is rapidly filling with more text than anyone could have imagined a short time ago. However, the task of determining which data is relevant has become appreciably harder. In this original new work Richard Belew brings a cognitive science perspective to the study of information as a computer science discipline. He introduces the idea of Finding Out About (FOA), the process of actively seeking out information relevant to a topic of interest. Belew describes all facets of FOA, ranging from creating a good characterization of what the user seeks to evaluating the successful performance of search engines. His volume clearly shows how to build many of the tools that are useful for search-ing collections of text and other media. While computer scientists make up the book's primary audience, Belew skillfully presents technical details in a manner that makes important themes accessible to readers more comfortable with words than equations. 0-521-63028-2 Hardback about $44.95"]},{"title":"A Computational Theory of Writing Systems Richard Sproat","paragraphs":["This innovative book develops a formal computational theory of writing systems and relates it to psycholinguistic results. Drawing on case studies of writing systems around the world, it offers specific proposals about the linguistic objects that are represented by orthographic elements and the formal constraints that hold the mapping relation between them. Based on the insights gained, it posits a new taxonomy of writing systems. The book will be of interest to students and researchers in theoretical and computational linguistics, the psycholinguistics of reading and writing, and speech technology. Studies in Natural Language Processing 0-521-66340-7 Hardback $59.95"]},{"title":"Formalizing the Dynamics of Information Martina Failer, Stefan Kaufmann, and Marc Pauly,","paragraphs":["Editors The first part of this volume addresses issues relevant for multi-agent systems: reasoning with incomplete information, reasoning about knowledge and beliefs, and reasoning about games. Proofs as formal objects form the subject of Part II. Topics covered include: contributions on logical frameworks, linear logic, and different approaches to formalized reasoning. Part III focuses on representations and formal methods in linguistic theory, addressing the areas of comparative and temporal expressions, modal subordination, and compositionality. CSLI Lecture Notes Distributed for CSLI Publications 1-57586-239-5 Hardback $64.95 1-57586-240-9 Paperback $24.95"]},{"title":"Tree Adjoining Grammars","paragraphs":["Mathematical, Computational and Linguistic Properties Anne Abeill~ and Owen Rambow, Editors Researchers in theoretical linguistics, psycholinguistics, cognitive science, and natural language processing have recently converged on a collective insight: formal-izing the syntax of words is central to describing, understanding, and analyzing language. This insight has sparked considerable interest in Tree Adjoining Grammar, a lexically-oriented mathematical formalism that can precisely capture the syntactic properties of natur~tl languages such as English or Korean. This volume combines contributions from a variety of authors who discuss the formalism itself, its use in analyzing linguistic phenomena, and its use in building natural language processing systems. CSLI Lecture Notes Distributed for CSLI Publications 1-57586-251-4 Hardback about $64.95"]},{"title":"1-57586-252-2","paragraphs":["Paperback $24.95"]},{"title":"Implementing Typed Feature Structure Grammars Ann Copestake","paragraphs":["Much of the work in modern formal linguistics is concerned with giving mathematically precise accounts of human languages. Such work is particularly suited for research that involves language processing with computers. This book provides an introduction to one particularly popular approach, typed-feature structure formal-isms. Implementing Typed Feature Structure Grammars includes informal (but rigorous) descriptions of typed-feature structure logic as well as formal definitions. The book covers the basics of grammar development by introducing different frameworks to the reader. Semantic representation is also introduced. The book includes a CD-ROM of the LKB system software. The CD-ROM is compatible with Windows, MacOS, Linux and Solaris, and includes a full user manual. CSLI Lecture Notes Distributed for CSLI Publications 1-57586-261-1 Hardback about $59.95 1-57586-260-3 Paperback $22.95"]},{"title":"The Ontology of Language","paragraphs":["Properties, Individuals and Discourse Chris Fox The book offers contributions to a number of topics in semantics, while at the same time providing an engaging discussion of key foundational issues and of what Property Theory can contribute to them. The book starts with a version of Property Theory that stems from a combination of the lambda calculus with Aczel's Frege structures. Fox improves on it and substantially extends it with original applications to plurals and mass nouns, to \"intensional individuals\" and to the dynamics of discourse. This volume should be of interest"]},{"title":"Optimality Theoretic Syntax Peter Sells,","paragraphs":["Editor This is a collection of papers that involves a new approach to syntax bringing together Optimality Theory (OT) and Lexical-Functional Grammar (LFG). Its importance is precisely in this new approach, which differs from other OT approaches to syntax. The papers involve analysis of certain kinds of linguistic data, as well as more technical questions of the formal foundations, and of the utility of the approach in (industrial) natural language processing applications. Studies in Constraint-Based Lexicalism Distributed for CSLI Publications 1-57586-243-3 Hardback $64.95 1-57586-244-1 Paperback $24.95"]},{"title":"Structure, Alignment and Optimality in Swedish Peter Sells","paragraphs":["This volume explores the grammatical structure of sentences in Swedish, present-ing an account of the order of the words and phrases within the clause. This analysis is presented from the perspective of Optimality Theory within the theoretical framework of Lexical-Functional Grammar. This framework provides syntactic analysis in terms of functions within the clause such as subject, object, and also topic and focus, as well as part-of-speech analysis in terms of noun phrase, verb phrase, and so on, and the hierarchical structure of those constituents. Sells argues for the superiority of a base-generated account of the phenomenon known as Object Shift, and shows how an account based on the notion of Alignment within a ranked constraint system provides a natural account of it. Stanford Monographs in Linguistics Distributed for CSLI Publications"]},{"title":"1-57586-231-X","paragraphs":["Hardback $59.95 1-57586-232-8 Paperback $22.95"]},{"title":"Lead doN't follo' Lernout & Hauspie Speech Products [L&H] is the world's leading provider of speech and language technology products, solutions, and services to businesses and individuals worldwide. It is our mission to break down language barriers through advanced translation technology and to enable people to interact by voice -in any language - with the machines that empower them. ii!i!!iii!~ !i!iiiiiill '~'~ Founded in 1987, L&H has revolutionized the development and application of advanced speech and language technologies. The company delivers the broadest array of","paragraphs":["iiiiiiiiiiiiii!i!i"]},{"title":"consumer, business and industry offerings in automatic dictation, translation, sound compression, voice synthesis and industrial documentation. As a NASDAQ and EASDAQ quoted company and headquartered in leper [Belgium], L&H maintains offices in more than forty nations in Europe, Asia, the Middle East, North America and South America. With over 5.000 employees - mainly linguists, scientists and engineers - we generated an annual revenue of $344 million in 1999. For the development of language and speech technology, ~ we currently have multiple vacancies within our linguistic ~o engineering department in our International Headquarters in leper [Belgium] for (m/f): ~ C o u+ a+[o n a ( LTngui + . Bahasa • Indonesia • Czech • English • European Spanish .Farsi • French • German • Greek • Hungarian • Urdu • Hindi •italian •Malay •Mandarin . Modern Standard Arabic • Polish .Swedish .Tamil •Thai •Turkish .Taiwanese Min Nan •Ukrainian .Vietnamese •Western Armenian Function: • You will work within a multi-disciplinary team of linguists, engineers and programmers on the development of software systems in the field of Speech, Artificial Intelligence and Language. • You will be involved in all aspects of the development life cycle and focus on system specification and design, implementation of linguistic rule sets, grapheme to phoneme conversion, prosodic analysis, software testing and quality control, preparation of documentation. • Training is given both on-the-job and through lectures and technical documentation. • Dedicated development environments are provided which allow language specialists to focus on their content: formalizing linguistic knowledge.","paragraphs":["iiiiiiiiiiiiii!i!"]},{"title":"If you are interested in one of these job opportunities and you believe to fulfil the required profile, please e-mail your detailed resume to: job-announce@lhs.be Lernout & Hauspie Speech Products, Personnel Department, Mr. Pierre Eggermont, Flanders Language Valley 50, B-8900 leper, Belgium. Fax: int+32 (0) 57.22.95.31 Visit our homepage http://www.lhsl.com. Profile: • University degree in linguistics, or equivalent; • (near) native speaker (of one of the abovementioned languages) with a conversational level of English; • solid grounding in linguistic theory; • good knowledge of and/or experience in one or more of the following areas: speech processing, natural language processing (NLP), computational linguistics, programming; • perseverance and thoroughness; • willingness to travel abroad for limited periods of time. L...ernout ,!~, Hauspie \" MIT CogNet TM The Cognitive and Brain Sciences Community Online","paragraphs":["MIT CogNet TM (http://cognet.mit.edu) is an electronic community for the cognitive and brain sciences. It brings together current and classic resources in the field and provides a unique, interactive forum for scholars, students, and professionals. Currently under development, MIT CogNet is a free service through August 31, 2000, and welcomes charter members during this period. Services of MIT CogNet TM include a searchable, full-text library with a growing collection of books, journals, and reference works; an academic almanac of cognitive science programs; HotScience editorials by invited scientists on groundbreaking or controversial aspects of their research; job listings; CV and bibliography utilities; virtual poster sessions; threaded discussion groups; a seminar manager with information about current seminars and lecture series at participating academic institutions; community member profiles; and more. MIT CogNet TM offers the latest research, reference, and professional tools for those working in the cognitive and brain sciences. Visit the site today and let us know what you think. Charter members who contribute content or comments on the site's functionality during the prototype phase will earn discounts on MIT Press books -- and on the subscription fee for MIT CogNet when it is officially launched (September 1, 2000)."]},{"title":"The MIT Press Everything from The MIT Press, and all the best from other publishers. Computer Science Neuroscience Cognitive Science Artificial Intelligence Economics Linguistics Philosophy Art Design Photography Architecture Science, Technology, & Society http://mitpress.mit.edu/bookstore 292 Main Street Kendall Square Cambridge MA 02142 617.253.5249 books@mit.edu","paragraphs":["I","III","I","I II I I","III","III"]},{"title":"nd Philosophy Editor-in-Chief: Manfred Krifka","paragraphs":["Dept. of Linguistics, University of Texas at Austin, USA Associate Editors: Nicholas Asher, Greg Carlson, Bob Carpenter, Stephen Crain, Jeroen Groenendijk, Laurence R. Horn, Beth Levin, Mark Richard, Anna Szabolcsi, Martin Stokhof Executive Board: Richmond H. Thomason, Greg Carlson, Francis J. Pelletier Linguistics and Philosophyfocuses on issues related to structure and meaning in natural language, as addressed in the philosophy of language, linguistic semantics, syntax and related disciplines, in particular the following areas: - philosophical theories of meaning and truth, reference, description, entailment, presupposition, implicatures, context-dependence, and speech acts; - linguistic theories of semantic interpretation in relation to syntactic structure and prosody, of discourse structure, lexcial semantics and semantic change; - psycholinguistic theories of semantic interpretation and issues of the processing and acquisition of natural language, and the relation of semantic interpretation to other cognitive faculties; - mathematical and logical properties of natural language and general aspects of computational linguistics; - philosophical questions raised by linguistics as a science: linguistics methodology, properties of linguistic theories and frameworks, and the relation of linguistics to other fields of inquiry. Contributions may be in the form of articles, replies, book reviews or review articles.","~~# Subscription Information","2000, Volume 23 (6 issues) ~\" p,\\so ~ ~,c~,~j -fLt li--lA~ll~ E lSSN0165-0157 / 'e\\e~u'~=,~, li~/ Subscription Rate:","NLG 765.00/USD 364.00, incl.p/h.","10% discount available for","LSA members"]},{"title":":3\" I-,I. \"0 \"O I Kluwer academic publishers Association for Computational Linguistics 2000","paragraphs":["MEMBERSHIP, CHANGE OF ADDRESS AND EMAIL, AND ORDER FORM Please refer to the end of this document for specific benefits, payment and ordering instructions. MEMBERSHIP Provide all personal information, even if you have previously done so, to be sure the ACL membership database is up-to-date. Write legibly, please! FULL NAME (first) (last/family) ADDRESS INSTITUTION TELEPHONE","(if not in address above) E-MAIL ADDRESS FAX Please IMMEDIATELY notify the ACL Office of address and email changes. Journal copies returned due to bad addresses will not be remailed until a $5.00 postage/handling fee is remitted. EMA1L (if available) IS USED TO DISTRIBUTE meeting, membership, and other announcements. PAYMENT METHOD OF PAYMENT (circle): [CHECK ] MONEY ORDER [ CREDI'I\" CARD [ BANK rl RANSFE~ CREDIT CARD INFORMATION (VISA AND MASTERCARD ONLY): CARD NUMBER EXPIRATION DATE CARDHOLDER'S NAME (as appears on card). GRAND TOTAL OF PAYMENT AUTHORIZED OR ENCLOSED $ (total from MEMBERSHIP, PUBLICATION, and WORKSHOPS/OTHER CONFERENCES SECTIONS) MEMBERSHIP DUES FOR 2000 Regular- I Year(S60) Regular-3 Year($ I g0) Regular-5 year(S300) Retired(S30) Joint-1 Year(S70) Joint-3 Year(S210) Joint-5 Year ($350) Unemployed(S30) Student(S30) Student-Employed(S60) MEMBERSHIP DUES $","Ist Class or Air ($10/year US, Canada, Mexico; $25/year elsewhere) OPTIONAL 1st CLASS/AIRMAIL JOURNAL MAILING $ RENEWALS received after 1 April 2000 pay $20 additional postage/handling fee LATE PAYMENT FEE $ INTERNATIONAL FUND: Allows ACL memberships and publications to be available to colleagues who have difficulty in using their national currencies or for whom membership would otherwise be impossible. Contributions may be tax deductible; check local regulations. Receipts are available upon request. INTERNATIONAL FUND $ TIlE DON AND BETTY WALKER INTERNATIONAL STUDENT FUND: This fund was set up to honor Don and Betty Walker. It supports select student travel to ACL meetings. Contributions may be tax deductible, and companies may provide matching funds; check local regulations. Receipts are available upon request. Make checks payable to \"THE WALKER FUND\". Visa and Mastei'card payments are also accepted. WALKER FUND $","TOTAL PAYMENT FOR MEMBERSHIP, WALKER AND INTERNATIONAL FUNDS (list in PAYMENT SECTION) $ PUBLICATIONS ORDER FORM JOURNAL BACK ISSUES: 1980-1999 VOLUMES--CIRCLE YEARS (1980-1990: Members $30; Others $60 // 1991-1999:Members $40;Others $80): [1980 1981 1982 i983 i984 1985 i986 1987 1988 1989 1990 [[ 1991 1992 1993 1994 1995 1996 1997 1998 1999 BACK ISSUES $","1st Class or air (each year: $10 U.S., Canada, Mexico; $20 elsewhere) BACK ISSUE OPTIONAL MAILING COSTS $ SUPPLEMENTS--Circle choice (Members $15; Others $30): 1992 Directory of Graduate Programs 1993 Survey of Courses SUPPLEMENTS $","1st Class or Airmail (each: $5 U.S., Canada, Mexico; $10 elsewhere) SUPPLEMENT OPTIONAL MAILING COST $ ACL PROCEEDINGS (each proceedings: Members $30; Others $60--lst Class or air: $10 U.S., Canada, Mexico; $25 elsewhere) CIRCLE or HIGHLIGHT CHOICE(S): 17th, San Diego, 1979 18th, Philadelphia, 1980 19th, Stanford, 1981 20th, Toronto, 1982 21st, Cambridge, 1983 22nd, see Coling-84 below 23rd, Chicago, 1985 24th, New York, 1986 25th, Stanford, 1987 26th,Buffalo,1988 27th, Vancouver, 1989 28th, Pittsburgh, 1990 29th, Berkeley, 1991 30th, Newark, 1992 31 st,Columbus, 1993 32nd, Las Cruces, 1994 33rd, Cambridge, 1995 34th, Santa Cruz, 1996 35th, Madrid, 1997(joint with EACL-97; order ACL-97 OR EACL-97) 36th, Montreal, 1998 (joint with Coling-98;see Coling-98 below for price:S75) 37 th College Park, 1999 CONFERENCES ON APPLIED NATURAL LANGUAGE PROCESSING (each proceedings: Members $30; Others $60--lst Class or air: $10 U.S., Canada, Mexico; $25 elsewhere): First, Santa Monica, 1983 Second, Austin, 1988 Third, Trento, 1992 Fourth, Stuttgart, 1994 Fifth, Washington, DC, 1997 Sixth, Seattle, 2000 (Joint with NAACL'00; ORDER ONE OR THE OTHER; available May 2000) EUROPEAN CHAPTER CONFERENCES (each proceedings: Members $30; Others $60-- 1st Class or air: $10 U.S., Canada, Mexico; $25 elsewhere): First, Pisa, 1983 Second, Geneva, 1985 Third, Copenhagen, 1987 Fifth, Berlin, 1991 Sixth, Utrecht, 1993 Seventh, Dublin, 1995 Eighth, Madrid, 1997 (joint with ACL-97 above:same single volume)Ninth, Bergen, 1999 Fourth, Manchester, 1989 NORTH AMERICAN CHAPTER CONFERENCES (each proceedings: Members $30; Others $60-- 1st Class or air: $10 U.S., Canada, Mexico; $25 elsewhere): First, Seattle, 2000 (Joint with ANLP'00; ORDER ONE OR THE OTHER; available May 2000) PROCEEDINGS TOTAL $ OPTIONAL MAILING TOTAL $ COLING PROCEEDINGS (note differences in proceedings prices; 1st Class or air delivery: 1984 is $15 U.S., Canada, Mexico; $25 elsewhere and for subsequent years: $20 US, Canada, Mexico; $40 elsewhere): COLlNG-84,Stanford, 984 (Members $45; Others $90) COLING-84 PROCEEDINGS $ COLING-88(2 vol),Budapest,1984(Members $45;Others $150) COLING-88 PROCEEDINGS $ COLING-90(3 vol.), Helsinki, 1990(Members $95; Others $190)COLING-90 PROCEEDINGS $ COLING-92(4 vol.), Nantes, 1992 (Members $75; Others $150) COLING-92 PROCEEDINGS $ COLING-94, Kyoto, 1994 (Members $75; Others $150) COLING-94 PROCEEDINGS $ COLING-96,Copenhagen, 1996(Members $75;Others $150)COLING-96 PROCEEDINGS $ COLING-98,Montreal, 1998 (Members $75; Others $150)COLING-98 PROCEEDINGS $","TOTAL PUBLICATIONS PAYMENT $ (list in PAYMENT SECTION) ACL SPECIAL INTEREST GROUPS' CONFERENCE AND WORKSHOP PROCEEDINGS Below is a list of the various proceedings currently available (as long as supply lasts). To place an order, please follow the standard payment procedures and indicate your proceedings choice(s) by filling in the dollar amount. 1991-1994 proceedings, 520 each; 1996 and beyond, 525 each (includes surface mailing costs). Airmail delivery is an additional 510 for each mailing of up to two proceedings copies. The Balancing Act, at ACL-94, Las Cruces, NM, 1 July 1994 $ Computational Phonology, at ACL-94, Las Cruces, NM, 1 July 1994 $ Tagging Text with Lexical Semantics: Why, What, and How?, at ANLP-97, Washington, DC, 4-5 April, 19975 Spoken Language Translation, at ACL/EACL-97, Madrid, Spain, 11-12 July 1997 $ Interactive Spoken Dialogue Systems: Bringing Speech and NLP Together in Real World Applications, at ACL/EACL-97, Madrid, Spain, 11-12 July 1997 $ Intelligent Scalable Text Summarization, at ACL/EACL-97, Madrid, Spain, 11-12 July 1997 $ Automatic Information Extraction and Building of Lexical Semantic Resources for NLP Applications Organized by EuroWordNet (LE2 4003), Sparkle (LE 2111 ) and Ecran, at ACL/EACL-97, Madrid, Spain, 11-12 July 1997 $ From Research to Commercial Applications: Making NLP Technology Work in Practice, at ACL/EACL-97, Madrid, Spain, 11-12 July 1997 $ Computational Natural Language Learning (CoNLL '97), at ACL/EACL-97, Madrid, Spain, 11-12 July 1997 5 Computational Phonology, Third Meeting of the ACL Special Interest Group In Computational Phonology, at ACL/EACL-97, Madrid, Spain, 11-12 July 1997 $ First Workshop on Computational Terminology, at Coling-ACL'98, Montreal, Canada, 15 August 1998 $ Processing of Dependency-based Grammars, at Coling-ACL'98, Montreal, Canada, 15 August 1998 $ The Computational Treatment of Nominals, at Coling-ACL'98, Montreal, Canada, 16 August 1998 5 Usage of WordNet in Natural Language Processing Systems, at Coling-ACL'98, Montreal, Canada, 16 August 1998 $ Unsupervised Learning in Natural Language Processing, at ACL'99, College Park, MD, 20-26 June 1999 $ Discourse/Dialogue Structure and Reference, at ACL'99, College Park, MD, 20-26 June 1999 $ Coreference and its Applications, at ACL'99, College Park, MD, 20-26 June 1999 $ Towards Standards and Tools for Discourse Tagging, at ACL'99, College Perk, MD, 20-26 June 1999 $ Computer-Mediated Language Assessment and Evaluation in Natural Language Processing (Joint Symposium with IALL), at ACL'99, College Park, MD, 20-26 June 1999 $ SIGLEX99: Standardizing Lexical Resources, at ACL'99, College Park, MD, 20-26 June 1999 $ Computational Natural Language Learning (CoNLL-99), at EACL'99, Bergen, Norway, 12 June 1999 $ Computer and Intemet Supported Education in Language and Speech Technology, at EACL'99, Bergen, Norway, 12 June 1999 $ Applied Interlinguas: Practical Applications of Interlingual Approaches to NLP, at ANLP/NAACL2000, Seattle, WA, 30 April 2000 $ Automatic Summarization, at ANLP/NAACL2000, Seattle, WA, 30 April 2000 $ Syntactic and Seanantic Complexity in Natural Language Processing Systems, at ANLP/NAACL2000, Seattle, WA, 30 April 2000 $ Reading Comprehension Tests as Evaluation for Computer-Based Language Understanding Systems, at ANLP/NAACL2000, Seattle, WA, 30 April 2000 $ Conversational Systems, at ANLP/NAACL2000, Seattle, WA, 30 April 2000 $ Embedded Machine Translation Systems, at ANLP/NAACL2000, Seattle, WA, 30 April 2000 $ New Methods in Language Processing and Computational Natural Language Learning (Ne~3/CoNLL98, at Sydney, Australia, 11-17 January 1998 $ Proceedings of the International Workshop on Finite State Methods in Natural Language Processing (FSMNLP'98), at Ankara, Turkey, 30 June-I July 1998 $ Proceedings of the Ninth International Workshop on Natural Language Generation, at Niagra-on-the-Lake, Ontario, Canada, 5-7 August 1998 $ Conference on Empirical Methods in Natural Language Processing, Philadelphia, PA, 17-18 May 1996 $ Second Conference on Empirical Methods in Natural Language Processing, Providence, RI, 1-2 August 1997 5 Third Conference on Empirical Methods in Natural Language Processing, Granada, Spain, 2 June 1998 $ Joint SIGDAT Conference on Empirical Methods in Natural Language Processing and Very Large Corpora (EMNLP/VLC'99), at ACL'99, College Park, MD, 20-26 June 1999 5 Third Workshop on Very Large Corpora, at ACL-95, Cambridge, MA, 30 June 1995 $ Fourth Workshop on Very Large Corpora, at Coling-96, Copenhagen, Denmark 4 August 1996 5 Fifth Workshop on Very Large Corpora, Beijing, China, 18 August 1997 and Hang Kong, 20 August 1997 5 Sixth Workshop on Very Large Corpora, at Coling-ACL'98, Montreal, Canada, 15-16 August 1998 5 Joint SIGDAT Conference on Empirical Methods in Natural Language Processing and Very Large Corpora (EMNLP/VLC'99), at ACL'99, College Park, MD, 20-26 June 1999 5 Plus airmail costs ($10 per each 1-2 copies) TOTAL WORKSHOP/OTHER CONFERENCES ORDER (List total in PAYMENT SECTION) $ BENEFITS, PAYMENT AND ORDERING INSTRUCTIONS Membership in the Association for Computational Linguistics is for the calendar year, regardless of when dues are paid. Membership includes a full year of the ACL journal, Computational Linguistics, reduced registration at most ACL-sponsored conferences, and discounts on ACL-sponsored publications. Payments for membership dues, fund donations, back issues, and proceedings may be made in Europe or the USA. IMPORTANT NOTE: Renewals must be received no later than I April 2000 to avoid late payment fee assessment. Membership categories include Regular Members and the following: Couples with the same mailing address may be Joint Members; they will receive only one set of publications, but each will be eligible for all other member benefits. Students taking a full-time program of courses and not earning a regular income may become Student Members WITH COPY OF CURRENT STUDENT ID. Students who are not Student Members because of their income can still participate in student activities as Student-Employed. Also available are Retired and Unemployed memberships. We now offer MULTI-YEAR MEMBERSHIPS to Regular and Joint members. If no indication is provided of multi-year membership preference, one-year membership will be presumed for Regular and Joint. Late payment fee does not apply to new memberships. INSTITUTIONS/NON-MEMBERS: Subscribe to the 2000 journal through MIT Press Journals, 5 Cambridge Center, Cambridge, MA 02142, USA; phone +1-617-253-2889; fax +1-617-577-1545; joumals-orders@mit.edu. Institutional orders for back issues (1988-) should also be ordered from MIT Press Journals. All other journal back issues orders are available through the ACL. Publications: Non-members and institutions must place orders directly to: Morgan Kaufmann Publishers, Order Fulfillment Department, 6277 Sea Harbor Drive, Orlando, FL, 32887 USA, +1-800-745-7323 phone, + 1-800-874-6418 fax, orders@mkp.com. JOURNAL BACK ISSUES: Back issues of Computational Linguistics and two supplements, a Directory of Graduate Programs in Computational Linguistics, 3rd edition, and a Survey of Computational Linguistics Courses, revised in 1993, are available from the ACL Office to members, non-members and institutions alike. Surface mailing costs are included in thc prices; additional charges for 1st class or air delivery are noted. ORDERS BY MEMBERS FOR USE IN LABORATORIES OR LIBRARIES MUST BE PAID AT THE \"OTHERS\" RATE. PROCEEDINGS: Proceedings are available to ACL members through the ACL. COLING proceedings may also be ordered through the ACL. Surface mailing costs are included in the prices; additional charges for 1st class or air delivery are noted on the order form. ORDERS BY MEMBERS FOR USE IN LABORATORIES OR LIBRARIES MUST BE PAID AT THE \"OTHERS\" RATE. PREPAYMENT is necessary; invoices and receipts are available upon request. The U.S. dollar price is definitive when paying in other currencies, although rounding off is appropriate. CHECKS AND MONEY ORDERS SHOULD BE PAYABLE TO THE ASSOCIATION FOR COMPUTATIONAL LINGUISTICS (or to ACL). Payment may be made by sending this form (or all pertinent details) and credit card information in email to acl!i~aclweb.or~, or by fax. The following payment choices are available: 1. CREDIT CARDS: Credit card payments MUST BE MADE TO THE ACL OFFICE IN THE USA. Visa and Mastercard only. Email, fax or hardcopy are acceptable. 2. CHECKS/MONEY ORDERS: TO THE ACL OFFICE IN THE USA: Send this dues form in hardcopy with a check or money order to the address below. PAYMENTS MUST BE IN U.S. DOLLARS, DRAWN ON A U.S. BANK OR IN U.S. OR CANADIAN DOLLARS (CALCULATED AT THE CURRENT EXCHANGE RATE), DRAWN ON A CANADIAN BANK. 3. PAYMENTS TO EUROPE: Mail this form to Rosner with either (i) a Eurocheque or banker's draft IN SWISS FRANCS, payable \"ACL\" or (ii) a standard personal cheque drawn on a French bank in FRENCH FRANCS, payable \"ACL\" or (iii) photocopy evidence of interbank transfer to \"ACL\", account number 141.880.LAV at the Union Bank of Switzerland, 8 Rue du Rhone, CH-1211 Geneva 1 I. SWITZERLAND. Dollar price is definitive. For exchange rate information, use daily published exchange rate or see http://www.cs.um.edu.mt/acl/. NOTE THAT EUROPEAN MEMBERS SHOULD PAY THROUGH ROSNER UNLESS THEY PAY BY CREDIT CARD OR USE A U.S. BANK ACCOUNT. Assoc. for Computational Linguistics +1-732-342-9100 phone; 75 Paterson Street, Suite 9 +1-732-342-9339 fax New Brunswick, NJ 08901 USA acl@aclweb.org [ Dr. Michael Rosner I Dept. Computer Science & AI I University of Malta I Msida, MALTA +356-32-90-25-04 phone; +356-32-05-39 fax mros@cs.um.edu.mt"]},{"title":"Guidelines for Submissions","paragraphs":["Submissions may be made in any of the following categories: Papers (Short or Long), Letters to the Editor, Squibs and Discussions): Papers report significant new research results in computational linguistics. Each paper is reviewed by at least two experts in the field. The submission of an article to CL for refereeing means that it has not been copyrighted, has not been published in or submitted for publication to another refereed archival publication, and has not appeared in any conference or workshop proceedings. The submitted manuscript must be available for peer review without restriction. If any version of the paper has appeared, or will appear, in any other publication, the details of such publication must be made known to the Editor at the time of submission. The final version of a paper tentatively accepted for publication must be accompanied by a Copyright Transfer Agreement signed by all of the authors or, in the case of a \"work for hire,\" by the employer. This written transfer is necessary under the 1978 U.S. Copyright law. Manuscripts for Computational Linguistics should be submitted on letter-size paper (8.5 by 11 inches, or A4), double-spaced throughout, including footnotes and references. The paper should begin with an informative abstract of approximately 150-250 words. Manuscripts must be written in English. Guidelines for electronic submission and style files are available from http://www.aclweb.org/cl/. Submissions should be specified by the submitter as a submission to one of two categories, Short Papers or Long Papers, and must include word counts. Papers in these two categories will be reviewed by slightly different procedures: Short Papers, of no more than 15 journal pages (about 4000 words), will receive expedited review by two reviewers. Such a paper might, for example, contain a description of a single experiment, algorithm, or other technical result. Authors whose papers are accepted are expected to submit final versions within 8 weeks of notification. Long Papers, exceeding 15 journal pages, will receive standard review. Such a longer paper might, for example, describe the results of a large research project or dissertation. These submissions should normally not exceed 30 journal pages (about 8000 words). All submissions, regardless of length, will be held to the same standards of technical and presentation quality. Letters to the Editor: This category includes statements of opinion on issues relevant to the readership. TheEditor and the editorial board will evaluate the appropriateness of these contributions for inclusion. For hard copy submissions, five copies of papers or three copies of letters should be sent to: Julia Hirschberg, CL Editor AT&T Labs-Research Room A257 180 Park Avenue P.O. Box 971 Florham Park, NJ 07932-0971 emaihacl@research.att.com \" ' phone: (973) 360-8330 fax: (973) 360-8970 Squibs and Discussions: This category includes short articles reporting technical results, discussions of results, algorithms, or new computational linguistic data or tools of interest to the journal readership. Submissions should generally not exceed eight double-spaced journal pages and should be submitted to: Pierre Isabelle Xerox Research Centre Europe ernail: Pierre.Isabelle@xrce.xerox.corn 6, chemin de Maupertuis phone:+33 4 76 61 51 98 38240 Meylan, France fax: +33 4 76 61 50 99 Book Section: Anyone interested in reviewing a book, or in suggesting a book for review, should contact the Book Review Editor; publishers may also submit copies of books for review directly to: Graeme Hirst, CL Book Review Editor University of Toronto Department of Computer Science Toronto, CANADA M5S 1A4 (+1 416 978-8747; gh@cs.toronto.edu Founded in 1962, the Association for Computational Linguistics (ACL) is the primary scientific and professional society for natural language processing research and applications. A European chapter was established in 1982 and a North American chapter was established in 1999. Besides publishing Computational Linguistics, the ACL holds international meetings annually as well as sponsoring frequently-held European and North American chapter meetings where the state-of-the-art in natural language processing research and development is presented. Special interest groups on the Mathematics of Language, the Lexicon, Parsing, Generation, Computational Phonology, Multimedia Language Processing, Very Large Corpora, Natural Language Learning, and Dialogue Processing have been formed; others are likely to be added. President (2000) Wolfgang Wahlster Vice-President (2000) Vice President-elect (2000) Secretary-Treasurer (1998-01) Past-President (2000) Business Manager (1999-01) Executive Committee (1998--00) (1999-01) (2000-02) (2000-02) Journal Editor Chair of the EACL (1999-2000) Chair of the NAACL (2000-2001) Nominating Committee (1998-00) (1999-01) (2000-02) DFKI Stuhlsatzenhausweg 3 D-66123 Saarbruecken GERMANY +49-681-302-5252; +49-681-302-5341 fax • wahlster@dfki.de Eduard Hovy USC Information Sciences Institute 4676 Admiralty Way Marina del Rey, CA 90292-6695 USA (+1-310) 448-8731; (+1-310 823-6714 fax hovy@isi.edu John Nerbonne University of Groningen P.O. Box 716 Oude Kijk in \"t Jatstraat 26 NL-9700 AS Groningen The Netherlands (+31) 50 363 58 15; (+31) 50 363 68 55 fax nerbonne@let.rug.nl Kathleen F. McCoy University of Delaware Computer and Information Sciences Newark, DE 19716, USA (+1-302) 831-1956; mccoy@cis.udel.edu (+1-302) 831-4091 fax Philip R. Cohen Center for Human-Computer Communication Oregon Graduate Institute 20000 NW Walker Road Beaverton, OR 97006, USA (+1-503) 690-1326; (+1-503) 690-1548 pcohen@cse.ogi.edu Priscilla Rasmussen Association for Computational Linguistics (ACL) 75 Paterson Street, Suite 9 New Brunswick, NJ 08901, USA (+1-732) 342-9100; (+1-732) 342-9339 fax acl@aclweb.org President, Vice-President, Vice President-elect, Secretary-Treasurer,","Past-President and: Stephen ~Pulman, Uniw~,rsity of Cambridge/SRI Cambridge sgp@cam.sri.com Dekai Wu, University of Science and Technology dekai@cs.ust.hk Felisa Verdejo, Universidad Naeional de Educacion a Distancia felisa@ieec.uned.es David Yarowsky, Johns Hopkins University yarowsky@cs.jhu.edu Julia Hirschberg, AT&T Labs-Research julia@research.att.com Donia Scott, University of Brighton Donia.Scott@itri.brighton.ac.uk Diane Litman, AT&T Labs-Research diane@research.att.com Mitch Marcus, University of Pennsylvania mitch@linc.cis.upenn.edu Eva Hajicova, Charles University hajicova@ufal.ms.mff.cuni.cz Philip R. Cohen, Oregon Graduate Institute pcohen@cse.ogi.edu"]}]}