{"sections":[{"title":"","paragraphs":["Book Reviews"]},{"title":"The MIT Encyclopedia of the Cognitive Sciences Robert A. Wilson and Frank C. Keil (editors)","paragraphs":["(University of Illinois, Urbana-Champaign and Yale University) Cambridge, MA: The MIT Press (A Bradford Book), 1999, cxxxii+964 pp; hardbound, ISBN 0-262-23200-6, $149.95, £93.50; CD-ROM, ISBN 0-262-73124-X, $149.95, £93.50"]},{"title":"Reviewed by John Nerbonne University of Groningen 1. Overview The MIT Encyclopedia of the Cognitive Sciences","paragraphs":["(MITECS) brings together 471 brief articles on a very wide range of topics within cognitive science. The general editors worked with advisory editors in six contributing fields, including Gennaro Chierchia on Linguistics and Language and Michael I. Jordan and Stuart Russell on Computational Intelligence. MITECS opens with excellent overview articles by each of the advisory editors on their fields.","The general quality of the contributors and their contributions is outstanding. The editors secured the cooperation of leading scientists in every area including computational linguistics. Tables 1 and 2 suggest articles that are of particular interest in computational linguistics. The division into sections is that of the book's companion Web site; 1 in the printed volume, the articles are arranged in a single alphabetical sequence.","There are many other articles of immediate interest, including several on grammar models popular in CL (Mark Steedman on Categorial Grammar, Georgia Green on Head-Driven Phrase Structure Grammar, and Mary Dalrymple on Lexical Func-tional Grammar) and several that treat computational simulations of psycholinguistic phenomena. Dennis Norris's general article on computational psycholinguistics focuses nicely on interdisciplinary issues; it motivates why a range of computational models remain interesting within cognitive science when language is the subject of investigation. 2. Cognitive Science or Cognitive Sciences? It is noteworthy that the editors do not attempt a general overview article on cognitive science, and that MITECS promises information on the cognitive sciences (plural). This suggests a fragmented view of the field, which, coming from its greatest authorities, must be taken seriously. It is also reflected in the relatively little attention paid to specifically cognitive issues in many of the articles (for example, the articles on Infor-1 Buyers of the printed volume can apply for on-line access to the full text of the book at"]},{"title":"http://cognet.mit.edu/MITECS/;","paragraphs":["others may browse a list of the articles, and their abstracts and bibliographies. 463 Computational Linguistics Volume 26, Number 3 Table 1 A selection of articles in Intelligence.\" the MITECS section \"Computational Michael Arbib Rick Lewis Bernhard Nebel Eduard Hovy Eduard Hovy James Allen Eugene Charniak Lawrence Rabiner Stephen Isard Automata (Symbolic) Cognitive Modeling Frame-Based Systems Machine Translation Natural Language Generation Natural Language Processing Statistical Techniques in NLP Speech Recognition in Machines Speech Synthesis Table 2 A selection of articles in the MITECS section \"Linguistics and Language.\" Michael Tanenhaus","and Julie C. Sedivy James Pustejovsky Aravind Joshi Paul Smolensky Craige Roberts Edward Stabler Geoffrey Pullum Anne Cutler Paul Gorrell Anne Cutler Ambiguity Computational Lexicons Computational Linguistics Connectionist Approaches to Language Discourse Formal Grammars Generative Grammar Prosody and Intonation, Processing Issues Sentence Processing Spoken Word Recognition mation Theory, Inductive Logic Programming, Pattern Recognition and Feed-forward Networks, and others all have little or nothing to say about specific applications within cognitive science). Hector Levesque's article on Computational Complexity and Judea Pearl's article on Bayesian Networks are notable exceptions: both consider the implications for cognitive science explicitly. It is easy to understand the editorial decision to look to the major authorities on specific subjects and techniques rather than to researchers who have emphasized application to issues of cognitive structure and processing, but it reinforces the view of cognitive science as fragmented, perhaps immature. 3. Computational Linguistics The CL articles may all be recommended. They will not serve professional computational linguists directly, but rather students in computational linguistics and colleagues in allied fields who wish to get an idea of what CL is. One nonetheless gets the impression that CL fared suboptimally in the division of labor among the editors. To take one obvious example, the articles on Computational Linguistics (by Aravind Joshi in the section \"Language and Linguistics\") and on Natural Language Processing (by James Allen in the section \"Computational Intelligence\") take little note of each other. The article on CL mentions NLP as an alternative name for our field without, however, referring to the other article (in the fashion MITECS uses elsewhere). The NLP article in turn discusses Machine Translation with no reference to the full article by Hovy. 464 Book Reviews","If computational linguistics focuses on language from a computational perspective (my favorite brief definition), then we might expect the Chomsky hierarchy of languages and automata, together with their processing properties, to figure somehow centrally, but this topic falls through the cracks. Arbib's article is extremely general, for example explaining finite automata and regular languages (\"finite-state languages\") only as control mechanisms for Turing machines. The applicability of finite automata to phonology and morphology gets no mention. Stabler's article on formal grammars is interesting, but focuses on very general questions about the relation between human language and formal models, in particular about the sorts of idealizations common in work on formal language theory inspired by human language.","MITECS naturally reflects the impact that CL has on its scholarly neighbors in cognitive science. It is gratifying to see CL acknowledged on the one hand in articles on computation, for example in Bernhard Nebel's piece on Frame-Based Systems, and on the other hand in articles on language, for example in Craige Roberts's article on Discourse. Such references suggest cross-pollination of the sort that interdisciplinary activity is meant to promote.","If MITECS may be taken as a reliable guide, however, then CL has limited impact on cognitive science. Paul Gorrell's article on Sentence Processing might be expected to attend to some of the work done on parsing in computational linguistics, but does not. He mentions the Marcus parser and psycholinguistic work by Steedman in the (miscited) volume edited by Dowty, Karttunen and Zwicky (1985), but ignores a computational contribution there by Pereira (1985). There is no mention of incremental processing, which Steedman (1990), Joshi (1990), Pereira and Pollack (1991), Shieber and Johnson (1993), Nerbonne (1996), and others have written on. Tanenhaus and Sedivy's article on ambiguity might be expected to teem with references to the disambiguation problem that has arguably been a major focus of CL over the past 20 years. The article acknowledges only that ambiguity is a \"central problem\" in CL and is content to refer only to Allen (1995). There is no reason to doubt Gorrell's or Tanenhaus and Sedivy's scholarship; rather, it suggests rather that CL work has little influence on cognitive science of this sort.","Several articles report on psycholinguistic simulations that are taken to embody hypotheses about human processing--for example, Norris's article (mentioned above), and the two articles by Anne Cutler. These suggest points at which computational linguists might profitably play a more active role. Computational models already exist that account for human behavior with respect to recognition time, error as a function of word frequency and similarity, and several other parameters that normally play no role in core CL. These additional parameters might serve as interesting data from a purely computational view. This sort of work is reported on by Dijkstra and de Smedt (1996), but is not found (much) at ACL or similar conferences. MITECS suggests that it is an interesting path to pursue further. It includes a nice pair of papers by Rick Lewis and James McClelland on more general issues of symbolic versus comlectionist cognitive modeling."]},{"title":"4. Developments","paragraphs":["MITECS includes further sections \"Neuroscience\" and \"Culture, Cognition, and Evolution.\" The former normally receives routine but less inspired attention in introductory texts, but is an equal partner here. It is an area in which an interesting rapprochement with psychology and psycholinguistics is underway, to judge from contributions in this volume (articles on Object Recognition by Martha Farah, Aphasia by David Swinney, and Dyslexia by Albert Galaburda; a series of articles on the Neural 465 Computational Linguistics Volume 26, Number 3 Bases of Grammar by David Caplan, Language by Nina Dronkers, Lexicon by Alfonso Caramazza, and Phonology by Sheila Blumstein; and an article on Sign Language and the Brain by David Corina).","Culture, cognition, and evolution is not a topic normally included in introductory texts on cognitive science, but may provide a fruitful perspective from which to examine the current emphasis on \"empiricist\" methods in CL. The emphasis on general data analysis techniques (as opposed to specifically linguistic methods) in data-intensive CL may find its psychological counterpart in the emphasis on the rich culture within which verbal activity is learned. Whether or not that seems plausible, Stephen Levinson's article on Language and Culture is a useful modern perspective on the issue of how culture, cognition, and language might be seen to interrelate. 5. Recommendation Naturally, there are variations in style and quality in the articles, but on the whole they are very good. More importantly for some purposes, the level at which the articles are written is a bit uneven. Most articles will be accessible to advanced undergraduates in any of the federated fields, but certainly not the articles on Bayesian Learning, Control Theory, Statistical Learning Theory, Unsupervised Learning, and several others, all of which rely on terse mathematical presentations.","The book is technically adequate: it is surprisingly sober, including relatively few diagrams, charts, tables, or photos. An interesting article on Meter in Poetry by Jay Keyser is marred by poor typesetting. Invaluable on the other hand, are the bibliographies at the ends of the articles. These appear to have enjoyed special attention, and include very recent and, in general, very useful material. Only very occasionally do we find contributors lapsing into references to \"(unpublished)\", \"(ms.)\", or the like.","MITECS is to be recommended to all libraries and to researchers in computational linguistics interested in cognitive science, especially those interested in how the fields of linguistics, computation, and psychology might cooperate more effectively in understanding language. References Allen, James. 1995."]},{"title":"Natural Language Understanding.","paragraphs":["Second edition. Benjamin/Cummings, Menlo Park, CA.","Dijkstra, T. and Koen de Smedt, editors. 1996,"]},{"title":"Computational Psycholinguistics.","paragraphs":["Taylor, London.","Dowty, David, Lauri Karttunen, and Arnold Zwicky, editors,"]},{"title":"Natural Language Parsing: Psychological, Computational, and Theoretical Perspectives.","paragraphs":["Cambridge University Press, Cambridge, England.","Joshi, Aravind K. 1990. Phrase structure and intonational phrases: Comments on the chapters by Marcus and Steedman. In Gerry T. M. Altmann, editor,"]},{"title":"Cognitive Models of Speech Processing.","paragraphs":["The MIT Press, Cambridge, MA, pages 513-531.","Nerbonne, John. 1996. Computational semantics--linguistics and processing. In Shalom Lappin, editor,"]},{"title":"Handbook of Contemporary Semantic Theory.","paragraphs":["Blackwell Publishers, London, pages 459-482.","Pereira, Fernando C. N. 1985. Characterization of attachment preferences. In David Dowty, Lauri Karttunen, and Arnold Zwicky, editors,"]},{"title":"Natural Language Parsing: Psychological, Computational, and Theoretical Perspectives.","paragraphs":["Cambridge University Press, Cambridge, England, pages 307-319.","Pereira, Fernando C. N. and Martha Pollack. 1991. Incremental interpretation."]},{"title":"Artificial Intelligence,","paragraphs":["50:37-82.","Shieber, Stuart and Mark Johnson. 1993. Variations on incremental interpretation."]},{"title":"Journal of Psycholinguistic Research,","paragraphs":["22(2):287-318.","Steedman, Mark. 1990. Syntax and intonational structure in a combinatory grammar. In Gerry T. M. Altmann, editor,"]},{"title":"Cognitive Models of Speech Processing.","paragraphs":["The MIT Press, Cambridge, MA, pages 457-482. 466 Book Reviews John Nerbonne teaches computational linguistics at the University of Groningen. His recent research applies machine learning techniques to phonology and syntax. Nerbonne's address is Alfa-informatica, P.O. Box 716, NL 9700 AS Groningen, The Netherlands; e-mail: nerbonne@let. rug.nl; URL: www.let.rug.nl/~nerbonne. 467"]}]}