{"sections":[{"title":"Author Index Volume 25 Abrusci, V. Michele, Fouquer4, Christophe,","paragraphs":["and Vauzeilles, Jacqueline 25(2):209-236 Tree Adjoining Grammars in a Fragment of the Lambek Calculus Bangalore, Srinivas and Joshi, Aravind K. 25(2):237-265 Supertagging: An Approach to Almost Parsing Briscoe, Ted and Copestake, Ann 25(4):487-526 Lexical Rules in Constraint-based Grammars Bruce, Rebecca and Wiebe, Janyce 25(2):195-207 Decomposable Modeling in Natural Language Processing Carberry, Sandra and Lambert, Lynn 25(1):1-53 A Process Model for Recognizing Communicative Acts and Modeling Negotiation Subdialogues Chi, Zhiyi 25(1):131-160 Statistical Properties of Probabilistic Context-Free Grammars Chu-Carroll, Jennifer and Carpenter, Bob 25(3):361-388 Vector-based Natural Language Call Routing Green, Nancy and Carberry, Sandra 25(3):389-435 Interpreting and Generating Indirect Answers Goodman, Joshua 25(4):573-605 Semiring Parsing Heeman, Peter A. and Allen, James F. 25(4):527-571 Speech Repairs, Intonational Phrases, and Discourse Markers: Modeling Speakers' Utterances in Spoken Dialogue Lascarides, Alex and Copestake, Ann 25(1):55-105 Default Representation in Constraint-based Frameworks Melamed, I. Dan 25(1):107-130 Bitext Maps and Alignment via Pattern Recognition Nederhof, Mark-Jan 25(3):345-360 The Computational Complexity of the Correct-Prefix Property for TAGs Ritchie, Graeme 25(4):457-486 Completeness Conditions for Mixed Strategy Bidirectional Parsing Strube, Michael and Hahn, Udo 25(3):309-344 Functional Centering--Grounding Referential Coherence on Information Structure Suri, Linda Z., McCoy, Kathleen E, and DeCristofaro, Jonathan D. 25(2):173-194 A Methodology for Extending Focusing Frameworks Squibs Grosz, Barbara and Gordon, Peter C. 25(4):617~24 Conceptions of Limited Attention and Discourse Focus Knight, Kevin 25(4):607-615 Decoding Complexity in Word-Replacement Translation Models Li, Hang and Abe, Naoki 25(2):283-291 Learning Dependencies between Case Frame Slots Somers, Harold 25(2):267-275 Aligning Phonetic Segments for Children's Articulation Assessment Wedekind, Jiirgen 25(2):277-291 Semantic-driven Generation with LFG- and PATR-style Grammars Book Reviews Bod, Rens 25(3):440-444 Beyond Grammar: An Experience-based Theory of Language Reviewed by Michael Collins Carpenter, Bob 25(3):445-449 Type-Logical Semantics Reviewed by Stephen Pulman Cole, Ronald (Editor-in-Chief), Mariani, Joseph, Uszkoreit, Hans, Zaenen, Annie, and Zue, Victor, editors 25(1):161-164 Survey of the State of the Art in Human Language Technology Reviewed by Varol Akman Fass, Dan 25(3):450-451 Processing Metonymy and Metaphor Reviewed by Stephane Ferrari Fellbaum, Christiane, editor 25(2):292-296 WordNet: An Electronic Lexical Database Reviewed by Dekang Lin Fontenelle, Thierry 25(3):447-449 Turning a Bilingual Dictionary into a Lexical-Semantic Database Computational Linguistics Volume 25 Number 4 Reviewed by Christine Thielen Granger, Sylviane 25(2):302-303 Learner English on Computer Reviewed by Greg Lessard Jelinek, Frederick 25(2):297-298 Statistical Methods for Speech Recognition Reviewed by Eric Neufeld Kennedy, Graeme 25(2):299-301 An Introduction to Corpus Linguistics Reviewed by Vincent B.Y. Ooi Lakoff, George and Johnson, Mark 25(4):631-634 Philosophy in the Flesh: The Embodied Mind and its Challenge to Western Thought Reviewed by John E Sowa Lebart, Ludvic, Salem, Andr4, and Barry, Lisette 25(1):165-166 Exploring Textual Data Reviewed by Douglas Biber Nerbonne, John 25(1):167-169 Linguistic Databases Reviewed by J6rg Tiedemann Schiitze, Hinrich 25(3):436-439 Ambiguity Resolution in Language Learning: Computational and Cognitive Models Reviewed by Dan Melamed and Hang Li Vossen, Piek 25(4):628-630 EuroWordNet: A Multilingual Database with Lexical Semantic Networks Reviewed by Graeme Hirst Walker, Marilyn, Joshi, Aravind K., and Ellen E Prince, 25(4):625-627 Centering Theory in Discourse Reviewed by Ruslan Mitkov 644"]}]}