{"sections":[{"title":"Book Reviews Survey of the State of the Art in Human Language Technology Editorial Board: Ronald Cole (Editor-in-Chief), Joseph Mariani, Hans Uszkoreit, Annie Zaenen, Victor Zue","paragraphs":["(Oregon Graduate Institute of Science and Technology; Istituto di Linguistica Computazionale del CNR; Deutsches Forschungszentrum f6r K/instliche Intelligenz and Universitat des Saarlandes; Rank Xerox Research Center, Grenoble; Massachusetts Institute of Technology) Cambridge University Press (Studies in Natural Language Processing) and Giardini Editori e Stampatori in Pisa"]},{"title":"(Linguistica Computazionale,","paragraphs":["volumes XII-XIII), managing editors: Giovanni Battista Varile and Antonio Zampolli, 1997, xx+513 pp; hardbound, Cambridge University Press ISBN 0-521-59277-1, £35.00, $49.95; Giardini Editori ISBN 88-427-0018-5"]},{"title":"Reviewed by Varol Akman Bilkent University","paragraphs":["\"We open our mouths and out flow words whose ancestries we do not even know. We are walking lexicons .... We carry a museum inside our heads .... I find this miraculous. I never cease to wonder at it.\" These words of Penelope Lively, appearing in Jean Aitchison's"]},{"title":"The Language Web","paragraphs":["(Cambridge University Press, 1997), economically portray our general feelings of awe vis-a-vis language. And now there is this 500-page volume"]},{"title":"(HLT","paragraphs":["hereafter), sponsored by the Directorate General XIII of the European Union and the Information Science and Engineering Directorate of the NSF, offering a materialized version of this awe, in the form of an overview of the technology of human language at the close of the twentieth century. Human language technology is a multidisciplinary enterprise, unifying methods from computer science, linguistics, electrical engineering, cognitive psychology, etc. Its major goal is to advance the quality of con~nunication between humans and computers by arming the latter with proficiency in spoken and written language."]},{"title":"HLT","paragraphs":["is the work of a committee and is intended as a comprehensive, definitive survey of all the important ingredients of this strategic field. Unfortunately, in this reviewer's opinion, it does not wholly succeed in this endeavor. But the book does not fail badly or dramatically either. What we have here is a respectable venture which is useful but may fade (should I say \"sink\"?) into oblivion in a couple of years. In other words,"]},{"title":"HLT","paragraphs":["is a book that does not seem likely to achieve a lofty position in the literature of computational language research--a pretty lamentable position to be in for a work of this magnitude. So, what went wrong? Computational Linguistics Volume 25, Number 1","Before I take up that question, let me note various points about HLT, including","the fact that the complete book is available--or was available at the time of writing","of this review--on the Web: 1 http://www.cse.ogi.edu/CSLU/HLTsurvey/HLTsurvey.html","Here is a list of the chapters: 1. Spoken Language Input (approx. 60 pp) 2. Written Language Input (approx. 30 pp) 3. Language Analysis and Understanding (approx. 45 pp) 4. Language Generation (approx. 25 pp) 5. Spoken Output Technologies (approx. 35 pp) 6. Discourse and Dialogue (approx. 25 pp) 7. Document Processing (approx. 25 pp) 8. Multilinguality (approx. 40 pp) 9. Multimodality (approx. 35 pp) 10. Transmission and Storage (approx. 15 pp) 11. Mathematical Methods (approx. 45 pp) 12. Language Resources (approx. 25 pp) 13. Evaluation (approx. 35 pp) Each of these chapters opens with a profitable summary, written by an editorial board member and setting the stage for the more-detailed contributions (in the form of sections) that follow it. Each section deals with the major successes, methods, and research problems of a particular special topic. Just to give an impression of the degree of granularity for an average chapter, here is a breakdown of sections for Chapters 1, 3, and 6, respectively (excluding the chapter overviews and references): 1.2 1.3 1.4 1.5 1.6 1.7 1.8 Speech recognition Signal representation Robust speech recognition HMM [Hidden Markov Model] methods in speech recognition Language representation Speaker recognition Spoken language understanding 1 Maybe this is considered typical nowadays (I know that The MIT Press also practices it for some books, albeit more carefully and sparingly) but I have some difficulty in understanding it. Surely, I would not mind--and in fact would regard it as an exalted effort--if the survey had only an electronic existence, without the imprint of such an estimable publisher as the Cambridge University Press. But HLT is published as a hardcover book, so I cannot help but raise the question: Who will buy this book if it is within the comfortable reach of every graduate student and professor? Libraries, maybe? Or research labs with dollars to disburse? Needless to say, these are queries for Cambridge University Press, not the editors of HLT. In any case, unless one has a weak spot for bound volumes, my suggestion, naturally, would be not to buy the book but to make liberal use of the Web version. 162 Book Reviews 3.2 Sub-sentential processing 3.3 Grammar formalisms 3.4 Lexicons for constraint-based grammars 3.5 Semantics 3.6 Sentence modeling and parsing 3.7 Robust parsing 6.2 Discourse modeling 6.3 Dialogue modeling 6.4 Spoken language dialogue","The full catalogue of contributors to HLT reads like Who's Who in Language. A brief and clearly one-sided list reflecting my own research tastes (after all, there are about 100 authors) includes Annie Zaenen, Hans Uszkoreit, Lauri Karttunen, Fernando Pereira, Hans Kamp, Per-Kristian Halvorsen, Karen Sparck Jones, Martin Kay, Aravind Joshi, Ronald Kaplan, and Ken Church. The authority of the contributors is one aspect of this volume which no one need doubt; HLT is the product of some of the best minds actively toiling in the trenches.","With so many top-notch researchers contributing to this book, one would expect the outcome to be no less than breathtaking. Alas, this has not happened. What one has instead is a boring, run-of-the-mill product that would hardly impress a person having only a broad acquaintance with the fields of NLP and speech processing. In stark contrast, A Companion to the Philosophy of Mind (edited by Samuel Guttenplan, Blackwell, 1994), another big book of a similar nature written by the brightest philosophers of mind, and with which I am familiar, is regarded as a towering success in philosophy circles. So such projects sometimes do achieve their goals. To repeat my earlier question, what is the problem with HLT?","The regrettable state of affairs regarding HLT is mainly due to two reasons. First, approximately 23% of the book is devoted to references. Another 13% is dedicated to a glossary, an author index (which does not miss the opportunity to misspell Chomsky's first name, in the tradition of Murphy), and a subject index. 2 To make a long story short, only less than two-thirds of the book promises any hope of presenting something of substance.","However, and this is my second point, of the approximately 75 sections a great majority are written in nontechnical language, glossing over the details. Clearly there are some good contributions but they are in the minority. 3 More often than not, what we have is a superficial review. 4 My impression is that the editors did not do their 2 On a related note, Chapter 12 includes, obviously with good intentions, four pages of e-mail and home-page addresses for language resources such as written and spoken language corpora. The annoying thing about such time-sensitive material is that it is somewhat obsolete even at the time of galley proofs. 3 I quite enjoyed the following sections: Robust speech recognition, HMM methods in speech recognition, Language representation, Sentence modeling and parsing, Dialogue modeling, (Human-aided) machine translation: A better future, Statistical modeling and classification, Parsing techniques. (This list is not exhaustive.) 4 For example, I found the following sections to be of doubtful quality: Handwriting analysis, Grammar formalisms, Semantics, Discourse and dialogue (overview), Discourse modeling, Finite state technology, Written language corpora, and almost all parts of Chapter 13. (Again, this is not an exhaustive list.) 163 Computational Linguistics Volume 25, Number 1 homework well. I realize that it took them two years and half-a-dozen meetings to create the volume. As a result, some authors have contributed quality pieces. Some others had the potential to write fine surveys but did not really deliver; their pieces were written far too hastily and this is glaringly obvious. It is as if these sections were scribbled while their authors were working on more important things such as journal articles or conference papers; it is so obvious that they did not devote themselves to the task at hand. (So the editor-in-chief's words, \"each author's contribution was carefully reviewed and revisions were requested,\" must be taken with a grain of salt.)","Overall, I wish the editors had taken the time to prepare a more polished product for publication. In the meantime, the Web version of the book could have been made available anyway. Furthermore, this would have been a pleasant opportunity to canvass the language technology community in general about their views of the book. In fact, if planned well, there is promise here for a higher-quality second edition, provided that a more leisurely (i.e., slow-paced) and conscientious approach as hinted above is adopted. It is fair to note that the managing editors insinuate the same point when they say \"comments received from our readers will encourage us to edit updated and improved versions of this work.\"","Nowadays almost all documents come with some kind of executive summary. What is it going to be in the case of this review? Well, I've already remarked that HLT is the work of a committee. So, remember that chestnut about camels and committees? That says it all. Varol Akman is a professor of computer engineering at Bilkent University. He received his Ph.D. in 1985 from Rensselaer Polytechnic Institute on a Fulbright scholarship. His areas of interest include contextual reasoning, situation semantics, and language and philosophy in general. Akman's address is: Department of Computer Engineering and Information Science, Bilkent University, Bilkent, Ankara 06533, Turkey; e-mail: akman@cs.bilkent.edu.tr 164"]}]}