{"sections":[{"title":"","paragraphs":["ON MODES OF DEPINITE REFERENCE: AN APPLICATION TO THE INTERACTION WITH DATABASE SYSTEMS Genevieve Bsr~y-Rogghe Temple University, CI8 Department; 03824 Philadelphia, PA 19122, U.S.A.","Identifying the referent of a singular definite term in a database query essentially consists in detemining its extension in the database by applying the Ruassllian truth conditions for definite descriptions. However, most definite descriptions are \"incomplete\" in that the description itself does not contain the uniquely specifying conditions but it should be au~nented by features derived from the situation or discourse context. Most work in AI in this field has concentrated on how to delimit the relevant contextual features (see, for example, the work on anapho~o reference and focussing by Webber 78, Sidner 77 and Grosz 76). This paper addresses certain aspects of the theory of definite reference which, though extensively treated in the literature on language philosophy, have been rather neglected in the design of natural language processing systemae.","Some of the ambiguities of definite reference derive from the fact that a definite description may denote some unique individual in the world satisfying the specification or some individual the speaker has in mind who may or may not coincide with the former (ie the \"referential\" versus the ,,attrib~tive n mode of reference). Furthelqnore~ the speaker may intend the hearer to interpret the rsfe~cl~ expression in either a \"value laden\" or a \"value free\" mode (cfr Ba~- wiee/Psx-~y 80). In the former mode the sentence is given - 32 - f a secondary interpretation by substitutin~ in it the entity fulfilling the description. This raises such issues as to whether definite descriptions may be used to inform as well as to refer (see Joshi 78). The first part of the paper attempts to characterize the phenomena variously referred to by such terms as intension/extenston, de ditto/de re, attrlbutlve/referentlal, value-free~value-laden... Some of these phenomena are to be accounted for on the semantic level of representation whereas others are deemed to belong to the pra~natic level,","The second part of the paper examines which of the modes of definite reference distinguished in paz~t I are manifested in the interaction with a database system and how they can be recognized by the natuxal language interface. The standard procedure for definite reference identification is to exclude generic and \"intensional\" uses; to assume identity between the referent the speaker believes fulfills the description and the actual referent and to uniformly impose a value-laden interpretation mode, The following examples illustrate some other modes of reference which should receive adequate treatment in a natural language interface extending its capicity beyond the mere retrieval of factual information.","The generic mode of reference is not always obviously distinguishable from the attributive mode as shown by (1) and (2), reepectlvely~","(1) How long is the flight from Boston to Chicago?","(2) How many passengers were on the flight from","Boston to Chicago?","The semantic interpretation of the definite article in (1) corresponds to the universal quantifier whereas Xn (2) it corresponds to the iota-operator. In contrast to the generic mode, a definite description is used \"intenaionally\" when the substitution of its extension in ~he sentence may alter the truth value. This is the case in referentially - 33 - opaque contexts. It hss been pointed out by Kaplan/Davidson 81 that certain update commands such as (3) may be referentially opaque:","(3) Change the teacher of CIS 234 to Dr. Smith.","The difference between the attributive and the referential uses, on the other hand, may be illustrated by the different replies (4a) end (4b), respectively, to query (4):","(4) Is there a car parked under the big cherry tree?","(4a) No. There is no cherry tree in the scene.","(4b) Yes. But the tree you are referring to is an oak.","In the referential mode of reference the hearer has an independent way of identifying the referent, usually through locating him in time and space. In this mode the description serves a dual function of referring and of describing. The referential mode is only likely to occur when interacting with a database consisting of visual objects displayed on a screen (as in the SRI and HAM-RPM projects). In the attributive mode the description refers to whichever entity fulfills the specification at a particular index. The referential/ /attributive distinction is not to be explained as a scope ambiguity (cfr the re/de ditto readings) but rather both readings should receive the same semantic interpretation, the distinction being accounted for on the pragmatic level (see further).","Of particular importance to natural language interaction in a system that ales at a high degree of \"cooperativeness\" is the distinction between the value-free and value-laden interpretation modes, from the point of view of the hearer. Consider the following alternative system replies (Sa) and (5h) to query (5). In (Sa) the definite description was value-laden, as is the standard practice, whereas the value- -free interpretation indicated by (Sb) seems to be more appropriate to the user's intentions: - 34 -","(5) U: Does the head of the CIS department earn more","then the head of the Philosophy department?","S: Yes","U: Why?","(5a) S: Because Dr. Jones has more dependents than","Dr. Smith","(Sb) S: Because computer science is better remunerated","than philosophy •","In order to retrieve the answer the extension of the description has to be determined in both cases but in (Sb) the ingredients of the descriptive expression were retained for further processing. This raises such pragmatic issues as why a speaker chooses a particular description to refer to an entity and what clues might guide the hearer as to the in-tended interpretation stratbgy.","The third part of the paper gives an outline on how to interpret these modes in the system. The approach taken is that certain modes should be treated as pra~atio phencaema rather than as semantic ones. Atthe semantic level a language processing system should produce a context-independent interpretation of what a speaker means by an utterance. The pragmatic level deals with what the speaker Intends the hearer to imfer from his utterance. At the semantic level of representation the Russellian truth conditions for definite reference are applied, where appropriate. These determine the \"semantic referent\" which is defined by the conventions of the language; the \"speaker's referent\", on the other hand, is the object which the speaker believes fulfills the conditions for being the semantic referent (see Kripke 77). This paper attempts to specify the notion of \"speaker's referent\" in terms of reference as a speech act. For example, a condition for felicitous reference in the referential mode is that the speaker believes that the referent satisfies the description and also that he believes the hearer believes In the \"Justification\" for the description (cf~ Cohen/Perrault 81). It wall be shown that in - 35 - certain contexts definite reference involves other speech acts besides refezTlng such as informing, describing, expla~ning...","Li~orat~e","Baz~lse J, and PezTy J. (80)z \"The situation aJ~der~ound\",","Workin~ papers i~ S G~m.antics, Vol l, Stanford","University,"]},{"title":"1980","paragraphs":["Cohen P.R. and Perrault C.M. (81)- \"A note on inaoc~a.~ate reference e , Elements Qf Dlsootu~e U~derstandin~ (eda Joahi, SaE, Webber), Cambridge University I~ess, 1981","Qross B.J. (76)z \"Resolving definite noun phrases\", 3peach U~der~tqndinK Re~az~h (ed D.Walker), final technical report, Stanford Research Institute, 1976","Joshi A.K. (78): \"A note on partial match of desoriptionez can one simultaneously question (retrieve) and infoz~ (update)?\" TIILAP-proceedings, University of"]},{"title":"Illinois,","paragraphs":["Urbana,"]},{"title":"1978","paragraphs":["gaplan S.J. and Davidson J. (81)- \"Interpreting nst~a~al language database updates\", .l>rooeedin~s of the 19t~ annual meetin~ of the ~CL, Stanford University, June 1981","K~ipke S. (77)z \"Speaker reference and semantic reference\" in ~idwest St dud~es in Philoso~by II, 1977","Sldner C. (77)z \"Levels of complexity in discouz~e for ansphora disambiguation and speech act interpretation\", l~.oseedin~ of t~ fift~ internati~rual c on-fere~e on Artificia.1 I ntell.i~enoe, Cabridge, ~T","Webber B.L. (78)z A Formal A~proach to Diso o~rse anaphora, technical report 3761, Bolt, Beranek and Newman, Cambridge Mass., 1978 - 36 -"]}]}