{"sections":[{"title":"","paragraphs":["APPLICATION OF INTENSIONAL LOGIC TO KNDWLEDGE REPRESENTATION Ton~ Chrz FSO Prague, Czechoslovakia","The system of transparent intensional logic (TIL) introduced by Pavel Tich~ is used as a framework for a description of knowledge representation in n~n - machine con,nunication. A detailed exposition of TIL can be found in /1/.","A language expression denotes an object by expressing its construction. The syntactic structure of the expression reflects the structure of the corresponding construction (thus obeying Frege's principle of oompositionality). To analyze an expression semantically means to determine the construction it expresses. Ordinary language expressions have often more than one analysis.","The analyses of language expressions (i.e. construct~, ions) can be represented by ~-expressions. This representational language has the same expressive power (within the framework of TIL) as the natural language, but has no ambiguities. The inference rules of TIT serve as a theoretical foundation for the inference necessary in knowledge representation.","The infinite hierarchy of types in TIL makes it possible to work with properties of properties or with relations between an individual and a proposition in the same way as the first order theories work with relations between individuals. Thus, TIL can be considered to be a limit case of the theories of order n. - 69 -","A s~stem for knowledKe representation, based on TIL, is presently under develo~nent. Its knowledge base contains a special atom representing the system itself, and certain procedures allow the system to determine the truth-value of propositions concerning its knowledge (this can be considered as a rudimentary form of self-reflection). This feature allows the system to infer correct answers e.g. in the following conversation, where x,y are variables for individuals and p is a variable for properties! replies from the system are marked by >>>: (I) John is a boy and Paul is a boy. >>> Hm. (2) Is Tom a boy? >>> I don't know. (3) If x is a boy then you know that x is a boy. >>> Hm. /,4) Is Tom a boy? >>> No. (5) x is omniscient with respeot to p Iff","(if y instantiates p then x knows that y instantiates p).",">>> I-Ira. (6) With respect to which property are you ommlscent?",">>> Boyhood. Not_....ee: Before the start of the conversation, the system is in the initial state, where basic infer,no, rules have been programmed and grannnar and a dictionary have been introduced. but no factual knowledge. The dictionary entries contain in most cases only a word, its class and the type of the object it denotes.","The self-referential oapacit~ is one of the strong features of natural language (thus allowing the linguist to describe the object of his study). This capacity leads to the possibility of paradoxioal assertions (the Liars paradox- as far as a modification for artificial intelligence is concerned, see Cherniavsky /2/. Havel /3/). In the following example, the system is ordered to believe a proposition ~8). which is easily performed ~9). Nevertheless, if the attempt to believe a proposition (12), althou~l it is\"known\" to be true (11). - 70 - (7) Tom says that the Earth is round. >>> Hm. (8) Belleve the proposition which Tom says[ >>> OK. (9) Which property does the Earth have? >>> Roundness. (10) Paul says that you do not believe the proposition which","Paul says. >>> ~hn, (11) Is the proposition which Paul says true? >>> Yes. (12) Belleve the proposition which Paul says[",">>> Sorry I cannote Not_._~es In this example, to \"believe\" is interpreted in such a way that the system \"believes\" a proposition by actual storing its ~epresentatlon. Thus, the positive answer to question (11) does not imply that the system \"believes\" the proposition. Diverse interpretations of \"believe\" are possibleo","The \"the\" in (8), (10) - (12) is interpreted locally, i.e. in the context of the knowledge base of the system. Thus, if the system knows only one of the propositions which Tom says, then this proposition is th..~e proposition which Tom sayse","The problem of anal~sls of language expressions (i.e. of determining the constructions expressed by them) is not the main goal of our research, Nevertheless, a restricted subset of scientific English (see sentence (5) above) has been described by a grammar, which is \"almost SLR(O)\". (The stack automaton accepting the l~u6uage has some states with shif~- -reduce and/or reduce-reduce conflicts.) The analyzer gives all possible analyses of the input sentence, taking into account both the ambiguities of the syntactic structure of the sentence and the ambiguities of the individual words. The second case is illustrated by the following example: (13) John has a ballv (14) John has every good property which Paul has. (15) John has a brother,","The sentences can be rephrased as (13\") John owns a ball. - 71 - (14\") John inetantiates every good property which Paul","Inst antlat es. (15\") There is x such that x is a brother of John.","The word \"have\" in (13) and (14) denotes the objects (i.e. relations) denoted by \"own\" and \"instantiate\" in (13\") and (14\"), respectively. (The relation in (15\") is dlffloult to denote by a single word.) Thus, the analyses of sentences (13) - (15) are: (13-) Aw.Some ~x.And [[ Ball w] x] • [ Own w] John X (14\") ~w.Every x p.Oond","[And [Property p] . And [[ Good w] p] .","[Instantiate w ] Paul p ]. [ Instantlate w ] John p (15 w) ~w.Some ~ x. [ Brother w] x John Notes The information of the different analyses of \"have\" has %o be stored in the dictionary. Here, to own is a relation between individuals, to instantiate is a relation between an individual and a property, and in (15) and (15\"), a relatio~ between an individual and a relation is mentioned (since brotherhood is a relation between individuals). Thus, ambiguities of this sort may be resolved by examining, whether the type of the denoted object \"fits\" into the types of objects denoted by other words in the sentence.","The s~stem is bein~ programmed in 7.7SP and the current version has some 2500 lines of source code. The quoted examples (including the inference of answers (1) - (12))have been processed by the system.","The aim of the present paper is to demonstrate that TIL forms a suitable framework for a description of natural language semantics, since 1 ) the language of A - expressions is sufficiently rich but diesmbiguat ed 2) the translation of natural language expressions into these \"se~=utic 7 :~)resentations\" is relatively straightforward - 72 -","3) the inference necessary in language understandiP4¢ can be performed using the inference rules of TIL"]},{"title":"References: /1/","paragraphs":["Tich~, P.s Foundations of partial type theory. o~ Mathematical Logic 14"]},{"title":"/2/ Chernlaveky,","paragraphs":["V.S.:"]},{"title":"On limitations of artificial intelligence. Information S~stems, 6, 1980 /3/ Havel, I.","paragraphs":["M.:"]},{"title":"Truth-reaction paradox and limitations of artificial intelligence. (manusoript in preparation) - 73 -","paragraphs":[]}]}