{"sections":[{"title":"","paragraphs":["J Z~ AMBIGUIT~TENPROBLEM BEI DER ANALYSE KOORDINATIVER VERBINDUNGEN H. Hesse, A. K~stner, E. Lang Zentralinstitut fur Sprachwiseenschaft AdW der DDR, Berlin","1. Bei der automatischen Sprachanalyse (speziell Syntexanalyse) werden Texte eingegeben und automatisch analysiert. Die Aufgabe besteht darin, eine adaquate Darstellung der Strukturen zu erhalten, in der genau die r e 1 e v a n t e n Mehrdmutigkeiten des Materials erfasst werden. Des bedeutet 1. dass der Text weitesgehend disambiguiert wird, und 2. dass Pseudo-Mehrdeutigkeiten, wle sie etwa der Modellan-","satz suggerieren konnte, auegeschlossen werden. Art ted Grad der zu analysierenden Mehrdeutlgkeit elner sprachlichen Einheit (isolierte Wortform, Wortformenfolge, Satz,...) hangt dabei ab:","a) vom Grad der Differenzierung, d.h. vonder sprachlichen Ebene, die gemass der Zwecksetzung der Analyse betrachtet wird, und","b) yon der Gr~see der Un~ebung, aus der Kontextinformationen auf die betrachtete Einheit bezogen werden. Sowohl bei einer Verfeineru~ der Differenzieru~ des ~odellansatzes ale auch beim ~bergang yon isoliert betrachteten zu komplexeren Texteinheiten wahrend der Analyseprozedur erhoht eich im allgemeinen der Grad der Mehrdeutigkeit; es w~re zu vermuten multiplikativ. Jedoch wirkt auch eine gegenlaufigc Tendenz, die die Anzahl der Mehrdeutigkeiten einschr~ukt. - 124 -","2. F~r die adequate Darstellung koordinativer Verbindungen lnnerhalb der Abh~igkeitsgram~tik sind Baumstx,Akture. unzttreichend. Man kann ~edoch dutch spezielle Verknupfungsregeln aus den Baumstrukturen verallgemeinerte Abh~lgkeltsstrukturen (\"K-Grapken\") konstruleren. Elnige StruktureiEen-8ohaften der K-Graphen werden skizziert. Es werden zwei unterschiedlich ges~rtete Zerleg~ugsm~gllchkeiten des K-Graphen gezeigt; Zur Kenntlichmachung der in el.or koordinativen Verbindung enthaltenen KonJunkte dient eine Zerle~ng dee K-Graphen in linear geordnete Abschnitte (\"Rahme~ef~e\", \"KonJunktgefuge\") ;\" eine Zerlegung des K-Graphen in htera~- ehisch geordnete Strukturbestandtelle maoht die elementa~en Struktureinheiten ersichtlich, die beider sukzessiven Rekonstruktion dot Strukturdarstellung eines Satzes im Analyseprozess ben~tigt werden.","3. Es ward auf des Problem yon Pseudomehrdeutigkeiten eingenangen.","3.1. Die Ableitung einer mehrere gleiche Konjunktionen enthaltenden koordinetiven Yerbindung aus ihren Ausgangss~tzen (der KoordinationsweH\") 1st l.a° nicht eindeu~ige"]},{"title":"Beispiels","paragraphs":["-Hans und Otto °seen Xpfel und Birnen.\" Ausgangskon j unkt • s 1. \"Hans isst Xpfel.\" 2° \"Otto isst ~pfelen 3B \"Hans iest Blrnen°\" 4° \"Otto lest Birneno\" Zwei VerknupfungsweHe sind m~glich: a) (1+2) + (,3+4) b) (1+3) + (2+4) Den unterschiedlichen Herleitungswegen entsprechen ~lcht syntaktisoh relevant° Ambiguit~ten. Der Beispielsatz hat nu~ • i n • syn~aktisohe Struktu~: Die Herleitungswege spielen lm Analyseverfahren keine Rolle; falls e~cht, k~nnten sio rekonstrulert werden. - 125 -","3.2. Zur Interpretation der Strukturen empirisch gegebener koord~nativer Satze ist der heuristieche Ansa~z einsr reinen Satzverknupfung unzttreichend, da eioh nioht alle kool ~- dinativen Verbindungen in grsmmatiech akzeptable komplette"]},{"title":"Ausganges~tze aufspalten laesen. Y~r eine ad~uate Interpretation","paragraphs":["muss man einen Generierungsohleohenismus vorauseetzen, in dam zwei Prinzipien vereint sind, die kurz ale Substitution und Reduktion bezeichnet werden: Eine koordinative Struktur enteteht aus einer nichtkoordinativen Ausgangsstruktur, indem gewlsse Teile in ihr dutch miteinander koordinierte Teile eubstitu/ert werden! die koordinative Verbindun 8 dieeer Teile kann dann duroh Weglaseun 8 redundanter Telle reduziert werden. F~r einen und den 8elben koordinativen Satz erlaubt dieser Generierun6maaohanismus i.a. verschiedene Herleitungewage. Belepiel\" \"Hans und Otto arbeiten.\" a) Substitution des Sub~ekts x im Satz \"x e.rbeiten.\" dutch koordinierte SubJekte. Reduktion entf~Lllt °","b) Substitution einer nicht koordinativen Haupteatzetruktur dutch die Verbindung \"Hans arbeitet und Otto arbeitet\" o Reduktion der Verbindung dutch WeElassung elner Verbform und Numerusve~anderun~ in der anderen. Derartige Untereehiede in der Herleitunssmogliehkeit reohtfertigen ee Jedoch nicht, yon einer eyntaktischen Ambiguit~t des Satzes zu sprechen° Der Satz hat eine eyntaktisch eindeutige Struktu~. Seine Herleitunsewege sind syntaktiech irrelevant, bei Bedarf Jedoch rekonstruierbar°","Die Palls, in denen eich Einschr~usen fur die~Herlei - tunsewege ergeben (\"zwieohen A und B,,, \"Karl und Otto treffen eich.\"), bed~rfen nieht einer geeonderten Repr;sentation der zugelassenen bzw° ausgeechloesenen Herleitungswege! ihre (uber die Syntax hinauegehende) Interpretation manifestiert sioh - 126 - in grammatischen Beziehungen innerhalb der koordinativen Strukturen.","4. Im Modell sind die wesentlichen gremmatischen Regularitaten der Koordlnation erfasst - als Bedin~en fur die Form und fur die Markierung tier verallgemeinerten Abhan~gkeitsstrukturen. Dutch die Be~cksichtigung dieser 2egularitaten werden lm Analyseverfahren eine Vlelzahl yon Ambig~uttaten, die den isoliert betrachteten Wortformen eigen sind, auf-gel~st. Eine weitere Disambiguierung erm~glicht der Parallelisierungseffekt, ein spezieller Wtrkungseffekt der Eoordination, der auf verschiedenen spraohlichen Ebenen zur Geltung kommt ° Belsp~ele:","- \"Ioh besuche Otto, und Hans besucht Max.\" Die Nichtkennzeichnung der Kasuswerte im zweiten Kon-Junkt bewtrkt An61eichung der Reihenfolge von Subjekt und ObJekt an die Reihenfolge im ersten KonJunkt. Der Satz !'Hans besucht Max,\" ist isollert betrachtet syntaktisch zweideutig (S - P - 0 oder 0 - P - S); innerhalb der koordlnatlven Verbindung wird er dutch die Angleichung eindeuti E (S - P - 0)°","- \"... der Besuoh des Lehrers und die Einladung des Meisters. •",".\" Die gleiohartigen Genitive werden entweder beide als SubJekt- oder beide als Ob~ektgenltiv verstanden.","- \"Er raucht und sie trinkt.\" Entweder sind betde Handlungen aktuell oder beide habitueil, Die u~ttelbar syntaktischen Wirkungen des Parallelisierungseffektes sind ins Hodell einzubeziehen° Die VoraussetzunEen fur eine Einbeziehung feiner differenzierter Wirkungen des Parallellsierungseffektes (sems~tlsche und pragmatlsche Aspekre) slnd im syntaktischen Modell nicht gegeben, Jedoch erleich- - 127tert die Kennzeichnung der im syntaktischen Sinne koordinierten Knoten eine naohtr~gliche Ber~cksichtigung derartiger Wirkungen. Dass Jedoch syntaktische und semantische Parallelitat auch auseinandergehen k~nnen, wird am Beispiel gezeigt.","5. Ziel einer Prozedu.r der automatischen syntaktischen Analyse ist es, dutch die m~glichst effektive Aufeinanderfolce einer Anzahl yon Filtern die Bestandtelle des Tertes m~glichst schnell zu disambiguteren. Die Mehrweganalyse sichert, dass im Endergebnis der Analyse alle Strukturen des betrachteten Satzes zur Verf~g~u~g stehene Es werden die tTinzipien eines mehrstufigen Analyseverfahrens skizziert. Dabei ward den koordinationsspezifischen M~gllchkel%en zur Dlsembiguierung der ihnen gebuhrende Platz zugewiesen, - 128 -"]}]}