{"sections":[{"title":"","paragraphs":["II~PERENCING AND SEARCH FOR AN ANSWER IN TIBAQ Petr Oirk~, Jan HaJi~ Center of Biomathematics, Czechoslovak Academy of Sciences, 142 20 Praha 4, Vtde~sk~ 1083, Czechoslovakia and Faculty of Mathematics and Physics, Charles University, 118 00 Praha 1, Malostransk~ n. 25, Czechoslovakia","The objective of this contribution is to describe two procedures employed in the question answering method TIBAQ (~ext-and Inference-Based Answering of ~uestior ~, an overall outline of which is given in Sgall's paper (COLING 82 - Proceed~n6s) o","(i) The procedure of inferencing is activated after the input sentence has been recognized as a question. However, it would be useless to search through the whole data base. Thus only a small part of the data base SQ, viz. the set of representations of sentences relevant with respect to a given question Q, is activated, which consists of those sentences that contain at least one term sem~utically equivalent with an element actually occurring in Q, i.e. in the question to be answered. This set is selected from the data base for the inference rules to operate on it. Let us denote by Cn(SQ) the set of all consequences of SQ. Thus Cn(SQ) is the theoretical set of statements relevant for the build-up of the answer. Such a set of consequences would grow beyond any limits, so that it is necessary to formulate a strategy which controls the whole process. Two different strategies will be discussed.","In the first experimen%e with TIBAQ, we represent the meaning of the sentence by a dependency tree. Inferences are - 139 - performed by using rules for nondestructive conditional rewriting of such trees. Prom a formal point of view a set of inference rules can be considered as a set of productions over oriented projective labelled trees. Labels are used for representing elementary terms of knowledge (meaning), while pro~ectivity permits a treatment of the contextual role of the words in the sentence. For linguistically motivated rules, which are emphasized in our paper, we can use a bottom-up strategy carried out here by using Colmerauer°s Q-systems. Such a strategy is not fully satisfactory for an inference process controlled by logical patterns. The logical deductive ability of the system should rather be connected with backward chaining strategies and thus more advanced devices,"]},{"title":"using","paragraphs":["e.g. backtracking mechanism, are needed.","(ii) The procedure of the search for an answer to the question Q operates in the set Cn(SQ). A consequence cECn(SQ) must fulfil the following conditions to be chosen as a (full or partial) answer to Q:","(a) the root of c must be either identical with the root of Q (identity means coincidence in all parts of the complex label of the node, where \"coincidence\" is defined as allowing for certain specific differences such as that of singular vs. plural under certain conditions, of an adverbial of Manner vs. adverbial of Regard, etc.), or, if the lexical part of the label of the root of Q equals \"d~lat\" (English do in the meaning of a full verb), then the lexical part of the label of the root of c may have any shape provided it includes and index denoting the feature \"Activity\" !","(b) c must comprise a path that is identical with the path in Q that leads to the node labelled by the representation of the question word (WH), except that the lexical part of the label of the counterpart of WH in c consists in a concrete lexical word, possibly accompanied by words dependent on it. - 140 -","(c) £ and Q must have at least one more node in common (with a coinciding and lexically specified label), dependent on an identical node on the path to WH (in c).","If there is no c matching the conditions (a) to (c), th~ system answers I don°t know. The distinction between a full and a partial answer is determined as follows: if the dependency trees of Q and £ match the conditions (a) to (c) and Q does not comprise any nods not having a counterpart in c, then _o is printed as a full answer, otherwise it is printed as a"]},{"title":"partial","paragraphs":["answer, prefixed by \"I know that ...\".","This procedure makes it possible to respect among other relevant issues also the dichotomy of topic and focus, so that e.g. if the set of statements contains the assertion .Arithmetical operations are carried out by the device D\" (rather than \"The device D carries out arithmetical operations\"), then the questions \"What is carried out by the device D?\" will be answered \"I know that arithmetical operations are carried out by the device D\", which points out the possibility that arithmetical operations constitute only an unimportant part of the set of processes carried out by D. - 141 -"]}]}