{"sections":[{"title":"","paragraphs":["THE RELATIONSHIP OP UNDERLYING AND SURPAOE STRUCTURE IN GENERATIVE DESORIPTION OF LANGUAGE Ol~ Ml~eska Tomi~ Universitet \"Kiril i MetodiJ\", SkopJe, Yugoslavia","The distinction between u~uderlying and surface structure is more or less well established in contemporary ~ammatical analysis. The form and depth of the underlyiD E structure and its relationship to observable language reality are, however, permanently in the focus of linguistic disputes.","In the standard generative ~ranaformationsl model (Ohc~sky, 1965) underlyinE structure was moderately deep. I% reflected the surface structure of English and catered for semantic distinctions mainly through the inherent senuantic features of the lexicon. The semantic component, to which the derived sentences were being sent for semantic processing, was not well defined.","The generative semantics models deepened the underlying structure and imposed a considerable gap between the latter and the surface structure. This gap was to be bridged by transformations, which with McCawley included very extensive lexical changes.","The functions of the underlying participants in the action or state came to differ signifficantly from those of the surface nominal constituents. In Fillmore's model (Fillmore, 1969) the subject of the surface structure correlated not only","subject\" or \"actor\" but also with an with the N ~de~lyi~ underlying patient, experienc'er, locative... To provide for this correlation, Fillmore set up rules for systhematic sub-Jectivization of non-agentive \"underlying cases\". What \"s more, - 291 - he assigned to each verb a specific \"case frame\" which often lead to proposing features of conditional obltgatoriness (represented in hie notation by embedded and intersecting brackets). Similar endeavoars for correlating underlying functions with divergent surface constituents lead Gruber (1967) to vague characterizations, often in different terms for different classes of verbs. Anderson (1971), in his turn, opposing the characterization of sub, sot/verb relations in terms like \"actor/action\", offered a great variety of case functions to be assigned to his noun phrases, depending on the nature of their participation in the \"process\" or \"state\" represented by the predicate.","More recently, generative linguists have been becoming increasingly aware of the necessity to distinguish meaning, taken as the linguistic counterpart of ~mCensional structure of sense, from cognitive content, i.e. from the language independent patternings of factual knowledge. Thus, Fillmore (1977) reexamines his underlying cases, places them outside the language system in a strict sense - in the realm of conceptualization, and assumes that the underlying structure of language proper is set up by \"creating conditions under which a speaker cheese to draw. certain case roles into perspective\". Sgall (1980), in his turn, olalms that hle multi-level generative model permits to set up semantic, underlying, tectogrammatical units, which are set off from the cognitive level \"case-roles\" but relate to them through Panevov~°s regular system of shift-Ing (Panevov~, 1980). Thls shifting can, of course, be accommodated in the realm of conceptualization without the system of levels of functional generative 5Tammar. Recent transfers of selection of \"case-roles\" into conceptualization has not made linguistic description perspicuously simpler. The analyst has the choice of (a) introducing a set of rules that would \"shift\" the conceptual case roles so that they may naturally take their appropriate places in underlying structure or else (b) making provisions for adjustment rules between the levels - 292 - .I of underlyin8 and surface structure.","Tn the belief that the constituents of the underlying structure of a model~ for automatic generation of the sentences of a natural language should be defined in terms that associate them closely to respective surface structure constituents, ou~ initial efforts for the construction of a g~-.-.ar for autoamtio generation of Serbo-Croatian have lead us to a predicate-centered underlying structure whose nominals fall with-in two general types: nuclear and extranuclear or adverbial. mile the latter are optional, the former ave obligator7 for a given predicate| they can be abstent from the surface structure but are always recoverable. The n,~ber and type of nucles~ nominals that relate to each given predicate can be. stated in a predicate dictionary. When the underlying structure of individual sentences are being generated, these dictionaries can serve as guides for the selection of the nuclear nominals for each predicate, which can be defined as the first, second, third ,.. nominal of a given predicate (~he exact nomber should be detez'mtned with tests for obligatorinasa). The first nominal (or nominal one) is the nominal from Qhich the action or state denoted by the predicate cz~lginates, the second nominal (or nominal two) is the nominal towards which the action or state of the predicate is directed, where-as the third nmninsl (or nominal three) is the nominal functioning as an intoz~nedtary between nominal 1 and nominal 20","The linear ordering of the surface structure constituents does not always correspond to the ordering of the underlying nominals; however, in the cc=municatively \"nmarked sentences the CorTespondenoe between the type of surface structure f~u~otion and type of underlying structure nominal is stable. In these sentences, nominal one is realized as subject, nominal two as direct object or any other type of direct complement (i.e. complement which relates to the verb directly), while nominal three is realized as indirect ob.lect or any other cemplement that is contingent on the presence of another oemploment. - 297 -","In the inflective languages (and Serbo-Croatian Is one of them) the surface structure constituents are marked by specific suffixes. The morphonolcgioal changes incurred by sufftxation are usually being attributed to ,the operations of some morphonologica ! component or strata. We, however, maintain that the assigxnent of the suffix and the morphonological changes accompanying it can be done by the rules that transform (or translate) the ~derlying structure into surface structure. Vitae (1980) has constructed a pro~ -m for automarie generation of the nominal paradi~a. We s~e now devising signals which, when attached to the argu:ents and ad~erbial n\"minsls of the underlying structure, would trigger the generation of Inflected nominal surface structure constituents along with their respective prepositions, if any. At the same time, work on the automatic generation of the predicate phrase constituents is under way.","In the first generative (English language based) models morphology was assigned an anscillary role. Work with inflected languages has shown that it should be dealt with independent of, though in coordination with, syntax. By developing programs for automatic generation of the morphonsloglcal fo~s, while working on the syntactic and semantic camponent(s) of the grs~mar, we hope to be able to build a model which is fox, sally s4mple and in which the u~mderlying struct~e will not be excessively remote t~cea the surface one. Refere~es","Anderson J.M. (1971), The C~mma: of Case: Towards a ]~calist Theoz~, Cnmbrt~e IIntvez~ity l~:ess.","Choasky N. (1965), Aspects of the Theo~ of Syntax, i.I.T. ~ess.","Fillmore C.J. (1968), \"The Case for Case\", Uuiverssls in Linguistic Theoryp E.Bach and R.Hal~as eds., Holt, Rinehart and Winston, New TerM, pp. 1-8. - 294","Pillaore C.J. (1977), \"The Case for 0aee Reopened\", Kasustheorie, Klaseifikation und eemantieohe Interpretation, K.Heger and J.Pet~fi ode., Buske, Hamburg, pp. 3-26°","Gruber J.~. (1967), Functions of the Lexicon in Formal Descriptive Grmmaar, Santa Monioa System DevelopBent Co.potation, ~-3770/000/00."]},{"title":"PaneTowd J. (1977), \"Inner Partleipants and Free Adverbials\", ,Prague Studies in Mathematical Linguistlee 6, pp.227-254.","paragraphs":["Panevovd J. (1980), Formy a funkoe ve stavb~ ~esk6 v~ts,"]},{"title":"Academia, Praha. Sgall P. (1980)t \"Cue and Meaning\", Journal","paragraphs":["of"]},{"title":"~tlo. 4,","paragraphs":["pp. 525-536. Vitae D. (1980), \"Generiean~e imeni~kih oblika u empeko-"]},{"title":"hrvatekom ~eziku\", Informatioa 3, pP° 34-39,","paragraphs":["- 295 -"]}]}