{"sections":[{"title":"*SEM 2012: The First Joint Conference on Lexical and Computational Semantics Volume 1: Proceedings of the main conference and the shared task Volume 2: Proceedings of the Sixth International Workshop on Semantic Evaluation (SemEval 2012) June 7-8, 2012 Montréal, Canada","paragraphs":["Production and Manufacturing by Omnipress, Inc. 2600 Anderson Street Madison, WI 53707 USA Sponsored in part by: The Groningen Meaning Bank Project (University of Groningen) INSEARCH Project (University of Rome ”Tor Vergata”, CiaoTech s.r.l.) Organized and sponsored in part by: The ACL Special Interest Group on the Lexicon (SIGLEX) The ACL Special Interest Group on Computational Semantics (SIGSEM)"]},{"title":"c⃝2012 The Association for Computational Linguistics Order copies of this and other ACL proceedings from: Association for Computational Linguistics (ACL) 209 N. Eighth Street Stroudsburg, PA 18360 USA Tel: +1-570-476-8006 Fax: +1-570-476-0860 acl@aclweb.org ISBN 978-1-937284-21-3 (Volume 1) ISBN 978-1-937284-22-0 (Volume 2)","paragraphs":["ii"]},{"title":"Introduction to *SEM 2012","paragraphs":["In the summer of 2011, the idea of having a joint conference covering two ACL Special Interest Groups, namely SIGLEX and SIGSEM, was born. Traditionally, the SIGLEX has been concerned with issues of the lexicon and computational lexical semantics, while SIGSEM has been engaged with issues of computational modeling of semantics. The need for an umbrella conference on semantics was growing not only because of the many recent exciting developments in the field of computational linguistics, but also because of the growing number of shared tasks and workshops, of which many show points of contact with semantics in its various forms. We name just three of these exciting and promising developments. First, Recognizing Textual Entailment, which started as a shared task, has established itself as an active area of research in semantics. Second, following syntactic parsing, robust, broad-coverage systems for shallow (and reasonably deep) semantics have been developed over the last years and are still being improved as observed in the SemEval competitions. And third, statistical semantics has emerged as a hot topic, in particular distributional approaches. All of these research directions touch upon both lexical and modeling aspects. Progress in either of these fields needs input from both. At the same time, we clearly recognized that the current venues for publishing research and meeting fellow semanticists wasn’t satisfactory. SIGSEM organizes a successful biennial workshop (recently rechristened as a conference) on computational semantics, IWCS, which however sees a small number of lexically-oriented researchers attending, and moreover has been geographically restricted since it started in 1994. SIGLEX, on the other hand, has organized the widely attended SemEval evaluation exercises organized by active communities of researchers, but has not been very successful in attracting computational modeling semanticists from the SIGSEM community. Hence, we came to the conclusion that the time is ripe for a more synergistic effort where we combine our events. An explosion of emails followed between SIGLEX & SIGSEM board members and not long after ∗SEM came to the world. The organizational tasks were carefully split between members of SIGLEX and SIGSEM to ensure optimal collaboration and exchange of ideas. The conference is coordinated by one person — the general chair — with the idea to let this position alternate by a SIGLEX and SIGSEM representative in future editions of ∗SEM. For the first edition of ∗SEM, NAACL in Montreal seemed a natural choice. As a satellite event of a larger event ∗SEM could benefit from the organizational knowhow of ACL experts and we could leverage the NAACL community presence as a way of popularizing our ideas. ∗SEM received 79 long and 29 short papers. Three long papers were withdrawn leaving 76 long papers. We accepted 21 long and 13 short papers. These numbers translate in acceptance rates of 27.6% (long) and 44.8% (short papers). ∗SEM is also hosting a shared task on Resolving the Scope and Focus of Negation, organized by Roser Morante and Eduardo Blanco. 10 teams participated, together submitting 14 runs. The task and system descriptions papers for this event are included in these proceedings. In addition, ∗SEM is hosting the last edition of SemEval, whose proceedings are published in an accompanying volume. The proceedings include 8 task description papers and 56 system description iii papers. ∗SEM took a tremendous effort to conceive. It would not have been possible without the vision of the CL community at large but the NAACL executive board chaired by Rebecca Hwa (through December 2011), the ACL business manager Priscilla Rasmussen, and the NAACL 2012 General Chair Jennifer Chu-Carrol as well as the ACL executive board as chaired by Kevin Knight, all allowed for it to come to reality so quickly. We are deeply grateful for the vote of confidence and support from the various semantics workshop organizers from previous years like RTE, MWE, DISCO and GEMS for rallying their subcommunities to support our initiative. There are many individuals to thank for their contributions to the conference program. First and foremost, we would like to thank the authors who submitted their work to ∗SEM. We are deeply indebted to the area chairs and the reviewers for their hard work. The area chairs (Timothy Baldwin, Marco Baroni, Johan Bos, Philipp Cimiano, Ido Dagan, Christiane Fellbaum, Carlos Ramisch) and reviewers did a fantastic job. They enabled us to select an exciting program and to provide valuable feedback to the authors. We are very grateful to Sara Barcena, who designed the ∗SEM logo. We would like to thank Roberto Basili in his role as sponsorship chair. We also would like to thank Priscilla Rasmussen who provided a reliable and fast human interface with the local organization. Suresh Manandhar and Deniz Yuret (chairs of the task committee) ensured a smooth integration with the shared task and SemEval activities. Roser Morante and Eduardo Blanco organized the shared task. Finally, Yuval Marton, the publication chair, did an amazing job in putting the proceedings together. No hanging word or dangling footnote escaped his attention. Finally, last but not least, we would like to acknowledge sponsors from both the academic and industrial worlds. The logo design for ∗SEM is sponsored by the Groningen Meaning Bank Project of the University of Groningen. ∗SEM is supported by the European project INSEARCH (FP7 262491) and, in particular, by its contributing partners of the Department of Enterprise Engineering of the University of Rome, Tor Vergata (Italy) and CiaoTech s.r.l. We hope this will be the first of an exciting series of conferences. Eneko Agirre (General Chair) Johan Bos (PC chair) Mona Diab (PC chair) iv"]},{"title":"Introduction to SemEval","paragraphs":["The Semantic Evaluation (SemEval) series of workshops focus on the evaluation of semantic analysis systems with the aim of comparing systems that can analyse diverse semantic phenomena in text. SemEval provides an exciting forum for researchers to propose challenging research problems in semantics and to build systems/techniques to address such research problems. This volume contains papers accepted for presentation at the SemEval-2012 International Workshop on Semantic Evaluation Exercises. SemEval-2012 is co-organized with the *Sem The First Joint Conference on Lexical and Computational Semantics. SemEval-2012 immediately follows the North American Chapter of the Association for Computational Linguistics - Human Language Technologies (NAACL HLT) 2012 conference. SemEval-2012 included the following 8 tasks for evaluation: • English Lexical Simplification • Measuring Degrees of Relational Similarity • Spatial Role Labeling • Evaluating Chinese Word Similarity • Chinese Semantic Dependency Parsing • Semantic Textual Similarity • COPA: Choice Of Plausible Alternatives An evaluation of commonsense causal reasoning • Cross-lingual Textual Entailment for Content Synchronization This volume contains both Task Description papers that describe each of the above tasks and System Description papers that describe the systems that participated in the above tasks. A total of 8 task description papers and 56 system description papers are included in this volume. Task 6 on “Semantic Textual Similarity” was the most successful task attracting over half of the total submissions. We are indebted to all program committee members for their high quality, elaborate and thoughtful reviews. The papers in this proceedings have surely benefited from this feedback. We are grateful to *SEM 2012 and NAACL-HLT 2012 conference organizers for local organization and the forum. We most gratefully acknowledge the support of our sponsors, the ACL Special Interest Group on the Lexicon (SIGLEX) and the ACL Special Interest Group on Computational Semantics (SIGSEM). Welcome to SemEval-2012! Suresh Manandhar and Deniz Yuret v Organizers:","General Chair: Eneko Agirre (University of the Basque Country)","Program Committee Chairs: Johan Bos (University of Groningen) Mona Diab (Columbia University)","Shared Task Committee Chairs: Suresh Manandhar (University of York) Deniz Yuret (KoçUniversity)","Publications Chair: Yuval Marton (IBM Watson Research Center)","Sponsorship Chair: Roberto Basili (University of Rome ”Tor Vergata”)","Area Chairs: Timothy Baldwin (University of Melbourne) Marco Baroni (University of Trento) Johan Bos (University of Groningen) Philip Cimiano (University of Bielefield) Ido Dagan (Bar Ilan University) Christiane Fellbaum (Princeton University) Carlos Ramisch (University of Rio Grande do Sul) Program Committee: Samir AbdelRahman, Amjad Abu-Jbara, Nitish Aggarwal, Eneko Agirre, I ñaki Alegria, Enrique Amigo, Marilisa AMOIA, Dimitra Anastasiou, Mark Andrews, Daniel Baer, Collin Baker, Tim Baldwin, Miguel Ballesteros, Carmen Banea, Srinivas Bangalore, Pierpaolo Basile, Valerio Basile, Luciana Benotti, Luisa Bentivogli, Jonathan Berant, Raffaella Bernardi, Steven Bethard, Arindam Bhattacharya, Pushpak Bhattacharyya, Chris Biemann, Eduardo Blanco, Gemma Boleda, Francis Bond, Johan Bos, Jordan Boyd-Graber, Antonio Branco, Paul Buitelaar, Aljoscha Burchardt, Davide Buscaldi, Alastair Butler, Miriam Butt, Elena Cabrio, Aoife Cahill, Chris Callison-Burch, Nicoletta Calzolari, Jose’ Guilherme Camargo de Souza, Annalina Caputo, Julio Castillo, Daniel Cer, Rui Chaves, Wanxiang Che, David Chen, Md. Faisal Mahbub Chowdhury, Grzegorz Chrupala, Peter Clark, Stephen Clark, Paul Cook, Crit Cremers, Danilo Croce, Noa P. Cruz Dı́az, Walter Daelemans, Béatrice Daille, Marie-Catherine de Marneffe, Rodolfo Delmonte, Gerard deMelo, Leon Derczynski, Gaël Dias, Georgiana Dinu, Bill Dolan, Markus Egg, Katrin Erk, Miquel Espla, Kilian Evang, Stefan Evert, James Fan, Christiane Fellbaum, Ana Fernandez, Raquel Fernandez, Antonio C. Fernández, Tim Fernando, Darja Fiser, Anette Frank, vii Diego Frassinelli, Claire Gardent, Danilo Giampiccolo, Eugenie Giesbrecht, Claudio Giuliano, Demetrios Glinos, Alfio Gliozzo, Aitor Gonzalez Agirre, Travis Goodwin, Edward Grefenstette, Karl Grieser, Yoan Gutiérrez Vázquez, Binod Gyawali, Sanda Harabagiu, Chikara Hashimoto, Michael Heilman, Aurelie Herbelot, Erhard Hinrichs, Graeme Hirst, Nancy Ide, Hitoshi Isahara, Suhel Jaber, Sujay Kumar Jauhar, Sergio Jimenez, Peng Jin, Anders Johannsen, David Jurgens, Kyo Kageura, Kyoko Kanzaki, Mladen Karan, Adam Kilgarriff, Su Nam Kim, Parisa Kordjamshidi, Valia Kordoni, Ioannis Korkontzelos, Milen Kouylekov, Zornitsa Kozareva, Gerhard Kremer, Brigitte Krenn, Alberto Lavelli, Alessandro Lenci, Mike Lewis, Bin Li, Anne-Laure Ligozat, Krister Lindén, Ting Liu, Bernardo Magnini, Nikos Malandrakis, Manuel J. Maña López, Suresh Manandhar, Alessandro Marchetti, David Martinez, Yannick Mathieu, Takuya Matsuzaki, Diana McCarthy, Yashar Mehdad, Rada Mihalcea, Yusuke Miyao, Marie-Francine Moens, Saif Mohammad, Shaabi Mohammed, Michael Mohler, Dan Moldovan, Roser Morante, Alessandro Moschitti, Brian Murphy, Preslav Nakov, Roberto Navigli, Matteo Negri, Guenter Neumann, David Newman, Sanni Nimb, Diarmuid Ó Séaghdha, Sam Oakley, Jan Odjik, Stephan Oepen, Ekaterina Ovchinnikova, Lilja Øvrelid, Partha Pakray, Martha Palmer, Pavel Pecina, Bolette Pedersen, Ted Pedersen, Yves Peirsman, Anselmo Peñas, Alpar Perini, Emanuele Pianta, Scott Piao, Maciej Piasecki, Manfred Pinkal, Paul Piwek, Simone Paolo Ponzetto, Octavian Popescu, Stephen Pulman, Zhou Qiaoli, Ari Rappoport, Jonathon Read, Siva Reddy, Joe Reisinger, Bryan Rink, Miguel Rios, Kirk Roberts, Melissa Roemmele, Sabine Rosenberg, Magnus Sahlgren, Manfred Sailer, Mark Sammons, Frane Šarić, Shrutiranjan Satapathy, Agata Savary, Lenhart Schubert, Sabine Schulte im Walde, Hinrich Schütze, H. Andrew Schwartz, Satoshi Sekine, Violeta Seretan, Chung-chieh Shan, Vera Sheinman, Eyal Shnarch, Ekaterina Shutova, Janardhan Singh, Ravi Sinha, Richard Socher, Artem Sokolov, Daniel Sonntag, Anders Soogard, Virach Sornlertlamvanich, Marc Spaniol, Lucia Specia, Mark Steedman, Asher Stern, Matthew Stone, Carlo Strapparava, Luke Stringer, Michael Strube, Sara Stymne, Stan Szpakowicz, Idan Szpektor, Alex Tantos, Stefan Thater, Zhu Tiantian, Sara Tonelli, Mireya Tovar, Beata Trawinski, Vivian Tsang, Peter Turney, Kyioko Uchiyama, Lyle Ungar, Christina Unger, Ruben Urizar, Tim Van de Cruys, Benjamin Van Durme, Gloria Vazquez, Sonia Vázquez, Tony Veale, Erik Velldal, Noortje Venhuizen, Yannick Versley, Darnes Vilarino Ayala, Begoña Villada Moirón, Aline Villavicencio, Martin Volk, Piek Vossen, Katharina Waeschle, Rui Wang, james White, Michael White, Yunfang Wu, Zhijun Wu, Hao Xiong, Willy Yap, Eric Yeh, Deniz Yuret, Fabio Zanzotto, Konstantin Zuyev. Additional Reviewers: Mehmet Ali Yatbaz, Paolo Annesi, Kartik Asooja, Pierpaolo Basile, Sumit Bhagwani, Chris Biemann, Sam Biggins, Olivia Buzek, Marina Elizabeth Cardenas, Jinho Choi, Maximilian Dylla, Paula Estrella, Sascha Fendrich, Fanpeng Guo, Elias Iosif, Sigrid Klerke, Héctor Martı́nez, Rada Mihalcea, Azucena Montes Rendon, Snehasis Neogi, Magdalena Plamada, Barbara Plank, Michael Roth, João Silva, Guangchao Tang, Sara Tonelli, Olga Uryopina, Svitlana Volkova, Torsten Zesch. Invited Speaker: Jerry Hobbs viii"]},{"title":"Table of Contents","paragraphs":["Casting Implicit Role Linking as an Anaphora Resolution Task Carina Silberer and Anette Frank . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 1 Adaptive Clustering for Coreference Resolution with Deterministic Rules and Web-Based Language Models","Razvan Bunescu . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 11","Measuring Semantic Relatedness using Multilingual Representations Samer Hassan, Carmen Banea and Rada Mihalcea . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 20","Towards Building a Multilingual Semantic Network: Identifying Interlingual Links in Wikipedia Bharath Dandala, Rada Mihalcea and Razvan Bunescu . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 30","Sentence Clustering via Projection over Term Clusters Lili Kotlerman, Ido Dagan, Maya Gorodetsky and Ezra Daya . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 38","The Use of Granularity in Rhetorical Relation Prediction Blake Howald and Martha Abramson . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 44 ”Could you make me a favour and do coffee, please?”: Implications for Automatic Error Correction in English and Dutch","Sophia Katrenko . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 49","Detecting Text Reuse with Modified and Weighted N-grams Rao Muhammad Adeel Nawab, Mark Stevenson and Paul Clough . . . . . . . . . . . . . . . . . . . . . . . . . . 54","Statistical Thesaurus Construction for a Morphologically Rich Language Chaya Liebeskind, Ido Dagan and Jonathan Schler . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 59","Sorting out the Most Confusing English Phrasal Verbs Yuancheng Tu and Dan Roth . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 65","Learning Semantics and Selectional Preference of Adjective-Noun Pairs Karl Moritz Hermann, Chris Dyer, Phil Blunsom and Stephen Pulman . . . . . . . . . . . . . . . . . . . . . . 70","Identifying hypernyms in distributional semantic spaces Alessandro Lenci and Giulia Benotto . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 75","Towards a Flexible Semantics: Colour Terms in Collaborative Reference Tasks Bert Baumgaertner, Raquel Fernandez and Matthew Stone . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 80","Unsupervised Disambiguation of Image Captions Wesley May, Sanja Fidler, Afsaneh Fazly, Sven Dickinson and Suzanne Stevenson . . . . . . . . . . . 85","Lexical semantic typologies from bilingual corpora — A framework Steffen Eger . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 90 ix","Non-atomic Classification to Improve a Semantic Role Labeler for a Low-resource Language Richard Johansson . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 95","Combining resources for MWE-token classification Richard Fothergill and Timothy Baldwin . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 100","Annotating Preferences in Negotiation Dialogues Anais Cadilhac, Nicholas Asher and Farah Benamara . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 105","Selecting Corpus-Semantic Models for Neurolinguistic Decoding Brian Murphy, Partha Talukdar and Tom Mitchell . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 114","Simple and Phrasal Implicatives Lauri Karttunen . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 124","An Unsupervised Ranking Model for Noun-Noun Compositionality Karl Moritz Hermann, Phil Blunsom and Stephen Pulman . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 132","Expanding the Range of Tractable Scope-Underspecified Semantic Representations Mehdi Manshadi and James Allen . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 142","Regular polysemy: A distributional model Gemma Boleda, Sebastian Padó and Jason Utt . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 151","Extracting a Semantic Lexicon of French Adjectives from a Large Lexicographic Dictionary Selja Seppälä, Lucie Barque and Alexis Nasr . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 161","Modelling selectional preferences in a lexical hierarchy Diarmuid Ó Séaghdha and Anna Korhonen . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 170","Unsupervised Induction of a Syntax-Semantics Lexicon Using Iterative Refinement Hagen Fürstenau and Owen Rambow . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 180","An Evaluation of Graded Sense Disambiguation using Word Sense Induction David Jurgens . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 189","Ensemble-based Semantic Lexicon Induction for Semantic Tagging Ashequl Qadir and Ellen Riloff . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 199","An Exact Dual Decomposition Algorithm for Shallow Semantic Parsing with Constraints Dipanjan Das, André F. T. Martins and Noah A. Smith . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 209 Aligning Predicate Argument Structures in Monolingual Comparable Texts: A New Corpus for a New Task Michael Roth and Anette Frank . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 218","The Effects of Semantic Annotations on Precision Parse Ranking Andrew MacKinlay, Rebecca Dridan, Diana McCarthy and Timothy Baldwin . . . . . . . . . . . . . . 228 x","A Probabilistic Lexical Model for Ranking Textual Inferences Eyal Shnarch, Ido Dagan and Jacob Goldberger . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 237","#Emotional Tweets Saif Mohammad . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 246","Monolingual Distributional Similarity for Text-to-Text Generation Juri Ganitkevitch, Benjamin Van Durme and Chris Callison-Burch . . . . . . . . . . . . . . . . . . . . . . . . 256","*SEM 2012 Shared Task: Resolving the Scope and Focus of Negation Roser Morante and Eduardo Blanco . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 265","UABCoRAL: A Preliminary study for Resolving the Scope of Negation Binod Gyawali and Thamar Solorio . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 275","UCM-I: A Rule-based Syntactic Approach for Resolving the Scope of Negation Jorge Carrillo de Albornoz, Laura Plaza, Alberto Dı́az and Miguel Ballesteros . . . . . . . . . . . . . . 282 UCM-2: a Rule-Based Approach to Infer the Scope of Negation via Dependency Parsing","Miguel Ballesteros, Alberto Dı́az, Virginia Francisco, Pablo Gervás, Jorge Carrillo de Albornoz and Laura Plaza . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 288","UConcordia: CLaC Negation Focus Detection at *Sem 2012 Sabine Rosenberg and Sabine Bergler . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 294","UGroningen: Negation detection with Discourse Representation Structures Valerio Basile, Johan Bos, Kilian Evang and Noortje Venhuizen . . . . . . . . . . . . . . . . . . . . . . . . . . . 301","UiO1: Constituent-Based Discriminative Ranking for Negation Resolution Jonathon Read, Erik Velldal, Lilja Øvrelid and Stephan Oepen . . . . . . . . . . . . . . . . . . . . . . . . . . . . 310","UiO 2: Sequence-labeling Negation Using Dependency Features Emanuele Lapponi, Erik Velldal, Lilja Øvrelid and Jonathon Read . . . . . . . . . . . . . . . . . . . . . . . . . 319","UMichigan: A Conditional Random Field Model for Resolving the Scope of Negation Amjad Abu Jbara and Dragomir Radev . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 328","UWashington: Negation Resolution using Machine Learning Methods James Paul White . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 335","FBK: Exploiting Phrasal and Contextual Clues for Negation Scope Detection Md. Faisal Mahbub Chowdhury . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 340","SemEval-2012 Task 1: English Lexical Simplification Lucia Specia, Sujay Kumar Jauhar and Rada Mihalcea . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 347","SemEval-2012 Task 2: Measuring Degrees of Relational Similarity David Jurgens, Saif Mohammad, Peter Turney and Keith Holyoak . . . . . . . . . . . . . . . . . . . . . . . . . 356 xi","SemEval-2012 Task 3: Spatial Role Labeling parisa kordjamshidi, steven bethard and Marie-Francine Moens . . . . . . . . . . . . . . . . . . . . . . . . . . . 365","SemEval-2012 Task 4: Evaluating Chinese Word Similarity Peng Jin and Yunfang Wu . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 374","SemEval-2012 Task 5: Chinese Semantic Dependency Parsing Wanxiang Che, Meishan Zhang, Yanqiu Shao and Ting Liu . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 378","SemEval-2012 Task 6: A Pilot on Semantic Textual Similarity Eneko Agirre, Daniel Cer, Mona Diab and Aitor Gonzalez-Agirre . . . . . . . . . . . . . . . . . . . . . . . . . 385 SemEval-2012 Task 7: Choice of Plausible Alternatives: An Evaluation of Commonsense Causal Reasoning","Andrew Gordon, Zornitsa Kozareva and Melissa Roemmele . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 394","Semeval-2012 Task 8: Cross-lingual Textual Entailment for Content Synchronization Matteo Negri, Alessandro Marchetti, Yashar Mehdad, Luisa Bentivogli and Danilo Giampiccolo 399","EMNLP@CPH: Is frequency all there is to simplicity? Anders Johannsen, Héctor Martı́nez, Sigrid Klerke and Anders Søgaard . . . . . . . . . . . . . . . . . . . . 408","UTD: Determining Relational Similarity Using Lexical Patterns Bryan Rink and Sanda Harabagiu . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 413","UTD-SpRL: A Joint Approach to Spatial Role Labeling Kirk Roberts and Sanda Harabagiu . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 419","MIXCD: System Description for Evaluating Chinese Word Similarity at SemEval-2012 Yingjie Zhang, Bin Li, Xinyu Dai and Jiajun Chen . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 425","Zhijun Wu: Chinese Semantic Dependency Parsing with Third-Order Features Zhijun Wu, Xuan Wang and Xinxin Li . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 430","UKP: Computing Semantic Textual Similarity by Combining Multiple Content Similarity Measures Daniel Bär, Chris Biemann, Iryna Gurevych and Torsten Zesch . . . . . . . . . . . . . . . . . . . . . . . . . . . 435","TakeLab: Systems for Measuring Semantic Text Similarity Frane Šarić, Goran Glavaš, Mladen Karan, Jan Šnajder and Bojana Dalbelo Bašić . . . . . . . . . . . 441","Soft Cardinality: A Parameterized Similarity Function for Text Comparison Sergio Jimenez, Claudia Becerra and Alexander Gelbukh . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 449","UNED: Improving Text Similarity Measures without Human Assessments Enrique Amigó, Jesus Gimenez, Julio Gonzalo and Felisa Verdejo . . . . . . . . . . . . . . . . . . . . . . . . . 454","UTDHLT: COPACETIC System for Choosing Plausible Alternatives Travis Goodwin, Bryan Rink, Kirk Roberts and Sanda Harabagiu . . . . . . . . . . . . . . . . . . . . . . . . . 461 xii","HDU: Cross-lingual Textual Entailment with SMT Features Katharina Wäschle and Sascha Fendrich . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 467","UAlacant: Using Online Machine Translation for Cross-Lingual Textual Entailment Miquel Esplà-Gomis, Felipe S ánchez-Mart ı́nez and Mikel L. Forcada . . . . . . . . . . . . . . . . . . . . . . 472","UOW-SHEF: SimpLex – Lexical Simplicity Ranking based on Contextual and Psycholinguistic Features Sujay Kumar Jauhar and Lucia Specia . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 477","SB: mmSystem - Using Decompositional Semantics for Lexical Simplification Marilisa Amoia and Massimo Romanelli . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 482","ANNLOR: A Naı̈ve Notation-system for Lexical Outputs Ranking Anne-Laure Ligozat, Cyril Grouin, Anne Garcia-Fernandez and Delphine Bernhard . . . . . . . . . 487","UNT-SimpRank: Systems for Lexical Simplification Ranking Ravi Sinha . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 493 Duluth : Measuring Degrees of Relational Similarity with the Gloss Vector Measure of Semantic Relatedness","Ted Pedersen . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 497","BUAP: A First Approximation to Relational Similarity Measuring Mireya Tovar, J. Alejandro Reyes, Azucena Montes, Darnes Vilariño, David Pinto and Saul León 502","Zhou qiaoli: A divide-and-conquer strategy for semantic dependency parsing zhou qiaoli, zhang ling, liu fei, cai dongfeng and zhang guiping . . . . . . . . . . . . . . . . . . . . . . . . . . . 506","ICT:A System Combination for Chinese Semantic Dependency Parsing Hao Xiong and Qun Liu . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 514","NJU-Parser: Achievements on Semantic Dependency Parsing Guangchao Tang, Bin Li, Shuaishuai Xu, Xinyu Dai and Jiajun Chen . . . . . . . . . . . . . . . . . . . . . . 519","PolyUCOMP: Combining Semantic Vectors with Skip bigrams for Semantic Textual Similarity Jian Xu, Qin Lu and Zhengzhong Liu . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 524","ETS: Discriminative Edit Models for Paraphrase Scoring Michael Heilman and Nitin Madnani . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 529","Sbdlrhmn: A Rule-based Human Interpretation System for Semantic Textual Similarity Task Samir AbdelRahman and Catherine Blake . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 536","LIMSI: Learning Semantic Similarity by Selecting Random Word Subsets Artem Sokolov . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 543","ATA-Sem: Chunk-based Determination of Semantic Text Similarity Demetrios Glinos . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 547 xiii","IRIT: Textual Similarity Combining Conceptual Similarity with an N-Gram Comparison Method Davide Buscaldi, Ronan Tournier, Nathalie Aussenac-Gilles and Josiane Mothe . . . . . . . . . . . . 552 DSS: Text Similarity Using Lexical Alignments of Form, Distributional Semantics and Grammatical Relations","Diana McCarthy, Spandana Gella and Siva Reddy . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 557 DeepPurple: Estimating Sentence Semantic Similarity using N-gram Regression Models and Web Snippets NIkos Malandrakis, Elias Iosif and Alexandros Potamianos . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 565","JU CSE NLP: Multi-grade Classification of Semantic Similarity between Text Pairs Snehasis Neogi, Partha Pakray, Sivaji Bandyopadhyay and Alexander Gelbukh . . . . . . . . . . . . . 571","Tiantianzhu7:System Description of Semantic Textual Similarity (STS) in the SemEval-2012 (Task 6) Zhu Tiantian and Lan Man . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 575","sranjans : Semantic Textual Similarity using Maximal Weighted Bipartite Graph Matching Sumit Bhagwani, Shrutiranjan Satapathy and Harish Karnick . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 579","Weiwei: A Simple Unsupervised Latent Semantics based Approach for Sentence Similarity Weiwei Guo and Mona Diab . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 586","UNIBA: Distributional Semantics for Textual Similarity Annalina Caputo, Pierpaolo Basile and Giovanni Semeraro . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 591","UNITOR: Combining Semantic Text Similarity functions through SV Regression Danilo Croce, Paolo Annesi, Valerio Storch and Roberto Basili . . . . . . . . . . . . . . . . . . . . . . . . . . . 597","Saarland: Vector-based models of semantic textual similarity Georgiana Dinu and Stefan Thater . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 603 UMCC DLSI: Multidimensional Lexical-Semantic Textual Similarity","Antonio Fernández, Yoan Gutiérrez, Héctor Dávila, Alexander Chávez, Andy González, Rainel Estrada, Yenier Castañeda, Sonia Vázquez, Andrés Montoyo and Rafael Muñoz . . . . . . . . . . . . . . . . . 608","SRIUBC: Simple Similarity Features for Semantic Textual Similarity Eric Yeh and Eneko Agirre . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 617","FBK: Machine Translation Evaluation and Word Similarity metrics for Semantic Textual Similarity José Guilherme Camargo de Souza, Matteo Negri and Yashar Mehdad . . . . . . . . . . . . . . . . . . . . . 624","FCC: Three Approaches for Semantic Textual Similarity Maya Carrillo, Darnes Vilariño, David Pinto, Mireya Tovar, Saul León and Esteban Castillo . 631","UNT: A Supervised Synergistic Approach to Semantic Text Similarity Carmen Banea, Samer Hassan, Michael Mohler and Rada Mihalcea . . . . . . . . . . . . . . . . . . . . . . . 635","DERI&UPM: Pushing Corpus Based Relatedness to Similarity: Shared Task System Description Nitish Aggarwal, Kartik Asooja and Paul Buitelaar . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 643 xiv","Stanford: Probabilistic Edit Distance Metrics for STS Mengqiu Wang and Daniel Cer . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 648","University Of Sheffield: Two Approaches to Semantic Text Similarity Sam Biggins, Shaabi Mohammed, Sam Oakley, Luke Stringer, Mark Stevenson and Judita Preiss 655","janardhan: Semantic Textual Similarity using Universal Networking Language graph matching Janardhan Singh, Arindam Bhattacharya and Pushpak Bhattacharyya . . . . . . . . . . . . . . . . . . . . . . 662","SAGAN: An approach to Semantic Textual Similarity based on Textual Entailment Julio Castillo and Paula Estrella . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 667","UOW: Semantically Informed Text Similarity Miguel Rios, Wilker Aziz and Lucia Specia . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 673","Penn: Using Word Similarities to better Estimate Sentence Similarity Sneha Jha, Hansen A. Schwartz and Lyle Ungar . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 679","Soft Cardinality + ML: Learning Adaptive Similarity Functions for Cross-lingual Textual Entailment Sergio Jimenez, Claudia Becerra and Alexander Gelbukh . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 684","JU CSE NLP: Language Independent Cross-lingual Textual Entailment System Snehasis Neogi, Partha Pakray, Sivaji Bandyopadhyay and Alexander Gelbukh . . . . . . . . . . . . . 689","CELI: An Experiment with Cross Language Textual Entailment Milen Kouylekov, Luca Dini, Alessio Bosca and Marco Trevisan . . . . . . . . . . . . . . . . . . . . . . . . . . 696","FBK: Cross-Lingual Textual Entailment Without Translation Yashar Mehdad, Matteo Negri and Jose Guilherme C. de Souza . . . . . . . . . . . . . . . . . . . . . . . . . . . 701","BUAP: Lexical and Semantic Similarity for Cross-lingual Textual Entailment Darnes Vilariño, David Pinto, Mireya Tovar, Saul León and Esteban Castillo . . . . . . . . . . . . . . . 706 DirRelCond3: Detecting Textual Entailment Across Languages With Conditions On Directional Text Relatedness Scores","Alpar Perini . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 710","ICT: A Translation based Method for Cross-lingual Textual Entailment Fandong Meng, Hao Xiong and Qun Liu . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 715","SAGAN: A Machine Translation Approach for Cross-Lingual Textual Entailment Julio Castillo and Marina Cardenas . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 721 xv xvii"]},{"title":"Conference Program Summary 08:00--09:15 09:15--10:30 10:30--11:00 11:00--12:40","paragraphs":["Long Papers 1: Linking and Anaphora *SEM2 SemEval Session 1 SE1 12:40--2:00 2:00--3:30 Short Papers Boasters and Posters *SEM3 SemEval Session 2 SE2 3:30--4:00 4:00--6:05 Long Papers 2: Semantic Models *SEM4 SemEval Session 3 SE3 08:15--09:15 09:15--10:30 Long Papers 3: Lexical Semantics *SEM6 Shared Task TSK1 10:30--11:00 11:00--12:15 / 12:30 Long Papers 4: Lexical Semantics *SEM7 Shared Task TSK2 12:15--2:00 2:00--3:15 / 3:30 Long Papers 5: Semantic Parsing","*SEM8 SemEval Poster Session 1 (Salons 6/7) SE4 3:15--4:00 4:00--5:15 Long Papers 6: Semantic Inference","*SEM9 SemEval Poster Session 2 (Salons 6/7) SE5 5:15--6:00 Plenary Panel and Closing: *SEM and the Future (PLN3) Lunch Coffee Break Coffee Break Lunch Coffee Break Opening Remarks and Keynote Address (Plenary PLN1) Best Papers and Shared Task (Plenary PLN2) *SEM Main Conference (Drummond Center/East) Shared Task and SemEval (Drummond West) Day 1: Thursday June 7th 2012 Day 2: Friday June 8th 2012 Registration Coffee Break *SEM Main Conference (Drummond Center/East) Shared Task and SemEval (Drummond West) xviii"]},{"title":"Conference Program *SEM Main Conference View Day 1: Thursday June 7th 2012 (*SEM Main Conference View) (08:00–09:15) Registration Session PLN1: (09:15–10:30) Opening Remarks and Keynote Address (Plenary)","paragraphs":["09:15–09:30 *SEM Opening 09:30–10:30 Keynote Address by Jerry Hobbs (10:30–11:00) Coffee Break Session *SEM2: (11:00–12:40) Long Papers 1: Linking and Anaphora","11:00–11:25 Casting Implicit Role Linking as an Anaphora Resolution Task Carina Silberer and Anette Frank","11:25–11:50 Adaptive Clustering for Coreference Resolution with Deterministic Rules and Web-Based Language Models Razvan Bunescu","11:50–12:15 Measuring Semantic Relatedness using Multilingual Representations Samer Hassan, Carmen Banea and Rada Mihalcea","12:15–12:40 Towards Building a Multilingual Semantic Network: Identifying Interlingual Links in Wikipedia Bharath Dandala, Rada Mihalcea and Razvan Bunescu Session SE1: (11:00–12:40) SemEval Session 1 (See SemEval View for details) (12:40–2:00) Lunch xix Day 1: Thursday June 7th 2012 (*SEM Main Conference View) (continued) Session *SEM3: (2:00–3:30) Short Papers Boasters and Posters 2:00–2:30 Poster Boaster 2:30–3:30 Posters (move to Salons 6/7) Sentence Clustering via Projection over Term Clusters Lili Kotlerman, Ido Dagan, Maya Gorodetsky and Ezra Daya The Use of Granularity in Rhetorical Relation Prediction Blake Howald and Martha Abramson ”Could you make me a favour and do coffee, please?”: Implications for Automatic Error Correction in English and Dutch Sophia Katrenko Detecting Text Reuse with Modified and Weighted N-grams Rao Muhammad Adeel Nawab, Mark Stevenson and Paul Clough Statistical Thesaurus Construction for a Morphologically Rich Language Chaya Liebeskind, Ido Dagan and Jonathan Schler Sorting out the Most Confusing English Phrasal Verbs Yuancheng Tu and Dan Roth Learning Semantics and Selectional Preference of Adjective-Noun Pairs Karl Moritz Hermann, Chris Dyer, Phil Blunsom and Stephen Pulman Identifying hypernyms in distributional semantic spaces Alessandro Lenci and Giulia Benotto Towards a Flexible Semantics: Colour Terms in Collaborative Reference Tasks Bert Baumgaertner, Raquel Fernandez and Matthew Stone Unsupervised Disambiguation of Image Captions Wesley May, Sanja Fidler, Afsaneh Fazly, Sven Dickinson and Suzanne Stevenson Lexical semantic typologies from bilingual corpora — A framework Steffen Eger Non-atomic Classification to Improve a Semantic Role Labeler for a Low-resource Language Richard Johansson Combining resources for MWE-token classification Richard Fothergill and Timothy Baldwin xx Day 1: Thursday June 7th 2012 (*SEM Main Conference View) (continued) Session SE2: (2:00–3:30) SemEval Session 2 (See SemEval View for details) (3:30–4:00) Coffee Break Session *SEM4: (4:00–6:05) Long Papers 2: Semantic Models","4:00–4:25 Annotating Preferences in Negotiation Dialogues Anais Cadilhac, Nicholas Asher and Farah Benamara","4:25–4:50 Selecting Corpus-Semantic Models for Neurolinguistic Decoding Brian Murphy, Partha Talukdar and Tom Mitchell","4:50–5:15 Simple and Phrasal Implicatives Lauri Karttunen","5:15–5:40 An Unsupervised Ranking Model for Noun-Noun Compositionality Karl Moritz Hermann, Phil Blunsom and Stephen Pulman","5:40–6:05 Expanding the Range of Tractable Scope-Underspecified Semantic Representations Mehdi Manshadi and James Allen Session SE3: (4:00–6:00) SemEval Session 3 (See SemEval View for details) xxi Day 2: Friday June 8th 2012 (*SEM Main Conference View) Session PLN2: (08:15–09:15) Best Paper Awards and Shared Task (Plenary) 08:15–08:20 Announcement of Best Papers 08:20–08:30 Best Short Paper Speech 08:30–08:45 Best Long Paper Speech 08:45–09:10 Shared Task: Resolving the Scope and Focus of Negation Session *SEM6: (09:15–10:30) Long Papers 3: Lexical Semantics","09:15–09:40 Regular polysemy: A distributional model Gemma Boleda, Sebastian Padó and Jason Utt","09:40–10:05 Extracting a Semantic Lexicon of French Adjectives from a Large Lexicographic Dictionary Selja Seppälä, Lucie Barque and Alexis Nasr","10:05–10:30 Modelling selectional preferences in a lexical hierarchy Diarmuid Ó Séaghdha and Anna Korhonen Session TSK1: (09:15–10:30) Shared Task (See *SEM Shared Task View for details) (10:30–11:00) Coffee Break Session *SEM7: (11:00–12:15) Long Papers 4: Lexical Semantics","11:00–11:25 Unsupervised Induction of a Syntax-Semantics Lexicon Using Iterative Refinement Hagen Fürstenau and Owen Rambow","11:25–11:50 An Evaluation of Graded Sense Disambiguation using Word Sense Induction David Jurgens","11:50–12:15 Ensemble-based Semantic Lexicon Induction for Semantic Tagging Ashequl Qadir and Ellen Riloff Session TSK2: (11:00–12:30) Shared Task (See *SEM Shared Task View for details) xxii Day 2: Friday June 8th 2012 (*SEM Main Conference View) (continued) (12:15–2:00) Lunch Session *SEM8: (2:00–3:15) Long Papers: Semantic Parsing","2:00–2:25 An Exact Dual Decomposition Algorithm for Shallow Semantic Parsing with Constraints Dipanjan Das, André F. T. Martins and Noah A. Smith","2:25–2:50 Aligning Predicate Argument Structures in Monolingual Comparable Texts: A New Corpus for a New Task Michael Roth and Anette Frank","2:50–3:15 The Effects of Semantic Annotations on Precision Parse Ranking Andrew MacKinlay, Rebecca Dridan, Diana McCarthy and Timothy Baldwin Session SE4: (2:00–3:30) SemEval Poster Session 1 (See SemEval View for details) (3:15–4:00) Coffee Break Session *SEM9: (4:00–5:15) Long Papers 6: Semantic Inference","4:00–4:25 A Probabilistic Lexical Model for Ranking Textual Inferences Eyal Shnarch, Ido Dagan and Jacob Goldberger","4:25–4:50 #Emotional Tweets Saif Mohammad","4:50–5:15 Monolingual Distributional Similarity for Text-to-Text Generation Juri Ganitkevitch, Benjamin Van Durme and Chris Callison-Burch Session SE5: (4:00–5:15) SemEval Poster Session 2 (See SemEval View for details) Session PLN3: (5:15–6:00) Plenary Panel and Closing: *SEM and the Future —- End of *SEM Main Conference View —- xxiii *SEM Shared Task View Day 1: Thursday June 7th 2012 (*SEM Shared Task View) (Same as *SEM Main Conference View) Day 2: Friday June 8th 2012 (*SEM Shared Task View) Session PLN2: (08:15–09:15) Best Paper Awards and Shared Task (Plenary) 08:15–08:20 Announcement of Best Papers 08:20–08:30 Best Short Paper Speech 08:30–08:45 Best Long Paper Speech 08:45–09:10 Shared Task: Resolving the Scope and Focus of Negation Session TSK1: (09:15–10:30) Shared Task Session 1","09:15–09:30 *SEM 2012 Shared Task: Resolving the Scope and Focus of Negation Roser Morante and Eduardo Blanco","09:30–09:45 UABCoRAL: A Preliminary study for Resolving the Scope of Negation Binod Gyawali and Thamar Solorio","09:45–10:00 UCM-I: A Rule-based Syntactic Approach for Resolving the Scope of Negation Jorge Carrillo de Albornoz, Laura Plaza, Alberto Dı́az and Miguel Ballesteros","10:00–10:15 UCM-2: a Rule-Based Approach to Infer the Scope of Negation via Dependency Parsing Miguel Ballesteros, Alberto Dı́az, Virginia Francisco, Pablo Gervás, Jorge Carrillo de Albornoz and Laura Plaza","10:15–10:30 UConcordia: CLaC Negation Focus Detection at *Sem 2012 Sabine Rosenberg and Sabine Bergler (10:30–11:00) Coffee Break xxiv Day 2: Friday June 8th 2012 (*SEM Shared Task View) (continued) Session TSK2: (11:00–12:30) Shared Task Session 2","11:00–11:15 UGroningen: Negation detection with Discourse Representation Structures Valerio Basile, Johan Bos, Kilian Evang and Noortje Venhuizen","11:15–11:30 UiO1: Constituent-Based Discriminative Ranking for Negation Resolution Jonathon Read, Erik Velldal, Lilja Øvrelid and Stephan Oepen","11:30–11:45 UiO 2: Sequence-labeling Negation Using Dependency Features Emanuele Lapponi, Erik Velldal, Lilja Øvrelid and Jonathon Read","11:45–12:00 UMichigan: A Conditional Random Field Model for Resolving the Scope of Negation Amjad Abu Jbara and Dragomir Radev","12:00–12:15 UWashington: Negation Resolution using Machine Learning Methods James Paul White FBK: Exploiting Phrasal and Contextual Clues for Negation Scope Detection Md. Faisal Mahbub Chowdhury 12:15–12:30 Discussion (12:30–2:00) Lunch – no Shared Task-specific afternoon sessions – (See *SEM Main Conference and SemEval Views for details) Session PLN3: (5:15–6:00) Plenary Panel and Closing: *SEM and the Future —- End of *SEM Shared Task View —- xxv SemEval View Day 1: Thursday June 7th 2012 (SemEval View) (08:00–09:15) Registration Session PLN1: (09:15–10:30) Opening Remarks and Keynote Address (Plenary) 09:15–09:30 *SEM Opening 09:30–10:30 Keynote Address by Jerry Hobbs (10:30–11:00) Coffee Break Session SE1: (11:00–12:40) SemEval Session 1 11:00–11:10 Welcome to SemEval-2012","11:10 SemEval-2012 Task 1: English Lexical Simplification Lucia Specia, Sujay Kumar Jauhar and Rada Mihalcea","11:25 SemEval-2012 Task 2: Measuring Degrees of Relational Similarity David Jurgens, Saif Mohammad, Peter Turney and Keith Holyoak","11:40 SemEval-2012 Task 3: Spatial Role Labeling parisa kordjamshidi, steven bethard and Marie-Francine Moens","11:55 SemEval-2012 Task 4: Evaluating Chinese Word Similarity Peng Jin and Yunfang Wu","12:10 SemEval-2012 Task 5: Chinese Semantic Dependency Parsing Wanxiang Che, Meishan Zhang, Yanqiu Shao and Ting Liu","12:25 SemEval-2012 Task 6: A Pilot on Semantic Textual Similarity Eneko Agirre, Daniel Cer, Mona Diab and Aitor Gonzalez-Agirre (12:40–2:00) Lunch xxvi Day 1: Thursday June 7th 2012 (SemEval View) (continued) Session SE2: (2:00–3:30) SemEval Session 2","2:00 SemEval-2012 Task 7: Choice of Plausible Alternatives: An Evaluation of Commonsense Causal Reasoning Andrew Gordon, Zornitsa Kozareva and Melissa Roemmele","2:15 Semeval-2012 Task 8: Cross-lingual Textual Entailment for Content Synchronization Matteo Negri, Alessandro Marchetti, Yashar Mehdad, Luisa Bentivogli and Danilo Giampiccolo","2:30 EMNLP@CPH: Is frequency all there is to simplicity? Anders Johannsen, Héctor Martı́nez, Sigrid Klerke and Anders Søgaard","2:45 UTD: Determining Relational Similarity Using Lexical Patterns Bryan Rink and Sanda Harabagiu","3:00 UTD-SpRL: A Joint Approach to Spatial Role Labeling Kirk Roberts and Sanda Harabagiu","3:15 MIXCD: System Description for Evaluating Chinese Word Similarity at SemEval-2012 Yingjie Zhang, Bin Li, Xinyu Dai and Jiajun Chen (3:30–4:00) Coffee Break Session SE3: (4:00–6:00) SemEval Session 3","4:00 Zhijun Wu: Chinese Semantic Dependency Parsing with Third-Order Features Zhijun Wu, Xuan Wang and Xinxin Li","4:15 UKP: Computing Semantic Textual Similarity by Combining Multiple Content Similarity Measures Daniel Bär, Chris Biemann, Iryna Gurevych and Torsten Zesch","4:30 TakeLab: Systems for Measuring Semantic Text Similarity Frane Šarić, Goran Glavaš, Mladen Karan, Jan Šnajder and Bojana Dalbelo Bašić","4:45 Soft Cardinality: A Parameterized Similarity Function for Text Comparison Sergio Jimenez, Claudia Becerra and Alexander Gelbukh xxvii Day 1: Thursday June 7th 2012 (SemEval View) (continued)","5:00 UNED: Improving Text Similarity Measures without Human Assessments Enrique Amigó, Jesus Gimenez, Julio Gonzalo and Felisa Verdejo","5:15 UTDHLT: COPACETIC System for Choosing Plausible Alternatives Travis Goodwin, Bryan Rink, Kirk Roberts and Sanda Harabagiu","5:30 HDU: Cross-lingual Textual Entailment with SMT Features Katharina Wäschle and Sascha Fendrich","5:45 UAlacant: Using Online Machine Translation for Cross-Lingual Textual Entailment Miquel Esplà-Gomis, Felipe S ánchez-Mart ı́nez and Mikel L. Forcada Day 2: Friday June 8th 2012 (SemEval View) Session PLN2: (08:15–09:15) Best Paper Awards and Shared Task (Plenary) 08:15–08:20 Announcement of Best Papers 08:20–08:30 Best Short Paper Speech 08:30–08:45 Best Long Paper Speech 08:45–09:10 Shared Task: Resolving the Scope and Focus of Negation – No SemEval-specific morning sessions – (See *SEM Main Conference and Shared Task Views for details) (12:15–2:00) Lunch xxviii Day 2: Friday June 8th 2012 (SemEval View) (continued) Session SE4: (2:00–3:30) SemEval Poster Session 1 UOW-SHEF: SimpLex – Lexical Simplicity Ranking based on Contextual and Psycholinguistic Features Sujay Kumar Jauhar and Lucia Specia SB: mmSystem - Using Decompositional Semantics for Lexical Simplification Marilisa Amoia and Massimo Romanelli ANNLOR: A Naı̈ve Notation-system for Lexical Outputs Ranking Anne-Laure Ligozat, Cyril Grouin, Anne Garcia-Fernandez and Delphine Bernhard UNT-SimpRank: Systems for Lexical Simplification Ranking Ravi Sinha Duluth : Measuring Degrees of Relational Similarity with the Gloss Vector Measure of Semantic Relatedness Ted Pedersen BUAP: A First Approximation to Relational Similarity Measuring Mireya Tovar, J. Alejandro Reyes, Azucena Montes, Darnes Vilariño, David Pinto and Saul León Zhou qiaoli: A divide-and-conquer strategy for semantic dependency parsing zhou qiaoli, zhang ling, liu fei, cai dongfeng and zhang guiping ICT:A System Combination for Chinese Semantic Dependency Parsing Hao Xiong and Qun Liu NJU-Parser: Achievements on Semantic Dependency Parsing Guangchao Tang, Bin Li, Shuaishuai Xu, Xinyu Dai and Jiajun Chen PolyUCOMP: Combining Semantic Vectors with Skip bigrams for Semantic Textual Similarity Jian Xu, Qin Lu and Zhengzhong Liu ETS: Discriminative Edit Models for Paraphrase Scoring Michael Heilman and Nitin Madnani Sbdlrhmn: A Rule-based Human Interpretation System for Semantic Textual Similarity Task Samir AbdelRahman and Catherine Blake xxix Day 2: Friday June 8th 2012 (SemEval View) (continued) LIMSI: Learning Semantic Similarity by Selecting Random Word Subsets Artem Sokolov ATA-Sem: Chunk-based Determination of Semantic Text Similarity Demetrios Glinos IRIT: Textual Similarity Combining Conceptual Similarity with an N-Gram Comparison Method Davide Buscaldi, Ronan Tournier, Nathalie Aussenac-Gilles and Josiane Mothe DSS: Text Similarity Using Lexical Alignments of Form, Distributional Semantics and Grammatical Relations Diana McCarthy, Spandana Gella and Siva Reddy DeepPurple: Estimating Sentence Semantic Similarity using N-gram Regression Models and Web Snippets NIkos Malandrakis, Elias Iosif and Alexandros Potamianos JU CSE NLP: Multi-grade Classification of Semantic Similarity between Text Pairs Snehasis Neogi, Partha Pakray, Sivaji Bandyopadhyay and Alexander Gelbukh Tiantianzhu7:System Description of Semantic Textual Similarity (STS) in the SemEval-2012 (Task 6) Zhu Tiantian and Lan Man sranjans : Semantic Textual Similarity using Maximal Weighted Bipartite Graph Matching Sumit Bhagwani, Shrutiranjan Satapathy and Harish Karnick Weiwei: A Simple Unsupervised Latent Semantics based Approach for Sentence Similarity Weiwei Guo and Mona Diab UNIBA: Distributional Semantics for Textual Similarity Annalina Caputo, Pierpaolo Basile and Giovanni Semeraro UNITOR: Combining Semantic Text Similarity functions through SV Regression Danilo Croce, Paolo Annesi, Valerio Storch and Roberto Basili Saarland: Vector-based models of semantic textual similarity Georgiana Dinu and Stefan Thater (3:30–4:00) Coffee Break xxx Day 2: Friday June 8th 2012 (SemEval View) (continued) Session SE5: (4:00–5:15) SemEval Poster Session 2 UMCC DLSI: Multidimensional Lexical-Semantic Textual Similarity Antonio Fernández, Yoan Gutiérrez, Héctor Dávila, Alexander Chávez, Andy González, Rainel Estrada, Yenier Castañeda, Sonia Vázquez, Andrés Montoyo and Rafael Muñoz SRIUBC: Simple Similarity Features for Semantic Textual Similarity Eric Yeh and Eneko Agirre FBK: Machine Translation Evaluation and Word Similarity metrics for Semantic Textual Similarity José Guilherme Camargo de Souza, Matteo Negri and Yashar Mehdad FCC: Three Approaches for Semantic Textual Similarity Maya Carrillo, Darnes Vilariño, David Pinto, Mireya Tovar, Saul León and Esteban Castillo UNT: A Supervised Synergistic Approach to Semantic Text Similarity Carmen Banea, Samer Hassan, Michael Mohler and Rada Mihalcea DERI&UPM: Pushing Corpus Based Relatedness to Similarity: Shared Task System Description Nitish Aggarwal, Kartik Asooja and Paul Buitelaar Stanford: Probabilistic Edit Distance Metrics for STS Mengqiu Wang and Daniel Cer University Of Sheffield: Two Approaches to Semantic Text Similarity Sam Biggins, Shaabi Mohammed, Sam Oakley, Luke Stringer, Mark Stevenson and Judita Preiss janardhan: Semantic Textual Similarity using Universal Networking Language graph matching Janardhan Singh, Arindam Bhattacharya and Pushpak Bhattacharyya SAGAN: An approach to Semantic Textual Similarity based on Textual Entailment Julio Castillo and Paula Estrella UOW: Semantically Informed Text Similarity Miguel Rios, Wilker Aziz and Lucia Specia Penn: Using Word Similarities to better Estimate Sentence Similarity Sneha Jha, Hansen A. Schwartz and Lyle Ungar xxxi Day 2: Friday June 8th 2012 (SemEval View) (continued) Soft Cardinality + ML: Learning Adaptive Similarity Functions for Cross-lingual Textual Entailment Sergio Jimenez, Claudia Becerra and Alexander Gelbukh JU CSE NLP: Language Independent Cross-lingual Textual Entailment System Snehasis Neogi, Partha Pakray, Sivaji Bandyopadhyay and Alexander Gelbukh CELI: An Experiment with Cross Language Textual Entailment Milen Kouylekov, Luca Dini, Alessio Bosca and Marco Trevisan FBK: Cross-Lingual Textual Entailment Without Translation Yashar Mehdad, Matteo Negri and Jose Guilherme C. de Souza BUAP: Lexical and Semantic Similarity for Cross-lingual Textual Entailment Darnes Vilariño, David Pinto, Mireya Tovar, Saul León and Esteban Castillo DirRelCond3: Detecting Textual Entailment Across Languages With Conditions On Directional Text Relatedness Scores Alpar Perini ICT: A Translation based Method for Cross-lingual Textual Entailment Fandong Meng, Hao Xiong and Qun Liu SAGAN: A Machine Translation Approach for Cross-Lingual Textual Entailment Julio Castillo and Marina Cardenas Session PLN3: (5:15–6:00) Plenary Panel and Closing: *SEM and the Future —- End of SemEval View —- xxxii"]}]}