{"sections":[{"title":"Book Reviews Natural Language Processing Harry Tennant Petrocelli Books, Princeton, 1981, 276 pp., Paperback, $17.50, ISBN 089433-100-0. (Dist: Van Nostrand-Reinhold, New York)","paragraphs":["How do computers understand natural language? This question is asked by interested lay persons as well as computer scientists who are not familiar with artificial intelligence. This book provides the reader with an introduction to the field and the general flavor of many natural language processing programs. The emphasis is on the positive results that have been attained and general methods that are frequently employed.","The book opens with motivations for natural language research: many practical advantages for user interfaces and understanding the human mind. Subsequent chapters deal mainly with the first motivation. A description of a simple natural language processor is the vehicle used to introduce the concept of semantic nets, rudimentary syntactic and semantic analysis, and the inherently ambiguous nature of natural language. Chapter 2 surveys a variety of early natural language processing programs, including BASEBALL, SAD-SAM, SYNTHEX, STUDENT, DEACON, and DOC-TOR. Unfortunately, no rigorous analysis of the limitations of these programs is presented, other than not-ing the limited computing technology available at the time and the necessary failure of a word-by-word translation approach.","Chapter 3 is devoted to syntax, using BNF notation, transition networks, surface structure, deep structure and transformations (though no mention of Chomsky!), followed by discussions of top-down, bottom-up and hybrid parsing schemes. Chapters 4 and 5 present semantics. Chapter 4 is an excellent introduction to the types of problems a semantic component of a natural language processor must address. For the person who has not thought deeply about the nature of natural language, the examples clearly distinguish problems such as multiple word senses, modifier attachment, noun-noun modification, pronouns, determiners, ellipses, and substitution. Case frames and concept decomposition are presented as means for dealing with these problems. Chapter 5 is a large collection of brief descriptions of implemented semantic analyzers: Air Line Guide, ROBOT, Preference Semantics, SOPHIE, LIFER, Linguistic String Project, PLANES, RENDEZVOUS, and ELI. Each semantic analyzer is presented independently; no analysis of strengths and weaknesses is given.","The notion of frames is presented in Chapter 5, along with a good discussion of understanding as a memory-based process and the close coupling of natural language processing and knowledge representation. Throughout the first six chapters, natural language understanding is presented as single sentence understanding. The final chapter, however, addresses discourse analysis: speech acts, rules for discourse and the difference between the rules for spoken and written dialog.","I would recommend this book to the general reader as a comprehensive introduction to natural language processing that does not get bogged down with details and the inner workings of particular implementations. The reader will come away with an understanding of both the enormous problems natural language understanding researchers must address and the many generally accepted methods of attacking these problems. The reader will not, however, be provided with underlying linguistic theory, a unifying historical perspective or an analysis of inadequacies.","Although the book is flawed by a lack of theory and the use of formalisms, such as semantic nets and BNF, without definition, it might be a good text for a stand-alone introductory undergraduate AI course, if it is supplemented with further readings and lectures that provide more depth. Sharon C. Salveter, SUNY Stony Brook 258 American Journal of Computational Linguistics, Volume 7, Number 4, October-December 1981"]}]}