{"sections":[{"title":"The FINITE STRING Newsletter Announcements Announcements Seventh International ALLC Symposium to be Held in Pisa","paragraphs":["The Seventh International ALLC Symposium on Computers in Literary and Linguistic Research will be held at Pica, Italy, from Monday, June 7, to Friday, June 11, t982. The symposium is organized by the Association for Literary and Linguistic Computing and sponsored by the Association for Computers and the Humanities. The themes of the symposium are the theories, methods, problems and applications of literary and linguistic computing. Papers from the following sectors are expected: lexicology, lexicography, terminology, lexical data bases, and computerized dictionaries; concordances, indices, text-processing, content analysis; authorship studies, stylistic analysis, textual criticism; literary statistics, metrics, quantitative linguistics; historical linguistics, language-oriented studies, dialectology; phonologic, morphologic, syntactic, semantic analysis, and natural language processing; software and hardware for literary and linguistic computing.","During the symposium, it will be possible to organize panel discussions, working groups, etc., for the ALLC specialist groups or on other topics suggested in advance by participants. For further information contact: Professor Antonio Zampolli VII ALLC Symposium Istituto di Linguistica Computazionale","del CNR Via della Faggiola 32-56100 Pisa ITALY (050) 502082 1983 ALLC Meeting Planned for San Francisco","The Association for Literary and Linguistic Computing will hold its 1983 Meeting in San Francisco, California, April 6-8, 1983. The deadline for paper proposals for the meeting is September 30, 1982. For further information contact: James Joyce ITS 2000 Center Street, Suite 1036 Berkeley, California 94704 (415) 621-6415 Office Information Systems Conference in Philadelphia","A Conference on Office Information Systems, sponsored by ACM-SIGOA, will be held in Philadelphia, Pennsylvania, June 21-23, 1982. The objectives of this conference are to provide a forum for the emerging area of office automation for the presenta-tion and discussion of both current and future research. The research areas range from modeling and systems methodologies through social and behavioral studies. Opportunity will be provided for the informal exchange of ideas, and broad participation of attendees will be encouraged. Original papers will be presented in the following areas relating to office information systems: communications, human-computer communication, systems, office semantics, services, and organizational and social issues. For further information contact: John Limb Bell Laboratories 600 Mountain Avenue Murray Hill, New Jersey 07974 Society for Scholarly Publishing Annual Meeting to be Held in Washington","The Society for Scholarly Publishing (SSP) has announced the program for its fourth annual meeting to be held June 24-26, 1982, in Washington, D.C. (Crystal Gateway Marriott, Arlington, Virginia). The theme of this year's meeting is, \"The Challenge of Change: Critical Choices for Scholarly Publishing.\" Fifteen sessions are planned concentrating on the affects of new technology on scholarly publishing and the impact of budget and governmental changes.","One session of particular interest to ACL members will be held on Friday, June 25, from 10:30 until noon. It is entitled \"The New Technology: Focus on Scholarly Applications\" and will be chaired by Sarah Burton, North Carolina State University. It will consist of three papers: The Writer's Workbench: New Tools for Improving Writing","Nina McDonald, Bell Laboratories","Can Academics Publish Online? Joseph Raben, CUNY","What's New in Machine Translation? Wayne Zachary, Analytics Inc. 264 American Journal of Computational Linguistics, Volume 7, Number 4, October-December 1981 The FINITE STRING Newsletter Announcements For further information contact: Alice O'Leary Society for Scholarly Publishing 2000 Florida Avenue N.W. Washington, D.C. 20009 AAAI-82 to be Held in Pittsburgh","The Second National Conference on Artificial Intelligence sponsored by the American Association for Artificial Intelligence (AAAI), in cooperation with ACM SIGART, will be held August 18-20, 1982, at The University of Pittsburgh and Carnegie-Mellon University in Pittsburgh, Pennsylvania. There will also be a two-day Tutorial Program August 16-17. Conference chairman is Marvin Minsky of"]},{"title":"M.I.T.","paragraphs":["The topics to be covered include knowledge representation, cognitive modeling, knowledge acquisition, problem solving and search, program synthesis and understanding, A.I. languages and software, specialized architectures for A.I., game playing, theoretical foundations, vision, robotics, theorem proving, natural language, and applications systems. For additional information contact: Louis F. Robinson American Assoc. for A.I. 445 Burgess Drive Menlo Park, California 94025"]},{"title":"(415) 328-3123 LISP and Functional Programming Symposium","paragraphs":["The 1982 ACM Symposium on LISP and Functional Programming will be held in Pittsburgh, Pennsylvania, on August 16-19, 1982. This symposium is the successor to the 1963 and 1980 LISP Conferences, broadened to include applicative language issues. Are-as of interest include systems, large implementations, environments, architectures, novel constructs, and non-traditional applications for LISP, APL, FP, PRO-LOG, or a similar language that would apply to other such languages. The symposium is sponsored by the ACM Special Interest Groups on Programming Languages (SIGPLAN), Automata and Computability (SIGACT), and Artificial Intelligence (SIGART). It is chaired by David M.R. Park of the University of Warwick, England, and is scheduled to coordinate with the AAAI meeting. The local arrangem6nts chairman is: Guy L. Steele, Jr. Computer Science Department Carnegie-Mellon University Pittsburgh, Pennsylvania 15213 Sixth German Workshop on Artificial Intelligence","GWAI-82, the Sixth German Workshop on Artificial Intelligence will be held in Bad Honnef (Physikzentrum, HauptstraBe 5, D-5340 Bad Honnef), September 27 - October 1, 1982. The workshop is organized by the special interest group on artificial intelligence in the Gesellschaft fur Informatik (GI).","Papers concerning all aspects of artificial intelligence will be considered. A selection of accepted papers will be published in the proceedings by Springer-Verlag. Conference languages are English and German. Four copies of extended abstracts (3 pages) or complete papers must be sent to the chairman by June 1, 1982. Author notification of acceptance or rejection will be made after July 1, 1982. Camera-ready copy will be due September 1, 1982. The program committee consists of P. Deussen"]},{"title":"Karlsruhe,","paragraphs":["J. Foith"]},{"title":"Kaiserslautern,","paragraphs":["B. Neumann"]},{"title":"Hamburg,","paragraphs":["P. Raulefs"]},{"title":"Kaiserslautern,","paragraphs":["J. Siekmann"]},{"title":"Karlsruhe,","paragraphs":["and W. Wahlster"]},{"title":"Hamburg.","paragraphs":["The chairman is: Dr. Wolf gang Wahlster FB Informatik University of Hamburg SchluterstraBe 70 D-2000 Hamburg 13 WEST GERMANY"]},{"title":"(040) 4123 3315 ~,IJCAI-83 to be Held in Karlsruhe","paragraphs":["The next International Joint Conference on Artificial Intelligence (IJCAI-83) will be held in Karlsruhe, West Germany, during the week of August 8-12, 1983. The Conference General Chairman is Saul Amarel,"]},{"title":"Rutgers University","paragraphs":["Allan Bundy,"]},{"title":"Edinburgh University,","paragraphs":["is Program Chairman; Joerg Siekmann and Graham Wrightson,"]},{"title":"University of Karlsruhe,","paragraphs":["together with Peter Raulefs,"]},{"title":"University of Bonn,","paragraphs":["are responsible for local arrangements.","For further information, contact: Saul Amarel Computer Science Department Hill Center/Busch Campus Rutgers University New Brunswick, New Jersey 08903"]},{"title":"(201) 932-3546 Chinese-Language Computer Society","paragraphs":["The 1982 International Conference of the Chinese-Language Computer Society will be held September 22-23, 1982 (during COMPCON week), in Washington, D.C. Research or tutorial papers are solicited on American Journal of Computational Linguistics, Volume 7, Number 4, October-December 1981 265 The FINITE STRING Newsletter Announcements all aspects of computer processing of Chinese and oriental languages. Submit 3 copies of a 150-200 word abstract or the full paper by May 21, 1982, to: Professor C.Y. Suen Program Chairman Department of Computer Science Concordia University 1455 de Maisonneuve West Montreal, Quebec H3G 1M8, CANADA Delaware Symposium on Language Studies IV","The Linguistics Program at the University of Delaware has announced the Delaware Symposium on Language Studies IV, to take place October 14-16, 1982, at the University of Delaware. The major theme of the symposium is linguistics, humanism and information management. Papers (due March 1, 1982) are expected to address the following and related topics: computer assisted second language instruction, computer literacy, mechanical methods of literary analysis, machine translation, artificial intelligence and the creation of language, automatic recognition of speech, computer-controlled generation of synthetic speech, synthetic speech vs. natural speech, human-computer interaction, and mechanical methods of discourse analysis.","For further information about the program, contact: Dr. Stephanie Williams Department of Languages and Literature University of Delaware Newark, Delaware 19711 ASIS-82 To Be Held in Columbus","The American Society for Information Science's 45th Annual Meeting will be held in Columbus, Ohio, October 17-21, 1982. The theme for the meeting is based upon the premise that information is derived from, and is the basis for, interaction among organizations as well as individuals. Topics to be covered include: information systems, information system design for effective interaction, organizational interaction, educational interaction, communication technologies, and graphic communications. For more information, contact: John Fried - Room CA ASIS-82 Technical Program Chairman Battelle Columbus Laboratories 505 King Avenue Columbus, Ohio 43201 Symposium on Empirical Foundations of Information and Software Science","Georgia Institute of Technology will host a Symposium on Empirical Foundations of Information and Software Science on November 3-5, 1982, in Atlanta, Georgia. Co-sponsors of the Symposium are the Special Interest Group for Foundations of Information Science (SIG/FIS) of the American Society of Information Science and the Army Institute for Research in Management Information and Computer Science (AIRMICS).","The Symposium presentations will contain invited and contributed papers on research methodology for information and software science and on information science and software laws, with special emphasis on information science applications to software evaluation and software metrics. Papers on the following topics are expected: methods of experimental design; measurement techniques; empirical laws and theories of information and software science; validation and verification of empirical laws and theories; databases for"]},{"title":"experimentation;","paragraphs":["and software properties, their evaluation and measurement.","All inquiries and other correspondence regarding","the Symposium should be addressed to: Professor Pranas Zunde Chairman, Symposium Organizing Committee School of Information and Computer Science Georgia Institute of Technology Atlanta, Georgia 30332 EUROMICRO 82 to be Held in Haifa","EUROMICRO 82 is the eighth annual symposium organized by EUROMICRO, the European Association for Microprocessing and Microprogramming. It will be held September 5-9, 1982, in Haifa, Israel. The purpose of the EUROMICRO conference is to bring together practitioners and theoreticians from industry, government and academia who are interested in all problems relating to the underlying concepts and the use of microprocessing and microprogramming.","For scientific papers, authors should submit six copies by March 1, 1982. For short notes, authors should submit four copies of an abstract, of no more than three pages, to the deputy program chairman before June 11, 1982; they will be notified of acceptance by July 12, 1982.","The deputy program chairman is: L. Richter University of Dortmund-Informatik III P.O. Box 500 500 D-4600 Dortmund WEST GERMANY"]},{"title":"(49) (231) 7552780","paragraphs":["266 American Journal of Computational Linguistics, Volume 7, Number 4, October-December 1981 The FINITE STRING Newsletter Announcements Erratum","On the cover of the previous issue of the AJCL (Vol. 7, No. 3, July-September 1981), an author's name was misspelled. \"David J. Webber\" should have been \"David J. Weber.\" The Editor and his staff apologize for any inconvenience or embarrassment that this may have caused the author. Other Conferences","The ACL will sponsor two sessions at the third","annual AFIPS Office Automation Conference, to be","held on April 5-7, 1982, in the Moscone Center at San","Francisco, California. [See AJCL 7:3, pg. 180.] For","further information contact:","Lance A. Miller","IBM Thomas J. Watson Research Center","P.O. Box 218","Yorktown Heights, New York 10598","(914) 945-1670 An April Fool's Day Conference on the language of","humor and the humor of language, sponsored by the","Western Humor and Irony Membership, will be held in","Tempe, Arizona, on April 1, 1982. For further infor-","mation contact:","Don L.F. Nilsen","WHIM Conference,English Department","Arizona State University","Tempe, Arizona 85281 The Sixth European Meeting on Cybernetics and","Systems Research , organized by the Austrian Society","for Cybernetic Studies, will be held April 13-16, 1982,","at the University of Vienna, Austria. [See AJCL 7:2,","pg. 123.] For further information about the meeting,","contact the chairman:","Professor Robert Trappl","Department of Medical Cybernetics","University of Vienna","Freyung 6/2","A-1010 Vienna, AUSTRIA","A Symposium on Artificial Intelligence, sponsored by the Austrian Society for Artificial Intelligence and the Austrian Society for Cybernetic Studies, will be held at the Sixth European Meeting on Cybernetics and Systems Research, April 13-16, 1982, in Vienna. [See AJCL 7:2, pg. 123.] For further information contact:","Organizing Committee of the 6th EMCSR 82","Austrian Society for Cybernetic Studies","Schottengasse 3","A- 1010 Vienna, AUSTRIA","The Fourth National Conference of the Canadian Society for Computational Studies of Intelligence/ Socidtd Canadienne pour Etudes d'intelligence par Ordinateur will be held at the University of Saskatchewan in Saskatoon, Canada, May 17-19, 1982, in conjunction with the 1982 National Conference of the Canadian Information Processing Society. [See AJCL 7:3, pg. 182.] Correspondence should be addressed to: Gordon McCalla, General Chairman CSCSI/SCEIO Conference Department of Computational Science University of Saskatchewan Saskatoon, Sask. CANADA S7N 0W0 The Fifth European Conference on Electrotechnics","will take place in Copenhagen at The Technical Uni-","versity of Denmark, on June 14-18, 1982. [See AJCL","7:2, pg. 122.] Further details may be obtained from:","DIEU, Danish Engineers' Post Graduate Inst.","The Technical Univ. of Denmark, Bldg. 208","DK-2800 Lyngby, DENMARK","The Fourth International Study Conference on Classification Research will take place in Augsburg, near Munich, from June 28 to July 2, 1982, together with the 6th Annual Conference of the German Society for Classification. [See AJCL 7:3, pg. 183.] Further information may be obtained from:","FID/CR Secretariat","Woogstr. 36a","D-6000 Frankfurt 50, WEST GERMANY","The Ninth International Conference on Computational Linguistics (COLING 82) will be held July 5-10, 1982, in Prague, Czechoslovakia. It will be sponsored by the International Committee on Computational Linguistics, in association with the Linguistic Institute of L. Stlar, Slovak Academy of Science, Bratislava, and the Faculty of Mathematics and Physics, Charles University, Prague. [See AJCL 7:2, pg. 122.] For further information contact: COLING 82 MFF UK, Linguistics Malostranske n. 25 118 00 Prague 1, CZECHOSLOVAKIA The 1982 European Conference on Artificial Intelligence will be held July 12-14, 1982, in Orsay, France (just after COLING-82). The conference is sponsored by the Society for the Study of Artificial Intelligence and the Simulation of Behavior (AISB). [See AJCL 7:3, pg. 182.] General inquiries about the conference should be addressed to:","Yves Kodratoff, General Chairman","Institut de programmation","4, Place Jussieu","F-75230 Paris Cedex 05, France","33-1-329 12 21, ext. 53-90 American Journal of Computational Linguistics, Volume 7, Number 4, October-December 1981 267"]}]}