{"sections":[{"title":"The FINITE STRING Newsletter","paragraphs":["Announcements"]},{"title":"Announcements NELS Meeting and Workshop","paragraphs":["The Twelfth Annual Meeting of the North-Eastern Linguistic Society will be held November 6-8, 1981, at the Massachusetts Institute of Technology. Plans are also being made to hold a workshop immediately before the Meeting on the topic \"Free Word-Order and Syntactic Configuration\". Questions to be addressed at the workshop include: what are the functions of word-order in syntax and semantics? what degrees of freedom are there of word-order? how should the different functions and degrees of word-order be expressed within a theory of universal grammar?","For further information contact: NELS Committee Department of Linguistics and Philosophy M.I.T., 20C-128 Cambridge, Massachusetts 02139"]},{"title":"CSCSI/SCEIO: Call for Papers","paragraphs":["The Fourth National Conference of the Canadian Society for Computational Studies of Intelligence/ Soci6t6 Canadienne pour Etudes d'intelligence par Ordinateur will be held at the University of Saskatchewan in Saskatoon, Canada, May 17-19, 1982, in conjunction with the 1982 National Conference of the Canadian Information Processing Society. Papers are solicited in all areas of Artificial Intelligence, including expert systems, natural language understanding, knowledge representation, heuristic problem solving, automatic programming, computer perception and vision, image analysis and understanding, robotics, programming systems for AI, psychological aspects of AI, automatic theorem proving, learning, social implications of AI, and advanced applications.","Four copies of an extended abstract of 1500-2000 words (6-10 double-spaced pages) must be submitted before December 7, 1981. All submissions will be read by several members of the program committee and evaluated on the basis of significance, originality, and overall quality. The abstract must summarize the novel ideas, contain enough information about the scope of work, and include comparisons to the relevant literature.","Authors will be notified of acceptance or rejection by January 31, 1982. The accepted papers, typed on special forms, will be due March 21, 1982. Each accepted paper will be allotted 25 minutes (presentation plus brief question period).","Information concerning local arrangements will be available from the general chairman. Proceedings will be distributed at the conference, and will be subsequently available for purchase from CIPS.","The Program Committe consists of: James Allen, Norm Badler, Mike Bauer, Wayne Davis, Mark Fox, Bill Havens, Hector Levesque, Charles Morgan, John Mylopoulos, Zenon Pylyshyn, Reid Smith, and Doug Skuce. The Proceedings Editor is Brian Funt.","Correspondence should be addressed to: Gordon McCalla, General Chairman CSCSI/SCEIO Conference Department of Computational Science University of Saskatchewan Saskatoon, Sask. CANADA S7N 0W0 Nick Cercone, Program Chairman CSCSI/SCEIO Conference Computing Science Department Simon Fraser University Burnaby, B.C. CANADA V5A 1S6"]},{"title":"ECAI-82: Call for Papers","paragraphs":["The 1982 European Conference on Artificial Intelligence will be held July 12-14, 1982, in Orsay, France (just after COLING-82). The conference is sponsored by the Society for the Study of Artificial Intelligence and the Simulation of Behavior (AISB), and succeeds to the AISB meetings on Artificial Intelligence held at Brighton (1974), Edinburgh (1976), Hamburg (1978), and Amsterdam (1980). It is concerned with all aspects of Artificial Intelligence and its applications. Invited speakers include H. Berliner"]},{"title":"(Carnegie-Mellon University, Pittsburgh),","paragraphs":["H. Gallaire"]},{"title":"(CGE Marcoussis),","paragraphs":["G. Huet"]},{"title":"(INRIA, Paris),","paragraphs":["R. Kowalski"]},{"title":"(Imperial College, London),","paragraphs":["R. Schank"]},{"title":"(Yale University, New Haven).","paragraphs":["Both regular and short papers will be considered, but a paper should be submitted to the Program Chairman for one category only. The conference language is English."]},{"title":"Regular papers","paragraphs":["must not exceed 15 typewritten pages (A4 format)."]},{"title":"Short papers","paragraphs":["must not exceed 5 typewritten pages (A4 format). Papers in both categories should include name(s) and address(es) of the author(s), a 100-word abstract, and a list of descriptive keywords. All papers will be refereed. Office and/or home telephone number(s) should be included in an accompanying letter when submitting a paper. Final papers must be typed camera-ready on special forms for inclusion in the Conference Proceedings. The submission deadline is November 30, 1981; notification of acceptance will be made by February 15, 1982; and camera-ready copy will be due March 15, 1982. Conference Proceedings will be ready for distribution at the conference.","The members of the Program Committe are: L. Bolc"]},{"title":"(Warsaw),","paragraphs":["A. Bundy"]},{"title":"(Edinburgh),","paragraphs":["G. Guiho"]},{"title":"(Paris),","paragraphs":["I. Havel"]},{"title":"(Prague),","paragraphs":["L. Henschen"]},{"title":"(Evanston), Y.","paragraphs":["Kodratoff"]},{"title":"(Paris),","paragraphs":["J. Mayhew"]},{"title":"(Sheffield),","paragraphs":["D. Michie"]},{"title":"(Edinburgh),","paragraphs":["R. de Mori"]},{"title":"(Turin),","paragraphs":["L.M. Pereira"]},{"title":"(Lisbon),","paragraphs":["R. Poppelstone"]},{"title":"(Edinburgh),","paragraphs":["P. Raulefs"]},{"title":"(Bonn), D. 182 American Journal of Computational","paragraphs":["Linguistics, Volume 7, Number 3, July-September 1981 The FINITE STRING Newsletter Announcements Sleeman"]},{"title":"(Leeds),","paragraphs":["N.S. Sridharan"]},{"title":"(New Brunswick), W.","paragraphs":["Wahster"]},{"title":"(Hamburg),","paragraphs":["Y. Wilks"]},{"title":"(Colchester).","paragraphs":["General inquiries about the conference should be","addressed to: Yves Kodratoff, General Chairman Institut de programmation 4, Place Jussieu F-75230 Paris Cedex 05, France"]},{"title":"33-1-329 12 21, ext. 53-90","paragraphs":["For further information on details of submission con- -tact: Peter Raulefs, Program Chairman Institut fur Informatik III Universitat Bonn Postfach 2220 D-5300 Bonn 1, WEST GERMANY"]},{"title":"49-228-738721 Classification Research: Call for Papers","paragraphs":["The 4th International Study Conference on Classification Research will take place in Augsburg, near Munich, from June 28 to July 2, 1982, together with the 6th Annual Conference of the German Society for Classification. The conference is sponsored by the F6d6ration Internationale de Documentation (FID) and is being hosted by the German Society for Documentation in connection with the German Institution for Standardization.","The theme of the conference is Universal Classification: Subject Analysis and Ordering Systems. Under this topic universal classification systems are dealt with, and it is suggested that classification should be approached from a universal point of view, even when using special classification systems and thesauri. There will be plenary meetings and workshops with presentations and discussions of contributions from all those active and interested. Three major areas have been identified for contributions: (1) general principles and policies, (2) structure and logics of classification systems, and (3) practical use and empirical investigation. Additional sessions organized by the Special Interest Group on Numerical Taxonomy of the Society for Classification will be devoted to numerical methods in classification.","Theoreticians and practitioners in the field of or-ganization of knowledge (classification) are invited to send abstracts of possible papers between 500 and 1000 words in length by December 1, 1981. A jury will then select the papers for presentation and authors will be notified. Papers presented will be published in a proceedings volume. Papers will be due by May 1, 1982. Abstracts should be sent to: FID/CR Secretariat Woogstr. 36a D-6000 Frankfurt 50, WEST GERMANY Cognition and Brain Theory: Call for Papers"]},{"title":"Cognition and Brain Theory","paragraphs":["is a new multidisciplinary journal devoted to issues in mind, brain, and language. The Editors are planning a special issue on the topic of methodological principles for any one of the following disciplines: philosophy, psychology, linguistics, artificial intelligence, or brain theory. The paper should delineate the key principles for framing and investigating problems as well as the criteria for evaluating solutions. The paper should also include a discussion of the ways in which the method of the discipline considered may relate -- or fail to relate to other methods in the cognitive sciences. One paper will be selected for each of the five disciplines mentioned above. Optimum size is 20-30 typewritten pages.","For further information contact: Dr. Martin Ringle, Editor"]},{"title":"Cognition and Brain Theory","paragraphs":["LEA, Inc. 365 Broadway Hillsdale, New Jersey 07642 Cognitive Science at Buffalo","The State University of New York at Buffalo has formed a Graduate Group in Cognitive Science to promote cognitive science research within the university. The Graduate Group was founded by faculty and graduate students from the Departments of Communication Sciences and Disorders, Computer Science, Education, Law, Linguistics, Philosophy, and Psychology; members of other departments are being encouraged to join this interdisciplinary endeavor. The chief concerns of the Graduate Group are in the areas of language and knowledge representation. The first Director of the Graduate Group is Stuart C. Shapiro of the Department of Computer Science.","During the 1980-81 academic year, discussions were held on such topics as intentionality, metaphor, semantic representation, syntax and cognition, communicative competence (and its development) and theories of reference. In addition to continuing these triweekly discussions, a series of colloquia in cognitive science will be presented during the 1981-82 academic year. In addition, several interdisciplinary graduate courses in cognitive science are currently being planned. The Graduate Group intends to expand their activities to developing a pre- and post-doctoral program in cognitive science, along with the facilities necessary to support the program. American Journal of Computational Linguistics, Volume 7, Number 3, July-September 1981 183 The FINITE STRING Newsletter Announcements","Correspondence and requests for further informa-","tion should be addressed to the Assistant Director of","the Graduate Group: Steven Greenspan The Graduate Group in Cognitive Science 4226 Ridge Lea Road State University of New York at Buffalo Amherst, New York 14226 ACL Conference Proceedings Available Conference Proceedings from the three most recent","ACL meetings are available at nominal cost. Detailed","information follows: 17th Annual Meeting of the Association for Computational Linguistics August 1979; University of California at San Diego, La Jolla, California; 115 pages; $6.00 (U.S.), includes 3rd class/surface mail; add $2.00 for first class mailing in the U.S., Canada, and Mexico; add $4.00 for air printed mailing overseas. 18th Annual Meeting of the Association for Computational Linguistics and Parasession on Topics in Interactive Discourse June 1980; University of Pennsylvania, Philadelphia, Pennsylvania; 167 pages; $7.50 (U.S.), includes 3rd class/surface mail; add $3.00 for first class mailing in the U.S., Canada, and Mexico; add $6.00 for air printed mailing overseas. 19th Annual Meeting of the Association for Computational Linguistics June 1981; Stanford University, Stanford, California; 172 pages; $10.00 (U.S.), includes 3rd class/surface mail; add $3.00 for first class mailing in the U.S., Canada, and Mexico; add $6.00 for air printed mailing overseas.","The above volumes may be ordered from: Dr. Donald E. Walker, ACL Artificial Intelligence Center SRI International Menlo Park, California 94025 AFIPS Press Publishes New Book in Executive Information Series","Information Technology and Health Care: The Critical Issues (hardcover; 144 pp., $25.00) is now available from AFIPS Press. This is the first volume in AFIPS' Executive Information Series, a series which is designed to inform business and government executives, academicians, and professionals of developments in information processing that will affect their professional activities. Future volumes will address the use of computers in energy, banking, government, management, and manufacturing. Mr. Jack Sherman, of Lockheed Missiles & Space Corporation, is the Series Editor.","The text of Information Technology and Health Care is based on the 1979 National Computer Conference (NCC) Symposium on Issues in Health Care Computing, and was edited by Dr. Karen Duncan. It contains discussions of such issues as the federal role in health computing and the possible establishment of a controversial state health information database. An administrative analysis of hospital information systems is also discussed. Orders should be addressed to:","AFIPS Press","1815 North Lynn Street","Suite 800","Arlington, Virginia 22209","Attn: Chris Hoelzel","(703) 558-3631 Wolfson Elected Chairman of NCC Board","Dr. Seymour J. Wolfson has been elected Chairman of the National Computer Conference (NCC) Board. The NCC Board determines policy for the annual National Computer Conference, which is the preeminent and largest conference devoted to the scientific and educational aspects of information processing. Dr. Wolfson previously served on the board as the Association for Computing Machinery (ACM) Representative, which he will continue to do, in addition to serving in his capacity as Chairman. Dr. Wolfson is currently Associate Professor of Computer Science at Wayne State University in Detroit, Michigan, where he received his B.S. and Ph.D. degrees, and where he acted as Chairman of the Computer Science Department from 1969-1978. Other Conferences","The 1981 ACM Annual Conference will be held at","the Bonaventure Hotel in Los Angeles, California, on","November 9-11, 1981. [See AJCL 6:3-4, pg. 194.]","For further information contact: Mrs. A.C. Toni Shelter Xerox Corporation, A3-49 701 South Aviation Boulevard E1 Segundo, California 90245 (213) 679-4511 x1968 An April Fool's Day Conference on the language of","humor and the humor of language, sponsored by the","Western Humor and Irony Membership, will be held in","Tempe, Arizona, on April 1, 1982. For further infor-","mation contact:","Don L.F. Nilsen","WHIM Conference,English Department","Arizona State University","Tempe, Arizona 85281 184 American Journal of Computational Linguistics, Volume 7, Number 3, July-September 1981 The FINITE STRING Newsletter Abstracts of Current Literature The Sixth European Meeting on Cybernetics and","Systems Research , organized by the Austrian Society","for Cybernetic Studies, will be held April 13-16, 1982,","at the University of Vienna, Austria. [See AJCL 7:2,","pg. 123.] For a Preliminary Program contact the","Chairman:","Professor Robert Trappl","Department of Medical Cybernetics","University of Vienna","Freyung 6/2","A-1010 Vienna, AUSTRIA","A Symposium on Artificial Intelligence, sponsored by the Austrian Society for Artificial Intelligence and the Austrian Society for Cybernetic Studies, will be held at the Sixth European Meeting on Cybernetics and Systems Research, April 13-16, 1982, in Vienna. [See AJCL 7:2, pg. 123.] Extended abstracts must be submitted by December 1, 1981, to:","Organizing Committee of the 6th EMCSR 82","Austrian Society for Cybernetic Studies","Schottengasse 3","A-1010 Vienna, AUSTRIA","The 1982 National Computer Conference (NCC),","sponsored by AFIPS, will be held June 7-10, 1982, in","the Houston Astroarena. [See AJCL 7:2, pg. 122.]","Papers must be submitted by October 31, 1981, to: Dr. Howard L. Morgan NCC'82 Technical Program Chairman Department of Decision Sciences The Wharton School/CC University of Pennsylvania Philadelphia, Pennsylvania 19104 The Fifth European Conference on Electrotechnics","will take place in Copenhagen at The Technical Uni-","versity of Denmark, on June 14-18, 1982. [See AJCL","7:2, pg. 122.] Further details may be obtained from:","DIEU, Danish Engineers' Post Graduate Inst.","The Technical Univ. of Denmark, Bldg. 208","DK-2800 Lyngby, DENMARK","The Ninth International Conference on Computational Linguistics (COLING 82) will be held July 5-10, 1982, in Prague, Czechoslovakia. It will be sponsored by the International Committee on Computational Linguistics, in association with the Linguistic Institute of L. StQr, Slovak Academy of Science, Bratislava, and the Faculty of Mathematics and Physics, Charles University, Prague. [See AJCL 7:2, pg. 122.] Four copies of a 3-4 page, double-spaced summary must be submitted by December 1, 1981, to:","COLING 82","MFF UK, Linguistics","Malostranske n. 25","118 00 Prague 1, CZECHOSLOVAKIA Abstracts of Current Literature KNET Extensions Michael W. Freeman ADO/FSSG Burroughs Corporation P.O. Box 517 Paoli, Pennsylvania 19301 Henry H. Leitner Center for Research in Computing Technology Aiken Computation Laboratory Harvard University Cambridge, Massachusetts 02138 Manuscript, March 1980.","This paper describes a number of extensions to Brachman's Structured Inheritance Network (SI-Net) formalism, with a view to creating an interactive system which will enable domain experts to develop and enhance knowledge networks (KNETs) representative of their particular application domains. The three principal extensions introduced are the QUA and VIZ links, and augmented event transition networks. The former permit us to partition the attribute space of conceptual entities in accordance with the defining roles played by these entities in certain kinds of sociolegal interactions. We use an event transition network to represent the value-class of so-called \"dynamic attributes\" in order to define all (and only all) the possible event sequences which the associated entity can participate in relative to the given attribute and still remain itself. The basic concept of simple succession of events in the transition network is then augmented by conditions on dependency relations which may exist across events among various roles (including bounds on the amount of time that can elapse between successive events). Since such event transition nets are themselves concepts within the KNET formalism, they can be placed along a specialization/generaliza-tion hierarchy. We show how these KNET extensions provide an extremely flexible basis for maintaining data base integrity and consistency, determining rollback dependencies during error recovery or historical perspectives, signalling possible irregularities in the attempted recording of new events which violate the legal event sequences defined by the net, as well as for generating derivative sets and mutually non-exclusive stative attribute values and associated interpretations for the wide range of ways this opens up for referencing such concepts in natural language. American Journal of Computational Linguistics, Volume 7, Number 3, July-September 1981 185"]}]}