{"sections":[{"title":"Concession and Linguistic Inference","paragraphs":["Yong-Beom Kim Kwangwoon University","447-1 Wolgye-dong, Nowon-ku","Seoul, Korea ybkim@daisy.gwu.ac.kr Abstract In this paper it has been proposed that concession should be analysed as involving scalar implicatures and that an alternative set of situations have to be assumed to account for the the relative nature of likelihood of event occurrence. This paper also claims that the notion of likelihood is the basis of the corresponding pragmatic inference and a universal quantification effect. Unexpectedness, which is conceptually tied to concession, on the other hand involves the same kind of pragmatic inference but presuppose the existence of an alternative set of individuals instead of an alternative set of situations. 1. Introduction This paper attempts to explain linguistic inference processes involving concession and unexpectedness. Concession and unexpectedness are claimed to be important semantic contents of English even and Korean –(la)to. In this paper, the notion concession will be approached from discourse or cognitive perspectives as well as from formal perspectives. I will review some of the claims made by a few authors involving concession in section 2. The intuitive discussions of different semantic levels and semantic relations involving concession will be the background of the formal treatment of the topic in the ensuing sections. This paper will adopt Crevels' (2000) categorization of different levels of concessive meanings, but will reject Konig's (1998) claim that concessive constructions implicates a presuppositional contents.","Many formal proposals regarding even in English and -(la)to in Korean posits the scalar implicature approach following Fauconnier (1975) as in Bennet (1982) and Kim (2001). This paper will benefit form the discussions in these papers. 2. Previous studies In this section, some of the previous analyses are reviewed. Carevel's (2000) taxonomy of concession clauses will be reviewed in Section 2.1. Konig's (1998) and Bennet's (1982) analyses will be briefly reviewed. Some problems of both Konig's and Bennet's will be pointed out in Section 2.2 and Section 2.3, respectively. 2.1. Cognitive oriented categorization Crevels (2000) posits four different levels of concessive meanings as shown in (1)","(1) a. Although it is raining, we're going for a walk. b. He's not at home, although his car is parked in front of the house. c. Even though I am call a bit late, what are your plans for this evening? d. I speak and write Serbian, Albanian, Turkish and Dutch, but I cannot sepress my true feelings","in any other language than Romani. Although, now that I come to think of it, I have done it","many times ...\\t(Crevels 2000: 317)"]},{"title":"187","paragraphs":["(la) is an example of content concession which relates phenomena involving the physical world domain. The raining and walking events are physically realized in the real world. On the other hand (lb) shows epistemic relationship that relates the speaker's premise and a conflicting conclusion. Although the two events [his being not at home] and [his car parking] are real world events, there is a difference between (la) and (lb) in the relations of the two subevents. In (1c) the concessive meaning should be assessed at the level of speech acts. On th Bother hand in (1d) concession can be imagined at the textual level.","In this paper, two types of concessive meanings will be dealt with, i.e., content and epistemic concession wil be analyzed in a formal way. Let us return to (la) and (lb). In (la) the rain is physically blocking us going out or directly reduces the likelihood of going out for a walk. On the other hand, the subevent his car parking in a certain place does not physically blocks his being in a certain place or lessens the likelihood of his not being at a certain location. Instead the speaker infers that he is not at home based on the fact involving the location of his car. In fact, if (1a) and (lb) are translated into Korea, different morphemes can be used in the consequent clause. Compare (2) and (3)1.","(2) a. cikum pi-ka\\toko issta hate-lato sanpo-lul kakeyssta. now rain-nom comeing is although walk-acc go-gor 'Although it is raining now, (I) will go for a walk'","(3) a. Ku-uy cha-ka cip\\tap-ey issta-hatelato ku-nun cip-ey epsul kes-ita. he-poss car-nom house front-at is-although he-top home-at is-not-will 'Although his car is parked in front of his house, he will not be at home'","a'. Ku-uy cha-ka cip ap-ey issta-hatelato ku-nun cip-ey epsta. he-poss car-nom house front-at is-although he-top home-at is-not! 'Although his car is parked in front of his house, he is not at home'","As for (lb) Crevels states that the speaker usually expects the car owner is at home if his car is parked outside, but has to draw a conflicting conclusion. (la) and its Korean counterpart (2a) have an indicative mood ending in the consequent clause whereas the Korean counterpart of (lb) has a subjunctive ending. As in (3a') it can also have an indicative mood ending, but it has a meaning somewhat different from what (lb) is intended to express.","In this paper, the two types of concessive clauses, ie.e, content types and epistemic ones will be dealt with, and this paper claims that there is no need for such division as far as semantics of concession is concerned. I will return to this issue in Section 3. 2.2 Konig's analysis","Konig's (1998: 146-147) observed that the speaker asserts the propositions of the two related clauses in question against the background assumption that the two types of situations are generally incompatible. This can be schematically summarized as in (4). (4) Although p, q implicates a presupposition ifp, then normally -q'. This paper will reject this simplistic way of analysing concessive meanings, but adopt some of the proposals made in Fauconnier (1975) and Bennet (1982).","According to Konig the concessive statement such as (5) would contain a presupposition as shown in (6). (5) Although it is raining, I am going to go out for a walk. (6) [if is is raining] then normally [I am not going out for a walk] I The English examples in (1) can be translated by using the verbal morpheme —ciman, but as will be discussed, it has a different meaning."]},{"title":"188","paragraphs":["It is not clear how normally fits into the interpretation of the second tensed clause of (6), since normally is an adverb that fits into generic or general statements instead of the ones depicting specific stage-level incident like (6).","Furthermore, Konig's presuppositional approach fails to capture some of the important portion of meaning that is intuitively felt with concessive expressions. Consider the examples in (7). (7) Even if Einstein tried to solve the math problem, he could not solve it. If we apply Konig's proposal to (7), its main contenfof the interpretation would be as shown in (8): (8) [If Einstein tried to solve the math problem] than normally [he could solve it] Apart from the problems of the compositionality involving normally, (8) fails to capture the important aspect of the meaning contained in (7), i.e., the math problem is such a difficult one that even Einstein cannot solve it. In what follows it will be shown that concession crucially involve pragmatic scalar inference based on likelihood of events/eventualities.","In fact ,Konig's presuppositional approach may be seen as an attempt to account for only one aspect of the meaning of the English sentence as shown below. As indicated in footnote (1), the examples in (1) can be translated using the verbal particle –ciman as shown in (9) without losing the truth conditional meaning of the sentence.","(9) a. cikum pi-ka\\to-ciman sanpo-lul kakeyssta. \\t(la)) cf. 2(a) now rain-nom come-but walk-acc go-gor 'It is raining now, but (I) will go for a walk'","b. Ku-uy cha-ka cip\\tap-ey iss-ciman ku-nun cip-ey epsul kes-ita. (4-- (lb)) cf. (3a) he-poss car-nom house front-at is-although he-top home-at is-not-will 'His car is parked in front of his house, but he will not be at home'","b'. Ku-uy cha-ka cip\\tap-ey iss-ciman ku-nun cip-ey epsta. (4-- (1b)) cf. (3a') he-poss car-nom house front-at is-although he-top home-at is-not 'His car is parked in front of his house, but he is not at home'","However, this connective morpheme corresponds to but in English, and according to many many linguists, but denotes a conventional implicature. (See Levinson (1983: 127), for instance). The translations in (9) do not lose truth conditional meaniong of (la), but they do not capture the implicaturs pointed out in connection with (7). 2.3 Bennet Proposal Many proposals regarding even in English and -(la)to in Korean posits the scalar implicature following Fauconnier's (1975), or a universal quantification approach as in Lycan (1991), or implicature theory as in Bennet (1982). This paper adopts some of the points from Both Fauconnier's and Bennet's proposals on this issue. Consider Bennet's proposal as briefly introduced (10) and (11). (10) Even if he drank just a little, she would fire him (11) Even if the bridge were standing, I would not cross (11) could be uttered in a situation where the speaker is watching over the raging waters of the river and the ruins of the bridge. (11) can be true whether [[the bridge were standing]] holds true or not. On the"]},{"title":"189","paragraphs":["other hand (10) has a reading on which the conditional clause is a pure conditional. Thus, according to Bennet (1982) if he does not drink at all, he will not get fired. In order to distinguish these two different semantic facts, the examples like (10) are dubbed as 'standing-if conditionals and the ones such as (11) are categorized as 'introduced-if conditionals.'Standing-if conditionals are called so since if is outside outside the scope of even, and, thus, it looks as if if stands in one place, while even moves around semantically for its scope. 'Inroduced-if conditionals are purely added or introduced to the consequent clause without changing the truth value of the proposition and its name comes from these characteristics. Although I agree with Bennet that the basic meaning of even can be extended to concession clauses, I will depart from him and would introduce an alterative set or sister members into the analysis of concession. My proposal is not drastically different form Bennet (1982) since he also assumes 'neighbor', which is a set of alternative sentences without even. However, the domain of XP in the scope of even includes individuals or properties only within Bennet's system. However, I disagree with Bennet and think that (10) has two readings as shown in (12).","(12) (i) He would get fired however little he drank (i.e., if he drank)","alternative set = A LITTLE, MORE THAN A LITTLE, QUITE A LOT, MUCH, VERY","MUCH, ...","(ii) He would get fired whether he drank just a little or not","alternative set = HE DRANK A LITTLE, HE DRANK MUCH, HE DRANK VERY","MUCH, HE DRANK NOTHING ... In fact, these two readings can be translated differently into Korean as shown in (13a) and (13b).","(13) a.Ku-ka cokum-ilato swul-u masi-myen, kunye-ka ku-lul haykohal kes-ita. he-nom a little-even liquor-acc drink-if she-nom he-acc fire will 'If he drink even a little amount of liquor, she will fire him' b.Ku-ka cokum swul-ul masi-te-lato, kunye-ka ku-lul haykohal kes-ita. he-nom a little liquor-acc drink-even-if she-nom he-acc fire will 'Even if he drink a little amount of liquor, she will fire him' What is assumed in this paper is that events or situations 2 can act as simple entities just as individuals or properties do. This approach can open up a possibility of interpretation as shown in (12ii) and we can dispense with the dichotomy of 'even-if clauses of Bennet's. The 'standing-if clause is neither necessary nor inevitable within my analysis. The ambiguity of (10) is explained by specifying the scope of even. In (12i) the scope ranges over amounts of liquor drunk and in (12ii) its scope involves propositions denoting events or situations. What this papers wants to point out here is that concession involves an alternative set, especially a set of situations that have the lowest likelihood of occurrence. Setting up such least likely situations or conditions can naturally evoke or entail a more probable situation using our ordinary background knowledge, as shown in (14) (14)[ If he drinks JUST a little, she will fire him ] \\t[ If he drinks a little, she will fire him ]"]},{"title":"4 [","paragraphs":["If he drinks quite much, she will fire him] \\t[ If he drinks much, she will fire him] ... 2 Events are seen as abstract semantic entities, usually denoted by a proposition. Thus we could think of an abstract singing event and a dancing event, separately or compositionally. A situation could still be thought of an abstact semantic object but it is a more inclusive notion such that it could admit various kinds of events in one situation at the same time. Therefore, the relation between an event and a situation can be stated as a 'hold-true' or 'compatability' relation . So an event e can hold true or not tore in (i.e., compatible or not compatible with) situation s. Further we can think of inference relations between (sets) of events and between (sets) of situations. However, in many case the two terms can be used interchangeably since an event is always hooked to a situation in the real world and situations can be characterized by events. 190 Let us assume the boss is puritanic or very strict on liquor consumption as when the Prohibition Amendment was enforced in the 1930's in the U.S. Then, as shown in (14), according to inference based on this background knowledge, her firing him will happen in the least probable situation. What is implicated here is that in an ordinary or more probable situation she is more likely to fire him. For the interpretation in (12i) a kind of scalarly ordered objects like the ones shown in (14) can be posited to explain pragmatic inference, and this can be a source of strength in the statement. Likewise, the interpretation of (12ii) somehow has to posit a sequential order in terms of likelihood of the various situations. However, the chosen or stated alternative is taken to be placed as the least likely precursor for the event depicted by the consequent clause to happen. 3. Pragmatic inferences In this section the notions concession and unexpectedness will be formally defined based on pragmatic inferences and our background knowledge. For this purpose, I will define likelihood in terms of our cognitive inference pattern. In doing so I will distinguish between probability and likelihood. Probability is a statistical notion that has a relatively well defined status. thus, likelihood will be defined in terms of probability. Intuitively speaking, likelihood of an event is a relative notion that always accompanies many factors. For instance, the likelihood of my participating or not participating in a certain conference will vary according to who comes to the conference, how much traveling fund I can secure, how long the trip takes, whether or not there is more important meeting at my university, to name a few. However, what is usual is that we do not make fuss by listing all those possibilities, but allude to the most relevant case as shown in (15) (15) The guest speaker will come to the conference although he is not provided with the travel fund. For instance, what is expressed in (15) is the relations between the guest speaker's presence at the conference and his travel fund matter. This relation is not a cause-result relation or cause-effect relation or any other easily definalble one. The travel fund matter somehow has an influence on his traveling. In other words, we can presume the lack of travel fund may reduce his possibility of presence. Thhus, what is expressed in (15) only a portion of the situation involving his trip. In this sense this paper wants to distinguish between events and situations.","Considering the discussions presenteed so far, likelihood is definable as follows:","(16) Likelihood For distinct events\\tand ek, ei has greater likelihood of occurrence than e; relative to ek (i.e., [Likelihood (ek\\tei) > Likelihood (ek\\tOD if and only if","(i) ei has greater probability of occurrence than relative to ek","(ii) the speaker and the addressee has the belief that (i) is true in a given situation of utterenace Of course, human beliefs and statistical reality do not always correspond to each other, since human beliefs do not always reflect the realty correctly. In this sense the notion defined in (16) simply reflects the speaker's or addressee's mind. In this sense this definition is discourse oriented. Based on this notion we will define concession and unexpectedness in the next sections. 3. 1 Concession and Inference In this paper the reading shown in (13b) will be taken as a case of concession since concession will be defined as involving three objects; one is the event depicted by the consequent clause (e 2 in (17)); the second is an event that denotes the least likely condition for the consequent to happen (e l in (17)); the third is the set of alternative events or conditions (E in (17)). The meaning of concession arises when a 191 situation or event happens in spite that the preconditions for the event are in such a configuration that they are least likely precursors to the event. The notion concession posited in this paper can be articulated as shown in (17):","(17) Concession Given events e l , e2, and a set of alternative events E, the statement translatable into 'el -4 e2' involves concession if and only if i)the speaker infers, and expects the addressee to make inference V ei [S (e l 4 e2)\\tS (ei\\te2)} based on (iii) ii) for some ei S (e l ) is distinct from S (e), and iii)d ei [Likelihood (e l\\te2) < Likelihood (ei\\te2)] according to the background knowledge,","where S(e) is a set of situations which are compatible with event e, and e i E E. The difference between two types of content concession and epistemic concession can be accounted for if we let the situations posited in (17) vary from real situations to possible situations 3 . As Bennet (1982) mentioned and as many others agree, even can denote unexpectedness or surprise. This paper claims that unexpectedness can be derivable from (17) with a little modulation of the definition. In case of concession, what matters is the existence of alternative events that are more likely to happen than the events in question (i.e., the even event). This complex definition of concession involving events and likelihood seems to capture the intuitive meaning of concession since concession seems to presuppose an occurrence of an event in a very unlikely situations. 3.2 Unexpectedness In contrast, unexpectedness can be accounted for by looking at individuals as alternatives instead of dealing with events. Consider (18). (18) Even Bill passed the oral test. Suppose that a class is taking an oral test over a few days and that everyone is worrying about it. Further suppose Bill was a very unlikely person to pass the test. However, if in fact he passed the exam, someone can comfort other students by saying (18). In this case, the speaker infers, and expects the addressee to infer, that Bill's passing the test will implicate other students' passing. Thus, in this case, the alternatives will be other students in the class, the speaker and the addressee can infer in a manner similar to the one shown in (19), which is 'individual analogue' of (17). (19)Given individual s 1 and set of alternative students S, the statement translatable into 'P(si)'involves","unexpectedness if and only if i)the speaker infers, and expects the addressee to infer, that V si [P (s i ) —> P(si)] based on (ii) ii) V si [Likelihood (P (s i) < Likelihood (P(si)) according to the background knowledge, where s i E S. It should be further noted that if everyone shares the knowledge that Bill is the least likely person to pass the test, the use of even is redundant as shown in (20), but in this case Bill has a higher pitch than others part in English and Korean. (20) Well, ... BILL pass the oral test. (21) BILL-i hapkyekahay-ss-nuntey, mwue. (Korean) 3 The pragmatic inference relation represented by\\thas to be related to probability of occurrence of events in succession. 192 Bill-nom pass-pst-con\\twell/what Well, (I am saying) Bill passed (What makes you worry?)' There may be other ways to convey both the expressed and implicated meaning of (19), especially in Korean, since this language has a variety of pragmatically oriented particles such as -to, -mace, -kkaci, -cocha. What is clear in this type of expression is that there are inferences that have the effect of universal quantification, although it is based on likelihood. As argued in Hong (1983) and Yoon (1988), the Korean particles -to and -lato can express a kind of emphatic meaning as shown in (22). \\t (22) a. Einstein-to\\tku mwunchey-lul\\tmos\\tpwul-ess-ta. \\t Einstein-too\\tthe problem-acc not\\tsolve-pst-de 'Even Einstein could not solve the problem'","b. Chelswu-to\\t1w\\tmvvuncey-lul pwul-ess-ta \\t Chelswu-too\\tthe\\tproblem-acc solve-pst-de 'Even Chelswu solved the problem'","c. ?*Chelswu-lato ku\\tmwuncey-lul pwul-ess-ta \\t Chelswu too\\tthe\\tproblem-acc solve-pst-de ' Even Chelswu solved the problem' d. Chelswu-lato ku\\tmwuncey-lul pwul-ess-ul\\tkes-i-ta \\t Chelswu-too\\tthe\\tproblem-acc solve-pst-mod thing-is-de 'Even Chelswu could probaly have solved the problem' (20a) is readily interpreted 'emphatically' in a way as proposed in (19), since Einstein's not solving the problem would enable us to infer that all the other people could not solve the problem. In (20b), this type of inference may not be readily available. However, if the discourse participants are aware of, and attuned to, the contingent fact that Chelswu is the least likely person to solve the problem, then we can infer from (20b) that all the other alternative students could solve the problem. Furthermore Korean has an explicit concession marker -lato as shown in (20c) and (20d). It should be noted that the concessive marker -lato calls for a modal marker in Korean as the contrast between (20c) and (20d) indicates. This is consistent with the claim of this paper that it involves alternative events or situations as shown in (17)4. Especially the situation depicted is very much less likely to happen in the real situation, thus being unrealistic, and this seems to be one of the points where concession differs from the mere 'unexpectedness' case where there is no alternative situation imagined. As we have seen above, concession, unexpectedness, and what is called emphasis in Korean involve 'likelihood-based' pragmatic inferences and this enables us to infer many alternative expressions. According to our definition in (19), we can say (18) has a relatively strong assertion strength than the even-less version of (18). 4. Conclusions","This paper rejected Konig's (1988) presuppositional analysis of concssion and attemped to provide a scalar implicature approach adopting ideas form Fauconnier (1975) and Bennet(1982). In doing so, this paper has argued that concession is a relative notion that can be captured by positing more than one imaginable situations as alternatives in a given speech context. Unexpectedness is also a relative notion, 4 Modals are usually seen as introducing alternative situations. This seems to fit in the observations made in Korean linguistics. That is, -lato introduces sentence-level semantics. (20d) differs from (20a) and (20b) in that the former always expresses concession whereas the latter can have another interpretation. Thus, Chelswu-lato in (20d) can be relatively safely interpreted as containing events or situations, not individuals. Thus, (20d) may have to be interpreted by the pattern in (17) instead of (19)."]},{"title":"193","paragraphs":["an individual analogue of concession, and can be defined analogously in a way concession is appraoched. Concession and unexpectedness crucially involves likelihood and pragmatic inference that is made on the basis of background knowledge. References Bennet, J. (1982). Even If, Linguistics and Philosophy 5, 403-418. Cole; P. and J. Morgan (eds.) Syntax and Semantics 3: Speech Acts, NewYork: Academic Press. Crevels, M. (2000). Concessives on different semantic levels: A typological perspective. In","Couper-Kiihlem, E. and B. Kortmann (eds.) Cause-Condition-Concession-Contrast, Cognitive and","Discourse Perspectives, New York: Mouton de Gruyter, 313-340. Fauconnier, G. (1975). Pragmatic Scales and Logical Structure. Linguistic Inquiry 6, 353-375. Grice, P. H. (1978) Logic and Conversation. In Peter Cole and Jerry Morgan (eds.) Syntax and Semantics 3: Speech Acts, New York: Academic Press, 43-58 Kim, Y.-B. (1998). Semantic and Pragmatic Aspects of the delimiter -to, Language and Information: Journal of Korean Society for Language and Information 3, 85-96. \\t. (2001) (to appear) Assertion Strength, Language Research 26: The Journal of Language","Education Institute, Seoul national University, Seoul, Korea. Konig, E. and P. Siemund (2000). Causal and concessive clauses: Formal and semantic relations. In","Couper-Kuhlem, E. and B. Kortmann (eds.) Cause-Condition-Concession-Contrast, Cognitive and","Discourse Perspectives, New York: Mouton de Gruyter, 341-360. Ladusaw, W. A. (1979). Polarity Sensitivity as Inherent Scope Relations. PhD Dissertation, University of Texas, Austin. Lycan, W. G. (1991). Even and Even If, Linguistics and Philosophy 14, 115-150. Sperber, D. and D. Wilson (1995). Relevance: Communication and Cognition, Cambridge, Mass.: Blackwell Publlishers Ltd. Stalnaker, R. C. (1978). Assertion. In P. Cole (eds.)). Syntax ans Semantics 9: Pragmatics. New York: Academic Press, 315-332. 194"]}]}