{"sections":[{"title":"Proceedings of The 16th Pacific Asia Conference","paragraphs":["• • • • • • • • • • • • • •"]},{"title":"Edited by Ik-Hwan Lee Yong-Beom Kim Key-Sun Choi Minhaeng Lee The Korean Society for Language and nformation Language, Information, and Computation Proceedings of The 16th Pacific Asia Conference January 31 - February 2 2002, Jeju, Korea Edited by Ik-Hwan Lee, Yong-Beom Kim, Key-Sun Choi, and Minhaeng Lee The Korean Society for Language and Information © 2002 The Korean Society for Language and Information MI rights reserved. No part of this publication may be reproduced, stored in a retrieval system, or transmitted, in any form or by any means, electronic, mechanical, photocopying, recording or otherwise, without the prior permission of the publisher. Published by The Korean Society for Language and Information (KSLI) do Prof. Minhaeng Lee Division of European Studies College of Liberal Arts Yonsei University Seoul 120-749 , Republic of Korea The publication of this proceedings was financially supported by Korea Research Foundation. FOREWORD","paragraphs":["We are very pleased to be able to host the 16th Pacific Asia Conference on Language Information and Computation (PACLIC 16) with the help from various scholars, institutions, and universities despite the unfavorable economic and political situations on the global scale. With the turn of the century we are witnessing the quality of our life depends more on the development in the software domains than on the abundance in the material matters. We are proud that many of the scholars who are here are leading this new trend of history in their own country. Now we have gathered together in this beautiful island of Jeju to strengthen our positions in our own field and to pursue and widen our academic curiosity and perspectives into the neighboring fields. Since the 1994 amalgamation of the two organizations, namely the Asian Conference on Language, Information and Computation (ACLIC) and the Pacific Conference on Formal and Computational Linguistics (PACFoCoL), there have been * beneficial interactions between theoretical linguistics and computational fields of research. These seem to be a few of the major contributions that this annual conference has made since its inception. As the host of this conference, the Korean Society for Language and Information (KSLI) carried out a long process of soliciting and selecting papers. The call for extended abstracts drew 56 responses from various countries including Canada, Germany, Hong Kong, Japan, Korea, Singapore, Taiwan, and United States. The Program Committee of PACLIC 16 conducted a blind review process, and sent out each submission to three reviewers. With the evaluations and comments from the reviewers on hand, the Organizing Committee and the Program Committee of this conference got together and also took on a blind process of deciding how many papers to be presented during the conference. This joint process selected 43 out of 56 papers. We would like to thank various scholars and institutions for their help. We would like to express our deep gratitude to our distinguished guest speakers, Erhard W. Hinrichs and Kiyong Lee for their keynote lectures. We are also grateful to our co-host Cheju University and for the financial support and organizational matters. We would also like to acknowledge the generous financial support from the Korea Research Foundation. Last, but not the least, we would also like to thank the Research Institute of Humanities and Social Sciences, Kwangwoon University for its financial support. There are numerous individuals, without whose help the conference would have not been possible. I wish to express my gratitude to Suk-Jin Chang (Conference Chair) and the Advisory Committee members including Jason S. Chang, Chu-Ren Huang, Akira Ikeya, Chungmin Lee, Young-Here Lee, Kim Teng Lua, Byung-Soo Park and Benjamin K. T'sou, for their advice and support. I am also very grateful to Ik-Hwan Lee (Chair of Program Committee), Key-Sun Choi (Cochair of Program Committee), and the members of the program committee and invited reviewers. I wish to note that Minhaeng Lee has been playing the pivotal role in organizing this conference, and I am also grateful for the help of the three local organizers in Jeju, Chang-Ik Lee, Ki-Suk Lee and Yosong Park whose active roles have been instrumental in running this conference. I am no less grateful to Tom Lai and Olivia Kwong for their friendly support."]},{"title":"Yong-Beom Kim Chair, Organizing Committee President, Korean Society for Language and Information COMMITTEE MEMBERS Conference Chair","paragraphs":["Suk-Jin Chang"]},{"title":"Advisory Committee","paragraphs":["Akira Ikeya, Co-chair. Jason S. Chang, Co-chair. Chu-Ren Huang, Co-chair. Chungmin Lee, Co-chair. Young-Hera Lee, Co-chair. Kim Teng Lua, Co-chair. Byung-Soo Park, Co-chair. Benjamin K. T'sou, Co-chair. Seoul National University, Korea Toyo Gakuen University, Japan Tsing Hua University, Taiwan Academia Sinica, Taiwan Seoul National University, Korea Chosun University, Korea National University of Singapore, Singapore Kyung Hee University, Korea City University of Hong Kong, Hong Kong"]},{"title":"ORGANIZING COMMITTEE","paragraphs":["Yong-Beom Kim, Chair. Kwangwoon University, Korea Minhaeng Lee, Secretary General. Yonsei University, Korea Zhao-ming Gao Yasunari Harada Masahito Kawamori Yuji Matsumoto Tom b.y Lai Chang-Ik Lee Ki-Suk Lee Yeo-Sung Park Shu-chuan Tseng Kam-fai Wong National Taiwan University, Taiwan Waseda University, Japan NTT Research Labs, Japan Nara Advanced Institute of Science and Technology, Japan The City University of Hong Kong, Hong Kong Cheju National University, Korea Cheju National University, Korea Cheju National University, Korea Academia Sinica, Taiwan The Chinese University of Hong Kong, Hong Kong iii"]},{"title":"PROGRAM COMMITTEE","paragraphs":["Ik-Hwan Lee, Chair. Key-Sun Choi, Co-chair. Jae-Woong Choe Roland Hausser Erhard Hinrichs Akira Ishikawa Kiyoshi Ishikawa Dong Hong Ji Xu Jie Makoto Kanazawa Beom-Mo Kang Andreas Kathol Sue-jin Ker Jong-Bok Kim Olivia Kwong Kiyong Lee Robert Luk. Yong-Kyoon No Toshiyuki Ogihara Byung-Rae Ryu Markus Schulze Peter Sells Lily I-Wen Su Hae-Kyung Wee John Whitman Dan-Hee Yang Young-Eun Yoon Kei Yoshimoto Yonsei University, Korea Korean Advanced Institute of Science and Technology, Korea Korea University, Korea The University of Erlangen-Nuremberg, Germany The University of Tubingen, Germany Sophia University, Japan Hosei University, Japan Kent Ridge Digital Labs, Singapore National University of Singapore, Singapore Tokyo University, Japan Korea University, Korea UC Berkeley, USA Soochow University, Taiwan Kyung Hee University, Korea The City University of Hong Kong, Hong Kong Korea University, Korea. The Hong Kong Polytechnic University, Hong Kong Chungnam National University, Korea Kanda Gaigo University, Japan Chungnam National University, Korea. The University of Erlangen-Nuremberg, Germany Stanford University, USA National Taiwan University, Taiwan Sejong University, Korea. Cornell University, USA Pyungtaek University, Korea Ewha University, Korea Tohoku University, Japan iv"]},{"title":"ADDITIONAL REVIEWERS","paragraphs":["Dale Gerdemann The University of Tubingen, Germany Thomas Kiinneth The University of Erlangen-Nuremberg, Germany Frank Richter The University of Tubingen, Germany Manfred Sailer The University of Tubingen, Germany"]},{"title":"CONFERENCE PROGRAM DAY 1 (Thursday, 31 January 2002)","paragraphs":["Room 1 08:30-09:00 Registration 09:00-09:15 Session Chair: Ik-Hwan Lee Opening Ceremony Suk-Jin Chang (Conference Chair, SNU) - Man-Keun Boo (President of Cheju National University) 09:15-10:15 Session Chair: Y ong-Beom Kim Keynote Speech: Robust Syntactic Annotation of Corpora and Memory-Based Parsing Erhard Hinrichs (University of Tuebingen) 10:15-11:15 Session Chair: Richard S. Lavin An Event-Based Semantics for Japanese Emphatic Particles A kira Ishikawa (Sophia University) Toward a Bilingual Legal Term Glossary from Context Profiles Oi Y ee Kwong (City U of Hong Kong) 11:15-11:30 Coffee/Tea Break 11:30-12:10 Session Chair: Byung-Soo Park Morphological Passivization and the Change of Lexical-semantic Structures in Korean non-shin Kim (Seoul National U) Syntactic Interference in Chinese-English Bilingual Children Erin Y ao-ling W ang (National Taiwan University) 12:10-14:00 Lunch 14:00-15:00 Session Chair: Benjamin K. T'sou The Loom-LAG for Syntax Analysis - Adding a Language-independent Level to LAG Markus Schulze (University of Nuremberg-Erlangen)","Issues in Chinese Prosody: Conceptual Foundations • of a Linguisticallymotivated Text-to-Speech System for Mandarin Richard S. Lavin (Kyushu Tokai U) vi 15:00-15:40 Session Chair: Erhard Hinrichs Disambiguation of Coordinate Expressions in Japanese by Extracting Mutual Case Relation Y oshiyuki Kotani (Tokyo U of Agriculture and Technology ) A Verb-Pattern Based Korean-Chinese Machine Translation System Changhyun Kim 1 Y oung Kil Kim / Mun Pyo Hong / Y oung A e Seo I Seong 11 Y ang I Seung Kwon Choi (ETRI) 15:40-16:00 Coffee/Tea Break 16:00-17:00 Session Chair: Chungmin Lee Representing Topic-comment Structures in Chinese Haihua Pan A lianhua Hu (City U of Hong Kong) A Focus Structure-Based Approach to Scopal Ambiguity in Japanese Ryoya Okabe (Sophia University) 17:00-18:00 18:00-18:30 Session Chair: Sue J. Ker The Interface between Syntax and Morphology: Taiwanese Verbal Complexes Huei-Ling Lin (National Chung Cheng U) Finite Small Clauses in Japanese and their Theoretical Implications Masakazu Kuno (University of Tokyo) Small Clauses and Default Case Y oungjun Jang (Chung-Ang University) Business Meeting vii"]},{"title":"DAY 2 (Friday, 1 February 2002)","paragraphs":["Room 1 09:00-10:00 o Session Chair: A kira Ikeya Keynote Speech: A Simple Syntax for Complex Semantics Kiyong Lee (Korea University) 10:00-11:00 Session Chair: Beom-Mo Kang The Structure of Polysemy: A study of Multi-sense Words based on WordNet Jen-Y i Lin / Chang-Hua Y ang / Shu-Chuan Tseng / Chu-Ren Huang (A cademia Sinica) A Korean Noun Semantic Hierarchy (WordNet) Construction • Juho Lee / Koaunghi Un / Hee-Sook Bae / Key-Sun Choi (KAIST) 11:00-11:15 Coffee/Tea Break 11:15-12:15 Session Chair: A kira Ishikawa A rgumentness and Probabilistic Case Structures Dan-Hee Y ang (Pyongtaek U) / Ik-Hwan Lee (Yonsei U) Penn Korean Treebank: Development and Evaluation Chung-hye Han (Simon Fraser U) I Na-Rae Han, Eon-Suk Ko, Martha Palmer (U of Pennsylvania) I Hee-Jong Y i (U of Delaware) 12:15-13:45 Lunch 13:45-15:15 Session Chair: Key-Sun Choi An Operator Assisted Call Routing System Chun-Jen Lee /Jason S. Chang (Chunghwa Telecom Co.) Heuristic-based Korean Co-reference Resolution for Information Extraction Euisok Chung / Soojong Lim / Bo-Hyung Y un (ETRI) Building a Domain-specific French-Korean Lexicon A esun Y oon (Pusan National U) 15:15-15:30 Coffee/Tea Break 15:30-16:30 Session Chair: Oi Y ee Kwong A Korean Homonym Disambiguation System Based on Statistical Model Using Weights Jun-Su Kim / W ang-W oo Lee / Cheol-Y oung Ock (Ulsan University) Concession and Linguistic Inference Y ong-Beom Kim (Kwangwoon University) viii 16:30-17:30 Session Chair: Hidekazu Suzuki This Adverbial Accusative: A Corpus-Based Observations and More Michiyuki Sato (Sophia University) On Negative Imperatives in Korean Chung-hye Han (Simon Fraser U)"]},{"title":"/","paragraphs":["Chungmin Lee (Seoul National U) 17:30-17:45 Coffee/Tea Break 17:45-18:45 Session Chair: Dongli Han If a Quantifier is not floated, but moored or even incorporated: Complexity of Presuppositions in Local Domains Y oshiki Mori (Tsukuba U) / Kei Y oshimoto (Tohoku U) An Alignment Based Technique for Text Translation on Traditional Chinese and Simplified Chinese Sue J. Ker / Chun-Hsien Lin (Soochow University) An important Issue in Data Mining – Data Cleaning Qi X iao Y ang / Sung Sam Y uan / Lu Chan /Jay Rajasekera (IHPC) 18:45-19:30 Break 19:30-21:00 Reception ix"]},{"title":"Room 2 / DA Y 2 (Friday)","paragraphs":["12:15-13:45 Lunch 13:45-15:15 Session Chair: Qi X iao Y ang Mismatches in Korean Copula Constructions and Linearization Effects Chan Chung (Dongseo U)"]},{"title":"/","paragraphs":["Jong-Bok Kim (Kyung Hee U) Double Subject, Double Nominative Object and Double Accusative Object Constructions in Japanese and Korean Hiroaki Nakamura (Japan Coast Guard Academy) A Phase-based Approach to ECM across CP in Korean Y oungsun Kim (Cornell University) 15:15-15:30 Coffee/Tea Break 15:30-16:30 Session Chair: Y oung-Joo Kim Implicit Adjuncts: The Cases of Degree Modifiers in Japanese and English A kira Ikeya (Toyo Gakuen U)1 Hisako Ikawa (Tsurumi University) Type Construction of Nouns with the Verb ha- 'do' Seohyun Im / Chungmin Lee (Seoul National U) 16:30-17: 30 Session Chair: Markus Schulze A Japanese Compound Verb V -te-iku and Event Composition Eri Tanaka (Osaka U) Analysis of Korean Predicative Verb Forms in LAG Framework Soora Kim (University of Nuremberg-Erlangen) 17:30-17:45 Coffee/Tea Break 17:45-18:45 Session Chair: Minhaeng Lee Grammaticalization and Semantic Typology: Time-relationship Adverbs in Japanese, Korean, English, and German Tetsuharu Moriya(Kanazawa University)/Kaoru Horie(Tohoku University) A Deterministic Method for Structural Analysis of Compound Words in Japanese Dongli Han / Takeshi Ito / Teiji Furugori ( U of Electro-Communications) Edge-Integrity and the Syllable Structure in Korean Eungyeong Kang (Cornell University) 18:45-19:30 Break _ 19:30-21:00 Reception"]},{"title":"DAY 3 (Saturday, 2 February 2002)","paragraphs":["Room 1 09:30-11:00 Session Chair: Michiyuki Sato Identification of Chinese Personal Names in Unrestricted Texts Lawrence Cheung /Benjamin K Tsou / Maosong Sun (City U of Hong Kong) Do 'transitive adjectives' Really Exist? Byung-Soo Park (Kyung Hee U) Backward Anaphora . Hyeran Lee (Kyung Hee U) 11:00-11:20 Coffee/Tea Break 11:20-12:00 Session Chair: A esun Y oon Generating a Category Set of Words Using a Hierarchical Part-of-Speech System and Tagged Corpus Takeyuki Kojima / Y oshiyuki Kotani (Tokyo U of Agriculture and Technology ) Implementation of Long-distance Reflexives in Korean Y ong-hun Lee (U of Illinois at Urbana-Champaign ) 12:00-13:00 Lunch and Closing 13:00-13:30 Break 13:30-18:00 City Tour (optional) xi 111 • vi"]},{"title":"TABLE OF CONTENTS","paragraphs":["Foreword Committee Members Conference Program SPECIAL LECTURES Erhard W. Hinrichs Robust Syntactic Annotation of Corpora and Memory-based Parsing 1 Kiyong Lee A Simple Syntax for Complex Semantics 2 PAPERS Lawrence Cheung, Benjamin K. T'sou and Maosong Sun Identification of Chinese Personal Names in Unreistircted Texts - 28 Chan Chung and Jong-Bok Kim Mismatches in Korean Copula Constructions and Linearization Effects  36 Euisok Chung, Soojong Lim and Bo-Hyun Yun Heuristic-based Korean Coreference Resolution for Information Extraction 50","Chung-hye Han and Chung-min Lee On Negative Imperatives in Korean ... „ . .... , . . , 59 Chung-hye Han, Na-Rae Han, Eon-Suk Ko, Martha Palmer and Heejong Yi Penn Korean Treebank: Development and Evaluation 69 Dongli Han, Takeshi Ito and Teiji Furugori A Deterministic Method for Structural Analysis of Compound Words in Japanese  79 xii Akira Ikeya and Hisako Ikawa Implicit Adjuncts: The Cases of Degree Modifiers in Japanese and English - '''' -- - • -92","Seohyun Im and Chungmin Lee Type Construction of Nouns with the Verb ha-d̀o' -103 Akira Ishikawa An Event-Based Semantics for Japanese Emphatic Particles ,,,, • 113 Youngjun Jang Small Clauses and Default Case 123 Eungyeong Kang Edge-Integrity and the Syllable Structure in Korean -135 Sue J. Ker and Chun-Hsieh Lin An Alignment Based Technique for Text Translation between Traditional Chinese and Simplified Chinese Changhyun Kim, Young Kil Kim, Munpyo Hong, Young Ae Seo, Sung II Yang and Sung-Kwon Choi Verb Pattern Based Korean-Chinese Machine Translation System 147 157 . Jun-Su Kim, Wang-Woo Lee, Chang-Hwan Kim and Cheol-young Ock A Korean Homonym Disambiguation System Based on Statistical Model Using Weights"," • 166 Soora Kim Analysis of Korean Predicative Verb Forms in LAG Framework 177 Yong-Beom Kim Concession and Linguistic Inference  187 Yoon-shin Kim Morphological Passivization and the Change of Lexical-Semantic Structures in","Korean ,,,, • ..... • - ....... --- ---- . ---- . -- 195 Youngsun Kim A Phase-based Approach to ECM across CP in Korean 205 Takeyuki Kojima and Yoshiyuki Kotani Generating a Category Set of Words Using a Hierarchical Part-of-Speech System and Tagged Corpus"," 217 Yoshiyuki Kotani Disambiguation of Coordinate Expressions in Japanese by Extracting Mutual Case Relation"," 227 Masakazu Kuno Finite Small Clauses in Japanese and Their Theoretical Implications  237 Oi Yee Kwong Toward a Bilingual Legal Terms Glossary from Context Profiles.'  249 Richard S. Lavin Issues in Chinese Prosody: Conceptual Foundations of a Linguistically-Motivated Text-to-Speech for' Mandarin n -. '''''  259 Chun-Jen Lee and Jason S. Chang An Operator Assisted Call Routing System 271 Hyeran Lee Backward Anaphora 281 Juho Lee, Koaunghi Un, Hee-Sook Bae and Key-Sun Choi A Korean Noun Semantic Hierarchy (Wordnet) Construction 290 Yong-hun Lee Implementation of Long-distance Reflexives in Korean -296 Huei-Ling Lin The Interface between Syntax and Morphology: Taiwanese Verbal Complexes 308 xiv Jen-Yi Lin, Chang-Hua Yang, Shu-Chuan Tseng and Chu-Ren Huang The Structure of Polysemy: A Study of Multi-sense Words Based on WordNet ' 320 Yoshiki Mori and Kei Yoshimoto If a Quantifier is not floated, but moored or even incorporated: Complexity of Presuppositions in Local Domain  330 Tetsuharu Moriya and Kaoru Horie Grammaticalization and Semantic Typology: Time-relationship Adverbs in Japanese, Korean, English and German  348 Hiroaki Nakamura Double Subject, Double Nominative Object and Double Accusative Object Constructions in Japanese and Korean  358 Ryoya Okabe A Focus-based Approach to Scope Ambiguity in Japanese • - '370 Haihua Pan and Jianhua Hu Representing Topic-Comment Structures in Chinese ---- 382","Byung-Soo Park Do \"Transitive Adjectives\" Really Exist? ------ - ........ - 391 Michiyuki Sato This Adverbial Accusative: A Corpus-based Observation and More 404 Markus Schulze The Loom-LAG for Syntax Analysis - Adding a Language-independent Level to LAG  411 Eri Tanaka A Japanese Compound Verb V -to-iku and Event Composition 421 Erin Yaoling Wang Syntactic Interference in Chinese-English Bilingual Children — ---- 433 xv Dan-Hee Yang and Ik-Hwan Lee A rgumentness and Probabilistic Case Structures 447 Qi Xiao Yang, Sung Sam Yuan, Lu Chun and Jay Rajasekera An Important Issue in Data Mining - Data Cleaning -. ....... ''''''''''' '' – • ''' '' • • .455","Aesun Yoon Building a Domain-Specific French-Korean Lexicon '' .465 AUTHOR INDEX 475 xvi"]}]}