{"sections":[{"title":"The Interface between Syntax and Morphology: Taiwanese Verbal Complexes*","paragraphs":["Huei-Ling Lin Department of Foreign Languages & Literature National Chung Cheng University Min-Hsiung, Chiayi, 600 Taiwan R.O.C. folhll@ccunix.ccu.edu.tw Taiwanese abounds with verbal complexes. Among them, phasal complexes, resultative complexes, and directional complexes are alike in that their second component denotes some sort of result. Moreover, they behave similarly in that they can occur in V-ho-V, V-e/be-V, and V-bo-V forms. Despite the similarities, they still differ from one another in several aspects, such as whether objects are allowed inside or after the verbal complex, whether infixing changes their basic meaning, etc. This paper examines their individual properties carefully and proposes that these three types of complexes are all different from one another in their formation and thus the difference in their syntactic behavior. Directional complexes are syntactic phrases, resultative complexes are compounds derived in syntax, and while some phasal complexes are also syntactically derived compounds, others are compounds formed in the lexicon. This paper aims to argue that words (or compounds in this case) can be formed in syntax as well as in the lexicon. 1 Introduction Whether word formation occurs solely in the lexicon has been a frequent issue of serious debates. In the strong lexicalist hypothesis, it is assumed that all types of word formation occur in the lexicon as advocated by Di Sciullo & Williams (1987), for example. An opposite extreme approach is adopted by Lieber (1988, 1992), who proposes that phrasal compounds in English are syntactically derived and extends the syntactic analysis to other types of word formation. Baker (1988) also applies a syntactic analysis for various types of complex predicate formation. Borer (1988), however, provides a different view on word formation. She argues that morphology is parallel to the other three components of grammar: lexicon, syntax, and phonology. Morphology is not linearly ordered before or after syntax, and it is also distinct from the lexicon where morphemes, idiosyncratic words, idioms, * Research for this paper was supported by a grant from the National Science Council of Taiwan (NSC90-2411-H-194-029). 308 and lexically formed words are stored. Yoon (1989) also proposes that morphology as a rule system is distinct from the grammatical components, such as the lexicon and syntax, and that the rules of morphology can occur in different components. Compounding at the post-syntactic level is also proposed by Shibatani and Kageyama (1988) for Japanese post-syntactic compounds. This paper supports the view on parallel morphology through the discussion of the formation of verbal complexes in Taiwanese. This paper aims to argue that words (or compounds in this case) can be formed in syntax as well as in the lexicon. Taiwanese, the dialect spoken by more than 80% of the population of Taiwan, abounds with verbal complexes. Among the various types of verbal complexes, phasal complexes (V-Phasal Particle), resultative complexes (V-Resultative Verb), and directional complexes (V-Directional Particle) are alike in that the second component denotes some sort of result, as illustrated in (1-3). The difference is that the second element of phasal complexes indicates the phase which the activity denoted by the first verb is in, while that of resultative and directional complexes describes the state of the subject or object as a result of the activity denoted by the first verb. (1) gua hit pun cheq khuaN-liau a.\\tPhasal I that CL' book read-finished PRT2/AsP3 Ì finished reading that book.' (2) gua hit khia lagia\\tpha-si\\ta.\\tResultative I that CL spider hit-dead PRT/ASP Ì killed that spider.' (3) gua hit dui punse sao-chutkhi a.\\tDirectional I that CL garbage sweep-out PRT/ASP Ì swept that pile of garbage out.' Moreover, these three types of verbal complexes behave similarly. For example, they can occur in V-ho-V, V-e/be-V, and V-bo-V forms as in (4). (4) a.\\tni hit pun cheq ai\\tkhuaN-ho-liau.\\tPhasal you that CL book must read-CAUS4-finished Ỳou must finish reading that book.' b.\\tni hit khia lagia ai\\tpha-ho-si.\\tResultative you that CL spider must hit-CADS-dead Ỳou must kill that spider.' CL stands for classifier.","2 PRT stands for particle.","3 ASP stands for aspect.","4 CAUS stands for causative."]},{"title":"309","paragraphs":["\\t c.\\tni hit dui punse ai\\tsao-ho-chutkhi.\\tDirectional you that CL garbage must sweep-CADS-out Ỳou must sweep that pile of garbage out.' However, these three types of complexes also differ from one another in several aspects. First, only directional complexes allow objects after the first verb, as shown in (5). \\t (5) a.\\t*gua khuaN hit pun cheq liau \\ta.\\tPhasal I read that CL book finished PRT/ASP Ì finished reading that book.' b. *gua pha hit khia lagia si\\ta.\\tResultative I hit that CL spider dead PRT/ASP Ì killed that spider.' c. gua sao hit dui punse chutkhi. \\tDirectional I sweep that CL garbage out Ì swept that pile of garbage out.' Second, only resultative complexes can take objects after the whole verbal sequence as shown in (6). \\t (6) a.\\t*gua khuaN-liau hit pun cheq.\\tPhasal I\\tread-finished that CL book Ì finished reading that book.' b. gua pha-si hit\\tkhia lagia.\\tResultative I hit-dead that CL spider Ì killed that spider.' c. *gua sao-chutkhi hit dui punse.\\tDirectional I sweep-out that CL garbage Ì swept that pile of garbage out.' Third, while both resultative and directional complexes can often occur in those infix forms as shown in (4), some phasal complexes cannot occur in those forms, and others which have both phasal and resultative readings lose their phasal meaning and have only resultative reading when occurring in those forms. For example, cia-suaq 'eat-finished' in (7) cannot occur in V-bo-V form. Cia-liau has both phasal and resultative readings in (8a); however, when it occurs in one of the infix forms as in (8b), only the resultative reading remains. \\t (7) a.\\tgua png cia-suaq\\ta. I meal eat-finished PRT/ASP Ì finished eating.' \\t b.\\t*gua png cia-bo-suaq. I meal eat-not-finished. Ì did not finish eating.'"]},{"title":"310","paragraphs":["\\t (8) a.\\tgua png cia-liau\\ta. I meal eat-finished PRVASP (i) 'I finished eating.'\\tphasal reading (ii) 'I ate up the meal.'\\tresultative reading \\t b.\\tgua png cia-be-liau. I meal eat-cannot-up (i) cannot finish eating.'\\tphasal reading (ii) 'I cannot eat up the meal.' resultative reading Regarding these three types of verbal complexes, Chinese linguists have offered diverse analyses. Yang (1991) considers them all phrases; Tang (1992) takes resultative and phasal sequences to be compounds formed in the lexicon, and directional ones as phrasal verbs; and Teng (1995) considers resultative sequences compounds, and the other two serial verbs. What these analyses have in common is that directional complexes are some sort of phrases, but they differ with regard to the status of resultative and phasal complexes. This paper agrees with the previous analyses in that directional complexes are phrases, but argues that both resultative and some phasal sequences are syntactic compounds while other phasal sequences are lexical compounds. This proposal differs from Tang's analysis in that resultative compounds and some phasal compounds are argued to be syntactically derived while other phasal compounds are formed in the lexicon. That is, this paper argues that these three types of verbal complexes are all different from one another in their formation and thus the difference in their syntactic behavior. 2 Directional Complexes Directional complexes are argued to be phrases with a D-structure roughly as in (9), which is the D-structure for (3). As shown in (9), chutkhi 'out' heads the prepositional phrase (PP) which is the complement of the verb sao 'sweep' . (9)\\tVP \\t NP\\tV' \\t hit dui punse;\\tV\\tPP \\t sao\\tNP\\tP' pro; chutkhi In the D-structure (9), the NP hit dui punse 'that pile of garbage' is not Case-assigned in the Spec of VP position, assuming that Accusative Case is assigned from left to right in Chinese, as proposed by Travis (1984) and Y.-H. Li (1992). The verb sao thus has to move up to a VP shell to assign Case to it, 311 and the derived sentence will be (5c), where the NP object follows the head verb. If the NP object is to be emphasized, it may be further preposed to adjoin to VP, as Ernst & Wang (1995) argue that a definite NP can move to adjoin to VP, and the derived sentence will be (3). In (4c), directional complexes allow infixes such as ho, a causative marker as proposed by Cheng et al. (1999), intervening in between. The causative marker ho, potential markers e/be 'can/cannot', and negative marker bo ǹot' are affixes as they never occur alone and must attach to a verbal element. Therefore, it seems reasonable to consider that the affixation takes place in the lexicon and thus the verbal elements occurring in those forms are derived in the lexicon. However, directional phrases, which are often argued to be derived in syntax, can also occur in those forms. Therefore, it is more plausible to assume that these affixes are syntactic elements heading their own phrasal projections in syntax, and the affixation takes place in syntax. (4c) is thus proposed to have a D-structure as in (10), where ho as a causative marker heads the causative phrase (CAUSP), which intervenes between VP and PP. The NP hit dui punse in the D-structure (10) also can not receive Case in the Spec of VP position and the verb sao has to be preposed to assigned Case to it. The derived sentence, however, is ungrammatical as shown in (11), since the infix ho does not occur after a verbal element. The NP hit dui punse thus has to be further preposed to adjoin to"]},{"title":"Cland","paragraphs":["the grammatical sentence (4c) is derived. (10) VP NP\\tV' hit dui punse;\\tV\\tCAUSP sao\\tCAUS\\tPP ho NP\\tP' Pro; chutkhi (11) *ni ai sao\\thit dui punse -ho-chutkhi. you must sweep that CL garbage -CAUS-out Ỳou must sweep that pile of garbage out.' To derive a sentence like (6c), an object is required after the preposition chutkhi 'out' in the D-structure, which, however, is not licensed since directional prepositions either do not take objects or only allow place-denoting objects such as guakhau 'outside'. The D-structure for (6c) is not licensed and thus (6c) is ungrammatical."]},{"title":"312","paragraphs":["Resultative Complexes As shown in (6), resultative complexes are the only ones that can take an object after the whole complex, just as simplex verbs can. It is thus reasonable to consider them as compounds. Example (4b), however, seems to prove contradictory to this proposal because (4b) shows that resultative complexes allow the insertion of syntactic elements such as the causative marker ho. This dilemma, however, can be resolved by proposing that resultative complexes are compounds derived in syntax. The D-structure of a resultative complex as in (2) is proposed to be (12). (12) ASPP NP\\tASP' gua\\tASP\\tVP1 a\\tNP\\tV' hit khia lagia; V 1\\tVP2 \\t pha NP\\tV' \\t prof\\tV2 si As proposed by Li & Thompson (1981), the perfective aspect marker must attach to the verbal element denoting a bounded event. In (12), pha 'hit\" or si 'dead' alone does not denote a bounded event. It's pha plus si that denotes a bounded event. Si thus has to move up to incorporate with pha so that the perfective aspect marker a can lower to attach to pha-si, which denotes a bounded event; the resultative compound pha-si is thus derived. The derived compound pha-si-a also has to be preposed to assign Case to the NP hit khia lagia. The derived sentence, however, is ungrammatical as shown in (13). (13) *gua pha-si-a\\thit khia lagia. I hit-dead-ASP that CL spider Ì killed that spider.' Note that aspect markers in Taiwanese often occur in a clause-final position as proposed by Lin 313 (2001); 5 the sequence pha-si-a has to occur clause-finally, and thus (13) is ungrammatical. The NP hit khia lagia, however, can be further preposed to adjoin to VP and the derived sentence will be grammatical as shown in (2). On the other hand, when the perfective marker is covert, the resultative compound does not have to take a clause-final position. After the resultative compound moves up to a higher VP shell, the derived sentence is still grammatical as shown in (6b), where the compound pha-si is followed by an object. As for (5b), where the compound is intervened by an NP, it is ungrammatical because V2-to-V1 incorporation must take place in order for the perfective marker a to attach to the compound and thus an NP cannot intervene in between. Since resultative compounds are derived from a biclausal D-structure as in (12), to derive the V-infix-V form, we only need to insert an extra phrasal projection between the two verbs as shown in (14). The reason why verb incorporation does not take place in (14) is that it does not contain the perfective aspect marker a. As proposed by Li & Thompson (1981), some sentences denoting a bounded event do not contain the perfective aspect marker because there are already other elements serving the function of \"perfectivizing\" the verb, such as the directional phrase, locational phrase, etc. The causative phrase in (14) has exactly such a function and thus the perfective aspect marker is not used in (14). As such, verb incorporation does not take place. The directional phrase in directional complexes as in (9) also has the function of \"perfectivizing\" the verb and thus no verb incorporation takes place in the case of directional complexes. (14)\\tVP1 NP hit khia lagia;\\tV1\\tCAUSP pha\\tCAUS\\tVP2 ho NP\\tV' pro;\\tV2 si 5 However, exceptions can be found. For example, the experiencer aspect marker kue does not have to occur clause-finally, as shown in (i). Whether an aspect marker has to occur clause-finally is specified in the lexicon. Most of the aspect markers do follow this generalization.","(i)\\ta.\\ti\\tlitpun bat khi-kue. he Japan ever go-EXP H̀e has ever been to Japan.' b.\\ti\\tbat khi-kue litpun. he ever go-EXP Japan 314 In (14), the verb pha also has to prepose to assign Case to the NP hit khia lagia; the derived sentence, however, is ungrammatical as shown in (15) since the infix ho does not occur after a verbal element. The NP thus has to be preposed to adjoin to VP and the derived sentence will be a grammatical sentence as in (4b). (15) *ni ai\\tpha hit khia lagia -ho-si. you must hit that CL spider -CADS-dead Ỳou must kill that spider.' After verb incorporation, resultative compounds are derived, and like simplex verbs, they can take postverbal objects. Since they are derived from a biclausal structure, other syntactic elements such as causative phrases can be projected between the two verbs in the D-structure. Of course, the derived sequence such as pha-ho-si is no longer a compound but a phrase and thus it cannot take a postverbal object. The analysis that resultative compounds are syntactically derived as presented above thus can account for both their lexical property—taking postverbal objects, and syntactic property—allowing the insertion of a syntactic element. 4 Phasal Complexes Traditionally, those phasal complexes in (1), (4a), (7), and (8) are mostly considered phasal compounds. However, as shown in those examples, phasal complexes are not a homogeneous group. This paper thus proposes that phasal complexes be classified into two types, lexical compounds and syntactic compounds. Only after being so classified can their similarities with and differences from resultative and directional complexes be accounted for. Phasal complexes such as khuaN-liau 'read-finished' in (1) are proposed to be derived from a D-structure as in (16), where the verb khuaN takes as its complement the Particle Phrase (PRTP) which is headed by the particle liau. (16) ASPP \\t NP\\tASP' \\t gua\\tASP\\tVP a\\tNP\\tV' hit pun cheq V\\tPRTP khuaN","\\t PRT' PRT liau"]},{"title":"315","paragraphs":["As in the formation of resultative compounds, liau has to incorporate with khuaN so that the perfective aspect marker a can lower to attach to khuaN-liau, which denotes a bounded event. After the incorporated compound khuaN-liau-a preposes to assign Case to the NP hit pun cheq, the derived sentence is also ungrammatical as shown in (17), since as mentioned above, aspect markers must occur clause-finally. (17) *gua khuaN-liau-a\\thit pun cheq. I read-finished-ASP that CL book Ì finished reading that book.' Furthermore, unlike resultative compounds, even when the aspect marker is covert, the derived sentence is still ungrammatical, as in (6a). This is due to a special feature of phase particles in Taiwanese, as proposed by Cheng (1992) and Lin (2001); that is, like aspect markers, phase particles in Taiwanese must occur clause-finally. v Therefore, whether the phasal compound is followed by an aspect marker or not, the NP hit pun cheq must be preposed to adjoin to VP so that the phasal compound can take a clause-final position and the derived sentence will be (1). Phasal complexes such as khuaN-liau can also occur in V-ho-V, V-e/be-V, and V-bo-V forms as in (4a). Since just as resultative compounds, this type of phasal compounds is derived from a biclausal D-structure, when they are in the causative, potential, or negative form, there is an extra phrasal projection between V and PRTP in their D-structure as shown in (18). In (18), the causative phrase also serves to \"perfectivize\" the verb, the perfective aspect marker is not used, and thus no incorporation takes place. Also as in the case of resultative compounds, after the verb khuaN preposes to assign Case to hit pun cheq, the derived sentence as shown in (19) is ungrammatical because the infix ho does not occur after a verbal element, and thus hit pun cheq has to be further preposed to adjoin to VP; the derived sentence will be (4a). As"]},{"title":"shown in (5a), the phasal complex does not","paragraphs":["6 However, as noted in Lien (1995) and Tang & Tang (2000), tioq is an exception. As shown in (i), V-tioq can be followed by an object. (i) \\tgua khuaN-tioq i a. I see-PRT\\the PRT saw him.' 7 As discussed in Cheng (1992), influenced by Mandarin, for some phase markers, young people tend to adopt the usage of their counterpart in Mandarin. For example, they may use the phase particle uan 'finished' as a verbal suffix instead of a sentence-final particle. Thus other than (i), (ii) is also spoken by young people. (i) gua taici co-uan\\ta. I work do-finished PRT Ì fmished work.' (ii) gua co-uan\\ttaici a. I do-finished work PRT 316 allow an NP in between. This is due to the fact that incorporation must take place in (5a) as it contains the perfective aspect marker and thus no NP will occur in between. (18) VP \\t NP\\tV' \\t hit pun cheq\\tV\\tCAUSP khuaN CAUS PRTP ho\\tPRT' PRT liau (19) *ni ai\\tkhuaN hit pun cheq -ho-liau. you must read that CL book -CADS-finished Ỳou must finish reading that book.' On the other hand, another type of phasal complexes such as cia-suaq 'eat-finished' in (7) is proposed to be a lexical compound, which is formed in the lexicon and inserted under an appropriate V-node in syntax. As a lexical compound, it cannot be intervened by syntactic elements, such as the negative marker as in (7b). As for phasal complexes such as cia-liau 'eat-finished' with phasal reading in (8), they are proposed to be lexical phasal compounds as cia-suaq is. Even though they seem to be able to occur in those infix forms as in (8b), when they do occur in those forms, they have lost their phasal meaning. That is to say, as lexical compounds, they do not allow syntactic elements in between, and cia-liau occurring in those forms is actually a resultative complex, which is syntactically derived from a biclausal D-structure as proposed above and thus allows phrasal projections in between. Among the three types of verbal complexes discussed in this paper, phasal compounds are the only heterogeneous group. The varying properties of phasal compounds have been mentioned by Lien (1995) and Tang & Tang (2000). They attribute the differences in phasal compounds to grammaticalization. That is, even among phasal compounds, each of them may undergo grammaticalization at different stages; therefore, some of them still have rather loose internal structures, while others are more tightly attached and thus inseparable. This paper is more precise in that it proposes different derivations for these two types of phasal compounds to account for their differences; that is, some of them are still separable phrases while others are already inseparable lexical compounds. 317 5 Conclusion This paper has agreed with previous analyses that directional complexes are phrases, and then proposes that infixes such as the causative marker ho are syntactic elements heading their own phrasal projections in syntax. Resultative complexes are argued to be compounds derived from a biclausal D-structure and thus their syntactic property—allowing the insertion of syntactic elements such as ho, and lexical property—taking a postverbal object, can be accounted for. As for the heterogeneous group, phasal complexes, they are divided into syntactic compounds and lexical compounds. Different formations account for their differences such as taking syntactic elements. As for the complexes occurring in those infix forms, they are derived in syntax, and they are all phrases, not compounds any more. Appealing to the idea that word formation can take place both in syntax and the lexicon, this proposal accounts for the individual properties of these three types of verbal complexes in Taiwanese. References Baker, Mark C. 1988. Incorporation: A Theory of Grammatical Function Changing. Chicago: University of Chicago Press. Borer, H. 1988. ON THE PARALLELISM BETWEEN COMPOUNDS AND CONSTRUCTS. Yearbook of Morphology, 1:45-66. Cheng, Lisa Lai-Shen, C.-T. James Huang, Y.-H. Audrey Li, and C.-C. Jane Tang. 1999. HOO HOO HOO: syntax of the causative, dative, and passive constructions in Taiwanese. In Pang-Hsin Ting (ed.), Contemporary Studies on the Min Dialects, 146-203. JCL Monograph Series #14. Cheng, Robert L. 1992. THE PHASE—ASPECT SYSTEM IN TAIWANESE AND MANDARIN. Symposium Series of the Institute of History and Philology, Academia Sinica, Number 2. Chinese Languages and Linguistics I: Chinese Dialects, 179-239. Taipei: the Institute of History and Philology, Academia Sinica. Di Sciullo, Anna-Marie, and Edwin Williams. 1987. On the Definition of Word. Cambridge, MA: The MIT Press. Ernst, Thomas, and Chengchi Wang. 1995. OBJECT PREPOSING IN MANDARIN CHINESE. Journal of East Asian Linguistics, 4:235-260. Li, Charles N., and Sandra A. Thompson. 1981. Mandarin Chinese. Berkeley: University of California Press. Li, Yen-Hui Audrey. 1992. INDEFINITE WH IN MANDARIN CHINESE. Journal of East Asian Linguistics, 1:125-156. Lien, Chinfa. 1995. TAIWAN MINNANYU WANJIE SHIXIANGCI SHILUN (Finishing Phase words in Taiwan Southern Min). In Tsao, Fengfu and Tsai, Meihui (eds.), Papers from the 1994 Conference on Language Teaching and Linguistics in Taiwan, Volume I: Southern Min, 121-140. Taipei: The Crane Publishing Co., Ltd. Lieber, Rochelle. 1988. PHRASAL COMPOUNDS IN ENGLISH AND THE MORPHOLOGY-SYNTAX"]},{"title":"318","paragraphs":["INTERFACE. In Diana Brentari, Gary Larson, and Lynn MacLeod (eds.), Papers form the Parasession on Agreement in Grammatical Theory, 202-222. Chicago Linguistic Society. \\t. 1992. Deconstructing Morphology. Chicago: University of Chicago Press. Lin, Huei-Ling. 2001. VERBAL COMPLEXES AND OBJECTS IN TAIWANESE. In Hsien-Chin Liou and Raung-Fu Chung (eds.), Language Research and English Teaching: Challenges and Solutions, 55-74. Taipei: The Crane Publishing Company. Shibatani, M., and Kageyama, T. 1988. WORD FORMATION IN A MODULAR THEORY OF GRAMMAR: post-syntactic compounds in Japanese. Language, 64(3):451-484. Tang, Ting-Chi. 1992. THE SYNTAX AND SEMANTICS OF VP COMPLEMENTS IN CHINESE: a comparative study of Mandarin and Southern Min. Studies on Chinese Morphology and Syntax: 4, 1-93. Taipei: Student Book Co., Ltd. \\t, and C.-C. Jane Tang. 2000. ASPECTUAL AND PHASAL EXPRESSIONS IN SOUTHERN MIN. Papers on Chinese Syntax, 201-220. Taipei: Pyramid Press. Teng, Shou-hsin. 1995. VERB COMPOUNDING IN TAIWANESE. Cahiers de Linguistique Asie Orientale, 24:3-28. Travis, Lisa deMena. 1984. Parameters and Effects of Word Order Variation. Cambridge, MA: MIT dissertation. Yang, Hsiu-Fang. 1991. Taiwan Minnanyu Yufa Gao [A Grammar on Taiwan Southern mini Taipei: Da An Publisher. Yoon, James Hye Suk. 1989. A Restrictive Theory of Morphosyntactic Interaction and Its Consequences. Champaign-Urbana, IL: University of Illinois dissertation."]},{"title":"319","paragraphs":[]}]}