{"sections":[{"title":"ACL-08: HLT 46th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies Proceedings of the Demo Session June 16, 2008 The Ohio State University Columbus, Ohio, USA","paragraphs":["Production and Manufacturing by Omnipress Inc. 2600 Anderson Street Madison, WI 53707 USA"]},{"title":"c⃝2008 The Association for Computational Linguistics Order copies of this and other ACL proceedings from: Association for Computational Linguistics (ACL) 209 N. Eighth Street Stroudsburg, PA 18360 USA Tel: +1-570-476-8006 Fax: +1-570-476-0860 acl@aclweb.org","paragraphs":["ii"]},{"title":"Introduction","paragraphs":["Welcome to the proceedings of the demo session. We received 21 submissions, 9 of which were selected for inclusion in the program after review by at least two members of the program committee. iii Chair: Jimmy Lin (University of Maryland) Program Committee: Marine Carpuat (HKUST) Joyce Chai (Michigan State University) Trevor Cohn (University of Edinburgh) Damianos Karakos (Johns Hopkins University) Terry Koo (MIT) Alberto Lavelli (FBK-irst) Don Metzler (Yahoo! Research) Andrew Rosenberg (Columbia University) Hiroshi Nakagawa (University of Tokyo) Takenobu Tokunaga (Tokyo Instiute of Technology) v"]},{"title":"Table of Contents","paragraphs":["Demonstration of a POMDP Voice Dialer Jason Williams . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 1","Generating Research Websites Using Summarisation Techniques Advaith Siddharthan and Ann Copestake . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 5 BART: A Modular Toolkit for Coreference Resolution","Yannick Versley, Simone Paolo Ponzetto, Massimo Poesio, Vladimir Eidelman, Alan Jern, Jason Smith, Xiaofeng Yang and Alessandro Moschitti . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 9","Demonstration of the UAM CorpusTool for Text and Image Annotation Mick O’Donnell . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 13","Interactive ASR Error Correction for Touchscreen Devices David Huggins-Daines and Alexander I. Rudnicky . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 17","Yawat: Yet Another Word Alignment Tool Ulrich Germann . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 20","SIDE: The Summarization Integrated Development Environment Moonyoung Kang, Sourish Chaudhuri, Mahesh Joshi and Carolyn P. Rosé . . . . . . . . . . . . . . . . . . 24 ModelTalker Voice Recorder—An Interface System for Recording a Corpus of Speech for Synthesis","Debra Yarrington, John Gray, Chris Pennington, H. Timothy Bunnell, Allegra Cornaglia, Jason Lilley, Kyoko Nagao and James Polikoff . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 28","The QuALiM Question Answering Demo: Supplementing Answers with Paragraphs drawn from Wikipedia Michael Kaisser . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 32 vii"]}]}