{"sections":[{"title":"American Journal of Computational Linguistics","paragraphs":["Microfiche 44"]},{"title":"COMPUTER UNDERSIANDING OF METAPHORICALLY USED VERBS SYLVIA WEBER RUSSELL Forest Park 9-E Durham, New Hampshire 03824 Copyright o 1976 Association for Computational LinguistiCs","paragraphs":["A major problem conrronting computer pro:lram:."]},{"title":"driven by nnturol-1 ngu ge","paragraphs":["input consists of thc interprctntion"]},{"title":"of","paragraphs":["1inguh.l"]},{"title":"ic cxprossiobs","paragraphs":["for which the int endcd literal meaning is not e:q~licitly"]},{"title":"given by the","paragraphs":["lc~ioi~l coml>onents of the expresL;ion. ~'tn ccxi~mple"]},{"title":"is","paragraphs":["thc \"extended useu of the verb 'leapt"]},{"title":"in 'the country","paragraphs":["leapt to prosperity'. buch extended usages--whether cunsi-as inilntcd"]},{"title":"or original-- czn be considered metaphorical to","paragraphs":["the cktcnt th-,t they are based"]},{"title":"on analogies.","paragraphs":["This paper establishes a framework for interpretin? netaphoric,ll expres ionk by analysis of under-"]},{"title":"lying cbstrgct","paragraphs":["cor:~ponents --such 9s \"trnns tio on\" and"]},{"title":"\"inten-","paragraphs":["'i'h~s is"]},{"title":"in","paragraphs":["contrcst to pre- sity\""]},{"title":"for","paragraphs":["the nbovc example."]},{"title":"viouc: epproaches","paragraphs":["which rely"]},{"title":"on 3 a~mbcr ~f","paragraphs":["word senses intended to represent metnp oricL21 usi ges directly. An eexperimentcl rro )ram find, literal inter7rctations for"]},{"title":"inyut rcprc~snting","paragraphs":["a simyle scnt~l ce"]},{"title":"m","paragraphs":["\\.hit!. the \"verb21 concepttf (action, state or cttributc) is used metaphorically. This"]},{"title":"in ut","paragraphs":["has thc gcner 1 conAguration 1 ~uB JCfl"]},{"title":"Vc,&","paragraphs":["OBJECT ;~UXCE/GO.IL or 2 UBJLCT PiLDICA"]},{"title":"TE-ADJECTIVEf. The","paragraphs":["interpretation are ~ive? in the f om of"]},{"title":"primitive","paragraphs":[";;nglisFI pcraphrases"]},{"title":". The-e parsphrases ,","paragraphs":["which are intended merely to illustrate the informcrtisn which czn be extrrcted"]},{"title":"from","paragraphs":["metr.?:~orical inmt"]},{"title":", dre bL","paragraphs":["sed on scmr.ntic representations which are convertible to structures specified by SchL.nkt s conceptual deaendency theory. The interpretation of mctaphori~nlly used verbs thus represents a particul..r case of the"]},{"title":"general tusks of disambiguation and interpretation encountered by the","paragraphs":["conce-tual dependency parser, The hpproxim~tion to the literal mc,"]},{"title":"ning of n metaphorical verb","paragraphs":["is"]},{"title":"achieved through","paragraphs":["reference to semantic descrip-tions based primarily on n srn.111 number of. conceptual features and absrrrct structures. THese descriptors are specif icd Lor classes of those concepts which ore c:qrcosed"]},{"title":"in","paragraphs":["dnglish by nouns, verbs, adjectives .:nd prepositional phrases. The complete set of values L-or the clescriptors or verbal concepts is represented as a multi-dimensional matrix containing the defined conceptd."]},{"title":"This","paragraphs":["matrix, which is"]},{"title":"only","paragraphs":["p~rtially described"]},{"title":"in this paper, exhibits relatlonshipb and analogies","paragraphs":["wldch underlie metaphorically used verbs. The relative independence and cbutrcct chnracter of the basic sernuntic descriptors render rhe system easily extensible to f urthcr capabilities, such as more conclusive interpretations"]},{"title":"or","paragraphs":["the tre tment or' more chnllenging expressions. The emphasis on systematic uescriptions ,nd primitive concepts to produce sim~le p raphrases is viewed as reilecting hwn understanding or novel linguistic expressions"]},{"title":"an& providing a model","paragraphs":["to explore questions related to such under-tanding."]},{"title":"Contents 1. Approach 1.1 halogies 1.2 Conceptual dependency interpretations 2. Characterization of Verbal Concepts 2.1 Levels 2.2 States 2.3 Structures 2,4 Features 3, Characterization of NOMLNALs 3.1 Features 3.2 Function descriptors 4. Nethod of Interpretation 4.1 Conditions on metaphorical extension 4.2 Operational context 4.3 General procedure","paragraphs":["4.4 Operation of routine 4.5 Tests and criteria 5. Examples 5.1 Level shift 5.2 Category shift 5.3 R-O switch 5.4 Intra-level feature shift 5.4,L Actor-feature shift 5.4.2 Object-feature shift 5.5 ~oun compounds 6. Conclusion Metaphorical usages have often been regarded ns \"special ccscou to vhich"]},{"title":"the particular language analysis mcthod under discussitm did not apply. This pnpcr prcsdnts n","paragraphs":["mcthod for comsutez*"]},{"title":"undcistnnding of a class of phrases in which","paragraphs":["the verb is used 9netnphoricollytt, but which ignorer: the distinction between rrextcndedlv and \"assi~nil tedtr usages. This approach provides flexibility"]},{"title":"in handling previously unseen usages, The","paragraphs":["assumjtion underlying this approach is that analogies ore involved in language understanding to a greater extent than speakers consciously"]},{"title":"realize. 1.1. - Analogies Analogies arc","paragraphs":["the means by which we substitute, extend or borrow concepts."]},{"title":"In the use of an analogy,","paragraphs":["a word is borro?+erl Jrom its usual context to exprcs3 some"]},{"title":"component of meaning sh'rrcd by","paragraphs":["the concept underlying the borrowed word"]},{"title":"in its literal sense","paragraphs":["and the concept which the borrowed word is to reprclsent. This results in an extendeu or netaphorical use or the word. The system to be described is intended to show the analogy comprehension necessary for the interpretation of metaphorical usages of verbs. The problem of determining the meanins of a metaphorical expression is one of knowing the critical similarities and differences which a borrowed sense of a word has with respect to the orilginol sensc."]},{"title":"In somc case.; an es::cntic,lly meto-","paragraphs":["?horic,lL usage ccoses to be tl~ought of as borror~cd, nnd acquires"]},{"title":"on","paragraphs":["idiomatic scnsc of its"]},{"title":"own. r!owcvcr,","paragraphs":["ir thc sirr,il.;:rit.ies and dir'r'erencu which ontcr into :rtnphoric.;l usnses c.In be idcntificd, vr?"]},{"title":"c:?n still ht ndlc","paragraphs":["~uch nn exprcssian as wc"]},{"title":"uo those exnressions which :.rc","paragraphs":["p:encrally viewed as iact n~~horicnl"]},{"title":". Concid~r t hc L xk3l.~ples L) L'he ilousc 1;illeck","paragraphs":["the"]},{"title":"bill 2) I scc","paragraphs":["wh~t you mean Here the first example oprlears to be ncraphorical, the second"]},{"title":"not.","paragraphs":["A langu,~ge nnaLy..er prepared to handle only non-metapl10ri.c~ 1 input might achieve the correct interpret2 t ion of '1 see1 in the sensc of '1 un~crst'nd I. :io,:evcr, it would succcecl only"]},{"title":"if lsectswere listed' in","paragraphs":["the dictionall) as enuivalent to tunaerut..i~d' in one sensc. Such n solution ignores the cc:~pahilities"]},{"title":"which humrns hhve for correctly interpreting such sentences","paragraphs":["without h"]},{"title":"ving","paragraphs":["lecrned this s:.nonymity. A parser which lacks this ability, i.e. to interpret without relying on ad hoc aids, will"]},{"title":"n..t","paragraphs":["have the flexibil'ity required to a,-proach similrr problems in r~hich such nids are missing due to the prejudices of the aerson who deir'ines verbs for the lesicon. In this sense, we should be able ro unucrst-nd mcta-phorical sentences on the basis of an analogy to the ordinary or literal sensc of thc words involved. The excl~-nlea 1) The idea of growing their own radishes was born"]},{"title":", 2) He","paragraphs":["hid his embarrassment about the honey pot 3) He relinquished his hopes"]},{"title":"4) Her painting said something to me are all metaphorical in different ways with respect to the ordinary sense of the verb:","paragraphs":["the literal effect of 'hidn' is visual; thnt of 'relinquisht has to do with control of a phyeical concept; thnt of say1 has to do with Linguistically expressed information. But in each case there is an analogy between"]},{"title":"the","paragraphs":["ordinary .mnti the metaphorical usage of the verb. The analop*.-d~onsists"]},{"title":"of","paragraphs":["the similarity of the which occur in the mn-metaphorical and metaphorical usages:"]},{"title":"I.),, The idea","paragraphs":["(= to grow their own radishes) was born The baby"]},{"title":"(= Percy) was","paragraphs":["born Effect = new idea (baby) can be related to 2) He hid his embarrassi~~ent about the honey pot Xe hid the honey pot Effect = Others are not visually aw-ire of his emborrassment (honey pot) 3) He relinquished his hopes He relinquished the presidency Effect"]},{"title":"= IIe no longer has a certain ottkibute 4) Her painting mid something to me Her book araid somet1 ng to me She said something to me Effect","paragraphs":["="]},{"title":"I have a~new mental concept to consider Information derived","paragraphs":["from such metaphorical expressions should at least"]},{"title":"include analogous effects of this kind, dhich represlmt the","paragraphs":["\"rcsultlt"]},{"title":"component of: tho meaning of the expression. (A related problem of extracting","paragraphs":["conceptual"]},{"title":"inferences is d&scussed by Schank and Xieger (8","paragraphs":["). ) This task requires a"]},{"title":"verb description system","paragraphs":["which"]},{"title":"cittcgorines verbs* by two","paragraphs":["criteria :"]},{"title":"1)","paragraphs":["the identitic.ition"]},{"title":"of lm.","paragraphs":["underlying dtructural"]},{"title":"component","paragraphs":["which"]},{"title":"is similar","paragraphs":["for verbs"]},{"title":"which arc used analogously in linguistic expressi. ns , and 2) the identification of a certain level at which the verb applies, such as \"physicallt . Each verb will thus be classified,","paragraphs":["not"]},{"title":"in","paragraphs":["terms of a single category, but"]},{"title":"in terms of two type9 of variables having values according to these two criteria. Thus levels","paragraphs":["and structure-concepts"]},{"title":"must be determined which can be used as a basic form of description of verbs in the dictionary. 1.2. Conceptual dependency interpretations In addition to such verb descriptions, which serve the analysis task, the form of \"targetu representations, i.e. of the literal interpretations must be considered. The basic asstqtion","paragraphs":["underlying a choice of representation is that a \"translation\" from a metaphorical to a corresponding literal ex:~ression cannot be achieved by manipulaf ion of components at"]},{"title":"any syntactic level. What is needed is an tvinterlinguatt, which deals","paragraphs":["with relationships between concepts at the cognitive level. The conceptual represent at ions which apply to thie interlingua are not dependent on the original lexical form"]},{"title":"(or language) of the input, and can be used to generate paraphrases of the input","paragraphs":["into the same or other languages, given the concept-to-syntax mapping rules for that ~ongu$ge. The chdea of a form of conceptual representation must be guided by the extent to ~hich it shows rel,ltionships brtween concepts at the cognitive level. The conceptual dependency theory of Schank (6-9) provides such a- representation in terms of predicntive and qualifying dependencies between conceptual categories and is assumed as the context of the method presented here. In a dependency, according to this theory, a concept of one conceptual category is dependent on, qualifies directly or serves to describe a concept of another conceptual category according to rules of conceivability. These unambiguous, language-free dependencies are word-independent, although the concept symbols on occasion map directly into some lexical term expressing these concepts. The nature of conceptual dependency representations, as well as their suitability for metaphor analyses, can be conveyed by a simple example. 'The ink stained the floor' can be represented conceptually as"]},{"title":". . ink color: Xj . The significance of thls colors xi representation lies not in the particular hotation adopted, but in the components of meaning which it rcve~ls.","paragraphs":["The dots"]},{"title":"(... ...) indicate","paragraphs":["tht1t the ink"]},{"title":"is not necessnrily the agent, but is merely somehow involved in","paragraphs":["thc action. The"]},{"title":"~~dk@tbn arrow!'","paragraphs":["("]},{"title":"m) indicates n causal reLn tionship as opposed to thc eesclmple 'the ink","paragraphs":["hit the floorv. 'The notation indicntcs n change of state of tfloorl, ar mare specificnlly, an Inalienable PUT of the floor. The 'NEJ~ative' notation"]},{"title":"is a iconnotationtt (5) wl~ich is secondary to the purely objective representdtion of 'stainT. If it is assumed that the use of metaphor relies on some similarity of semantic components between an ordinary and an extended sense, it c.ln be seen that a representation of this type, ref Lecting a conceptually-oriented sen-ntic","paragraphs":["theory, is ndequcte to the task at hand. By reference to the abstract components of causation, change of state, pert vs. %,hole and negativeness reve~led by the iibove cunceptu~l structure for *staint, a paraphrase for the metaphorical 'his business activities stained his reputationT is essily npproximated; 'his activities csused a neg~.tive change in (part of) his reputation1. There is no dependence on complex trznsforrna-tions or muktiple word senses, which might in fact fail in the: case of novel f oms of expression, such as more rtcreative\" metaphor. The components of conceptual dependency representation can be briefly described as follows. The conceptual categories"]},{"title":"between which","paragraphs":["the"]},{"title":"various conceptdal dependencies exist are ACT, PP (lfpicture produceru) and PA (\"picture assistcr~), At tho eyntaoti~ level, these categories are sometimes em premed in the English language by verbs, nouns","paragraphs":["and adjec-"]},{"title":"tives respectively. However, such correspondence does not always occur.","paragraphs":["For"]},{"title":"example,","paragraphs":["many"]},{"title":"nouns can be expressed directly in terms of verbal","paragraphs":["or"]},{"title":"attributive concepts ('the","paragraphs":["'that"]},{"title":"which,..'). Such nouns would not be statc of... , mapped directly into PPs. The dependencies which","paragraphs":["hold between the specified"]},{"title":"categories ot the cognit ive level must ult imittely be given* by a uconceptual grammarM","paragraphs":["which reflects"]},{"title":"their conceivability and theref ore their comprehensibility.","paragraphs":["Such n grammar,"]},{"title":"independent 6f actual word-construct usage, would include information such as what kind of concepts can be related by a specification of","paragraphs":["position"]},{"title":"in time. Our concern here, however, will be mainly with the lower-level","paragraphs":["and"]},{"title":"more detailed information contained in a bfconceptuolizationl', or simple conoeptual s tructure. The general conceptual dependency format which has been established for the conceptualizations which will be referred to takes one of the","paragraphs":["following forms (semantic terms"]},{"title":"which are irrelevsnt to","paragraphs":["the"]},{"title":"metaphor","paragraphs":["problem, such as tense,"]},{"title":"will be ignored): <relation> PP (object) PP (object) ON e,g. ink","paragraphs":["floor"]},{"title":"The ink is on the","paragraphs":["floor The ink is"]},{"title":"in contact with","paragraphs":["the floor PP (object)"]},{"title":"< PA (attribute)","paragraphs":["e-g. ink"]},{"title":"<+>","paragraphs":["COWR: black The"]},{"title":"ink is black The ink has a black","paragraphs":["color (attribute-value (new)> (change of state) (attribute-value (old)) CCLOR: black e.g. ink COLOR: ? The ink turned black The ink changed to a black color (goal> PP (actor) <$"]},{"title":"r-lm (action) +PP (object +- C <source, I (continued) +<instrumental conceptualization> Eiary e.g. John<=> ATRANS +- C0NTROL:ink I '32 John \"C","paragraphs":["Nary ( IPART :hand) (cont.)"]},{"title":"t","paragraphs":["John PTW +ink"]},{"title":"+","paragraphs":["John( IPART: hand) John gave Siary the ink by handing it to her John handed Mary the ink CP(mrg"]},{"title":"1 or","paragraphs":["JohneEPPRwS"]},{"title":"+$","paragraphs":["?"]},{"title":"\"-C CP (John) John communicated the ink","paragraphs":["story to Mary Mary heard about the ink from John The actual relevancc and character of some of the"]},{"title":"components","paragraphs":["of the"]},{"title":"latter","paragraphs":["type depends on which ACT is present.","The list of i&Ts is: MOVE GRASP PTR hNS FROPEL SPEAK bXflCRiNS"]},{"title":"INGEST Am'ENL","paragraphs":["ATEtUS EXPEL El5 UILD 'Ilhe source-goal component"]},{"title":"is irrelev nt to","paragraphs":["tile ACT GkLlSP,"]},{"title":"for exclmple. For","paragraphs":["FTkiNS (physic.11 tmnsition), the object"]},{"title":", source and goal must be spec","paragraphs":["if ied and are phys"]},{"title":"iccl .","paragraphs":["For WCY\\NS"]},{"title":"fmental","paragraphs":["tmnsition), the object is itself n conceptualization and the sourue and goal"]},{"title":"arc the","paragraphs":["rnentl-1 processors"]},{"title":"of human or","paragraphs":["at least anirn:lte beings:"]},{"title":"- Conscious - Processor, Long Term","paragraphs":["Memory and Immediate iv!emory. For MTRANS (abstract -.I"]},{"title":"- - - -","paragraphs":["transition) the object is a form of control and"]},{"title":"the","paragraphs":["source and"]},{"title":"goal re animate beings.","paragraphs":["Each of these three foms of"]},{"title":"transition involves a type of","paragraphs":["t'conceptual casetf: PTR.,NS"]},{"title":"takes the Directive or Locative case","paragraphs":["("]},{"title":"+ \"C , and l+ll'&U?S and","paragraphs":["ATWS the hecipient or possessive case ("]},{"title":"+- RE d. The object which is dependent on","paragraphs":["an AL'~ in that it is","0","\"acted uponf1 is in the Objective case ("]},{"title":"t PP (object)). There are a","paragraphs":["number of other conceptual connectives and modifiers which apply to such conceptualizati ns. These cdn be referred to"]},{"title":"in (6). The","paragraphs":["r.ost important of these as concerns the representat ion of the concepts considered"]},{"title":"in this paper","paragraphs":["is the element of causation: 4 causing ccnceptualization>"]},{"title":"m orle e=> DO This component underlies verbs such as 'make '","paragraphs":["( one (=} 1)0"]},{"title":"m 1 <EP><=+ be and","paragraphs":["color ( <PP>(&c CDI,UK: <new vnluc)"]},{"title":"1.","paragraphs":["COLOR: <bid value> Llifierentiated types of"]},{"title":"cautintion","paragraphs":["and the conditions for their applicability ore given in (6). Intcndcd causation or purpose"]},{"title":"I?","paragraphs":["will be designated in the present rvork as"]},{"title":",,, It is proposed","paragraphs":["that verbs be-represented us entries in a multi-diti~ensional m::trix which shows the dn\\ilC.rities and difzerenccs mentioned. .is a char~ctcrisazion of verb.1 concepts is desired, re~ardless 02 whether these are realided 1c::ically as verbs, odjcctivcs or prepositional relations, such concepts will be rc~orred to as s"]},{"title":", as opposed to the lexical tvcrbsl. 171e column headings of this matrix ~ive the","paragraphs":["char.~ctcristic t~structurea\" of the Vi.;Bs, eithrr explicitly or as conii ur.ltions or' feature.;, ilnu thc row henclings ,Ire \"lev~la~~, \"pl. nestl or 'Irr. ~~eworks gf the VG3s. Each entry then represents a l~cstc~,ory'' of m?rbs which sxtisfy column- and row- (and further di:xens.+imn- ) values. Conceptual :+GI's as introduced in the prevhns section are also subject to uetinition in terms of his matrix. ~di's re considered ta be sufficient 2s e basis for describing all actions underlying langucgc, sraless of hoo this action is expressed in a p rticular t#npu~l:;e. Wr inst:ince, the ACT 114TLUbt underlies the verbs 'tell',"]},{"title":"'forget ' and other 'verbs of mental transition. It is these primitive concept8 rather","paragraphs":["than"]},{"title":":my snecif ic lexical verb which will be retrieved from the matrix as output of an operational metaphor routine. 2.1, Levels The four levels postulated for vcrbnl concepts are: PIIYSJCAL (e.g. 'touch1) mNT& (em& 'think'","paragraphs":[") SENSOR' (e.g. 'seet) CONTROL (e.g. 'donate') The"]},{"title":"PHYSICAL Level includes verbs which predicate the existence, attributes or associations of objects","paragraphs":["with spatial"]},{"title":"(material) aspects, The PENTAL - level is distincf in that on this level ere representations of objects, or of other representations in a recursive manner. It is thus the level","paragraphs":["through whlh"]},{"title":"thought and communication take place. Verbs of thought have been analyzed in (8). Since","paragraphs":["l;Ch'T& objects are"]},{"title":"not real-world objects or situations, but rather pointers to such objects, they cannot be concqtually dependent on non-3ENTAL concepts other than (usually","paragraphs":["human) mental processors. The SENSORY"]},{"title":"level includes VWs of perception, or the reception of %utgesl1. Concepts on this level prnvi.de the link fr~m the physical world to the consciousness of a language user as well as to","paragraphs":["other animate beings. SEXMRY"]},{"title":"concepts could be analyzed in PHYSICAL (spatial and temporal) terms. However, this kind of dctail seems to have little relevance to the linguistic groblbms","paragraphs":["under considerhtion. The CCNTRLL"]},{"title":"level refers to relationships which express possession or","paragraphs":["corltrol by"]},{"title":"an animate being. An object on","paragraphs":["this level is a form of control, or a \"potential for actionfr. CONiiiOL mRBs basically consist of conditions attached to the actions of an animate being and are sometimes ewressed lexically"]},{"title":"through modal auxiliaries, for example as 'can', 'may * or 'must *. Possession defined as a","paragraphs":["CONTlWL relationship is thus distinguished from purely PIIYSILiL or locative ralntionships."]},{"title":"The verb 'have (a","paragraphs":["physical object)',"]},{"title":"for example, is defined in terms of the","paragraphs":["CON?R\\L Level rather"]},{"title":"tbn","paragraphs":["the PHYsICAL level."]},{"title":"Each of these levels has a few sublevels (e.g. SENSORY: eye, ear) which are sometimes specifically referenced in metaphorical extensions. These are described in (5). 2.2. States Given the matrix format of the verb descriptors, the specified levels (row components","paragraphs":[") can best be clsrified by conoiderntion of the Its implestw structure (column component) as it applies on each level. This structure"]},{"title":"is referred to as a","paragraphs":["STATE or as a ST.iTIC structure, and represents in general terms \"existence, with or without an nttribute, and with or without association with another objectft. ST.iTBs are presented here"]},{"title":"in two forms","paragraphs":["which represent the '+I and"]},{"title":"*-* values of one of the \"featurestr (Section 2.4) which further dif fercntiate VERBS, These two feL~-!. urc v lues are termed uactual?t and \"p~tential\", according to whether the given STATE has the feature value '-HY~othet ical or '+Hypothetical '. STkbEs in these two forms represent primitive concepts to which","paragraphs":["further feL!tures can be applied to obtnin more complex"]},{"title":"VERBS. &n explanation of verb entries which are ex~mples for the two forms at various levels should give some idea","paragraphs":["of the scope and basis of the verb on.4ysi.s. Space consideratiuns limit the discussion to two levels."]},{"title":"If other feature values arc ignored for the moment, -/+~~~othetical STATES can be thought of as the first two colums of the matrix. At the EENTAL level we have:","paragraphs":["ACTW POTENTIAL Percept ion 0-Preuiczt ion:"]},{"title":"R think SUN: believe OBJ: know VAL TV=+: be true","paragraphs":["cont, ACTUAL POTENTIAL"]},{"title":"R en joy","paragraphs":["SUBJ: like OBJ: appreciate 0 be in CP please VAL AV= t :"]},{"title":"AV=+","paragraphs":[": bc nice \"be funtr Volition"]},{"title":"R 0","paragraphs":["VAL"]},{"title":"DV=+: be good (to do)","paragraphs":["The BLRTM, level is divided into two sublevels to correspond with the faculties of perception and vulitioc. Perceptian in turn has two forms--the predicction"]},{"title":"-_ _ _ __- of the existence of the - Object,","paragraphs":["and the valued perception of a presu~osed Object. Only the former type is examined here."]},{"title":"It is first noted that this","paragraphs":["and each sublevcl allows for an"]},{"title":"R-, 0- and","paragraphs":["VU-form or' a VLB. 0 = Object, R"]},{"title":"= Recipient or experiencer","paragraphs":["( \"loc~tion\""]},{"title":", \"sollrcelt or","paragraphs":["\"goal tt of O), dnd VAL"]},{"title":"= VALW of 0.","paragraphs":["The labels R, 0 and VXL indicate whether the lexical entry which n~ps into the slcts headed by these lzbels expresses a verbal concept from the pcint of view of R or 0, or expresses a value 02 0. Syntactically, the \"point of view\" of R or 0 is reflected by a verb having a noun ~ith'~'role\""]},{"title":"R or 0 respectively","paragraphs":["as syntactic subject. For cxLlrnt?le, the R-role 'see corresponds tb the 0-role 'appear1. If no verb for o given slot comes to mind, a phrase is given which s imply ref lscts the conceptUcl representation of this STrdE. Thus the O-role entry corrcspondlng to tbelievcl is tO<=propbsition) be in"]},{"title":"- Long I Term - f.kmoryl. The vnlue iml-,osed by 'believet on the","paragraphs":["Object, which for this sublevcl is a Truth Vnlue"]},{"title":"(TV), is positive","paragraphs":["( *+ ). Verbs or predicate adjectives ip the 'VdW row express a possible value of the Object as onposed to thc relrtionship of the Object to"]},{"title":"on R which is givcn by 0-role vcrbs. Uthough the verbs and adjectives given as examples ~11 presume a positive vnlue of 0, other degrees of positiveness on the vaLue scale could underlie othrr vcrbs or ad","paragraphs":["jcct ives. For instance, 'be indifferent to' means that the bject lies midway between the"]},{"title":"'+' arlu -","paragraphs":[".I) Attitude or"]},{"title":"- Aesthetic vdue for the expcriencer. aince a","paragraphs":["IENTrlL aT.bE expresses an attitude townrds a IvENTAL object which may or may not correspond with that of 'loutsiue observersf1, verbs may express cither a SJBJect ive or an 'OBJective* MENTAL STATE, as shown. Th~t is, a speaker says 'he knows that.."]},{"title":". ' to mean 'he believes","paragraphs":["that.."]},{"title":". , and it is true '. The difference between the ACTUAL and POTLNTIAL columns can best be explained in terms of the present examnle. Generally, *actual1 refers to the fact thct the relationship underlying the verb is presently \"in operationM, lfreali~edv or wexpressedtt. 'Potentialt","paragraphs":["denotes that tllc object can be retrieved"]},{"title":"in","paragraphs":["order to create"]},{"title":"[In 'actual' relati L","paragraphs":["nship. Thus"]},{"title":"'thinkt in the sense of mentd activity ('think about') involves an l1activeW abject :md says","paragraphs":["<ornething about the present state of the thinking person, but 'believet or 'know1 represents a llstorcdu rather th'tn"]},{"title":"an active object. This diLierence is","paragraphs":["expressed through representation of 1; as CP (Conscious 1hcessor) and UIEi for"]},{"title":"'","paragraphs":["think an3 'believe respectivcly. There is no value ssigned to cl for this sense of 'thinkv, slnce o truth value is not assigned to a I.LE;T.~L object e:;cept in the process of rorning n bclief or making an assumption. The SL~?-~ORY level can be illustrated bficfly by reference to the rel,rcscntation of conccptual attributes in terr~.s of this level. 'Be jut"]},{"title":"if ul ' is","paragraphs":["dm'ined by prir-itivc components on the 'visualt sublevel: 'oE:'hOK\\; (cye) VAL:"]},{"title":"AV=+'","paragraphs":["or, 'a visually perceived, ac.;thetically positive attribute of an objectt. All three non-?:iYSIGJ, levels involve objects G which are non-mterial, i.e. not PPa. Rather the object is a form of inf ormction, inage or control for the IIZNTAL, SLYSOX and CONTR)L levels rcspectivcly."]},{"title":".JL","paragraphs":["of thebc objects, which night bt thought of conceptually as verb: 1 or attrizutive concepts, hove a l'relationshipU only to a true exeriencer"]},{"title":", i.e.","paragraphs":["an animate B. .it the r'hY&IC& level, on the other hand, R need not be animate. The PHYbXCAL level reflects only the physical nspcct of the relationship expressed by a VE1.B; R may h.,ppen to be animate, but the animate aspcct is irrelevant to khis lcvel. This rnezins thLtt 'have in the genr;e John has the ncwspapert is nssicned to the CON'IXOL lcvel rather thi~n to the PIT~~uAL. However, a IJIIYsItiAL relation-","hip, as exoressed by ' John has the newspaper on his head1 or"]},{"title":"'...in front of himt, could be derived 3s an inference of the","paragraphs":["CONTJiO L- level"]},{"title":"* have *. Representative verb forxs for LtlA.:\"Gs at","paragraphs":["the PHY,IL~AL level follow: ACTUAI, POTENT"]},{"title":"I& R have as part contain have on 0 be connected to be in be on be at be ne.tr VAL be almost be be -value> e,g. be red The","paragraphs":["R- and 0-VERBS correspond to relctions between PPs identified"]},{"title":"in (5) (IN, ON, AT, PRDX), whereas the VAL VERBS are conceptual attributes--PA dependencies on IPS, The ACTUAL/","paragraphs":["liQTWIAL distinction as described above does not strictly apply to the IJIIYbIC~& level, for in one sense all P:IYSIC;LL relationships are nactuellf. Fowever, an analogy suggested by this analysis in comparison with the other ltvels is discussed in (5). 2.3, Structures Structures reflect abstract ions of verbal concepts,"]},{"title":"i,~ clerncntn","paragraphs":["of conceptual states or actions which humans"]},{"title":"recognire independently of whether any","paragraphs":["matter or object involved is visible, A VEd structure consists of an \"ef~cct corn)onentl1 :md, if the concept of chnn~<e is inplied"]},{"title":"in tho","paragraphs":["Vd<B, a \"ccluse componenttt. If both 3 cause and, im efEect con~ponent are present, they are connected by a causal"]},{"title":"If: --as for lpiactice (for) '.","paragraphs":["EEiect structures causal link--"]},{"title":",,, toke one of the following forms:","paragraphs":["0 VAL --attributive bTLITE 1"]},{"title":"+c","paragraphs":["ST~iTlil( (new) --transition of loc:tiw? STATE STATER (0 ld ) STAl'EVAL (new) --tr,~nsition oi' ~ttributive STAiTE ST:LT EVAL (0 ld ) STATES, which underlie verbs sbch as 'think1, 'watcht, tc~ntrolt, 'havet and 'be', have been introduced above. In the verb definitiuns to follow, STATES are represented mnemonically as '(0"]},{"title":"AT","paragraphs":["R)' and '(0 BE)?"]},{"title":"or '(0","paragraphs":["BE (VAL): )I. The transition-arrow should reflect the assumption that language-users usdlly focus on a certain aspect of the chdnge uuality, e.g. 'start sthtet or 'stop state1, even though s toppi~g one state alw.iys me-ins starting another. Thus there are three types of change-of-state effects: a) TUNs.tTION (complete)"]},{"title":"mu 1: I--* b) start","paragraphs":["TRiNSITION (leave STA'IE) (TR-L)"]},{"title":"' I I-- C)","paragraphs":["finish TILINSITIUN (enter STATE) (TR-E)"]},{"title":", I-,","paragraphs":[".$ These structures underlie verbs such as a)"]},{"title":"'give1, 'pass to'; Features might be thought of either 1) as - each providing an additional dimension of","paragraphs":["thc matrix"]},{"title":"in terms of its set of vnlues or 2) as applying","paragraphs":["to structures"]},{"title":"in various combinations of vnlues to f om configurations of feature values. In the latter case, the ~~nfigurntions provide the values (columns","paragraphs":[") of one (horizontal ) dimension. In either case, the vnlues of the following binary features indicate whether a certain conceptual element is present"]},{"title":"in n VERB. The above structures implicitly presume n negntive value for all Eeatures except CONTINUOUS, which is positive (c.f. Fillmoret s l-bbmentary (1)). Explicitly stat& feature values expand the","paragraphs":["idormdtion given by these structures in a WkB descriprion. The fentures,witk"]},{"title":"'+' and -* examples, arc: +/- AGENTive e.g. break (vases)/(vases) break Hypothetical believe/contemplate SHARED agree/believe CONTINUOUS","paragraphs":["iivddie"]},{"title":"REP eated","paragraphs":["beat/nit VOLitional (voluntary) look/see"]},{"title":"TRY (tried without off er/give implied success) it is relatcd","paragraphs":["to"]},{"title":"the","paragraphs":["role specifiqntion of"]},{"title":"tlw","paragraphs":["vcrb a; dcscribed"]},{"title":"in","paragraphs":["section 2.2. The syntactic subject of +.IcYLNI'"]},{"title":"rcrb","paragraphs":["hns"]},{"title":"role","paragraphs":["L\\C;:;NT ,~nd thc ob jcut role ;i"]},{"title":"or O.","paragraphs":["The"]},{"title":"feature","paragraphs":["itself"]},{"title":"is","paragraphs":["clciincu"]},{"title":"in a","paragraphs":["rcbtrictive sense; +/&G ,i':ll refers to"]},{"title":",d~ethcr ':n","paragraphs":["qpnt"]},{"title":"which is external, i.e.","paragraphs":["other"]},{"title":"th..n L: or","paragraphs":["'ir,","I-Yl y\\ i.4"]},{"title":"involvhkb. 'thus ' tell ,mu 'give nrc + h (one who tolls =","paragraphs":[".\\GAZPT; recipient of inEonl<lti;n"]},{"title":"= h;","paragraphs":["infomat on received"]},{"title":"= O), but 'recall1 (in 1: e ucnsc","paragraphs":["ol"]},{"title":"'refi~cnber","paragraphs":[") 2nd ttalcet e -A (one w'lo rec~lls"]},{"title":"= one ~ho Mreceives!f = K; inf","paragraphs":["cirnl: tion lvreceivedll"]},{"title":"= 0).","paragraphs":["In order to know when vcrb sub~titutions along o vertical"]},{"title":"dimension 02","paragraphs":["thc n"]},{"title":"trix.","paragraphs":["c.m be mCde 'Fn~e.~ningfullytt, wc need a descripaion sys tat:\\"]},{"title":"for flNO?~IS.d.,s tt, i. c.","paragraphs":["concepts thnt serve as uobjcctslr at one of the pbavc levels, which governs"]},{"title":"possibilities","paragraphs":["of"]},{"title":"dcpcndtncies of these","paragraphs":["N~I%.IGLLS"]},{"title":"on the","paragraphs":["VaBs."]},{"title":"Furthermore, in ordcr to allow","paragraphs":["more Elexibility in h~ndling"]},{"title":"the inherently vo;uc","paragraphs":["problem of. what is"]},{"title":"neaningf ul, it is","paragraphs":["useful to refer to a tvo-level hierarchy oi Irdegree of rcs trictiveness in"]},{"title":"judging","paragraphs":["whether such depcndcncies"]},{"title":"re->resent nct~phorical","paragraphs":["phr, ses."]},{"title":"In the verb","paragraphs":["dei'initions, this infomation is given"]},{"title":"in","paragraphs":["term of s ~ecificotions on"]},{"title":"the NOMIN4Ls","paragraphs":["which a!)penr in thc dictiont:ry definition"]},{"title":"or the verb. The","paragraphs":["two dcgrres of retjtricti~n cre rnitrkcd"]},{"title":"'B","paragraphs":["(Broad)' and"]},{"title":"'N (Narrow)","paragraphs":["; the specifications the~nselvcs con,:ist of either sgeciiic Ncjla.IN.Ls or fe.ltures of NOhLNALs. Thc~e descriptors arc illustrated in ~ectivns 4 ~nd 5. 3.1. kieatures f e* turc-oriented system of clcscrl ption for NOl!lKi~s is described"]},{"title":"in","paragraphs":["(5). Hcre the defining elements"]},{"title":"LIL'","paragraphs":["NOIIINALs are presented without olaboraiion, merely to show the tcni~s in whicl~ NOT41K'iL de?endencicct on verb 1 eoncc~~ts nre-specified. ii configur:.tion of levels f cr SLIP IEJILLs htfs been devisê~(r:nch is not i.:cntical to but"]},{"title":"is","paragraphs":["rcllitcd to that b,tfllY~IXL, TIM,,"]},{"title":". Ilowevcr ,","paragraphs":["for chis Limitea discussion, VLU3 l~vels rrill be ns.;umrd for NQbIIN,Ls, with The feiitwes arc presented"]},{"title":"in","paragraphs":["three groqx, altholrgh this clividion is not significant to the iimlementntion of the theory. The first groun expresses t opo1o:~icnl or b .sic physicd properties :"]},{"title":"+/-","paragraphs":["PART roof, step"]},{"title":"/ house,","paragraphs":["proof bWPE rainbow, idea"]},{"title":"/","paragraphs":["log, geograql~y CONTAIN shoe"]},{"title":"/ pencil FIXED","paragraphs":["field, tree"]},{"title":"/","paragraphs":["bira, ball 1-UII~WbiONAL fence, streak"]},{"title":"/ ball,","paragraphs":["flash 2-UIIZNSIUN.~, ocean, tL:ble"]},{"title":"/ pole, st","paragraphs":["tue FI;UID trpLurr:llr concc~t, river"]},{"title":",","paragraphs":["(some) time"]},{"title":"/ ice, moment-It","paragraphs":["might be seen by the examples given that these fet:turcs arc considered :I, rbbstrnct !~rcopcrtics which i?nb c:;ten.~e\\. to levels other Lhl1n tl~c 1'IIYdIbJiLr Thc u~contl group c~nsi~t:; of: +~~mtiN will bc c'lns idcrod t o itnpl:; +.'iXliAi11'2. 1'h~ third group iocu,,cs on thc \"n~~::.ninC;\" of a conce;-t rsther than on an, objective properties:"]},{"title":"+/-","paragraphs":["LIE k.y"]},{"title":", motor,","paragraphs":["story"]},{"title":"/","paragraphs":["boy, stone U~TNAI~IC boy, motor, story"]},{"title":"/ key,","paragraphs":["stom The uYNLUAI(: featurc refe-*; not to the rcsencc or ~bsence ol;: rn~ ving part;, but rather to whether the concc~t has some kind of l~continuous existence\" by ~taelf, sther than mere spatial presence. The dif fcrence between 'story"]},{"title":"' and 'motort t on","paragraphs":["one hdnd and key on the ot'lcr is th~t a key is an inert object nr71ich is used ~-,~ssivcly for D single o .erntion, .fter which it .iguin becviacs mcrel a *~iece of ncta2. A motor (like an cnimcte being), once stnrtcc;, r3pe:rs to function by itself. Likewise, o story cnu in fact m-st mcntnl concepts can be thought Q as having an efeect or ltcontinuous functionn for those peo;,le who come in contact with these conce-ts. ThL significance of this f eciture is suggcstca by the m~ny cases in which peoale s ~eak of +UYN.tUiIC concepts as being \"al;Lvetl or effective in t hemselvea, These features are all essentially binary (1+1, t-t) with a possible variable vnlue ('?' ) for sum features. The 'FUELt feature, for example, is ltv~riab.bleu. A flower is +FlXEU"]},{"title":"in its natural state, b","paragraphs":["ut -FIXEU when in a vase or"]},{"title":"in many other circumstnnccs. 3.2, Function descriptor8 In addition to","paragraphs":["c~nccptual features which aetern~ine the thcre are specific non-conceptual function associ;\\tions which apply to may NObiI&sIs, especia~ly +bLii~bE ones, which serve as dcrining elements. Also ''sizeM criteria for dependencies arc recognided in the form of a 0-5 scale vL.lue for physical objects. Although these descriptors ore more ilnnortont for problems not dealt with here (see (5) )"]},{"title":", they also enter the question of metcphorical interpretations.","paragraphs":["iior example, the knowledge thL:t the functions of both a ship o tractor in-cluue the notion of 'goingt or 'movingt is of use in recognizing the substitution of ip' ior 'tractort in 'the ship plowed the seat vs. the Liternl 'tile tractor plowed the field'. The function can then be incorporated into"]},{"title":"2n approximation of the mekning of the former exarn~le. aeveral types of function have been identified, according to the conceptual roles which the object plays in the action which represents the realization of","paragraphs":["this functi on. The type which is probably referred to most extensively in metaphorical intetpretations is l-GXTMN L1, meaning that the functional object appears as an qxternal (to the actor) object in the conceptual representation of an action which serves as an"]},{"title":"instrument","paragraphs":["to some rasult. In this experimental inq~lcmcntntion an clbbrcviated"]},{"title":"functidn","paragraphs":["rc~rascntntfon is used:"]},{"title":"'kni~e (EN: T","paragraphs":["(cut))'. Method of Interpretation r\\s imintcd out nt the bc::innin=,"]},{"title":"of","paragraphs":["this paper,"]},{"title":"if n dofinition of","paragraphs":["rnetb~p!lor it: restricted to include only thse"]},{"title":"usages which strike","paragraphs":["the speaker of the ,ivcn 1nngun;:e as p,>etic or colorful, that ucfinition will be uous"]},{"title":",","paragraphs":["for lansuage is constantly changing with rlapect xo what is-considered \"originr.1\" vs"]},{"title":". \\ghat is an established word sense","paragraphs":["or idiom. This phen.menon c~uld prove to be a quandary for anyone defining verbs or other lexiccl items for entry into the dictionary. 'rhc L-uastion af 16a: s~nse of il verb is literal md wt1.d is metaph~ric~~l can be cmectec to vary not only from one individual to another, but also over time, In order to alleviate this problem, it is suggested that a definition 02 a metaphorical us~:ge include any verb which is \"borrowed\" from arrot\\er level, whether or not speakers are still conscious of this borrowing. For instance, the word 'destroy' is easily conceived of as applying tc all levels ('destroy house, image, idea, privilege )"]},{"title":". IIoweVer,","paragraphs":["t Flis system ass ips it to the PHYSIWL level, from which it can be borrowed by extension to other levels. A verb is simply always deLined as applying ltnoru&llylt only to a certain base Level (which"]},{"title":"in case of dbubt con be considered to be the PHYSICAL level, if","paragraphs":["that level"]},{"title":"is one of the alternatives","paragraphs":["1. A human editor wed not"]},{"title":"worry about whether usages of the verb at other levels Bra metaphorical. Thus","paragraphs":["the proposed procedures"]},{"title":"rest on the. essmption that the ltmetaphorical senseM of a verb is not in the lexicon as such1 the semantic component should exhibit the analogy comprehension of humans, who do not need to hove such senses explained to them. If we accept that analogies refhr to the sharing of a conceptual component, and are therefore reflected in our tllevelsv, which share one or more columns of our matrix, then the most significant way in which the verb description system can be applied is evident: glven e verb which is defined in","paragraphs":["the rn'itris by ~?n entry ig a"]},{"title":"given","paragraphs":["column"]},{"title":"(structure) and row [level), a metaphorical sense of this verb is represented by a Vm with the same strwture but a different level. This type of extension can be referred to as \"level shiftu. A second type of extensioqwhich abstracts the effects of animate acti~ns and applies them to inanimate objects is aescribed in Section 5.4, 4.1. Cond-itions on metaphorical extension Identification of a meta;>horical usage rec uires the knowledge","paragraphs":["that semantic restrictions od che dependency context of' the verb as used on the base level re"]},{"title":"being violnteiL,","paragraphs":["but that this violation re!>rcc;cnts o. conlprchcnsible metaphoricLll substitution rot!ler than &In vanomalnusM case"]},{"title":"which must bc pasb cd to some subsequent routine","paragraphs":["for interpretation. In other words, interpretations ror mrtnphorical ex!~reslsions must satisfy ccrtclin notions of conceivL*bility, just as conccpts underlying liter.*l ushgea do."]},{"title":"In terms of depqndcncies hctween an","paragraphs":["object"]},{"title":",","paragraphs":["its location and/or its attributes as described above, the most im.\\ort<-tnt c~ndition for 'tconceivability\"l is that the IiENTAL and P!Xs IG-IL levels can never tPmixtl across the uepenuency links relrting an 0 and an R, though both types of levels rn,-y coexist in a P; which maps into"]},{"title":"one","paragraphs":["of these role-concepts (e.g. 'book1 )."]},{"title":"In","paragraphs":["other words, in my metaphorical usage, as in a literal one, some correspondence between the typea of comi~oncnts within a conceptnalizetion nust exist. in terms ofdsyntax, if a direct object is conceptually a 3I;NTAL object, thcn the verb must be either liZ3TAGlevel or used metaphorically on the iGWAZ, level. Thus the dependencies on r verb. 1 concept"]},{"title":"in a rnetaphoricnl use do not conform to the level o'f the verb in its literal sense. The noun which mat.$ into the","paragraphs":["object 02 a conceptualization determines the level to which other elements of the conceptualization conform. In genercl"]},{"title":", non-","paragraphs":["FIiYSIC,>L objects FIWD,"]},{"title":"on","paragraphs":["the other hand, is less im:~ortant than CoNTAlN"]},{"title":"in the dete mination","paragraphs":["of a met:r:)hcrical expression."]},{"title":"In juclg ~ng the consec,uences of","paragraphs":["the unccrtc~inty ~hich may arise"]},{"title":"in","paragraphs":["the definition of these"]},{"title":"criteria,","paragraphs":["tlnc should keep"]},{"title":"in mind","paragraphs":["that the aistlnction between c rnetaph~ric~ 1 and"]},{"title":"an","paragraphs":["incornprehcnsible ex lression is also vnguc i:nd"]},{"title":"in","paragraphs":["Iborder-"]},{"title":"line1' cn.:cs mcy vary from","paragraphs":["onc inuividuol to another. The problcn"]},{"title":"in language","paragraphs":["understanding is more oftcn to l'ind an interpretation rather than to esclude tlstmngew constructs. h lexicon editor, theref ore, may In cese cf doubt rezm nably adopt a policy cf minimizing the 'Broadt restrictions on the NOhINtiLs potevt ially dc .endent on r he verb which is"]},{"title":"being ue~ined. A","paragraphs":["related probl-ern of definitmn is t'7.e inker-3rctation of the feeturos"]},{"title":"in terms of","paragraphs":["which rhe forcgoin~ restrictions =ire ciefined. 'l'he meaning 01"]},{"title":", .e prcscntcd features has been","paragraphs":["brierly describecl for the PtIYalCj\\L lcvcl; a m~re comdcte","interpretation of at ese fe, tures for other lev 1s should eventually be concisely ddscribed. For exam le"]},{"title":", at t","paragraphs":["-e PHYSICAL level ttlere is a Listinctionbetween 'contain' in the sense of 'surround' and 'containt in the sense of 'consist of'. At the IEhPTAL level these senses merge, or ratiyer the former sense seems to lose is relevnncc. In addition to the abovc criteria, there are sen~antlc criterL1 governing t!~e \"tar~cir re->rescntztionw ~?b.lch ensure that"]},{"title":"the","paragraphs":["interpretation"]},{"title":"given","paragraphs":["as output"]},{"title":"satisfies the general requirements of","paragraphs":["conccp"]},{"title":"tual","paragraphs":["dctjendcncy for"]},{"title":"any conceptual structure. Sincc these conditiuns are not","paragraphs":["peculiar to the"]},{"title":"problem of","paragraphs":["metaphor itszlf, it is noted here only thnt two"]},{"title":"labels exist w111ch ini~icate","paragraphs":["Ithow seriously"]},{"title":"such criteria","paragraphs":["must be takentt."]},{"title":"The so-tisf nctiun of tunc~nditi~nal criteria ind icntec thnt the resulting","paragraphs":["interprc t ntion should bc"]},{"title":"accepted in","paragraphs":["any cas& 'Condition.11 raieru to"]},{"title":"criteria which support a","paragraphs":["\"last"]},{"title":"resort\"","paragraphs":["interl)rctotion--an"]},{"title":"interpretation to be considered if no better alternativ: s ,Ire available to","paragraphs":["the parser. The"]},{"title":"in lemented","paragraphs":["~~rocedurcs~ do n,?t yet exhibit this"]},{"title":"discriminntioh in their output.","paragraphs":["4.2. Operotiunal context"]},{"title":"%he parser with vrhlch","paragraphs":["the n~ctnphor interpretation procedure is intendcd to f unction (Riesbcck (4) ) operates"]},{"title":"on tl-e basis of scmantic expectations. To a large extent, the.;c expectations are","paragraphs":["concerncu with finding"]},{"title":"in","paragraphs":["the sentence being pdrsed an object which conf~ms to basic sem: nric"]},{"title":"re uirements ~ovcrning t'-e depenuenc of that","paragraphs":["object on a verb which has appeared in the sentence."]},{"title":"If there is more than one possible scnse","paragraphs":["of t .e verb ~~hich has b een found, the choice of sense depends on what kind of cn object"]},{"title":"is","paragraphs":["founc. This object is described by a few fer-tur:.s such as PHTISZCAL and ANILTE. As the perser presently is uphysically orientedM, expecting physical objects for verbj which"]},{"title":"ordinarily are interpreted in a physical sense, it is not able","paragraphs":["to find"]},{"title":"nn","paragraphs":["interpretidtion for e::tondcd us.il;cs"]},{"title":"in which","paragraphs":["the only candidate for"]},{"title":"on object is","paragraphs":["non-PHYaICAL. l~ore smcif icnlly, appose that the parser finds the verb 'dropt i.2 the course of a sentence analysis; that only"]},{"title":"one sensc QL the verb is given in","paragraphs":["the diction: rynpnrt from"]},{"title":"idiomatic usngcs such as 'drop someone o line'","paragraphs":["; and that the"]},{"title":"rniniwl requirements","paragraphs":["for its object incluLLc thc. specification 'I?HYSIG.LL~."]},{"title":"If this restriction is not satisfied,","paragraphs":["the porser must turn to the metaphor routine for an interpretation. Thus"]},{"title":"if 'ideai","paragraphs":["vere the only candidate for an object of 'drop', the parser w ould note thc t c PHYSICAL-level specif"]},{"title":"i-","paragraphs":["cation (which could be represented as a +I)IIYhICAL feature-"]},{"title":"value) is missing","paragraphs":["from the definition of *idcat. It would then chcckwith the metaphor routine, passing as information the c'indidnte for an object ('idcat), the verb sense of 'dropt which would have been selected, had the object possessed o +PIIYSICJ, feature, and any potential dro~per, source and/or goal. As output the metaphor routine returns a representation for each"]},{"title":"level","paragraphs":["at which the verb can be interpreted. 13is representation, w'iich is based on the serncntic components"]},{"title":"o=","paragraphs":["introduced in Section 2 ('TR-L (0 AT R) (VOL"]},{"title":"+) ... , 'idea', R is","paragraphs":["+ANITWTE, e.g. 'het), provides the information to build the corrcc t conceptual structure (or to form"]},{"title":"im","paragraphs":["o?pro::im te paraphrase according to"]},{"title":"t *o crop m","paragraphs":["ucscribcd bolo;:J. ih:lt"]},{"title":"i, this","paragraphs":["informxtion cont:ims"]},{"title":"mc trix","paragraphs":["ilimcndion l,ointer; \\: icli lcitd Lo he catc' ory oi the inv lvcd oci:ion or bTAit~'t: ;.nd to thc .rJT or conccptucil notiition vhich underlies thi:; action or S'l.rTS rr:;pccLivcly. For < ur ex: mnplc, ij\\c"]},{"title":"und, ?lying","paragraphs":["conceptu;ll information nssociatcd wit11 the nbovc scm"]},{"title":"ntic","paragraphs":["coml3oncnt s at the IblA:li'i~L lcvcl u detcrmined he (-9 ~~~'ILLNS idea t Or, the climinc3t ion of a cotnpuncnt of the $1 ;WJ'AL STLiL' of :in inuivi~ual. (Additional notation reprc.;entinz she concc7t underlying '+VOL1 is discussed"]},{"title":"in (7).) 4.3. --","paragraphs":["p~neral procedure The g enernl. nctl~od \\.E thc metaphcr routine for understondin:, 1.1et~lph~~rical expres ions c n be spccificd as f ol~ows. Thc routine cxamlnes th~"]},{"title":".;","paragraphs":["emL~nt-ic descril~tor:; of the illis scrnantic inf omction c-:nb e obtained directly from the diction .ry entry for that verb, or indirecrly in case the entry is re!~resented in term of another verb and certain f cature va1uc.s. It notes the s;~ecif ied NOBIINAL dependencies, including the 'Narrowt s~ecifications on these NOIIIR .Ls,"]},{"title":"if any.","paragraphs":["The sat isf action-of t'lcso specif icatisns by the NuPI~NALs which actually occur"]},{"title":"in Lhe","paragraphs":["ini~ut would indicde th,-t C-I bcl;e interpretation is available. ;'he routinc thus contains the capability of determining such intcrprctations; howcvor, in actual 017cri1tion it will be nlisurWd that the parser 1) has unsucccssiully checked for t hc :?ossibility of base intcrprctaticmz bcf ore turnins to the mt.,phor routine, or 2) has found n b.lsc rctprc.;cntntion, but is intcres ted"]},{"title":"in ,mss","paragraphs":["ible t~letnphoric~ll interprct:rtions. Case (2) reflect$ the fdct rh,lt the idcntificxion of a base intc;.pretction ~rccludes cnonaly buc not the possibility that a m~tnphoric~ll interpretation was ;c.ually-intended. This is pL~rticulc:rly likely"]},{"title":"in the case th,:::","paragraphs":["the NZllIN Ls involved have features which ?lace than on nor2 than one level, with the metaphoricnl levdl being more lrusunlll than the base level. rm exilmple of 1 type to bc considered is tGuropC and hcrico ore drifting apart"]},{"title":"(. In","paragraphs":["either CDSC, the t,:sk of the routine 1s to determine,"]},{"title":"on the bnsls 02 the","paragraphs":["zuidelincs of hecCion 4.1, whether there are rL~etap'i.~riczl internretat Ions Lor the g"]},{"title":"iv :n","paragraphs":["inl>ulr, and, if so, to return r e7rcs~-ntations i t en. Intenretations for all possible levels should ultirxtely be ziv-n 73riorities. No del'initc met'lod has been stabllshe~~ tor detcrrnining priorities in i~olztion from the context of discourse. Presumably such context vould bc thL dommating fcctor m establishing the lev21 of the expression. T -us"]},{"title":"if the ncti ns of","paragraphs":["hmns are bein discussed, t+.uropet would be interpreted"]},{"title":"in its","paragraphs":["institutional or AN1M;X sense rathex than its geographical PHYsICAL-~~V~~ sense."]},{"title":"If the expression is accepted as","paragraphs":["metap'1oric.11, its meaning"]},{"title":"remains to be","paragraphs":["repre.mntcd. In order to a rrivc at the verbal c onccp t which expresses i he tteefect 'I underlying the analogy amploycd"]},{"title":", the ramgram uses t","paragraphs":["l~c s tructural o"]},{"title":"loments underlying","paragraphs":["the input verb as a ltroadmnpi' through the tnlltrix to obtain the corresponding target verbal concept at the t~esired levcl. That is, the structural elements or feature values cim b~ thought of as vclluc; of dimcnuions of the"]},{"title":"matrix which specify an","paragraphs":["entry. This entry, which may consist of"]},{"title":"a 7rimitive AC1i', for exzmple, con then be inserted","paragraphs":["into the representation which gives an zpproxirnti~ion of he"]},{"title":"meaning of","paragraphs":["the phrase."]},{"title":"dong with","paragraphs":["structurcll elements, any magnitude descriptors present, i.e. rULUNT or INA ..UaI1lY:"]},{"title":"> , < ore carricd l~ver to","paragraphs":["the targelrepresentation, since it is ire uently these companents which ;re Socused on in a mt:taphoric.J expression ( 'he jumped (IidLIZjITY:"]},{"title":">","paragraphs":[") to conclusionst ). However, the program reterred to here doe; not yet include this mec!~anism. 4.4, Operation of routine The procedure to be described has been irwlemented in"]},{"title":"an extended version oi","paragraphs":["F&TRHN IV, which wal the only language conveniently accessible at the time. me outline given here represents the rocedure nc~ually followed"]},{"title":"in","paragraphs":["the"]},{"title":"implemcntntion, which was","paragraphs":["dcsi,gned"]},{"title":"only","paragraphs":["Lur test a)"]},{"title":"Input:","paragraphs":["Yhc"]},{"title":"in,>ut: con~ists ol: two or thmc lexical items in","paragraphs":["Lheir \"roottt forms"]},{"title":"in the","paragraphs":["order"]},{"title":"'noun verb (noun)'. This","paragraphs":["group regrescnts a synt nc"]},{"title":"Li~ conr'igurat ion","paragraphs":["d~tcrmincd tcntotivcly by the pnrsor as 'subject verb1 pr 'subject verb object"]},{"title":"'. In terms of roles, the first case","paragraphs":["may re2resent 'AGENT VV.LGt or '0 (OBJECT) VLABt; the second"]},{"title":"VB 0 or '0","paragraphs":["VUG"]},{"title":"R","paragraphs":["(S~WC or GOAL)*. Theoretically, then, the entire role conf $swation 'AGENT WRB OD JCCP &3;11R08 and/or GO&' need not explicitly b e provided for"]},{"title":"in the","paragraphs":["fnput, since t'lis configuration is covered by the two component configurations just"]},{"title":"given.","paragraphs":["b) Dic~ionary definitions : First, the ucmnnric definitiom of all items are retrieved from the uictionary. Examples :"]},{"title":"(noun) ship ((PIES) T -1 (GONT","paragraphs":["+) (1"]},{"title":"-1 (XU","paragraphs":["+) (2D"]},{"title":"-1 (S&iPL","paragraphs":["+) (SILZ 3) (FLUIU -) (AN111 -) (>a1 +)"]},{"title":"(FN: EXT (sail) 1)) (verb) plow","paragraphs":["((PIIYS) TR-E (bTATZ (0 BE bTJ 9E: )) (.G.,NT +) (WLE 0) (I?'STR: TLIXST.&sTE (0 AT K))) (0 (hBW land) (BRU (2D +) (FIXED +)I) )) Control is then gassed to the 'subject verb1 (SV) or 'subject verb objectt(SV0) routine for determinction of roles. C) Roles : At this point of the procedure, roles to b e assigned are only temporary; a test for the lfR-O switchTr type of metaphor (Section 5.3), for mnstance, may determine thct the role configuration ex,)ected on the basis of syntactic informi~dion has been altered"]},{"title":"in the extended use. The tentative ro1.e~ are assigned","paragraphs":["nkcording to role informat &on !;hen in the definition"]},{"title":"OX the verb: FO~ SV: Role oi verb (F; or 0) is assigned to subject. -","paragraphs":[".L I) For SVO:"]},{"title":"If verb is","paragraphs":["+AGXNZ':"]},{"title":"-","paragraphs":["AGdNI'"]},{"title":"is assigned to subject and role of verb is assigned to oFjoct. - - If verb is -AGENlt: Role","paragraphs":["of verb"]},{"title":"(K or 0) is assigned to subject and the","paragraphs":["'tither role (O or B respectively) is assigned to"]},{"title":"- object. d) ~nterpretations:","paragraphs":["Control is then passed to other routines, depending on which role configuration is present: RV"]},{"title":"ov RVO OVR Am AVO These routines return any","paragraphs":["interpretations found, a ccodin;, to the criteria to follow. In this version the interpretations are expressed as pseudo-paraphrases, i.e. p.lraphrases which ignore certzin syntactic details such as word suffixes and tenses, in order to allow for some measure d judgment as to ;he extent to rhich the meaning of the metaphcricel phrase is captured. However, in actuzl operation, the target representation will be a c-0ncc~:tual one, which co~ld be operated on by a dialogue program or by a paraphrase program 4.5. Tests and criteria The following test:̂with corrosnoncung criteria for appli-c,ition ern{ for success represent procedures which hme been in-plernented. Each test (b through d) refers to a certuin type of metaphor 03 shown. Tho discussion of relev"]},{"title":"nt exk mnles in the next section complements these speci~ications by bdicating the","paragraphs":["rationt:lc used"]},{"title":"in the","paragraphs":["oprjroech to finding mctnphoric 1 interprctations. .\\ teat for n b~se-lcvcl intcrpr~t~ction (a) has been inclurred for ilurposes of cort~parison with examples seen as either metaphorical or (with respect to the given toot ) anornolous. a)"]},{"title":"- Base Level (alrunys","paragraphs":["tried) 1) All EU'CHIEAU are consistent with bnse level of verb, ie. : level of 0 is base level of the verb; R for any -PHYSIC.iL verb is"]},{"title":"+","paragraphs":["iBIi -.Ti3 or has an .WIE,L~TC function (e.g. co~~uter') ; R for any +pW6IC.L verb is +,FYoIC.rL; 2 ) A11 NOELINHLS fulfill Narrow specifications found"]},{"title":"in the dcf","paragraphs":["inition OF' the verb.","Interpreted: IIe drank the ink The ship Lisintegrntcu","Not interpreted: The chzir arsnk the ink He closcd his mind b) Intra-\"level (PWalCAL) Feature Shift (tric~ lf cll items have PZIY,ICld, level, but base interpret tion fL:ils): Actor-fecture shift : 1) Verb specifies +ANIU. TL fe~ture for R; 2) R is +PHYaICsL but not +ANIMATE; 3) 0 Eulr'ills *Narrowt specif ioations found"]},{"title":"in verb","paragraphs":["definition, or 0 is absent. Interpreted : The ch~:ir drank the ink Not"]},{"title":"inter~~reted:","paragraphs":["l'he ship plowed the sea ~b jeer-"]},{"title":"f eaeure shift","paragraphs":[": ~ubject and object"]},{"title":"fulfill","paragraphs":["the 'Broad'"]},{"title":"but not necessarily %he 'Narrowt spoc ificr","paragraphs":["tions by verb"]},{"title":"definition, Interpreted","paragraphs":[": The ship plowed t"]},{"title":"hc sea","paragraphs":["The"]},{"title":"skier plowed the sea","paragraphs":["(Thc 'Broad1 specification for the subject here"]},{"title":"is ltsometkiw which goes\", i. e .","paragraphs":["\"something which"]},{"title":"changes","paragraphs":["location:"]},{"title":"'TR (0 AT","paragraphs":["R)"]},{"title":"' .","paragraphs":[") interpreted: The ch~.ir p',owed the sea C) Levcl Shift"]},{"title":"(from","paragraphs":["MIY~ICAL level only, at present) (tried for each possible level of the object"]},{"title":"when no base interpretation is","paragraphs":["found or"]},{"title":"icr","paragraphs":["all levels when input"]},{"title":"f ormht is (subject","paragraphs":["(+ANIMdL) verb)) :"]},{"title":"1) R is either absent, +ANIB;'iTE or an ANIbL.ZdE (Xnalieneble","paragraphs":[") PART"]},{"title":",' i. a. 4 PP 7ANIM TE~","paragraphs":["(IilART:"]},{"title":"<R +'IENTAL","paragraphs":[">)"]},{"title":"or <PP +ANIMATE>","paragraphs":["(IPART:"]},{"title":"(R","paragraphs":["+~;-.N~u.S>"]},{"title":"(eye, tta\\t, etc.) for","paragraphs":["~LNTAL"]},{"title":"and SXNSOKY leva s respectively; 2) R and 0","paragraphs":["fulfill 'Broad1 specifications by"]},{"title":"verb definition. Interpreted: He closed I~is","paragraphs":["mind Not interpreted: He closed his ~rosperity c') Category Shift (tried ::hen"]},{"title":"no base","paragraphs":["inter~retation is found): 1) O is some attribute of"]},{"title":"R or","paragraphs":["oL a lexically absent conceptu a1"]},{"title":"NOMINAL; 2)","paragraphs":["R"]},{"title":"fulfills","paragraphs":["condition tc-l*;"]},{"title":"Interpreted:","paragraphs":["~osperity disintegrated His indif ferenco collapsed Pro.qm5.ty"]},{"title":"came to the country Not interpreted:","paragraphs":["rrosperity was occupi~d Prosperity cimo to"]},{"title":":-he","paragraphs":["choir"]},{"title":"d) Level -","paragraphs":["Shift with R-0 Switch (tried when"]},{"title":"nc> base -- interpretation is found ur","paragraphs":["when implied source (goal) is not explicitly present):"]},{"title":"1) Source or goo1 (temporarily assigned","paragraphs":["rolc kt) has level bLNT\"U,, sF:Kx?&Y"]},{"title":"or CQKti'RGL; 2) Temporary 0 is","paragraphs":["+~ULSE; 3) Source or goal iulf ills"]},{"title":"' BroL.dv specifications for 0 given in verb","paragraphs":["definition. 1nterpretp.d : The country leapt t~ ?ros;\\erity Not interpreted: Thc chair leapt to ;>rosperii.y bme SC~IF~~S of interpretations are $hen"]},{"title":"in Figure 1, which rei)resents","paragraphs":["actual output."]},{"title":"In ut","paragraphs":["datci is ~ivcn in Figure 2. Particular details or' the procedures used ire given along with ciiscussion of these cnd other ex, mples"]},{"title":". s they occur","paragraphs":["in the following expositian cf the various types of metaphor. 5.1. Level shift Not 211 extensions are made from the PHYSIC& to the non-PHYSIC;& levels. The KNTAL, s ,NSOl.Y and CQXrRCIL levels sometimes serve nj a base irom which metaphorical extensions"]},{"title":"can be made. The examples which rollow indicnte certain extensions (eotnc of which have evolved into idioms) which can be made between levels. Some types of extension are obviously more frequent or interesting than others. Examples for specified extensions are: PHYSICAL - $EN?!&: He closed hls","paragraphs":["mind,"]},{"title":"Protests","paragraphs":["rained upon the"]},{"title":"govemmcnt, Euro!~o and America are dri~ting apart. Kohoutek's tail points to its origin. (.lmbiguous between PIIYSICAL and","paragraphs":["MENTAL levels. On M:NTALI level, a refers to 'in£orrnc9tion 2. bout Kohoutekls"]},{"title":"tail1 and 'origin* to tinformtion about origint.) PHYSICAL - SENSORY: Music floodcd the","paragraphs":["room. PHYdfCA"]},{"title":"- CONTROL: The privilege of cleaning","paragraphs":["the erdsers landed"]},{"title":"in his lap. Control of the situation slipped away,","paragraphs":["MLFlT&"]},{"title":"-","paragraphs":["PHYSIW: That chocolate didnt t agrce with me. SENSORY"]},{"title":"-","paragraphs":["MEW&:"]},{"title":"I searched for an cnswer. Let us x-ray this political party. SEIQSORY -","paragraphs":["CONTROL: Their rights disappeared one by one. CONl'ROL"]},{"title":"- PENT&: She offered him an idea.","paragraphs":["CONTROL"]},{"title":"- SENSORY: Her hat usurped his view. 'He closed his mind! appears in the output of Figure 1.","paragraphs":["The base--i.e. PEIYsICAL--definition of fcloset is one of the more complicated verb definitions, s ince the syntactic object is either a space"]},{"title":"- e an object containing the space (which is filled or eliminated), and its complete representation will not be discussed here. However, the \"effectw portion of the semantic representation ior","paragraphs":["tim scnsc in which the ~b ject is a space is th-t nothing can pass into or cut of the object containing the space. The rclev.~nt: portion oz the \"pass intoH internretiition is renresented by the nested ueLinitLn:","(close ( (PHYs) (TR-L) (STdL; ((iIYP +) Tk-E (S'I'JL'TE (0 IN R)))) {ROLE R) (riGdNT %)"]},{"title":". (R (NR\\T (0","paragraphs":["+) (BKD"]},{"title":"C (CONY +I))","paragraphs":[")). It is noted that the *HY2 Value refers to the i~otentiol charncter of the outemnost ST.iTE; the HYP vl\\lue fen. the innermost STATE is negative, honsistont with the obscrv~ition in Section 2.2 th'. t all pt~ysicijl relationships (excluding separdtion) can be considered ltactuallr. The role routine determines th\\ t, since *close1 is R-role, the uirect object of 'close"]},{"title":", i.e.","paragraphs":["'his mind l"]},{"title":", maps into","paragraphs":["R, But the base-interpret<!tion routine then discovers that ii is +MENTAL and not +WIalC .L as requireu by 'close'. The vroSr;im therefore attempts an interpretation ct the lAdX~' L lcvcl, she level of 'mindt. R = 'mindt is an ANIId1'L P (*he CI:.d'I': nind = +) in fulfillment oE criterion -1 It can therefore serve as a tllocation'' at the 2, :NTIIL level. 0 is unspecified in the sentence and thus does not impose any level- or other restrictions. In checking to see"]},{"title":"til-t the","paragraphs":["'Eroau' sl,ecifica-tions by *c~ose' are satisfied by *mindt, the progrm finds that 'mind does h;rve the +CGSI'-;IN fedture 2s require~l. 'fie verb can therefore be interxeted st the XENTAL level. The innermost structure--TR-E (STA.\" (0 .Z R))--is extracted and the ~.:ZNTIIL level is substituted for the Y\"HY,>IC&* The absence of 8 VE~~UC indication is interprerea as + The 4s ttroodmapw through the matrix ort ti on given in ~~iigure 2 then consists of the dimensions r 'EUNTiiL (lcvcl) P, (sublevel) R (kol*) SGZI'E (structure) -1HP (feotura]"]},{"title":"+ (vLLlue) '.","paragraphs":["For purposes ~f pi~r.~nhmsing directly out of the matrix, the entry re-sultins from this s o,.rch is the hnglish verb v think1, which x~ould corres!~ond to a concq)tuc~l structure 0 (=> ~,L~LOC: (Cp(K) ), i.e. be (mentally) located"]},{"title":"in the conscious processor of","paragraphs":["Kt. kith closer attention to the sublevel(s) of vmind', a more specif ic e%yression could be deternitled. For instance, an association of both the P and V sublevrls with !tnin(J yiclds 'think about- the truth of.."]},{"title":". *","paragraphs":["and"]},{"title":"'","paragraphs":["thinlc about doing.."]},{"title":". '.","paragraphs":["In order to complete the parilphrase, the progrcm assumes thiit ther hds the silme referent as and notes from the clef inition of 'mind1 that 'mind1 is an IPAR'J! of this referent. It then picks up those conceptual elements uf tcloset other than those describing the innermost underlying aT4%TE--(TH-L aT.bE (IHP +) 'SR-E)--and submits the entire list of elements (he (IPART: mind) Tit-L STATE (HYP +) TLE think) to a simple mapout routine. This gives the rlparaphroselr 'he (Ii'AIRT: mind) STOP WSSIBUXTY-OF START thinkt. An actual generator could arrive at paraphrases such as 'he stopped thinking"]},{"title":"'. 21 correspondtng 0-role interpretation would be","paragraphs":["'nothing ccn stcrt to b e"]},{"title":"in (i.e. enter) his mindt, which is also a reasonable approximation. The aspect of tclosel whieh implies","paragraphs":["th~t ncthing can leavc rather than enter would yield 'he started to keep everything in his mindT. This might be uwerstood- in terms of not forgetting or not expressing oneself. The inability of the described"]},{"title":"-","paragraphs":["method to identify exactly which meaning is intended is the price of its objectivity and flexibility"]},{"title":"in being able to arrive at an","paragraphs":["interpretgtioi~ with no previous knowledge"]},{"title":"of what such phrases refer to in a givcn culture. In this respect the model represents the","paragraphs":["abilities of o Language-user who is"]},{"title":"unfamilinr with the idioms","paragraphs":["of the s?eskers of his"]},{"title":"environment. 5.. 2. Category silift A \"category shiftu refers to the","paragraphs":["feet that instead of a PP or a conceptual NOMIN L, an attributive or verbal concept"]},{"title":"in the form of a","paragraphs":["noun appears as the concept which has been assigned role 0. liore specifically, these concc,~ts are either l'conceptual attributesu (of objects) as repredented by 'color1, 'truthi, 'bec.utyt, 1"]},{"title":", etc., or attributes of aninxtte 11s \\;hich","paragraphs":["r.~ight be described as iLhTAL-, bENSQ1-Y- or CONTROL level VEKBs in which the focus is on R rather than on the relctionship between"]},{"title":"R and some 0, as represented by tconfitiencet, !perception ', 'pos;ession', etc. t;etnpl~orical uses involving either type of concept often involve level shift, as in 'its vaLue der'latedt or 'she","paragraphs":["built up his confidencet. In this sense they resemble that class of expressions designated simply as \"Level shift\". Also, the procedures for interpreting the (level- and) category-shift 'they decimated his joyt and the level-shift 'they decimated his version of the accidentt are similar. However, the designation of a cata2,ory shift allows for the interpretation of the metaphorical ?hLs smile disintegrated*, which docs not involve n level shift"]},{"title":"in the sense described above. In 8 ddition, this","paragraphs":["d~~sign tion preserves the theoretical distinct lon bctwcen"]},{"title":"'","paragraphs":["joy1 as an (anirnmtb) attribute and the NCMINtiL '~crsion~ ('story', otc.) as a concept \\:hich is isolated f Porn its anint te source, a distjnction which"]},{"title":"is reali~ed in the","paragraphs":["definition of 0 in each cade. Rather than being defined as a Nu~~~NAL, 'joy' or the noun *smilet is dcf ined as a noun with a bilsic VAB structure and level. NOMINAL fec~tures, which are not as criticL.l for non-PIIYdIW as for PHYSIC"]},{"title":",L NOMINALS, ore even loss distinguishabLe for attributes. The","paragraphs":[".&NIh TE feature divldes the class of attributcs as described abvvc; in general, however, feature v.ilues nrc presc~~tly ignored US possible rcstrictions on metaphorical uses of attributes. A few examples of clitegory shift in which the toi.ical focus is on an qttribute rather than on a human experiencer K, illustrate auditional points concerning metap'lorical inter~retations. One of the general problems of metaphorical interpretation is to show in the re wesentation of a phrase the analogy to a conceptual object"]},{"title":", as well as","paragraphs":["'%hat is re3119 happeningg\". Theb in7ut ex.irn,>le 'his sb..ile disintegratedt should produce the same representation as that of 'he stopped"]},{"title":"smilingt. Yet the","paragraphs":[":~bilit-y to thus relate these expressions must be b.~se~ on some underlying"]},{"title":"similarity with intuitive appeal. This tnslc rcrluires a verb def initi.cn procedure","paragraphs":["such as the"]},{"title":"one","paragraphs":["presented here, r:hich rcsts"]},{"title":"on n sm 11 number of conceptual elements.","paragraphs":["The primitive element of TRiNS ITIuN underlies 'he sto~ped"]},{"title":"smiling , 'his smile disintcgm~ edt and l his smile left himt, even","paragraphs":["though"]},{"title":"on","paragraphs":["tho surf ncc it appears only to underlie the latter (third)"]},{"title":"form of expren\\>ion. Phis element is expressed in our semnntic representation as","paragraphs":["TR-L, From there the"]},{"title":"TR-L structure could be incorporated into a conceptual diagram in a number of ways, e e.g. by n","paragraphs":["transition arrow"]},{"title":"I","paragraphs":["_I"]},{"title":", by a","paragraphs":["ttcause-to-notn","structure 9 or by a \"f inish-ACTtt notation L, Lf"]},{"title":", Thc latter notation is the one","paragraphs":["actually used in conceptual dependency for exampleaof the type"]},{"title":"@en.","paragraphs":["This notation does not express any relationship between the three forms"]},{"title":"of","paragraphs":["the exxn7le given above. Howevef,"]},{"title":"it is rnnpyed out oL","paragraphs":["TR-L, which does show this relatianship and is referred to in the following analysis of 'his indifference disintegratedv Briefly, 'disintegrate"]},{"title":"'","paragraphs":["~s defined as changing from existence to non-existence of an object, on the PHYSICAL level: ((PH) TTt-L (STATE 0 BE)...). since 'indifferencev is not consxstent wit11 the PHYSICAL level, a base-level interpretation fails. Since 'he"]},{"title":"' is","paragraphs":["+ANIIL?LTE, the IEmAL-level noun 'indifferencet can serve as an attribute of 'het as ex,eriencer A. There are no feature specifications which mu;t be fulfilled by the attribute"]},{"title":"* indiffercncc '","paragraphs":["; theref ore there crc no obstacles to an intc?rprat,ition on the PiJY'l'AL level. Thc delfinition of 'indiffcrcncet yields the descriptors '((1.C A) (sT.:C& (0 rrf R) (VAL +-)))', where 'A' represents iVAL, i.e. the LGNTd, sublevel 'Attituder, and +- is the value"]},{"title":"..or 'neither positive nor negnt ive'.","paragraphs":["'mdifferencel can be defined in terms OL either the LTM or thc dP, i.e. either as +HYP or -1IYP; +IiYP is arbitrarily assumed ftir non-PlNSIQi'L concepts. The program thus enters the matrix with dimension informarion (b& A K bTL!1'E +H +- ) to obtain a corres1,onding K-role VEI\\D. It finds 'be-indif f erentto1, uses the R nlrenriy determined as subject and adds structure element TR-L given by the ver,b to obtain 'he STOP be-indifferent-to...', leaving n slot for the object of the indif iercnce. The procedure is similnr for 'his smile disintegrated"]},{"title":"'. The","paragraphs":["mogrcm determines o cdtegory ~hift and nccet*s the TR-L structure for 'disintegratef with the Itloss of existcncell of 0 (0 BE) interpreted as che ttloss of state1' of ii (0 AT R). Thus the resulting R-role representation is the sane as thdt for 'he stopped smilingt. (It might be noted thst the substitution of a concept sucha s 'smilet for n physical object could be represented as a PHYSIU-to-ACTIVC,sbift, if an ACTIVE level ispostulated for HO3lIN~iLs snd VERBS (5). pursuit of this approach would designate this example, like the other exmples of this section, as n case of levL 1 s hift. ) T~Q excin~plc 'truth burned up"]},{"title":"' is dismissed by Katz (3) as som.,ntic:llly lous. However, if hwns","paragraphs":["ctm"]},{"title":"unders tend sentences involving verbs which","paragraphs":["e:-lpnrently v iolnte selectional restrictions, tlxen such expresstons are i:lw zubject to computer understanding."]},{"title":"In terms","paragraphs":["oC the matrix, 'truth"]},{"title":"', a","paragraphs":["conceptual attribute, represents a positive v.:lue of on attribute of n (lexically absent ) EC4N'i'tU ub joct, which is"]},{"title":"in turn dominated by a (lexically absent) R. kince 'burn upt differs","paragraphs":["from Tdisintegratet only in the me.nz or manner of thc aation, ehe endysis of this ex~+mple is similcjr to that of 'his indifference disintegrated*, with a shift to the TVAL- rather than to the sublevel. By Lllo~ing for the assumed R and 0, the output routine con obtain the opproximotion 'one STO: know.."]},{"title":".","paragraphs":["( tpeople storlped knowing ) or one STOP ialriTE-TO true"]},{"title":"inf","paragraphs":["orrna"]},{"title":"tion","paragraphs":["( 'people s topped h'iving or telling the truth ). Thus lilthough contextual restrictions"]},{"title":"on 'burn upt would inuicnte a","paragraphs":["+PiTYSlC=rL NOMINAL as actor, the program st ill lluricierst andstr the usage while recognizing that it is not i' base or ltnormalv usage. Thls is possible because the system is01 tes rhe ~ri~itive structure of a verb from its ordir.sry select ional restrictions. 5.3. R-0 switch B-0 switch isexemplif ied by 't le country leapt to prosperity'"]},{"title":"in that 'prosperity ' rather","paragraphs":["than 'countryt sppeors"]},{"title":"to be the goal :>nd is thus","paragraphs":["initially oadigned"]},{"title":"role R","paragraphs":["r."]},{"title":"ther th~n 0.","paragraphs":["This kind"]},{"title":"or metaphor","paragraphs":["may actually"]},{"title":"includc B category shift (which itself may include n levcl","paragraphs":["shift), and"]},{"title":"is unad to express a change of state (of 'countryt) ns a transitioh (of lcountry'","paragraphs":["). Looking 1,113 prosperity"]},{"title":"in","paragraphs":["the dict iotlLbry, tho program"]},{"title":"find 1 (prosperity ((GO I3 W) (hOLC R)","paragraphs":["(ST.;I'E (t)"]},{"title":"(&*IT 3)","paragraphs":[")"]},{"title":"(R (Hum +I) (BRL","paragraphs":["(?IUCLN +)1)"]},{"title":"1). That is, 'prosperity1 maps into on","paragraphs":["attribute on the CL.NTH)L"]},{"title":"levcl (Extrinsic 1L control of - PHysicol","paragraphs":["concepts),"]},{"title":"is positively valued, of o great","paragraphs":["MiOUNT, and dependent"]},{"title":"on any","paragraphs":["4HULW concept."]},{"title":"'Country' has tho f rliture ref uired for an","paragraphs":["R"]},{"title":"on","paragraphs":["the CUNTIUL level"]},{"title":"(+ANIF!),","paragraphs":["and further, it satisfies the +HWJ;N"]},{"title":"specification demimded by 'prosperity '","paragraphs":["; 'leap to specifies"]},{"title":"no","paragraphs":["particular restriction &or li other than"]},{"title":"+PHY,ICAL. \\.e thereiore wish to take over the structure for (leap","paragraphs":["tot, but to"]},{"title":"indicate the","paragraphs":["CONTRPL rather than the FHY: ICAL level."]},{"title":"The structurc essentially is","paragraphs":["TR-C as"]},{"title":"found in the","paragraphs":["definition of the 0-role"]},{"title":"varb 'leap-to '. The conce:~t of 'start to b eq or 'become' which underlies TR-E at any level is transformed to 'start to have' in m R-role ep ression. The object of the control involved, in","paragraphs":["'proq erity"]},{"title":", which is given as","paragraphs":["'PHYJICAL',"]},{"title":"can b e mapped","paragraphs":["into the word 'rnaterizlt for purposes of"]},{"title":"generation. Thus our represent at ion yields the R-role Tcountry SPART have-materialT in the implementation, and could be the basis for other","paragraphs":["non-mctnphorical"]},{"title":"paraphrnses such","paragraphs":["a; tl~c b-role 'the"]},{"title":"country 13: s bcsorning prosncrous I.","paragraphs":[".;nothcr esrmplc,"]},{"title":"intcrestin:, bccLruc;c","paragraphs":["potcntinlly"]},{"title":"all lcvcl;","paragraphs":["~lrc"]},{"title":"involvcd in its mctaphoricol internict:~t ion n, is liurope ancl","paragraphs":["Ancrica"]},{"title":"arc","paragraphs":["drifting apart1. Subject to the contest of the ~iiscour;c, thc ~nct,t,)horical"]},{"title":"intcrnrr","paragraphs":["tit"]},{"title":"tion in","paragraphs":["this cnsc 111.y"]},{"title":"turn out to bc n more likely interprctation","paragraphs":["than"]},{"title":"thc bt se","paragraphs":["(:IIYoI~.'~L)"]},{"title":"one.","paragraphs":["'drift apart1 is"]},{"title":"defined in the ~ictionnry as a symmetric, i.e. +&WU verb on the I? YbI&iL level: ((PIES) T&L (bT","paragraphs":["TE (0 AT R)) (NIL 0) (::Gtlrn' -)...(AKSZIJ"]},{"title":"+I).","paragraphs":["Si-.ce the syntactic"]},{"title":"joint actors, tl;uro!>e anSl '2merica1, are both deiined","paragraphs":["~13 having a +Pi;YdIGiiL"]},{"title":"comnonent, i.e.","paragraphs":["their geographical areas, we have the PINaI(;& interprctction thot the continents of Lurope and mcric': .are"]},{"title":"in","paragraphs":["the process of"]},{"title":"going away iron","paragraphs":["one another. That is, ,uro?e or America"]},{"title":"or","paragraphs":["both ore loalng the"]},{"title":"loCation","paragraphs":["they once ;ih:)red. Since 'driftt notentially takes a source"]},{"title":"or @a1 as","paragraphs":["indicatca by 'r-iT Rt, the excmple satisfies thc condition for testing for"]},{"title":"an","paragraphs":["R-0 switch. The mis~ing NOSiINAL or attribute (which rrould correspond to 'prosperityt"]},{"title":"in","paragraphs":["the previous exzmple) imnlieri"]},{"title":"in the","paragraphs":["sentcnce"]},{"title":"czn","paragraphs":["hzve any level, since it is not emlicitly given. '2uropet and"]},{"title":"' mcricaf as institutions","paragraphs":["fulfill the +ANINATE condition for R: (~uro;~e/lbrerica ("]},{"title":",.. (ANIII","paragraphs":["+)"]},{"title":".. .","paragraphs":[") ) The level of the"]},{"title":"nissin~","paragraphs":["NOhlINAT,"]},{"title":"or attribute from","paragraphs":["wh-lch"]},{"title":"they are drifting is mknom. Thus the.","paragraphs":["program determines that interpret at ions"]},{"title":"on","paragraphs":["the ILNTAL, LGN;N~CJRY and CONi'ROL"]},{"title":"levels arc also possible. On","paragraphs":["the PdNTA"]},{"title":"level, the abovc structurc","paragraphs":["for 'drift apart'"]},{"title":"is the structure which underlies a possible","paragraphs":["poratjhrase"]},{"title":"gencrntion of","paragraphs":["'Europe"]},{"title":"and iuncrica no Longer zqgrcet; on the SLNSORY love1 it is the structurc for","paragraphs":["'Lurope clnrl America"]},{"title":"no lon~er perceive the same things '","paragraphs":["; onti on"]},{"title":"the","paragraphs":["LONTIiOL level it is the structurc lor 'Curope and .dnerico no"]},{"title":"longer have the same rights,","paragraphs":["responsibilities or types of control!."]},{"title":"5.4.. Intra-level feature shift In the level shifts descrised above, a verb is","paragraphs":["usually"]},{"title":"borrowed frbm","paragraphs":["bne level znd aaplied at the level"]},{"title":"of the","paragraphs":["object with"]},{"title":"which it","paragraphs":["will be used."]},{"title":"In intra-lcvei ieature shifts, all components conform to","paragraphs":["the same"]},{"title":"level, usually the PINSIC&,","paragraphs":["but o"]},{"title":"apccification(s) or t'eature(s","paragraphs":[")"]},{"title":"of the ob","paragraphs":["jept is viol~ted. h%en the +HNLIvGiTE feature of"]},{"title":"an","paragraphs":["actor is violated, n kind of personification"]},{"title":"or anthropomorphic behavior results, as in 'the chair drank the ink1. This ccm be referred to as an Itactor-£ eature shiftu. (1% corresponding ex-le on the","paragraphs":["IENTkU level"]},{"title":"might be 'that painting ssys something to me1, where the psinting does not literally say anything, but the result of looking at the painting is","paragraphs":["the same as"]},{"title":"if","paragraphs":["something had been said. ) If, however, it is the object which docs not meet the snecif iczt"]},{"title":"ions of","paragraphs":["the verb definition md yet"]},{"title":"the 13hrnse is ~c~rn~~~ehcnsible~,","paragraphs":["thcrc is on 'tab joct-ieature +if t\". An cxcmple is the ship plowed t he e eo r. 5.4,l. kictor-Eenturc shift As stl~tcd above, there is"]},{"title":"no change in lcvcl","paragraphs":["this typc of mctt>p3~or, but t he +.it!.:IPI"]},{"title":".T,:","paragraphs":["rcstr.icti\\m on tho actor"]},{"title":"is","paragraphs":["violated. Thus 'tl~c chair drcnk.tb:c inkT"]},{"title":"i. .n example of intra-lcvcl","paragraphs":["hilt, b ut '"]},{"title":"' t!~e","paragraphs":["boy uranul:"]},{"title":"in the ->oetry ' is not, as it involves an","paragraphs":["estension to a d1r\"ierent lcvcl. In general, the semantic ret uirements on the object of such an eq~rcssion nrc the scme as tho.;c in r n~n-mctap:~orical usage."]},{"title":"m 'tibe chair","paragraphs":["dz.nk the inkt, both the 'c:nirt 2nd the *inkt arc ordins ry phy- ical concepts"]},{"title":",","paragraphs":["althoush the use of 'drink is not quitc the ordire ry one. m e::;.~.~~nation of this exa~xple by"]},{"title":"Lhc","paragraphs":["jcta nt ic corn-oncnt rcvcnls nothin unusual .~bou; 'drank the inkt ; inkt is +P!;oibd~L and +FLUId as re< uireu by thc NarTowt speciiications of 'drinkt. t"]},{"title":"clIc * t 9","paragraphs":["though ++A~Y~~CLIL, is noted to lack the +LiNIiiiTZ feature value speciiied by 'drinkt, so the ordinary sense is rejected, while the conditions ior an actor-feature shiC t cre satisfied. The determination of a metaphorical interpretadon iup1i.e~ that the effects or Linguistic inr'hrencc; deriv~ble from the underlying conceptualization are sirnil& r to those deriv~ble iron n conccp t ualizat ion containin; the litaral 4 sense oi tarink', which is 'to 1KGG;SST a +PHYSIC.Ly d?LUII) substancet, Since the"]},{"title":"in13ut: example is already in R-role","paragraphs":["form, i.e."]},{"title":"with tho","paragraphs":["Recipient as subiect,"]},{"title":"an","paragraphs":["0-role"]},{"title":"form is given as pmaphrase in the","paragraphs":["output. Becausc thc structure is a TR3 one, with 0"]},{"title":"= 'ink', it is known","paragraphs":["that the"]},{"title":"ink was removed","paragraphs":["Errlrn somewhere and is"]},{"title":"now in the chair. The inf or-motion given as o result is 'ink STAiXT BR in chairt.","paragraphs":["Con-"]},{"title":"sidering other vari:~tions on this","paragraphs":["input, we note th.lt we could not readily"]},{"title":"interpret 'the blotter drank","paragraphs":["the chrir', since 'chair"]},{"title":"is","paragraphs":["-r'ZUIU, 5.4.2. Object-feature shift The example 'the ship plowed the sea' fails n literal interpretation on the basis crf the definition of tpl~wt :"]},{"title":"(PLOW ((1~3X3) TR-I:","paragraphs":["(bTlbE (0 BE SHAPE: )) (ROLE 0) (AGENT +)"]},{"title":".., (IasTRt TR","paragraphs":["(STATE (O"]},{"title":"L~T R))) (O (NR~ land)","paragraphs":["(B!U (212 +)"]},{"title":"(~1ml.1 +)I) I), since 'scat is not a synonym for and However, 'seat fulrills the '8rond1 specifications of 'plow' for 0. 'Shipt, the syntactic subject, is assigned the role c.f","paragraphs":["AGXNT. In (S), it is explained that an AGENT, i.e. n NCEIINAX which has some role"]},{"title":"in a causative","paragraphs":["action, either 1) is +;th'lbL.TE, 2) itself represents an action and therefore has the ACTIVE level, or 3) hac a specific func'iisn whicil entor:. into the causation. Since 'shipf isneither +.rNIB2~'l'i: nor ACTIVE-level,"]},{"title":"it is assumed to have a functional role in the causing conceptualization. The program checks to see that certain ranuirements oi an instrumental","paragraphs":["involvement of 'ship1"]},{"title":"in lplowing'","paragraphs":["nro fulfilled. The function"]},{"title":"Qr' vshipl is given as 'sail. '.","paragraphs":["The"]},{"title":"strucf ure","paragraphs":["ufidcrlying Js.?il"]},{"title":"is TK (:iT.;TE (0 AT R)). Although the noun vnlo~vt might be giwn as the cx","paragraphs":[")licit"]},{"title":"instrument of","paragraphs":["tho"]},{"title":"verb .'olow ,","paragraphs":["the program"]},{"title":"ignores the failure to cgree","paragraphs":["with such specific infom:a~tion, just ;AS it"]},{"title":"ignores","paragraphs":["Narrow"]},{"title":"restrict ions on' ob jocts","paragraphs":["when"]},{"title":"considering metnphoricnl cx 3ressions. On examinlbg the","paragraphs":["gcncral structure"]},{"title":"given for","paragraphs":["the instrumental concoptunlizotian of '?low', the 4"]},{"title":"program finds TR","paragraphs":["(bT.SE: (0 AT"]},{"title":"R)","paragraphs":[")"]},{"title":", which aI;rees","paragraphs":["vith the verb structure of the Punc tion of s"]},{"title":". In othsr words, although only o 'plow' can truly '?low1, in a","paragraphs":["rneta~horical interoretation anything' xhich tt~hysically goesu can conceivably h..ve a llplow-like\" ef fcct. i'hc ?rosrarn the=£ ore arrives at the roq:h intcrprctotion 'ship DO (sen 3 dT"]},{"title":"(BE SIIAPE:","paragraphs":[")"]},{"title":".","paragraphs":["Conceptual dcpen..ency rules would then transform 'ship DO' into a structure corresnonding to 'one o7ernte ship'. ~~nsider now a vzrb-"]},{"title":"- 'kill","paragraphs":["--w?~ich is subject: to metaphorical use. but"]},{"title":"in a","paragraphs":["non- straight£ orword way, since a level shift and/or-an"]},{"title":"- object-feature sh -ft may k involved. Iq the exam2Les","paragraphs":["'John Bilged the cat' and 'the House killed the bill"]},{"title":"', the ordinary object of 1","paragraphs":["( cct ) is no more a mere ;d~ysical ob j&ct than the metcpY.oricc1 object (tbillt ) is a mere mental object. The P~?YSI~-to-i~iiW.~L extension"]},{"title":"in the aecond example is obscured by the","paragraphs":["simultaneous presence of an object-feature shift. To clarify the role which each type of shift plays, a similar example is first presented which"]},{"title":"involves only ob ject-feat- s hift: 'he killed thcmotor I. This example could be more explicitly paraphrased as 'he","paragraphs":["did something which caused the motar to die*, The interpretation depends"]},{"title":"on what it mewrr-fot","paragraphs":["the cbject."]},{"title":"*motdrt, to 'die1 or 'be dead'. It would be deo%rablc","paragraphs":["'to obtain the interpretation 'he stopped the opekathn or rning of the motorv, while rejecting a sb-s intcrplrtation for 'he killea the stone1. *Motor* and 'stone"]},{"title":"* are,both RIYaICAL NObIINC\\Ls; no level shift is involved. Rather, the +ANII~IYZ specification on the object is violated, yielding a mctaphoriccl, interpretation in the first case and no interpretation in the second. ?Motort is a medningful object of 'kill1 because it is a ~~IC","paragraphs":["NOMIN L-, its function king to run. ( It is recalled from Section 3.1 that the +DYNAMIC feature value specifies a function which can be identiEied with the particular meaning of a NOMINAL.) When a motor is ?killeda, this function attribute"]},{"title":"is eliminated-- a consequence which. differs","paragraphs":["from e.g. the disintegration of the motor which might represent its being 'destroyed'. The proceaure of the program operating on the first two examples canbe outlined as follows. The semantic representation for 'kill is :"]},{"title":"(kill ((PHYS) TR-L (STATE (0 <FN(O)>))","paragraphs":["(ROLL 0) (IGDIT +) (TRY-1 .a. CO"]},{"title":"(N1W (AN'IM t)))","paragraphs":["(BRD (UYN +)) )). For the exmple"]},{"title":"'John","paragraphs":["killed the cat I, the"]},{"title":"progrim","paragraphs":["will find that all specifications on the"]},{"title":"NOMIN &s by the definition of the verb ere met by the wrds of","paragraphs":["the in3ut."]},{"title":"In p.lrticular, 'u 'Pttrd'n'tt is + '.~TIBk'~TE;","paragraphs":["thdt is,"]},{"title":"in terms of","paragraphs":["DYNAMIC FUNCfIOK,"]},{"title":"it 'livest in a literal sense, Thus","paragraphs":["the"]},{"title":"Liter,til sense of 'kill' 'is","paragraphs":["accepted."]},{"title":"If the inbuttJohn killed the stonet is encountered,","paragraphs":["the program notes that"]},{"title":"' stone has no","paragraphs":["r.'~NIEtiTE feature vCllue and therefore fails a base"]},{"title":"interpretation.","paragraphs":["Furthermore,"]},{"title":"'st one isno t","paragraphs":["+DYNAMIC and theref ore does not satisfy the 'Broadt specifications necessdry for a mcta-phorical"]},{"title":"interpretation. The input","paragraphs":["'the House killed the bill presents a more interesting case, '~ouse' in the sense of '~ouse of Representative~~ or 'Lower HouseT h:*s the +ANIPLiTX feature preferred by the target representation conditions on an AGE;NT as specified above- with respect to"]},{"title":"' shipt; however, (bill1 does","paragraphs":["not hove the +ANINATE feature value as required by"]},{"title":"'killt. Thus a base-level interpretation is rejected. IIowever, tbill does have the","paragraphs":["+DYNAPlIC v~lue, corresponding to the observation that it has a ucontinuous effectly on people. Thus the basic components are satisfied for an interpretation. since the"]},{"title":"dispensable 'Narrow","paragraphs":["+ANI~$~TE descriptor,"]},{"title":"i. e. the literal live' function, is viol~ted, b ut the","paragraphs":["minimal, i. e. 'Brood1 requirements are fulfilled, the employment of 'killt is considered a metaphoricill extension from the l+IIYSfCAL to the EZ1:NTAL level, The structure TR-L (CL\" 0 NO ) ) (AGENT +) then yields the paraphrase lHouse &TOP bill become law', where 'lawt is n COXI'WL concept re~~reacntcd in terms of lone mustt and lone nmyt. Gy noti= that which"]},{"title":"il; co\\~-unon to both the base sense and metnphorical senses of","paragraphs":["'kill', we c.ln cotl-tp rc the m&nnings of thcoc srnscu. The underlying structurc oE the verb itself spe~izies in $11 cases that on 2ction was successfully tL4ken to elbin~te the 1)YNUIIC: function or effectivaness of the object. 'fie cffect component oi this structurc says that the Object no longer ~xists in its previous State, for this is t71e interuretntion assigned to the TR-L structure. Thus the ccit no longer lives; the otutor no longer runs; consideration of the bill stops, and the"]},{"title":"-","paragraphs":["intended result, A. r; I","defined conceptually as is prevented--thus the prohibi-tion, order or permission contained in the bill is never realized, 5.5, Koun compounds This type of metaphor andysis can also be applied to noun compounds in which the nouns are defined"]},{"title":"in terms of verb~l concepts. The further ~.evelopment of the above rnechanimsms must precede an implementation of the more coclplex now-compound","paragraphs":["metaphor analysis ; however, the =.p,n-oach to interpretation of such constructs can be indicated. An example is given by the noun compound idea factoryt, \\.hich is close"]},{"title":"in","paragraphs":["nleoning to"]},{"title":"the verb-noun cdmnound","paragraphs":["'think tankt. If the +I'llfolU~L objects or mc:tter usuL.lly asvociatcd with f :;ctory or 'tank1 arc ignored, noun-coml~ound intcr~xxt,~tion pr0cedurc.s (5) can be used to arrive at 'institution which m~kes $deasl or lcnvironment in which one thinksq respectively. Ncre tllc verb 'think and the noun 'idea"]},{"title":"' ,","paragraphs":["which is an object ot thought, retain their litcrcll srnsa, 'c~!~ereus the functions underlying 'factory ( tmalcc ) and"]},{"title":"' t nnk","paragraphs":["( be in"]},{"title":"'","paragraphs":[") undergo an nb~;tr,~ction prqcess similar to that involved in level shift. Consider also the esarnple 'the foreign-born may hold the \\nzite IIousc key socnt. It: is possible to uncierstnnd *I..%ite House key1 in it8 metaphorical sense because: 'keyt 5s a NOBIINAL described ,is having the iunction 'own"]},{"title":"'","paragraphs":[";"]},{"title":"'","paragraphs":["opening t","implies the possibility of enteringv (cT. 'close"]},{"title":"',","paragraphs":["section 5.1 and"]},{"title":"' bite Hou;c * is not","paragraphs":["only a AIT~L&& building, but is also defined with the fectures of $n institution, which includes ANIbdfE beings. Thus the f rclmework exists ior handling some metapi~orichlly used noun constructs with underlying verbal and/or ettribvtive concepts. The examples of Sections 5.1-5.4 are representative of the v~rious metaphor mech:tnisms which have been identified. The (;uestion arises as to the extent to which such mechanisms hold for any metaphorical use of a verbal or attributive concept. An assessment of"]},{"title":"the","paragraphs":["validity of the nnClysis method for such metaphorical uses depends upon 1) the completeness of tho identified categories, i.e. whether such categories cover"]},{"title":"all types of verbs in","paragraphs":["the class under consideration; 2) whether ~uch categories cre based on the most \"importantH component which enters into metaphorical"]},{"title":"extensions; and 3)","paragraphs":["the extent to ~hich v:.riotions within a category af~ect the plausibility of an interpretcticn. The first two conditions are concerned.r:itk thc quootion of 2 \"rninirn4lM interpret'.tion, i. e. thc exclusion of n :!lscfl interpretation, the third with an \"adequate\" interpret ation. With tespect to the first point, the Verb description system presented has intenticnnlly focused on the breauth or scope of"]},{"title":"the","paragraphs":["categorization rdher thm on 2. more detailed il~ustr~tion of any one category. Such an ovcrview must have prior consideration bccciuse the trensl; tion of a mctaphoriccll verb requires compzris~n with other vrrbs, which themselves must be assigned a ~tlocction'l within thc system bclr'orc ~ny refinement of inter~retat ions can b enin. The ~ivcn system outlines t is cc7tegorization"]},{"title":"in terms of three rel~ted","paragraphs":["primitive structures-= &TATE, ENTER-LT-bE and L&iVL-STATE, which are subject tc. embeduing, as in thc cuse o 'close' (Section 5.1). Roles define the ap lication of rhcL e structures to an \"objectw, a \"locationtt of an object and an '?a&entft of any change, the result of 1:hich is represented by such a structure. These roles, which ore few in nut.iber and reliltively simple to identi~y or ilny"]},{"title":"given verb, are adec ucte","paragraphs":["to rclcte ilny lexical verb rorm to i:n"]},{"title":"undcrlyin","paragraphs":["structwc. This"]},{"title":"structure-","paragraphs":["rolc description divides the class or prcdicc: ivc concepts b with the csccntion of \"logiccltt terms such as 'ilnplyT or 'equate"]},{"title":"'.","paragraphs":["Thus the field of verb(11 and attributive concepts is covered by this minimill classification b<lsed on"]},{"title":"intuitive abstract concepts. These abstract. structures","paragraphs":["ciln be primitively realized"]},{"title":"in","paragraphs":["the literal output paraphrases as 'be (or not be) in a certain stcteT, 'sti;rt to be in a ccrtnin stzte' and 'stop being in n certain st.:ter. 'Ae nature of the 'stk\\tet can then be described to tke extent allowed by the levcl/sublevel definition of the Object of the -41rase. The i~cntificd lzvels which define the ficld of mctar~horical extension c:.n olweys be exp.,ncled or refined to ~i.ve more inform, tion, since they LO not af iect those comnonents-- structures and ltstructurnltl fcntures exclu~ling HYP and VOL-- which remain cons tc:nt in an extens ion. It is clLairneci t:-~~t these structures arc thc mast basic characteridin& eler~~ents of a verb in the sense th. t the identified primitives ;nd rnech'nisrns are those which can also be recognized as ~n~~erlying conceptunlly simpler linguistic constructs not usually thought of as metc~horical. ~lthough a phrase such as 'he reached >rosperityt is not obviously metaphorical, there is c \"tr~nsl~ ti:ntt between it and the phrasc"]},{"title":"'he became prosperous which is similar to the translation between","paragraphs":["the more coLoriul 'he leapt to prosperityt"]},{"title":"and 'he became (suddenly) prosperoust. In each cnsc,","paragraphs":["the"]},{"title":"primitive TK-E representing 'start to1 relhtes","paragraphs":["the two"]},{"title":"forms of the expression. 'l'his","paragraphs":["simi1:lrity rests"]},{"title":"on the","paragraphs":["fact that"]},{"title":"- all linguistic expressions which treat abstractions (lprosperous') as objects ('prosperity') might in a sense be considered metaphorical. It seems reasonable to ap roach the","paragraphs":["problem"]},{"title":"of metaphor with an anelysis valid","paragraphs":["for the simplest form of"]},{"title":"such expressions. The analysis represented by the structural descriptors is trivial but basic in","paragraphs":["th'lt"]},{"title":"it is a prerequisite to any","paragraphs":["more"]},{"title":"complete interpretation, and in","paragraphs":["that"]},{"title":"it relates expressions exhibiting varying degrees of metaphor","paragraphs":["without resorting to ad"]},{"title":"hoc","paragraphs":["definitions or rules. Although they provide a basic interpret~t-iirn, the structures and features whic7? render an extension"]},{"title":"meaningful are not necessarily, the focus of a metaphoric21 expression. The","paragraphs":["focus moy be"]},{"title":"an attribute which, while provided for and broauly classified by","paragraphs":["the structure-lcvcl dciinition of the"]},{"title":"verb,","paragraphs":["ittielf rul~nins to bc dof ined. To tr:kc n"]},{"title":"r.","paragraphs":["ther difficult exan~,?le, the verb tbleachl can"]},{"title":"h . ciincu","paragraphs":[":I!; '+AGJNT ll'&,L aLdi\"I'L; (0 2 1: )"]},{"title":"o)',","paragraphs":["or, 'to Ci7udc"]},{"title":",m object to","paragraphs":["Vg $1"]},{"title":"dE of","paragraphs":["Qkc~i:'."]},{"title":"If 'blench l i., u;ea","paragraphs":["~n~tuphorici~lly, as"]},{"title":"in :,he","paragraphs":["bleached the storyt., this dciinition gives the mini!~mL informiltion that solnc L:ttribute of the tory dis-appears. This is the"]},{"title":"nod btli;ic ,or nccc.-.,:*ry","paragraphs":[";I. rt of the interpretation, but is not'very interestins. It would also be desircble to know how the attribure itself enters into the metaphor, i.e. what the color or loss or c~lor signifies. For quantit, tive attributes, i.e. those ~cith magnitudes as values, the prii~itives"]},{"title":".","paragraphs":[". and"]},{"title":"I+","paragraphs":["arc in-cluded in the deiinition at the PI':YAILAL levcl rnd &:= easily ostcndcc to other lcvcls. The ch~racterizotion of qun1it:tivc attributes, such CIS 'with or without (a certnin) colort, is more diPiicult. A 3ug;cstcd dspro~ch (5) assigns PC~I\"~~~/N,~G :.'I'I~ value lVconnot tionsgt :o ttributes wI-.ere they suggest themselves ; for exarqle .'bri;ht : 202, tflt7t: NSG~ (but 'even: POS'"]},{"title":"j. ~hcsc assignncnts can be expected to rcelcct","paragraphs":["culturrl diff~??cnccd in uncresstanding metaphor."]},{"title":"or","paragraphs":["the resent essmL*le, even tb; Q .ninFi.mL def"]},{"title":"inition is","paragraphs":["diflicult, because literal bleaching can bc uone ror different purposes : bleaching ni,ht bc qerccived as rdG.\\TIVC"]},{"title":"in the sense of lrepuvin~ colort,","paragraphs":["but ,lOaI'.iIVE"]},{"title":"in","paragraphs":["the aense of 'launuering or Irer.~oving stains' (1- ' I3 (0 ( IP"]},{"title":"AT:","paragraphs":[") i3Z COLuR: G IIowcvcr, thc rcsulfin~ ~~mbiguity"]},{"title":"in any mcta;~horicnl intcrnretntion","paragraphs":["lmgcly rcflcxtk the ambiguity of any literal use of the verb."]},{"title":"In","paragraphs":["both cases n lcnowlcdge of"]},{"title":"- - the","paragraphs":["linguistic or situational context is required 2or e correct unc~erstanding of the use of 'blench ( thc bleached tho report of thc war cnsualticci, blcnchcd the anecclotes'). Thi.: example points out the acco~aplishments and limits of the ny;tcm in defining components :signif icnnt to metaphor.","Vhut it uoes is to s--ecify S: structural Erlls~cworlc"]},{"title":"in","paragraphs":["terms of which those propcrtieu of predic.tive concepts relev..nt to inetophoric~l usages ct.n be n\\cthodiccllly dcr'incd. In other words, the sys tern riistin.guishes the conceptual structure cornponcnt underlying a vcrb form i'rom thdse s ernantic attributes vhich are ;lnon- s tructureu\". Tl~us 'the s structure unucrlying 'bleach' is autmtticnlly specified, as obovc, and 3roviJes llslo:sla such as PU~/KGG for the attribute represented by iwldtel or 'without color"]},{"title":"' . The s-,eciEications Lor quclitative","paragraphs":["gttributes nust reraain f le:tible, subject to the"]},{"title":"associations ~rhich a","paragraphs":["culturc or subculture tlssitns - to s'uch attrcvutes; the symbolic value of dn ab: traction such as 'black"]},{"title":"* i; dif","paragraphs":["Eicult t~ .define in i3 gcnerbll n nncr, apart from cny c5ntext. In thLs sense the rcuucri~n OF a verb use to quantit~tive primitives IU clualitative attribute-values may.re?re;ent the limit to which metaphorical imelyses can be generalized, Given thClt this system of reproscntntion pro\\.uces"]},{"title":"minimal","paragraphs":["interpretations wl~crevcr possible, ;is opnosed t o the"]},{"title":"nltcrnative oL disminsin:: an","paragraphs":["cxprcssion ns ..nom.~lou::,"]},{"title":"it","paragraphs":["rrl.\\ni~~s to consiuck thc third condition listc~l nbnvc,"]},{"title":"n mcly","paragraphs":["tile adequocy of the mctl~od as anpl:.:d t~ v\\rbtll cancc-3ts which .ire -4 clni:.~cd ti- fnll within"]},{"title":"-- n category,","paragraphs":["i.c. which .~c Li:;~i ncd thc sal,\\e conLi$ur.~tiurt of ~lcscril~toro. ~t i~ ,!ssu\\\\\\ed that the primitive structure unuorlying o verb is ;lw,lys carried ovdr in LI m~tnphoric.il usage, ,:lthou h it nI:y bc magnitude (which"]},{"title":"is","paragraphs":["llo~~cd for"]},{"title":"in","paragraphs":["tern~s of"]},{"title":"AWQUKT and","paragraphs":["IKJENalTY) or some other as~ect of ~st$lett (which is not- woviucd for) which I is cmphcisized. T'*us 'leap to', 'drift mtot. 'land on1, 'hit' cnd 'plow into or 'plow through to"]},{"title":"' (which","paragraphs":["share the s~.me structure '2nd fet~turc vulues except EoP VOL) all lend to similar interpret tions, given a common go@, c.p. prozperity"]},{"title":"'. All","paragraphs":["yield 'the beginning ol: a prospcrdus state1; with incorporati.cn or' the INTEKITY descriptor, 'leap to1 and 'hitt yield 'sudden beginningt. Treating (one sense of) 'hit' and 'leap tot as ne; rly synonymous (TR-E"]},{"title":"&TAX (0 ON R","paragraphs":["for 'hit"]},{"title":"' , 0 AT R for 'leap to","paragraphs":[") (INTENaITY:"]},{"title":">","paragraphs":[") (&OLE 0) ), which they are not, entdils some loss of information, of course, but the resulting approximation is useLul."]},{"title":"In the case of r~Low through to l,","paragraphs":["on the other hand, the lack of the"]},{"title":"in£ ormation that a wlaboriows ef f","paragraphs":["art\" is involvcd weakens the interpretation to L~ greater degree; this kind oi style, which depends on the specific mechanics of the action or"]},{"title":"the","paragraphs":["attitude of the actor, is"]},{"title":"difticult","paragraphs":["to incorporate"]},{"title":"into o","paragraphs":["systematic"]},{"title":"chornctcricntion. IIowc\\ler, sucfi","paragraphs":["intopma t"]},{"title":"ion, independently determined, could be added to","paragraphs":["the verb dhscrit~tion. For example, the descriptor tINTIIMbITY:>t appcnclcd to the feature vtLlue t+VOLt could be assigned to thc verb tplow'. These dcocriptors would be cnrriod over to the incom>lete but more iMormnti~e tnetaphorical 'lintcrpretationtt: 'he very consciously did something to become prosperoust. Thus"]},{"title":"it can be concluded","paragraphs":["that tlte method prcsentcd covers a major class of predicativc concepts, 2nd that the resulting opproximi.tion to the"]},{"title":"meaning of on expression","paragraphs":["is reason..ble but varies in the amount of information conveyed. It is oc' sibmificance that the emphasis on inclusive classes together with t specific suggested format allows for extension of thc system. Inter~rctationsproduced on the basis of relatively rninimd information"]},{"title":"will not ~lways be completely satisfactory, nor will they","paragraphs":["7rovide all the nuances of linguistic expression. However, the possibility that interpretations of L lerge class of metap~oricol exjressions can be approximated by a systematic analysis of tlze concepts involved ensures further opportunities to aevelop computer understanciing of novel expressions. F1GU\"iXE 1 OUTPUT INTERPRETATXOXS","Fa rmat : < IN1)UT 131111ASE~ <TYPE OF hIErrAP1.IOR> ~INI'SSIZL ROLE COSFI(7URATL'OH"]},{"title":"> r","paragraphs":["OUTPUT PlSRAl~l~~lA SE 3 ( 1IF DRINK INK ) 13A SE RVO ( HE DRINK INK ) ( EIE CI-OSE INK ) ( NO INTGRPREJ'ATION ) ( HE CLOSB 311ND ) I.EVEL-SIIIFI' R VR ( IIE ( IPART: YIXD ) STOP POSSIl3ILII'Y-OF STAHI' I'HINIC ) ( slrIP PLOW SE-4 ) FEATURE-SIIIFT AVO ( SHIP DO SEA START ( BE SlLZPE: ) ) ( SIIIP PLOW CHAIR ) ( NO INTERPRETATION ) ( CIt4IR PLO\\q SEA ) ( NO INTERPRETATION ) FIGURE 1- -Continued ("]},{"title":"saIr 1nsI~rsam'rE","paragraphs":[") RASE OV ( SHIP DISINTBGlWTE ) ( COUNrRY LEAP-TO PROSPERITY ) 110-SIIXFI' 0 V11 ( COUNTRY START 1IAVE-?LATERIAL ) ( PROSPERI ry DTSINTEGRATE ) CATEGORY-SITIFI' OV { HE STOP IfAVIS->!ATERIAL ) FIGu2F: 2 SANI3Ll3 INPUT DATA D+ctionnry Entri~s: (CHAIR ((~11) (L~ART -) (CORT -) (FTXBD -) (ID"]},{"title":"- (~11~1'B r) (>1%6 2)","paragraphs":["(FIUID -) (CX -) (,I$LH -) (>I>! +) (FS: 1.0~ (ox)) 1)"]},{"title":"(rs~,((rl~) (11nnr","paragraphs":["-)"]},{"title":"(cov+r","paragraphs":["-1 (FIXED +) (111 1) I ) (PI~~ID t) (CX"]},{"title":"-1 A -1","paragraphs":["+) (FS: ISST (\\i~nrl:))"]},{"title":"1) Z","paragraphs":["(IIB ((1111) I"]},{"title":"-","paragraphs":["(I"]},{"title":"-","paragraphs":["(PIYKD -) (ID -)"]},{"title":"(s~-i,u'h'","paragraphs":["+) (ST%).: 2) (EI,U~D -) (CX -) (ANIM +) ()IZI -) (DYN - - +) (FX: AC~IPR (LIYS)) 1) (NIND ((zI~S P) (PAIIT (ANIN +j) (COST +) (FIYSD +) (11) +) (SII=IPE +)' (FI,UID -) (CX +) (,<XIM t) (1 -) (DYX +) (FN. (T~IIUK)))) [SHIP ((PII) (~~111~ -) (CONT +) (FISI:~~ -) (ID i) 5(2~ -) (s!I,'IF& +) (sIzS 3) (FL-UID -) (CY i) (ASI?I -) (>I?! t) (FN: ESr (SAT].)))) (PLOW ((mi) (A"]},{"title":"- (COST","paragraphs":["-) (FIXED -) (ID -) s 1 (51tB 2) (FLUID -) (CX -) A -) (\\\\?I +) (FN IiYT (1~)) ( -) )) (I.AND ( (PIT] 1 -) (CONT +) (FlX13D +) [ 1 4) (2D +) (~11.11'~ -) (SIZE ) -3) (F~,UID -) (CY -) IS"]},{"title":"-","paragraphs":["I"]},{"title":"- (UYN t) (F: ACTIVE","paragraphs":["(I)RODUCS) ) ) ) (SEA ( (~11) (P-~RT -) (CONT +) (FIS~<II +) (2~ i-) (2~ t) (SITAPT +) (SIZE 4) (FLUID +) (CX -) (.~IJI -) (3~s -) (DW t) (FN: LOC (IE)) )) [COUNTRY ( (PII) (PART -) CON̂+) (FIXED +) (ID t-) (2~ +) (S!L!PB +) (sIzS 4) (FLUID -) (CX +) (ITUW.IN i) (I t) (>iX +) (FN: LOC (IN AT)) (DYX i) ( ) )) (IKDIFFERENcE E A) (STATE (0 AT R) (v.4~ +-) ) ) (~'ROSPERITY ( (CO B PlI ) (STA~E (0 AT R) (VAL +) (XYT >) ) ) FIGURE 2-"]},{"title":"-","paragraphs":["Cont inucd (DISINTEGRATE ((PI{) TR-L (STATE (0 BE)) (ROLE 0) (AGBNT -) (0 (NRW (BRD 1) 1) (LEAP-TO ( (PII) TR-E (STATE '0 AT R) ) (INTNS ) (~01.~ 0) (AGENT -) (INSTR FN: INT (LEGS ) ) ) ) (DISAPPEAR ((SE EYE) TR-L (STATE (0 SENSED-UY R)) (ROLE 0) (AGENT -) (0 (NRW (BRD 1 1) 1 (CLOS$ ( (PII) (TR-L) (STATE ( (INP +) TR-E (STATE (0 IN R) ) ) ) .I (ROLE R) (AGENT t ) (R (NHW (CONT +) ) (~RD (CONT +)) ) ) ) ('DRINK ((pH) TR-E (STATE (0 IN R)) (ROLE R) (R (NRI~ (AN ) NIL) (O (NRW (FLUID +)) (BRD (FLUID +))) (AGENT -) )) (SAIL ((PH) TR (STATE (0 AT R)) (ROLE 0) ) ) (PLOW ((PI]) TR-E (STATE (0 BE SHAPE: ) ) (AGENT +) (~01.13 0) (INSTR: TR (STATE (0 AT R))) (0 (NR!~ LAND) (RRD (2~ +) (FIXED +))I -1) MaC'rix Secrmcnb : 2-"]},{"title":"NB (P (R (STATB (-H (t THINK -","paragraphs":["()) +H (+ BELIEVE"]},{"title":"- DISBELIEVE)) TR-L","paragraphs":["() ) o (STATE (-N (+ (IN CP)"]},{"title":"- 0) +H","paragraphs":["(+ (IN ~~31~1"]},{"title":"- 0)) TR-L","paragraphs":["() )) (R (STATE (-N (+ ENJOY"]},{"title":"- XOT-ENJOY t- RE-UNAFFBCTBD-BY) tH (t LIKE*- DISLIKE","paragraphs":["+- BE-INDIFFERENT-TO)) TR-L (% 1) 0 (STATE (-A (+-(IN CP)"]},{"title":"-","paragraphs":["( )"]},{"title":"+-","paragraphs":["{) ) +H (+ (IN LT~IP)"]},{"title":"-","paragraphs":["() t- () )) TR-L ( m, 1) FIGURE 2--Continued +Ir (+ luve-wralrrhr."]},{"title":"-","paragraphs":["( )"]},{"title":"+-","paragraphs":["( ) ) ) TR-L (-11 ( ) tH (+ 1.OSE"]},{"title":"- GAIN +-","paragraphs":[") )) ) 1 i nt ~r Pc\\r'npllrn so \\fords"]},{"title":"--- -","paragraphs":["-LL"]},{"title":"--","paragraphs":["- .. - --- -- L."]},{"title":"-","paragraphs":["(& (STATE TR-E TR-I. (RYP +) ) (RE STAliT STOP ~'oSSII~TLITY-OF) : Input .. Phrases;"]},{"title":"-","paragraphs":["CHAIR DRINK INK; HE CLOSE MIXD: SHIP PLOW SEA; SHIP PI,OW CHAIR; CHAIR PI,O\\J SEA; SI-IIP TIIS IhTEG RATE ; ISDIFFERENCE DISINTEGllATE ; COUNTRY LEAF-TO PROSPERITY; PROSPERITY DISINTEGRATE: References (1)"]},{"title":"Fillmore, C., \"Types","paragraphs":["of Lexical Innf~rmation~~, Studiesin Syntax and Semanttcs"]},{"title":", ed. F, Kiefer, D. Reidel, Porarecht, The Netherlands. (2) Goldman, N., Riesbeck , C., \"A Conceptually Based Sentence Paraphraser\", AIM- 196, Qomputer Science Department, Stanford University, Stanford, California (May 1973). (3) mtz, J., \"Semantic Theory and the Meaning of t~oodgfl,","paragraphs":["The Jourmtll"]},{"title":"of Philosophy,","paragraphs":["Vol."]},{"title":"XI, No. 23' (1964).","paragraphs":["(4)"]},{"title":"Riesbeck, C.,","paragraphs":["\"Computer Analysis of Natural"]},{"title":"Language in Contexttt, Ph. D. thesis, Computer Science Department, Stanford University, Stanford, California (197 4). (5) Russell, S. . llComputer Understanding of ConceptuaLly Complex Phrasesu, ph. D. thesis, Stanford","paragraphs":["University"]},{"title":",","paragraphs":["Stanford, California (March 1975)."]},{"title":"(6) Schank, R. , tlCausality and Reasoningf1, Technical Report No. 1,","paragraphs":["Istituto per"]},{"title":"gli Studi Semantici ecognotivi, CastagnoLa, Switzerland (1974). (7) Schank ,","paragraphs":["R."]},{"title":",","paragraphs":["'The Fourteen Primitive ~ctions and their"]},{"title":"Inferencesu, AIM -183, Computer Science Department, Stanford university,","paragraphs":["Stanford, California (1973). (8)"]},{"title":"Schank, R., Goldman, N., Rieger, C., Riesbeclc, C., Vrirnitive Concepts Underlying Verbs of","paragraphs":["Thought"]},{"title":"A1M162, %omputer Science","paragraphs":["Deportment, Stanford University, Stanford, California (1972). (9) Schtlnk, R. !"]},{"title":"Meger, C., \"Inference and the Computer Understandxng of Natural LanguageH, AIM-197, Computer Science Liepartment , Stenf","paragraphs":["ord University, Stanford, Californk (1973)."]}]}