{"sections":[{"title":"American Journal of Cornputat ional Linguistics Microfiche 37 7 THE FINITE STRING >- NEWSLETTER OF THE ASSOCIATION FOR COMPUTATIONAL LINGUISTICS A combined alphabetic list of members","paragraphs":["of the Association and persons mentioned in the"]},{"title":"1974 and 1975 sets of AJCL, both","paragraphs":["contributors and authors of abstracted papers, is in preparation. A new scheme of topical categories is being prepared by cluster analysis of responses from members, and will be used as headings"]},{"title":"on a set of index guide cards which will","paragraphs":["list articles, abstracts and members by topic."]},{"title":"The whole package will be distributed about a month after this issue. AMERICAN JOURNAL OF","paragraphs":["COMPUTATIONAL LINGUISTICS is published by the Center for Applied Linguistics for the AssoCiation for Computational Linguistics. EDITOR: David G. Hays, Professor of Linguistics and af Computer Science, State University"]},{"title":"af New","paragraphs":["York, Buffalo. EDITORIAL ASSISTANTI William"]},{"title":"L.","paragraphs":["'Benzon. EDITORIAL ADDRESS: Twin Willows, Wanakah, New York 14075. MANAGING EDITORZ A. Hood Roberts, Center for Applied Linguistics. ASS I STANT : David Hoffman"]},{"title":". PRODUCTION AND SUBSCRIPTION ADDRESSt 1611 North Kent Street, Arlington,","paragraphs":["Virginia 22209. Coyyright 1976 by the Associaticn for Computational Linguistics"]},{"title":"TABLE OF CONTENTS ACL PRESIDENT 1976 Stanley R. Petrick . . . . . . 3 PERSONAL NOTES . . .","paragraphs":["*"]},{"title":". . . . . . . . . . .","paragraphs":["*.."]},{"title":"4 SEMANTICS Georgetown Round Table a . . .","paragraphs":[","]},{"title":". . . 5 AAAS PROGRAM EXCERPTS Science and Expectations . . 7 NEH Application deadlines . . . . . . . . . . . . . 11 SCIENCE AND GOVERNMENT Ralston speaks at NCC 76 . . 12 ARCHITECTURE FOR NONNU'MER3:C PROCESS3NG . . .","paragraphs":[","]},{"title":". . 13 ASIS PRESIDENT 1976 Melvin S. Day . . . . . ...- 15 LITERARY AND LINGUISTIC COMPUTING Meeting notes . . 16 ABSTRACTING AND INDEXING SOCIETIES Gon. !renee . . 17 ISTITUTO PER GLI STUOI SEMANTICX E COGNITIVI . . . . 18 PETRARCH Translated by computer , . . . . . . . . . 20 STENOTYPE Computer-aided transcription . . . . . 21 5ERIALS LIBRARIANSHIP Drexel Library c)uarterly","paragraphs":[","]},{"title":". . 22 A COMPUTER SIMULATfON OF AMERICAN SIGN LANGUAGE . . 23 PLATON--A NEW PROGRAMMING LANGUAGE","paragraphs":["FOR NATURAL LANGUAGE ANALYSIS"]},{"title":"Makoto Nagao & Jun-Ichi Tsuj Li 28 I. Introduction . . . . . . . . . . . . . . . . 28 11. Pattern-matching . . . . . . . . . . . . . . 31 III. Basic operations of PLATON . . . . . . ... 34 IV . Push-down and pop-up operations . . . . . . . 40 V . A sl-mple example . . . . . . . .","paragraphs":[", ..."]},{"title":"44 VI","paragraphs":[","]},{"title":"Conc lus ion . . . .","paragraphs":[","]},{"title":". . . . . . . . . '8. 52 ACL MEMBERSHIP DATA - . . .","paragraphs":["*"]},{"title":"- . . . . . - 54 EDITOR'SREPORT . . . . . . . . . . . . . . . . . . 55 SURVEY OF MEMBERS Preliminary report . . . . . . . 57 IEEE TUTORIALS. . . . . . . . . . . . . . . . . . . 81 American Journal of Computational Linguistics Microfiche 37","paragraphs":[": 3"]},{"title":"BIOGRAPHICAL NOTE STANLEY R, PETRICK Dr. Petrick works on syntactic and semantic analysis","paragraphs":["for transformational"]},{"title":"grammars; he has been","paragraphs":["employed"]},{"title":"in this","paragraphs":["field"]},{"title":"since 1967 as a member of the Theoretical and Comoutational Linguistics Group at the IBM Thomas J. Watson Research Center His doctoral dissertation (Linguistics, MIT, 1965) was A Recognitim Procedure","paragraphs":["for Transformational Grammars; it was"]},{"title":"one of the original systems to","paragraphs":["go"]},{"title":"beyond phrase structure. Dr. Petrick programmed the Ordvac Computer in 1953 and went on to study digital computation at MIT as","paragraphs":["a"]},{"title":"student officer in the Air Force. From 1958","paragraphs":["to"]},{"title":"1967, the was","paragraphs":["a"]},{"title":"research mathernetician in the Applied Mathematics Branch","paragraphs":["~f"]},{"title":"the Air Force Cambridge Research Laboratory. His research was on truth function minimization, speech recognition, and formal language theory, He was chairman of the ACM Special Interest Group on Symbolic and Algebraic Manipulation, 1969-1971, program chairman","paragraphs":["of"]},{"title":"the 1968 ACL meeting, and vice president of ACL in","paragraphs":["1975."]},{"title":"American Journal of Computational Linguistics Microfiche 37","paragraphs":[": 4"]},{"title":"PERSONAL MOTES","paragraphs":["BRUDERER HERBERT TO Finkenweg 3, 3110 Munsingen/Berne, from Haslerstrasse 12, Berne. DE MEY. MARC T."]},{"title":"M. TO Department of Psychology, University of Tilburg, Hogeschoollaan 225, Tilburg, Netherlands, from Gent, Belgium.","paragraphs":["DOBREE. NICK To Rose Cottage, Hindon, Wiltshire, England, from Beirut, pending the cessation of hostilities. RAMEH, CLEA To School of Languages and Linguistics, Georgetown University, from a year in Brazil. Rameh is chairman of the 1976 Round Table on Languages and Linguistics. REDDY. D. RAJ Guggenheim fellowship for studies in the computer processing of speech. WALTER. JOHN PAUL"]},{"title":"TO 1746 Curtis Avenue, Manhattan Beach, California 90266 American Journal of Computational Linguistics","paragraphs":["~i crofiche 37 : 5"]},{"title":"GEORGETOWN UNIVERSITY ROUND TABLE LANGUAGES AND LINGUISTICS 19 76 ' 'Semantics: Theory and Application' ' March 11, 12, 13, 1976","paragraphs":["The theme of the Georgetown University on Thursday evening, on Friday mcr.rine and after-Round Table on Languages and Linguistics"]},{"title":"1976","paragraphs":["noon, and on Saturday morning, March 1 I-? 3"]},{"title":"On is semantics. There","paragraphs":["will br two types of meetings: Friday esening. Georgetown University will hast a (1 ) fourtcen Interest Group Sessions on Thursday budet reception for those attending the Round Table. afternoon, March 1 1; and ( 2 ) four Plenary Sessions","The Interest Group Sessions will provide an opportunicy for informal discussion of various related topics. These sessions will be chaired and their topics wjli be in-troduced by scholars in the various fields. A limit of 25 participants for each Group should provide a manageable interchange of iieas. Acceptance for each group will depend on early preregistratim. On the form below participants should indicate their preferred Interest Group and list any speciiic topic they desire did. Those not registering until the Round Table itself cannot be guaranteed parricipacion in an Interest Group.","The Plenary Sessions will explore the relationship of semantics to various theoretical viewpoints in linguistics, to problems in applied linguistics and to problems in language teaching. The Plenary Sessions will also discuss the relationships of semantics to anthropology, computer science, philosophy, and psychology."]},{"title":"Interest Group Sessions / March 11, 1976 TOPlCS AND CHAIRMEN 1 TEFL: Englisb for Special P~rposes","paragraphs":["James Alatis, Georgetown University","2 Commuaication Slrategies md Modem Lagutage Teaching Frc 'nric Boxo, Georgetown University","3 Tbe Semariics of Tense and Aspect in English Walter A. Cook, S.J , Gecrrgecown University","4 Semantics, Cognition, and ibe Brnin William Orr Dingwall, University of Wryland","5 Linguistics, P~~chorrrtdysis, and Dylramics of Language in Groups Robert DiPietro, Georgerow n University","6 Smantics ad dc Teaching of English to Speakers of Otbcr Didects Ralph Fasold, Georgetown University 7 Litrguistics ad Early Readitzg Robert Lado, Georgetown University 8 Senzantics ad Conzprrter Science R. Ross Mncdonald, Georgetown University 9 Literattrre for Basic Lalrguage Skills Marzieh Samii, Ferdowsi ( Meshed) University","I0 Acquiring MeutaitPg in s Secod Cuhure Muriel Saville-Troike, Georgetown Univer~ity","I 1 Historical Semantics Shaligram Shukla, Georgetown Univefsicy","1 2 Sign Latrguage, Semantics, Semiotics William C. Scokoe, Gallaudet College","1 3 Bilingual Educatf on F. LeRoy Walser, Office of Bilingual Education, USOE","14 Comprehension in &ding Rose Marie Weber, Cornell University"]},{"title":"Plenary Sessions / March I I - r 3, r 976 HALL OF~NATIONS, WALSII BUILDING, 36~~ AND N STREETS, N.W. March","paragraphs":["ll, 7: 30-1O:OO p.m. March 12,2:00-5:00 p.m. Sentattics: Some Synchtotaic d Diachronic Aspact$ Set~nticr md Otbn Discipli#es Dwight Bolinger, Palo Alto, Califom ia Oswald Werner, Northwestern University Winfred"]},{"title":"P. Lehmann, University of Texas,","paragraphs":["Austin Charles Rieger, Univcrslty of Maryland Gilbert Hnrnian, Princeton University Nfomo Caramad, Johns Hopkjns University and","Concordin University","March 12,9:00--12:OO noon hch 13,7:00-12:OO noon Setmntios and Ling~distics S~ntmtics *nd hguagfi Pdagogy Jorge E. Hankamer, Harvard University Frances M. Aid, Florida International University Kay S. Jackendoff, Brandeis University Milton M, Azevedq University of &!orado Geoffrey Leech, Univers~ty of Lancaster Christopher N. Candlin, University of Iancaster Barbara Hall Partee, University of Massachusetts Ragnhild Soderberg, University of Stockholm"]},{"title":"GEORGETOWN UNIVERSITY SCHOOL OF LANGUAGES AND LINGUISTICS Preregistration for the Round Table will NAME: dose March 8. The preregistration fee is LAST (pleare prinu or iype) FIRST MIDDLE INITIAL $6.00; the registration fee is $8.00. Early ADDRESS: preregistration should guarantee participation in the Interest Group desired, but since par- (z+ code) ticipation is limited, preregis&ants should indicate the order of their preference and list PROFESSIONAL AFFILIATION: INTEREST GRCYl.JP any specific","paragraphs":["topic they desire discussed. PREFERENCE: (1)"]},{"title":"-- I (2) -,","paragraphs":["(3),"]},{"title":"-- (4;","paragraphs":["-- SUGGESTIONS FOR TOPI.CS OF DISCUSSION:","Make chechr puyable to GEORGETOWN UNNERSITY.","MAIL TO: Clea Rameh, Chairnta}~ Georgetown University Round Table on Languages and Linguiscra 1976 GEORGETOWN UNIVERSITY WASHINGTON, D.C. 20057 Telephone: (202) 625-302 1"]},{"title":"American Journal of Computational Linguistics ~i crofiche 37","paragraphs":[": 7"]},{"title":"Science and Our Expectations: The Reach and the Grasp Annual Meeting Boston 18-24 February 1976 PROGRAM EXCERPTS EXTRATERRESTRIAL INTELLIGENCE Extrasolar systems, origins of life, Ozma search, beacons, Soviet searches, extragalactic systems, long-range strategies.","paragraphs":["THE"]},{"title":"INTEGRATION OF","paragraphs":["THE NATURAL AND"]},{"title":"SOCIAL SCIENCES Philosophy, humanism, normative factors EDGAR TASCHDJIAN, ERVIN LAZLO, ALFRED","paragraphs":["KUHN"]},{"title":"TELECOMMUNICATION, TRANSPORTATION.","paragraphs":["AND URBAN DEVELOPMENT"]},{"title":"Substitutions for travel, urban growth, alternatives. AAAS MEETING Automatic speech, computer","paragraphs":["programing,"]},{"title":"offices, home terminals, brain-computer hookups.","paragraphs":["THE PERISHING"]},{"title":"PUBLISHING PROSPECT","paragraphs":["FOR"]},{"title":"SCIENTIFIC AUTHORS Economics and a resourceful technology are eroding the comfortable system by which post-World War I1 scientists have gained credit for results of their research. Existing arrangements for citation and indexing for reference","paragraphs":["and"]},{"title":"retrieval are similarly threatened. This Symposium will attempt","paragraphs":["to"]},{"title":"alert scientific authors to trends, opportunities,","paragraphs":["and dangers they must"]},{"title":"face in the next decade, as foreseen by knowledgable communicators with experties","paragraphs":["and"]},{"title":"occupational mandates to define and predict the future. Emphasis in all presentations will be on the impact of imminent changes on individual authors rather than on specialized problems in technical and scientific information transf ern ARRANGED BY HAROLD F. ~SBORNE. ASSISTANT FOR INFORMATION, DEPARTMENT OF MEDICINE AND SURGERY, VETERANS ADMINISTRATION SCIENTIFIC JOURNALSa AN ENDANGERED SPECIES","paragraphs":["Robert A."]},{"title":"Day, Managing Editor, American Society for Microbiology THE PUBLISHING OUTLOOK FOR 1985 AND BEYOND Robert A. Harte, Executive Officer , American Society of Biological Chemists THE CITATION OUTLOOK FOR 1985 AND BEYOND Ben H. Weil, President, National Federation of Abstracting and Indexing Services TRENDS IN TFC!+NOtOGICAL INNOVATION FOR SCIENTIFIC COMMUNICATION Seldci~ W. Terrant,","paragraphs":["Head,"]},{"title":"R&D, Books and Journals Division, American Chemical Society ELECTRONIC ALTERNATIVES TO PAPER-BASED COMMUNICATION H. E.","paragraphs":["Barnford,"]},{"title":"Program","paragraphs":["Director for Access"]},{"title":"Improvement, Off ice of Science Information Service, National","paragraphs":["Science Foundation AAAS MEETING Information sector, information as a commodity, location decisions, productivity, international trade, market aspects, mass production SCIENTIFIC COMMUNICATIONS"]},{"title":"AND THE ADVANCEMENT OF SCIENCE","paragraphs":["Information is"]},{"title":"both","paragraphs":["the input"]},{"title":"of","paragraphs":["raw rraterial and the output"]},{"title":"of","paragraphs":["scientific and engineering activities. Comunica.tions services are the"]},{"title":"means by","paragraphs":["which scientists and engineers are able to build"]},{"title":"upon the results of","paragraphs":["prior work even though"]},{"title":"that work may","paragraphs":["have been done at a distant place or"]},{"title":"in","paragraphs":["a different discipline. Many prestigious committees and study groups have analyzed the"]},{"title":"information problems of scientists and","paragraphs":["engineers"]},{"title":"and offered a","paragraphs":["broad range of recommendations for improvement. But very little has changed. This symposium will review the problems with, and needs for, co~unications services by the scientific community and suggest new approaches to the problem of maintaining an economically"]},{"title":"viable and","paragraphs":["user responsive scientific and technical comunications enterprise in the U.S. Speakers will deal with a variety of specific questions including: What is the role of information in science and engineering? How much progress"]},{"title":"have we","paragraphs":["made in improving information services during the last 10 years? What are the current problems in financial support, or-ganization, and management"]},{"title":"of","paragraphs":["the scientific communication enterprise? What can be done to improve the extisting situation and enhance the value of scientific and technical information services to users engaged in scientific research? ARRANGED BY RUTH M. DAVIS, DIRECTOR, INSTITUTE FOR COMPUTER SCIENCES AND TECHNOLOGY, NATIONAL BUREAU OF STANDARDS, AND JOEL 0. GOLDHAR, PROGRAM DIRECTOR FOR USER REQUIREMENTS, OFFICE OF SCIENCE INFORMATION SERVICE, NATIONAL SCIENCE FOUNDATION PROGRESS IN IMPROVING COMMUNICATIONS AMONG SCIENTISTS Alvin"]},{"title":"M. Weinberg,","paragraphs":["Director, Institute"]},{"title":"for Energy","paragraphs":["Analysis THE ECONOMIC CONDITION OF THE SCIENTIFIC COMMUNICATIONS ENTER-PR I SE Fritz Machlup, Professor of Economics, New York University THE ROLE AND IMPORTANCE OF COMMUNICATIONS IN THE ADVANCEMENT OF SCIENCE J. Herbert Hollomon, Director,, Center for Policy Alternatives,"]},{"title":"MIT AAAS MEETING COMMUNICATING ABOUT SCIENCE TO THE PUBLIC Edwin D. Canham,","paragraphs":["Editor"]},{"title":"Emeritus, Christian Science Monitor NEXT STEPS--A PLAN OF ACTION FOR IMPROVING COMMUNICATIONS SERVICES IN SCIENCE AND ENGINEERING Lewis M. Branscomb, Chief Scientist, IBM Corporation COMPUTERS AND MEDICAL KNOWLEDGE: EXTENDING THE AVAILABILITY AND USE OF KNOWLEDGE IN MEDICINE The symposium explores new directions of development extending the use of medical knowledge via c~mputer-based systems. In one category of such systems, knowledge is extracted automatically from the aggregate of patient records (medical data banks); another category encapsulates and makes available decision making rules of human experts. The program describes the current state of the art in the development of these systems; reviews research in the modeling of clinical decision processes; examines the implications of computer-aided consulting on medical practice and education; and surveys Federal programs which support the training of manpower","paragraphs":["for biomedical"]},{"title":"information","paragraphs":["pro-"]},{"title":"cessing ARRANGED BY VLADIMIR SLAMECKA, DIRECTOR, SCHOOL OF INFORMATION AND COMPUTER SCIENCE. GEORGIA INSTITUTE OF TECHNOLOGY USE OF COMPUTERIZED DATA BASES TO AID IN PATIENT MANAGE h1 DECISIONS R. A. Rosati, Assistant Professor, Duke University Medical","paragraphs":["Centel A PERSPECTIVE ON KNOWLEDGE BASED DECISION SUPPORT SYSTEMS FOR CLINICAL MEDICINE Harry Pople, Co-Director, Medical Information System"]},{"title":"Lab., Pitt. METHODOLOGIES OF RESEARCH IN CLINICAL PROBLEM SOLVI Albert N. Radre, Information","paragraphs":["arid Computer Science, gia Tech. IMPLICATIONS OF COMPUTER-AIDED MEDICAL CONSULTING Ralph"]},{"title":"L. Engle, Jr., Medicine and Public Health, Cornell University THE EDUCATION OF BIOMEDICAL INFORMATION/COMPUTER SCIENTISTS AND PROFESSIONALS: FEDERAL TRAINING PROGRAM Roger W. Dahlen, Chief, Division of Biomedical Medicine, NIH American Journal of Computational Linguistics","paragraphs":["Microfiche 37 : 11 APPLICATION DEADLINES"]},{"title":"NATIONAL ENDOWMENT FORTHEHUVIANITIES MARCH -- OCTOBER, 1976","paragraphs":["FELLOWSHIPS Summer Seminars for College Teachers, 1976 RESEARCH GRANTS Centers of Research, beginning after December 1, 1976 EDUCATION PROGRAMS Education Proj ect Grants, beginning after December 1 EDUCATION PROGRAMS Consultants Grants (beg. 6/15); Planning Grants (L2/1) YOUTHGRANTS Projects beginning after October 1, 1976 RESEARCH GRANTS Research Tools and Editing, beginning after Jan. 1, 1977 PUBLI c PROGRAMS Projects beginning after October 1, 1976 FELLOWSHIPS Fellowships for Independent Study and Research, 1977-78 RESEARCH GRANTS General Research, beginning after January 1, 1977 EDUCATION PROGRAMS Program Grants (177) Consultants Grants (9/15/76) EDUCATION PROGRAMS Development Grants, beginning after' May 1, 1977 PUBLIC PROGRAMS Projects beginning after January 1, 1977 EDUCATION PROGRAMS Consultants Grants, beginning after December 15, 1976 RESEARCH GRANTS Centers of Research, beginning after July 1, 1977"]},{"title":"American Journal of Computational Linguistics Microfiche 37","paragraphs":[": 12 1976 National Computer t?onference, 76 NCC. c o AFIPS. 210 Summit Ave The scientist has prerogatives, duties, and obligations in government, and so do professional societies. Anthony Ralston, president of AFIPS and past president of ACM, will speak on this theme at a plenary session of the 1976 NCC. Federal coxmnissions an privacy and electronic fund-transfer systems are among the developments he cites that raise questions of professionalism, codes of ethics, good conduct, measures of proficiency, public protection, and social and political awareness. Dr. Ralston is professor and chairman of Computer Science in the State University New York Buff a10"]},{"title":". American Journal of Computational Linguistics Mi","paragraphs":["crofi che 37 : i 3 SECOND WORKSHOP ON COMPUTER ARCHITECTURE"]},{"title":"FOR","paragraphs":["NON-NUMERIC"]},{"title":"PROCESSING GAINESVILLE, FLORIDA, JANUARY 22-23, 1976 SPONSORED BY ACM SIGIR,","paragraphs":["SIGMOD, SIGARCH Stanley"]},{"title":"Y. W. Su and G. Jack Lipovski, Co-Chairmen","paragraphs":["PROGRAM FILE OPERATIONS IN A STREAMING PROCESSOR B."]},{"title":"W.","paragraphs":["Jordan, Jr., Northwestern University"]},{"title":"K. J. King, Digital Equipment Corporation G. D. Miller, Bell Telephone Laboratories ARCHITECTURE OF A NONNUMERICAL ACCUMULATOR Yaohan","paragraphs":["Chu, University of Maryland HIERARCHICAL MICROPROCESSOR ORGANIZATION David R. Smith, SUNY, Stony Brook A GENERAL APPROACH TO FUNCTIONALLY DISTRIBUTED COMPUTER ARCHITECTURE A. Reszka, Teletype Corporation"]},{"title":"M. J. Gonzalez, Jr., Northwestern University STUDY OF MACHINE ARCHITECTURES FOR SPECIALIZED INFORMATION RETRI €VAL COMPUTERS B.","paragraphs":["J. Hurley and Duncan Lawrie, University of Illinois, Urbana A SPECIALIZED COMPUTER ARCHITECTURE FOR HIGH-SPEED TEXT SEARCHING David C. Roberts, Central Intelligence Agency AN ARCH1TECTUR.E FOR THE EFFICIENT COMBINING OF LINEARLY ORDERED LISTS Lee"]},{"title":"A. Hollaar, University of Illinois,","paragraphs":["Urbana A MULTIPLE ASSOCIATIVE MEMORY ORGANIZATION FOR PIPELINING A DIRECTORY TO A VERY LARGE DATA BASE"]},{"title":"P. Bruce","paragraphs":["Berra and Ashok"]},{"title":"K. Singhania, Syracuse University WORKSHOP ON COMPUTER ARCHITECTURE A TWO-LEVEL ARCHITECTURE FOR A LARGE DATA BASE Tomas Lang, University of California, Los Angeles Ezatollah Nahouraii, IBM PERFORMANCE EVALUATION OF A RELATIONAL ASSOCIATIVE PROCESSOR E. A. Ozkarahan, S. A. Shuster, and K. C. Sevcik University of","paragraphs":["Toronto A VIRTUAL MEMORY SYSTEM FOR A RELATIONAL ASSOCIATIVE PROCESSOR S. A. Schuster, E. A. Ozkarahan, and"]},{"title":"K. C. Smith University of","paragraphs":["Toronto IMPLEMENTAT I ON OF A CONTEXT-ADDRESSED"]},{"title":"PIPELINÊS1bd-D ARCHITECTURE S. J. Ackerman, A.","paragraphs":["Eman, G."]},{"title":"J. Lipovski, and S. W. Su University of","paragraphs":["Florida SOFTWARE ASPECT OF THE CASSM SYSTEM Atrmed Ernam, StanLey"]},{"title":"Y. W. Su, and G. J. Lipovski University of Florida American Journal of Computational Linguistics ~i","paragraphs":["crofiche 37 : 15 AYERICAM SOCIETY FOR INFORMATION SCIENCE The deputy direccor of the National Library of Medicine was formerly head of the Office of Science Information Service, National Science Foundation. He was chairman of the White House Committee on Scientific and Technical Information; is chairman of the Federal Library Committee s executive committee, a member of the UNISIST advisory committee, and chairman of the Panel on Environmental Quality Information of the Organization for Economic Cooperation and Develo~ment"]},{"title":"American Journal of Computational Linguistics ~jcrofichc 37","paragraphs":[": 16 ANNUAL MEETING OF THE ASSOCIATION FOR"]},{"title":"LITERARY","paragraphs":["&"]},{"title":"LINGUISTIC COMPUTING UNIVERSITY","paragraphs":["OF AMSTERDAM DECEMEIER"]},{"title":"13, 1975 Computer-controlled sampling","paragraphs":["for bilanguage dictionary compilation R. D. BATHURST, UNITED KINGDOM Les activites du Lexique Intellectuel Europeen"]},{"title":"- traitement electronique des textes d'auteurs T. GREGORY, ITALY On lexicographical computing - some aspects of the work","paragraphs":["for a Mexican SpanLsh dictionary I. F. LARA, MEXICO The recognition"]},{"title":"of","paragraphs":["finite verbs in French texts BENTE MAEGAARD, DENMARK Address"]},{"title":"American Journal of Computational Linguistics","paragraphs":["Microfiche 37 : 17"]},{"title":"NATIONAL FEDERATION OF ABSTRACTING AND INDEXING SOCI ETJES INFORMATION Dilemmas, Decisions, Directions","paragraphs":["WEDNESDAY MARCH 10, 1976 30 A.M. 2:00 P.M. - REGISTRATION TUESDAY MARCH 9, 1976 THEME SESSION II I: Indexing in Interactive HEME SESSION I: Current Research Projects Related to Abstracting and lndexing 9:00 A.M. - 1.1:45 A.M. Cha~rrnan Cec G. Burchival (NSF OSIS) Sess~or) Note: The ci~vclo(~mt:r~t of new tcchn:)f ogles has createcl th~! pcterit~i11 ~OI ~mprovemc:r>ts ~ri ~r~forrnat~on svstems. Tht! NSF OSlS IMS taken a Icadlrir~ role 111 supl)ort~n!; I tbsc?arch to contr~t)utr~ to ~ncrcasctl r~atloclill ~~rocluct~wrly through the: IISC of sercnr~f~c and techrlrcal rr~forrnar~orl Ht?ports of some current O~ISIC: r(!sc;:t.:: I)roj(!cts r(!/3[(!0 10 al)stracl~rrq ~~ritl ~rl(it!x~ri(j WIII I)u ~)rt:scrltt!(l.","LUNCH lAfle~)fh!~!s to rr~ilko ow11 ;~rri)~~r)c:~nt~i~Is) HEME SESSION I I: Changing Patterns of Primary Sources 2:30 P.M. 5:00 P.M. c/tillf f?~ifll A. 146)0(1 fJOt)(:rf~ [(:A[-) St!sslo~l Noro Not orlly IS t1i1: tl11;11\\111 y r)f In.Irllilry tlt(!rilt~llf~ ~t!(~l~lt'l~(~ lll(jt!~lll(] ilfl(1 i~t)slrill:flrNJ lrl crc?asirlg, I~trt ZIISO thr? format of tht? pr Irnilry sources is diariqrrr~j. Tllt:sc! rrcw fc)r.milts ~nclu(lc flit review journal, tht: synootlc journal, microforms and videotape. These new clnections have a ciefiri Ite Impact on the abstractllig ;and ~ndux~nq corn munity. 5:OO P.M. - 6:00 P.M.","FEDERATION ASSEMBLY BUSINESS MEET1 NG","6:00 P.M. - 9:00 P.M.","CONFERENCE-WI'DE RECEPTION","at Tho Center of Science and Industry","Sponsored by Cficmical Abstracts Service Systems -- 9:00 A.M. 11 :45 A.M Chairmarl Marv~n Wilson (NTIS) Session Note Inforrnat~orl disserninatlon centers irttlrze hath data t~ases created by the abstiiacting and indexing community and software created by the center Ttiir combination of resources creates t~oth problems and. enrlchme~t in the transfer of ~nformat~on in the intcractivc mode. The identif~catlor~ ot thest! clilernmas will promote new dlscusslor1 ancl (11 rcxt lolls for ~rnl)rovcrl 141ssc.minat1on of ~r~forrnat~ori. MILES CONRAD MEMORIAL LECTURE Presented by Frederick G. Kilgour (OCLC)","CONFERENCE LUNCHEON 12:30 P.M. - 2:00 P.M.","THEME SESSION IV; New Dircctions in User Education - 2:00 P.M. - 4:30 P.M. Chairmarl Roger K. Summit (Lockhced Aircraft","Cor 11.) Session Note: User eciucat~on involves many stynlcnts of the ir~forrnatron community and often lt:ads to fraqrneri tation of the knowlcclgc! r~ccctecl to utilize! the resources ar1r.i services avai lal~lc. Real nccds rnttsl brr iclentific?d and cc,n!r?rlt ~>rc,viclaci in rrcw morics t hill c:rlal)l(: t tie rnultil)l,s irst:rs ~n t hc irlformatiorl ~:tiii~~l to 11ii~xir1ii7tt Ilruir unc.lcrslaricl~r~g 01 malrrrrals provrtlrxt."]},{"title":"American J ournaI of Cornputat ional Linguistics Microfiche 37 .- 18 BIBLIOGRAPHY ISTITUTO PER","paragraphs":["GLI"]},{"title":"STUDI SEMANTICI E COGNITIVI FONDAZIONE","paragraphs":["DALLE MOLLE"]},{"title":"17 RUE DE CANDOLLE 1205 GENEVE I SWITZERLAND The new address is in effect since January 1, 1976. A list","paragraphs":["of reports was printed on"]},{"title":"Microfiche","paragraphs":["22:46. Abstracts can be located through the index."]},{"title":"18. Semantics, preference, and inference. A full description","paragraphs":["of a"]},{"title":"system and","paragraphs":["a"]},{"title":"program. To appear. 19. Frames,","paragraphs":["planes,"]},{"title":"and nets.","paragraphs":["Greg Scragg."]},{"title":"SF40 HC, SF5 MF.","paragraphs":["20. A structure for actions. Greg Scragg."]},{"title":"SF40 HC, SF5 MF'.","paragraphs":["21."]},{"title":"On understanding German noun","paragraphs":["clusters. dolfgang"]},{"title":"Samlowski SF","paragraphs":["20"]},{"title":"HC, SF2.50 MF.","paragraphs":["22. A"]},{"title":"brief on case. Eugene Charniak. SF30 HC, SF","paragraphs":["4 MF."]},{"title":"23. A process","paragraphs":["to"]},{"title":"implement some word-sense disambiguations.","paragraphs":["Philip"]},{"title":"Hayes. February 1976.","paragraphs":["24."]},{"title":"On the referential attributive distinction. Eugene","paragraphs":["Charniak. February"]},{"title":"1976. ISTITUTO PER GLI STUDI SEMANTICI E COGNITIVI","paragraphs":["25. Several ways to be suggestive. Margaret King. February"]},{"title":"1976. 26. Pragmatic aspects of noun cluster understanding in","paragraphs":["German. SF20 NC, SF2.50 MF. Prices of older reports in Swiss Francs: No"]},{"title":"HC MF 1 5.00 3","paragraphs":["2.50 4"]},{"title":"LO. 00 5 4.00 6. 2.50 7. 5.00 2.50","paragraphs":["8."]},{"title":"5.00 2.00 9. 5.00 2.00 1.0. 5.00","paragraphs":["4.00 11. 4.00 12. 5.00 13."]},{"title":"2.50 14.","paragraphs":["2.50 25.00 Proceedings of the Tutorial on Computational Semantics","The Rcrum Familiarium tibrt corn. prises about 350 Latin prose letters"]},{"title":"American Journal of Computational Linguir tics written","paragraphs":["by Franccsco Petrarch to a numhcr of corrcspondents: classical, contenlporary, and some even fictit ious. Dr. Bernardo's translation was recently published by State University of NFW York Press.","The tr;anslation began in carly 1969 when tl~e definl'tivc edition of thc Latin"]},{"title":"Pet rarc h Translated by Computer ,,","paragraphs":[",o,s~"]},{"title":",,, ,,sc, ,,,","paragraphs":["- - keyppnched with pagination and para-SUNY Binghamton linguist finds computer a malor graphing into Binghamton's corntime-saver in work on Petrarch's early letters puter. By that summer an alphabetical","word list of unique forms was ready to","he translated into English. A work some consider to be es- Italian and comparative literature at With a team of five Latinists, Dr. sential to a firm grasp of Humanism SUNY Binghamton. The project was Bernardo entered as many as seven and the Renaissance, the cultural made possible through funding from meanings for each form on speciaI movements that mark the beginning of the SUNY /Research Foundation printout sheets. The alphabetical list-modern times, has been translated","Awards Program, and with the co- ing was then converted into a chrono-with the assistance of the computer by operation of Binghamtoh's Computer logical ordering of the forms, starting Dr. Aldo S. Re.mrdo professor of Center. with the first word of the first letter. Using these he then translated the first eigh;books, or 144 letters, which this","I volume includes.","A concordance of the entire col lection was prod~ced as a sort of by-product. This is to be published by SUNY Press shortly, according to Dr. Bernardo.","Dr. Bemardo believcs the campuler is a great time-saver in translat~ons of this kind. Never have we had in-dimvidual Renaissance Latin forms in so much context, with fivc ur six Latin words before arrd after each kcy word. The very lnetcr of Kcnilissante Latin car1 be studied now bcbcausc of the llugc corltc8xt thcse pririrouts oFft-r,\" hr siiys.","A n~rdol. tr~idrrtilking in humanis~ic rcsc:ircli tllc trnnslalion is tllc first altrl1l pt in Errglish to nlakc 3vailiil~Ic* ; all of I'ctrilrc h s eai.lies[ slid pcrllaps nicat in~parra nt col'lcctiorl of ~)rc~se COMPUTER PRINTOUTS were a constant reference suuwc as Dr. Aldo S. Bcrnardo of SUNY Bingllarnron dictated his rra~rslalion of Pcrrafcb s \"Rcrum Fawiliarium Libri, a cdlcction oi some 350 letters written by the famous Rcnaissance port to a varic~y uf corrcspondrnts. The work has ken published by thc SUNY Press. From Chronica, Published by the Research lcttcrs.","l'hc*. St JNY Kcsc~arcl~ Founda~ion Awards granted llr . Bt-rnarcio included a 815,300'Joitlt Awards Council Award in 1967 (under a special program lastirlg for only one vcar) and a $3200 combination grant.in aid and fellowship awarded in 1969. ~oundation of the State Univer'stiy of New York","Hebc~ ttttlciry","Public Infor~l~atmn Office SUNY Bingllam\\ot~"]},{"title":"American Journal of Computational Linguist ier Mi","paragraphs":["croficl~e 37 : 21"]},{"title":"Stentran Systems, Inc ,","paragraphs":["located at 380"]},{"title":"Maple Avenue, West, in Vienna, Virginia","paragraphs":["22180,"]},{"title":"has","paragraphs":["\"developed a"]},{"title":"program","paragraphs":["for the"]},{"title":"computer translation","paragraphs":["of"]},{"title":"stenotype into English,'' according","paragraphs":["to"]},{"title":"Michael E. LaBarde, Director of Linguistics. Experience with their system was described in two 1975 issues of","paragraphs":["the"]},{"title":"publication of","paragraphs":["the"]},{"title":"National Shorthand Reporters Association by","paragraphs":["Gilbert Frank"]},{"title":"Halasz. The Association has a Committee on Computer-","paragraphs":["Aided Transcription; their"]},{"title":"chairman is Doris 0. Wong, 30 Milk Street, Boston","paragraphs":["02109. A news release from Stectran, dated 1975, states that"]},{"title":"their system can nrovide, besides","paragraphs":["the"]},{"title":"transcription, \"an overview of","paragraphs":["the information"]},{"title":"arranged in","paragraphs":["conceptual"]},{"title":"fashion\"","paragraphs":["\"After"]},{"title":"analysis of the semantic or legal","paragraphs":["road map"]},{"title":"which has","paragraphs":["been prepared for him,\""]},{"title":"the release goes on,","paragraphs":["\"the attorney"]},{"title":"is","paragraphs":["then"]},{"title":"in","paragraphs":["a"]},{"title":"position","paragraphs":["to demand"]},{"title":"additional litigation support from Stentran in","paragraphs":["the"]},{"title":"form","paragraphs":["of"]},{"title":"key words, phrases,","paragraphs":["dates,"]},{"title":"con-","paragraphs":["junctive"]},{"title":"recall of concepts or ideas, or","paragraphs":["any"]},{"title":"verbal patterns which he","paragraphs":["feels can asist"]},{"title":"him in reaching","paragraphs":["legal"]},{"title":"conclusions. I! American Journal of Computational Linguistics","paragraphs":["Microfiche 37 : 22 DREXEL I.l\"URRY QUARTERLY COVERS CURREII'T ISSUES 1"]},{"title":"N","paragraphs":["SERI4LS"]},{"title":"L","paragraphs":["I DP\\ARIA?ij!l! P ..I... ---.----.--.-.--- - ---. . .. * -II.-__"]},{"title":"_ _","paragraphs":["------ -.-"]},{"title":"PHiLACELPHIA--The Drexel","paragraphs":["Library"]},{"title":"Quarterly,","paragraphs":["Volume 11"]},{"title":",","paragraphs":["no. 3, e~aeinei"]},{"title":"- \"Current issues in Seris","paragraphs":["i; l ibrari~rlship."]},{"title":"\"","paragraphs":["Serials 1"]},{"title":"ibrarians","paragraphs":["ofte"]},{"title":"difficulty","paragraphs":["ident to"]},{"title":"their work. are","paragraphs":["affecting"]},{"title":"on- the-job","paragraphs":["! I The a~ticies"]},{"title":", selected for their tinel iness , often cmphasi","paragraphs":["ze the"]},{"title":"r;;anner in","paragraphs":["\\vhich"]},{"title":"sarials librarians can","paragraphs":["have"]},{"title":"impact","paragraphs":["upon the issues"]},{"title":"un Oeni","paragraphs":["ta"]},{"title":"Meber, Serials","paragraphs":["Librarian of"]},{"title":"Nontgomery County (pa.","paragraphs":[")"]},{"title":"Con~uni ty College, and","paragraphs":["Toni"]},{"title":"Carbn Bearvan,","paragraphs":["Executive"]},{"title":"Director","paragraphs":["of the Natiocal"]},{"title":"Federation","paragraphs":["of Abstracttirig"]},{"title":"and Indexing Services, are","paragraphs":["guest"]},{"title":"editors for the issua Articles included","paragraphs":["in the"]},{"title":"iswe are:","paragraphs":["\"The Serials Librarian As Activist\" It I- I.","by David"]},{"title":"C.","paragraphs":["Taylor;"]},{"title":"Itain cn~ry for Serials\"","paragraphs":["by Joseph J. H~!qard, \"ISR[I.!S)"]},{"title":"and","paragraphs":["Title Main Entry"]},{"title":"for Serials\" by C. Sumner Spalding; \"International b Cooperation in Serials\"","paragraphs":["by Jos~oh !4. I'rice; \"Hatiorla1 Sclris I I"]},{"title":"by Mary Sauer;","paragraphs":["\"The CO#SER"]},{"title":"Project.\"","paragraphs":["by"]},{"title":"Paul","paragraphs":["Y"]},{"title":"assall","paragraphs":["o; \"COASER Int-br-Re1 a-ti"]},{"title":"onships\" by Lawrence G.","paragraphs":["'Seriql:; : Costs and"]},{"title":"Budget Projections\"","paragraphs":["hy"]},{"title":"F.F.","paragraphs":["Clasquin; and \"Education of"]},{"title":"Serials Librariansu Copies of Vol . 11, no Serials","paragraphs":["Librarianship,\""]},{"title":"are available","paragraphs":["for $4 each ( obtside the iJSd"]},{"title":"::nd","paragraphs":["Canad?)"]},{"title":"froin","paragraphs":["the Orexel Library"]},{"title":"Quarterly, Graduate","paragraphs":["Schou l of li brary Sci"]},{"title":"crlce, Philadelphia, Pa.","paragraphs":["19104. Telephone: 21 5-895-2"]},{"title":"American Journal if Computational- Linguistics Microfiche 37","paragraphs":[": 23 HARRY W. HOEMANN, VICKI A. FLORIAN, AND SHIRLEY A. HOEMANN Bowling Green State University Ohio 43403 Stokoe (1960) has designed a model of the structure of the"]},{"title":"American Sign","paragraphs":["Language (ASL)"]},{"title":"which is amenable to computer simulation. He has proposed that signs comprising the ASL lexi-con are composed of three basic aspects, location (TAB), hand configuration I (DEZ) , and movement (SIG) . He has identified a finite number of each of these elements, and he has proposed that they may be combined in various ways to constitute recognizable and meaningful signs. Recent reformulations have ven-","paragraphs":["tured some modifications (e.g., Stokoe,"]},{"title":"1972), but the basic approach remains the same. Such a conceptualization of ASL implies that if a computer were furnished a set of each of these types of elements, it","paragraphs":["ought to Acknowledgments. This investigation was supported by NIH Research Grant NS-09590-05 from the National Institute of Neurological Diseases and Stroke. We thank the J. Preston Levis Regional Computer Center, Perrysburg, Ohio, and Charles M. Bernstein, Bowling Green State University, for assistance. AMERICAN"]},{"title":"SIGN LANGUAGE Microfiche 37","paragraphs":[": 24 be able to compile the signs that are composed"]},{"title":"of the features in its","paragraphs":["repertoire It needs to"]},{"title":"be emphasized that such a com-","paragraphs":["puter simulation is not merely a matter of cartooning, although this lies within the capability of computer graphics to portray. METHOD APPARATUS. Our principal apparatus was an Owens-Illinois Digivue Plasma Display Unit attached to a Nova"]},{"title":"1220 minicomputer The Digivue Display Unit is an electronic device with a gasfilled display matrix and activating circuitry. An electrical signal is passed","paragraphs":["through each"]},{"title":"of two very","paragraphs":["fine wires at"]},{"title":"right angles to one","paragraphs":["another. When the gas is activated, it lights up at the poiat of intersection. There are"]},{"title":"512","paragraphs":["grid lines in each direction, making a total of"]},{"title":"262,144 addressable points. Points can be written or erased at the rate of 50,000 dots per second. The program language used was Graphic Basic,","paragraphs":["a version"]},{"title":"of Data General Corporation's time-shared BASIC,","paragraphs":["modified for use with the Digivue Display Unit (Fulton,"]},{"title":"1974). Access to the computer was gained through the Digivue keyboard and through a teletypewriter. Paper tape output from the teletypewriter provided permanent storage of previously written programs. PROCEDURE. AS a concession to storage limitations,","paragraphs":["the project was, at first, limited to one-handed signs located on or near the face. An oval shape with stylized browline, nose, and mouth was stored in memory and served as the reference for any"]},{"title":"sign","paragraphs":["which the computer was required to generate Hand co~~figurations"]},{"title":"(DEZ) were constructed","paragraphs":["by"]},{"title":"joining coordinate","paragraphs":["points"]},{"title":"with line segments.","paragraphs":["The points were stored in the memory of the computer, and graphic commands were issued to form the line segments. As a program was fed into the computer, it stored in memory information about the DEZ and the initial TAB"]},{"title":"while","paragraphs":["the face was drawn on the screen. Another series of subroutines drew the DEZ"]},{"title":"in its initial","paragraphs":["TAB and"]},{"title":"moved it to another TAB so as","paragraphs":["to"]},{"title":"represent a movement (SIG).","paragraphs":["If the sign required a change"]},{"title":"of","paragraphs":["DEZ, the"]},{"title":"program","paragraphs":["could"]},{"title":"call","paragraphs":["the new DEZ up"]},{"title":"from","paragraphs":["memory and"]},{"title":"place it in","paragraphs":["the sign's final position."]},{"title":"VALIDATION. The adequacy","paragraphs":["of the simulated signs rests"]},{"title":"with","paragraphs":["their intelligibility. Deaf and"]},{"title":"hearing persons who were fluent users","paragraphs":["of ASL were tested to verify that the graphic display yielded signs that could be recognized as part of the ASL lexicon. RESULTS AND DISCUSSION Thus far 11"]},{"title":"DEZ,","paragraphs":["8"]},{"title":"TABs, and 7 SIGs","paragraphs":["have been programed and stored on a single paper tape. If disc storage and the necessary interface were added to our Nova, it is likely that we could represent all 12 TABs, 19 DEZ, and 24 SIGs identified by Stokoe as primes of his model. Meanwhile, the subset of structural features programed thus far constitute a suitable feasibility study of a computer simulation of ASL."]},{"title":"The following results have been achieved It","paragraphs":["has been verified that the features of"]},{"title":"ASL identified by","paragraphs":["Stokoe as structural elements may also function as distinctive features."]},{"title":"The same DES","paragraphs":["and SIG executed"]},{"title":"with different TABs may result in signs with","paragraphs":["different"]},{"title":"meanings","paragraphs":["(father"]},{"title":"and mother, summer and dry in our data).","paragraphs":["The same TAB and"]},{"title":"SIG executed with different DEZ may also result in signs with different","paragraphs":["meanings (who and lipread in our data). Finally, the same DEZ and TAB"]},{"title":"with","paragraphs":["different SIGs may also result"]},{"title":"in signs with","paragraphs":["different meanings (summer and wise, face and who"]},{"title":"in our data) .","paragraphs":["Secondly, if any one of these aspects"]},{"title":"(TAB,","paragraphs":["DEZ, or SIG) of a sign is altered, the resulting sign compiled by the computer is 1)"]},{"title":"likely to be nonsense\" in ASL. In our data, the 11","paragraphs":["DEZ,"]},{"title":"8 TABs, and 7 SIGs yield potentially 11 x 8 x 7 or 616 signs. Over 600 of them are nonsense. This indicates that most signs in ASL differ","paragraphs":["from one another in more than one distinctive feature. Also, since many signs change"]},{"title":"DEZ and involve more than one SIG, there is a low probability of confusing one sign with another, even when the signs are presented out","paragraphs":["of context. Finally, our data indicate that the orientation of the hands also constitutes a distinctive feature in ASL. Inappropriate hand orientation can disrupt intelligibility even when the other three aspects are compiled correctly. Stokoe's model seems to be"]},{"title":"sufficiently robust","paragraphs":["to"]},{"title":"assimilate","paragraphs":["the"]},{"title":"required revision without altering his basic approach. This computer simulation of ASL was limited","paragraphs":["to"]},{"title":"the structural features","paragraphs":["of"]},{"title":"individual signs, and it corresponds","paragraphs":["to a"]},{"title":"study of","paragraphs":["the"]},{"title":"phonological structure of spoken languages. (Stokoe refers","paragraphs":["to"]},{"title":"his analysis","paragraphs":["as CHEROLOGY"]},{"title":"after the Greek","paragraphs":["chcir"]},{"title":"or","paragraphs":["hand .)"]},{"title":"No attempt was","paragraphs":["made"]},{"title":"in this simulation","paragraphs":["to present"]},{"title":"the","paragraphs":["signs"]},{"title":"in","paragraphs":["a"]},{"title":"linguistic context or to represent","paragraphs":["the structure of AS"]},{"title":"sentences Future studies are planned in which the graphic di~play","paragraphs":["of"]},{"title":"individual signs will be subject","paragraphs":["to"]},{"title":"systematic distortion to discover whether TAB or SIG aspects of signs are perceived categorically by native users of","paragraphs":["ASL. REFERENCES"]},{"title":"Fulton, D. L. A Plasma-Panel interactive graphic system. Proceedings of the","paragraphs":["Society for Information Displtay"]},{"title":"15(2)","paragraphs":[":"]},{"title":"74-80,","paragraphs":["1~14. Stokoe,"]},{"title":"W. C.,","paragraphs":["Jr. Sign Language"]},{"title":"structure: An outline","paragraphs":["of"]},{"title":"the visual communication system","paragraphs":["of the American deaf. Studies in Linguistics, Occasional Papers 8."]},{"title":"University of","paragraphs":["Buffalo"]},{"title":"Press","paragraphs":["1960. Stokoe,"]},{"title":"W.","paragraphs":["C. Jr. semiotics and human sign languages. Mouton, The"]},{"title":"Hague,","paragraphs":["1972."]},{"title":"American Journal of Computational Linguistics Microfiche 37 28 MAKOTO NAGAO AND JUN-ICHI TSUJII Department of Electrical","paragraphs":["Engineering Kyoto"]},{"title":"University Kyoto,","paragraphs":["Japan ABSTRACT","PLATON (Programming LAnguage for Tree OperatioN) facilities of pattern matching and flexible backtracking, language is developed t~ simplify writing analysis programs The pattern matching process has the facility to extract sub-input sentence and invoke semantic and contextual checking fo?. actions between syntactic and other components are easily obt processing results in a failure, a message which expresses t: failure will be sent up. The control will be modified accoru enables us to write fairly complicated non-deterministic progr manner. An example of structural analysis using PLATON is als - ,le 1. The 1 language Erom thc","Intc"]},{"title":"- -.","paragraphs":["rf","Ise of . Th i :-",";in:; ed \" I Introduction In this paper we describe a new programming language which is designed to facilitate the writing of natural language grammars. A simple structural analysis program using this language is given as an example. There are two key issues in analyzing natural language by computer: 1) how to represent knowledge (semantics, pragmatics) and the state (context) of the world, and 2) how to advance the programming technology appropriate for syntactic-semantic, syntactic-contextual interface. The point in designing a programming language is to make this kind of programming less painful. Tradi tima1 systems whi.ch represent grammars as a set of rewriting rules ustially 'have poor control mechanisms, and flexible interaction between thc syntact LC and other con~ponents is not possible. Systems in which rules of gr-;lnmlilrs .rlrc cn11,i-dilcd in proccdrlrcs, an. tllc other hand, make it possiblc to int t-rmis ttrct 6 yrltnc t 'lc and seniant ic anaIyst?s in an i r~tiinnte way. Llowcvcr, thest. systcos are apt. t.0 c.lestroy the intc.lligih:il ity and regularity of natural language gramars, because in these systems both rules and their control mechanisms are contained in the same program. Recently various syscems for natural language analysis have been developed T. Winograd's (1971) \"PROGRAMMAR\" is a typical example of procedure oriented systems. In this system the syntactic and other components can interact closely in the course of analyzing sentences. However, details of the program are lost in the richness of this interaction. LINGOL, developed by V. Pratt (1973) at MIT, is a language appropriate to syntax-semantics interface and in which it is easy to write grammars in the form of rewriting rules. The TAUM group at Montreal University (1971) has evolved a programming languagc name :I System-Q in which expressions of trees, strings and lists of them can be matched against partial expressions (structural patterns) containing variables and can be transformed in any arbitrary fast1 i 011. Thc augmcn tcd t ri111~ i L I on ilc twork (A1l'N) proposccl by W Woods (19 70) from our point of view gives an especially good framework for natural Xa~~guage analysis systems. One of- the most attractive features is the clear dtscrimination between grammatical rules and the control mechanism. This enables us to develop the model by adding various facilities to its control mechanism. The ATN model has the following additional merits :. 30 1. It provides power of expression equivalent to transformational grammars 2. It mai11tai.n~ much of the rendability of context-free grammars. 3. Rules of n grammar can be changed easily, so we can improve them through a t rial-and-error process whi1.e writing the grammar. 4. It is possible to impose various types of semantic and pragmatic conditions on the branches between states. By doing this, close interactions between the syntactic and other components can be easily accomplished. However ATN has the following shortcomings, especially when we apply it to the parsing of Japanese sentences: 1. It scans words one-by-one from the leftmost end of an input sentence, checks the applicability of a rule, and makes the transition from one state to another. This method may be well suited for English sentences, but because the order of words and phrases in Japanese sentences is relatively free, it is preferable to check the applicability of a rule by a flexible pattern-matching method. In addition, without a patte rn-matching mechanism, a single rewriting rule of an ordinary grammar is often to be expressed by several rules belonging to different states in Woods ATN parser. 2. An ATN model essentially performs a kind of top-down analysls of sentences. Therefore recovery f ronl failures in predictf.on is most d1.f ficult. Considering these factors, we developed PLATON (a Programming Lhnguage for Tree-Ol>cratioN), which is based on the A1'N model and has various additional capabilities such as pattern-matching, flexible backtracking, and so on. As in SystewQ and LINGOL, PLATON's pattern-matching facility makes it easy to write rewriting rules. Moreover, it extracts substructures from the inputs and invokes appropriate semantic and contextual checking functions. 31 These may be arbitrary LISP functions defined by the user, the arguments of whi~n are the extracted substructures. A backtracking mechanism is also necessary for langu~e understanding as in other fields of artificial intelligence. During the analysis, various sorts of heuristic information should be utilizable. At any stage, analysis based on criteria which may relate to syntactic, semantic or contextual considerat ions taken separately may be unreliable. The result which fulfils all the criteria, however, will be a correct one. The program should be designed such that it can choose the most satisfactory rule from many candidates according to the criteria at hand. In further processing, if the choice is found to be wrong by other criteria, the program must be able to backtrack to the point at which the .relevant decision was made. In PLATON we can easily set up arbitrary numbers of decision points in the program. Then, if subsequent processing results in some failure, control will come back to the points relevant to the cause of the failure. 11. Pattern-matching Before proceeding to the detailed description of PLATON, we will explain the representation schema for input sentences and parsed trees. The process of analyzing a sentence, roughly speaking, may be regarded as the process of transforming an ordered list of words to a tree structure, which shows explicitly the interrelationships of each word in the input sentence. During the process, trees which correspond to the parts already analyzed, and 1hts which have not been processed yet, may coexist together in a single structure. We therefore wish to represent such a coexisting structure of trees and lists. A list structure is a structure in which the order of element is not changeable. On the other hand, a tree structure consists of a single root node and several nodes which are tied to the root node by distinguishable relations. Because relations between the root and the other nodes are explicitly specified, the order of nodes in a tree is changeable except for the root node which is placed in the leftmost position. Different matching schemas will be applied to trees and lists. The formal definition of such coexisting structures is as follows. <structure> is the fundamental data-structure into which all data processed by PLATON must be transformed. Hereafter we refer to this as the \"structure\" The formal definition of <structure) is: (list) ::= ($ ts tructures> ) (structures> : :="]},{"title":"1 <structure>","paragraphs":["( structures"]},{"title":"> <tree>","paragraphs":[": := ( node,"]},{"title":"I","paragraphs":["( (node)"]},{"title":"< branches)","paragraphs":[") <branches> : := (brancl~)"]},{"title":"1 (branch, branches","paragraphs":[") (branch) ::= (<relation> (tree, ) ( node, : := Clis t"]},{"title":"> I !UBITRARY LISP-ATOM < relation >","paragraphs":[": := ARBITRARY LISP-ATOM A simple example is shown in Figure 1.","Coexisting Structure of Trees and Lists","Corresponding Expression in PLATON Figure 1 Expression of Structure in PLATON Two lists which have the same elements but different orderings (for example, (X A B C) and ($ A C B))"]},{"title":", should be regarded as different structures. On the other hand, two tree structures such as","paragraphs":["( A ( R1 B ) ( R2 C )) and ( A ( R2 C )( R1 B )) are regarded as identical. Besides the usual rewrite rules which treat such strings, s tructural patterns which contain variable expressions are permitted in PLATON. The PLATON-interpreter matches structural patterns containing variable expressions against the structure under process and checks whether the specified pattern is found in it. At the same time, the variables in the pattern are bound to the corresponding subs tructurzs"]},{"title":". Variables in patterns are indicated as :X (X is an arbitrary LISP atom).","paragraphs":["The following can be expressed by variables in the above definition (1) arbitrary numbers of"]},{"title":"< structures> , that is to say,","paragraphs":["list elements in the definition of"]},{"title":"< list > (Figure 2, Ex. 1). We can also specify the Structural Pat terns Structures Results of Matching Example 1 SUCCESS","paragraphs":["In A :K C C Example 2 SUCCESS SUCCESS Figure 2 Illustration of Matching 34 number of list elements by indicating variables as :X+number. For example, the variable :D2 will match with two elements in a list. (2) arbitrary numbers of <branches"]},{"title":"> ,","paragraphs":["in the definition of (tree"]},{"title":"> (Figure","paragraphs":["2, Ex. 2). (3)"]},{"title":"< tree) in the definition of < branch) (Figure 2, Ex. 3). We","paragraphs":["shall fail such structural patterns (structure-1"]},{"title":"> . By using the same variable several times","paragraphs":["in a pattern, we can express a structure in which the same sub-structure appears in two or more different places. The character ! in a list indicates that the next element following the character is optional. 111 Basic Operations of PLATON A grammar, whether generative or analytical. is represented as a directed graph with labeled states and branches. There is one state dis tinguished as the Start State and a set of states called Final States. Each branch is a rewriting rule and has the following elements: (1) applicability conditions of the rule, typically represented as a structural pattern (2) actions which must be executed, if the rule is applicable (3) a structural pattern into which the input structure should be transformed. Each state has several branches ordered according to the preference of tho rules. When the control jumps to a state, it checks the rules associated with the state one-by-one until it finds an applicable rule. If such a rule is found, the input structure is transformed into another structure specified by the rule and the control makes the state transition. 35 In addition to the above basic mechanism the system is provided with push-down and pop-up operations. The push-down operation is such that in the process of applying a rule, several substructures are extracted from the whole structure by variable binding mechanisms of pattern-matching. Then each is analyzed from a different state. The pop-up operation is such that after each substructure is analyzed appropriately, control comes back to the suspended rule and execution continues. Usills these operations, embedded structures can be handled easily (See Figure 3)"]},{"title":". Fipure 3 State Diapram Table 1 shows the formal definition cf a grarmr of PLATON (See follow-","paragraphs":["ing page). It shows that branches or rewriting rules in an ATN parser correspond to six-tuples (i e., (pcon)"]},{"title":", <strx> , dcon> ,","paragraphs":["( c transr )"]},{"title":",","paragraphs":["( 4acts> )"]},{"title":", dendb . <strx> corresponds to the left side of a rewriting rule and describes the structural pattern to which","paragraphs":["a rule is applicable. ( strx"]},{"title":"> is, by definition (1)","paragraphs":["/ or (2) s truc ture-1 TABLE 1 Formal Definition of Grammar in PLATON (states, :: = <state>"]},{"title":"1 <state> 4states> 4 rules) . . - crule> <rules>","paragraphs":["-="]},{"title":"- I 4 rule > .. . .","paragraphs":["= ( ( pcon) cstrx, <con> ( <trans> ( 4 acts? tend 3 )"]},{"title":"< trans> .. . .","paragraphs":["="]},{"title":"I < transi0C trans, Iregister-name, < transit,","paragraphs":[": : = (( (state-name"]},{"title":", <structure-2>","paragraphs":[") derrorps) 4 variable-nam-4 pros,"]},{"title":"..","paragraphs":["-"]},{"title":". . - <pro> I <pro> 4 pros> 4 pro > ..","paragraphs":["="]},{"title":".. (EXEC <trans>","paragraphs":[") I(TRANS ( (state-name> 4stsy> )) (end '>"]},{"title":".. ..","paragraphs":["= (NEXT estate-name) <stry>"]},{"title":"I (NEXTB 4s ta te-name> rstry 2","paragraphs":[") ((POP 4 stry> )"]},{"title":"I","paragraphs":["(FM < failure-message ) .facts>"]},{"title":".. . .","paragraphs":["="]},{"title":"I 4 act><acts> <set >","paragraphs":[": : = <form"]},{"title":", I (SR (register-name> d form> I (SU 4 regis ter-name","paragraphs":["> < form > ) ~(SD <register-name > cf orm. )"]},{"title":"< strx > ..","paragraphs":["="]},{"title":". . <structure-I> 1","paragraphs":["/ <s try,"]},{"title":"..","paragraphs":["="]},{"title":". . <structure-2, 1 1 dpcoTl),<con>","paragraphs":[": : = <form> ( form) : : = (GR .<register-name> )"]},{"title":"I (GV (variable- name >","paragraphs":["? ~(TR structure-2. ) I(TR /)"]},{"title":"1 ARBITRARY LISP FORM <variable-","paragraphs":[":: = :X (X is an arbitrary LISP atom) name 7","<register- : : = /X (X is an arbitrary LISP atom) name) shows that a rule is applicable no matter what the structure under process is The variables used in (structure-1) are bound to corresponding substructures when matching succeeds. The results of Example 1 (See Figure 2) indicate that the variable :K is bound to the substructure (* ( B ( R1 C)) D ) The scope of variable binding is limited to within the realm of the particular rule. The same variable name in different rules has different interpretations. In this sense, :X-type variables in"]},{"title":"<","paragraphs":["s tructure-I> are called Local Variables. On the other hand, w2 can store certain kinds of results from the application of rules in registers and refer back to them in different rules. These cons tftue variables which we call registers. They are represented by the symbols /X (X is an arbitrary LISP atom). Besides the pattern-matching, < peon> and"]},{"title":"<","paragraphs":["con ) can .~lso check the applicability of a rule. Certain parts of the results from the application of previous rules are contained in registers, not in the structure. We can check the contents of these registers by using < pcon"]},{"title":"> -part functions like GR,","paragraphs":["GU, etc. (these functions are listed in Table 2) and other LISP functions defined by the usual LISP function, DEFINE. (See following page for Table 2.) Semantic and contextual co-ordinatian between substruetures can be checked by using appropriate functions in the (con >-part of a rule. Semantic and contextual analyses cannot be expressed in the form of simple rewriting rules. These analyses have differing requirements such as lexical information about words which may in turn represent knowledge of the world and contextual information which may. express the state of the world. We can use arbitrary LISP-forms in the 4 con"]},{"title":"7 -part, according to what semantic and contextual models we choose. TABLE","paragraphs":["2 Functions of PLATON w Func t ion SR SV GR GV Argument","(regis ter-name> LISP"]},{"title":"-","paragraphs":["< form>","4 var iab le-nam-LISP"]},{"title":"- 4 form> (regis","paragraphs":["ter-name> (variab le-name> Effect SR stores the result of the evaluation of the 2nd argument in the register. SV stores the result of the evaluation of the 2nd argument in the variable GR get the content of the register GV gets the value of the variable TR SU SD GU PUSHR 4 Value"]},{"title":".-","paragraphs":["- the result of the evaluation of the 2nd argument A the result of the evaluation of the 2nd argument the content of the register the value of the variable"]},{"title":"I","paragraphs":["<structure-2, or / ,","rregis ter-name, LISP"]},{"title":"- 4 form) Cregis ter-name LISP - <form>","paragraphs":["(register-name>","4 regis ter-name > LISP"]},{"title":"- 4","paragraphs":["form) , TR transforms the varizbles and registers in the structural pattern into their values.","SU sets the reigster of the - higher level processing SD sets the register of the the transformed structure the result of the evaluation of the 2nd argument I lower level processing. GU gets the content of the register of the higher level. PUSHR is defined as the following.","(SR r regis ter-name>","(CONS 4 form,","(GR <register-","name3 1 1) the result of the evaluation of the 2nd argument the content of the register the result of the evaluation of the 2nd argument For example, suppose strx = ( ADJ ( TOK :N ))( N(TOK :N1 )) :I ) con = ( SEM :N :N1 ) Here TOK is the link between a word and its part of speech. :N and :N1 are the words of an input sentence. SEM is a function defined by the user which checks the semantic co-ordination between the adjective :N and the noun :N1. By this function SEM, we can search, if necessary, through both lexical entries and the contextual data bases. Uith this approach, if a certain syntactic pattern is found in the input structure, it is possible for an appropriate semantic runction to be called. Hence the intimate iiitcrcctions between syntactic and semantic components can be obtained easily without destroying the clarity of natural language grammars. Arbitrary LISP-forms can be also used in <act> -portion. They will be evaluated when the rule is applied. If necessary, we can set intermediate results into registers and variables by using the functions listed in Table 2 (end"]},{"title":">","paragraphs":["comprises f~ur varieties, and rules are divided into four types according to their ( end"]},{"title":">","paragraphs":["types. 1. NEXT-type : The"]},{"title":"< end+","paragraphs":["is in the form (NEXT dstate-name, 4 s try> )"]},{"title":". The","paragraphs":["bstry) corresponds to the right side of a rewriting rule, and represents the transformed structure. A rule of this type causes state-transition to the dstate-name)"]},{"title":", when","paragraphs":["it is applied. 2. NEXTB-type: This rule also causes state-transition. Unlike with the NEXT-type, state-saving is done and if further processing results in some failures, control comes back to the state where this rule is applied. The environments, that is, the contents of various registers will be restored, and the next rule belonging to this state will be tried 40 3. POP-type : The (end"]},{"title":"> -part of this type is in the form (POP <s try >","paragraphs":[") When it is applied, the processing of this level is ended and the control returns to the higher level with the value stry"]},{"title":"> . 4.","paragraphs":["FM-type: The <end )-part of this type is in the form (FM <failure-message) ). The side effects of he processing at this level, that is, register settings and so on, are cancelled (see section 4). In <stry"]},{"title":">","paragraphs":["we can use two kinds of variables, that is, the variables used in dstrx"]},{"title":">","paragraphs":["and registers. We find this structural pattern, called 4s tructure-2"]},{"title":"> , more","paragraphs":["suitable for writing transformational rules than Woods BUILDkoperation. By way of illustration consider the following: input string = CDE(A(Rl(* B)))FG) strx ="]},{"title":"(8 :I","paragraphs":["( A ( Rl :N )) :J ) StrgT = (* (A ( FU (* :I :N ))( R2 /REG )) :J) the content of /REG = (G ( R3 H )) As the result of matching, the variables :I, :N and :J are bouad to the substructures (& C D E ), ($ B) and (3 F G ) respectively. The result of evaluating the"]},{"title":"<","paragraphs":["stry"]},{"title":">","paragraphs":["is ( ( A ( R1 (# C D E B ))( R2 ( G ( R3 H )))) F G ). If the rule is a POP-type one, then this structure will be returned to the higher level processing. If it is NEXT- or NEXTB-type, then the control will move to the specified state with this structure. IV Push-down and Pop-up Operations By means of NEXTB-type rules, we can set up decision points in a program. We can also do this by using push-down and pop-up operations. A rule in PLATON finds particular syntactic clues by its structural description ( strx> ; and at the same time, extracts substructures from the input st'king From the structural description it is predicted that the substructures may have particular constructions, that is, they may comprise noun phrases, relative clauses or whatever. It is-necessary to transfer the subst~r~ctures to states appropriate for analyzing these constructions predicted and to return the analyzed structures back into the appropriate places In PLATON, these operations can be described in the Ctrans"]},{"title":"> -part of a","paragraphs":["rule. For example, suppose the <trans >-part of a rule is ( (( Sl :K :K )) (( S2 ( :I :J)/REG )) ) When the cantrol interprets this statement, the substructures corresponding to the varuble :K and ( :I : J ) are transferred to the states S1 and S2 respectively If the processings starting from these states are normally completed (by a POP-type rule), then the results are stored i? the variable :K and the regzster /REG. In this manner, by means of the push-down and pop-up mechanisms, substructures can be analyzed from appropriate states. Processing from kese states, however, may sometimes result in failure, That is, predictions that certain relationships will be found among the elements of substructures may not be fulfilled. In such instances the pushed down state will send an error-message appropriate to the cause of the failure by an Wtype rule. An FM-type rule points out that a certain error has occurred in the processing. If NEXTB-type rules were used in the previous processing at this level, control will go back to the most recently used NEXTB-type rule. If NEXTB-type rules were not used at this processing level, tne error-message specified by the FM-type rule will be sent to the <trans> part of the rule which directed this push-down operation (see Figure 4) Higher level Lower level p processing"]},{"title":"-------------","paragraphs":["/","/ \\ / \\ I \\ / \\ rocessing~ \\ ---I"]},{"title":"-","paragraphs":["I \\"]},{"title":"I","paragraphs":["\\"]},{"title":"i","paragraphs":["\\"]},{"title":"/ NExTB-type rules were not applied in this level Lower level processing c---- ---- /This rule will be applied next. Figure","paragraphs":["4 Illustration of Backtracking 43 According to these error-messages, control-flow can be changed appropriately. For example, we can direct processings by describing the 4 trans"]},{"title":"> -part in the following way.","paragraphs":["( (("]},{"title":"sl :K :K","paragraphs":[")( ERR1 ( EXEC (( S5 :K :K 1) (( 56 ( :I :J ) /REG )))) ( ERR2 (TUNS ( S8"]},{"title":"/))I ((S2","paragraphs":["(j6 :I :J ) /REG )) ) In the above example, the processing of the substructure :K from the state S1 will produce one of the following three results. According to the returned value, the appropriate step will be taken: (1) Normal return: the processing of :K is ended by a POP-type rule. The result is stored in the variable :K and the next push-down performed, that is :I : J ) will be transferred to the state S2. (2) Return with an error-message: the processing of :K results in a failure and an FM-type rule sends up an error-message. If the message is ERR1, them :K and :f :J ) will be analyzed from the states S5 and S6 respectively (EXEC-type). If it is ERRS, the interpreter will give up the application of the present rule, and pass the control to another state S8 (TRANS- type). If it is neither ERRl nor ERR2, the same step as (3) will be taken (3) Re turn with the value NIL: the processing Prom the state S1 will send up the value NIL if it runs into a blind alley, that is, there are no applicable rules. The interpreter will give up the application of the present rule and proceed to the next rule attached to this state. Mechanisms, such that control flow can be appropriately changed according to the error-messages from lower level processings are not found in Woods ATN parser, We can obtain flexible backtracking facilities by combining these mechanisms with NEXTB- type rules. V A Simple Example We are now developing a deductive question-answering sys tern with natural language inputs"]},{"title":"--","paragraphs":["Japanese sentences. The internal data-base is assumed to be a set of deep case structures of input sentences. We adopted and modified Fillmore's (1968) case grammar to analyze the input of Japanese sentences. Japanese is a typical example ofan SOV-language in which the object and other constituents governed by a verb usually appear before :he verb in s sentence. A typical construction of a Japanese sentence is shown in Figure 5.","Figure 5 Typical Construction of a Japanese Sentence A verb may govern several noun phrases preceding it. A relative clause modifying a noun may appear in the form"]},{"title":"-- verD","paragraphs":["+ noun"]},{"title":"--","paragraphs":["The right boundary of the clause is easily identified by finding the verb. The left boundary is often much more difficult to identify. In Figure 5, the noun phrase NPkr is a case element of the verb V On the other hand, the noun phrase NPi is governed by the verb Va Because the rule of projections holds in JaFnese as in other languages, all the noun phrases between NP c'+ I and V are governed by V"]},{"title":", and the noun phrases","paragraphs":["before NP,: are governed by VA However, in the cou.rse of analysis, such boundaries cannot be determined uniquely. The analysis program fixes a temporary boundary and proceeds to the next step in processing If the temporary boundary is not correct, the succeeding processing will fail and the control wil come back to the point at which the temporary boundary was fixed. Now we will show a simple example of structural analysis by PLATON The example explains how the backtracking facility is used in analyzing Japanese sentences. Because we want to visualize the operations of PLATON without bothering with microscopic details of Japanese sentences, we will take an imaginary problem as an example. The parser which is written in PLATON is described in another paper by M Nagao and J. Tsujii (1976) An input string is assumed to be a list. The elements of the list are integers and trees are in the form of ( X (SUM 0)). Here 'X' may be regarded as a term modified by 'SUM 0' These two kinds of elements are arranged in an arbitrary order, except that the last element is the tree (X(SUM 0)). The following is an example of an input string: ( 5 2 13"]},{"title":"(x (Srn 0)) 3 1 (X (SUM 0)) 2 2","paragraphs":["("]},{"title":"x (SUM 0))","paragraphs":[") Figure 6 An Example String to be Analyzed The result of the transformation is expected to be in the following fotm: ( (X (Sm4)) (XSm6)) (X (Sm9)) 1 This result is regarded as representing the following relationships between integers and 'X'"]},{"title":". The number associated with an 'X' by the relation 'SUM' shows the sum of the integers which are governed by the X. We can look upon the relations r between integers and an X' as the relations between noun phrases and the","paragraphs":["verb in Japanese sentences. The result of the analysis is assumed to satisfy the following conditions. 46 (1) Governor-governed relationships between integers and an 'X' must obey the projection rule (i.e., clauses do not overlap). (2) As a simulation of a semantic restriction, we attach a condition that the sum of the integers governed by an 'X' should not erceed ten. (3) As a simulation of a contextual restriction, we attach the condition that a result"]},{"title":"(F (X (SUM num-1)) (X (SUM num-2)) . . . . (X (SUM num-N))","paragraphs":[") should maintain the relation, numl"]},{"title":"4 num-2 - 5 . . . .. <um-N. - set 05 rules is shown in the following. The corresponding state-diagram is shown in Figure 7. START NEXTB NEXTB POP NEXT Fipure 7 State Mapram of a Si","paragraphs":["wple Example SL? -1- strx: = :I :I1 (X (SUM :N)) :J) con: = ( GREATERP 10 (PLUS : N : 11) ) act: = ( (SV :N (PLUS :N :I1 )) (PUSHR /REG :Ill ) end: = (NEXT SUMLm C)c :I (X (SUM :N)) : J) ) -2- strx : = (* :I (X (SUM :N)) rJ) con: = (CONTEXTCHECK /RESULT (TR (X (SUM :N)))) act: = NIL end: = (NEXT BACKTRACK /) -3- strx: = (% :I (X (SLW :N)) :J) con: =: T act: = NIL end: = (FM-ERROR) -4- strx: ="]},{"title":"(8","paragraphs":[") con: = T act: = ( (SR /RESULT (CONS 'X /RESULT )) ) end: = (POP /RESULT) BACKTRACK -1- strx: = :I (X (SLW :PI)) :.J) con: = T act: = ( (SR /REG NIL) (SR /RESULT (APPEND /RESULT ( TR (X (SUM :N))))) ) end: = (NEXTB SUMUP (S# :I :J )) -2- strx: = (* :I (X (SUM :N)) :J) con: = T act: = ( (POPR /TEMP /REG) (SV :N (MINUS :N /TEMP)) ) end: = (NEXT BACKTRACK 01: : I /TEMP (X (SUM :N)) : J) ) The input string is the! list shown in Figure 6. Since the start state is SWP, the first rule attached to this state is applied. This rule will find the leftmost"]},{"title":"'x'","paragraphs":["and an integer just before the"]},{"title":"'x'","paragraphs":["(by SUMUP -I-, strx). The variable :I1 is bound to tius integer. This integer is added to the sum of the integers, :N, if the total does not exceed ten (SUMUP -I-, con). PUSHR, used in the"]},{"title":"< act >","paragraphs":["-part, is a PLATON function which puts the second argument on the head of the first argument (SUMUP -I-, act) After this rule is applied, the control will enter the state SUMUP again (SW -I-, end). That is, this rtile is applied until there are no ~ntegers before the first"]},{"title":"'","paragraphs":["X' or the sum of the integers. exceeds ten. As the result, the environment is the following: structure under processing ="]},{"title":"qY 5 (X (SUM 6)) 3 1 (X (SUM 0)) 2 2 (X (SUM 0))","paragraphs":[") relationship temporarily fixed be tween integers and 'X' content of /REG =(213) The second rule of SUMUP will be applied next. This rule checks by its 1 con> part whether the result at hand satisfies the third condition, that is, the contextual restriction. Because the content of /RESULT is NIL, the function CONTEXTCHECK returns the value T (SllMUl' -2-, con). So this rule is applicable. Control makes the state-transition to the state BACKTRACK (SUMUP -2-, end.) Because the first rule of BACKTRACK is a NEXTB-type yule, state-saving is performed. That is, tbe following environment is saved: content of /REG = ( 2 1 3) content of /RESULT = NIL structure under processing ="]},{"title":"# 5 (X (SUM 6)) 3 1","paragraphs":["( X (SUM 0)) 2 2 (X (SUM 0 )) ) 49 By this rules, the registers /REG and /RESULT are set as follows ( BACKTRACK -I-, act). /REG : = NIL /RESULT: = ( ( X (SUM 6 ) ) ) And the structure is transformed to"]},{"title":"(X 5 3 1 (X","paragraphs":["(SUM 0)) 2 2 (X (SUM 0)) ) A XEXTB- type rule causes a state transition as does a NEXT-type rule. So control returns to the state SUMUP (BACKTRACK -I-, end)"]},{"title":". At","paragraphs":["tt.is state, a process similar to the one described above is performed. As a result, the following governor-dependent relationships are es tablished. Here the bold lines indicate the newly established relationships. By the first rule of BACKTRACK the following environment is saved. content of /REG = ( 5 3 1 ) conten& of /RESULT = ( ( X (SLW 6 )) ) structure under processing ="]},{"title":"(# (X (SUM 9)) 2 2 (X (SUM 0))","paragraphs":[") And /REG and /RESULT are set as the following (BACKTRACK -1-, act)"]},{"title":".","paragraphs":["/REG: = NIL /RESULT: = ( (X (SUM 6)) (X (SUM 9)) ) The transformed structure is (BACKTRACK -10, end) Cjl 2 2"]},{"title":"(x (SUMO))","paragraphs":["1 The control is transferred to the state SUMUP. By applying the first rule of this state repeatedly on the above structure the following structure is obtained."]},{"title":"(j(","paragraphs":["("]},{"title":"x","paragraphs":["SUM 4)) 1 50 However this result does not satisfy the con textual restriction. So the application of the second rule of SLJMl.JP fails because the function CONTEXTCHECK used in <con ) -part returns the value NIL (SUMUP -2-, con) That is : con textcheck [( (X (SUM 6) ) (X (SUM 9) ) ) : (X (SUM 4)) 1 = NIL The third rule, therefore, will be applied next. Because this rule is a %type rule (SUMUP -3-, end), it causes an error and control comes back to the point at which a NEXTB-type rule was applied most recently. The saved nviro~ment is restored. This is: /REG: = ( 5 3 1 ) /RESULT: = ( (X (SUM 6)) ) structure under processing: = (* (X (SUM 9)) 2 2 (X (SUM 0)) ) Then by applying the second rule of BACKTRACK, the governor-governed relationship established lastly in the previous process is cancelled. The structure and the register /REG are changed as below (BACKTRACK -2-, act) : /REG: = ( 3 1 ) structure under processing: ( 5 (X (SUM 4)) 2 2 (X (SUM 0 )) ) Control enters the BACKTRACK state again. The application of the first rule saves the environ~wnt : content of /REG = ( 3 1 ) content of /RESULT = ( (X (SUM 6)) structure under processing ="]},{"title":"(1< 5","paragraphs":["( X (SUM 4)) 2 2 (X (SUM 0)) ) That is, the relationship indicated by the dotted line in the following is cancelled: Control transits to the state SUMUP (BACKTRACK -I-, end) and a similar process is performed. However, because the governor-governed relationship between the integer 5 and the second 'Xr is cancelled, the sum of the integers governed by the first 'X', ( 2 1 3 ), is greater than that of the second"]},{"title":"' X' ,","paragraphs":["( 3 1 )"]},{"title":". The contextual","paragraphs":["condition, therefore, is not fulfilled, and the application of the second rule of SUMUP will not succeed. So the temporarily established relationships will be cancelled one-by-one as follows. After these relationships have been cancelled, the desired result is obtained by the following sequence. 52 At the final stage of the processing, the fourth rule of SW a POP-type rule, is applied and returns the value ( (X (SUM 4)) CX (SUM 6)) (X (SUM 9) 1 VI Conclusion We have described a programming language called PLATON for natural language processing. The language has several additional capabilities beyond the ATN parser of W. Woods. Grammars written in the language not only maintain clarity of representation but also provide adequately a natural interface between the syntactic component and other components. By means of the pattern-matching facility, we can write grammars in a quite natural manner. And because of the PLATON variable binding mechanism, semantic and contextual LISP fuactions a easily incorporated in syntactic patterns. Flexible backtracking mechanisms and push-down operations make com- , r, Acatecr non-deterministic processing possible in a very simple way. We are now deveLoping an analysis program for Japanese using this language. The program can accept fairly complicated sentences in a textbook of elementary chemistry It can utilize the lexical and contextual information of chemistry adequately during the analysis. Such information in our system is expressed in the form of a semantic network similar to that of R. F. Simmons (1973). Perhaps, PLATON itself must be equipped with more semantics and context-oriented operations such as specified lexical descriptions and functions using them. However, what description method is most efficient, and moreover, what semantic information must be stored in the lexicon, are not yet entirely clear. So, as the first step, PLATON leaves many parts of these problems for 53 the user to specify by LISP programs. PLAMN is written in LIS1'1.5 and implemented on a FACOM 230-60 at the Kyoto University computing center and a TOSBAC-40 mini-computer in our laboratory. The interpreter of PLATON itself requires only 4.5 K cells. BIBLIOGRAPHY","D. do3row, B. Fraser, \"An augmented state transition network analysis procedure\", Proc. 1st IJCAI, pp. 557-568, (1969). A. Colmerauer"]},{"title":". \"Les sys temes-q ou un formalis~e pour analyser et","paragraphs":["synthet iser d2~ phrases sur ordinateur\", Project de Traduction automatique de llUniversite de Xontreal, TAD1 71, Jan., (1971)"]},{"title":". C. J. Fillmore. \"The case for case\", in","paragraphs":["Bach and Harms (eds.), Universals in Linguistic Theory, Holt, Rinehart 5 krinston, pp. 1-90, (1968).","C. Hewitt. \"PMNKER: A language for manipulating models and proving theorems in a Robot\", in Artificial Intelligence, Washington, D. C"]},{"title":", May, (1969)","paragraphs":["?i. Xagao, J. Tsujii. '\"~echanism of deduction in a question answering system with natural language input\", Proc. 3rd IJCAI, pp. 285-290, (1973).","I I Y- Sagao, J. Tsujii. Programing language for natural language processing"]},{"title":"- PLATOX\", J.IPSJ,","paragraphs":["Val. 15, pp. 654-661, (1974).","I I","M. Nagao, J. Tsujii. Analysis of Japanese Ser tences by Using Semantic and Contextual Information\". (forthcoming in AJCL-1976)","V. Pratt. \"A linguistic oriented programming language\", Proc. 3rd IJCAI, pp. 372-381, (1973).","'I 1","J. Rulifson, et. al. QA4-A language far writing problem-solving programs\", SRI Technical Xote 48, Kovember , (i970).","J. Thcrpe, I?. Bratley, H. Dewar. \"The syntactic analysis of English by machine\". In Michie (ed.), Machine Intelligence 3, New York, American Elsevier, (1968).","T. Vinograd. \"Procedures as a representation for data in a computer program for understanding natural language\", MIT Thesis, (19 71)"]},{"title":". I I W. Woods. Augmented","paragraphs":["transition network grammars for natural language analysis\", CACM, Vol. 13, pp. 591-602, (1970)."]},{"title":"American Joura id of (Clompu~ationaP 1 inguisties Micicrofiche 37","paragraphs":[": 54"]},{"title":"IEMBERSHIP STATERENT ................ Members","paragraphs":["paid through 1976 5"]},{"title":"................ Members","paragraphs":["paid through"]},{"title":"1975 571 ................ Members paid","paragraphs":["through 1974"]},{"title":"121 ............. Exchange","paragraphs":["and gift subscriptions 47"]},{"title":"American Journal of Computational Linguistics","paragraphs":["Microfiche 37 : 55"]},{"title":"EDITOR'S REPORT During","paragraphs":["1975, this"]},{"title":"Journal published","paragraphs":["20"]},{"title":"contributions through","paragraphs":["the"]},{"title":"ordinary channels of review; it also published two microfiches of abstracts","paragraphs":["from the Varna conference and"]},{"title":"five microfiches of proceedings of the 1975 Annual Meeting of the Association for Computational Linguistics. A directory of members also appeared. Early in","paragraphs":["1975, the"]},{"title":"Journal announced an experimental procedure for review of submiesions; the author could submit a 600-word summary for distribution","paragraphs":["to"]},{"title":"all members of","paragraphs":["the Editorial"]},{"title":"Board, €If the last 30 submissions, 15 have used this proce-","paragraphs":["dure. Contributors and"]},{"title":"Board members appear satisfied with the","paragraphs":["results. The"]},{"title":"number of microfiches distributed in","paragraphs":["the"]},{"title":"1975 subcription was 22, up from the 14 distributed","paragraphs":["to"]},{"title":"I974 members. But the number of frames increased from 900","paragraphs":["to"]},{"title":"1700, roughly; as anticipated, the average number of frames filled is","paragraphs":["going up"]},{"title":"Since the first announcement of the Journal, 86 submissions have","paragraphs":["been"]},{"title":"received. Their present status is shown at the top of the following frame. EDITOR S REPDRT 31 have been published 18 are with","paragraphs":["the author for ninor revision"]},{"title":"15 are with the author","paragraphs":["for major revision 16 have been rejected 3 are in process 2"]},{"title":"have been returned as unsuitable or withdrawn At the end of March, 1975, 10 manuscripts were out for ninor revision; 4 of them have been published. Of the 7 then out for major re sion, two have been published. We might thus expect to publish as","paragraphs":["many as 7 or 8 of the manuscripts now out for"]},{"title":"revision,","paragraphs":["making a total"]},{"title":"of about 36 of 81 received;","paragraphs":["our ultimate acceptance rate may"]},{"title":"be around 45%. The financial support of the National Science Foundation, which continued through 1975, and the unpaid help of both the State University of New York and the Xerox Palo Alto Research Center (the latter is processing bibliographies and indexes) have been most significant in establishing the new Journal. The work of the Editorial Board, editorial aides, and the staff of","paragraphs":["the Center"]},{"title":"for Applied Linguistics are also","paragraphs":["irnpor tant"]},{"title":". American Journal of Computational Linguistics","paragraphs":["Microf."]},{"title":"SURVEY OF MEMBERS PRELIMINARY","paragraphs":["REPORT The last mailing of the L975 subscription included a questionnaire about the level and direction of members interests, their use of the Journal, and their preferences among three forms"]},{"title":"of publication: microfiche, paper, and mixed. By","paragraphs":["the end of January,"]},{"title":"200 replies had arrived and the rate of arrival","paragraphs":["had diminished"]},{"title":"*","paragraphs":["The present report makes no interpretations or explanations; the figures are here for the Editorial Board, the Executive Committee, and the members to examine. All written comments received in response to the questionnaire are presented following the numerical data. Members"]},{"title":"who have","paragraphs":["strong opinions about the policy the Association should adopt may write to any officer of the Journal or Association; but prompt action is needed in order to permit planning and development of manuscripts for the 1977 volume."]},{"title":"* The issue","paragraphs":["left the editor"]},{"title":"on November 7;","paragraphs":["the questionnaire was to be returned \"by December"]},{"title":"31!' Due to unforeseen delays, the issue reached readers","paragraphs":["beginning mediately after Christmas in the Washington area, and late in January in Hawail and abroad. RESPQNSES TO SINGLE"]},{"title":"QUESTIONS 1 How many AJCL microfiches have you","paragraphs":["read?"]},{"title":"None 30 One","paragraphs":["20 2 to"]},{"title":"5 61 6 or more","paragraphs":["88"]},{"title":"No response 1. 2. How can you read a","paragraphs":["microfiche? Own a"]},{"title":"microfiche reader 50 Go to a convenient","paragraphs":["place"]},{"title":"80 Go to an inconvenient place 64 No means available","paragraphs":["6 3. How"]},{"title":"many","paragraphs":["AJCL opaque"]},{"title":"cards have you examined carefully or read through?","paragraphs":["None"]},{"title":"6 1 to","paragraphs":["5"]},{"title":"18 6 to 10","paragraphs":["40"]},{"title":"11 or more 135 No response 1","paragraphs":["4."]},{"title":"How significant is the material in","paragraphs":["AJCL to you?"]},{"title":"Highly significant; I need much","paragraphs":["of the content"]},{"title":"of AJCL in my work 32 Fairly significant; I sometimes need information of","paragraphs":["the kind"]},{"title":"I have seen published in","paragraphs":["AJCL"]},{"title":"131 Hardly significant; I rarely need anything from AJCL 32 Not significant; nothing I have seen in","paragraphs":["AJCL"]},{"title":"would be useful to me 2 No response 3 SURVEY OF MEMBERS What do you want ACL to supply to you?","paragraphs":["Original papers 181 Survey papers"]},{"title":"161 Bibliography 151 News","paragraphs":["149"]},{"title":"CHECK AS MANY AS","paragraphs":["APPROPRIATE 6. Judging from your own opinion and what you know of your colleagues, does AJCL probably lose contributions to other"]},{"title":"journals because they","paragraphs":["are printed"]},{"title":"and","paragraphs":["AJCL is"]},{"title":"on micro-","paragraphs":["fiches? Yes,"]},{"title":"AJCL's format loses contributions","paragraphs":["75 No,"]},{"title":"AJCL's format","paragraphs":["probably does not lose contributions 82 No response 43"]},{"title":"7. Is a microfiche","paragraphs":["printer available to you"]},{"title":"if","paragraphs":["you want full-size copy? Yes 86 No"]},{"title":"106 No response","paragraphs":["8 8."]},{"title":"If AJCL","paragraphs":["offered paper copies of the articles on microfiche, sent by"]},{"title":"mail at","paragraphs":["S2 per article (up to 97 pages), how many would you have bought"]},{"title":"in","paragraphs":["1975? None"]},{"title":"88","paragraphs":["One 21 2 or 3 64"]},{"title":"4 or more","paragraphs":["21 No"]},{"title":"response 6 Which","paragraphs":["of"]},{"title":"the following plans do you want AJCL to","paragraphs":["carry out?"]},{"title":"Microfiche publication; about","paragraphs":["2000"]},{"title":"manuscript pages per year 116 Paper publication; about 500","paragraphs":["manuscript"]},{"title":"pages per year without an increase in dues","paragraphs":["24"]},{"title":"Mixed publication; about","paragraphs":["250 manuscript pages per year printed"]},{"title":"on paper, supplemented by about 1000 manuscript pages on microfiches 44 No response","paragraphs":["16"]},{"title":"10. If","paragraphs":["AJCL"]},{"title":"continues to publish on","paragraphs":["microfiches, but"]},{"title":"offers a subscription on paper","paragraphs":["at a"]},{"title":"high price as an alternative, would you pay","paragraphs":["$20 to"]},{"title":"$30 extra for yourself? Yes No No response 6 11. If","paragraphs":["AJCL"]},{"title":"continues to publish on microfiches, what do you expect to","paragraphs":["do? Resign"]},{"title":"from the As Pay dues without r","paragraphs":["Buy"]},{"title":"(or borrow) a Continue","paragraphs":["a satisfa"]},{"title":"No response sociation eading the","paragraphs":["reader ctory arra t"]},{"title":"for","paragraphs":["reading"]},{"title":"fiches 133","paragraphs":["12."]},{"title":"Indicate your range of interests by checking as many boxes as appropriate. Leave blank","paragraphs":["the topics that"]},{"title":"do","paragraphs":["not interest you."]},{"title":"(The purpose of","paragraphs":["this"]},{"title":"question is guidance for the","paragraphs":["Editorial Board.)"]},{"title":"The answers are tabulated on","paragraphs":["the"]},{"title":"next frame and displayed in","paragraphs":["a graph"]},{"title":"on the next following frame. Thereafter the cross - tabulation of groups of questions begins. Topical category Acoustic phonetics Acoustic recognition Acoustic synthesis Character recognition Text input systems","paragraphs":["Text"]},{"title":"storage systems Parsers Sentence generators Semantic interpretation Discourse analysis Semantic memory structures Mathematical linguistics Lexicography Lexicology Concordance systems Vocabulary statistics Inference programs Programming languages Information structures Indexing sys terns and theories Document classification Machine translation ~sychological applications Social science applications Analysis of literature Instructional s ys terns (CAI) Level of interest Strong Slight 29 40 31 57 31 42 34 56 79 43 74 40 105 54 69 64 131 33 104 48 120 30 54 60 43 45 38 39 21 64 32 62 82 38 87 55 100 46 58 53 38 46 66 75 58 52 38 42 35 51 45 62 0 eye#+","paragraphs":["input systems vo"]},{"title":"Le nitolog","paragraphs":["\" 6ericyro~~L~"]},{"title":"Y ? .D~UM.R+ el~sitic*+ioh social ~io*e~‘a~~liur;&s 4 C harobtet NW~ n; tien i 30 Acoust;r syfirle~is+o a .Voab~lu stdistics P kArous+i c r eogm;+ion Acouttie pho~g+ic5 I 20 BwIpis ~iteratsrred o CWWO~O~~MC~ s stems Y RESPONSES BY","paragraphs":["LEVEL OF SIGNIFICANCE OF AJCL In these tables, each cell reports the number of members (out of 200) who give specified answers to question 4 (How significant is the material in AJCL to you?) and another question, jointly. In the first table, the number of members who find AJCL fairly significant and have read 6 or more microfiches is 48. 1. How many microfiches have you read? Significance Number of microfiches read","0 1 2-5 6+ NA High 2 4 5 20 1 Fair 19 10 43 59 LOW;̂9 6 13 9","\"Includes Hardly or Not significant and no response. 2. How can you read a microfiche? Significance High Fair Low Method of reading microfiches","Own Convenient Inconvenient No reader place place means 5 14 12 1 35 56 3 7 3 10 10 15 2 3. How many WCL opaque cards have you examined or read? Significance Number of cards read","O 1-5 6-10 11+ NA High 2 4 25 1 Fair 5 6 29 91 Low 1 10 7 19 5. What do you want AJCL to supply tc you? Significance High Fair Low","Original Sur-vey dibliography News papers paper s","31 29 27 30 120 103 102 97 30 29 22 22"]},{"title":"6.","paragraphs":["Does AJCL probably lose contributions?"]},{"title":"Significance Does","paragraphs":["lose Does"]},{"title":"not lose No response High 17","paragraphs":["12 3 Fair"]},{"title":"44 58","paragraphs":["29"]},{"title":"Low 14","paragraphs":["12"]},{"title":"11","paragraphs":["7."]},{"title":"Is a microfiche printer available to you? Significance","paragraphs":["Printer"]},{"title":"available Yes No NA","paragraphs":["High"]},{"title":"13 16 3","paragraphs":["Fair"]},{"title":"57 71 3 Low 16 19","paragraphs":["2"]},{"title":"8. How many articles would you buy from AJCL at $2? Significance Number of articles","paragraphs":["0"]},{"title":"1","paragraphs":["2-3"]},{"title":"4+ NA","paragraphs":["High"]},{"title":"13","paragraphs":["2"]},{"title":"10","paragraphs":["6"]},{"title":"1","paragraphs":["Fair 57 13 46"]},{"title":"11","paragraphs":["4"]},{"title":"Low 18","paragraphs":["6 8"]},{"title":"4 1","paragraphs":["9."]},{"title":"Which","paragraphs":["plan do you want"]},{"title":"AJCL","paragraphs":["to"]},{"title":"carry out? Significance Microfiche Paper Mixed No response High 19 1 8 4 Fair","paragraphs":["77 14"]},{"title":"30 10 Low","paragraphs":["20"]},{"title":"9 6","paragraphs":["2"]},{"title":"10. If AJCL publishes microfiches,","paragraphs":["would you pay $20 for paper?"]},{"title":"Significance Yes No NA","paragraphs":["High 2"]},{"title":"29 1","paragraphs":["Fair"]},{"title":"8 119 4 Low 3 33 1 11. If AJCL continues on microfiches, what will you do? Significance","paragraphs":["Resign Pay"]},{"title":"dues,","paragraphs":["Buy"]},{"title":"a Continue NA not read reader as now High","paragraphs":["Fair Low RESPONSES BY CONVENIENCE OF READING MICROFICHES In these tables, each cell reports the number of members (out of 200) who give specified answers to question 2 (How can you read a"]},{"title":"microfiche?) and another question.","paragraphs":["1 How many microfiches have you read? Convenience High* Low$:* Number of microfiches read"]},{"title":"0 1","paragraphs":["2-5"]},{"title":"6+ NA 5 8","paragraphs":["46"]},{"title":"70 1","paragraphs":["25 12 15 18"]},{"title":"*","paragraphs":["Own a reader or go to a convenient place **Go to an inconvenient place or have no means 3. How many AJCL opaque cards have you examined or read? Convenience High Low Number of cards read"]},{"title":"O 1-5","paragraphs":["6-10"]},{"title":"II+ NA 3 13","paragraphs":["26 87"]},{"title":"1 3","paragraphs":["5 14 48 4. How significant is AJCL? (See table above.) 5. What do you want AJCL to supply to you? Convenience High Low","Originai Survey Bibliogrpahy News pr;l.pers papers 6. Does"]},{"title":"AJCL probably lose contributions?","paragraphs":["Convenient e"]},{"title":"Does lose Does","paragraphs":["not lose"]},{"title":"No response High 32 73","paragraphs":["25"]},{"title":"low 43 9 18","paragraphs":["7."]},{"title":"Is a microfiche printer available","paragraphs":["to"]},{"title":"you? Convenience Printer available","paragraphs":["Yes No NA High"]},{"title":"65 59 6 Low","paragraphs":["21"]},{"title":"47 2","paragraphs":["8. How many"]},{"title":"articles would you buy from AJCL at","paragraphs":["$2? Conveni enc e Number of articles"]},{"title":"O 1 2-3","paragraphs":["4+"]},{"title":"MA","paragraphs":["High"]},{"title":"69 16 36","paragraphs":["8"]},{"title":"L","paragraphs":["Low"]},{"title":"19 5","paragraphs":["28"]},{"title":"13","paragraphs":["5"]},{"title":"9. Which plan do you want AJCL","paragraphs":["to"]},{"title":"carry out? Convenience Microfiche Paper Mixed No response Hign 93","paragraphs":["6 24"]},{"title":"7 Low 23 18 20 9 10.","paragraphs":["If"]},{"title":"AJCL","paragraphs":["publishes microfiches, would you pay $20 for paper? Convenience Yes No"]},{"title":"NA High 3 125 2 Low 10 56 6 11. If","paragraphs":["AJCL"]},{"title":"continues on microfiches, what will you","paragraphs":["do?"]},{"title":"Convenience Resign Pay dues Buy a Continue NA","paragraphs":["not read reader as now High"]},{"title":"1 5 11","paragraphs":["112"]},{"title":"1","paragraphs":["Low 9"]},{"title":"13","paragraphs":["22"]},{"title":"21 5","paragraphs":["RESPONSES BY CONVENIENCE AND"]},{"title":"SIGNIFICANCE In the following tables, each cell reports the","paragraphs":["percentage"]},{"title":"of members who indicate","paragraphs":["a"]},{"title":"given degree of significance for the material in","paragraphs":["AJCL, a"]},{"title":"given degree of convenience in reading microfiches, and","paragraphs":["a specified answer to a third"]},{"title":"question.","paragraphs":["For"]},{"title":"example, 91 of","paragraphs":["200"]},{"title":"members find the material fairly significant and have a convenient means of reading microfiches. Of those 91,","paragraphs":["48"]},{"title":"have read 6 or more microfiches; 48 constitutes 53% of 91, so the entry in","paragraphs":["the"]},{"title":"indicated cell is 53. 1.","paragraphs":["Percentage"]},{"title":"who have","paragraphs":["read 6+"]},{"title":"microfiches Significance Convenience","paragraphs":["High Low"]},{"title":"High 74","paragraphs":["46"]},{"title":"Fair 53 27 Low 40 6 3. Percentage who have","paragraphs":["read"]},{"title":"11+","paragraphs":["cards"]},{"title":"Significance Convenience","paragraphs":["High Low High 84 69 Fair 67 7"]},{"title":"5 Low","paragraphs":["50"]},{"title":"53 5. Percentage","paragraphs":["who"]},{"title":"want","paragraphs":["AJCL to"]},{"title":"publish original articles Signific High Fair Low ance Convenience High Low","paragraphs":["95"]},{"title":"100 9i 92","paragraphs":["85 76 Percentage who want AJCL to publish survey articles Significance Convenience High Low High"]},{"title":"84 100 Fair 81 72 LOW 75 82 Percentage who want AJCL to publish bibliography Significance Convenience High Low High 79 92 Fair 78 77 Low 55 65 Percentage who want AJCL to publish news Significance Convenience High Low High 95","paragraphs":["92 Fair"]},{"title":"71 80 Low 55 65 6. Percentage who think","paragraphs":["AJCL loses contributions All respondents Excluding no respoilse Significance Convenience Significance Convenience High Low High Low High 32 84 High 35 92 Fair 25 52 Fair 33 78 Low 15 65 Low 23 85 7. Percentage who have a printer available High Fair Low Significance Convenience Hign Low 47 30 48 32 60 24"]},{"title":"8. Estimate","paragraphs":["of"]},{"title":"number of","paragraphs":["printed papers that"]},{"title":"would be purchased, per","paragraphs":["member in the category; assuming 2.5 papers"]},{"title":"if","paragraphs":["the answer"]},{"title":"is","paragraphs":["2 or 3, and 5 papers"]},{"title":"if the answer is 4 or more.","paragraphs":["Significance Convenience High Low High 1.2 2.4 Fair 1.3"]},{"title":"1.7 Low","paragraphs":["0.5 2.2"]},{"title":"9.","paragraphs":["Percentage"]},{"title":"who","paragraphs":["prefer each publication policy Significance Convenience High Fair Low High Low Micro Paper Mixed Micro Paper"]},{"title":"Mixed 63","paragraphs":["5 21 54 31"]},{"title":"71 4","paragraphs":["20"]},{"title":"30","paragraphs":["25"]},{"title":"30 80","paragraphs":["5 10 24 47 24"]},{"title":"The percentages for","paragraphs":["the three policies should add to 100"]},{"title":"in each","paragraphs":["category of convenience and significance, but the percentage who did not answer is not shown. 10. Percentage who would pay $20 to"]},{"title":"$30 extra","paragraphs":["for paper Significance Convenience High Low High 5"]},{"title":"8","paragraphs":["Fair 2"]},{"title":"15 Low","paragraphs":["0"]},{"title":"18 SURVEY OF MEMBERS 11. Percentage who intend to take each action if MCL conti~ues to publish microfiches Convenience Significance Resign Not Buy a Continue read reader as now High High 0 0 11 89 Fair C) 5 9 85 Low 5 0 5 90 Low High 0 8 46 31 Fair 12 17 27 35 Low 24 29 29 18 Each row of the table should sum","paragraphs":["to"]},{"title":"100%, but some","paragraphs":["did"]},{"title":"not respond","paragraphs":["to"]},{"title":"question 11.","paragraphs":["LONG COMMENTS Here's my survey questionnaire. Anent the decision as to where to go from here,"]},{"title":"I have a very strong recommendation to make. I think you're in a pioneering position on something very important, and should stick with it, certainly for at least two","paragraphs":["or three more years if at all possible."]},{"title":"The","paragraphs":["major difficulty and source of objections, I think, is not any of the arguments against microfiche that you outline, but simply the difficulty people have in adopting radically new habits in such a fundamental activity as reading. Which Srings me to the second point."]},{"title":"I think that as","paragraphs":["a pioneer, the Editorial Board of the AJCL has a responsibility to try to make the experiment- succeed, and not just sit back and watch. Specifically, I think it's very important to make available to subscribers a microfiche reader which works reasonably well, is not terribly expensive, and most importantly, is easy to acquire. I would bet that if you arranged with a manufacturer or dealer to supply a small, practical reader in the"]},{"title":"$25-$35","paragraphs":["price range, which people could order simply by writing their name and address on an addressed, postage-paid return card included in an MCL packet, at least a hundred would be sold within a month You wbuld have done your readers a service, and would alsb have broadened the base of those who are in a position to make use of the micro£ iche format. There are a variety of details to-be considered in implementing such a plan, for instance, that. the supplier should be prepared to make exchanges for defective units, but I'm sure that the members of the Editorial Board are as alert to these as"]},{"title":"I am. I would appreciate","paragraphs":["hearing what reaction people have to this suggestion."]},{"title":"Paul G.","paragraphs":["Chapin National Science Foundatioa Washington, D.C. 20550"]},{"title":"I am quite pleased at receiving the AJCL on microfiche and would hope that other organizations to which I belong would at least","paragraphs":["offer optional microfiche subscriptions to their journals."]},{"title":"I find myself inundated","paragraphs":["with prfnted publications and am"]},{"title":"running out of space to store these valuable documents; I do not want my","paragraphs":["office or my home turned into a library. When I receive a copy of the AJCL, I read through the opaque cards looking for paper summaries that interest me. When"]},{"title":"I","paragraphs":["find such a paper,"]},{"title":"I use the department's microfiche reader to browse through it. Occasionally I have the library make a paper","paragraphs":["copy for me so that I can study papers without access to a microfiche"]},{"title":"viewer. One service which I think","paragraphs":["might be useful for ATCL subscribers without such convenient access to hard-copy microfiche machines would be an opaque card"]},{"title":"which one could use to order paper copies of selected articles. James R. Rhyne Department of Computer Science University of Houston, Texas 77004 The microfiche","paragraphs":["journal is the best thing ACL has got going for"]},{"title":"it. In","paragraphs":["che last couple"]},{"title":"of years, I've been letting my member-ships in a number of organizations lapse.","paragraphs":["One"]},{"title":"of the principal reasons is that I simply can't","paragraphs":["cope with the flood of paper which results from memberships. My house and office get cluttered up"]},{"title":"with stacks of magazines that can't be chucked because one article in a dozen looks as if it ought to be read some time. It's gotten to the point where new issues go straight from the mailbox to the recyclery. For this \"servfce\", one pays extra. Microfiche solves that; I've got two years' worth of ACL output in a 6\" x 6%'' metal box,","paragraphs":["and there's room far two more years."]},{"title":"If I ever run out of","paragraphs":["room"]},{"title":"for metal boxes, I can cull out selected cards. 11 By all means, make your experiment\" permanent! Anonymous","paragraphs":["More notes on"]},{"title":"your questionnaire!","paragraphs":["(1)"]},{"title":"I have","paragraphs":["been"]},{"title":"getting","paragraphs":["IEEE"]},{"title":"Computer,","paragraphs":["IEEE"]},{"title":"Computer Transactions, and IEEE Spectrum since 1969 on microfiche. I no longer have paper","paragraphs":["copies of"]},{"title":"these earlier issues. I","paragraphs":["bought a"]},{"title":"cheap micro-","paragraphs":["fiche reader in"]},{"title":"1969.","paragraphs":["(2)"]},{"title":"I bought a Realist","paragraphs":["(Xerox"]},{"title":"320)","paragraphs":["l.fi .rears ago."]},{"title":"(3) 1 also","paragraphs":["get now AJCL"]},{"title":"Journal (yours), Scientific American (Bell","paragraphs":["&"]},{"title":"Howell) , IEEE","paragraphs":["Software Engineering regularly on"]},{"title":"microfiche.","paragraphs":["(4)"]},{"title":"I buy selected titles from NTIS","paragraphs":["and University Microfj-Lms"]},{"title":"(Micromedia--kids","paragraphs":["books)"]},{"title":". 1 subscribe to NTIS computer xeekly abstracts","paragraphs":["@$3O/yr."]},{"title":"No company reimbursement. (5) After","paragraphs":["a"]},{"title":"years research I have","paragraphs":["produced"]},{"title":"my","paragraphs":["first"]},{"title":"amateur microfiche at","paragraphs":["home"]},{"title":"which dops on a Bruning.","paragraphs":["(So"]},{"title":"I now will be a publisher!) (6) I am a microfilm/microEiche","paragraphs":["COM expert"]},{"title":"in Management Systems at work (only part","paragraphs":["time)."]},{"title":"I am a systems analyst on data center management software . (7) Being an","paragraphs":["engineer and an analyst AJCL is currently a peripheral area of interest."]},{"title":"I would not have","paragraphs":["joined your organi-"]},{"title":"zation if your","paragraphs":["journal"]},{"title":"was only on paper. I got into microfilming because I was running out of space. (8) I believe I will be able to keep a tremendously large number","paragraphs":["of"]},{"title":"journals, magazines, professional or pleasure reading","paragraphs":["books"]},{"title":"if","paragraphs":["they are"]},{"title":"on microfiche. By keeping good inventories in","paragraphs":["a safety deposit"]},{"title":"box I will have good insurance and replacement in case of","paragraphs":["fire. 49) Able to microfilm (fiche) myself I will be able to archive (and back up against fire) any book or paper I work on. It would be easier to correspond and exchange papers with someone around the world or U.S. Lower postage. (10) I would like to see all hard bound and paper back books, all magazines available on microfiche. The savings for the Library of Congress and copyright off ice would be tremendous. These fiche should also be available to individuals from the publishers. (11) I also get the ACM Communications, and ACM Surveys on fiche I trust I will see the results of your survey, and maybe my letter, in the next AJCL Newsletter. Neil R. Karl 21425 Duns Scotus Sauthfield, Michigan 48075 Your recent questionnaire on the AJCL format invited additional comment I may be biased but I think micropublication of our journal is a superb answer to the twin problems of skyrocketing publication/distribution costs and the need to disseminate more information to students of this growing field. No serious student or scholar should be without a microfiche reader. Good compact readers from $100 (the Bell & Howell Brief CaS e reader) to $214 (the Washington Scientific Industries Mini-Cat) are available. Surely a modest investment for a life-time of use. I do think, however, that you can more effectively package the microfiche for increased user convenience. There are two basic approaches: 1) Bind fiche envelopes and the eye-legible cards together before they are distributed to subscribers or 2) provide","subscribers with a conyenient microfiche binder file. Thomas F. Deahl, Microdoc 8 I 5 Parnont~r T.ane Phi Iarlelnhia 19119 \" -HI","r"]},{"title":"--- --.a ----- I","paragraphs":["- -------- r---- -----"]},{"title":"It is my opinion that far from being a disadvantage, microfiche is a positive advantage. Already","paragraphs":["a large amount of my home and office space is devoted to storing technical journals which"]},{"title":"I have saved over the years, and as time passes","paragraphs":["the problem will only get worse."]},{"title":"I only","paragraphs":["hope that you will continue to distribute AJCL on fiche, and that other journals will follow your example. I do, however,find the small size of the opaque cards to be inconvenient. Perhaps you could combine all the opaque cards in each issue into one or two 85x11\" sheets, which could be folded when mailed, then spread open and collected in a looseleaf or other book when received. Norman Haas 35-20 Leverich Street Jackson Heights,"]},{"title":"N .Y. 11372 While having the freedom to publish very","paragraphs":["detailed accounts of large programs is useful I think that a more space conscious medium would encourage more concise descriptions. The freedom to be verbose does not strike me as a good idea in this field! Also, it is difficult to judge the effect of the microfiche format on soliciting manuscripts because the journal is new and thus has no developed prestige. Unsigned Although I do not object to microfiche format, I find the organization of opaque cards and fiche sometimes confusing and easily disordered. Unsigned I'd like to see ACL offer--at a good price--a fiche reader. My intuitive requirements are 1) \"book-page\" size image, 2) stow-able, 3) transportable, 4) under $100. Comment? Peter Z. Ingerman 40 Needlepoint Lane Willi~orq. N =J. -080.46"]},{"title":"I 12lieve the best alternative would be to 1) continue journal on","paragraphs":["micro£ iche"]},{"title":", 2) arrange to sell inexpensive readers to subscribers through ACL (or widely publicize where and for how much readers are available) 3) offer hard copy versions of articles by individual order. Unsigned I am a computer","paragraphs":["programer by profession and my interest"]},{"title":"in linguis tics extends only to those areas which are directly applicable to computers. Even there my interest is more concerned","paragraphs":["with the practical side rather than with esoteric theory. Since most of"]},{"title":"what you print can only be considered as future","paragraphs":["referent material by me, your printing of"]},{"title":"the journal on microfiche is eminently satisfying to me; in fact, if you switched entirely to paper, I would have to seriously consider my continued receiving of the j ournal . Robert D. Kluto 2179 Pacific Avenue San Francisco,","paragraphs":["California 94115 SHORT COMMENTS"]},{"title":"General Fiche is","paragraphs":["good for scanning and storing info where only occasional reference is needed. Paper copy needd for the few papers of frequently needed reference."]},{"title":"It didn't even reach me until Jan. 5. probably due to a poorly registered address label. (I bet il","paragraphs":["lot don't make it"]},{"title":"if they're all as bad as","paragraphs":["mine.)"]},{"title":"I am a student and could not afford","paragraphs":["AJCL publications in printed form."]},{"title":"You","paragraphs":["might"]},{"title":"make the","paragraphs":["microfiche"]},{"title":"envelope larger (to contain the opaque","paragraphs":["copy) and use face of envelope to print information on it You should have asked how long"]},{"title":"I was a","paragraphs":["member to interpret this stuff. Sorry this is late One of my major reasons for subscribing to AJCL is that it is published"]},{"title":"in microfiche. For $10 a year I am very satisfied.","paragraphs":["You might consider negative contrast to ease the eye strain"]},{"title":"I haven't","paragraphs":["found time to read articles but expect to and"]},{"title":"like the format. Love fiche. At this moment Itan not","paragraphs":["working directly in the field of CL."]},{"title":"PLEASE NOTE: Negative, rather than positive, microfiche provides","paragraphs":["the clearest and easiest to read copy."]},{"title":"An","paragraphs":["option for negative fiche-copy"]},{"title":"would encourage a great deal of new","paragraphs":["member-ships. 1) Do offer printed copies. than \"prestige\" (whose?) 2) Currency is far more important Only major complaint about fiche is that all the readers are"]},{"title":"lousy on the eyes. I prefer to be forced to get used","paragraphs":["to microfiche because paper should not be wasted. Despite the current inconvenience for me of"]},{"title":"microfiche publication, I am in favor of continued publication on the grounds","paragraphs":["that"]},{"title":"maybe it'll spread and eventually encourage better","paragraphs":["reader technology. A lot"]},{"title":"of","paragraphs":["good"]},{"title":"work is being","paragraphs":["done"]},{"title":"by people","paragraphs":["who are not too"]},{"title":"famous; it's very","paragraphs":["importarlt that it should be published inexpensively somewhere. Question 1. Answer 1: But unrelated to microfiche as medium. Answer 0 : Because \"go to inconvenienr place\". Plan to buy a viewer as soon as I can afford one. Answer 6: Parts only. Question 2. Answer own a reader : Have 2. Department. Recently. Very recently. Costs about as much as a small B/W TV set. Answer go to a convenient place: Buying a reader. Answer none: But on the way to buying a reader or hopefully going to a convenient place. Question 3. Answer 6-10: All received Answer 11+: All. Question 4. Answer highly: Word \"much\" converted to \"some\". Answer hardly: On my job now. Question 5. Answer all checked: Papers not accepted submitted elsewhere. Question 6. Answer yes: But it gains others who need the pages. Most likely. But it is still experimental. Give it a chance. Loses some but gains others that are too long for publication elsewhere. Probably. Difficult ta be sure since it is a new j ournal"]},{"title":". At least it would lose","paragraphs":["mine. But because of the format, gains others. Balance Answer no: Don't know but"]},{"title":"I suspect not since alternatives are so few. I feel there is more prestige in microform. Question 7. Answer yes: Inconvenient","paragraphs":["and costly. But not good. Probably,"]},{"title":"I don't really know. New","paragraphs":["one. I haven"]},{"title":"' t used it yet","paragraphs":[", don"]},{"title":"' t know how we1","paragraphs":["$ it works. At cost. But only electrostatic process. Not clear or good type. At an inconvenient place. With inconvenience. Very difficult to access, though. Questisn"]},{"title":"8. Answer 1:","paragraphs":["For use with students. Answer 2-3 : Good idea. This is the best offer yet--a postcard return to get paper copies of wanted articles only.","No answer : Probably too expensive (postage)"]},{"title":". Depends on the article content; question is","paragraphs":["not very good. Question"]},{"title":"9. Answer fiche: With option of question 8.","paragraphs":["With option of #8, option of Finite String as part of this option, devote"]},{"title":"several cards of an issue to microfiche readers,","paragraphs":["their advantages and dis-advantages and cost."]},{"title":"(To \"mixed\") NO! One format","paragraphs":["only. .Answer mixed: Fiche"]},{"title":"with option to order hard copy. Bit depends on which goes where. Answer other: EithPr fiche or paper","paragraphs":["but not mixed. Either"]},{"title":"fiche or mixed. No paper. Paper and mixed. Depends on mix. Question 10. Answer no: Would use a library copy and Xerox. Probably not. Offer on paper only. Answer","paragraphs":["? Yes and no; pay more for the larger journal to continue; prefer microfiche. Stupid question--depends on question"]},{"title":"8 situation. If paper copies of separate articles not available probably so--otherwise","paragraphs":["not. Question 11. Answer continue: Continue a \"fairly\" satisfactory method. Would buy \"possibly"]},{"title":"if other material also available. I I Continue an \"unsatisfactory\" arrangement. Continue a-satisgaeeery arrangement for ... 11","paragraphs":["*' Continue an uX sntisfactory.."]},{"title":". Continue to \"look for\" satisfactory. . . Answer not read: I find microfiche inconvenient but do read articles of great interest. Answer other: Not read as much as I would if it, were on paper. 11 Question 12. The following are not suitable topics for ACL to publish on: Psychological applications social science applications, analysis of literature, instructional systems, programming languages, and information structures. TUTORIALS from the IEEE COMPUTER SOCIETY","paragraphs":["Text and References for Computer Networks: A Tulorlal, June IH. 1975-?% pp","Our biggest selllnr ..torial 1s now In ah ~h~rd prlntlng. Top~c~ lncludc nauork con-flpurat~on and \\ocabulary. hardwire componcntb. softwarc components, ui~l~zat~an. meaiurcment and e~aluaaon, costs, and ISSU~S In management Prlcc-$12.00 Mlcroprogramrning, Ma!. 17. 19?5-309 pp.","Tev lncludes an introduc~ion by ~hc in- \\rrucron. J. Michael Galey of IBM and Rlchard 1. Klelr of Browne & Ramarnoorthg. lnc.. and 19 papers on mlcroprogramrnlng In sit general categories: introductory papers. m~croprogrammed arch~tecture and languages, production of mlcroprograrns. emulat~on and direct execution, microprogram applications other than instruc~ion executlon, and conclusions and perspectives. Prlce-S12,00 Member price-S9.00 Clolhbound-516.00 Clothbound","member price-5 12.00 Protection of Information in Computer Systems, Tutorial from Compcon 75 Fall, September 8.4 975-260 pp.","The course covers the basic principles of information protection and explains the separation of addressing and protection, thc capati~lity sgwrm. [he acce~3-control list system, protect~ng barlous types of objec~s, and protected objects and sub\\>\\tsm\\. Prlsc-S 12.00 Msmhcr price--$9.00 Structured Programming, Tutorlal from Compon 15 Fall, Seprcmhcr H. -J'l75-. 241 pp.","Thl\\ turor~al lncludcs an rnlroductlon lo. the major idea& of structured programrnlng. thcrr theoretical and practrcal foundalrons. as ucll a\\ detallcd prcrcntallonb of a major appl~cation program \\).%tern and a single program stre\\slnp the top-dou11 evolutionary character of the procrsc. Price-S12.00 Member pr~ce-59.00 Minicomputer Realtime Executiuer, Tutorial from Compcon 74 Fall. September 9, 1973-208 pp.","Applicalions such as data acquisition. process control, communications, and bu4nets data procaring are briefly discushed. Various reattime executives are discussed with emphasis on the way the choice of design of the ~arious key element\\-memory rnanagement, scheduling, data rtructuring and file handling, interprogram communication, and control structures-affect the application of the sgrtem. Price-Sl5.00","@ IEEE COMPUTER SOCIETY 5855 h:ic Ci Plaza Sl;:tl; 30; Lon;: Bsach Callforrl~a 90803 Te'ephnn~ (213) 438-9951 Name -- IEEE Computer Society Memb. No. .- . -. -.- Address -"]},{"title":"-","paragraphs":[".- Cit ~\\State -- Zip, -. Counlry -----.- . Please send me the following tutorrats from the IEEE Gomputer Society Computer Networks copy (copies) at $ -- Structured Programming ..---copy (cop~esj at $ Mlcroprogramrning - copy (copies) at $ - _. Minicomputer Realtime Executives -.-copy ;copies) Protect~on of Information copy [cop~es) at $ .-- at $ -- --- Cal~fornia residents add 6% sales tax TOTAL %,-, .--- - ..--."]},{"title":"-","paragraphs":["-.. - . .- -- - Be sure to state IEEE membership number if you claim membership discount.","( I Mypaymentof is enclosed ( 1 Please send me your complete publicat~ons","catalog.","( 1 Add S2.00 billing charge & invoice me ( Please send lnforrnation on jolnlng'the Computer","Society Send to: IEEE Computer Society, 5855 Naples Plaza, Suite 301, Long Beach, CA 90803","MICROCOPY RESOLUTION TEST CHART NATIONAL 0UREAU OF STANDARDS 1964 A"]}]}