{"sections":[{"title":"American Journal of Cornputat ional Linguistics ~i","paragraphs":["crsf i che 28"]},{"title":"SUMMAR","paragraphs":["I ES OF"]},{"title":"CONTRIBUTIONS -0","paragraphs":["THE"]},{"title":"FIRST NATIONAL CONFERENCE","paragraphs":["ON THE"]},{"title":"APPLICATION OF MATHEMATICAL MODELS AND COMPUTERS IN LINGUISTICS","paragraphs":["Part TI RussianLanguage Contributions A Ljudskanov Institute of Mathematics apd Mechanics Chairman of the Organizing Committee Copyri,ght @ 1975 Association for Computational Linguistics Summaries originally prepared in Roman-alphabet languages were reproduced on AJCL Microfiche 20. The present fiche contains translations of"]},{"title":"46 summaries originally submitted in Russian.","paragraphs":["AJGL thanks the organizers for permission to reprint the sharies and David Ackerman who made the translations TABLE OF CONTENTS GENERAL THE LOGICAL FOUNDATIONS OF MEASUREMENT OF SEMANTIC INFORMA-"]},{"title":"....................","paragraphs":["TION Nlkola] Stanulov ON DISCRETE (NON-SHANNON CALCULATION OF ENTR'OPY Ivan Dobrev"]},{"title":".","paragraphs":["AUTOMATION OF THE QUANTITATIVE ANALYSIS OF TEXTS R. K E(1rkova ON THE QUANTITATIVE FOUNDATION OF LINGUISTIC CLASSIFICATIONS"]},{"title":"....................... Mlroslav","paragraphs":["Yanaklev PHONETICS"]},{"title":"-","paragraphs":["PHONOLOGY AN ALGORITHM FOR THE RECO-GNITION OF ISOLATEDIWOROS BY THE ENVELOPE OF THE SIGNAL Yu. Marlnov, S. Tsochev, M. Khardalov,"]},{"title":"..........","paragraphs":["and B. Zhechev"]},{"title":"............","paragraphs":["LEXI COGRAPHY"]},{"title":"-","paragraphs":["LEXI COLOGY SOME PROBABILITY PARAMETERS OF A STRUCTURAL-SEMANTIC DESCRIP-"]},{"title":".....","paragraphs":["TION OF THE BULGARIAN LEXICAL SYSTEM D. A. Rajnova THE QUANTITATIVE AND SEMANTIC CHARACTERISTICS OF COMMUNICA-"]},{"title":"....","paragraphs":["TIONS VERBS IN JOURNAL1 STIC TEXTS Gergana D. Mlkhajlova A FREQUENCY DICTIONARY OF CONTEMPORARY BULGARlAN JOURNALISTIC"]},{"title":".................","paragraphs":["LANGUAGE Radoslav Mutafchlev THE ALGORITHM AND PROGRAMS FOR lnc COMPILATION OF A FREQUENCY"]},{"title":".......","paragraphs":["DICTIONARY OF WORD CQMBINATIONS N~kola Rafkovskl GRAMMAR ON THE 'STRENGTH' OF THE INTERMORPHEMIC BOND (ON THE MATERIAL OF MEDIEVAL TEXTS 1 M. Yanaklcv, K. Nn~dontsv, M Kotarov, and N V Kotova"]},{"title":"................. .....","paragraphs":["A SYSTEM FOR THE AUTQMATXC SEGMENTATION OF BULGARIAN WORD FORMS INTO MORPHEMES Khrlstlna Brajkova ,"]},{"title":". . .......","paragraphs":["A MODEL OF SOUND LINKAGE AND MODIFICATION IN BULGARIAN SUF-FIXES Stefan Khrlst~v"]},{"title":"....................","paragraphs":["ON THE FUNCTIONING OF PERSONAL PRONOUNS IN RUSSIAN AND BULGA-"]},{"title":"...................","paragraphs":["RIAN C,V.Yermolenko. A QUANTITATIVE MODEL OF RUSSIAN WORD FORMATION (ACCORDING TO DATA EeOM A RUSSIAN CLUSTER-FREQUENCY DICTIONARY) L. N."]},{"title":"............","paragraphs":["Zas~rlna.....~....~.. A MODEL OF THE GENERATION OF SUBSTANTIVE FOPMS IN THE CONTEMPORARY ARMENIAN LANGUAGE Ra L- Urutjan"]},{"title":"...........","paragraphs":["SEMANTICS"]},{"title":"- DISCOURSE","paragraphs":["SEMANTIC STRUCTURES AND SYNTACTIC REPRESENTATION V. D Kllmonov"]},{"title":"..........................","paragraphs":["PROGRAM REALIZATION OF AUTOMATIC ANALYSJS OF THE SEMANTIC"]},{"title":"........","paragraphs":["CONTENT OF TEXTS D. M. Dobrev and R. K. K~rkova THE STRUCTURE AND DISTRIBUTION OF HERMIT WORDS (SLOVO-QDINO-CHKA) IN BULGARIAN AND RUSSIAN A. 16. Kuzhctsova and D. A. Ralnova"]},{"title":"..........................","paragraphs":["AN ALGORITHM TO DISCLOSE THE SET OF POTENTIAL ANTECEDENTS OF PRONOUNS IN BULGARIAN AND RUSSIAN SCIENTIFIC TEXTS Marla KoZeva.."]},{"title":".........................","paragraphs":["ON THE AUTOMATIC IDENTIFICPTION OF PRONOUN ANTECEDENTS IN RUSSIAh, BULGARIAN, AND GERMAN G. Kll~onova and S. Karag'ozova"]},{"title":". LINGUISTICS","paragraphs":["THE MODELING OF NONZNDX VIBUAL LANGUAGE AGENTS Slavcho Petkav COMPUTATION THE APPLICATION OF TME FUZZY SET MECHANISM TO THE STUDY OF"]},{"title":"........","paragraphs":["ARTIFICIAL LANGUAGES 1. Byrnlcv ~2nd' V. D~rnltrov A QUANTITATIVE INVESTIGATION OF THE ACTUAL UTILIZATION OF AL-"]},{"title":"...............","paragraphs":["GORITHMIC LANGUAGES P. Byrnjcv"]},{"title":"........ BASES","paragraphs":["FOR CONTEXT-FREE LAPISUAGES A. A. Rndenskl."]},{"title":"DOCUMENTATION","paragraphs":["ON THE LINGUISTIC PROBLEMS OF AUTOMATIC INFORMATION PROCESSING Eva Beneshova"]},{"title":".....................","paragraphs":["AN ALGORITHM FOR THE ACCELERATED CALCULATION OF SET-ALGEBRA EXPRESSIONS Kostadln Gruev"]},{"title":"...,............. A","paragraphs":["MATHEMATICAL MODEL OF THE DISTRIBUTION OF INFORMATION IN"]},{"title":"...............","paragraphs":["RETRIEVAL SYSTEMS M. Lbmbrowskl ON AN APPROACH TO TYE CREATION OF A DESCRIPTOR LANGUAGE WITH ELEMENTS OF GRAMMAR N. Stanchev"]},{"title":".............. ........","paragraphs":["THE SEARCH PROCESS IN AN AIRS Sonja Kh'nglkjan A PROGRAM PACKAGE FOR THE REALItATION OF ADIS--A MIXED-TYPE"]},{"title":".............","paragraphs":["IRS Vasll Dragulev and Vasll Metodlev AUTOMATIC INDEXING AND CLASSIFICATlON IN INFORMATION SYSTEMS V.G.Zajtsev"]},{"title":"........................","paragraphs":["A THESAURUS FROM THE POSITION OF A SYSTEMS APPROACH V. pejcheva and S. Gabrovska"]},{"title":"............... . A","paragraphs":["SET OF ALGORITHMS AND PROGRAMS FOR AUTOMATEQ THESAURUS CONSTRUCTION IN INFORMATION RETRIEVAL SYSTEMS angel Marchev *"]},{"title":".","paragraphs":["AUTOMATED INFORMATION-RETRIEVAL SYSTEMS WITH BILIdGUAL INPUT A.Ljudskanov"]},{"title":"........................","paragraphs":["INFORMATIONAL-LINGUISTIC INTERACTIONS IN THE SYSTEM 'INFORMATION-USER INFORMATION-RETRIEVAL SYSTEM"]},{"title":"' Nlkola Rajkovskl ... THE NEW","paragraphs":["INFORMATION LANGUAGE 'POLITIKA' Khrlsto Ts Georgrev , , THE ANALYSIS AND RETRIEVAL OF JURIDICAL INFORMATION M. Kula"]},{"title":".","paragraphs":["AN AUTOMATED INFORMATION SYSTEM TD SERVE SCIENTIFIC CONGRESSES ValjaPetrova"]},{"title":"......................","paragraphs":["A LANGUAGE DESCRIBING THE STRUCTURE AND FUNCTIONING OF AN OR-GANIZATIONAL-ADMINISTRATIVE TYPE CONTROL SYSTEM G. P~trova and St. Dzhedzhsv"]},{"title":"..................... A","paragraphs":["SYSTEM FOR PROCESSING INFORMATION FROM QUESTIONNAIRES AND FORMS Pet'r Stanchev"]},{"title":".................... TRANSLATION","paragraphs":["THE LINGUISTICS OF A TEXT AND MACHINE TRANSLATIONR, G. ~iotrovskij"]},{"title":"......................... 55 A","paragraphs":["SYSTEM OF MACHINE TRANSLATION UNDER DEVELOPMENT IN THE MATHEMATICAL LINGUISTICS LABORATORY OF THE INSTITUTE OF MATHEMATICS AND MECHANICS S. Karagezova, A. Lludskanov, E. Paskaleva,andT.Shamra]"]},{"title":"...................","paragraphs":["56 AN EXPERIMENT ON THE STATISTICAL ANALYSIS OF INTERLINGUAL"]},{"title":"................","paragraphs":["IDIOMATICITY M. M. Koplyenko 58"]},{"title":"SOCIAL-EEHAVIORAL SCIENCE","paragraphs":["AN EXPERIMENT ON THE USE OF LANGUAGE MODELING IN PSYCHOLIN-GU I ST I C EXPER I MENTAT I ON A. P. Vas~l jevlch ,"]},{"title":". . . . .","paragraphs":[", , 59"]},{"title":"HUMANITIES ...","paragraphs":["THE OBJECT AND METHODS OF STYLOSTATISTICS M. N. Kozhlna 60 STYLISTICS ANLJ THE MOST FREQUENT WORDS OF A LANGbAGE Anna Vasll'evnaOrlenko"]},{"title":"......................","paragraphs":["62"]},{"title":"INSTRUCTION","paragraphs":["A SYSTEM FOR AUTOMATIC TEST GENERATION Avram Yeskenazl"]},{"title":"....","paragraphs":["63 THE LOGICAL"]},{"title":"FOUNDATIONS","paragraphs":["OF MEASUREMENT OF"]},{"title":"SEMANTIC lNFORMATION A method is described for determining the relative quantity of semantic informati6n","paragraphs":["(QSI) in a written natural-language text (the QSI method). The construction of the method is based on the Ldeas of logical semantics, mathematical logic, and the so-zalled thesaurus approach. The logical bases are given wlth the help of axioms of semantic information and their corollaries Informatibn, and hence semantic information, is described in set-theoretic fashion. The natural language enters the rule of object language; proceeding from it a"]},{"title":"formal language is","paragraphs":["constructed whcih is conditionally termed an algebraic information (AI) language; this is the fragmentary metalanguage defined by the correspondence of the object langgage. The translation of texts from this language into the A1 language (1. e. the compilation of A1 expre-sions) allows the determination of the quantity of information in object-language texts. The quantity of semantic information is expressed by the element number of semantic space of the type of algebraic field of real (and possibly of other) numbers."]},{"title":"The Q6I","paragraphs":["method i~~~~udes as a frequent case the solving of verbal problems in mathematics (not excluding the measurement among the numbers of the QSI) Several means for the analysis of texts are discussed, as are the rules for compiling A1 expressions The proposed method is suitable for application to any texts, particularly in informatics--in information processing (indexing and the like) of bibliographic materials. General 8 R."]},{"title":"V L. Hartley","paragraphs":["(1928) introduced the following mathematical expression of entropy H. Hd= log n, where"]},{"title":"n","paragraphs":["is the number of equiprobable experimental outcomes This formula can be understood only as a postulate and by no means as a formal, logical conclusion from"]},{"title":"more","paragraphs":["elemenfary proposals, since there is an error in Hartley's chain of deductions. From the mathematical point of view, the conclusion 0f.C. Shannon (1942) that"]},{"title":"H","paragraphs":["= log"]},{"title":"n is","paragraphs":["fully rigorous, but it is the consequence of very srrong preliminary assumptions (axioms) on entropy as a function of the nwnber of equiprobable outcomes n According to Shannon, the function H = f(n) must be a continuous, additive and monoton function. How-ver continuity and additivity are not necessary conditions."]},{"title":"The identification of","paragraphs":["one of the n equiprobable outcomes of\" the experiment by the method of binary questions is a discrete process. A simple experiment with n = kl equiprobable outcomes and a sequence of two simple experiments with k and 1 equiprobable outcomes are two different things."]},{"title":"Assuming","paragraphs":["that entrbpy is the measure of the average quantity of binary questions necessary for the identification"]},{"title":"of","paragraphs":["one of the equiprobable ourcomeb of the experiment we set $(I) ="]},{"title":"Q","paragraphs":["and the recurrence relation +(n) ="]},{"title":"1 +","paragraphs":["$(n/2) for all even values and"]},{"title":"n- 1","paragraphs":["$(n)"]},{"title":"- 1 +","paragraphs":["+$(%$)"]},{"title":"~n + %e(nq) for all","paragraphs":["odd values."]},{"title":"It","paragraphs":["is imme diately"]},{"title":"verified","paragraphs":["that"]},{"title":"$(n)","paragraphs":["log2n and that the difference does not exceed 0.09 Using the definition of the function 4 (n) and the approximation @(n) login"]},{"title":"with an absolute error","paragraphs":["0 '09, one may calculate the entropy of the experiment with independent but not equiprobable results*"]},{"title":"H - -Cpilog2pi. i General AUTOMATION","paragraphs":["OF THE"]},{"title":"QUANTITATIVE ANALYSIS OF","paragraphs":["TEXTS Under examination are some means of automating the process"]},{"title":"of quantitative analysis of","paragraphs":["texts through the utilization of computers. Algorithms are cited r the creatiorl"]},{"title":"of an integral system of machine processing of textual information,","paragraphs":["where the basic goal is the acceleration of the computer's work and the significant abbreviation of the volume of the text subject to processing by tke linguist, by means of the compilation and","utilization of frequency dictionaries. Also cited are some results received in the conduct of experiments in the Computing Center of the Institute of Mathematics and Mechanics of the Bulgarian Academy of Sciences on material of Bulgarian artistic and scientific texts General OM"]},{"title":"THE QUANTITATIVE FOUNDATION OF LINGUISTIC CLASSIFICATIONS MIROSLAV","paragraphs":["YANAKIEV"]},{"title":"In","paragraphs":["the process of working out a frequency dictionary of contemporary Bulgarian, it has become clear that the classification procedures, while at least having a place"]},{"title":"in","paragraphs":["Bulgarian linguistic investigations, are implicitly founded on the information, intui-"]},{"title":"tively","paragraphs":["accumulated in the knowledge of linguists, on"]},{"title":"the","paragraphs":["statistical chaaacteristics of distribution of the language facts studied in texts. Unfortunately the linguist does not by"]},{"title":"any","paragraphs":["means always succeed"]},{"title":"in","paragraphs":["studying texts in such quantity that the automatisms accumulated in his knowledge of statistical information on the phenomena being studied might create a sufficiently reliable"]},{"title":"fulcrum","paragraphs":["for"]},{"title":"the","paragraphs":["execution of classification procedures,"]},{"title":"which","paragraphs":["are \"thin ler\""]},{"title":"than those","paragraphs":["already long known in"]},{"title":"linguistic","paragraphs":["tradition."]},{"title":"In","paragraphs":["this"]},{"title":"we","paragraphs":["can see the profound reason for the cul-de-sac into which contemporary linguistics"]},{"title":"has","paragraphs":["wandered. Inasmuch as the application of computers for the ektraction of information on the statistical characteristics of the distribution of language facts"]},{"title":"makes work","paragraphs":["possible with enormous files of text, computer linguistics is the exit from this impasse. Phonetics"]},{"title":"- Phonology AN ALGORITHM FOR","paragraphs":["TAE"]},{"title":"RECOGNITION OF ISOLATED WORDS BY","paragraphs":["THE ENVELOPE OF THE SIGNAL Ylj. MARINOV, S. TSOCHEV, M. KHARDALOV, AND 8. ZHECHEV"]},{"title":"This","paragraphs":["work advances the results of computer modeling of the recognition,"]},{"title":"of","paragraphs":["a limited application, of words by their envelopes To this end the first tell numbers, pronounced by different speakers, are used."]},{"title":"The","paragraphs":["indications"]},{"title":"by","paragraphs":["which standards are formed are invariant with respect to compression-type linear txansformation and homothety."]},{"title":"If A","paragraphs":["is the set of extreme values of a given realization and {tilare the moments at which the envelope reaches them, then the speech signal is represented as two ordered sequences of discrete values of"]},{"title":"the","paragraphs":["indicated characteristics: The averaging of the characteristics formed as n-dimensional vectors permits the formation of standards"]},{"title":"for","paragraphs":["comparison. The metrics in the waveform space are determined in"]},{"title":"the","paragraphs":["following manner : Here"]},{"title":"IKi3","paragraphs":["are weighted coefficients determined"]},{"title":"by","paragraphs":["study and x = (xl,"]},{"title":". . . xN)","paragraphs":["and y = (yl,"]},{"title":". . .","paragraphs":[", yN) are vectors of characteristics. The program rsalization of the algroithm, carried out"]},{"title":"on the M220-M","paragraphs":["computer in Algol, has testified to the algorithm's good functioning."]},{"title":"The","paragraphs":["simplicity of sign-formation renders it attractive"]},{"title":"for","paragraphs":["a"]},{"title":"number","paragraphs":["of applications, especially when work on the real-time scale is necessary. Lexicography"]},{"title":"- Lexi col og y 12","paragraphs":["SOME"]},{"title":"PROBABILITY PARAMETERS OF A STRUCTURAL-SEMANTIC DESCRTPTION","paragraphs":["OF THE"]},{"title":"BULGARIAN LEXICAL","paragraphs":["SYSTEM"]},{"title":"The","paragraphs":["probletn of creating such a grouping of the dictionary content of a language in which the separate word would neighbor those words with which it relates semantically"]},{"title":"and","paragraphs":["functionally, and in direct0 proximity"]},{"title":"with","paragraphs":["the word from which it is formed, has"]},{"title":"long","paragraphs":["awaited solutLon. Practically, this"]},{"title":"means","paragraphs":["the consideration of the word as boundary set of subsystems."]},{"title":"We","paragraphs":["have carried out such an examination with the"]},{"title":"help","paragraphs":["of punched cards"]},{"title":"with","paragraphs":["edge-notching and"]},{"title":"machine","paragraphs":["information processing."]},{"title":"We","paragraphs":["have termed the working method structural semantics."]},{"title":"In","paragraphs":["the process of this development, the necessity has arisen"]},{"title":"for new terms. The","paragraphs":["term \"conceptual bundle\", which we have accepted conditionally, embraces words with one and the same internal linguistic motivation khe characteristics"]},{"title":"of","paragraphs":["the bundle are defined as the external valency of a certain nuclear pireme and as the suin of the frequencies of the separate lexical units entering into its composition, determined on the basis of their greatest separate weight of their functioning in syntactic constructions.","The method we have worked out for the structural-semantic description of real lexical systems has permitted the determination of a number of probability parameters for the Bulgarian lexical system."]},{"title":"The","paragraphs":["examination of some of these is the object of this work. Lexicography"]},{"title":"-","paragraphs":["Lexicology 13 THE QUANTI-TATIVE AND SEMANTIC CHARACTERISTICS"]},{"title":"OF COMMUNICATIONS VERBS","paragraphs":["IN JOURNALISTIC TEXTS","The object of research is the class of communications verbs (Vc). The class Vc is delimited with the help of four filters. I. a Vc is copied from dictionaries or other linguistic hand-books; 11. a Vc is isolated from a text in a logical-intuitive manner; 111. the Vcs isolated by filters I and XI are verified in a combination matrix; IV. the presence of the semaatic factor \"input f communication\" is sought out, with the help of componential analysis; for each verb having passed through filters I, 11 and LLI.","The investigation of the class Vc is carried out on a selection from journalistic texts (on one theme or another) , 10,000 word-forms in volume. The quantitative distributLon of Vcs in the given selection is observed, taking into account X, B, V. On the basis of these data, conclusions are drawn (wlth a certain degree of reliabillty) on the appearance of Vcs in texts which are homogeneous in style and theme.","The lexical and grammatical combinabilit.~ ~f Vcs with thc communications agent (N) is studied. The communications agents are unified by the semantic factor of \"inputs of comunieation\" Those cases are followed up in which the distributive relations (lexical, grammatical) for various Vcs coincide, and account is taken of the influence of the distribution on the semantic proximity of the verbs of the class Vc. The intensity of c~mbinetion","between N and Vc is determined. The \"input mode of comunieation\" (S) is examined. Basic constructions are distinguished with the help of the Vcs. ?he characteristic construction(s) for each verb of the class Vc 3.s determined. For verbs of communication input semantic nearness is found by the same method. The value of the Vc-S correlation coefficient is given. Lexicography"]},{"title":"-","paragraphs":["Lexico3 ogy A FREQUENCY DICTIONARY OF CONTEMPORARY*BULGARIAN JOURNALISTIC LANGUAGE RADOSLAV MUTAFCHIIEV The"]},{"title":"aim","paragraphs":["of the frequency dictionary of contemporary Bulga-"]},{"title":"rian journalistic language is to reflect the statistical character of Bulgarian journalis~ic style over the past ten years","paragraphs":["(1966-1975)"]},{"title":"The dictionary is","paragraphs":["compiled on the basis of a textual ffle"]},{"title":"of 500,000 grammatical forms. It embraces","paragraphs":["all jollmal i"]},{"title":"stic genres and is compiled by methods accepted","paragraphs":["abroa~"]},{"title":"Each separate lexeme is represented with the following statistical indices. absolute frequency, relative frequency, arithmetic mean, mean-square deviation, and the coefficient U. The entire selection is divided into 25","paragraphs":["samples of"]},{"title":"20,000 word-forms each. Under each lexeme is given","paragraphs":["its"]},{"title":"allu~exemes with","paragraphs":["their absolute frequencies"]},{"title":"and their statistical indices. The dictionary will contain the following divisions","paragraphs":["an"]},{"title":"alphabetic list of lexemes and their allolexemes, a","paragraphs":["ranked llst"]},{"title":"of lexemes with their absolute frequencies, a diagram of the frequencies of all grammatical","paragraphs":["categories encountered in the selection."]},{"title":"The dictionary is intended","paragraphs":["for research"]},{"title":"in the field of linguistics. It is being compiled by the","paragraphs":["Gruup in Struct~cal, Quantitative, and"]},{"title":"Applied Linguistics of the Bulgarian Language Institute of the Bulgarian","paragraphs":["Acadetny of Sciences."]},{"title":"The mathematical guarantee and also the","paragraphs":["cpmpi,latian of algorithms and programs is cronducted by Docent"]},{"title":"D. Dobrev and R, Kirlcova of the Institute of Mathematics and Mechanics, Lexicography -","paragraphs":[".&xicology THE ALGORITHM AND PROGRAMS FOR THE COMPILATION OF A FREQUENCY DICTIONARY OF WOOD-COMBINATIONS The quantitative investigation of word combinations in texts is of interest to the theory and practice of quantitative linguistics. The algorithms developed make possible the compilation of frequency dictionaries and the investigation of various quantitative characteristics of word combinations of two and/or three word forms in a text. The algorithm consists of the following parts 1. An algorithm for the construction of a list of wo3d combinations. 2 An algorithm for the qompilation of a permutational dictionary of word combinations","3. An algorithm far processing the list 02 word combina- $, tions, obtaining the quantitative characteristics, and printing out the alphabetic and frequency dictionaries of word combinations The algorithm is programmed in Fortran and has been tested on the ISL 1900 computer. The programs find application in the compilation of thesauri the quantitative analysis of texts, and other linguistic investigations. ON THE \"STRENGTH\" OF THE"]},{"title":"INTERMORPHEMIC","paragraphs":["BOND (ON THE"]},{"title":"MATERIAL OF MEDIEVAL","paragraphs":["TEXTS) M, YANAKIEV, K. NAJDENOV, Me KOTAROV AND N, V. KOTOVA"]},{"title":"It","paragraphs":["is accepted as a working hypothesis that the linguist appraise the \"strength\" of the intermorphemic bond (the \"strength\" of a junction of morphemes) as a certain function of two conditional probabilities--the probability"]},{"title":"of the","paragraphs":["presence of"]},{"title":"the","paragraphs":["first morpheme before the second (it being known that the second"]},{"title":"already","paragraphs":["exists)"]},{"title":"and the","paragraphs":["probability of the presence of the second morpheme after"]},{"title":"the","paragraphs":["first (it being known that the first already exists)","The explanatory power of the accepted hypothesis is clarified. It turned out that the behavior of linguiqts in the process of morphemic segmentation.of a communication is much easier to explain if one proceeds"]},{"title":"from","paragraphs":["the hypothesis being verified than if"]},{"title":"one","paragraphs":["proceeds from the previousLy tacitly accepted hypothesis on"]},{"title":"the","paragraphs":["evaluation"]},{"title":"of","paragraphs":["the \"strength\" of the intermorphemic bond for the appearance in thetreport of a second morpheme after the presence of the"]},{"title":"first","paragraphs":["in"]},{"title":"the","paragraphs":["report became known. A SYSTEM FOR THE AUTOMATIC SEGMENTATION OF BULGARIAN WORD FORMS INTO MORPHEMES KHRI STINA BRAJKOVA The subject of"]},{"title":"isc cuss ion","paragraphs":["is the work which serves as the basis for the graduating thesis prepared"]},{"title":"in","paragraphs":["the Laboratory of Mathematical Linguistics of tha OKTU sector of the Institute of Mathematics and Mechanics of the Bulgarian"]},{"title":"Academy","paragraphs":["of Sciences"]},{"title":"under the","paragraphs":["direction of Doctor of PhiloLogical Sciences"]},{"title":"A","paragraphs":["Ljudskanov. Its goal is the realization of automatic segmentation according to the morphological principle of prefixes and \"prefix"]},{"title":"like\" elements","paragraphs":["at the beginning of the word form and the establishment of the leftmost limit of the root of the word form"]},{"title":"\"Prefix","paragraphs":["like\" elements are the series of graphetnes which may form the initial portion of complex words. This work forms part of a system for automatic segment;atfc?n of Bulgarian word forms into morphemes. In the work presented one can differentiate information and logic portions The information portion consists of a list of prefixes and prefix-like elements and of lists of \"exceptions\" for each prefix, the logic portion includes rules for working with the above and indicates"]},{"title":"the","paragraphs":["succession of the aomputer's work."]},{"title":"In","paragraphs":["the p~esent rSI work the information portion is limited to","11 11","the letter z of the Bulgarian alphabet, but this in no way","disturbs the universality of the proposed algorithm"]},{"title":"The","paragraphs":["programming of the algorithm is being carried out in the PL/1 language gn the Ye.S."]},{"title":"1040","paragraphs":["computer Grammar A MODEL OF SOUND LINKAGE AND"]},{"title":"MODIFICATION","paragraphs":["IN"]},{"title":"BULGARIAN SUFFIXES The","paragraphs":["linkages established by means of a mathematical model of Bulgarian phonetics are fully explicated in the particular structure of the language, in the given instance in suffixes. The mathematical model reveals a lnaguage to"]},{"title":"be","paragraphs":["a system of structures and mechanisms, the function oE which obeys the laws of thought. Such regularities in the internal Logic are observed in Bulgarian in mutually conditioned changes, within the framework of each complex pair of alternating consonants and vowels. These regularities can serve as the criterion"]},{"title":"in","paragraphs":["creating a"]},{"title":"model of","paragraphs":["human"]},{"title":"speech","paragraphs":["activity, which can be utilized in the creation"]},{"title":"of a","paragraphs":["scientifically based theory, both for stenography"]},{"title":"and","paragraphs":["for the creation of a machine for recording of speech. The mathematical model of Bulgarian phonetics for the complex pairs of alternating cdnsonants and vowels can be examined dialectically, i.e. in its unity and contradiction"]},{"title":"In","paragraphs":["such a case it can be bifurcated into two consonants or into two vowels with contrastive structures, which are located between each other in a certain congeneric linkage. Grammar ON THE FUNCTIONIflG. OF PERSONAL PRONOUNS"]},{"title":"IN RUSSIAN AND BULGARIAN We have analyzed a KUSSXW text ana","paragraphs":["lts Bulgarian translation (Young World Fictlon Writers, a Collection of Stories and Tales, a Selection from Iv. Ruzh, \"Folk Culture\", Sofia, 1963) The length of the original is 44,000 word-uses,"]},{"title":"of the translation,","paragraphs":["50,000 word uses. Such e ratio is a consequence of the analyticity of the Bulgarian language in the area of nouns Total quantrity Singular Plural of persorlal 1.p 2.p 3rd Person 1-P ?p 3.p pronouns masc fem ntr Russian 3100 782 333 1287 263 Bulgarian 2622"]},{"title":"497 263 1173 283 The frequencies of the 3rd person, singular, neuter pronouns and 2nd person plural pronouns are not reliable. The difference in numbers is an indication that the function of indicating person in the formation of verb-forms is weakened in Bulgarian","paragraphs":["personal pronouns. If one addresses one's attention to the in-stances of the pleonastic use of pronouns (nego go nas ni, etc ) and also to the reprise of nouns (Az Mayakovski go uvazhavam, etc then the divergence in krequencies appears even more significant A chi-square test shows that the divergence between frequencies of first and second persor. singular pronouns in the nominative case is significant for the two languages, and in the oblique cases not significant. The personal endings of the verb show the person of the subject. This is why the difference in frequencies is reached at the expense of the nominative case The third person singular pronoun functions in Bulgarian a little differently than in Russian, in the oblique cases, \"toj\" and Grammar \"tya\" are used.,more frequently than their Russian ~ounterparts. The frequency of the dative analytic is too insignificant; we encountered only 29 forms. This provides grounds to consider that the synthetic, and not analytic, type of declension is still more characteristic of Bulgarian prmouns. Grammar A QUANTITATIVE MODEL OF RUSSIAN WORD FORNATION The materials of the Russian Frequency Dictionary, created by coworkers at the Leningrad and Gor kovskoe State Universities, have served as the basis for a Cluster-Frequency Drctionary (compiiers. L, M. Akul enko, E. S. Andreeva, L. N. Zasorina. M."]},{"title":"I.","paragraphs":["PrivaIova and,"]},{"title":"E.","paragraphs":["V. Tisenko). It was initiated from a glossary of 39,268 units received in a selection of 1,056,382 word uses compiled from four groups of texts--magazines and newspapers, scientific publications, prose, and drama"]},{"title":"The","paragraphs":["orFglnal glossary was subjected to a preliminary ordering NonnormatLve variaqts of words (of the type rodnyj, shkap, botinka) were reducted to normative ones, and participles were reduced to infinitive forms. As a result, the compressipn of the glossary to 38,000 lexemes was achieved.","The distribution of the vocabulary into clusters was conducted by way of unifying a' derivatives having motivation on the same root (an identical root,,and ageneral semantic component)."]},{"title":"A","paragraphs":["word with a nonproductive base is accepted as the index of the cluster, e"]},{"title":". g .","paragraphs":["GOVOR (say)"]},{"title":",","paragraphs":["ZHIT"]},{"title":"'","paragraphs":["(live) , ZNAT"]},{"title":"'","paragraphs":["(know) A cluster is considered a group of words consisting of not less than three words.","In the process of clustering, a class of nonclustering words was isolated It embraced 3000 units, among which stands out a small group of auxiliary words (prepositions, conjunctions, and interjections) and a group of nouns and adjectives, both proper and ethnonymically productive (Kievan, Londonite, Fraunhoferian, etc.). Borrowing constitutes the major part of this class (akr, acre; analoj, lectern; ar (as in hectare), etc ) and etymologically isolated lexemes (borshch, proso, millet, rataj, peasant-plowman, etc.)"]},{"title":". Grammar 22 The","paragraphs":["aistribution by clusters of the basic file has proven uneven. In all,, 2500 different clusters have been isolated (this result merits attention in comparison with the familrar data T. B. Efremova and"]},{"title":"A.","paragraphs":["I. Kuznetsova received 4500 roots, and D Worth et al. 10,593 clusters). By our calculatians, the 200 highest-frequency clusters embrace 62% of all different words."]},{"title":"At the","paragraphs":["same time the 105 highest-frequency clusters rd > 1000) includes 30% of the glossary and covers"]},{"title":"27%","paragraphs":["of the entire selection. The second"]},{"title":"group of","paragraphs":["100 clusters"]},{"title":"(95)","paragraphs":["forms 32% of"]},{"title":"the","paragraphs":["words and covers 12% of all word uses. All rernainiq lexemes (about 16,000) are distributed among the lesser-numbered clusters.","For a quantitative model of word formation there exist two root-word indices. The, word-forming capacity of the root word is determined by the quantity of products of a given root in the dictionary--the ratio of the number of products to the number of A11 different entries. By this r-tio the roots IMET' (possess) VODIT' (lead)"]},{"title":",' LE5EtFAT.I","paragraphs":["(lie)"]},{"title":", DAT'","paragraphs":["(give)"]},{"title":",","paragraphs":["ROD (gen-)"]},{"title":", DELO","paragraphs":["(matter, affair, business) , ZHIT"]},{"title":"'","paragraphs":["(live) ,"]},{"title":"BIT'","paragraphs":["(be) , and others are found in the leading portion of the distribution.","The text-forming.capacity is characterized by the mean frequency of the derivatives in the cluster--the ratio of the total frequency of the cluster to the number of its derivatives"]},{"title":"A specific","paragraphs":[".property of pronoun roots is displayed, compare ETO (ETOT, POETOMU) , this (pronoun) , this (demonstrative adj ective) for this reason, 13,334/3 ="]},{"title":"4,444,","paragraphs":["MOJ (POMOEMU,"]},{"title":"a),","paragraphs":["my, in my opinion, we, 7976/3 = 2,658, CHTO (wnac, which), 18636/35 = 407 etc. A comparatively large text-forming capacity is also found among the numbers ONE and TWO and among nearby and semisignificant roots BIG, OTHER, OBLIGED/MUST. Among the sigpificant words located in the leading portion of the distributibn by mean frequencies are the roots SAY (84), WANT (71.7), SPEAK (49 6), and"]},{"title":"NEW","paragraphs":["(49 5) Grammar","A full explication of the fundamental pool of Russian roots in a reliable fashion in their probability relationship to the data file is revealing a new approach to the study of dictionary distribution types, which are important for various practical applications. A MODEL OF THE GENERATION OF SUBSTANTIVE FORMS IN THE CONTEMPORARY ARMENIAN LANGUAGE paradigmatic sys tern for each morphological meaning in the contemporary Armenian language is formed from a certain initial word-form (the pure stem) by way of addition or exclusion of certain phoneme complexes. We note that the formation of forms"]},{"title":"with","paragraphs":["the help of alternation is easily carried out"]},{"title":"by","paragraphs":["means of negation and the addition of a phoneme complex If we represent the process of form-formation analytically, then we obtain the following expression"]},{"title":"A(((+B) + 6) +","paragraphs":["C)"]},{"title":"+d,","paragraphs":["where"]},{"title":"A","paragraphs":["is the pure stem, a = a v -a (a is addition, -a 1s exclusion) is basically the category of number,"]},{"title":"E","paragraphs":["b v -b in even order is the eatego-ry of case"]},{"title":"and","paragraphs":["class, c = c -c is the category of case, and finally"]},{"title":"a","paragraphs":["= d"]},{"title":"v","paragraphs":["-d is the article."]},{"title":"The work","paragraphs":["examines the questions of constructing a certain generator which automatically generates sudstantive forms in the contemporary Armenian language."]},{"title":"A","paragraphs":["method has been worked out for recording the initial word forms, and a classification of the frequency model of generation has been made. Inputing an initial word form, we obtain a system of paradigms of the given word form as output: The given model may be applied in systems for the automatic processing of texts. Considering, also, that one morphological meaning can be generated by various mechanisms, the author considers it advis-"]},{"title":"able","paragraphs":["to supply the contemporary Armenian dictionary with generation models, making it possible to obtain a system of paradigms for each initial word semantics"]},{"title":"- Discourse","paragraphs":["SEMANTIC STRUCTURES AND SYNTACTIC REPRESENTATfON","V. 0. ~LIMUNOV GERMAN DEMOCRATIC REPUBLIC A linguistic model is being examined in which cognitive structures (the semic representation) (1) are transferred by means of a sysrem of rules into complex semantic ones (the sememic represeatation) (2) and the latter into syntactic ones (the lexemic representation) (3)"]},{"title":".","paragraphs":["Between levels (From the highest on down) single- and multi-structured correspondences are present which are determined by.the resources of the (given) Lnanguage system and regulated by communicative-pragmatic factors","Structures with predicates of motion (selected illustrations","12 are in abbreviated notation). Notation z ]z , a moving body,","V/W, initial/final point, x, motive force, r(es) ~(bjects,","ab(lativu$, a1 (lativus)"]},{"title":",","paragraphs":["ac (tor)"]},{"title":", 1/2/3,","paragraphs":["number of the level 1 1 A.1. non (esse (z , v)) & fFeri (esse (z , w)), 2. movere","1","1","(Z , V, w), 3. The ball (ro) flew out from the courtyard (ab) 2 onto the street 6al)"]},{"title":".","paragraphs":["B. 1. causare (pertinere ad (x, z ) , non 2 2 2 (esse (Z , v)) & fieri (esse (z , w))), 2. movere2 (x, z , v,"]},{"title":"w) 3.","paragraphs":["The boy (ac"]},{"title":"+","paragraphs":["ab) thrust the shovel (a1"]},{"title":"+","paragraphs":["ro) into the earth -I (al). C.1. A 1 & B 1 with zL in place of x, 2. movere 1 3 3 (zA, zL, V, w); 3. The bus (ro"]},{"title":"+","paragraphs":["ac) carries passengers (a1"]},{"title":"+","paragraphs":["ro)"]},{"title":". . .","paragraphs":["/ The passengers (a1"]},{"title":"+","paragraphs":["ro) ride on the bus (ro + ac)."]},{"title":".","paragraphs":["Semantics"]},{"title":"- DiSc~urse PROGRAM REALIZATION","paragraphs":["OF AUTOMATIC"]},{"title":"ANALYSIS","paragraphs":["OF THE SEMANTIC CONTENT OF TEXTS D. M. DOBREV AND d. K. KIRKOVA On the basis of algorithms for the automatic analysis of the semantic content of texts developed by A. Ljudskanov and D Ero, corresponding mathematical program realizations have been created. Applying these programs, a series of experiments has been performed on the material of Bulgarian scientific texts These experiments indicated the advisability of changing the algorithms by introducing pseudolin~uistic particles in the corresponding dictionaries. Certain experimental results are also cited. Seman tlcs"]},{"title":"- D~scourse 27","paragraphs":["IN BULGARlAN AND RUSSIAN","A. 1, KUZNETSOVA AND D. A. RAJNOVA U. S. S. R. BULGARIA In a synchronic structural-semantic descrip'tion af the Bulgarian and Russian lexical systems, a group of hermlt words was isolated. Hermit \"oras are distinguished not only with respect to structural semantics, but also by a special quantitative charact er Lt was this character which provided the basis for their special investigation","The study of hermit words in language allows the spectfica-tion of the semantic-system concept and its utilization toward the aims of practical grammar and machine processing of information. The comparison of the hermit words in Bulgarian and Russian has shown a recurrent pattern which affirms the necessity of coordinating frequency-research methods for lexical systems with the principles of actual derivation. Semantics"]},{"title":"- Dl","paragraphs":["scourse AN ALGORITHM TO DISCLOSE THE"]},{"title":"SET","paragraphs":["OF POTENTIAL ANTECEDENTS OF PRONOIJNS IN BULGARIAN AND RUSSIAN SCIENTIFIC TEXTS"]},{"title":"MARIA KULEVA","paragraphs":["The Laboratory of Mathematical Linguistic$ of the Institute of Mathematics and Mechanics of the Bulgarian Academy of Sciences and the Sector f~r Automatic Processing of Natural Languages or the Zentralinstitut fur Sprachwi.-nschaft of the German Academy of Sciences are conducting joint work on the creation of a model and algorithms for the automatic identification of actual antecedents (Aa) of some classes of some classes of pronouns (P7, P5, and P in the singular) in Bulgarian, Russian, and German pcien- P tific texts. The problem of identifying the Aas is examined in this work ig regard to their selection from the set of potenrial antecedents"]},{"title":"(Ap).","paragraphs":["It is evident that, for the realization of this $election, it is necessary to automatically establish before-hand the set Ap and the working unit (W) within the framework of which the machine will amass the information necessary to carry out the indicated selection. This is the subject of the author's graduation theais, which is being carried out In the Sector of the IMM under the direction of Dr. A Ljudskanov, the basic posi-tions of which are expounded in this report The l~gical content af the svstem is this any WU includes the two sentences to the left of the sentence in which the current P is located, consequently, in vrder to establish the limits of the WU, the ~achine must be in 3 position to establish sentence boundaries, and for this it must \"distinguish\" segmenting punctuation marks from nonsegmenting ones (this task 1s carried out in Block 1, which has been worked out with +he use of dlalog in the prospect of including in the future an automatic reading mechanism) Then the classes of P which are relevant to the system are automatically identified,, and each of these is Semantics"]},{"title":"-","paragraphs":["Discourse 29 assigned \"its own\" WU (this is carried out by Blocks 2 and 3) Finally, on the basis of the formal grammatical relations between the Ps and their possible antecedents on the level of superficial structure, the set of Aps in each WU is automatically disclosed (this task is fulfilled by Block"]},{"title":"4). The system is realized on the machine Ye.S.","paragraphs":["10/40, and the progtams are compiled in Fortran. The proposed algorithm acts upon both Bulgarian and Russian texts. Semantics"]},{"title":"- Discodrse 30","paragraphs":["ON THE AUTOMATIC IDENTIFICATION OF PRONOUN ANTECEDENTS IN RUSSIAN, BULGARIAN AND GERMAN Gt KLIMONOVA AND S"]},{"title":".. KARAG '1~~~~~ GERMAN DEMOCRATIC REPUBLIC BULGARIA The report discusses","paragraphs":["some results? of the joint work of two collectives the Laboratory of Mathematical Linguistics of the Mnthematic: Institute of the Bulgarian Academy of Sciences and the Sector of A~tomatic Language-data Processing of the Zentral institut fur Sprachwissenschaft of the (East) German Academy of Sciences."]},{"title":"A","paragraphs":["series of criteria is proposed for the automatic identification of the referential mechanism linking certain pronouns and their antecedents in Russian, Bulgarian, and German","1. The morphological criterion selects out those word forms","in the workihg text which may be formally antecedents (i.e by","agreement with the given pronoun in gender and number)","2. Only those syntactic criteria are cited which are common to all three languages (disregarding the criteria resting on the peculiar features of the syntactic structure of any one of these languages) the condition of branching (the pronoun and antecedent cannot be located on one branch of the tree of dependency), the condition of copredication, exclusion by analogy, coordinated predicates, the criterion gf restriction of the searcl","for the antecedent with the help of paired language elements, etc 3 Finally, attention is addressed to the following semantic criteria for exposing mechanisms of pronominal reference the selection criterion, which embraces solely the semantic sub-classes of nouns in the presence of verbs, the criterion of lexical combination/noncombination (the entry of nouns into semantic rklations of the type \"X has (a) Y\" \"X and its Y\"), and the criterion of restricting the search for an antecedent with the help of antonyms. A textual example is gi~en for each adduced criterion THE"]},{"title":"MODELING","paragraphs":["OF NONINDXVIDUAL LANGUAGE AGENTS In the contemporary stage of modeling of language phenomena the \"individualist~c\" approach is predominant, first of all the activity of the individnal is modeled--the translation, analysis, and synthesis of speech, the analysis and generation of the text, the coding, indexing, classification, and search for documents, speech patholog> , compilation of dictionaries, and so on.","The significance of such an approach is beyond doubt, but together with this, apparently equally timely, is the approach in which the object of modeling becomes the activity of nonindividual language agents. Well-known experiments in the given direction suggest a clarification of a series of theoretical and methodological problems.","The author distinguishes four types of nonindividual language agents: binary, group, collective, and complex. In such an approach the field of mathematical and machine modeling is expanded, and the transition from complex to super-complex problems is effected. Inasmuch as these systems are grounded on linguistic principles, modeling of a special type is held in view (it could be termed linguonic), in which cybernetic and bionic principles can be viewed as partial instances.","The report describes the experimentally tested algorxthm for machine processing of data from linguistic experiments which prove the qualitative distinction between individual and nonindividual agents in the construction of a text. THE"]},{"title":"APPLICATION OF THE FUZZY SET MECHANISM TO THE STUDY OF","paragraphs":["ARTIFICIAL LANGUAGES P. BYRNJEV AND V. DIMITROV by artificial language, particularly an algorithmic one, can be viewed as a permissible"]},{"title":"-","paragraphs":["language (the set of all permissible language elements), as an individual language (the set of language elements used by the discrete user), and as a collective language (the set of language elements used by a certain group of users). Individual and collective languages may be defined as the fuzzy sets indicated in the set of permissible language elements The degree of affinity of a language element to one or another fuzzy set, which corresponds to a certain individual or collectjve language, is proportional to the frequency with which this element is used by the individual and collective users. The new approach which is proposed for the study of the properties of individual and collective languages is based on the theory of fuzzy sets The report examines several theoretical methods of f ormulating the proposed approach. These methons apc illustrated by the concrete practical results of the invest~gatlan of certain algorithmic languages. Computation 33 A QUANTTTATIVE INVESTIGATION OF THE ACTUAL UTILIZATION OF ALGORITHMIC LANGUAGES P. BYRNJEV","It is characteristic of artificial languages that their creation precedes their utilizat~on, whereas natural languages form and develop in the process of their use and undeli the influence of numerous factors. among which the foremost are the users","of the language. Algorithmic languages and, in particular, programming languages, constitute an important class of artificial languages","The languages seen below are primarily of this kind The simplicity, harmony, and completeness of artificial languages are their essential advantage when they are applied to special purposes. On the other hand in work wirh the arti ficial languages it is impossible to exhaustively foresee which language elements will be required. For this reason, differences arise between the requisites of the user and the resources of the language."]},{"title":"A","paragraphs":["sharp boundary between artificial and natural languages does not exist. On the One halld artificial languages also £111 out and develop. On the other hand artificial languages are used, so to speak, in a \"natural\" manner. People select certain permissible language elements. From this point of view, a given language can be vieweu a permissible language (the set of all permissible elements) as an individual language (the set of elements used by the discrete user), and as a collective language (the set of elements used by a certain group ~f people) Inasmuch as individual and collective languages (and in the case of natural languages, permissible ones) are not smictly determined, it is convenient to empJ.oy the mechanism of fuzzy sets.","The report is founded on the necessity ox studying the actual utilization of algorithmic languages, and results are presented of a statistical analysis of the utilization of the language elemenrs of some widespread algorithmic languages. In this light several conclusions are drawn relative to the interaction between algorithmic languages and their users. The report brings oat considerations which reinforce the assertion that it is necessary to distinguish artificial languages from, and not liken them to, natural languages Some of the questions examined are controversial in nature. computation BASES FOR CONTEXT-FREE LANGUAGES This work examines the task of finding bases for contextfree languages. The location of bases has theoretical and applied significance. At the time of translation of the programs of an a?-gorithmic language, the translator in the flrst place 'edits' the program, exchanging some of the basic symbols of the language for metalinguist c. variables which are defined by these symbols. In Algol 60 such variables could be 'identlfier', 'unsigned integer', 'integer', and so forth The aggregate of these variables and of fhe remaining baslc symbols is termed the basis. The use of the basls heightens the rapidity of action of the translator in constructing the syntactic tree and hence leads to the improvement of some ocner characteristics of the translator. The concept of the basis of a lnaguage is formally defined in the work. The graphs Gi, 1 = 1, 2, 3 are defined, linked with the language's grammar It is shown that the 1o~;Lion of the bases of a certain special class reduces to the locatidn of the maximally empty subgraphs of the graph G 1 A method is given for the location of all bases without repetitions. A modification of this method permits the exposure of only those bases answering certain conditions. These methods are realized in the rorm of o program for the Minsk 32 computer. Some results of the investigation, using this program, of the syntax of Algol 60 and Fortran, are cited. ON"]},{"title":"THE LINGUISTIC PROBLEMS OF AUTOMATIC INFORMATION PROCESSING","paragraphs":["The basic question in linguistic research directed toward the creation of an information language in information-retrieva1 type systems is the establishment of an approach serving to ap-portion the concise material content of language conknunication"]},{"title":"As","paragraphs":["distinguished from machine translation, the question at hand is selection of the language material which must be subjected to processing."]},{"title":"If","paragraphs":["the final record must be not only a coordination of the terms of the given text, but presumably also a record of"]},{"title":"the","paragraphs":["syntactic relationships between terms, the corresponding information language must contain a certain measure of grammatical analysis. It is assumed that the expression of the communication's structural relations can proceed from the semantic predicative construction (from the so-called word relations) Wlth the help of"]},{"title":"a","paragraphs":["dictionary of word relations and of grammatical analysis, the action (with its sphere of valency) is defined in the role of the center of material information, Actions can be grouped in broader classes having a general semantic character in common, the essential quality of such classification is that verbs belonging to one semantic class have the same type of actants. The information arrived at permits, besides purely documentary use of the information, the solution of other, more complex, problems (automatic abstracting, factographic informat1 retrieval, and the like) AN - ALGORITHM FOR THE ACCELERATED CAL&fLATION OF SET-ALGEBRA"]},{"title":"EXPRESSIONS KOSTADIN","paragraphs":["GRUEV"]},{"title":"Under examination","paragraphs":["are the set-algebra"]},{"title":"<alculations where p(@)","paragraphs":["is the"]},{"title":"family","paragraphs":["of subsets"]},{"title":"of the set","paragraphs":[", and U,"]},{"title":"fl","paragraphs":["and"]},{"title":"\\ are symbols of the set operations of union, intersection, and relative complementation. It","paragraphs":["is"]},{"title":"assumed that expressions","paragraphs":["in"]},{"title":"this algebra are wriften in infix form with arbitrary depth of term recursion. In term notation an arbitrary number of bracket pairs","paragraphs":["may"]},{"title":"be used.","paragraphs":["Object"]},{"title":"variables designate","paragraphs":["the identifiers of"]},{"title":"the elements","paragraphs":["of"]},{"title":"9(8). It","paragraphs":["is"]},{"title":"shownt that the majority of tasks solved in information","paragraphs":["retrieval systems"]},{"title":"(IRS)","paragraphs":["are"]},{"title":"reducible","paragraphs":["to"]},{"title":"the solution of","paragraphs":["similar"]},{"title":"expressions. So, for","paragraphs":["example, if"]},{"title":"0 is viewed as","paragraphs":["the"]},{"title":"object of an IRS, then the retrieval","paragraphs":["of"]},{"title":"object(s) from 9 possessing","paragraphs":["a"]},{"title":"cer-","paragraphs":["tain"]},{"title":"combination of","paragraphs":["signs is"]},{"title":"reducible to the calculation of the expressions from & corresponding to this combination.","paragraphs":["By"]},{"title":"force of the large dimensionality of set-expression files, conventional calculation methods are ineffective. The proposed algorithm stands out, by way of comparison with","paragraphs":["the"]},{"title":"es~ential archetypal algorithms, becauset of its better con-","paragraphs":["vergence and"]},{"title":"obviation of the","paragraphs":["necessity for"]},{"title":"the storage of inter-","paragraphs":["mediate"]},{"title":"results. This","paragraphs":["is"]},{"title":"achieved","paragraphs":["at"]},{"title":"the expense","paragraphs":["of the"]},{"title":"reorganization of the initial expressions","paragraphs":["and of the"]},{"title":"organization","paragraphs":["on this"]},{"title":"basis of a parallel-sequence calculation routine","paragraphs":["The algorithm"]},{"title":"has been","paragraphs":["verified"]},{"title":"in","paragraphs":["practice"]},{"title":"The program","paragraphs":["module,"]},{"title":"worked","paragraphs":["out"]},{"title":"by","paragraphs":["the"]},{"title":"author for the ISL","paragraphs":["series 1900 calculating"]},{"title":"system, constitutes about","paragraphs":["700 commands,"]},{"title":"A MATHEMATICAL MODEL OF THE DISTRIBUTION OF INFORMATION IN RETRIEVAL SYSTEMS M. DOMBROWSKI","paragraphs":["POLAND Many different methods exist for information retrieval These methods were created with the aim of minimizing the computer's retrieval time and volume of storage. Snme of these also allow for the property of multiple inquiries The report will present a general model for :he distribution of-information in retrieval systems. It will be shown that frequent isntances of this model represent the distribution of information in such retrieval methods as complete scanning, inversion chaining, and the methods of Ghosh-Abraham, Lune, Shaw, and Wong-Chang. ON"]},{"title":"AN APPROACH TO THE CREATION OF A DESCRIPTOR LANGUAGE WITH","paragraphs":["ELEMENTS OF GRAMMAR N. STANCHEY"]},{"title":"This","paragraphs":["is a proposal for a specific approach in the creation of a vocabulary of a descriptor-type information language"]},{"title":"(IL)","paragraphs":["which facilitates the isolation of synonyms, homonyms, etc It entails the entering of each concept on a separate card, together with a11 the words"]},{"title":"with","paragraphs":["which it forms word combinations"]},{"title":"A","paragraphs":["principle for creating descriptor-language grammar is being proposed. With this aim, representatives of each group of descriptors (class of concepts) are selected, from which matrices of the form"]},{"title":"\"ACTION-OBJECT\",","paragraphs":["\"MEANS-ACTION-OBJECT\", and 'b\"CIRCUMSTANCE-"]},{"title":"ACTION-OBJECTw","paragraphs":["are formed. The matrices enter into the dictionary pool"]},{"title":"of","paragraphs":["the IL in the capacity of lexical units. With the help of these matrices, all possible logical considerations are","stated which are adequate to the consideration of the concepts. An algorithm is suggested for indexing the content of documents and inquiries."]},{"title":"A search","paragraphs":["mode for documents"]},{"title":"(SMD)","paragraphs":["and inquiries (SMI) is created as a chain of elements, the mutual relations of which are set with the help of matrices. The matrices are the baSic link of the chain, to which are joinea the usual descriptors elucidating it."]},{"title":"A","paragraphs":["method is proposed for avoiding parasitic combiriat-~ons by utilizing a method of \"semantic overlap\" in €he creation of the SMD, i.e. the SMD is cxeated from the successively arranged elements, the neighbors of which encompass one identical concept. The IA vocabulary is grouped into the facets \"MEANS' \"OBJECTS\", \"CIRCUMSTANCES\", and so forth The advantages of the approach outlined are as follows The"]},{"title":"IL,","paragraphs":["in its ultimate stage, approaches natural language, the subjectivity in the indexing of documents and inquiries is reduced; parasitic combinations between lexical units are prevented, conditions are created for expansion and contraction of search scope without loss of information, the process of creating the IL is facilitated. The approach described is realized in one of the branches of transportation. THE SEARCH PROCESS IN AN AIRS Described here are the language and logic of the"]},{"title":"AIRS","paragraphs":["which is being developed in the Academy of Social Sciences and Social Government. The criterion of semantic correspondence which aligns the output in four echelons is being investigated.","The dependence of the search process on the rnformation language is revealed The necessity fer reverse communication with the user is shown, as well as its influence on the search. Reverse communication with the user is examined from the point of view of two procedures--a presearch procedure (compilation of search instructions up to the execution of the search process) and a postsearch procedure (the compilation of final search instructions after computer processing results have been received). The stages and forms of these two procedures in the AIRS and the possibility of future transition to dialog with the computer are indicated. Documentation 42 A PROGRAM PACKAGE FOR"]},{"title":"THE REALIZATION OF ADIS A MIXED-TYPE","paragraphs":["IRS VASIL DRAGULEV AND VASIL METODIEV The subj ect of the report is a program. package for- realization of an automatic documentary information system, ADIS. The package was developed m the computing center of the Academy af Sociab Sciences and Social Government The IS1 1904 computer is utilized. The work was conducted in 1974.","In the report an attempt is made to create a classificatio~ diagram of IRSs, and the place of ADIS in this diagram is indicated. The basic functional structures of the IRS are examined~ and functions exceeding the resources of the'package are indicated","The second part of the report discusses the fundamental demands and principles which accompany the work. A generalized flowchart of ADIS is proposed The fundamental demands and technological solutions in the package's program realization are examined par titularly the questions"]},{"title":"-","paragraphs":["the creation and actualization of the data base"]},{"title":"-","paragraphs":["the independence in structure of the data base from the basic programs of the package"]},{"title":"-","paragraphs":["the language fo'r the giving of retrieval instructions"]},{"title":"-","paragraphs":["the realization oi direct and sequential retrieval In the end several. practical results are discussed of the utilization of the program package and the trends for future developmen?"]},{"title":"AUTOMATIC","paragraphs":["INDEXING"]},{"title":"AND","paragraphs":["CLASSIFICATION IN INFORMATION SYSTEMS"]},{"title":"The","paragraphs":["report describes a model for automatic indexing and c~assification of docurnen~s and for the inquiries In information systems that operate in dialog mode. The model is built as a set of modules that realize the following functions automatic translation of the content of documents (synopses) iqto a descriptor-type in£ ormation-retrieval language with grammar automatic c~assification of documents (synopses) automatic reception ot a field of ordered structures of standard thematic inquiries automatic translation of the content of inquiries into a descriptor-type"]},{"title":"IR","paragraphs":["language with grammar automatic classification of inquiries into a field of ordered structures of standard thematic inquiries retrieval of relevant documents (in dialog mode) The realization"]},{"title":"of","paragraphs":["the model in its original form was carried out on an"]},{"title":"ASVT","paragraphs":["M-2000 computer on a file of texts (about 2000 synopses) along the theme \"Automatic Contzol Systems and Calculating Techniques\" and produced a positive result."]},{"title":"An","paragraphs":["analysis of the results received from the operation of the model has permitted furthex expansion of its functions The classification module that has been worked out is based not on the a pripri classificaticn of the acquired knowledge, but on the descriptor description of documents and inquiries which ukes possible the multi-level reception with the input of the next portion of documents and inquiries. Besides that, the use of grammatical means in indexing (indices of connection) significantly impreves the infomation","I language's index of accuracy A THESAURUS FROM THE POSITION OF A SYSTEMS APPROACH V. PEJCHEVA AND S. GABROVSKA","The systems approach, as a universal method, can be success-fully used in the consideration of a thesaurus as systems of categories and concepts with fixed semantic linkages between them. From the point of view of the systems approach, a thesaurus possesses the following system-forming characteristics Content-- the elements of a thesaurus, La. its dictionary composition, including the idea of a certain field of knowledge or practical activity; Relational composition--the links unifying its cornponents into a whole. The thesaurus's relations of interdependence are conaidered gender-aspectual (gender-aspect and aspect-gender) and the portion of associative linkages, and the relations of determination are considered the associative linkages of the rdason-consequence type. Pertaining to descriptors which lack genetic or associative linkages among themselves, it can be said that they are in the relationship of constellation, smce they are combined within the framework of the system, The function of the thesaurus--its ability to serve as the major ~omponent part in a system of higher order, an information-retrieval system, The management of the thesaurus--the process of its improvement by means of changes its content, $ ructure , and relations.","In constructing the thesaurus, one must heed the demands of the system's methodology, for integrity, compatibility of components (especially urgent in the development of polythau~~atic thesauri), horizontal and vertical decomposition of the system, minimization of the interaction of different subsystems, etc A SET OF ALGORITHMS AND PROGRAMS FOR AUTOMATED THESAURUS CONSTRUCTION IN INFORMATION RETRIEVAL SYSTEMS The report examines a sequence for the formation of a thesaurus in information-retrieval systems. This task consumes time and labor in large quantity, and the possibilities of its facilrtation by rneans of partially automated work on thesaurus format~on are being examined. Toward this arm information files have been defined, and a set of algorithms and corresponding programs has been worked out allowing the automation of the most time-consuming operations in the creation of the thesaurus (the creation or a dictionary of word-fcrms and word-combinations, alphabetic and frequency ordering, verification and correction of the dictionary, evaluation of the semantic bonds between descriptors, verification of the classification routine, the statistical profile of the dictionary composition, etc .) The programs are written in FORTRAN IV and intended for","the ISL 1904A computer. The programs which have been worked out are universally applicable to the formation of thesauri and various types of dictionaries. In the given instance, they are utilized for the creation of an economic information thesaurus in compliance wrth the proposed sequence of its construction Documentat ion 46 AUTOMATEQ INFORMATION-RETRIEVAL SYSTEMS"]},{"title":"WITH","paragraphs":["BILINGUAL INPUT A. LJUDSKANOV Bilingual (multilingual) input into automa~ru ~~~~~rmation systems (AIRS) makes possible the processing of documents in different languages without the creation of many systems or even the preli~~inary translation from a foreign language into the na tional one. The problem of bilingual (multilingual) input to an AIRS presents itself in connection wi~h automated indexing of documents and inquiries in different natural languages The realization of bilinguh- input is founded on certain informatic media and mathematical program realization"]},{"title":"I.","paragraphs":["The informatic media 1. The standard forms .of information cards (IC) of documents and of information blanks (IB) of questions are coded with a special code (0 and 1) for the guarantee of automatic selection of the file (Bulgarian and Russian) given in the corresponding natural language 2 The processing of the factolog~cal portions of the ICs and IBs is effectuated on the basis of code catalogs. 3 The resume (annotations) and questions are processed with the help of a bilingual (multilingual) descriptor dictionary in which the pairs, triplets, etc. of different-language descriptors are linked by a general code to the metalanguage of the system 11. The mathematical program realization includes pro- - grams for fmming code catalogs and a machine descriptor dictionary, a program for automated indexing, and a program for the search and delivery of responses The first experiments have shown that only the indexing program requires some changes in connection with the discrimination of the constants of the different natural languages. The block organization of the program makes possible with the help of a key the activation of that block whlch is necessary for the processlqg of the text in the corresponding language."]},{"title":"IIL. The automated information-retrieval system of the Institute of Radioelectronics is in the experimental phase with the goal of including Russian input The collective is","paragraphs":["also carrying on preliminary investigations toward the realizatron of tertiary English input into the system Documentation"]},{"title":"INFORMATIONAL-LINGUISTIC INTERACIIUNS LN THE SYSTEM In the process of mrormatlon service between the intorma-tion","paragraphs":["user and the"]},{"title":"informat.ion-retrieval system (IRS) , certain","paragraphs":["inf"]},{"title":"ornational-linguis tic interactions (ILI) are established which flow within the framework of the following language systems 1. The information-retrieval language YaSl in contact with the information files and the description of the semantic content of inquiries and documents6","paragraphs":["2"]},{"title":"The user","paragraphs":["language"]},{"title":"YaS2 in contact","paragraphs":["with"]},{"title":"the system","paragraphs":["(corn-"]},{"title":"puter and under control of","paragraphs":["the"]},{"title":"process of retrieving and","paragraphs":["pro-"]},{"title":"cessing information. 3 The programing language YaS3 according","paragraphs":["to"]},{"title":"the","paragraphs":["formula-"]},{"title":"tion and transcription of processes in","paragraphs":["the solution"]},{"title":"of","paragraphs":["information tasks in"]},{"title":"the","paragraphs":["computer. 4."]},{"title":"The natural","paragraphs":["language YaS4"]},{"title":"in user-contact with","paragraphs":["the"]},{"title":"information","paragraphs":["in"]},{"title":"the","paragraphs":["system."]},{"title":"The following aspects of the ILIs are examined 1 The semantic aspect--the semantic content of","paragraphs":["the"]},{"title":"TLI","paragraphs":["is"]},{"title":"formulated in terms of","paragraphs":["YaSl 2"]},{"title":"The program","paragraphs":["aspect--the presence"]},{"title":"of program media in carrying out","paragraphs":["the commands of"]},{"title":"communlcatlon","paragraphs":["and"]},{"title":"control by","paragraphs":["pro-"]},{"title":"cesses","paragraphs":["ih"]},{"title":"the","paragraphs":["computer. 3"]},{"title":"The pragmatic","paragraphs":["aspect--the satisfaction of the information needs which are the goal and the sources of interaction."]},{"title":"4. The organiza~ional-technical aspect--the ILI is","paragraphs":["carrled"]},{"title":"out","paragraphs":["in"]},{"title":"a given structuze with","paragraphs":["the"]},{"title":"help of certain technical means","paragraphs":["Stage"]},{"title":"I","paragraphs":["of language compilation. As a result of a statistical inspection of Bulgarian foreign-policy texts, 50,000 word forms in length, frequency and reverse-frequency d~ctionaries hayre wen compiled The 10,000 word forms entered cover the foreign-policy texts to"]},{"title":"90%.","paragraphs":["Both dictionaries have permitted the transition to the study of lexical and morphological semantics of t-he foreign-policy"]},{"title":"(FP)","paragraphs":["vocabulary on the paradigmatic plane Stage I1 of language compil+tion Based on the paradigmatic comparison of the lexical meanings of natural-language words (synonymy, gender, aspect, and so forth, the"]},{"title":"FP","paragraphs":["thesaurus has been compiled. 235 semantic groups"]},{"title":"(SG)","paragraphs":["have been singled out comprising 800 different words."]},{"title":"AN","paragraphs":["SG contains two or more words having one and the same elementary meaning (EM)"]},{"title":".","paragraphs":["The artificial designation of an SG, i.e the EM, is the root of the artificial-language word Furthermore paradigmatic relations (gender and so on) have been established between roots (ESs). The gender roots of a given root are called prefixes of the artificial word Besides prefixes, two numerical suffixes are appended to the root; the first indicates the form of connection of the concrete natural-language word within the framework of the SG, the second indicates the grammatical role of the given word"]},{"title":"(adjective,","paragraphs":["gender, number, etc ) In this fashi-on if one natural-language word enters into several SG's, it then has several ESs The information language Politika is a language of indirect documentation, descriptor type (having two layers of vocabulary), with grammar, branched and, to the extent of synthesis, synthetic On the basis of the description which has been carried out on the FP vocabulary, algorithms have been drawn up for the automatic translation of text from natural language to tho artificial language Politika (including algorithms for the removal of polysemanticity in natural-language words and algorithms for the automatic recognition of the semantic form on the level of indexing, annotation, and synopsis. Documentation 51 THE"]},{"title":"ANALYSIS AND RETRIEVAL OF JURIDICAL INFORMATION","paragraphs":["The report̂gives the nature of juridical texts with respect to their structure and language Starting from these characteristics, three approaches are described for the solution of the problems of analysis and retrieval in the field of law,"]},{"title":"- a methoe","paragraphs":["based on the indexing of documents"]},{"title":"-","paragraphs":["a full-text method"]},{"title":"-","paragraphs":["a heuristic approach to the ques~~on of research on legal texts. Then examples are presented or lnrormatron-ret~~evall system: based on these methods. In the end an appraisal of the adequacy and effectiveness of the above methods will be made AN AUTOMATED INFORMATION SYSTEM TO SERVE SCIENTIFIC CONGRESSES This report is basad on the graduation thesis which is being prepared in the Institute of Mathematics and Mechanics under the direction of coworker"]},{"title":"Avram","paragraphs":["Eskenazi"]},{"title":". The","paragraphs":["subject of work is an information system for processing data related to the conduct of scientific congresses, conferences symposia, etc."]},{"title":"The","paragraphs":["majority of the programs are written in the RPC language Besides this, the system's sorting programs are used Several of"]},{"title":"the","paragraphs":["basic blocks have-been worked out For input of data extracted from requests entered and f~","creation of a basic file containing information relating to each participant; For file renovation by new requests and for correction of errors which slipped through in the original listing,","For the output of amassed information in edited, expanded, and concise format,","For sorting records by various indices and output of the information so established in a certaln format (sorting by go-vernments and names, sections and names, the indicated category of participants and names, etc ) , For output of reports to participants auu postal addresses The system has been applied for the First ~ational Conference on the Use of Mathematical Models and Computers in Linguistics"]},{"title":"A LANGUAGE DESCRIBING THE STRUCTURE AND","paragraphs":["FUNCTIONING"]},{"title":"OF AN ORGANIZATIONAL-ADMINISTRATIVE TYPE CONTROL SYSTEM 6.","paragraphs":["PETROVA AND ST. DZHEDZHEV The processes of obtaining information are always accompanied by the processing of information of varying content rolume, and form of presentation. For the information management of these processes under a certain control system (CS), it is necessary to construct a suitable information system"]},{"title":"(IS)","paragraphs":["allowing the correct packaging and processing of information (including the actually existing control system), whrch is received at different times from different sources and carriers. The best conditions in this regard are provided by factographic information systems. Some questions on the construction of an information languagt in the planning of a factographic type informatibn system are the theme of this report. The presence of a language which ensures the capabilities enumerated above creates the conditions for the proper flow of the automated CSs real-system analysis and synthesis process$es."]},{"title":"In","paragraphs":["their report the authors found the reflection chiefly of the problem of selecting the basic semantic unit and the meads of epresenting the relationships between objects in the real environment--objects about which information is to be stored in the system's memory (particularly in the case where"]},{"title":"the","paragraphs":["objects are separate information sys terns)"]},{"title":"The","paragraphs":["system includes a language for processing questionnaire information and a translator for this language."]},{"title":"A","paragraphs":["unique feature of this language is the division of input information and its processing with the"]},{"title":"aim","paragraphs":["of logical and formal control of data and obtaining an accurate data bank."]},{"title":"The","paragraphs":["realized translator utilizes tree-like search methods and the notation of tLd language's operators and signs via direct access by initial letter, where single-letter signs are found"]},{"title":"directly.","paragraphs":["An operator exists in the language for processing textual responses with a standardized word order"]},{"title":"These","paragraphs":["responses are evaluated wkth"]},{"title":"the","paragraphs":["help"]},{"title":"of","paragraphs":["a fuzzy set (Zade) mechanism For this purpose an algorithm exists for locating various parts of the expression, locating them in the translator"]},{"title":"'","paragraphs":["s dictionary, and evaluating them."]},{"title":"A","paragraphs":["program has also been created for the compilation of a frequency dictionary of open terms depending on their type."]},{"title":"The","paragraphs":["translator is realized in the Fortran and Assembler languages for the Minsk 32 computer"]},{"title":"THE LINGUISTICS OF A TEXT AND MACHINE TRANSLATION","paragraphs":["I Our knowledge of the nature of language and of the mechenisms of text formation, the technical resources of calculating techniques, and the contemporary state of programming do pot permit us to hope for the successful execution of a full translation of a foreign text ln the ensuing decades The existence of the antlnomy between synchronism and diachronism, of a \"soft\" language system and its \"coarse\" deduEtive description places in doubt the very possibility, in principle, of global machine translation, 11. At present ~t is expedient to realize Lexical (automatic dictionaries of word-fornis and locutions) and lexlco-grammatical translation on the computer on the basls of the linguistics of the text.","111 The linguistics of a text is the inductive-deductwe theory which proceeds from tne assumption that the generation of a text is the interaction of the language's productive system, which limits this system to a norm and also to that sit.riat5on, which is described in the text Each text consists of units of expansion dictated by the language's system and norm and of semantically dominant units prompted by the situation.","IV The linguistics of a text uses two systematic approaches the investigation of the text with the help of probability-statistical and information methods and the deductive description of the productive system, whlch muse be carried out with the help of the theory oE fuzzy sets and algorithms.","V. The first approach permits the tracing of the information distribution in the text, the disclosure of the probability-informational nature of text formation, and the separation of the dominant units of the text from the units of expansion. Translation 56 A SYSTEM OF MACHINE TRANSLATION UN-DER DEVELOPMENT IN THE MATHEMATICAL LINGUISTICS LABORATORY OF THE INSTITUTE OF MATHEMATICS AND MECHANICS S. KARAGEZOVA, A. LJUDSKANOV, E. PASKAL~VA, AND 1. SHAMRAJ Problem, strategy, and trarksformation of the more \"profound\" analyses into more \"superficial\" anes"]},{"title":".","paragraphs":["The language material and preliminary investigations Analysis as the selection of signified items for assigned signifiers, translatio~. The lexemic dictionary, intention, compilation methods, type of units (premorphemic analysis), structure--the zones A, B, and C, the 16 information columns and their content, the volume of memory. The morphological dictionary. Analogy w~th the lexemic. The logic of the system preliminary automatic processing, search, analysis routines, translation routines, synthesis routines. Preliminary processing, automatic segmentation of the text into sentences. Dictionary search, registration of \"zero endings\", alternation of the stem, ~omplex words, unfound elements. The routines \"Lexical homonymy\" \"Lexical polysemanticity\", \"Stable combinations\", and \"Morphological polysemanticity\". Linguistic stems, \"contrastrve gtnmmar\", algorithmrc solution, outputs. Macr~ine realization and work on the \"oriented\" syntax and sernantlcs. Dialog and paths of development for future work These operations make possible the automatic separation of Cke theme and rhematics of the text, which is"]},{"title":"fn","paragraphs":["turn the condition fo~ the realization of machine indexing and abstracting of the foreign or native-language text, and also for correct, lexico-grammatical machine translation."]},{"title":"VI. The theory of fuzzy sets and algorifhms is","paragraphs":["more helpful than contemporary discrete-mathematic methods in describing a language's system and norm and also in formaliza-tion of text-formation methods. This theory, which is based on probability logic, plays apparently the deciding role in the creation of semantic machine translation which works on the computer"]},{"title":". AN EXPERIMENT OW","paragraphs":["THE STATISTICAL ANALYSIS OF"]},{"title":"INTERLINGUAL IDIOMATICITY In translated Old Bulgarian (OB) inscriptions from the 9th and 10th centuries. 94 verbs form combinations of the type \"verb + abstract noun\" (~+Nabstr). Of the uses, 74.5%","paragraphs":["fit V+Nabstr, and are formed by four verbs : TVORITI (create) , IMITI (possess)"]},{"title":", DATI (give)","paragraphs":["; and PRIDTI (come)"]},{"title":". Their equivalent combinations in the Ancient Greek (AG) origlna Ls are combinations with a more frequently used verb of the given meaning, a less used verb with the given meaning, and verbs of another mean","paragraphs":["ing , univerbs and those different from the V+Nabstr construction. The faur types of equivalents correspond to the four degrees of interlingual idiomaticity."]},{"title":"A large portion","paragraphs":["of the uses fits into the pattern of type 1 equivalents. The average number of equivalent AG combinations formed with a dominant verb is 70% and the mean square deviation is 10.3%, the coefficient of variation does not exceed 15%. The remaining three types of equivalents do not stand out by way of regularity--the coefficient of variation exceeds 40% in all cases. All four types of AG equivalent9 for the 033 combinations formed by the remaining 90 verbs vary over a very broad interval. The quantitative indices of interlingual","idlomaticity presented by other authors agree with our data. The npbef of hypo-idiomatic correspondences, in the ficst place, differs from one language to another, and, in the slecond place, noticeably falls in recent time by comparison with antirqtkty"]},{"title":". However, general patterns are nevertheless observed the large number of hypo-idiomatic equivalents to combinati~ns f owned by high-frequency verbs and the negligible variability of this number. These patterns must be subject to interpretation on the material of various Combination types and various languages. Socxal -","paragraphs":["Behavloxal Science AN EXPERIMENT ON THE USE OF LANGUAGE MODELING"]},{"title":"IN PSYCHOLINGUISTIG EXPERIMENTATION In","paragraphs":["researdh on spoken language activity a certain role is assumed by questions concerning the generatiop by a human of conneLcted text in a situation wherein the sense is preassigned."]},{"title":"In","paragraphs":["the majority"]},{"title":"of","paragraphs":["cases"]},{"title":"the","paragraphs":["required meaning can be expressed in several manners. However it is evident that the selection of a specific text (e.g., of a sentence) transmitting the assigned meaning is not fortuitous. Hence, in our experiment, varLous ways suggested themselves to the group of fzfty informants to express in Russian the meaning of the phrase, \"The Master"]},{"title":"(M","paragraphs":[") defeated the Grand Master (G .M. ) \" The in£ ormants indicated an obvious preference for certain sentences among the possible periphrases (e.g., \"The"]},{"title":"M.","paragraphs":["won a victory over the"]},{"title":"G.M.\",","paragraphs":["\"The G.M. lost to the M.\", and so forth). For an explanation of the preferences received, it was natural to turn to a linguistic description of the many synonymic phrases with the sense of \"The"]},{"title":"G.M.","paragraphs":["defeated the"]},{"title":"G.M.\".","paragraphs":["We"]},{"title":"find","paragraphs":["such a description in the model \"Meaning +-+ Text\" by"]},{"title":"I. A.","paragraphs":["Mel'chuk. Within the framework of this model one may, in particular, impart a quantitative sgnse to the concept of the \"syntactic complexity\" of"]},{"title":"a","paragraphs":["phrase and grade all periphrases by this index. The results of our experiment, analyzed from this point of view, provide grounds for the conclusion that, in the generation of sentences conveying an assigned meaning, preference is shown for \"simple\" phra$e$."]},{"title":"THE OBJECT AND METHODS","paragraphs":["OF"]},{"title":"STYLOSTATISTICS","paragraphs":["1."]},{"title":"In","paragraphs":["connection with the contemporary scientific-technical revolution, the integration of the sciences and the mathematics of the methods"]},{"title":"of","paragraphs":["the more frequently-encountered sciences are, along with other traits, characteristic of the development of science, as is well known. Linguistics, too, Is caught up in this mathematization, including stylistics. However the application of quantitative"]},{"title":"methods","paragraphs":["in linguostylis+ics has yet to receive its"]},{"title":"own","paragraphs":["sufficient theoretical groundwork, the specifics for applying thede methods here are inadequate, as are the questions of interpretation of the stylostatistical indices received. Hence, not infrequently, annoying errors crop up both in the orgavlization of collected material and in the treatment of the data received; at times, false conclusions are also drawn 2. One of the important bases for the elimination of the defects outllned in item 1, along with strict observance of the principles of mathematical-statistical method, is the precise definition of the object and specific character of stylostatistiaal method, 3. The object of stylostatistical research is the _statis-tical structure of the expression (text) in one or another sphere bf intercourse, corresponding to the concrete form"]},{"title":"of","paragraphs":["social consciousness and activity (scientific, artistic, legal, and so forth) which represents the specific organization of the language units,"]},{"title":"which","paragraphs":["create a special functional style"]},{"title":"of","paragraphs":["speech. The category of the functional style of speech is quantitative-qualitative. By the latter component is meant the semantic aspect possessang, in context, stylostatistical meaningfulness."]},{"title":"The","paragraphs":["method of sty1o~tatFsti.c~ proves qualitative-quantitative"]},{"title":"(statistical)","paragraphs":["and hence comparative, since the 8pecific character Humani tles 61 of separate functional styles (variety of speech) is most effectiveLy revealed ih their comparison. The utilization of this method must be based on the theory of functional stylistics (the concept of style, its functions, the extralinguistic bases, specificity, and speech organization of style, and interstylar and","intrastylar differentiation in speech. One of the important conditions of applying this method must be to take into account semantics and the functional meaning-fulness of the language units in the given context (and in the functional style) , inasmuch as frequently the very same quantitative data with respect to the same language units without taking into account their semantics (in the broad sense of the word, including grammatical semantics) can belong to different speech varieties, but have at the same time different stylistic significance. (Compare, for example, the close quantitative index for the use of verbs in the present tense in scientific language and dramaturgy. )"]},{"title":"5.","paragraphs":["Turning to statistical methods for the investigation of differeqt types of speech, including scientific ~peech, it is necessary to clearly define the principles for the selection of material and accurate stylistic borders of the latter (meanwhile in"]},{"title":"the selection of texts for analysis which actually represent the given functional","paragraphs":["style, and represent it in sufficient variety for objective conclusions to be made, they are encountered in investigations of omission. The contemporary questions for stylostatistics are tr~us the selecl;$on and organization of material, the volume of subsampling (in the investigation of different levels of speech), and the problem of inrrerpreting quantitative data, to whial a signif ican~ part of tne report is devoted STYLISTICS AND THE MOST FREQUENT WORDS OF A LANGUAGE The most frequent words in the Bulgarian language, from the point of view of their statistical distribution in texts, are not stylistically neutral The material from a very large selection of Bulgarian texts has shown"]},{"title":"that, for various language styles, the most frequent words, which form the beginning of a frequency-ranked list, are disposed in different ways in this list, bur in a fully derined way for texts","paragraphs":["of a given language style. It is proved, Eor example, thdn in journalistic texts, the arost frequent word is always the preposition NA (on, onto). In Bulgarian art-literature texts, on the other hand, NA never appears more frequently than the conjunction I (and). A SYSTEM FOR AUTOMATIC TEST"]},{"title":"GENERATION A dictionary","paragraphs":["of concepts and their characteristics (main idea, membership, functions, coefficient of difficulty, and other traits) is preassigned With the help of this dictionary and user-supplied parameters--the nmber of questions, the number of answers to each question, the sum of the coefficients of d~fficulty, etc.--a test is generated. Algorithms have been created which generate questions and corresponding answers of a certain syntactic structure. Besides this, certain means of solving linguistic problems have been developed The diversity of tests is achieved at the expense of using an appropriate form of random-number generator The fi~st variant of the system has been worked out m the algorithmic language PL/l on the Ye S. 1040 computer The experiment was conducted on a concept dictionary on the theme \"The operating system of the WS/ES Work on this system is continuing. NAME INDEX Beneshova, Eva 36 Metodiev, Vasil 42 Brajkova, Khristina 17 Mikhaj lova , Gergana 13 Byrnjev, P. 33 Mutafchiev, Radoslav 14 Dobrev, D. M. 26 Najdenov, K. 16 Dobrev Ivan 8 Orlenko, Anna Vasil'evna 62 Dombrowski, M. 38 Paskaleva, E. 56 Dragulev, Vasil 42 Pejcheva, V. 44 Dzhedzhev, St. 53 Petkov, Slavcho 31 Gabrovska, S"]},{"title":".","paragraphs":["44 Petrova, G. 53 Georgiev, Khris to Ts"]},{"title":".","paragraphs":["49 Petrova, Valja 52 Gruev, Kostadin 37 Piotrovskij, R G. 55 Karag'ozova, S. 30, 56 Radenski, A. A. 35 Khardalov, M. 11 Rajkovski, Nikola 15, 48 Khristov, Stefan 18 Rajnova, D. A. 12, 27 Kh'ngikjan, Sonja 41 Shamfaj"]},{"title":",","paragraphs":["T 56 Kirkova, R. K. 9 26 Stanchev, N. 39 Klimonov, V. D. 25 Stanchev, Pet'r 54 Klimonova"]},{"title":",","paragraphs":["G"]},{"title":".","paragraphs":["30 Stanulov, Nikolaj 7 Roleva, Maria 28 Tsochev, S. 11 Koplyenko, M. M. 58 Urutjan, R. L 24 Kotarov, M. 16 Vasiljevich, A. P. 59 Kotova, N. V. 16 Yanakiev, Miroslav 10, 16 Kozhina, M. N. 60 Yemolenko, G. V. 19 Kuta,M. 51 Yeskenazi, Avram 63 Kuznetsova, A. I. 27 Zajtsev, V G -43 Ljudskanov, A. 46, 56 Zasorina, L. N. 21 Marqhav, Angel 45 Zhe~hev, B. 11 Marinov, Yu. 11 The transliterations used here have not been verizied by cornparison with published lists or indexes. The editor will be glad to receive corrections which will be used in cumulative indexes of AJCL."]}]}