{"sections":[{"title":"MULTIPLE REPRESENTATION OF JAPANESE COMPLEX PREDICATES: A LEXICALIST ANALYSIS OF SUBJECT AND OBJECT HONORIFIC FORMS","paragraphs":["Akira Ishikawa","Sophia University, Dept of English and Studies 7 Kioi-cho, Chiyoda-ku, 102 JAPAN Email: ishikawa@hoffman.cc.sophia.tc.jp","Abstract","Lexicalist approaches to syntax can benefit from multidimensionality of representation as exhibited by Ailohanan(1997). Subject and object honorific forms in Japanese are shown to be complex predicates with its second component grammaticalized and triggering argument-sharing of the two components of the predicate. Multidimensional representation makes it possible to account for the Gricean inference mechanism working during the argument-sharing process of these honorific forms."]},{"title":"1 Introduction","paragraphs":["Lexicalist approaches to syntax can benefit from multidimensionality of representation as exhibited by Mohanan(1997). By multidimensionality of representation(MR) is meant a representational scheme in which more than one representation can be associated with a liguistic unit in the lexicon at a particular point of its generation. The lexicon as the generator of wordforms is rather like a knowledge base whose function as a repository of lexical information Comes not only in its static capacity of serving relevant, information at the demand of syntax but also in its dynamic capacity of modifying and updating the overall structure of the lexicon in terms of the relationships between the items of information. It is uncontroversial that lexical information has to reflect various levels of representation in syntax as well as those of semantics and pragmatics. Thus the idea of MR in the lexicon is germane to the nature of the lexicon.","Mohanan(1997)'s treatment of NV complex predicates in Hindi is an instance of the MR approach to the lexicon. In the paper, complex predicates are defined as follows:","A COMPLEX PREDICATE construction is one in which two semantically predicative elements jointly determine the structure of a single syntactic clause.(p.432)","Mohanan uses the following example to illustrate how complex predicates are formally represented using two levels of representation: the semantic structure (Sem Str) and the argument structure (Arg Str).","(i) raam-ne apnaa homwark kiyaa. Ram-E self's homework-N do-PF Ram did his homework.","(ii) raam-ne mohan-par bharosaa kiyaa Ram-E Mohan-L reliande/trust-N do-PF Ram trusted/relied on Mohan. The verb kar 'do' in (i) is a full verb winch has the following representation, —131--","(iii) [ 'doer' 'done thing'] DO\\tSEM STR I\\tI o\\to\\tkar < ARG1\\tARG2\\t> PRED ARG STR whereas in (ii) it acts as a light verb, which comprises a complex predicate together with the noun bharosaa, whose predicatehood is represented as follows: (iv)\\t'truster' 'trusted'] TRUST\\tSEM STR bharosaa < ARG1\\tARG2\\t> PRED ARG STR Semantically, the complex verb (CP) bharosaa kar 'trust do' has at least two arguments, the truster and the trusted. It has also to be shown that the truster, which is an experiences, takes ergative case, just as the doer does. Moreover the nominal bharosaa behaves as an argument ill the syntactic level. These properties of the CP is captured by the following representation. (v)\\t'doer'\\t'done thing'] DO\\tSEM STR I\\t[ 'truster' 'trusted'] TRUST bharosaa kar < ARG1","\\t ARG3\\tARG2\\t> PRED ARG STR With a relevant algorithm for ordering and merging the two predicates, it is clear that the representation can account for how the predicates are combined to form a CP which has the above stated characteristics."]},{"title":"2 Honorification and its compositionality","paragraphs":["The line dividing syntax and the lexicon is usually so drawn that such phenomena as can be described in terms of independent words are classified as syntactical whereas those which involve bound forms are classified as lexical. What is most problematical in thinking of this issue for the Japanese language is the fact that bound forms come with clearly discernible phonological shapes and semantic- values most of the time. The analysis of a word into clearly bound fornis as in the English syn- tact-ic-al-ly is almost impossible to achieve in Japanese with the exception of those Chinese compounds which do allow such decomposition. Since most Japanese bound forms can easily be discerned as if they were independent words, the generative linguist has tended to treat them at the level of syntax and also easily dismiss such bound forms as would defy such syntactic treatment as unanalysable. Such bound fornis are simply strung together with other bound forms and treated as fixed expressions.","The subject honorific form of a verb o-V-ni mar (SHF henceforth) is one such case. Syntactic approaches take this form as made up of two independent words o- V-ni and nar without further analysing how the two words contribute their respective information to the construction. In contrast, lexicalist approaches can take the whole form as one word as required from its syntactic behavior, and analyse the lexical compostion of the two component forms. Unlike syntactic approaches, lexicalist approaches can (i) distinguish between cases where 'liar acts as an independent word from those where it does not, and (ii) assign to each component clearly discernible functions, thus making it possible to explain how the entire form can have honorific import and how each component can combine with other fornis to give rise to related constructions.","Let us look at the most crucial component of this form first. The verb nar 'become' takes two arguments SUBJ and XCOMP and denotes the relation of the subject changing to a state denoted by XCOMP.","(1) a. John-ga utaite-ni nat-ta John-Nom singer-Dat become-Perf John became a singer.","b. John-ga totemo ooki-ku nat-ta John-Nom very big-Ren become-Perf John became very big. The status of \"ni\" in \"utaite-ni\" (dative marker) and that of \"ku\" in \"ooki-ku\" (ren'yoo marker) are well-established and can be motivated by several considerations which we will not go into here. \"R,en'yoo\" is a traditional grammatical term indicating that the wordforins with this marker act as modifiers of a subsequent predicative element.","The independence of 'nat-ta from the preceding XCOMP expressions can be seen by letting some element come between the two.","(2) a. utaite-ni John-ga nat-ta singer-Dat John-Nom become-Perf John became a singer.","b. totemo ooki-ku John-ga nat-ta very big-Ren John-Nom become-Perf John became very big. As a step to identifying the changed nature of nay in SHF, we can cite a clear case of grammaticalized nay. In idioms based on the same construction like o-syaka-ni nay 'be ruined' and mokuarni-'n2 nay 'come to nothing', na y is no longer an independent verb. Here and henceforth, Exa in the annotations is short for exalting.","(3) a. sono tatemono-ga o-syaka-ni\\tnat-ta the building-Nom Exa-Buddha-Ren become-Perf The building was ruined.","b.*o-syaka-ni\\tsono tatemono-ga nat-ta Exa-Buddha-Ren the building-Nom become-Perf There are certain noticeable features testifying to the idiomatic status of o-syaka-iii nay. The Buddha is usually referred to by the combination o-syaka-sama, with the general title for politeness sama attached after the noun stein. But this attachment of swam is not allowed in this idiom. 0-syaka-sama-ni na y only has the literal meaning 'to become a Buddha.' Another important thing to be noted is that o-syaka alone can act as a predicate with the verbaladjective inflexion. Iii the same vein, o-syaka-ni combined with the verb surC(10') provides the transitive version of our idiom.","(4) a. sono keikaku-wa moo\\to-syaka-da that project-Top already Exa-Buddha-Pres That project is ruined already.","b. John-ga sono keikaku-o\\to-syaka-ni\\tsi-ta John-Nom that project-Acc Exa-Buddha-Ren do-Perf John ruined that project. One way of explaining this idiom is to say that it is the result of a word-formation process involving argument-sharing. -133- (5) a.\\t' obj ect \" changed state ']\\tBECOME I \\t nar < ARG1\\tARG2 b. 'object'\\tBE-RUINED o-syaka < ARG1> c. ' object '\\t'changed state']\\tBECOME","[\\tI 'object' ]\\tBE-RUINED o-syaka-ni nar <ARG1 > d. 'doer' 'done thing']\\tDO sur < ARG1\\tARG2\\t>","e.\\t [ 'doer'\\t 'done thing']\\tDO","[\\t'object' ]\\tBE-RUINED o-syaka-ni sur < ARG1","\\t ARG2 In (5c), the two \"object\" roles share the same argument, while the \"changed state\" role of nay, orginally bearing the XCOMP function, is identified with the embedded predicate and simply 1,bso1'bed. By contrast, in (5e), the \"doer\" argument and the \"object\" argument cannot share one 1.11.d the same argument because their characters are incompatible with each other. I The \"done thing\" role has to be identified with the embedded proposition, leaving the \"object\" role intact, which comes out as the OW argument. Thus, the current lexicalist approach to word-formation makes it possible to bring semantic considerations to bear on the calculation of the argument structure of complex predicates.","Let us compare the subject honorific- form 0-V-ni nal. with o-syaka-ni nar. We see that SHF is also a CP which does not allow another syntactic consituent t0 occur within it, indicating that the na'r in this form is no longer a full verb.","(6) a. Tanaka-sensei-ga\\tsono hon-o\\to-yomi-ni\\tnat-ta Tanaka-teacher-Nom that book-Acc Exa-read-Dat become-Perf Professor Tanaka read the book.","b.*sono hon-o\\to-yomi-ni Tanaka-sensei-ga nat-ta that book-Acc Exa-read-Dat\\tTanaka-teacher-Nom become-Perf SHF does not have a transitive counterpart 0- V-ni sur. Since in SHF the predicate nar does not retain its original sense \"to become\" it is inconceivable that there should be such a counterpart.","The \"causee\" role does sometimes share the same argument with the \"agent\" role of the embedded predicate in a causative CP. However, it is not argument-sharing but functional control that brings about thisi effect. So there is no conflict coming from the different characters of the two roles.","(7)\\t*Tanaka-sensei-ga sono hon-o\\to-yomi-ni\\tsi-ta Tanaka-teacher-Nom that book-Acc Exa-read-Dat do-Perf The status of ni in o-V-ni is closer to a dative marker than the ren'yoo marker in o-syaka-ni. A piece of evidence supporting this analysis is the presence of variants of SHF which have either the form o- V nas-are or the form o-V-ni nasar. Nas-are has the verb nasnlo') followed by an auxiliary verb are signifying respect. Nasar is a subject-exalting verb meaning 'do'. One might well argue that nas is the transitive counterpart of nar.","(8)a. Tanaka-sensei-ga sono hon-o\\to-yomi\\tnas-are-ta Tanaka-teacher-Nom that book-Acc Exa-read do-RESPECT-Perf Professor Tanaka read the book.","b. Tanaka-sensei-ga sono hon-o'\\to-yomi\\tnasat-ta Tanaka-teacher-Nom that book-Acc Exa-read do-Perf Professor Tanaka read the book."]},{"title":"3 The origins of SHF","paragraphs":["For the variants , we can apply the same argument-sharing technique as we did above to derive the correct argument structure for them. Both nas-are and nasar Call arguably be taken to contain a morpheme indicating \"existence\" or \"spontaneity\" with roughly the form ar. It has also been argued by some traditional Japanese grammarians that this morpheme could have given rise to the four auxiliary Verbs of the same form are meaning \"respect\", -possibility\", \"spontaneity\", and \"passivity\". If we accept this position, we will obtain a clue to the Origins of SHF. 0-Vi-ni nar derives its sense of subject-exaltation from its component 'nar meaning 'to become', which categorizes the act denoted by o-V-ni as emerging of its own accord rather than the agent's conscious effort. Subject-exaltation by means of are is still very common in contemporary Japanese.","(9) Tanaka-sensei-ga sono hon-o\\tyom-are-ta Tanaka-teacher-Nom that book-Acc read-RESPECT-Perf Professor Tanaka read the book. It is also to be noted that the form o- V alone does not license subject-exaltation. For we have a corresponding object-exaltation form o- V sur.","(10) watasi-ga Tanaka-sensei-ni\\tsono uta-o I-Nom\\tTanaka-teacher-Dat the song-Acc o-kik-ase\\tsi-masi-ta Exa-hear-CAUSE do-Pol-Perf I caused Professor Tanaka to hear the song. On the other hand, another variant of SHF is possible using the form o- V da, whose second component is a copulative verb. So it is the nature of the second component of these honorific forms which decides the target of respect.","(11) Tanaka-sensei-wa sudeni sono hon-o\\to-yomi-dat-ta Tanaka-teacher-Top already the book-Acc Exa-read-Cop-Pres Professor Tanaka has alread read the book. –135– In the next section, we will see how we can take advantage of our multidimensional representation scheme in the lexicon to explain how SHF and the related forms are constructed with their desired syntactic and semantic . behavior."]},{"title":"4 Multidimensional analysis of SHF","paragraphs":["Mohanan s argument-sharing mechanism with its ability to refer to the SEM and ARC structures at the same time makes it possible to bring semantic . considerations into the calculation of the argument structure of a word. In order to give a consistent picture of Japanese periphrastic honorific . locutions, we should look at the very mechanism of identifying a role of one predicate with a role of the other predicate. 4.1 Argument-sharing for SHF In Japanese, we can recognize the following five types of CPs.","(12)a. causatives and passives(yom-ase 'read cause = cause sb to read',","yom-are 'read pass = be read', etc)","b. benefactives (yonde-age 'read give = give sb a favor of reading',","yonde-moraw 'read receive = receive a favor of sb's reading')","c. aspectuals (yonde-ok 'read lay = make a provision of reading,","yomi-hazime 'read begin = begin to read)","d. VV compounds (hiki-tome 'pull stop = detain', mi-otos","'look drop = overlook')","e. NV compounds (dokusyo-su 'reading-books do = read books',","roodoku-su 'loud-reading do = read aloud')","As is shown in Ishikawa(1985), the first three types CPs in (12) all show clear functional-control behavior: ie., the second component of a CP is the functional head and retains its meaning in the resultant CP. For these CPs, the identification of a role of the first predicate with a role of the second predicate is effected by functional control without involving argument-sharing.","In order to describe a situation in which a person A invites a pain upon himself by fiming another person B into inflicting the pain on A, we have to retain the two roles to be associated with A in the form of two separate arguments for two separate predicates.","(13)a.John-ga zibun-o Mary-ni hik-ase-ta John-Nom self-Acc Mary-Dat run=over-CAUSE-Perf John made Mary run over him(self).","b.John-ga zibun-o Mary-ni hii-te\\tmorat-ta John-Nom self-Acc Mary-Dat run=over-TE receive-Perf John received Mary's favor of running over him(self). With these types of CPs,–Japanese does not use argument-sharing because the original meanings of the functional-head verbs( ase and moraw) are distinctly kept in the resultant CPs.","On the other hand, CPs in (12d) and (12e) require the argument-sharing mechanism because the original meanings of the finictional-head verbs are usually not retained ill the results. If the preservation 01 otherwise of the orginal meaning of the functional-head verb can be a sufficient criterion to distinguish between argument-sharing and non-argument-sharing cases, SHF is clearly to be categorized with the former because the only semantic contribution of nal. is its aspectual feature of achievement ill the sense of Dowty(1979). In other words, we can no longer recognize the original sense \"to become\" of nar in SHF. (14b), but not (14a), is a SHF.","(14)a. Tanaka-sensei-ga o-sitoyaka -iii nat-ta Tanaka-teacher-Nom Exa-graceful-Ren become-Perf Professor Tanaka has become graceful in manner.","b. Tanaka-sensei-ga o-sitoyaka-iii 0-Hari-Ill nat-ta Tanaka-teacher-Nom Exa-graceful-Ren Exa-bcome-Dat become-Perf Professor Tanaka has become graceful in manner.","SHF is not possible with stative predicates including adjectives and verbal adjectives. –136–","(15) Tanaka-sensei-ga\\tsono news-o\\to-siri-ni\\tnat-ta Tanaka-teacher-Nom the news-Acc Exa-know-Dat become-Perf Professor Tanaka learned the news. #Professor Tanaka knew the news. By contrast, the o- V (la variant of SHF does not have this restriction.","(16) a. Tanaka-sensei-ga\\to-kirei-da. Tanaka-teacher-Nom Exa-pretty-Cop=Pres Professor Tanaka is pretty. \\t","b. Tanaka-sensei-ga sono news-o \\to-siri\\tdat-ta Tanaka-teacher-Nom the news-Acc Exa-know Cop-Perf Professor Tanaka knew the news. #Professor Tanaka learned the news. Since the original meaning of na'r is lost, We consider the o- V-ni tut r SHF to 1)e a case of argument-sharing word-formation. 4.2 Spontaneity and respect","The next questio is, \"What sort of argument-sharing is involved in the case of SHF?\" Before giving our answer to this question, let -us look at a speculative scenario about how the auxiliary verb of passivity \"are\" has come to be used in the three other distinct but related capacities: spontaneity, possibility, and exaltation.","Oono et, al. (1974) claims that the ancient counterpart of \"are\" , ie. \"1'u/l'ai'n'', developed the four meanings starting with the meaning of spontaneity. According to their account, \"ru/raru\" denoted a spontaneous entergoilice of an event in the sense the event occurred of its own accord O1' naturally without any human intervention. Possibility was connected with spontaneity in that the ancient ,Japanese regarded possibility not as something humanly controllable but as something unfolding as nature unfolded itself in the form of various events. Exaltation was indirectly connected with spontaneity through fear. Fear of direct mention of people to be held in awe and their activity induced one to describe such activity as naturally occurring, hence totally unrelated to what is launan. Passivization in Japanese is claimed to be different from that in Western languages. For one thing, it can apply to intransitive verbs as well as transitive verbs. They argue that this conies from the conceptualization of passivity as referring to something which comes about and develops to its end inespective of the presence of active contribution by the subject.","Based on this account, we can present a lexicalist version of the semantic development of the auxiliary verb arc. Following the standard interpretation of passivization in LFG, we say that it involves the demotion of the highest semantic role by changing the argument corresponding to it into an optional one. The etymological relationship between \"are\" and the verb arCto exit' is also supported from this viewpoint because the verb aris known to be used to form a resultative CP. (18) shows a possible derivation of the CP ai-te ar hi (17). The identification of the 'object' of ar and the 'cooked thing' of 'ni-te can be thought of as causing the reduction of the number of obligatory arguments for 'air from two to one.","(17) sakana-ga ni-te\\tar-u fish-Nom cook-TE exist-Pres Some fish is cooked. (18) [ ' ob j ect ' ]\\tEXIST [ 'cooker' 'cooked thing'] COOK ni-te ar ARG1\\t< ARG2 > If we resort to the idea of iconicity as ill Givo11(1984), we can argue that the merger of the stem and the ur- are with the meaning \"to exist\" is more thorough, causing the latter to completely lose its semantic impoa.2","(19) sakana-ga nir-are-ta fish-Nom cook-PASS-Perf Some fish got cooked. For contemporary Japanese, there does not seem to be any need to posit a separate are for spontaneity because the 115e can be subsumed by the passivity are. A piece of evidence is found in the case-marking possibility of the optional agent argument of the CP: the argument cannot take the nominative Case marker.","(20) a. John-ni-wa hurusato-no-koto-ga \\tomow-are-ru John-Dat-Top hometown-Gen-thing-Nom recall-PASS-Pres John just happens to recall his hometown in spite of himself","b. *John-wa hurusato-no-koto-o\\tomow-are-ru John-Top hometown-Gen-thing-Acc recall-PASS-Pres The possibility a,re does not seem to be used independently of further suffixal elements with a negative or inchoative meaning. Moreover, even possible cases like (21b-c) sound very outdated. My conjecture here is that this is also a derivative reading of the passivity are. But it needs further investigation to settle this matter.","(21) a.?John-ni-wa\\tsono hon-ga\\tyom-are-ru. John-Dat-Top the book-Nom read-ARE-Pres John can read the book.","b. John-ni-wa sono hon-ga yom-are-nai. John-Dat-Top the book-Nom read-ARE-not John cannot read the book.","c. John-ni-wa sono hon-ga yom-are-ru-yoo-ni John-Dat-Top the book-Nom read-ARE-NM-state-Dat nat-ta become-Perf John came to be able to read the book.","2 It is also noteworthy that in (19) nir takes the perfective suffix te, whereas it does not in (18). The presence of to suggests a bi-clausal origin of ni-te ar, where the situation is viewed as comprising two sub-situations. By losing the suffix, it is conceivable that nir-ar also loses bi-clausality and the existential import from are. -138-Finally, the exaltation are can be understood as a different case of argument-sharing from passivization, which involves the are with its existential meaning.","(22) Tanaka-sensei-ga sono hon-o\\tyom-are-ta Tanaka-teacher-Nom the book-Acc read-ARE-Perf Professor Tanaka read the book. (23) [ ' obj ect ']\\t EXIST [\\t'reader'\\t'read thing' ] READ yom-are < ARG1\\tARG2 > As is shown in (23), the function of are is to trigger an argument-sharing of the type which identifies a 'object' argument with a 'reader' argument, which is in the agent Class.' ; As we saw in (13), this type of semantic-role identification requires a biclausal f-structure for the CP, which indicates the existence of two separate sub-situations corresponding to the two components of the CP. One might posit (24) as a 'conceptual' source of (22). Then, one can take (22) as a shorthand for (24), with the argument-sharing indicating the uncommon identification of semantic. roles.","(24) Sizen-ga Tanaka-sensei-ni son() hon-o yom-ase-ta nature-Nom Tanaka-teacher-Dat the book-Ace read-Cause-Perf Nature made Professor Tanaka read the book.","We can transfer this argument to our analysis of SHF in the following way. Instead of an existential verb, SHF uses an inchoative verb \"nar\" ('to become'), which has the following SEM-ARG structure, in which ARG2 is not to be realized by a nominal argument but by a predicative argument because it is associated with XCOMP. (25) 'object' 1 < ARG1 ' changed state'\\tBECOME nar ARG2 > In other words, the number of nominal arguments is one just like the existential verb are.","(26) and (27) show that the type of argument-sharing required of SHF violates the cognitive constraint oil compatible semantic roles.","(26)\\tTanaka-sensei-ga\\tsono hon-o\\to-yomi-ni\\tnat-ta Tanaka-teacher-Nom the book-Acc Exa-read-Dat become-Perf Professor Tanaka read the book.","3 In this paper, I (10 not commit myself to any particular version of semantic-role hierarchy. I take semantic roles to form clusters hi the sense of equivalent classes, where equivalence is defined in terms of the sameness of function for a particular linguistic operation. I have yet to develop this theory of equivalence classes of semantic roles for Japanese. —139— (27)\\t[ 'object'\\t'changed state'\\tBECOME 'reader' 'read thing'\\t] READ o-yomi-ni nar <\\tARG1 ARG2 In (27), the \"object\" role is identified with the \"reader\" role, a clear violation of the cognitive constraint On compatible semantic . roles. This flouting of the constraint invokes the activation of a related source-structure like (24), which would enable the interpretation of (27) from a different perspective, one involving nature as a third participant.","This Gricean step in the interpretation of (27) is essential if we adopt the view that respectfulness comes from the pretence that the agent has nothing to do with the emergence of an event. It is the inverse of personification. We can hypothesize that this impersonification, as it were, is the principle working in the SHF word-formation. It is also essential to assume that the role from the higher predicate decides the semantic role of a fused argument coming from argument-sharing. 4.3 The target of exaltation","Our last question is this: How can the target of exaltation be determined? It seems that the following simple rule is operative in the determination of the target.","(28) In \"o-V\" exaltation, the highest non-agent becomes the target of exaltation. In (27), it is ARG1 which becomes the target of exaltation because it has lost its agentivity through impersonification. Let us check if (28) works for object-exaltation forins(OHF henceforth).","(29) watakusi-ga Tanaka-sensei-o\\to-mukae si-ta I-Nom\\tTanaka-teacher-Acc Exa-meet do-Perf I met Professor Tanaka. (30) [ 'doer'\\t'done thing' ]\\tDO 'meeter' 'met thing' ] MEET ARG2\\t> o-mukae sur < ARG1 In (30), the highest non-agent is ARG2, which is indeed the target of exaltation.","Let us just quickly look at two favorable consequences of this analysis. First, we can explain why SHF but not OHF(object honorific form) is possible with intransitive verbs. —140—","(31) a. Tanaka-sensei-ga\\to-kaeri-ni\\tnat-ta Tanaka-teacher-Nom Exa-return-Dat become-Perf Professor Tanaka has left for home.","b.*John-ga\\to-kaeri\\tsi-ta John-Nom Exa-return-Dat become-Perf Joh has left for home. (32) 'doer'\\t'done thing' ] DO [ ' object '","\\t ] RETURN o-kaeri sur < ARG1 > As is clear from (32), which shows the AIR-SEM structure of the OHF in (31b), there is no highest non-agent-argument which (1.I1 become the target of exaltation.","Second, we can explain why the coinitative marker to, which is often used to mark the second agent just as the English preposition 'with, cannot be used to mark the target of exaltation. In (33a), semsei-to is not the highest non-agent argument. In the same situation, (33a) is acceptable.","(33) a.*John-ga\\tsensei-to\\to-nimotu-o\\to-moti\\tsi-ta John-Nom teacher-Com Exa-baggage-Acc Exa-carry do-Perf John carried the baggage with the professor.","b. John-ga sensei-no\\to-nimotu-o\\titi-bubun John-Nom teacher-Gen Exa-baggage-Acc partly o-moti\\tsi-ta Exa-carry do-Perf John carried part of the professor's baggage. In (33b), it is the baggage rather than the professor which is the target of exaltation.","Lastly, the 0- V da variant of SHF in (16) is correctly characterized by (28) as having the SUM- argument for the target of exaltation."]},{"title":"5 Conclusion","paragraphs":["For languages like Japanese whose word-formation is agglutinative, word-formation processes are more naturally formulated in the lexicon than in syntax. I have shown how multiple representations available for the calculation of the ARG-SEM structures of CPs, proposed by Mohanan (1997), can be profitably applied to explain the behavior of subject-exaltation and object-exaltation fmins involving ''o-V\" in Japanese, giving a consitent and unified account of the two forms in the framework of LFG.","4 1 agree with a refree's opinion that in (33b), the target of exaltation is not just the baggage but the professor's baggage."]},{"title":"6 Bibliography","paragraphs":["Bresnan, Joan and Jonni M. Kanerva. 1989. Locative Inversion in Chichewa: A Case Study of Factorization in Grammar. Linguistic Inquiry 20(1): 1-50.","[2] Dalrymple, Mary, John T. Maxwell III, and Annie Zaenen. 1995. \"Modeling Syntactic Constraints 011 Anaphoric Biding.\" in Formal Issues in Lexical-Functional Grammar, Mary Dalrymple, Ronald M. Kaplan„ John T. Maxwell III, and Annie Zaenen, eds., 167-76. Stanford: CSLI.","[3] Dowty, David R. 1979. Word Meaning and Montague Grammar. Dordrecht: D. Reidel Publishing Company.","[4] Foley, William A., and Robert D. Van Valin. 1984. Functional Syntax and Universal Grammar. Cambridge: Cambridge University Press.","[5] Givon, Tahny. 1984. Syntax: A Functional-Typological Introduction, vol. I. Amsterdam: John Benjamnins. [6] Hasegawa, Yoko. 1996. A Study of Japanese Clause Linkage. Stanford: CSLI.","[7] Ishikawa, Akira. 1985. Complex Predicates and Lexical Operations in Japanese. Doctoral dissertation, Stanford University, Stanford.","[8] Kokuritu Kokugo Kenkyuuzyo. 1951. Gendaigo no Zyosi-Zyodoosi. Tokyo: Syunei Syuppan","[9] Kuno, Susumu. 1973. The Structure of the Japanese Language. Cambridge, Mass.: The MIT Press.","[10] Martin, Samuel. 1975. A Reference Grammar of Japanese. New Haven: Yale University Press.","[11] Mohanan, Tara. 1997. \"Multidimensionality of Representation: NV Complex Predicates in Hindi\" in Complex Predicates, eds. Alex Alsina, Joan Bresnan, and Peter Sells, 431-71. Stanford: CSLI.","[12] Oono, Susumu, Akihiro Satake, and Kingoroo Maeda. 1974. Iwanami Kogo Ziten. Tokyo: Iwanami Syoten.","[13] Sells, Peter. 1995. Korean and Japanese Morphology from a Lexical Perspective. Linguistic Inquiry, Volume 26, Number 2, 277-325.","[14] Matsumoto, Yo. 1996. Complex Predicates in Japanese: A Syntactic and Semantic Study of the Notion of 'Word'. Stanford: CSLI."]},{"title":"[1 ]","paragraphs":[]}]}