{"sections":[{"title":"THE MODULE-ATTRIBUTE REPRESENTATION OF VERBAL SEMANTICS","paragraphs":["Chu-Ren Huang* and Kathleen Ahrens**","*Academia Sinica,**National Taiwan University Institute of Linguistics","Academia Sinica Nankang, Taipei, Taiwan 115 Email : churen@sinica.edu.tw ABSTRACT In this paper, we set forth a theory of lexical knowledge. we propose two types of modules: event structure modules and role modules, as well as two attributes: event-internal attributes and role-internal attributes which are linked to the event structure module and role module respectively. These module-attribute semantic representations have associated grammatical consequences. Our data is drawn from a comprehensive corpus-based study of Mandarin Chinese verbal semantics. 1. BACKGROUND Generative theories have long assumed that lexical semantics are encoded on each and every lexical entry, and hence represent idiosyncracies of each lexical item. The assumption, however, goes back much farther than generative theories. For example, Levin [1993] pointed out that Bloomfield wrote in 1933: 'The lexicon is really an appendix of the language, a list of basic irregularities\" (p. 274). As a consequence of this assumption, lexical semantics was not intensively studied within the generative framework because it was not expected to offer any interesting generalizations. The notable exceptions, other than the short period of intensity of the generative semantics paradigm, were Jackendoff [1983] and Wierzbicka [1985]. However, as grammatical theories become more and more lexicon-driven, more in-depth theoretical and empirical studies of the lexicon have been carried out, and the above assumption is no longer valid. Levin [1993] in particular sounded the call for in-depth work on a theory of lexical knowledge. She writes that a theory of lexical knowledge: ...must provide linguistically motivated lexical entries for verbs which incorporate a representation of verb meaning and which allow the meanings of verbs to be properly associated with the syntactic expressions of their arguments (p.1). This goal of a theory of lexical knowledge has not yet been attained, for reasons we will discuss in section 2 below. It is, however, a worthy goal, and is in fact, the goal of this paper - to provide a theory of lexical knowledge based on lexical semantic features that are associated with a verb and predict their associated syntactic expressions. In what follows, we first look at why Levin's [1993] proposal of using diathesis alternations to ferret out meaning has fallen short of its goals, and propose a different way of looking for relevant syntactic behavior (Section 2). We next prescnz two underlying assumptions of our theory of lexical knowledge (Section 3), and then present the theory - (Section 4). We summarize our paper in Section 5. 2. VERBAL SEMANTICS Levin [1993] assumes that:","....the behavior of a verb, particularly with respect to the expression and interpretation of its arguments, is to a large extent, determined by its meaning. Thus, verb behavior can be used effectively to probe for linguistically relevant pertinent aspects of verb meaning' (p.1). We agree with this assumption. But as we will discuss below we look at different aspects of verb behavior from Levin [1993]. Levin [1993] concentrates on the range of possible synactic alternations of a single verb (or a single verb class), and extracts semantic information from syntactic behavior. For example, she points out that break verbs (verbs such as break, crack, rip, shatter, snap,...) all can appear in the middle alternation, but cannot appear in the conative or body-part ascension alternation, while cut verbs (verbs such as cut, hack, saw, scratch, slash,...) can appear in all three alternations [1993: 7]. After comparing these two verb groups with two others, touch and hit, (and their respective alternations) she concludes that break is a pure change of state verb, and cut is verb of causing a change of state by moving something into contact with the entitty that changes state' (p. 8). The syntactic differences they display, she argues, are a direct result of their semantic differences. However, there are two reasons we have not followed Levin in examining the relationship between a verb alternation and its associated semantics. First, although the work done by Levin [1993] in this area is impressive (determining 50 different types of alternations and over 125 different semantics classes of verbs), the sheer number of possible permutations of alternations makes analysis difficult. In addition, when comparing verbs of very different meanings, as in the cut and break example above, it becomes hard to determine the relevant area of semantic difference. For example, in order to reach the generalization concerning cut and break, Levin had to look at two other verbs (touch and hit) and their respective diathesis alternations, as well as look at other verbs that could fit into those alternations, in order to determine the relevant semantics for cut and break for that one particular alternation [cf. 1993, pp. 5-8]. If she had picked different verbs instead of touch and hit or different diathesis alternations from the three that she did, she might not have been able to come up with a generalization at all. These factors may be contributing to the fact that there is currently no unified theory of lexical knowledge based on verbs alternations because scope of the undertaking is so vast. Second, we, along with other scholars in our research group [Liu 1997] tried a pure-alternation based approach and found that it is not adequate for defining Mandarin verb classes. There are several possible reasons for this. The first is that diathesis alternations have not been extensively studied in Mandarin, unlike English, where as Levin notes, there were several important studies done on the verbs cut, hit, break and touch prior to her own work. The second reason has to do with the vastness of the enterprise as we mentioned above. How do you decide which verbs to compare? How do you decide which alternations are relevant? The third possibility is that Mandarin differs from English in such a way as to make alternations a non-viable option for prying into a verb's relevant semantics. Liu [1997] argues that that verb aRernations are not suitable for extracting semantic generalizations from syntactic behavior in Mandarin Chinese because argument placement is relatively flexible. If we agree,then, that syntactic behavior can shed light on the relevant semantics of a verb, and that (at least for Mandarin, if not for other languages as well) diathesis alternations, while originally promising, are not taking us where we want to go -- that is, towards a unified theory of lexical knowledge, what other type of behavior is available? We concentrate on delimiting the lexical semantic distinctions between near-synonym pairs that differ slightly in both their syntactic behavior and in their semantics. Sometimes a semantic difference is apparent at first glance as in the case offang4 (put) and bai3 (set), and sometimes it is not clear and only becomes apparent after we compare the syntactic differences, as in the case of /made and gaoxing 'happy'. (We will discuss both examples further in Section 5). However, even in the cases where there is a difference in meaning, what we are looking for is the relevant difference in both syntax and semantics -- that is, along what semantic lines do these two words differ, and how is this difference related to their synactic behavior (and vice versa)? How do we determine these synactic and semantic differences? The answer to this question is explained in much more detail in Tsai et al. [1998] and Liu et al. [1997] (both papers have revised version included in this volume as well). But we will give a very brief sketch in what follows. First, we examine these near synonym pairs by first combing the Academia Sinica corpus for all relevant examples of the words in questions. These examples are then categorized according to their syntactic function. Third, each instance is classified into its argument structure type. Fourth, the aspectual type associated with each verb is determined, and fifth, the sentential type for each verb is also determined. We often find that near synonyms have several cases of complementary distribution of synactic functions and it usually these cases, along with our other analyses that allow us to formulate a hypothesis concerning the relevant nature of the semantic difference. 3. ASSUMPTIONS We share the following assumptions with some of the recent work in lexical semantic theories. The first assumption is that lexical semantic contents are mapped to the morphosyntactic level and can be used to predict grammatical behaviors [e.g. Dowty 1991, Levin 1993, Goldberg 1996]. What is crucial behind this assumption is that a mapping must be rule-governed and regular by definition. Hence the assumption entails that lexical semantic generalizations are not only worthy of studying but can also be verified by their grammatical realizations. The second assumption is that lexical semantics is the (grammatical) level that mediates conceptual structures with grammatical representations [E.g. Bresnan and Kanerva 1988, Zaenan 1993, Pustejovsky 1995]. In other words, lexical semantics not only can be empirically verified with grammatical predictions but can also be justified by conceptual arguments. In fact, we will take the second assumption further and make it our premise that lexical semantic representation is the grammaticalization of conceptual information. Based on the above assumptions, we propose that an adequate theory of verbal semantics must have the three following properties:","i) that lexical semantic information is represented in a way that can be linked directly to grammatical structures. We assume that such a representation in verbal semantics must be based on event structure.","ii) that lexical semantic information must have conceptual motivation. This justifies the inclusion of such information as qualia structure in lexical semantics [Pustejovsky 1995].","iii) all lexical semantic attributes must be attested by representational clues: either collocating structure, selectional constraints, or distributional patterns. This last premise is especially important because it restricts the type of evidence that may be brought to bear on the question of whether something shares a particular attribute or not, and limits the possibility of ad-hoc explanations. That is, it strongly focuses analyses in verbal semantics on corpus-based approached, since representational clues are best extracted from corpora. In particular, in our work on lexical semantics we have concentrated on exploring the semantic and syntactic differences between near synonyms in the Sinica Corpus. We examined near synonyms in order to extract the contrasts that dictate their semantic and associated syntactic behaviors [Chief et al 1998, Huang et al. In Press, Liu et al. 1998, and Tsai et al. to appear]. Conceptually, each group of near synonyms that we study form a contrast set that is a constituent of a semantic field [Grandy 1992]. Our goal is to locate the linguistic relation that defines the contrast. In particular, we look for the semantic relation that can predict the difference in grammatical behaviors of the set. It is our strong hypothesis that syntactic variations, including Levin's [1993] alternations and morpho-sernantic variations, can be predicted by logical implicatures of the semantic attributes encoded on the event structure of each verb. 4. MODEL-ATTRIBUTE REPRESENTATION The Module-Attribute Representation of Verbal Semantics (MARVS) has two modules: an event module, and a role module. Event-internal attributes are attached to the event module and role-internal attributes are attached to the role module. Please note that event-internal attributes were called inherent attribute in earlier versions of this work since it is inherent to the event itself. The current name is adopted to underline the dichotomy between event and role modules. We change to sketch of the representation is given in Figure 1. Verb – Sense; – Eventive Information Event Modules \\tRole Modules Event-internal Attributes\\tRole-internal attributes","Figure 1 Module-Attribute Representation It is important to note that the eventive information is attached to the sense of a verb. Verbs with different senses will have different eventive information. [Ahrens et al. (1998) gives a working definition and criteria for distinguishing between senses of nouns.] The second important hypothesis of this proposal is that the event representation of a verb is the sum of all attested event realization of a particular the verb. In other words, it is possible that a complex lexical event representation is never fully instantiated; although each component is linguistically attested. This hypothesis is motivated by our desire to maintain the theoretical elegance of one-to-one mapping between verbal sense and event representations. It is also conceptually motivated by the fact that the same verb form is often used in natural languages to refer to different aspects of an extended event. For instance, the activity of 'sitting down' and the state of 'be sitting' share the same verb form. Similarly, in Chinese at least, the activity or 'putting on' and the state of 'wearing' some piece of clothing share the same verb form. Since they do have totally different (logical) event structures, previous theories may have to treat them as homophones. However, the conceptual tie is so salient that we feel it is counterintuitive to assign them to two different senses. We postulate that there will be conceptual/cognitive motivations to encode such complex event structures with one representation. Hence the contrastive event realization can be understood as the different (partial) realization of a same complex event under a particular event focus, and not as two senses. The third crucial premise in this representation is that the event modules constitute the basic frame of verbal semantics. By making the two way distinction between modules and attributes, we assume that modules refer to pre-packaged semantic information while the attached attributes underlines more detailed description. The two types of modules also represent the two basic atomic terms in formal semantics: event and individuals. However, individuals are understood in the context (i.e. events) where they participate. Figure 1 shows clearly that Role Modules are attached to the Event Modules. There are strong motivations for such representation: first, role modules represent the participants of the event, thus cannot stand outside of the event representation; second, the participating roles can be partially predicted by the event types; and finally we will discuss hierarchical constraints (Section 4.3). In what follows, we will first discuss event modules, and then the event-internal attributes that associated with the event modules (Section 4.1), and then we will discuss the role modules and the role-internal attributes that are associated with these modules (Section 4.2). 4.1 Event Modules A central issue in lexical semantics, especially verbal semantics, is the representation of events [e.g. Jackendoff 1983 and Pustejovsky 1991]. A tradition shared by philosophical and linguistic semantics, as well as the cognitive sciences, is that there are only two basic types of entities: events and individuals. Hence a language must conceptually describe both events and individuals. Individuals are prototypically denoted by the referential properties of nominals. And events are denoted by verbs. Thus an adequate theory of verbal semantics must include a theory of event structures. Of course all semantic theories must also account for type-shifting and semantic coercions, such as the telic and agentive structures in Pustejovsky's [1995] nominal semantics. In this section, we will concentrate on the basic building blocks of our verbal semantic theory. In particular, we will propose a theory where event structures can be composed from a small set of event modules and the backbone of verbal semantics is taken to be compositions of these event modules. This account is crucially different from the autonomous view of event structure [e.g. Vendler 1967], or the attribute-value view [Jackendoff 1983]. It shares some assumptions with Smith [1990], such as the viewpoint focus interpretation of aspectual facts. However, our modules and rules of combination are different. 4.1.1 An Inventory of Event Modules Event modules are the building blocks of linguistic event structures. They can also be defined as atomic logical event structures. We have listed five atomic event structures below, along with their symbol. A brief explanation follows each event structure. ( 1 ) •\\tBoundary (including a Complete Event) Boundary is an event module that can be identified with a temporal point, and that must be regarded as a whole. (2) /\\tPunctuality Punctuality is an event module that represents an single occurrence of an activity that cannot be measured by duration. (3) /1/1/\\tProcess Process is an event module that represents an activity Thai has a time course, i.e. chat can be measured in terms of its temporal duration. (4) \\t\\tState State is a homogeneous event module in which the concept of temporal duration is irrelevant; i.e. it is neither punctual nor has a time course.","(5) AAAAA\\t Stage Stage is an event module consisting of iterative sub-events. In sum, we postulate that these five atomic event structures are the only building blocks necessary to capture the range of complex linguistic event structure. 4.1.2 Tests for Event Modules Since event modules are logically and conceptually primary units, each event module has logical entailments that can be attested with their grammatical behavior and/or their interpretation. A partial list of their verifiable entailments follows.","First, only boundaries (including stand-alone complete events) can be identified with a temporal point,","such as in (6).","(6) Complete event vs. other event a. Sheme shihou V (le)","When\\tV ASP b. Sheme shihou kaihui (le)?","When\\tmeeting","Ẁhen does the meeting (start)?' c. *Sheme shihou dasuan (le)?","When\\tplan Second, since process encodes a time course, a durational phrase naturally measures the length of the time course, and can distinguish between process events and boundary/complete events, as (7) and (8) show.","(7) Process vs. Complete Boundary V le Duration V ASP Duration \\t","(8)a. (*yizhi si) si le\\tsan ge xiaoshi always die die ASP three CL hours (̀He's) been dead for three hours.' \\t","b. (yizhi pao) pao le\\tsan ge xiaoshi always run run ASP three CL hours (̀He has kept on) running for three hous.' Since complete and boundary events both have a delimiting temporal point (but contain no time course), the durational phrase can only be interpreted as the distance between reference point in time and that delimiting temporal time (the death time in 8a). On the other hand, the durational phrase will be interpreted as a time course of an process (8b). The contrast in interpretation can also be underlined by the continuous adjunct yilzhi2 'always, keep on V-ing', which cannot co-occur with complete/boundary events. 4.1.3 Typology of Lexical Event Representations In this section, we present three different types of event structures that are encoded on Chinese verbs: nucleus, simplex, and composite events. Note that we propose and follow the strong hypothesis that each sense of a verb form encodes a uniqe eventive information represenation. Hence each meaning realization can focus on different elements of that encoded event information but cannot refer to a different event representation. This is the One-Event-Representation-per-Sense hypothesis. Hence lexical event representations can be classified according to the complexity of their component event modules into three type: Nucleous, Simplex, and Composite event representation. 4.1.3.1 Nucleus Event Representation In this theory, event structure modules are the nucleus events that cannot be further divided. Our claim is that human linguistic representation of events does not necessarily correspond to these logical and atomic events. We assume that conceptual and cognitive motivations entail that certain event module combinations be perceived as a whole, and thus be mentally and linguistically represented by a single event structure with compositional modules. In other words, we are proposing a non-homomorphism between logical event structure and (human) linguistic event structure. We will be focussing our study on the linguistic event structures since they are conceptually more interesting. The verbs listed below in (9) have stand-alone event modules.","(9) a. Completion (achievement) • si3 'to die', po4\\t'to break' b. Punctuality / da3suan4 'to plan to'","c. Homogenous State \\t kuai4le4\\t'to be happy', pi2juan4\\t'to be tired' d. Process /////// zou3 'walk', pao3 'run' We haven't found any examples yet of the stage event module standing alone in a verb in Mandarin. However, our hypothesis is that this list of nucleus events will not grow past the five listed here for any language. 4.1.3.2 Simplex Event Representations Simplex events have one nucleus and may be bounded on either (or both) end(s). The verbs listed in (10) encode both a boundary and an associated non-instantaneous event.","(10) a. Inchoative Process •1/11/ xia4yu3 'to rain', kailhui4 'to convene a meeting'","b. Bounded process gai4\\t'to build'","c. Resultative da3si3\\t'to hit and kill'","d. Completive Punctuality chu4fal 'set forth', bi4ye\\t'graduate', Ii2kail\\t'go away'","e. Inchoative 5iate (Effect State) • gaolxing4\\t'to be glad'","f. Inchoative Stage ,AAAA","shang4shengl\\t'to rise'","g. Bounded Stage •AAAA•","diao 1 xie4 '(flowers) to wither' We think we have exhaused the combinations for boundary events with the list above for Mandarin Chinese. Other languages may have other combinations. 4.1.3.3 Composite Event Representations Composite events involve more than one nucleus event and may or may not be bounded. Two examples are given in (11). We expect this partial list of complex events to grow with further study for both Mandarin verbs and for verbs in other languages.","(1 1) a. Completive Resultative \\t zuo4 'to sit', tang3 t̀o lie [down]', baolwei2 \\t'to surround'","b. Dual Process-State chuan 1\\t'to wear',\\tdai\\t'to wear' Let's take a closer look at the verb z̀uo4'. In (12a) the focus is on punctuality, while in (12b) the focus is on state. In (12c) the focus is on the length/duration of state as delimited by the punctual event and a reference point. In (12d) the focus is on the manner of the state, with an implied (controllable) punctual event that could change the state.","(12) a. zuo SIT S̀it [down]!, Be seated!' b. ta zuo qianmian S/HE SIT FRONT S̀/He is seated in the front.' c. ta zuo le san ge zhongtou S/HE SIT ASP THREE CLASS HOUR S̀/He has been sitting for three hours.' d. haohao zuo SIT WELL 'Sit straight!' 4.1.4 Event-internal Attributes In our module-attribute representation, event-internal attributes are linked to the event structure modules (when necessary). Event-internal Attributes are attributes which refer to the semantics of the event itself, such as [control], [effect], etc. Example (13) for example, shows that the two verbs g̀aoxing' and 'kuaile' differ in terms of the attribute of control (see Tsai et al. in this volume for more details of this relationship).","(13) [control] bie gaoxing/*bie kuaile NEG happy/NEG happy 'Don't be happy.' 4.2 Role Modules Role modules contain the focussed roles of the event that typically include all required (i.e. thematic) arguments but can also include optional arguments and adjuncts. The roles that we have considered are the following: Agent, Cause, Causer, Comparison, Experiencer, Goal, Instrument, Incremental Theme, Location, Locus, Manner, Range, Recipient, Source, Target, Theme, etc. We will illustrate how this module works with an optional argument. In example (14a), the focus is on incremental theme and therefore the measure phrase describes the resulting number of wounds. However, in (14b) there is no such locus and therefore the measure attached to the cognate object describes the frequency of the activity.","(14)a. ta ba shoubi ge le shiji-dao yi shi juexin s/he BA arm GE-PERF ten-plus-knife so show resolution S̀/He cut more than ten wounds on his/her arm to show his/her resolution.' b. zai gin-di shen-shang kan le wu-shi-liu dao at love-foe body-top KAN-PERF 56 knife [̀The person] hacked 56 times on his/her rival in love affair.' 4.2.1 Role-Internal Attributes These attributes refer to the internal semantics of a particular focussed role (of the event), such as [sentience], [volition], [affectedness], [design], etc. In (15) we give an example of the role internal attribute of Loc[design], which is the only role internal attribute that can specified with orientation.","(15) Role Internal Attribute Loc [design] a. na ge taishiyi bai dongbian/zhao dong bai that CLS easy-chair set east-side/towards east set Tut that easychair so that it faces east.'","b. *na ge taishiyi fang dongbian/zhao dong fang that CLS easy-chair put east-side/towards east put Some readers might wonder what the difference is between role-internal attributes and the selectional restrictions on lexical items that previous versions of transformation theories postulated. Role internal attributes interact with (context-induced) meaning to determine the appropriate reading, while selectional restrictions are projected from a fixed lexical entry. Moreoever, selectional restrictions do not allow for alternate interpretations based on context. 4.3 Hierarchial Constraints All conditions being equal, a higher-level module (i.e. the event structure module) or attribute (i.e. event-internal attribute) is preferred for generality and greater explanatory power. For instance, [control] will be preferred over [volition] if both offer an equally adequate account, since [control] is an event-internal attribute belonging to the whole event; while [volition] is a role-internal attribute describing a participant of an event. If volition can be predicted by a [control] event-internal attribute (and it usually can), then there is no need to list volition again in the role-internal attribute. The [control] event-internal attribute will predict volition through the semantic relationship of implicature. If, however, a verb is hypothetically with the attribute [control], but has a non-volitional subject, then there is a place in the role-internal attribute to mark that fact and the usual event-internal implicative relationship between [control] and [volition] will be cancelled. In addition, when a set of near synonyms include a covering term of a field, then the grammatical contrast will be neutralized to a marked/unmarked situation. In this case, the lack of clear-cut contrasts does not affect the legitimacy of a defining relation. Another near synonym forming a contrast set should be substituted to verify the claim. For instance, not all predicted grammatical contrasts demonstrate themselves between gel 'to slice' and Biel 'to cut [covering term]'. But when gel is contrasted with ci4 t̀o stab', then the proposed contrasting relation of [effect] is clearly evident. 5. CONCLUSION In this paper we have set out the underpinnings of our new representation of lexical knowledge, known as the Module-Attribute Theory of Verbal Semantics (MARVS). This theory differs from previous attempts to understand lexical knowledge, especially the interaction of syntactic-semantic information in verbs, because it analyzes at near synonym pairs. It also differs in postulating Event Structure Modules, which may be combined to form a complex representations and attached to a verb. Event-internal Attributes of the event, such as [control] and [effect], are attached to the Event Structure Module. If a verb has more than one event structure, it also, by definition, has a different linguistic sense and therefore should demonstrate a slightly different grammatical encoding. In addition, we postulate Role Modules and Role-internal attibutes that may be associated with this module. The eventive information of a verb (cf. Figure 1) must minimally contain the Event Module, although it may contain both types of modules and both attributes. It is the goal of this volume to demonstrate how this theory allows us to succinctly and successfully predict the interaction between lexical semantic attributes and surface grammatical representations. AKNOWLEDGEMENT We appreciate very much colleagues at our corpus linguistics and lexical semantics working group for their input and discussion. They are Lili Chang, Keh-jiann Chen, Meichun Liu, and Mei-Chih Tsai, as well as all CKIPers. All of them have contributed substantially to the formulation of the MARVS representation. However, since the current authors are repsonsible for the current presentation and interpretation, any errors or mis-representations are our own responsibilities. In addition, we benefitted from comments from the audience when we presented several different version of this framework, especially at the miniconference at GreenBay in May, 1999. We would like to thank the following people specifically for their insightful comments: Beth Levin, Joan Bresnan, Chauncey Chu, Jim Tai, Shou-hsin Teng and Annie Zaenen. REFERENCES","[1] Ahrens, Kathleen, Li-Li Chang, Keh-jiann Chen, and Chu-Ren Huang. 1998. Meaning Representation and Meaning Instantiation for Chinese Nominals. Computational Linguistics and Chinese Language Processing. Vol.3.1.45-60.","[2] Ahrens, Kathleen, Chu-Ren Huang, and Mei-Chih Tsai. 1999. Eds. Working Papers on Chinese Verbal Semantics Vol. I. Nankang: Academia Sinica.","[3] Bresnan, Joan, and Jonni Kanerva. 1992. Locative Inversion in Chichewa: A Case Study of Factorization of Grammar. In T. Stowell and E. Wehrli Eds. Syntax and the Lexicon. Syntax and Semantics 26. Pp. 53-101. New York: Academic Press. Also in Linguistic Inquiry 20.1. (1988).","[4] Chang, Li-li, Keh-jiann Chen and Chu-Ren Huang. 1999. Alternation Across Semantic Fields: A Study of Mandarin Verbs of Emotion. Processings of the 13 th PACLIC. Pp. 39-50. Taipei. Also in Ahrens, Huang and Tsai Eds. (1999). Pp. 97-110.","[5] Chen, Keh-jiann, Chu-Ren Huang, Li-ping Chang, and Hui-Li Hsu. 1996. Sinica Corpus: Design Methodology for Balanced Corpora. In. B.-S. Park and J.B. Kim. Eds. Proceeding of the 11 th Pacific Asia Conference on Language, Information and Computation. 167-176. Seoul:Kyung Hee University.","[6] Chief, Lian-Cheng, Chu-Ren Huang, Keh-Jiann Chen, Mei-Chih Tsai, and Lili Chang. 1999. What Can Near Synomyms Tell Us. In this Volume. Also in Proceedings of the 1998 International Lexical-Functional Grammar Conference. Brisbane, Australia. Also in Ahrens, Huang and Tsai (1999). Pp. 73-84.","[7] Dowty, David. 1991. Thematic Proto-Roles and Argument Selection. Language. 67.3.547-619.","[8] Goldberg, Adele. 1995. Constructions: A Construction Grammar Approach to Argument Structure. Chicago: University of Chicago Press.","[9] Grandy, Richard E. 1992. Semantic Fields, Prototypes, and the Lexicon. In Lehrer and Kittay Eds. 1992. 103-122. Hillsdale: Lawrence Erlbaum.","[10] Huang, Chu-Ren. 1998. Classifying Event Structure Attributes: A Verbal Semantic Perspective from Chinese. Invited paper. Chinese Workshop. The 1998 International Lexical-Functional Grammar Conference. Brisbane, Australia.","[11] Huang, Chu-Ren, Li-Ping Chang, Kathleen Ahrens, and Chao-ran Chen. 1999. The Interaction of Lexical Semantics and Constructional Meanings. (In Chinese) In Y. Yin, I. Yang, and H. Chan Eds. Chinese Langauges and Linguistics V: Interactions in Language. Pp. 413-438. Taipei: Institute of Linguitics, Academia Sinica.","[12] Huang, Chu-Ren and Shen-Min Chang. 1996. Metaphor, Metaphorical Extension, and Grammaticalization: A Study of Mandarin Chinese -qilai. A. Goldberg. Ed. Conceptual Structure, Discourse, and Language. Stanford: CSLI, and Cambridge: Cambridge U. Press.","[13] Huang, Chu-Ren, Mei-chun Liu, and Mei-Chih Tsai. 1999. Lexical Semantics Vs. Selectional Restriction: A contrastive study based on verbs of building. To be presented at the 11th North American Conference on Chinese Linguistics. June 18-20, Harvard University.","[14] Huang, Chu-Ren, Mei-chun Liu, and Mei-chih Tsai. 1999. From Lexical Meaning to Even Structure Attributes: Across Semantic Classes of Mandarin Verbs. In Ahrens, Huang and Tsai (1999). Pp. 15-28.","[15] Huang, Chu-Ren and Mei-Chih Tsai. 1997. From Near Synonyms to Event Structure: Corpus-based Studies of Mandarin Verbal Semantics. Mini-Conference on Lexical Semantics. November. National Chung-cheng University.","[16] Jackendoff, Ray. 1990. Semantic Structures. Cambridge: MIT Press.","[17] Jackendoff, Ray. 1983. Semantics and Cognition. Cambridge: MIT Press.","[18] Lehrer, Adrienne and Eva Efder Kittay. 1992. Eds. Frames, Fields, and Contrasts: New Essays in Semantic and Lexical Organization. Hillsdale: Lawrence Erlbaum.","[19] Levin, Beth. 1993. English Verb Classes and Alternations: A Preliminary Investigation. Chicago: University of Chicago Press.","[20] Levin, Beth and Steven Pinker (Eds.) 1991. Lexical and Conceptual Semantics. A Cognition Special Issue. Cambridge: Blackwell.","[21] Liu, Meichun. 1997. Lexical Meaning and Discourse Patterning -the three Mandarin cases of 'build'. Paper presented at the Third Conference on Conceptual Structure, Discourse, and Language. Boulder, Colorado. To Appear in Conceptual Structure, Discourse and Language III. Stanford: CSLI.","[22] Liu, Meichun, Chu-Ren Huang, and Zhi-ling Chang. 1999. Locus-Locutum Alternation: a Lexical Semantic Study of Mandarin Verbs of Surface Contact. Presented at the 11th North American Conference on Chinese Linguistics. June 18-20, Harvard University.","[23] Liu, Meichun, Chu-Ren Huang, and Charles C.L. Lee. 1999. When Endpoint Meets Endpoint: A Corpus-based Semantic Study of Throwing Verbs. In Ahrens, Huang and Tsai (1999). Pp. 59-72.","[24] Liu, Meichun, Chu-Ren Huang, and Jia-Ying Lee. 1999. Semantic Representation of Verbal Information-A case from Mandarin Verbs of Judging. Presented at ROCLING XII. August 26-27. Hsinchu: National Jiaotung University.","[25] Liu, Meichun, Chu-Ren Huang, and Ching-Yi Li. 1999. Lexical Information and Beyond: Constructional Inference in Semanic Representation. In Ahrens, Huang and Tsai Eds. (1999). Pp. 85-96.","[26] Luo Yi-fen and Chu-Ren Huang. 1997. Hanyu Dongmaoci Zai yu Zhe de Cihui Yiyi [The Lexical Semantics of Mandarin Aspects 'Zai' and 'Zhe']. Proceedings of the Fifth International Conference on World Chinese Language Teaching. Taipei: World Chinese Association.","[27] Pustejovsky, James. 1995. The Generative Lexicon. Cambridge: MIT Press.","[28] Pustejovsky, James. 1991. The Syntax of Event Structure. In Levin and Pinker 1991. Pp. 47-80.","[29] Pustejovsky, James, S. Bergler, and P. Anick. 1993. Lexical Semantic Techniques for Corpus Analysis. Computational Linguistics. 19.2.331-358.","[30] Smith, Carlota. 1991. The Parameter of Aspect. Dodrecht: Kluwer.","[i 1] Tsai, Mei-Chill, Chu-Ren Huang, Keh-Jiann Chen, and Kathleen Ahrens. 1998. Towards a Representation of Verbal Semantics -- An approach based on near synonyms. Computational Linguistics and Chinese Language Processing. Vol.3.1.61-74.","[32] Tsai, Mei-Chih, Chu-Ren Huang, Keh-Jiann Chen. 1999. In Y. Yin, I. Yang, and H. Chan Eds. Chinese Langauges and Linguistics V: Interactions in Language. Pp. 439-460. Taipei: Institute of Linguitics, Academia Sinica.","[33] Vendler, Zeno. 1967. Linguistics in Philosophy. Ithaca: Cornell University Press.","[34] Wierzbicka, Anna. 1985. Lexicography and Conceptual Analysis. Ann Arbor: Karoma.","[35] Zaenen, Annie. 1993. Unaccusativity in Dutch: An Integrated Approach. In J. Pustejovsky Ed. Semantics and the Lexicon. 129-161. Dordrecht: Kluwer. -120-"]}]}