{"sections":[{"title":"ACCESSIBILITY AMONG SITUATIONS: PRAGMATICS OF DISJUNCTION IN JAPANESE","paragraphs":["Yasunari Harada","School of Law Waseda University","1-6-1 Nishi-waseda, Shinjuku-ku, Tokyo, 169-8050 JAPAN EmaiLharada@mn.waseda.ac.jp Kumiko Honda Center for Japanese Language","Waseda University","1-7-14 Nishi-Waseda, Shinjuku-ku, Tokyo, 169-8050 JAPAN Email: khonda@mn.waseda.ac.jp ABSTRACT Disjunctive expressions in Japanese coordinated with \"ka\" get either \"or\"-reading or \"and\"-reading depending on the situations in which the utterance takes place. This is comparable to some extent to the English counterparts with \"or\". In this paper, we will examine some cases where the same string of words gets different readings depending on the situations involved. We argue that the differences in interpretation emerge from the differences in accessibility among situations associated with the utterance. Pragmatically, our observation that a given disjunctive expression gets either \"or\"-reading or \"and\"-reading in a given situation reflects that only one of those readings can make the expression under consideration informative enough in that particular utterance situation. 1. INTRODUCTION The long-term goal behind our current study is to give an integrated account of how variables in formal languages and indeterminate expressions in natural languages should be treated in formal pragmatics. These expressions are typically used not in connection with particular entity or objects but to express quantification, query or co-variation among entities or objects within the domain of discourse. In Japanese, we have indeterminate expressions such as \"dare\" (who), \"dore\" (which one), \"doko\" (where) and \"dono\" (which)'. Combined with appropriate particles such as \"mo\" and \"ka\", these indeterminate expressions are used not only for question but also for quantification. It is interesting to note that these two particles are used also in coordination: \"mo\" for conjunctive coordination and \"ka\" for disjunctive coordination.' For disjunction with \"ka\", we observe that so-called \"or\"-reading and \"and\"-reading are available depending on the situations involved. Further, this disjunctive particle \"ka\" is also used as 'question marker'. Reflections upon these linguistic facts in Japanese will suggest how disjunction relates to existential quantification, question, and \"and\"-reading of conjunction. In this paper, we will mainly focus our attention on interpretation of disjunction with \"ka\", discussing how the differences between \"or\"-reading and \"and\"-reading emerge, touching upon existential and universal quantification and question. 1 In Japanese, expressions such as \"dare (who)\" ,\"dore (which one)\", \"doko (where)\" and \"dono (which)\" are categorized as \"do-\" pronoun/adverbial/adnominal within the traditional \"ko-so-a-do (this-that'-that2-which)\" paradigm. In this paper, we will call these expressions indeterminates'. 2 See Harada & Honda (1997a, 1997b, 1998, 1999a, 1999b, 1999c) and Harada, Honda & Noguchi (1999). 2. CONJUNCTION, DISJUNCTION, QUANTIFICATION AND QUESTION Before we start our discussion on disjunction, it may be worthwhile to see how coordination is expressed in Japanese. In Japanese, conjunctive coordination is expressed with conjunctive particle \"mo\" while disjunctive coordination is expressed with disjunctive particle \"ka\". These two particles, with indeterminate expressions such as \"dare\" (who), \"dore\" (which one), \"doko\" (where) and \"dono\" (which), are used to express existential quantification and universal quantification, respectively. Interestingly, disjunctive particle \"ka\" is also used as 'question marker'. 2.1. Conjunction, Disjunction and Quantification In Japanese, conjunctive coordination is expressed with the conjunctive particle \"mo\" while disjunctive coordination is expressed with the disjunctive particle \"ka\", as shown in (1):3","(1) a. Ken-mo\\tNaomi-mo\\tki-ta. Ken-MO Naomi-MO\\tcome-PAST \"Both Ken and Naomi came.\"","b. Ken-ka\\tNaomi-ka-ga\\tki-ta.4 Ken-KA\\tNaomi-KA-NOM come-PAST \"Either Ken or Naomi came.\" The two particles \"mo\" and \"Ica\" are used in quantification with indeterminate expressions as shown in (2):","(2) a. Dare-mo-ga\\tki-ta. who-MO-NOM\\tcome-PAST \"Everyone came.\"","b. Dare-ka-ga\\tki-ta. who-KA-NOM\\tcome-PAST \"Someone came.\" In sentences like (2a) and (2b), the sequence of \"indeterminate + mo\" expresses something like universal quantification while the sequence of \"indeterminate + ka\" expresses something like existential quantification. In these examples, \"mo\" functions as a conjunctive operator and \"ka\" as a disjunctive operator. In cases where indeterminate expression \"dare (who)\" is followed by \"mo\" as in (2a), the semantic representation of the whole sentence would be something like (3): (3) Came(e 1 ) Came(e2) . . . n Came(en) Here, we get an interpretation quite like that of universal quantification. Similarly, in cases where indeterminate expression \"dare (who)\" is followed by \"ka\" as shown in (2b), the semantic representation of the whole sentence would be something like (4): 3 In the example sentences that follow, we will use designations shown below: TOP: topic, NOM: nominative, ACC: accusative, ANP: adnominal particle, COP: copula, PAST: past, PRES: present/non-past, PASS: passive auxiliary verb, POL: polite auxiliary verb, NEG: negative auxiliary verb, IMP: imperative, and STAT: state. 4 In conjunctive coordination (I a), both occurrences of \"mo\" are obligatory, whereas in disjunctive coordination (lb), the first \"ka\" is obligatory while the second \"ka\" is optional when these follow noun phrases. The distribution of case marking and other particles in relation to these two particles is a complicated issue that we cannot begin to go into in this paper. (4) Came(e l) V Came(e2) V . . . V Came(en) In this case, we get an interpretation quite like that of existential quantification. 2.2. Conjunction, Disjunction and Partitioning The two conjuncts in (la) and the two disjuncts in (1b) have something in common. If the domain of discourse is the set consisting of Ken and Naomi, then the referents of the two conjuncts in (la) and those of the two disjuncts in (lb) comprise the whole set. The conjunctive particle \"mo\", in this sense, is inherently additive in nature and introduces an alternative entity (or proposition) which is added to the preexisting set. Actually, the most typical use of \"mo\" can be found in (5), where \"mo\" is simply additive. (5) Naomi-mo\\tki-ta. \\t Naomi-MO\\tcome-PAST \"Naomi came, too.\" Here, a proposition to the effect that Naomi came is added to the preexisting set of propositions. These propositions would have a general form of \"x came\", where x ranges over a set of entities that share the invariant property that x came and this original set does not include Naomi as its element. This additive nature of \"mo\" extends to the cases of conjunctive coordination as shown in (la) and the case of universal quantification in (2a). While the conjunctive particle \"mo\" is additive, the disjunctive particle \"ka\" is partitioning in nature. When union of two sets P and Q is R and join of P and Q is empty, R is said to be partitioned into P and Q. (See Figure 1 for definition and graphic illustration.) Partitioning is closely related to conjunction and disjunction as can be seen from the following two sentences: (6) a. Katsu-mo makeru-mo\\ttoki-no\\tun-da. \\t win-MO\\tlose-MO\\ttime-ANP chance-c OP-PRES \"Both victory and defeat depend on chance.\" \\t b. Katsu-ka\\tmakeru-ka-wa toki-no\\tun-da. \\t win-KA\\tlose-KA-TOP time-ANP chance- COP-PRES \"Victory or defeat depends on chance.\" The two sentences in (6) are idiomatic expressions in Japanese, used to say that victory is a matter of chance. In (6a) and (6b), \"katsu (to win)\" corresponds to P, and \"makeru (to be defeated)\" to Q. P and Q comprise R, the outcome of the game, the battle, or whatever. In conjunctive expression (6a), P and Q may not be exclusive. The intended meaning of (6a) would be that both victory and defeat depend on chance. In disjunctive expression (6b), however, P and Q are mutually exclusive. The intended meaning of (6b) would be that the outcome of the game (or whatever) is either victory or defeat and the outcome depends on chance. In (6a), we may be talking about generalizations that hold among games and their outcomes, but in (6b) we are more likely talking about a particular game at hand, although this may also be used in reference to generalizations about the outcomes of games! 5 See Harada & Honda (1997b), for discussion on generalization in coordination. 2.3 Partitioning and Question Another partitioning use of \"ka\" is found in embedded questions as shown in (7):6 \\t","(7) a. Ken-ga\\tki-ta-ka\\t Naomi-ga\\tki-ta-ka\\twakara-nai. Ken-NOM come-PAST-KA\\tNaomi-NOM come-PAST-KA","\\t know-NEG-PRES \"I don't know whether Ken came or Naomi came.\" b. Ken-ga\\tki-ta-ka\\tko-nakat-ta-ka\\twakara-nai. Ken-NOM come-PAST-KA\\tcome-NEG-PAST-KA","\\t know-NEG-PRES \"I don't know whether Ken came or he did not come.\" c. Ken-ga\\tki-ta-ka\\tdou-ka\\twakara-nai.","Ken-NOM come-PAST-KA\\thow-KA\\t know-NEG-PRES \"I don't know whether Ken came or not.\" Here are three variations of embedded questions in which we can see partitioning into two propositions. In (7b) and (7c), the whole set of possible situations regarding Ken's coming is partitioned into two, one in which Ken came and the other in which Ken did not come, with different polarity assigned to the truth of Ken's coming. Similarly, in (7a), the whole set of possible situations regarding someone's coming is partitioned into two, one in which Ken came and the other in which Naomi came. The domain of discourse here is the set consisting of Ken and Naomi. An embedded question is not a query directed toward the addressee. On the other hand, in the case of questions, as shown in (8), a sense of query is directed to the addressee: \\t","(8) a. Ken-ga\\tki-mashi-ta-ka,\\tNaomi-ga\\tki-mashi-ta-ka? Ken-NOM come-POL-PAST-KA Naomi-NOM come-POL-PAST-KA \"Did Ken come or did Naomi come?\"","b. Ken-ga\\tki-mashi-ta-ka,\\tki-mase-n-deshi-ta-ka? Ken-NOM come-POL-PAST-KA come-POL-NEG-PAST-KA \"Did Ken come or did he not come?\"","c. Ken-ga\\tki-mashi-ta-ka? Ken-NOM come-POL-PAST-KA \"Did Ken come?\" In (8a) and (8b), we clearly see partitioning of relevant situations. The example in (8c) is a straightforward question: \"Is it the case that Ken came?\" As an utterance, question has indeterminacy. There might be many ways in which indeterminacy is involved in a question in natural languages. For example, in Japanese, (i) we can insert indeterminate expressions in the proposition, (ii) we can use disjunction to express indeterminacy of the truth of propositions as shown in (8a) and (8b), and (iii) we can use the disjunctive particle \"ka\" as sentence-final question marker to express indeterminacy of the truth of P, as shown in (8c). Thus, we assume that question is essentially partitioning, which is expressed as disjunction in Japanese. 6 We assume that question marker \"ka\" and disjunctive particle \"ka\" are not only homophonous but that these two are the same lexical item. In question, \"ka\" functions only as a disjunctive operator. With respect to \"ka\" in question, Dr. Mitsu OKADA has expressed a similar idea. (Talk at Tokyo University in 3. INDETERMINACY IN DISJUNCTION Disjunctive coordination with \"ka\" obtains either \"or\"-reading or \"and\"-reading, depending on the situation in which the utterance takes place. In this section, we will discuss indeterminacy expressed in disjunction. First, consider the following situation. You are sure that you bought a certain imported science fiction paperback recently but you are not sure whether you bought it at Kinokuniya Bookstore or Maruzen Bookstore. (Let's suppose that these happen to be the only bookstores that carry imported science fiction paperbacks in Tokyo that you frequent.) In such a situation, the following sentence may be uttered felicitously and the disjunction gets \"or\"-reading:","(9) Kono-hon-wa\\tKinokuniya-ka\\tMaruzen-de\\tkat-ta. this-book-TOP\\tKinokuniya-KA\\tMaruzen-at\\tbuy-PAST \"I bought this book either at Kinokuniya or at Maruzen.\" We find some interesting features here. Sentence (9), under the situation just described, is indicative and there is no genericity or generalization over book buying events. We notice indeterminacy as to the bookstores associated with the two disjuncts. With this, we also get the following indeterminacy.","(10) (i)\\tTruth of P„ I bought this book at Kinokuniya, is indeterminate. (ii) Truth of Q', I bought this book at Maruzen, is indeterminate. In contrast, in a situation where one of your friends wants to buy a copy of the same book that you have, you might want to give a suggestion in (11) if you know that copies are available both at Kinokuniya and at Maruzen. In this case, however, disjunction gets \"and\"-reading.","(11) Kono-hon-wa\\tKinokuniya-ka\\tMaruzen-de\\tkaeru. this-book-TOP\\tKinokuniya-KA\\tMaruzen-at\\tcan-buy-PRES \"You can buy this book at Kinokuniya or Maruzen.\" Contrary to (9), sentence (11) has genericity or generalization over book buying possibilities or over different copies of the same book. There is indeterminacy as to the identity of the copy of the book, but not as to the truths of the propositions in (12).","(12) (i)\\tProposition P2, you can buy a copy of this book at Kinokuniya, is true. (ii) Proposition Q2, you can buy a copy of this book at Maruzen, is true. In (12), P2 and Q2 hold at the same time, and for that reason, (11) is interpreted as \"and\"-reading disjunction. Of course, this sentence does not make any specific reference to the actual buying of the book by the addressee in the situation just described. Focusing on indeterminacy of the truths of the propositions associated with the disjuncts, we can summarize as follows. In an indicative statement which refers to one particular actual event that took place in the real world, we find indeterminacy of the truths of related propositions and disjunction gets \"or\"-reading. On the other hand, in a non-indicative statement such as a generic statement, we find determinacy of the truths of related propositions and disjunction gets \"and\"-reading. Note, however, that there are alternative readings available for the same strings of words in (9) and in (11), given appropriate contexts. In a situation where you are talking about retrospective potential that you may have bought a copy of the book at some bookstore, sentence (9) may get \"and\"-reading. A simple past form \"ta\" allows such reading in Japanese, and in this 1995 and also personal communication at Linear Logic Workshop held at Keio University in 1999) Passport Control Area","West Gate\\tEast Gate 411110n••n•nnn••• 4110•nnnnn V Arrival Lobby","Figure 2 Exits from the passport control area to the arrival lobby case, since the disjuncts make reference to convictions and not the actual events, the two seemingly exclusive retrospective potential could be non-exclusive. On the other hand, in a situation where you know that one copy of the book was imported but you are not sure which of the two bookstores may have obtained the copy, sentence (11) may get \"or\"-reading, because the two disjuncts are mutually exclusive. 4. ACCESSIBILITY AMONG SITUATIONS IN DISJUNCTION In this section, we will make some case studies on disjunction, relating to 'accessibility' among situations. Let us consider the following case. You are a member of a group tour organized by a travel agency. Now you are at the passport control area in the airport, moving on to the arrival lobby after having your luggage checked. The airport has two gates leading from the passport control area to the arrival lobby, the west gate and the east gate, as shown in Figure 2. All the passengers can move from the passport control area to the arrival lobby through either the west gate or the east gate. Now, your tour guide has told you the following: (13) Nishi-gate-ka","\\t higashi-gate-kara\\ttouchaku-lobby-ni\\t","de-rare-masu. west-gate-KA \\teast-gate-from\\tarrival-lobby-to\\tget-out-can-POL-PRES \"You can get to the arrival lobby through the west gate or the east gate.\" Here, your tour guide has not told you which gate you should get through, but rather simply that you can get either through the west gate or through the east gate. Let us consider what is involved in a proper interpretation of the sentence in (13).","(14) (i)\\tIt is possible for passenger, to get through the west gate. (ii) It is possible for passenger, to get through the east gate. (iii) It is possible for passenger, to choose whichever gate he/she likes, the west gate or the east gate,","in order to get to the arrival lobby. (iv) It is necessary for passenger, to choose one from among the west gate and the east gate in order","to actualize the event of getting to the arrival lobby. Here, (i) corresponds to one part of disjuncts in (13), and (ii) to another part of disjuncts. (iii) follows from (i) and (ii). In order for passenger, to actualize the event of getting to the arrival lobby, (iv) is required.' The case in which both the event of getting through the west gate and the event of getting through the east gate are actualized at the same time is left out of consideration here. However, two situations represented in disjunction can be actualized at the same time in the following example:","(a) Oubosha-wa ku-nai-ni\\tzaijuu-suru\\tmono-ka applicant-TOP inside-city live\\tperson-KA","ku-nai-ni\\tkinmu-saki-wo\\tyuu-suru\\tmono-ni\\tkagi-rareru.","inside-city office-ACC\\thave\\tperson-to\\tlimit-PASS-PRES \"Applicants are limited to people who lives in this city or to people who works in this city.\" This is an advertisement for tenants of community housing. Here, the disjuncts specify conditions that valid applicants must satisfy. In such a case, one particular applicant might satisfy both conditions.","mom. +1• n","•• +mum R"]},{"title":"Q\\t","paragraphs":["41110nnn•nn• 41111101 n","1•11111"]},{"title":"V","paragraphs":["Figure 3 Accessibility from R to P and Q --• West Gate M M M East Gate M2 V m4","Figure 4 Members of the tour at the arrival lobby (1) West Gate","\\t East Gate"]},{"title":"•\\t","paragraphs":["mi m2 m m4 m5","Figure 5 Members of the tour at the arrival lobby (2) Figure 3 shows accessibility from situation R to situation P and situation Q, relevant in assessing the utterance in (13). R represents the situation in which passenger, is in the passport control area. P and Q represents situations in which passenger, after having his/her luggage checked, is going to get through the west gate and the east gate, respectively. In R, P and Q, 0( represents the prospective potential of going through the west gate, and \\ the prospective potential of going through the east gate. We can see conjunctive prospective potentials in R in Figure 3. It represents that each passenger can get through the west gate and that he/she can also get through the east gate. R has these two prospective potentials, therefore P with west-gate-prospective-potential is accessible from R, and Q with east-gate-prospective-potential is accessible from R, too. Let us consider a case in which your tour guide has told you the following, in succession to (13): \\t (15) (Nishi-gate-ka\\thigashi-gate-wo) de-ta\\ttokoro-de mat-te-i-te kudasai. V \\t west-gate-KA\\teast-gate-ACC\\tleave-PAST place-at \\twait-STAT POL-IMP \"Please wait (for my coming) outside (the west gate or the east gate).\" Here again, the tour guide has not instructed which particular gate to get through, but has offered instruction that you can get through whichever gate you like. Let us see some of the possible results of this instruction. Figure 4 shows a case in which there were five members in the tour group, and three of them have passed through the west gate and two of them the east gate. The members of the tour are distributed into two groups; the group who passed through the west gate and the group who passed through the east gate. There may be a case in which all the members of the group happened to pass through the same gate, as shown in Figure 5. In this case, also, they have followed the instruction of their tour guide. They have access both to the west gate and to the east gate at the time of the instruction, and each has chosen the one gate that they liked. As shown in Figure 4 and Figure 5, the West Gate V G, East Gate \\t"]},{"title":"•","paragraphs":["Figure 6 A guest at the arrival lobby","West Gate East Gate 4--- mi m2 m m4 m5"]},{"title":"s$t I","paragraphs":["Figure 7 Members of the tour at the arrival lobby (3) utterance in (15) is informative in both of these two cases. Let us consider a different situation in which the tour group is a singleton set. One guest has arrived at this airport, and he/she has received the following message in advance: (16) Nishi-gate-ka","\\t higashi-gate-kara \\ttouchaku-lobby-ni\\tde-rare-masu. \\t west-gate-KA","\\t east-gate-from \\tarrival-lobby-to\\tgo-out-can-POL-PRES","\\t(Nishi-gate-ka\\t higashi-gate-wo) de-ta\\ttokoro-de mat-te-i-te kudasai. \\t west-gate-KA","\\t east-gate-ACC","\\t leave-PAST place-at","\\t wait-STAT POL-IMP \"You can get to the arrival lobby through the west gate or the east gate. Please wait (for my coming) outside (the west gate or the east gate).\" This is the same utterance as (13) and (15), and disjunction in this message obtains the same \"and\"-reading as in (13) and (15), though this is the case in which the addressee is a single person. The result of the event is shown in Figure 6. Of course, for a particular guest„ he/she cannot get through the west gate and through the east gate at the same time. However, if the intention of the utterance in (16) is to offer accessibility from R to P and Q as shown in Figure 3, then disjunction in (16) is informative as \"and\"- reading disjunction. Now, let us consider a different situation. The airport is under renovation work right now. Your tour guide has access to the following piece of information; the west gate and the east gate are alternately closed down during reconstruction. In this situation, he/she may have told you the following: (17) Nishi-gate-ka","\\t higashi-gate-kara \\ttouchaku-lobby-ni","\\t de-rare-masu. \\t west-gate-KA \\teast-gate-from \\tarrival-lobby-to \\tgo-out-can-POL-PRES","\\t(Nishi-gate-ka\\t higashi-gate-wo) de-ta\\ttokoro-de mat-te-i-te kudasai. \\t west-gate-KA \\teast-gate-ACC","\\t leave-PAST place-at\\twait-STAT POL-IMP \"You can get to the arrival lobby through the west gate or the east gate. Please wait (for my coming) outside (the west gate or the east gate).\" Here again, (17) is the same string of words as (16), which in turn is the same as (13) followed by (15). In (13), (15) and (16), the utterances are interpreted as \"and\"-reading disjunction, but the same string of words in (17) should be interpreted as \"or\"-reading disjunction. Members of the tour are waiting at the arrival lobby, as shown in Figure 7. Of course, they have followed their tour guide's instruction, but in this case, only the east gate is open, and they have passed through the only gate which they can get through. Then, disjunction in (17) obtains \"or\"-reading. Now let us consider what's involved in the proper interpretation of the first sentence in (17).","41.111","nn 1111 n 0111MMIIIIIM."]},{"title":"V","paragraphs":["V"]},{"title":"PI\\t","paragraphs":["410n .... n","• R1\\tR2R","Figure 8 Accessibility from R, to P, and R2 to Q","(18) (i)\\tPossibility for passenger, to get through the west gate is indeterminate. (ii) Possibility for passenger, to get through the east gate is indeterminate. (iii) Possibility for passenger, to get through either the west gate or the east gate is determinate. (iv) There is no choice for passenger, to make between the west gate and the east gate in actualizing","the event of getting to the arrival lobby, because only one is open at any given time. Here, (i) corresponds to one part of two disjuncts in the first sentence in (17), and (ii) to another part of disjuncts in that sentence. Along with (i) and (iii) and (vi) hold under the circumstances just described. Thus the tour guide knows that only one of the two gates is currently available, but not which one at a given moment. The two disjuncts in the first sentence in (17) have indeterminacy and this disjunction obtains \"or\"-reading. Figure 8 shows accessibility from situation R to situation P and situation Q, in \"or\"-reading disjunction. Here, R is partitioned into R1 with west-gate-prospective-potential and R2 with east-gate-prospective-potential. P with west-gate-prospective-potential is accessible only from R 1 , and Q with east-gate-prospective-potential is accessible only from R2 . Thus, the two disjunctive situations in R, namely R, and R2, corresponds to indeterminacy of possibilities that are associated with the two situations shown in (18) above. In other words, use of disjunction with \"ka\" which expresses indeterminacy among two potentials is quite informative in such a situation, because this indeterminacy relates directly to the following course of events. 5. DISJUNCTION AND DISTRIBUTION As we discussed in section 4, when utterances make reference to potential rather than actual events, the differences between \"and\"-reading disjunction and \"or\"-reading disjunction emerge as differences in accessibility among related situations. When utterances refer to results of events in the real world, the differences between \"and\"-reading disjunction and \"or\"-reading disjunction emerge as quantification over P1","simume","©n","O 4110•••","n P2 West Gate\\tEast Gate V","1\\tP3\\t","Q1 Q2 Figure 9 Distribution into { P and { Q } • \\t • R Figure 10 Accessibility from R to P and Q V P",".","nn","• 1110 nnn","• multiplicity of events. Generalizations over multiplicity of events sometimes result in what we might want to call 'distribution' here. Let us then consider the following situation. This airport has three gates from the passport control area to the arrival lobby, the west gate, the east gate and the north gate. Here is a marketing researcher who is surveying behavioral patterns of passengers in this airport. After conducting a satisfactory survey, he/she summarizes his/her findings as the following sentence in the report: \\t (19) Touchaku-bin-no","\\t kyaku-no\\t92%-wa \\t arrival-flight-ANP \\tpassenger-ANP\\t92%-TOP nishi-gate-ka higashi-gate-wo toot-te \\ttouchaku-lobby-ni\\tde-te-ki-ta. west-gate-KA east-gate-ACC\\tpass-through arrival-lobby-to\\tcome-up-PAST \"92% of the passengers came up to the arrival lobby, passing through the west gate or the east gate.\" In this situation, the case in which the utterance in (19) is true is limited in cases where the union of the set of passengers who passed through the west gate and the set of passengers who passed through the east gate accounts for certain percentages of the set of the entire passengers. In cases where the whole set of passengers passed through either the west gate or the east gate, this sentence would not be felicitous.' In other words, disjunction in (19) shows distribution into the set of passengers from the west gate and the set of those from the east gate. 8 Disjunction in (19) is not informative in a case where either one of the two sets { P } and { Q} is formed as the result. In this case, an appropriate utterance would be something like \"92% of the passengers got to the arrival lobby, passing through the west gate.\" Figure 9 shows a case of distribution of the results of passengers going through the gates. Here, j under the human figures outside the gates is intended to show that a given passenger has just passed through the west gate, and \\shows that he/she has just passed through the east gate. The upper half of Figure 9 shows that in the situation under consideration, for each passing event, only one gate can be used. The lower half of Figure 9 is intended to show that at the time when all the passengers have passed through the gate, the resulting distribution is partitioned into those who have passed through the west gate and those who have passed through the east gate. Thus, disjunction in (19) gets \"and\"-reading. 9 The utterance in (19) does not assume any modality, in the sense that the sentence refers to simple factual event in the past. However, in order to understand the following kind of situations, we need to assume something we might want to call \"retrospective potential\", counterpart of prospective potential as discussed in section 4. Suppose that you know that this airport has three gates, the west gate, the east gate and the north gate, and that the north gate alone is located far from here, making it inconvenient. Now, you are watching passengers at the arrival lobby, wondering which gate each of these passengers passed through. Passengers does not cluster to one gate, so you will make an inference like the following:","(20) Nishi-gate-ka\\thigashi-gate-kara\\tde-te-ki-ta-no-darou. west-gate-KA\\teast-gate-from\\tcome-up-PAST-should-PRES \"I suppose that they have got here from the west gate or the east gate.\" In this case, disjunction gets \"and\"-reading, but we notice retrospective potential rather than factivity. Figure 10 represents this retrospective potential from the time of the utterance to the time when each event had taken place. Here, \\ represents west-gate-retrospective-potential of having passed through the west gate, and east-gate-retrospective-potential of having passed through the east gate, respectively. The situation R has conjunctive potentials, west-gate-retrospective-potential and east-gate-retrospective-potential. Therefore, the situation P with west-gate-potential is accessible from R, while the situation Q with east-gate-potential is accessible from R, too. Thus, pragmatically, that certain expression with disjunction obtains either \"or\"-reading or \"and\"-reading in a given situation reflects that only one of those readings can make the expression under consideration informative enough in that situation. 6. CONCLUSION In this paper, we saw that in Japanese, indeterminate expressions are used for question and quantification when combined with particles such as \"1w\" and \"mo\". The two particles are used also in coordination: \"ka\" for disjunctive coordination and \"mo\" for conjunctive coordination. For disjunction with \"ka\", we observed that so-called \"or\"-reading and \"and\"-reading are available depending on the situations involved. 9 In the case in which the passenger is a singleton set, disjunction gets \"or\"-reading:","(b)\\tSono\\tkyaku-wa\\tnishi-gate-ka\\thigashi-gate-kara\\tde-te-ki-ta. that\\tpassenger-TOP\\twest-gate-KA\\teast-gate-from\\tcome-up-PAST \"That passenger came up through the west gate or the east gate.\" Here, if \"sono kyaku (that passenger)\" refers to a particular passenger and not a particular group of passengers, then the action that he/she took is singular. Therefore, this disjunction gets \"or\"-reading. That certain expression with disjunction obtains either \"or\"-reading or \"and\"-reading depending on its situation reflects that \"or\"-reading or \"and\"-reading is not determined solely by the utterance. 7. REFERENCES [1] Carlson, G.N. and Pelletier, F.J. (eds.), 1995, The Generic Book, The University of Chicago Press. [2] Gamut, L. T. F., 1991, Logic, Language and Meaning, The University of Chicago Press. [3] Gawron, J. M., 1999, \"Universal Concessive Conditionals and Alternative NPs in English,\" ms. [4] Grice, H. P., 1975, \"Logic and Conversation,\" in P. Cole & J. L. Morgan (eds.) Syntax and Semantics,","vol. 3: Speech Acts, pp.41-58, Academic Press. [5] Harada, Y. and Honda, K., 1997a, \"Disjunction, Conjunction and Quantification,\" ms. [6] Harada, Y. and Honda, K., 1997b, \"Quantification without Quantifier: A Note on Universal","Quantification with MO in Japanese,\" ILT Bulletin, 52, pp.35-56, Waseda University. [7] Harada, Y. and Honda, K., 1998, \"Quantification in Japanese II: Universal and Existential","Quantification with DE-MO,\" ILT Bulletin, 53, pp.1-42, Waseda University. [8] Harada, Y. and Honda, K., 1999a, \"Scales of Likelihood: Quantification and Indefinites in Natural","Language,\" a paper presented at Linear Logic Workshop, Keio University. [9] Harada, Y. and Honda, K., 1999b, \"Quantification in Japanese III: Scalar Implicature in Universal","Quantification with DE-MO,\" ILT Bulletin, 54, pp.37-69, Waseda University. [10] Harada, Y. and Honda, K., 1999c, \"How Quantification Emerges in Natural Languages,\" Proceedings","of the Joint Conference of the 2nd International Conference on Cognitive Science and the 16th Annual","Meeting of the Japanese Cognitive Science Society, pp.424-429. [11] Harada, Y. and Honda, K., in printing, \"Quantification in Japanese IV: Disjunction and Quantification,\"","ILT Bulletin, 55, pp.37-53, Waseda University. [12] Harada, Y. and Honda, K., forthcoming, \"Pragmatics of Disjunction in Japanese\". [13] Harada, Y., Honda, K., and Noguchi, N., 1999, \"Scalar Implicature with mo,\" Proceedings of the 5th","Annual Meeting of the Association for Natural Language Processing, pp.321-324. [14] Harada, Y. and Noguchi, N., 1992, \"On the Semantics and Pragmatics of dake (and only),\" in C. Barker","& D. Dowty (eds.), Proceedings of the Second Conference on Semantics and Linguistic Theory, pp.125-","145, Ohio State University Press. [15] Kamp, H. and Reyle, U., 1993, From Discourse to Logic, Kluwer Academic Publishers. [16] Kay, P., 1991, \"Even,\" Linguistics and Philosophy, 16, pp-589-611. [17] Partee, B. H., Meulen, A. and Wall, R. E., 1993, Mathematical Methods in Linguistics, Kluwer","Academic Publishers."]}]}