{"sections":[{"title":"A MOVE TOWARDS A GENERAL SEMANTIC THEORY","paragraphs":["Yasuo Nakayama Faculty of Human Sciences","Osaka University 1-2 Yamada-oka, Suita-shi, Osaka, 565-0871 JAPAN Email: nakayama@hus.osaka-u.ac.jp ABSTRACT In this paper, I would like to propose an idea of semantics for discourse and pictorial representations. The central notion of this paper is function. A representation is a representation of something. A function determines the connection between representation and what is represented. This is true for both discourse and pictorial representations. To properly interpret a representation system means to find an intended function that connects representation and what is represented. By combining different semantic functions, we can express complex semantic relations. In the first part of this paper, I will present a general semantic theory; in the second part, this theory will be applied to several examples. 1. THEORY 1.1. Standard semantics A standard semantics gives the meaning of a sentence by giving its truth condition. I modify the standard definition of interpretation slightly. (1) Definition of interpretation function a) If c is a term, then 1(c) is an element of a universe U, i.e. I(c)E U. b) If. R is a n-place relation symbol, then 1(R) is a n-place relation based on U, i.e. I(R) c Ux...xU. c) An interpretation function I* is a x-variant of 1 iff (if and only if) I* is at most different from","in the interpretation of x. d) 1(R(c l ,\\tca)) = truth if (1(c1 ),\\t1(cn)) E 1(R). e) = truth iff 1(p) = falsity.","l(p A q) = truth iff 1(p) = truth and 1(q) = truth. g) 1(3x p(x)) = truth iff there is a x-variant I* of 1 such that I*(p(x)) = truth. An interpretation function I for a first order language L is a function that satisfies the above conditions. It is a function that correlates well-formed expressions in L with objects generated from U. 1.2. Discourse representation theory (DRT) DRT organizes a discourse not as a sequence of sentences but as a structure (cf. [3]). In DRT, a new piece of information is continuously integrated into the given discourse structure. To make DRT more flexible, I define a DRT function fin a similar way as in section 1.1. (2) Definition of DRT-function a) A discourse representation structure (DRS) is a pair that consists of a set V of variables and a set C","of conditions. b) A DRT-function f is a function that correlates well-formed expressions with objects generated from a","universe U. c) f verifies R(c 1 ,\\tcn) if ftc 1 ),\\tf(cn)) E f(R). d)f verifies K1\\tK2 if for every f s extension g that verifies K1 , there is g's extension h that","verifies K2. e) f verifies a DRS K if f verifies all conditions in K. A DRT-function determines extensions of all primitive symbols. This is the crucial difference to the classical definition; in the classical definition, a structure of a world is presupposed and only variables are interpreted by an assignment. A DRT-function determines not only values of variables but also a structure of a world. 1.3. A semantic theory for pictorial representations A pictorial representation visually describes a world. Nakayama characterizes semantics of pictorial representations by using projective functions (cf. [9]). A projective function is a function that expresses information described in a pictorial representation. An interpretation of a pictorial representation A for B is explicated as an injection from parts of A into parts of B, where it preserves the part-whole relation. This injection is called a projective function. This theory by [9] is based on a mereological theory called Natural Representation Language (NRL) that is proposed by [8]. Usual maps and sketches also contain symbolic expressions that can be easily interpreted. Interpretations of symbols are considered as constraints on proper projective functions that are intended as correct readings. [9] defines several constraints on projective functions such as standard-name, standard-attribution, 11n-contraction, proportion-preserving, [r%]-fuzzy-proportion, and so on. As a semantic theory for maps, Pratt's proposal is well known. He attempts to define semantics for maps under the influence of traditional truth conditional semantics (cf. [10]). However, it is odd to speak of the truth of maps. Normally, we ask only whether a map is appropriate for a certain use. There are also different methods for the projection of the reality. The answer for the question, which projection should be used for a map, depends on its intended use. Exact projection is not always needed and in some cases not desirable, because readability is sometimes more preferable than exactness (cf. [1]). For pictorial representations, it is crucial to know what kind of projective functions are connected with them. 1.4. Fundamental operations So far, we have discussed how to express semantic information by a function. Now, we would like to consider the problem how to combine different information. Combination of semantic information can be expressed by combining semantic functions. As fundamental operators, I propose unification and composition; extension can be defined as certain unification. (3) Let f and g be functions. a) h is a unification off and g if h = fug and h is a function. The unification off and g is denoted","by [fug]. b) h is a composition off and g if h = {(x,\\t: y = g(f(x))). The composition of f and g is denoted","by [g*J]. c) f is an extension of g if f is the unification of fand g, i.e. f = [fJg]. gcf expresses that f is an","extension of g. We can combine these operations and build a new function such as [ fu[g*I]]u[g*k], where these functions might be projective functions or DRT-functions. By using these operators, we can combine verbal and visual information and interpret them uniformly by using a combined function. In the following applications, a single sentence is sometimes interpreted by different interpretation functions. For example, interpretations of figurative expressions and counterfactuals often require a flexible combination of different interpretations. 2. APPLICATIONS 2.1. Presuppositions and anchors in DRT Suppose that a DRS K1 presupposes the content of K0. Let f and g be intended DRT-functions for Ko and K1 . Then, the desired DRT-function h can be constructed as the unification of both functions, i.e. h = [fug]. Thus, h has to verify not only K1 but also K0. In this case, h is an extension off, because it holds: h = An interpretation of sentences needs not start from the beginning; we may also start our interpretation from common background knowledge. The verifier f delivers such a starting point to interpret the assertion. Let us consider the following example.","(4) \"Ivan has stopped beating his wife\" presupposes that Ivan has beaten his wife. Ko = ({ ,1 1 , u2, u3 } , {14 1 = Ivan, u2 = wife(u3), u3 = u 1 , u 1 has beaten u 2, ...}), K1 = ({x 1 , x2, x3 }, {x1 = Ivan, x2 = wife(x3), x3 = x 1 , xl has stopped beating x2, ... }). Let f be an intended DRT-functions for K0. Then, an intended DRT-function h for K1 satisfies the following conditions: fch, h verifies K1 , h(x l ) = f(u 1 ), h(x2) = f(u2), and h(x3) = f(u3). Often, presuppositions are related to certain objects. When the discourse referent x1 in K1 presupposes characterizations of u 1 given by K0 , we should accept f(x1 ) = g(u 1 ) as a constraint. (5) \"The king of France is dead.\" Statement (5) presupposes some information on the person who is claimed to be a king of France. Suppose that this information is described by a DRS K0, where K0 = ({ //L I , }, { C(u i ), }). Let K1 = ({x 1 , x2 }, {x2 = France, king-exi , x2), dead(xi ))). Then, an intended DRT-function for K1 is a DRT-function h such that fch, h verifies K1 , and h(x1 ) = f(u 1 ), where f is an intended DRT-function that verifies K0. An external anchor in DRT connects a direct referential expression with a referent. When a speaker, pointing at Peter, says, \"The man is a spy\", the expression \"the man\" refers to Peter. This situation can be described as follows:","(6) K1 = ({x1 }, Iman(xi ), spy(x i ))). Let f = {(x1 , Peter)). Then, an intended DRT-function for K1 is a DRT-function h such that fch and h verifies\\tf corresponds to an external anchor in DRT. Presuppositions and external and internal anchors are constraints on intended DRT-functions; these constraints are not explicitly expressed by statements. Usually, the hearer has to guess these constraints by using cues given in the context. In many cases, the hearer has to find the intended referents and the intended situation. 2.2. Combining discourse and pictorial representations To explain a location of an object, we sometimes use a pictorial representation such as a map or a sketch and give additional information verbally. Think about this situation, in which a man points at the line on the map A and says,"]},{"title":"A L Z","paragraphs":["(7) \"This is a railway. There is a station on it. You can see a church near the station. Peter's house lies next to the church. This is a picture of the church.\""]},{"title":"O","paragraphs":["Hoshi Map A\\t1/20000 Picture B Let"]},{"title":"f,","paragraphs":["be an appropriate projective function from parts of the map A into the world M. Let f2 be an appropriate projective function from parts of the picture B into M. Let K be a DRS for (7), and g be a DRT-function from components of K into M. Then, h = [fi u f2u is a function that unifies information from these three sources. From the map, we can get spatial information such as orientation and distance, when it is proportion-preserving. From the picture, the shape of the church can be seen. The following is a detailed formal description of this situation:","(8) The projective function f, has the property of 1/20000-contraction. K = ({x 1 , x2, x3 , x4, x5 , x6, x7 }, { railway(x,), station(x 2), at(x2, x i ), church(x3), near(x3 , x2), x4 = Peter,","x5 belong to x4, house(x5), next-to(x5 , x3), church(x6), x6 = x3 , picture-of(x7 , x6))). g is an intended DRT-function that verifies K. fi (d,) E g(railway), fi (d2) E g(station), fi (d2) = g(station Hoshi), fi (d3) E g(church), f2(c i ) E g(church),f2(c2) E g(house), g(x7) = Picture B, and d3 is associated with the icon t. To connect information from these three sources, we pose the following constraints:","h = [fl u f2ug],\\t= g(x,), fi (d2) = g(x2), fi (d3 ) = f2(c 1 ) = g(x3), and f2(c2) = g(x5)• Verbal and pictorial information can be unified by using a function that combines both. 2.3. Combination of several evaluations Fauconnier proposes a theory of mental spaces and shows how to generally interpret complicated expressions in a natural language (cf. [2]). In this section, I will demonstrate how to deal with his complicated examples. Many examples in [2] are related to different evaluation areas; this is why he uses mental spaces. Example (9) can be considered as an ellipsis of (9') and (9') can be analyzed as (9\"): (9) In Len's painting, the girl with blue eyes has green eyes. (9') In Len's painting, the girl with blue eyes in the actual world has green eyes. (9\") [[The girl with blue eyes] (actual world) has green eyes]","(world of Len's painting) To describe the meaning of (9), we can use functions, f and g, with the following properties:","(10) f is an interpretation function of the actual world and g is an interpretation function of a possible world described by Len's painting. Furthermore: f(d1 ) E f(girl),f(c1 1 ) E f(have blue eyes), and f(di ) E g(have green eyes). Len's picture describes a possible world. This is the reason why the girl can have green eyes. She has blue eyes in the actual world but has green eyes in the world described by Len's picture. Many of examples in [2] can be analyzed in this way. Let us consider example (11) that can be analyzed as 11","(11) There is a play about Golda Meir played by Ingrid Bergman. In the play, Golda Meir meets Ingrid Bergman who is played by another actress. Someone claims, \"In this play, Ingrid Bergman meets Ingrid Bergman\".","(11') [[Ingrid Bergman ](actual world) meets Ingrid Bergman] (world described in this play)• Thus, (11') claims: ('(Ingrid Bergman), g(Ingrid Bergman)) E g(meet), where f is an interpretation function of the actual world and g is an interpretation function of a possible world described by the play. These examples show that many uses of mental spaces can be reinterpreted as marks of ranges of interpretation functions; they mark the world with respect to which an expression should be evaluated. 2.4. Requirement of an appropriate interpretation The following example cannot be explained by the method proposed in the former section: (12) Plato is on the top shelf. It is bound in leather. He is a very interesting author. In (12), \"Plato\" stands both for a philosopher and for a book that he wrote. In this case, we need a new interpretation of \"Plato\". The truth condition of (12) can be described as follows:","(13) Let f be an interpretation function of the actual world and g be a function that is created in order to properly interpret (12). Then, the meaning of (12) can be given as follows: g(Plato) E f(book), (f(Plato), g(Plato)) E f(wrote), g(Plato) E f(on the top shelf), f(it) E f(bound in leather), f(it) = g(Plato), f(he) E f(very interesting author), and f(he) = f(Plato). The condition, (f(Plato), g(Plato)) E f(wrote), connects two different interpretations of the name \"Plato\". Also in the example \"The mushroom omelet paid only for himself', it holds (f(omelet), g(omelet)) E f(eaten). In many of Fauconnier's examples, we can find the connection that can be expressed in form (f(c), g(c)) E f(R), where R expresses a popular relation. In his notions, f(c) is a trigger and g(c) is a target; a connector is a function F such that g(c) = F(f(c)). 2.5. Metaphor Metaphors can be described by using functions. For example, to understand the statement \"Anger is fire\", you would try to find an interpretation function g such that f(anger) c g(fire) and f(fire) c g(fire), where f is a standard interpretation function. In this case, it holds: f(anger)uf(fire) c g(fire). Certain common properties between anger and fire are properties that the speaker wanted to point out as properties of anger. The hearer has to use his imagination to find out what these common properties are. Lakoff and Johnson distinguish target and source category (cf. [5]). In the metaphor \"Time is money\", money is the source category and time is the target category. We obtain: f(money)uf(time) c g(money). Generally, when we have f(A)uf(B) c g(A), then A is the source category and B is the target category, where f is a standard interpretation function. However, not every metaphor has the form \"A is B\" with common nouns \"A\" and \"B\". In the example \"Jeremy is a lion\", \"Jeremy\" refers to an object and does not express any concept. Generally, to understand a metaphor, we replace the standard interpretation of A by a weaker interpretation of A, so that the statement becomes true. As a result, metaphors are open to a number of different interpretations; there is rarely one correct meaning.","(14) Definition of metaphorical interpretation: Let f be a standard interpretation function. Let [3 be an expression in the sentence y. Then, g verifies y by metaphorically interpreting p if","f(13) c g(13),f(13) # 8((3), [for all expressions a in y, if a # 13, then g(a) =f(oc)1, and g(y) = truth. (15) Examples of metaphorical interpretation:","a) \"Anger is fire\". If g(anger) = f(anger) and f(anger)uf(fire) c g(fire), then g verifies \"Anger is fire\" by metaphorically interpreting \"fire\", because [g(anger)uf(fire) c g(fire)]\\t[g(anger) c g(fire)] [g(Anger is fire) = truth]. A possible interpretation for g(fire) is the class of objects that are dangerous.","b) \"Time is money\". If g(time) = f(time) and f(time)uf(money) c g(money), then g verifies \"Time is money\" by metaphorically interpreting \"money\", because [g(time)uf(money) c g(money)] [g(Time is money) = truth]. A possible interpretation for g(money) is the class of objects that are valuable.","c) \"Jeremy is a lion\". If g(Jeremy) = f(Jeremy), f(Jeremy) E g(lion), and Anon) c g(lion), then g verifies \"Jeremy is a lion\" by metaphorically interpreting \"lion\", because [g(Jeremy) E g(lion)] [g(Jeremy is a lion) = truth]. A possible interpretation for g(lion) is the class of creatures that are brave. Sperber and Wilson claim that there is no discontinuity between loose talk and metaphor (cf. [11]). Indeed, definition (14) is also applicable to loose talk, as the following consideration shows.","(16) Examples of hyperbole and loose talk:","a) The speaker knows that Bill is a very nice person and says, \"Bill is the nicest person there is\". If g(the nicest person there is) = f(very nice person) and f(Bill) = g(Bill), then g verifies \"Bill is the nicest person there is\" by metaphorically interpreting \"the nicest person there is\", because f(the nicest person there is) c g(the nicest person there is) and U(Bill) E f(very nice person)] =---> [g(Bill) E g(the nicest person there is)].","b) Marie lives in Issy-les-Moulineaus, a block away from the city limits of Paris. She says \"I live in Paris\". If f(in) c g(in) and (Issy-les-Moulineaus, Paris) E g(in), then g verifies \"Marie lives in Issy-les-Moulineaus\" by metaphorically interpreting \"in\", because [g(Marie lives in Issy-les-Moulineaus) = truth & (Issy-les-Moulineaus, Paris) E g(in)]"]},{"title":"=","paragraphs":["[g(Marie lives in Paris) = truth]. 2.6. Conditionals In DRT, the conditional sentence, \"If a farmer owns a donkey, he beats it\", is expressed as K1\\tK2, where K1 = ({x1 , x2 }, tfarmer(x i ), donkey(x2), x1 owns x2 }) and K2 = ({x3 , x4 ,\\t=\\tx4 =\\tx3 beats x4}). According to (2d), a DRT-function f verifies K1 K2 if for every f s extension g that verifies K1, there is g's extension h that verifies K2 . In the classical DRT, it is not possible to interpret counterfactual conditionals. This is because any extension of f falsifies K1 , whereas we are interested in the worlds in which K1 is true. Through a use of DRT-functions, a description of meaning of counterfactuals becomes possible. Definition (17) describes truth conditions for conditionals; we presuppose here the meaning of \"differs minimally from\". Gardenfors' notion of revision provides an interesting explication of minimal difference (cf. [3]). (17) Definition of DRT-functions for conditional sentences","f verifies Kl > K2 iff for every DRT-function g that verifies Kl and differs minimally from f, there is g's extension h that verifies K2. Definition (17) integrates DRT-treatment of implication with Stalnaker's and Lewis' view of counterfactuals (cf. [6], [12]). According to Stalnaker, p > q is true in the world w 1 iff q is true in the world that is the closest p-world to w 1 . Here, p-world means a world in which p is true. According to Lewis, p > q is true in the world w i iff some (p A q)-world is closer to w 1 than any (p A ---,q)-world. Lewis' definition is a generalization of Stalnaker's one. Lewis considers the case in which there- are many close p-worlds but no closest one. When f verifies p > q, interpretation functions that verify p and differ minimally from f correspond to interpretation functions for the (p A q)-worlds that are closer to w 1 than any (p A ---,q)-world. (18) Examples for counterfactuals a) \"If Peter owned a donkey, he would beat it.\" The statement can be expressed as Ki > K2, where K1 = ({x 1 , x2 }, fx, = Peter, donkey(x2), x, owns .X2 ) and K2 = {.X3 , x4 , {x3 = x 1 , x4 = x2, x3 beats x4 ). Suppose that a standard DRT-function f verifies K1 > K2. According to (17), if there is a DRT-function g that verifies K1 and differs minimally from f, then there is g's extension h that verifies K2 . In the actual world, Peter owns no donkey. However, in a world that differs minimally from the actual world and in which Peter owns a donkey, Peter beats his donkey.","b) \"If I were a millionaire, my VW would be a Rolls.\" Let f be a standard interpretation function. We introduce an interpretation function g that differs minimally from f and satisfies the condition, g(I) E g(millionaire). Because (18b) is a counterfactual conditional, f(I) f(millionaire). Because of minimal difference, it is natural to assume: g(I) = f(I). Thus, f(millionaire) # g(millionaire). When (18b) is true, we can find g's extension h such that h(my VW) E h(Rolls). Because of minimal difference, it should hold: h(my VW) = g(my VW) = f(my VW). Hence, f(my VW) E h(Rolls). Thus, the car I have in the actual world is a Rolls in the world in which I am a millionare. According to Fauconnier, the phrase \"if ... then ...\" introduces a new mental space (cf. [2]). A counterfactual conditional introduces a counterfactual mental space. A counterfactual conditional \"if p, then q\" claims that q is true in a particular p-space, where p-space means a mental space in which p is true. Fauconnier criticizes Lewis' view of counterfactuals as inflexible and gives the following examples: (19) Fauconnier's examples a) If Napoleon had been the son of Alexander, he would have been Macedonian. b) If Napoleon had been the son of Alexander, he would have won the battle. The both statements might be accepted as reasonable. According to Fauconnier, these examples demonstrate that it has no sense to ask after the absolute truth of several counterfactual sentences. However, his argument is not convincing. The vagueness of the antecedents of these sentences is the true source of confusions. The following disambiguation of the antecedents shows that the speaker states two different antecedents. (20) Disambiguation of (19) a) If Napoleon had been the son of Alexander and had lived before Christ, he would have been","Macedonian.","b) If Napoleon had been the son of Alexander and had inherited all good properties of Alexander, he would have won the battle. 2.7. Summary In application examples, we had two types of treatments. We needed a combination of several functions or a slight modification of a standard interpretation. Interpretation is a creative activity based on knowledge of meaning and the world. In DRT, interpretations of variables are modifiable, but this modification is often too weak to describe complex semantic phenomena. I proposed in this paper to make interpretations of any symbols modifiable. The proposed general semantic theory is applicable to many problems and it is still strictly formal. CONCLUSIONS We can speak about the reality through different representation systems. We need, therefore, a semantic theory that can unify different forms of representations. Extending an idea in [7], I proposed in this paper a general semantic theory based on a flexible treatment of functions. It has been briefly shown how to deal with dynamic semantics in DRT, integration of non-literal uses of language and semantics for pictorial representations. ACKNOWLEDGEMENTS The first idea for this topic was presented in [7]. I would like to thank Peter Gardenfors, Christopher Habel, Alexander Klippel, Jens Allwood, and Hans Kamp for their comments and discussions. I am grateful to the anonymous referee for his valuable comments. REFERENCES [1] Brendt, B., Barkowsky, T., Freska, C. and Kelter, S. \"Spatial Representation with Aspect Maps\" in: C.","Freska, C. Habel, and K.F. Wender (eds.) Spacial Cognition. Springer:Berlin, pp. 313-336, 1998. [2] Fauconnier, G. Mental Spaces, Cambridge, Mass.: MIT Press, 1985. [3] Gardenfors, P. Knowledge in Flux, Cambridge, Mass.: MIT Press, 1988. [4] Kamp, H. and Reyle, U. From Discourse to Logic, Dordrecht: Kluwer, 1993. [5] Lakoff, G. and Johnson, M. Metaphors we live by, University of Chicago Press, 1980. [6] Lewis, D. \"Counterfactuals and Comparative Possibility \" in: Journal of Philosophical Logic 2, pp.","418-446, 1973. [7] Nakayama, Y. \"Interpretation of Discourse and Visual Information\" in: The Second Swedish","Symposium on Multimodal Communication - Abstracts, Lund University Cognitive Science, pp.","73-74 (also in: http://lucs.lu.se/Multimodal/Program.html).1998. [8] Nakayama, Y. \"Mereological Ontology and Dynamic Semantics\" in: Annals of the Japan Association","for Philosophy of Science, Vol. 9 No. 4, pp. 29-42, 1999. [9] Nakayama, Y. \"A Formal Theory for Pictorial Representations\" in: Bulletin Vol. 26, Graduate School","of Human Sciences, Osaka University, 2000. [10] Pratt, I. \"Map Semantics\" in: A. U. Frank and I. Campari (eds.) Spatial Information Theory: A","Theoretical Basis for GIS (Proc. COSIT'93), Berlin: Springer, pp. 77-91,1993. [11] Sperber, D. and Wilson, D. \"Loose Talk\" in: Proceedings of the Aristotelian Society 86, pp. 153-171,","1986. [12] Stalnaker, R. C. \"A Theory of Conditionals\" in: N. Rescher (ed.), Studies in Logical Theory, Oxford:","Blackwell, pp. 98-112, 1968."]}]}