{"sections":[{"title":"A UNIFIED APPROACH TO TENSE IN JAPANESE","paragraphs":["Kei Yoshimoto * Chidori Nakamurat Yoshiki Mori","* tGraduate School of International Cultural Studies, TO- hoku University","Kawauchi, Aoba-ku, Sendai 980-8576, JAPAN","Faculty of Medicine, Keiô University","Hiyoshi 4-1-1, KOhoku-ku, Yokohama 223-8521 JAPAN","E-mail: * kei©intcul.tohoku.ac.jp, tchidorih@pop16.odn.ne.jp, tmori@hc.cc.keio.ac.jp ABSTRACT In this paper we propose a method to compositionally interpret tenses of Japanese complex sentences on the basis of Head-Driven Phrase Structure Grammar and Discourse Representation Theory. In this approach, each of the tense-bearing forms such as main verbs and the past auxiliary is given a single temporal meaning independent of its position in the syntactic structure. The r̀elative tense theory' according to which a tense in a subordinate clause is interpreted in relation to a syntactically higher tense lays a foundation for this formalization."]},{"title":"1 INTRODUCTION","paragraphs":["Descriptive studies on tenses in Japanese complex sentences have revealed that tenses in the subordinate clause need a different interpretation from those in the matrix sentence (see Suzuki 1976, Teramura 1984, and KudO 1995). This paper proposes an HPSG/DRT version of the traditionally known hypothesis (r̀elative tense theory') that the criterion for interpreting a syntactically lower tense is established by the immediately higher tense. On the basis of this, we will argue that each of the two tense-bearing forms is given a single temporal meaning, irrespective of its position in the syntactic structure. Tenses in subordinate clauses which this specification seemingly cannot capture are explained away by difference in manners they are adjoined to the matrix sentence. Relative clauses, which call for idiosyncratic tense interpretations, are accounted for semantically by means of ambiguous scopings."]},{"title":"2 TENSE IN JAPANESE","paragraphs":["The subject of this study is the information provided by the auxiliary verb to and its absence. We will use t̀a-form' and 'non-ta-form' to denote these forms standing in opposition. Although a perfect meaning is often assigned to ta-marked sentences, we construe the form as essentially indicating a past tense, for except some peripheral cases its so-called perfect usage is compatible with the past occurrence of the denoted event, while the past tense cannot be conversely reduced to the perfect aspect.","It has been pointed out that temporal information in Japanese complex sentences is determined by Aktionsarten of the predicates (stative vs. dynamic) and a four-level hierarchical structure observed in subordinate clauses (see Minami 1974 and Takubo 1987). Minami (1974) draws four levels A, B, C, and D from co-occurrence observed between various constituents such as case NPs, adverbials, subordinate clauses, theme-marking phrases, verbs, auxiliary verbs, and modal particles (s̀hfijoshi'). Furthermore, he extends the idea of the layered structure to the general structure of the Japanese sentence not limited to subordinate clauses.","Minami's Level A is the innermost layer of the sentential hierarchy and is without its own subject or tense marking, allowing only a small set of adverbials and auxiliary verbs. Its tense interpretation depends exclusively on that of the matrix sentence.","(1) Taro ga\\t[Agitä wo hiki] nagara uta wo uta-- ta. NAME NOM guitar ACC play SIML\\tsong ACC sing PAST T̀arO sang, playing the guitar.' In the above example in which the subordinator (or the subordinate head) nagara connects the subordinate clause to the matrix clause, the eventuality time of the subordinate predicate hike (play), i.e., the time at which playing occurs, is simultaneous with that of the matrix predicate utau (sing).","Level B contains Level A and can additionally have some kinds of case NPs, adverbials, and auxiliary verbs, including its own subject and tense marking by ta or non-ta.","(2) [B Kekkon-shi- ta]\\ttame ni kaisha wo game- ta. get married\\tPAST CASI,\\tfirm ACC quit\\tPAST ' (I, she, etc.) left the firm because (I, she, etc.) got married.' The subordinate clause of the above example introduced by the subordinator tame ni is marked by ta, denoting that the event getting married precedes the event leaving the firm. Thus, in general, the tense of a Level B subordinate clause is interpreted relying on the interpretation of that of the matrix clause.","Level C encompasses Level B and various constituents such as modal adverbials and auxiliary verbs. The tense interpretation of a Level C subordinate clause is made independently of the matrix sentence.","(3) [c Haruko wa Supein e\\tit- ta]\\tga\\tAkiko wa Itaria e NAME\\tTOP Spain GOAL go PAST ADVS NAME TOP Italy GOAL it- ta. go PAST T̀hough Haruko went to Spain, Akiko went to Italy.' This sentence specifies no temporal order between the two events denoted by the subordinate and matrix clauses.","Level D, corresponding to an utterance, can contain modal particles besides Level C. Only the quotative particle to can introduce a Level D subordinate clause. The complex sentence constituted by this special kind of clause will be excluded from this study."]},{"title":"3 PREVIOUS STUDIES","paragraphs":["3.1 Traditional Grammar Traditional studies on tenses in complex sentences have referred to the tense marking in the subordinate clause as 'relative tense,' distinguishing it from the 'absolute tense' indicated by the matrix predicate (see for example Terarnura 1984). However, this view, based on the tacit assumption that the two tenses have some essential properties in common, leaves the relationship between them totally vague. In other words, it has not been made clear whether one and the same semantic representation can be posited for each of the two tense forms irrespective of their syntactic position, or two or more representations are necessary. 3.2 Mihara (1992) Mihara (1992) tries to explain tenses in Japanese relative clauses and a small set of other subordinate clauses by means of his 'Principle of Tense Perspective':","(4) a. If a subordinate clause has the same tense form as the matrix clause, its tense marking is determined from the perspective of the utterance time.","b. If a subordinate clause has a different tense form from the matrix clause, its tense marking is determined from the perspective of the time of the matrix clause.","Mihara's 'perspective' seems to be a concept identical with or close to the reference time in Reichenbach (1947). The most serious drawback with Mihara's theory is that the motivation is by no means clear for construing the combination of the same or different tenses as decisive.","As Igarashi (1999) points out, this will probably be because, if tense forms of the subordinate and matrix clauses are the same, i.e., if both are non- ta-marked or both are ta-marked, Mihara's tense interpretation 'from the perspective of the utterance time' is entailed by that from the perspective of the time of the matrix clause. Conversely, if one of the clauses is non- ta-marked and the other is a to-form, the interpretation from the utterance time perspective entails that from the perspective of the matrix clause time. Thus, Mihara's Principle (4) can be regarded as having chosen more general constraints. However, this means, as Igarashi (1999) argues, that (4) can be reduced to a much more streamline rule:","(5) The tense of a subordinate clause is interpreted ambiguously either in relation to the utterance time or in relation to the time denoted by the matrix predicate.","This in fact keeps in line with the observations made so far, as long as the relative clause is involved. However, it still remains how to formulate this by formal devices. 3.3 Igarashi (1999) Igarashi (1999) posits a principle for the tense interpretation of Japanese subordinate clauses which is equivalent to (5) except the addition of generic reading. As discussed in the previous subsection, this is explanatorily more adequate for its simplicity.","However, in distinction to Mihara who limits the application of his rule to relative clauses and a small group of subordinate clauses, Igarashi tries to cover all of the subordinate clauses. This, however, leaves a large number of cases unexplained by neglecting the marked contrast relative clauses exhibit to other subordinate clauses. More specifically, Igarashi's theory basically misses the facts captured by the relative tense theory and the four level hierarchy discussed in Section 2.","Igarashi seeks a solution to these problems by resorting to the distinction between temporal and modal meanings of tense forms, semantic relationships between the subordinate and matrix clauses, and lexico-semantic idiosyncrasies in predicates. The modality in tense forms is intended for handling the remarkable behavior of non-ta-marked dynamic predicates in the Level B subordinate clause. In Sections 4 and 5, we will propose a similar approach to the difficulty Igarashi points out. The second key notion in Igarashi's solution, i.e., the classification of semantic relationships between subordinate clause and matrix clause, is given only in fragments and in an unsystematic manner. Although he seems to distinguish these relationships from Minami's hierarchy of levels, the truth is the opposite: it is the goal of the Minamian hierarchy to classify mutually compatible constituents, from the both syntactic and semantic point of view. Igarashi also criticizes Yoshimoto's (1993) hierarchical account of tense interpretation for not clarifying the distinction between conditional and causal subordinate clauses. However, in Section 5 we will illustrate that the difficulty pointed out by him can be given an explanation within the same framework. 3.4 Ogihara (1989, 1996) Ogihara (1989, 1996) propose rules for interpeting tenses in Japanese subordinate clauses on the basis of GB syntax and Montague semantics. The relative tense in the traditional grammar, in which 'the reference point for location of a situation is some poit in time given by the context' (Comrie 1985, p. 56), is reinterpreted by him as dependence of a tense form on another tense form for tense interpretation when the former is c-commanded by the latter in LF. Ogihara applies this version of relative tense theory both to Japanese and English; the difference between them lies in the sequence-of- tense rule which is not found in Japanese.","Ogihara (1989, 1996) furnish a solid basis on which researchers interested in formal aspects of this area of study can build up their own theories. However, they are not an exhaustive study of tenses in Japanese subordinate clauses: the subordinate clauses taken up there are limited to relative clauses, the quotative clause marked by to and to yu, the temporal clause introduced by toki (when), mae (before), and ato (after), and nominalization by no and Moto. Furthermore, the distinction in Aktionsarten (stative vs. dynamic) is not addressed as an explicit issue. Therefore, it still remains to be demonstrated whether a formalized version of the relative tense theory is applicable to the Japanese subordinate clauses in general."]},{"title":"4 APPLICATION OF HPSG AND DRT","paragraphs":["In this paper, we propose a unified framework for the tense interpretation of Japanese sentences using Head-Driven Phrase Structure Grammar (HPSG; Pollard and Sag 1987, 1994) with its semantic component represented following Discourse Representation Theory (DRT; Kamp 1981a, 1981b and Kamp and Reyle 1993) instead of Situation Semantics (Barwise and Perry 1983). In building up Discourse Representation Structures (DRS's), Asher's (1993) bottom-up, semi--compositional algorithm is adopted. DRS's will be represented as partial feature structures of HPSG under the attribute SEMANTICS. However, in this paper only relevant part of information is given in the feature structure, mostly in an abbreviated form. 4.1 Tense in a Simple Sentence The temporal information denoted by matrix predicates marked by ta or non-ta is proposed in Table 1, based on Kamp and Reyle (1993). Table 1: Tense in Matrix Sentences","Dynamic e C t ta Past: t < n non-ta Certainty: t = n","Stative s 0 t ta Past: t < n non-ta Present: t = n","Throughout this paper, e, s, t, and n indicate the eventuality time of a dynamic predicate, that of a stative predicate, the location time, and the utterance time, respectively. <, =, C, and o are binary relations for temporal precedence, simultaneity, inclusion, and overlap. The location time is a concept specific to DRT-based tense theories and represents tense information of temporal adverbials. After Kamp and Reyle (1993), we specify the central meaning of tense forms not directly as a relationship between the eventuality time and utterance time, but as that between the location time and utterance time, for this is more appropriate in dealing with the tense of a negative sentence. For this purpose, a location time is assigned even to a sentence without an explicit temporal adverbial.","The non-ta form of a dynamic predicate, which is conventionally accepted as a future tense marker, encodes in this paper a modal predicate 'Be-Certain' embedding the event indicated by the non-ta-marked predicate. Since the eventuality 'Be-Certain' occurs at the utterance time, its tense meaning is t = n, while the location time of the embedded event is subsequent to the utterance time. Note that the Japanese non-past predicate without a to marking can be used in this 'future tense' meaning even without an explicit temporal adverbial, in contradistinction to the corresponding form in English. 4.2 Minami's Four-Level Structure In order to form a four-level sentence structure following Minami (1974), a HEAD feature HIERARCHY is introduced which takes values A, B, C, or D. This feature is used to impose co-occurrence restrictions. For example, the subordinator noni (CONCESSIVE) subcategorizes for a clause which has B as the value of HIERARCHY, which is percolated to the entire subordinate clause as a HEAD feature. (6) is the feature specification for noni: (6) PHON\\t(noni) HEAD MAJ ad HIER adv B SYNILOC SUBCAT Constituents with a HIERARCHY value C or D are analyzed as not included by this subordinate clause. In a similar manner, a HIERARCHY value is fixed for auxiliary verbs and VPs they subcategorize for. Below is the feature specification for the subordinator deshO (PRESUMPTIVE): clause","( HEAD SYNILOCIIHIER (7) PHON SYNILOC (deshô) HEAD SUBCAT MAJ v HIER C clause( SYNILOCIHEADIHIER","Thus, the following sentence and phrase are predicted to be ungrammatical owing to the HIERARCHY feature incompatibility.","(8) a. * [A [C [B TarO ga\\t[Akuru-] OB-] deshO] mast]] NAME\\tNOM come\\tZAUX PRSM POLT T̀aro will probably come-POLT.'","(10) ta-v-/ex \\t PHON SYNILOCISUBC SEM ta vp SYNILOCIHEADICONJF prepast SEM","\\t1 A (t < p)","b. * [B [c [BTarô ga\\t[Akuru-] O B -] desh6] noni] NAME","\\t NOM come\\tZAUX PRSM CONC Àlthough Tar -6 will probably come, ... (8a, b) are not accepted because the clause Taro ga kuru deshO, to which a HIERARCHY value C is assigned by the auxiliary verb deshO, is subcategorized for by the auxiliary verb rnasu or the subordinator noni which are incompatible in terms of the HIERARCHY values. We assume between kuru and deshO a zero auxiliary verb OB, a morpheme with a HIERARCHY value B but whose phonological value is void in order to ease the HIERARCHY value matching.","(9) gives an example of how a complex sentence is analyzed by this approach.","(9) [C [B [B [B Kane\\tga\\t[Anai]]\\tnoni] kuruma wo kat- ta]\\trashii] money NOM not exist CONC car\\tACC buy PAST CONJ Ìt seems that, although (I, he, etc.) had no money, (I, he, etc.) bought a car.' 4.3 Tense Specification for Complex Sentences Japanese predicates are formally classified in terms of the temporal information they carry as shown in Figure 1. Untensed on the first row of the figure stands for forms of predicates without their own tense information, i.e., Level A clauses. The other forms, tensed, are further divided into dependent tense and independent tense. The latter encompasses Level C and Level D clauses. The first is a Level B clause whose tense is given an interpretation in relation to that of the syntactically higher tensed predicate. We will argue that, given syntactically defined mechanisms for tense information percolation, there is no need to distiguish a tensed form in the subordinate clause (more specifically, a dependent tense) from that in the matrix clause (an independent tense form).","The lexical specification for the past auxiliary verb ta is given below. SEMANTICS contains only tense-related abbreviated information. ta means that the location time t of the predicate temporally precedes the standard time p. The standard time is left undetermined within the above specification; it is fixed by the syntactic location the predicate occurs at in the sentence, and, if a higher predicate exists, also by its location time.","Below is a lexical rule applied to all prototype lexical entries for verbs: it produces feature structures for a verb without tense information, a tensed stative verb, and a tensed dynamic verb. untensed tensed { dependent tense (relative tense) independent tense (absolute tense) Figure 1: Classification of Predicates in Terms of Tense -394-RELN Now 1INST v-base PHON SYN SEM 2 [ DRS SEMHEAD 4 untensed-nonta PHON SYN SEM 1 2 V stat-tensed-nonta PHON SYN SEM 1","2 3 3 A (t = p) dyn-tensed-nonta PHON SYN\\t","2V SEM\\t[ DRS SEMHEAD Be–Certain( 4 ) A = p)","The untensed verb occurs within a Level A clause, as explained in Section 2. The location time of a tensed stative non-ta predicate is simultaneous with its standard time. In the tensed dynamic predicate too, the location time is constrained to be identical with the standard time. However, the location time is not that of the event itself, but of the modal predicate 'Be-Certain' which embeds the event obtained as the value of the attribute path SEMIDRS1SEMHEAD of the input specification. The feature SEMHEAD takes as its value the semantic head of the DRS conditions and is used to form a DRS from its constituent DRS's.","The standard time p coincides with the utterance time when it is located at Level C or D, as specified by the rules below. > [ SEMIDRS tense-independency(12) a. c-clause \\t","b. tense-independency \\t SEMHEAD LOCI CONDS\\t(•••,","When a predicate occurs at Level C or D, the p's in the to and non- ta specifications in (10) and (11) are replaced by n, resulting in the matrix sentence tenses illustrated in Table 1. The relationship between the eventuality and the location time, e C t and s o t, are introduced by lexical rules applied to verbs.","The following rules relate the tense interpretation of a subordinate sentence to that of the matrix sentence:","(13) a-subordinate \\t> SYNILOCIHEADIADJUNCTISEMIDRSISEMHEADILOCT[ SEMIDRSISEMHEADILOCT","(14) a. tensed-subordinate \\t> SYNILOCIHEADIADJUNCTISEMIDRS[ SEMIDRS Condition: tense -dependency( 2 1 2 b. tense-dependency( 2 drs SEMHEADISTDT 3 2 drs SEMHEADILOCT —395— (13) says that the location time of the subordinate predicate as an adjunct and that of its counterpart matrix predicate are identical (in an abbreviated notation t, = t m , where i s and t in are location times of the subordinate and matrix clauses). (14a) is a rule applied to Level B subordinate clauses and constrains the location time of the matrix sentence to unify with the standard time of the subordinate clause (p, = t m ). More specifically, all (14a) says is that a relation tense-dependency holds between the DRS of the matrix clause and that of the subordinate clause, and (14b) defines this relation.","In the example below with a Level B subordinate clause headed by the particle noni,","(15) [Kane ga\\tnail\\tnoni] kuruma wo kat- ta. money NOM not exist CONC car\\tACC buy PAST Àlthough (I, he, etc.) had no money, (I, he, etc.) bought a car.' the information on the subordinate predicate's standard time p s is percolated up to the matrix sentence and identified with its location time (p, = t m ) by (14a) and (14b). The second disjunct of the output of (11) is applied to the non-ta subordinate predicate, unifying the location time and standard time of the subordinate clause (t, = p s ). (10) says that the ta-marked predicate of the matrix sentence has a location time preceding its standard time (t m < pin ). (12a, b) in turn identify the latter with the utterance time (p m = n). Furthermore, lexical rules constrain the subordinate predicate's eventuality time to overlap with the location time (t, o s s ) and the matrix eventuality time to be included by the location time (em C t m ). The outcome is: i s 0 ss , i s = t m < n, em C t Analogously,","(16) [Kane\\tga\\tnakat-\\tta]\\tnoni] kuruma wo kat- ta. money NOM not exist PAST CONC car\\tACC buy PAST Àlthough (I, he, etc.) had no money, (I, he, etc.) bought a car.' is interpreted as i s 0 ss , i s < t m < n, en, C t m . In the next section we will discuss another meaning of (16).","Lastly, it is quite easy to explain how sentences with a Level C subordinate clause like (3) are analyzed. To a Level C subordinate clause is applied the rule (12), unifying the standard time with the utterance time without being mediated by the matrix tense. (3) is thus analyzed as e, C i s < n, em C t m < n."]},{"title":"5 OTHER ISSUES","paragraphs":["5.1 Modal Predicate 'Be—Certain' As explained in Subsections 4.1 and 4.3, the modal predicate 'Be-Certain', which is interpreted on the basis of possible worlds, is assigned to a non-ta-marked predicate. If the predicate occurs in the matrix clause, its location time is identical with the utterance time, while the eventuality time of the verb embedded as its argument occurs after the utterance time, unless an unexpected turn of the situation interrupts its realization.","The third disjunct of the output of (11) applies not only to a dynamic predicate in the matrix position, but also to a subordinate one.","(17) [Haruko ga\\tsotsugy5-suru] node\\tissho-ni ryokO-suru. NAME\\tNOM graduate\\tCASL (SBJ) together travel B̀ecause Haruko will graduate, I will make a trip with her.' rn The interpretation of the above sentence is i s = t m, = n. Here, i s is the location time of the modal predicate B̀e-Certain(sotsugyO-suru(Haruko) )', which is simultaneous with the matrix location time tm . The location time t s, of the embedded verb sotsugyö-suru, assuming that no unexpected interruption is taken into account, occurs later than the former two location times (t s = t m (= n) < t8,).","The modal specification in (11) works together with other tense-related constraints to simplify the rules in comparison with Yoshimoto (1993, 1998). In these foregoing studies, a feature MEDIUM-TIME was introduced as a mediator of temporal information between the subordinate and matrix clauses, which is only motivated by the difference in the tense interpretation of non-ta forms depending on their Aktionsarten. Given the modal predicate for non-ta-marked predicates, we can now simply identify the standard time of the subordinate clause with the location time of the matrix clause (see (14a) and (14b)). 5.2 Hierarchical Sentence Structure and Tense Interpretation Although Yoshimoto (1993, 1998) proposed a framework of tense interpretation similar to the one presented above, it directly represented a future tense meaning without using the modal predicate B̀e-Certain'. Also, it did not take into account smaller differences in behavior among constituents classified into the same Minamian level. As a consequence, it could not give a proper account of the difference in meanings of the two ta-marked subordinate predicates below, as Igarashi (1999) points out:","(18) a. [Kodomo ga kuruma wo arat- ta] node\\tkozukai\\two ageru. child\\tNOM car\\tACC wash PAST CASL (SBJ) pocket money ACC give B̀ecause my child washed my car, I will give him pocket money.'","b. [Kodomo ga kuruma wo arat- ta] nara q\\tkozukai\\two ageru. child\\tNOM car\\tACC wash PAST COND (SBJ) pocket money ACC give Ìf my child washes my car, I will give him pocket money.' While the location time of the subordinate clause arat-ta in (18a) is prior to the utterance time (i.e., i s < n), the one in (18b) is given a reading that it has not necessarily occurred as of the utterance time; therefore, its location time is interpreted as only preceding the location time of the matrix clause (i.e., i s < t r,y, n < where t in, is the location time of the eventuality giving). From this observation, Igarashi (1999) concludes that neither the relative tense theory nor the Minamian hierarchy is applicable to tenses in Japanese subordinate clauses.","However, each of (18a, b) is given a correct tense interpretation within the same approach as the one presented in 5.1. Let us assume that the two subordinate clauses are adjoined to the matrix clause in different manners: (18)a'. [[Kodomo ga kuruma wo arat-ta] node] [[ kozukai wo ageru] Be-Certain] b'. [[[Kodomo ga kuruma wo arat-ta] nara] [0 kozukai wo ageru]] Be-Certain In (18a'), the adjunct clause is combined with the entire head clause including the modal predicate B̀e-Certain', producing a semantic representation in which the location time of the subordinate clause is prior to the location time of the matrix clause, and consequently to the utterance time (t, < t m, = n). In contrast, in (18b') the subordinate clause is combined with the verbal phrase kozukai wo agent (give pocket money) excluding 'Be-Certain'. Subsequently, the resulting phrase is paired with 'Be-Certain' as a complement. According to this analysis, the location time of the subordinate clause is interpreted as prior to the location time of the verbal phrase kozukai wo ageru, as not necessarily preceding the utterance time (i.e., i s < tm ,, n < tm = n). Thus, Igarashi's (1999) criticism overlooks the fact that the relative tense theory can be maintained with a slight modification.","Nevertheless, it remains true that the subordinators node and nara call for a further subclassification of the constituents that have been classified as Level B. We leave this as an issue to be considered in the future studies.","A ta-marked stative predicate in Level B subordinate clauses, when followed by a ta-marked matrix predicate, seems to mean i s < n like the non-ta-marked alternative form. According to the constraints given in the previous section, the interpretations of (15) and (16) should be i s = tm, < n and i s < t m < n, respectively. As mentioned above, however, (16) is often used to describe the seemingly same situation as (15).","However, we doubt a tense-marking function of the ta-form in (16) and turn to its aspect-marking function we have hitherto ignored. Following Teramura (1984) who observes a difference in points of view, we construe the ta-form here as an aspectual marker conveying background information. For this usage of the auxiliary verb we need another lexical specification constraining the location time and standard time to be identical (t = p). So considered, examples such as (16) can be captured without changing any rules. 5.3 Relative Clause and Scope Ambiguity Rleative clauses are theoretically ambiguous in two ways. See the following sentence cited from Ogihara (1996). (20) Taro wa [nai-te iru] otoko wo mi- ta. \\t NAME TOP cry\\tPROG man ACC see PAST T̀aro saw a man who was crying.'","Although in (20) the embedded clause nai-te iru (is crying) is by default interpreted in relation to the tense of the matrix predicate, it can be extended with adverbials such as ima (now) and asoko de (over there) that make a reading more reasonable in which the embedded tense is interpreted in relation to the utterance time.","Following Ogihara (1989, 1996), we regard this as a semantic issue involving scope ambiguity. Note that this idiosyncratic behavior of relative clauses cannot be captured within the framework of the relative tense theory. It also violates Minami's syntactic hierarchy, since a syntactically higher level can be embedded in a lower level.","Following Ogihara again, the tense-related meaning of a relative clause is processed in a similar manner as quantifier scopings within the HPSG machinery. At the level of the matrix sentence, the semantic representation is given as follows: (21) tense-with-relnpats = ps}, {tm, < Prn}) The standard times of the subordinate and matrix clauses have been kept undetermined until this stage; they are identified only after the relation tense-with-relnp is applied.","The application of the relation outputs two interpretations.","(22) [(21) =] ({t,\\tps} A tense-dependency(ps, tm, ) A tense-independency({tm < pm,}))","V (tense-independency({ts = ps}) A tense-independency({tm < pm})) = {t, = t m, , t m, <n}V{ts=n,t,,,=n} In one interpretation, the relation tense-dependency defined in (14b) holds between p s and tm , and the type specification tense-independency in (12b) is applied to { t m < pm } and identifies pm with n. The result is i s = tm, < n. According to another interpretation, tense-independency applies both to {t s = ps } and to {t m, < prn }, and sets the two standard times to the utterance time. Its output is i s = n, tm = n. Thus, while the tense interpretation of other types of subordinate clauses relies crucially on syntax, that of relative clauses depends much more on semantics."]},{"title":"6 CONCLUSION","paragraphs":["We have proposed a uniform approach to tenses in various constructions in Japanese on the basis of a formal version of the relative tense theory. The solution requires minimal constraints in lexical specifications and rules, and is compositional in the sense of constraint-based syntax. It also provides a point of departure for universal studies on tenses in world languages from the formal linguistics point of view."]},{"title":"REFERENCES","paragraphs":["Asher, Nicholas, 1993, Reference to Abstract Objects in Discourse. Dordrecht: Kluwer Academic Publishers. Barwise, Jon, and John Perry, 1983, Situations and Attitudes. Cambridge, Mass.: MIT Press. Comrie, Bernard, 1985, Tense. Cambridge: Cambridge University Press.","Igarashi, Yoshiyuki, 1999, \"The Temporal Interpretation of Japanese Subordinate Clauses.\" In: Takao Gunji and KOiti Hasida, Topics in Constraint-Based Grammar of Japanese. Dordrecht: Kluwer Academic Publishers.","Kamp, Hans, 1981a, \"A Theory of Truth and Semantic Representation.\" In: Groenendijk, J. and M. Stokhoff (eds.), Formal Methods in the Study of Language, 227-322. Amsterdam Mathematical Center.","Kamp, Hans, 1981b, \"Evenements, representations discursives et reference temporelle.\" Langage 64, 39-64.","Kamp, Hans, and Uwe Reyle, 1993, From Discourse to Logic: Introduction to Modeltheoretic Semantics of Natural Language, Formal Logic and Discourse Representation Theory, 2 Vols. Dordrecht: Kluwer Academic Publishers.","KuclO, Mayumi, 1995, Aspect, Tense-Tai pei to Text: Gendai Nihongo no Jikan no Hyogen (System of Aspect and Tense and Text: Temporal Expressions in Modern Japanese). Tokyo: Hituzi Syobo.","Mihara, Ken'ichi, 1992, Jisei-Kaishaku to Togo GenshO (Tense Interpretation and Syntactic Phenomena). Tokyo: Kuroshio Shuppan.","Minami, Fujio, 1974, Gendai Nihongo no KOzO (Structure of Modern Japanese). Tokyo: Taishiikan Shoten.","Ogihara, Toshiyuki, 1989, \"Temporal Reference in English and Japanese.\" Ph.D. Thesis, University of Texas at Austin. Ogihara, Toshiyuki, 1996, Tense, Attitudes, and Scope. Dordrecht: Kluwer Academic Publishers.","Pollard, Carl, and Ivan Sag, 1987, Information-based Syntax and Semantics, Vol. 1. Center for the Study of Language and Information, Stanford University.","Pollard, Carl, and Ivan Sag, 1994, Head-Driven Phrase Structure Grammar. Chicago: The University of Chicago Press. Reichenbach, Hans, 1947, Elements of Symbolic Logic. New York: Collier-Macmillan.","Suzuki, Shigeyuki, 1976, \"Nihongo DOshi no Toki ni tsuite (On Tense in Japanese Verbs).\" Gengo 5.12, 50-58. Tokyo: Taishaan Shoten.","Takubo, Yukinori, 1987, \"Togo Kozo to Bunmyaku JOhO (Syntactic Structure and Contextual Information).\" Nihongo-gaku 6.5, 37-48. Tokyo: Meiji Shoin.","Teramura, Hideo, 1984, Nihongo no Syntax to Imi (Syntax and Semantics of Japanese), Vol. 2. Tokyo: Kuroshio Shuppan.","Yoshimoto, Kei, 1993, \"Nihongo no Bun-KaisOkOzO to Shudai, Shoten, Jisei (Topic, Focus and Tense in Japanese Syntactic Hierarchy).\" Gengo Kenkyu 103, 141-166. The Linguistic Society of Japan. Yoshimoto, Kei, 1998, Tense and Aspect in Japanese. Frankfurt am Main: Peter Lang."]}]}