{"sections":[{"title":"","paragraphs":["WH-questions without WH-words'","Daeho Chung (cdaehogmail.hanyang.ac.kr) English Dept, College of Humanities, Hanyang University 1271 Sa 1-dong, Ansan-si, Kyonggi-do, S. Korea 425-791 111 Wh-less wh-questions are possible in Korean","Korean has a special form of wh-construction in which wh-question readings are produced even without a wh-phrase. For example, the sentences in (1) and (2) below convey the wh-question readings given in the English translations (with or) without the shaded parts overtly realized.","(1) ameyrikha taylyuk-ul\\tpalkyenha-n salam-un WAVO.1 ni k̂a)? America continent-Acc discover-Adn man-Top who-be-QE Ẁho is the person who discovered America?'","(2) hankwuk cencayng ttay mikwun-i mayncheum sanglyukha-n hangkwu-nun Korean war\\tduring US;force-Nom the;first\\tland-Adn port-Top (eti-i-pnikka)? (where-be-QE) (̀Which place is) the port that the US force first landed during the Korean War?' Such WH-less WH-Questions (let us call them WLWQs) are very often used as questions in written tests or uttered by quizmasters in quizzes, though not often in daily conversations. 2 I assume that, despite their restriction in the range of registers, WLWQs are also constrained by the knowledge of human language. To my knowledge, there has been no previous research on WLWQs in the field.","This paper discusses some syntactic issues as to WLWQs. In the course of discussions, I try to argue among others: (i) WLWQs differ in several syntactic aspects from other reduced expressions like VP ellipsis, gapping, pseudogapping, and other shortened wh-questions (section 2); (ii) they also differ from the cleft construction despite apparent similarities in interpreation (section 3); the overtly realized parts in WLWQs are topics (section 4); they read as subjects but not as other grammatical functions like objects or adjuncts due to the principle of deletion up to recoverability, which applies to elliptical structures in general (section 5); they do not have a non-interrogative reading due to a general principle constraining information structures (section 6); and nominative (as opposed to topic) WLWQs do not exist because of the restriction on phases (Chomsky 1998) (section 6). In the appendix, I discuss a potential conceptual problem that WLWQs face with respect to the feature copying mechanism and suggest possible solutions. [21 WLWQs and Other Reduced Expressions","In this section, WLWQs and other reduced expressions will be compared. Among the reduced expressions are VP ellipsis constructions (Sag 1976, Wasow 1972, Williams 1977, Chomsky and Lasnik 1993, etc.), gapping constructions (Ross 1970, Larson 1990, Johnson 1994, An earlier version of this paper was presented at the fall conference of the Modern Grammar Circle of Korea, Taegu University, November 13, 1999. I thank the participants for their comments and suggestions. I also thank an anonymous Paclic paper reviewer for her valuable comments, suggestions, and corrections. I regret that I could not incorporate all of them into the paper, though. Of course, all shortcomings are mine. WLWQs are not entirely excluded in spoken languages, as the following example is acceptable:","(i)\\tkewul-a, kewul-a, seysang-eyse kacang yeppwun yeca-un (rmuk mirro-Voc mirror-Voc, world-in most beautiful woman-Top \\twho-be-QE M̀irror, mirror, who is the most beautiful woman in the world?' etc.), and pseudogapping constructions (Levin 1979/1986, Lasnik 1995, 1997, Jayaseelan 1990, Kim 1997, etc.). Some of the examples are given below: (3) (4) (5) VP-ellipsis a. John loves Mary and Tom does","\\t j, too.","b. A: I like apples. B: I do \\ttoo. Gapping John eats apples, and Mary\\tbananas. Pseudogapping John eats apples, and Mary does eat bananas. WLWQs syntactically differ from such constructions in several important points. First, the elided parts in these constructions require linguistically expressed antecedents in the sentence or in the discourse, while no such requirement applies to WLWQs. 3 A second difference lies in the size of copies. Phrasal or word level categories (VP or V) need to be copied for the LF interpretation of the elided parts in sentences in (3), (4), and (5).4 In contrast, just some subpart of words (probably phi-features and some basic semantic features) is copied for WLWQs, as will be clear later on. For example, to get WHO in (1), it only has to copy some subpart of the head of the topic, i.e., salam. 5 A third and more fundamental difference lies in the modes of copying. In case of the copying process in WLWQs, a c-command relation holds between the two copies: the wh-phrases in (1) and (2) are c-commanded by the topics, the antecedents which their interpretation depends on. In contrast, no c-command relation holds between the copies in the other constructions in question: neither the overlty realized parts nor the elided parts c-command the other in (3), (4), and (5).6","WLWQs can not be equated with shortened wh-questions for similar reasons. Compare the following with the WLWQs in (1) and (2):","(6) A: John-i Mary-eykey kkoch-ul cwu-ess-ta. J.-Nom M.-Dat flower-Acc give-Pst-DE J̀ohn gave Mary flowers.'","B: Sue(-eykey)-nun? S.-Dat-Top Ẁhat about Sue?' 3 This observation has some theoretical repercussion as to the treatment of ellipsis. It sides with the LF interpretive approach (Wasow 1972, Williams 1977, etc.) rather than with the PF deletion approach (Sag 1976, Lasnik 1997, etc.). I will follow the practice of the former approach for this reason in this paper, unless otherwise specified. 4 Lasnik (1995, 1997) analyzes English pseudogapping constructions as a sort of VP ellipsis constructions. For example, (5) results from VP ellipsis, with the remnant (banana) having moved out of the VP. Similarly Kim (1997, ch 4) analyzes English gapping also as a kind of phrasal ellipsis (TP ellipsis in his analysis), with the remnants having (rightward) moved out of the ellipsis site via focus movement. 5 Of course, a [+wh] feature somehow has to be added to the copy. For the time being, I am ignorant exactly how this is accomplished. 6 Rather, an anti-c-command relation seems to hold between the copies. Note that ellipsis is possible across sentences as in (3b) or across conjuncts. VP ellipsis may also take place in subordinate clauses. (i) Almost 35 percent of the doctors said it was OK to say a suspicious breast lump existed when it didn't exist in order to get coverage. (The LA Times, November, 1999) (ii) Dulles suspected everyone Angleton did su \\t(May 1985) The ellipsis site in (i) is not c-commanded by the trigger if the temporal adjunct clause is adjoined to position higher than the trigger. The so-called antecedent contained deletion structure as in (ii) does not seem to satisfy the anti-c-command condition. If, however, the ellipsis site is c-commanded by the trigger, the infinite regress problem arises. Various solutions have been proposed in the literature: May's (1985) QR analysis, Baltin's (1987) extraposition analysis, Lasnik's (1993, 1997) and Hornstein's (1994) object-raising-to-[SPEC, Agro] analysis, among others. A common feature of all these analyses is that they assume an operation that abolishes the apparent c-command relation. (R1) 'Who gave Sue flowers?' (R2) 'What did John give to Sue?' (R3) 'What did John do with Sue?' The shortened question in (6B) conveys various readings depending on the contexts, as shown in the English translations. They are all [+wh] readings. This is possible because the elided part can be recovered from the previously uttered sentence. In contrast, WLWQs in (1) and (2) can be uttered without there being any previous linguistic antecedent for the elided parts.' Shortened wh-questions and WLWQs also differ in the size of the copies and in the copying modes.' [3] Evidence against the Cleft Analysis","WLWQs look very similar to cleft constructions in their semantic interpretation. Compare the cleft construction in (7) and the WLWQ in (8):","(7) Songi-ka mek-un kes-un mwues-i-ni? S.-Nom eat-Adn KES-Top what-be-QE Ẁhat is it that Songi ate?'","(8) Songi-ka mek-un kes-un\\tmvvues-S.-Nom eat-Adn thing-Top what-be-QE Ẁhat is the thing that Songi ate?' It seems that the WLWQ in (8) equals the cleft construction in (7) except that the shaded part is unrealized in (8).","There are, however, several pieces of evidence against the cleft analysis of WLWQs. First, kes in (7) and that in (8) convey different semantic weights: kes in the cleft construction bears no (or little if any) substantial meaning, while that in WLWQs does bear some substantial meaning. Compare the following two sentences:","(9) [Songi-ka manna-n kes-un] citokyoswu-i-ess-ta. S.-Nom meet-Adn KES-Top advisor-be-Pst-DE Ìt was her advisor that Songi met.'","(10) [Songi-ka manna-n kes-un]? S.-Nom meet-Adn KES-Top Ẁhat is the thing that Songi met?' 7 It is interesting to observe that the Korean sentence in (6B) contains no wh-phrase, while its English counterpart does. An anonymous paper reviewer suggests an interesting analysis of WLWQs in which structures like (1) and (2) are simply instances of sentences only the first half of which are produced by one speaker, who expects the addressee to complete them, parallel to the following English expressions:","(i)\\ta. Your name/age/nationality is \\t b. You left the party at \\t c. You saw him in \\t d. NGO here means \\t e. Mary left the party because \\t The reviewer continues to say that the rising intonation of the speaker signals the request. If this proves to be true, we will have a picture that is very different from the one to be presented in this paper.","Although it is yet to be further examined whether the two sets of structures can be accounted for in a uniform way, (and I regret not being able to due to the paper submission deadline,) they appear to be different at least at the surface level, as will be clear later on. First, the elided parts in Korean are (nominal) complements incorporated into a copula, whereas those in English could be complements not only of a copula, but also of a transitive verb, of a preposition, and even of a complementizer. Second, the remnants function as subjects in Korean, whereas they do not even form a constituent in English. Third, the remnants in Korean are topics, whereas those in English cannot function as such since they do not form a constituent. Unless such differences are independently explained, it would be difficult to treat the two sets of data alike. —59— As in (9), kes in the cleft construction is compatible with a human being in the cleft position. In contrast, kes in the WLWQs is not. For example, (10) cannot be answered with (11):","( 1 1) Citokyoswu advisor Ìt is my advisor.' For a similar reason, sentences like (12) are not acceptable:","(12) a. *[e, yenge-lul\\tkaluchi-si-nun] kes,-unr","English-Acc teach-Hon-Adn KES-Top Ẁho is the person that is teaching English?' \\t","b. *[Songi-ka konghang-eyse cip-ulo e, mosi-n]\\tkes,-un]? S.-Nom airport-from home-to e take(HON)-Adn KES-Top Ẁho is the person that Songi took from the airport to her place?' Such sentences are unacceptable due to the honorificity conflict. In (a), the subject honorific morpheme si requires an honorable subject, which cannot fare with kes. In (b), the predicate mosi takes an honorable object, which also cannot fare with kes.","Secondly, WLWQs need not end with kes-un. Content nouns are perfectly fine, as in (2), repeated below.","(2) Hankwuk cencayng ttay mikwun-i mayncheum sanglyukha-n hangkwu-nun Korean war\\tduring US;force-Nom the;first\\tland-Adn port-Top (where-be-QE) (̀Which place is) the port that the US force first landed during the Korean War?' (2) is a topic-marked relative construction, not a cleft construction that ends with kes.","Thirdly and crucially, no clausal projection is required for WLWQs unlike for cleft constructions:","(13) a. Mikwuk chotay taythonglyeng-uy ilum-un? America the;first president-Gen\\tname-Top (̀What is) the name of the first president of America?'","b. Ilpon-uy swuto-nun? Japan-Gen capital;city-Top (̀What is) the capital city of Japan?' Nominal expressions with no verbal predicate perfectly constitute WLWQs.9 9 Not all nominals are allowed as WLWQs. Although topics can be either [+definite] or [+generic], only the former type is allowed:","(i) a. *?say-nun? bird-Top (Intended) 'What is the bird?'","b. *hanlcwuk salam-un? Korea man-Top Ẁhat are the Koreans?' Non-specific, generic NPs may constitute a different kind of wh-questions, which end with (i)-la-n.","(ii) a. say-la-n? bird-DE-Top Ẁhat is the bird?' b. hankwuk salam-i-la-n?","Thus I conclude that WLWQs and cleft constructions differ from each other, although they sometimes convey a very similar meaning. [4] On the Syntactic Position of XP-un/nun","I claim that XP-un/nun in WLWQs is syntactically located in the SPEC of TopP (topic phrase), as schematically represented below (order ignored):' (14) [Top, XP,-nun/un [Top' Top [ This not only explains the fact that XP ends with a topic marker –nun/un but also various other facts including the following. First, no wh-phrase within XP can be licensed as a [+wh] element, just as [+wh] elements within a topic phrase could not:","(15) a. *[Songi-ka encey manna-n] salam-un","S.-Nom when meet-Adn man-Top who-be-QE (Intended) Q who is the person that Songi met when?'","b. *[Songi-ka encey manna-n] salam-un John-i-ni?11","S.-Nom when meet-Adn man-Top John-be-QE (Intended) (Q the person that Songi met when is John?' This could be accounted for if topic is located outside of the scope of the interrogative clause (=CP), as assumed in (14).","Secondly, the structure given in (14) accounts for the fact that WLWQs are impossible in embedded clauses.","(16) *John-i [Songi-ka manna-n salam-un n t kwu- -ta](-ko) mit-ni?","J.-Nom S.-Nom meet-Adn man-Top who-be-DE-C \\tbelieve-QE","Ẁho does John believe that the man Songi met is?'","(17) *na-nun [Songi-ka manna-n salam-un"]},{"title":"n\\t","paragraphs":["i] kwungkumha-ta. 1-Top S.-Nom meet-Adn man-Top who-be-QE wondering-DE (Intended) I'm wondering who the person Songi met is.' Topicalization is a root phenomenon and is not generally allowed in the embedded context in Korean.' [5] Why Only Subject Interpretation? The overtly realized parts in WLWQs could only be interpreted as subjects but not as Korea man-be-DE-Top Ẁhat is the property Korean people have? It is impossible to attach (i)-la-n to a question that requires a specific answer. (iii)\\t* mikwuk taythonglyeng ilum-i-la-n?","America president\\tname-be-DE-Top","(Intended) 'What is the name of the president of the United States?'","(0.K) 'What is the meaning of the phrase 'the name of the American president'? 10 If we strictly follow the LF-copy approach to ellipsis, copula may not exist in the representation at all. Expletive elements like copula need not (and must not for the economy reason) be formed at LF. (15b) becomes acceptable if the topic marker is changed to nominative. (15a) is not improved in such a way. See section 7 for some discussion. 12 Lasnik and Saito (1992: chapter 3) allow embedded topics, though: (i)","\\t (= Lasnik and Saito 1992: 81, their (51)) John said that this book, he thought you would like t 11111 other grammatical functions like objects or adjuncts.","(18) Songi-ka manna-n salam-un? S.-Nom meet-Adn man-Top Ẁho was the person that John met?' #'(Who did someone see) the person John met?' #'(When/where did) the person John met cry?' This apparently does not fare well with the fact that not only subjects but also non-subjects like objects and adjuncts can be topicalized in a language like Korean:","(19) ssalpap,-un tongyang salamtul-i e, mek-nun-ta. rice-Top\\torient people-Nom eat-Pres-DE Òriental people eat rice.'","(20) ecey-nun\\tpi-ka\\tmahni o-ess-ta. yesterday-Top rain-Top a;lot fall-Pst-DE Ìt rained a lot yesterday.'","(21) hakkyo-eyse-nun coyonghi ha-ca. school-in-Top\\tquiet\\tdo-Propositive L̀et's be quiet at school.' But the non-availability of object/adjunct construal of WLWQs can be easily explained away by the so-called principle of deletion up to recoverability. Suppose that (18) is the result of the object topicalization followed by the remnant deletion, as schematically represented below: (22) [NP,-nun [NP\\tb]] (22) is ill-formed because there is no way to retrieve the elided part. Note that the elided part in WLWQs does not have its linguistic antecedent. Thus, the information that the subject and the (transitive) verb bear could not be retrieved. Similar stories can be said about the adjunct construals of (15).","How is it then possible to have a subject reading despite the principle of deletion up to recoverability? Consider the schematic structure in (14), repeated below: (14) [Topp XP,-nun/un [Top, Top \\t QEMi] Subject is recoverable from the topic phrase because they are identical. What about the wh-phrase (WP)? Is it recoverable also? I claim it is so. This is because, I claim, the wh-phrase is minimally different from the head of XP. For example, if the subject is an XP denoting a human being, then the WP is WHO. If it is an XP denoting an animal or a thing, then the WP is WHAT. If it is an XP denoting a place, the WP is WHERE, etc. In brief, the wh-phrase is recovered by adding a [+wh] feature to the core meaning (phi-features plus some semantic features like [+/- human], [+/-locational], [+/-temporal], etc.) of the head of the topic XP. Thus the WP in (14) is recovered virtually from the topic phrase except from the feature [+wh] it has. I also assume that the predicate BE, being an expletive verb, does not need an antecedent to be recovered. Or if we follow an LF interpretation approach to ellipsis, the predicate BE must not exist at all since meaningless elements must not exist at all at LF for the principle of full interpretation in the sense of Chomsky (1986). The feature agreement (or more precisely, sharing) between the topic and the unrealized wh-phrase is only possible when the deleted predicate is copula BE. Other content predicates would not be recovered due to the recoverability condition. Furthermore, they would not guarantee the feature sharing between the overtly realized topic and the unrealized wh-phrase. 161 Why not Non-interrogative Reading?","It is impossible to interpret XP-nun/un as a non-interrogative reading, e.g., a declarative, imperative or propositive reading. For example, the expression in (23) cannot have a declarative reading:","(23) *Songi-ka manna-n\\tsalami-S.-Nom meet-Adn man-Top \\t-BE-DE #T̀he person that Songi met is XP.' Whether or not XP in (23) has a semantic content, the structure is ill-formed for the following reasons. Suppose that XP has some substantial semantic content, for example, JOHN. Then the sentence is ill-formed because it violates the principle of deletion up to recoverability. Note that the semantic content of the elided part including JOHN could not be recovered from anywhere. Suppose now XP shares relevant portions of features with the head of the topic. Then XP is recoverable as in the case of the wh-phrase in WLWQs. But such sentences are not informative at all. Note that XP only copies some subpart of the topic such that (23) would be interpreted as something like the following:","(24) Songi-ka manna-n salami-S.-Nom meet-Adn man-Top -Nom man-BE-DE #T̀he person that Songi met is a person.' Such structures will be eliminated due to some relevant restriction on the information structure. The deleted part is a rheme since it follows a topic. A rheme, as a focus, must contribute some informative content to the proposition, unless otherwise obviated. (24) is thus unacceptable probably because it is merely a tautology and not informative at all, violating (a sort of) the Grice's (1975) maxim of quantity.","WLWQs do not give rise to an imperative or propositive reading, either. But I believe this is so for some other reasons. For a sentence to have an imperative or propositive mood, it must involve a 2nd person as subject. In addition, the predicate must convey an activity reading. Neither of the requirements can be satisfied in the construction at issue. The verb in WLWQs is copula, which is not an action verb. The second person is hardly allowed as the subject in WLWQs:","(25) * {ne/John-kwa ne}-nun? You/John and you-Top","Why is it then that WLWQs are fine as interrogatives? Interrogatives seek, not contribute, information. It is thus addressees who are responsible for providing the relevant information. In other words, the requirement of information contribution is obviated on the part of the questioners and the question words need not bear any new information. [7] Why not Nominative-marked WLWQs:","We have seen that WLWQs must end with a topic marker. Other markers, e.g., object markers or subject markers, are not allowed. Why is this so? Object-marked WLWQs can be easily eliminated because of the principle of deletion up to recoverability, as reasoned before. Note that the existence of an object requires a subject and a transitive predicate in the sentence, which cannot be elided unless otherwise licensed. But what about the nominative-marked WLWQs? Consider the following structure and examples.","(26) *XP,-i/ka -Nom","(27) *Songi-ka manna-n salam-i wtikwu S.-Nom meet-Adn man-Nom who-be-QE Ẁho was the person that Songi met?'","(28) *mikwuk chotay taythonglyeng ilum-i\\tmwu s-America the;first president\\tname-Nom what-be-QE (̀What is) the name of the first president of the United States?' (26) is identical to the structure in (14) except that topicalization has applied in (14). The wh-phrase in (26) could be recovered from the subject just as the one in (14) can be recovered from the subject, which in turn can be recovered from the topic phrase. What causes the contrast in grammaticality between (14) and (26), i.e., the topic-marked vs. nominative-marked WLWQs? For the time being, I have no clear answer for this, but conjecturing that the notions of phases and cyclic spell-out in the sense of Chomsky (1998) could be exploited in accounting for this. According to Chomsky (1998), basic propositional structures like vP and CP constitute phases. Operations apply phase by phase and phases are cyclically spelled out. Assume this and compare the following two abstract structures:","(29) a . [Tope XP-nun [Top' Top b.\\t[cp [c' [+wh] [ip X As for the licitness of the topic-marked WLWQ in (29a), we could say that the phase CP has been elided after the question morpheme [+wh] in the question clause has been checked, say, by raising the wh-phrase to the proper checking domain. As for the illicitness of the nominative-marked WLWQ in (29b), I conjecture that the phase CP cannot be a syntactic object and cannot be properly spelled out because the [+wh] feature in C could not be licensed once the shaded part including the WP is elided.\" Appendix: How are features copied in WLWQs?","We have tacitly assumed in the text that wh-phrases in WLWQs are copied from subjects and subjects are copied from topics, as schematically represented below: (1)","\\t [TopP XP-nun [cp\\tIvy BE Ny ii]] Strictly speaking, however, this is impossible under the view that syntactic structures are derivationally generated in a bottom-up tree building mode. For example, the WP could not be copied from subject because subject is generated at a later stage in the derivation.\"","There are several way outs to think of. First, we may abandon the bottom-up mode of tree building altogether for a top-down mode. In this case, topic will be generated prior to subject, which will be generated prior to WP. No special problem arises in the processes of copying relevant features. A second way we can conceive of is to allow copying directly from the numeration set, while keeping the bottom-up mode of tree building, along the lines of Jean-Roger Vergnaud's (1996 class lecture) account of WCO effects. According to him, bound pronouns are merely copies of the phi-features of a quantifier in the numeration set. Once quantifiers are introduced into the syntax, i.e., inserted into the tree, phi-feature copying is no longer available. Thus, quantifiers are introduced into the syntax later than their bound variables and the former always c-command the latter. Once such a mode of copy is allowed, no special problem arises in the copying process in WLWQs. (Subpart of) An element in the numeration set to function as a topic later in the structure is copied to form the wh-phrase and the subject. A third possibility is to allow feature licensing rather than feature copying. In this case, all the 13 In this section I followed the PF deletion approach to ellipsis for the expository purpose. cf. footnote 3. 14 The relation between subject and topic does not pose such a problem if subject moves to the topic position. — 64 — three elements exist in the numeration set and their features are somehow licensed in the later stage. References Baltin, Mark R. 1987. Do antecedent contained deletions exist? Linguistic Inquiry 18: 579-95. Chomsky, Noam. 1986. Knowledge of language. New York: Praeger. Chomsky, Noam. 1995. The minimalist program. Cambridge, Mass.: MIT Press. Chomsky, Noam. 1998. Minimalist inquiries: the framework. ms. MIT. Chomsky, Noam and Howard Lasnik. 1993. The theory of principles and parameters. In Syntax:","An international handbook of contemporary research, Vol. 1, ed. Joachim Jacobs,","Arnim von Stechow, Wolfgang Sternefeld, and Theo Vennemann, 506-69. Berlin:","Walter de Gruyter. Grice, H. P. 1975. Logic and conversation. In Radical pragmatics, ed. Peter Cole, 41-58. New","York: Academic Press. Hornstein, Nobert. 1994. An argument for minimalism: the case of antecedent contained","deletion. Linguistic Inquiry 25:455-80. Jayaseelan, Karattuparambil A. 1990. Incomplete VP deletion and gapping. Linguistic Analysis","20: 64-81. Johnson, Kyle. 1994. Bridging the gap. ms. UMass. Kim, Jeong-Seok. 1997. Syntactic focus movement and ellipsis: A minimalist approach.","Doctoral dissertation, UConn, Storrs, Connecticut. Larson, Richard. 1990. Double objects revisited: Reply to Jackendoff. Linguistic Inquiry 21:","589-631. Lasnik, Howard. 1993. On antecedent contained deletion. ms. , University of Connecticut,","Storrs. Lasnik, Howard. 1995. A note on pseudogapping. MIT Working Papers in Linguistics 27: 143-","163. Lasnik, Howard. 1997. Pseudogapping puzzles. ms. UConn. Lasnik, Howard, and Mamoru Saito. 1992. Move-a. Cambridge, Mass.: MIT Press. Levin, Nancy. 1979/1986. Main verb ellipsis in spoken English. Doctoral dissertation, Ohio","State University, Columbus. [Published 1986 by Garland, New York] May, Robert. 1985. Logical Form: Its structure and derivation. Cambridge, Mass.: MIT Press. Ross, John. 1970. Gapping and order of constituents. In Progress in linguistics, ed. M.","Beirwisch and K. E. Heidolph, 249-259. The Hague: Mouton & Co. Sag, Ivan. 1976. Deletion and Logical Form. Doctoral dissertation, MIT, Cambridge, Mass. Wasaw, Thomas. 1972. Anaphoric relations in English. Doctoral dissertation, MIT, Cambridge,","Mass. Williams, Edwin. 1977 Discourse and Logical Form. Linguistic Inquiry 8: 101-139."]},{"title":"-66-","paragraphs":[]}]}