{"sections":[{"title":"基於階層式類神經網路之自動新聞文件分類方法","paragraphs":["陳彥呈 蔣榮先 國立成功大學資訊工程系 chenyc@ismp.csie.ncku.edu.tw jchiang@mail.ncku.edu.tw 摘要摘要摘要摘要 文件分類是一項決定一篇文件是否屬於一個或多個已事先定義好的類別之 工作,而自動化分類則可以有效地幫助分類的處理。在本篇論文中,我們提出了 一個以階層混合式的專家模組(hierarchical mixture of experts model)為基礎的文 件分類方法。這個模組使用了分割-克服原理(divide-and-conquer principle),在 一個事先定義好的階層架構下定義較小的分類問題,而最後的分類器則是使用類 神經網路中的倒傳遞網路來完成分類機制。另外,在特徵選取(feature selection) 上,我們也做了一些有別於傳統方法的改變。最後,我們以部份路透社 (Reuters-21578)的新聞性文件做為測試資料,實驗結果顯示我們所提出的方法能 有效地改善文件分類的正確率。 1. 緒論緒論緒論緒論 近幾年來,隨著網路技術不斷地進步,有用的資訊也相對地大量成長中。雖 然網路上舉手可得的資訊方便人們對資訊的取得與傳遞,但是當網路資訊量愈來 愈大時,如何有效、且快速地取得有用的資訊,便成為非常重要的事情。此時, 文件分類(text categorization)技術,即透過演算法分析一電子文件後,將其分配 (assign)給一或多個類別(categories),便扮演著其中重要的角色。 傳統的文件分類工作都是由某個領域的人類專家(human experts in domain) 所完成。但是,隨著文件數量快速地成長,對於專家而言,這樣的工作就變得更 困難了。在這種情況下,文件的自動分類就顯得更加重要了。 很多在做文件分類的方法中,例如使用規則庫(rule-based) 、知識庫 (knowledge-based)、或樣本庫(instance-based)...等,都是依賴大量的樣本來 決定和文件有關的規則或知識。一般而言,這些樣本集合必須由那些對應用領域 有深入認識的專家來訂定與建立,也因此,這些方法常常因為相關樣本建立得不 足或不完全,使得規則或知識也就相對地不齊全,因此,就無法對文件做全盤性 的樣本比對,以致於造成了分類上的困難。 在本篇論文中,主要的動機在於改善目前文件分類的方法,我們不以關鍵字 的存在否來決定一篇文件應屬於那一個或多個類別。進一步的,我們採用以類神 經網路為基礎的階層式架構的機器學習的方法來決定文件的歸屬。而且,經由這 樣學習的方法,可以使文件分類系統更容易地應用到其他的領域。 本篇論文除了緒論外,第二節將介紹我們所提的階層式模組,第三節將介紹 特徵及訓練樣本集的選取,第四節則針對我們所使用的路透社新聞性資料集所做 的一些自動化文件分類實驗的結果與分析。最後,我們為本篇論文提出總結。 2. 階層式模組階層式模組階層式模組階層式模組 圖一所示,是我們所提出的自動化文件分類的完整模組。一個文件分類系統 (text categorization system)的主要工作流程,是先用一組訓練樣本集來訓練系統 中的文件分類器;然後再藉由已訓練好的分類器對測試樣本中的新文件做自動化 分類的動作。在圖一的實線箭頭部份是整個文件分類的詳細訓練過程,首先決定 一組已由專家分類好的樣本集,從此樣本集中,經過一連串的前處理程序後,選 擇一組最能代表及識別(identification)此類別的特徵集(feature set)。並以向量方式 表示之,如此就可得到一個以特徵向量表示的樣本組,而在階層式類神經網路模 組中,主要是希望能透過每一個樣本組來訓練其所屬的分類器,使其能很正確地 將每一個樣本分到正確的類別去。經過一連串的反覆學習後,我們得到一組已訓 練好、具有相當辨識程度的分類器,以供測試階段時使用。 圖一中的虛線箭頭部份則是整個測試流程,起初也是將一新文件經過一連串 的前序處理後,再依特徵集轉換成向量形式,最後透過階層式類神經網路模組, 以決定新文件所屬的類別。 圖一 本論文所提出之自動化文件分類模組 在圖一用虛線方塊所圍成的,就是我們所提出的階層式類神經網路模組,其 詳細的架構如圖二,此模組的主要的靈感是來自於 Jordan 和 Jacobs[1993]所提出 的階層式混合的專家模型(hierarchical mixture of experts , HME model)。HME 模 式是以分割-克服原理(divide-and-conquer principle)為基礎,其主要的想法是將一 個大問題分割成若干個容易解決的小問題,然後再結合這些小問題的解答,以得 到一般化的解答。而在分類一個減少範圍上(reduced domain),HME 模型是經由 將輸入空間(input space)劃分成一巢狀、順序的區域,然後訓練特定的較小分類 器,以此求得一個分類問題的答案。HME 模型包含兩個基本的元件:閘門網路 (gating networks)和專家網路(expert networks)。這些元件的結構類似於樹狀結構 (tree structure),其內部節點是閘門、樹葉節點是專家。圖二就是我們提出的一個 五層的階層式模組架構圖。 圖二 本論文所提出之階層架構圖 在我們的模型中,每個閘門所表示的是一份文件的一般概念,假如文件中包 含著所表示的概念,則網路的輸出是 1,否則為 0。而專家所表示的是特定的類 別[Ruiz, 1999]。所有的文件都以向量表示之。整個分類工作是由根節點(root node) 開始,假如閘門的輸出值為真,則第二層的節點都會被啟動,如此的程序持續至 它到達一個樹葉節點。 對於閘門和專家網路,由於類神經網路中的倒傳遞網路(back-propagation , BP Network)具有學習正確率高、理論簡明[Zurada, 1992]。因此,我們決定使用 三層的倒傳遞類神經網路,其輸入層包含了 N 個特徵,隱藏層包含了(2N/3)個節 點,而輸出層為單一個節點。而在神經元的架構中,我們使用 S 形函數(sigmoid function)作為轉換函數。此函數具有微分容易的優點,可配合降梯度法則來調整 神經元間的權重,此函數當自變數趨向正負無限大時,函數值趨近於常數,其函 數值域在[0,1]之間。 3. 特徵選取和訓練資料集選取特徵選取和訓練資料集選取特徵選取和訓練資料集選取特徵選取和訓練資料集選取 一般而言,文件大部份都是人們以自然語言所書寫而成的,這些文件中的文 字所要表逹的,則是人們的想法與意見。我們相信在這些想法與意見中,主要是 由一些重要的觀念所組成的,而我們認為文字中的名詞字詞最能表逹一個觀念的 形成。因此,在特徵選取過程中,我們首先使用了由 Eric Brill [1993]所提出的詞 性分析器(part-of-speech tagger)為每個英文字標示其詞性資訊,然後選擇名詞集 合的關鍵字詞。接下來則必須使用 stop word 過濾器模組,將上述所選取標示名 詞的關建字詞中,過濾一些不足以代表文件本身特性字詞,以避免在接下來的處 理過程中,引入太多不必要的雜訊(noise)。在做完 stop word 的處理後,其他剩 下的名詞字集還不能算是最後想要的特徵集。因為根據人們的寫作習慣,對於那 些出現頻率太過於頻繁或過於貧乏的字,通常都沒有太大的義意及重要性,對於 符合這兩種情形的字集,我們可以經由字詞頻率-反文件頻率(term frequency and inverse document frequency , TFIDF)的分析而將其過濾掉,如此處理後所剩下的 部份,我們稱之為特徵字詞(feature words),這些字詞才是最重要的精華。 此外,在訓練分類器方面,對於同一類別的正負訓練樣本選取上,若兩者的 選取差距過大,造成過度地不平均,很有可能會造成分類器在學習上的誤差,以 致於造成最後分類上的錯誤。因此,對於訓練樣本的選取也是不可忽視的工作之 一。在這一方面,我們採用了由 Ruiz [1999]所提出的′′類別區(category zone)′′的 概念來選取訓練樣本集,其基本做法為選取屬於此類別的文件為正樣本,而選取 最靠近此類別、卻不屬於此類別的文件做為負樣本。這樣的概念,最早是來自於 Singhal 等人[1997]為文件繞送(text routing)所提出來的想法。 4. 實驗結果與分析實驗結果與分析實驗結果與分析實驗結果與分析 4.1 資料集 本實驗所使用的測試資料集,是由 David D. Lewis [1996]和路透社人員所共 同整理而成的路透社新聞性文件-Reuters-21578。在這個資料集中,總共包含了 21578 篇文件,分為五大類別(EXCHANGES, ORGS, PEOPLE, PLACES, TOPICS),我們只拿五大類別中的 TOPICS 類別做為實驗之用。在這個類別中, 包含了 135 個子類別,為了階層式模組的訓練及測試的需要,我們只選擇包含三 篇文件以上的子類別做為測試類別。最後,我們使用了 96 個子類別、10555 篇 文件作為實驗用的資料集。 對於 96 個子類別的階層架構,我們使用了 [陳彥呈, 2000] 所提出的架構 圖,其架構如圖三。它基本的建構概念是依據文件在各類別之間的分佈來分析類 別間的關連性所建立起來的。 圖三 在 TOPICS 中,96 個子類別的階層式架構圖 4.2 結果 在評估我們的模組效能之前,我們要先針對我們的模組提出兩個問題:1) 在同樣使用類神經網路方法的情況下,有使用階層式架構和沒有使用階層式架構 的效能差異。2)我們所提出的階層式架構和目前幾個有名的分類方法比較,其優 劣為何? 在本實驗中所使用的評估方法,為在資訊擷取中最常被大家使用的正確率 (precision)、召回率(recall)和 F1 評估方法。 表格一所示,是我們所提出的階層式方法和沒有使用階層架構的方法的比較 [Manevitz, 2000],由表格中,我們可以很清楚地看出來,我們所提出的階層式方 法,大大地提昇了分類的正確性。 表格一 使用階層式架構 V. S . 沒有使用階層式架構的平均效能比較 表格二所示,則是我們所提出的方法和兩個著名的分類方法的比較-決策樹 (decision tree) [Weiss, 1999]和 k-NN 方法[Aas, 1999]。由表格中,我們可以知道, 我們所提出的模組在某些類別上,其效能比其他兩種方法好。而在正確率及召回 率上的成長,也比其他兩種方法要來得穩定。 表格二 我們所提出的階層式分類模組和決策樹及 k-NN 之比較 5. 結論結論結論結論 本論文主要是在文件分類上,提出一個結合機器學習方法的階層式模組,並 且使用了詞性分析器,以擷取出真正有意義的特徵字詞。最後,我們將我們的方 法和其他方法做比較。從實驗的結果我們得知,我們所提出的階層式模組確實能 提高正確率和召回率。 本論文的未來研究方向主要有特徵的選取,在使用類神經網路做為分類模組 時,特徵選取的好壞會直接影響到分類的正確性。此外,我們也希望在類別區上 尋求其他的方法,以期能求得更合適的訓練樣本集。 參考文獻參考文獻參考文獻參考文獻 Aas, K., and Eikvil, L., \"Text categorization: A Survey\", Report No. 941, Norwegian Computing Center, June, 1999. ISBN 82-539-0425-8 Eric Brill, ′′A Corpus-based Approach to Language Learning′′, phD Dissertation, University of Pennsylvania, 1993. Jordan, M. I., and Jacobs, R. A., ′′Hierarchical Mixtures of Experts and the EM algorithm′′, Technical Reports A. I. Memo No. 1440, Massachusetts Institute of Technology, 1993 Koller, D., and Sahami, M., ′′Hierarchical Classifying Documents Using very few Words′′, in ICML-1997: Proceedings of the 14 th International Conference on Machine Learning, 1997, pages 170-178. Lewis, D. D., ′′Reuters-21578 Text Categorization Test Collection Distribution′′, in AT&T Labs – Research, 1996. Manevitz, L. M., and Yousef, M., ′′Document classification on neural networks using only positive examples′′, ACM SIGIR, 2000, pages 304-306. Ng, H. T., Goh, W. B., and Low, K. L., ′′Feature Selection, Perceptron Learning, and a Usability Case Study for Text Categorization′′, in Proceedings of the 20 th","Annual International ACM SIGIR Conference on Research and Development in Information Retrieval, 1997, pages 67-73. Ruiz, M. E., and Srinivasan, P., ′′Combining Machine Learning and Hierarchical Indexing Structure for Text Categorization′′, in Proceedings of the 10 th ASIS/SIGCR Workshop on Classification Research, 1999. Ruiz, M. E. and Srinivasan, P., ′′Hierarchical Neural Networks for Text Categorization′′, in Proceedings of the 22nd ACM SIGIR International Conference on Information Retrieval, 1999, pages 281-282. Singhal, A., Mitra, M., and Buckley, C., ′′Learning Routing Queries in a Query Zone′′, in Proceedings of the 20th","Annual International ACM SIGIR Conference on Research and Development in Information Retrieval, 1997, pages 25-32. Weiss, S.M., Apte, C., Damerau, F.J., Johnson, D.E., Oles, F.J., Goetz, T., Hampp, T., \"Maximizing text-mining performance\", IEEE Intelligent Systems, Volume: 14 Issue: 4, July-Aug, 1999, pages 63-69. Zurada, Jacek M., \"Introduction to Artificial Neural Systems\", West Publishing Company, USA, 1992. 陳彥呈, 蔣榮先, ′′基於階層式類神經網路之自動文件分類模式′′, 第八屆模糊理 論及其應用會議, 2000."]}]}