{"sections":[{"title":"","paragraphs":["September 1991 Volume 17, Number 3"]},{"title":"Computational Linguistics Articles","paragraphs":["An Algorithm for High Accuracy Name Pronunciation by Parametric Speech Synthesizer Chinese Number-Names, Tree Adjoining Languages, and Mild Context-Sensitivity The Generative Power of Categorial Grammars and Head-Driven Phrase Structure Grammars with Lexical Rules Computation of the Probability of Initial Substring Generation by Stochastic Context-Free Grammars Erratum to: A Statistical Approach to Machine Translation"]},{"title":"Book Reviews","paragraphs":["Plan Recognition in Natural Language Sandra Carberry Current Research in Natural Language Generation Edited by Robert Dale, Chris Mellish, and Michael Zock A Computational Model of First Language Acquisition Nobuo Satake As Time Goes By: Tense and Universal • Grammar Norbert Hornstein The Logical Structure of English: Computing Semantic Content Allan Ramsay"]},{"title":"Books Received","paragraphs":["Tony Vitale Daniel Radzinski Bob Carpenter Frederick Jelinek and John D. Lafferty Reviewed by Randall J. Calistri-Yeh Reviewed by Ingrid Zukerman Reviewed by Robert C. Berwick Reviewed by Mary Dalrymple Reviewed by Martin Volk 257 277 301 315 325 327 330 334 337 340 344 Published Quarterly by the MIT Press for the Association for Computational Linguistics"]},{"title":"Computational Editor Managing Editor Associate Editor Book Review Editor The FINITE STRING Editor ' Editorial Board Members 1989-91: 1990-92: 1991-93: Linguistics","paragraphs":["ISSN 0891-2017 James F. Allen Computer Science Department University of Rochester Rochester, NY 14627, USA (+1 716) 275-5288 acl@cs.rochester.edu Donald E. Walker Bellcore, MRE 2A379 445 South Street, Box 1910 Morristown, NJ 07960-1910, USA (+1 201) 829-4312 walker@flash.bellcore.com Robert C. Berwick Artificial Intelligence Laboratory Massachusetts Institute of Technology Cambridge, MA 02139, USA (+1 617) 253-8918 berwick@ai.mit.edu Graeme Hirst Computer Science Department University of Toronto Toronto, CANADA M5S 1A4 (+1 416) 978-8747 gh@cs.toronto.edu Ralph M. Weischedel BBN Systems & Technologies Corporation 10 Moulton Street Cambridge, MA 02238, USA (+1 617) 491-1850 weischedel@bbn.com Robert J. P. Ingria, BBN Systems & Technologies Corporation Christopher S. Mellish, University of Edinburgh Jeffry Pelletier, University of Alberta Martha Pollack, SRI International Patti Jo Price, SRI International Masaru Tomita, Carnegie Mellon University Mary McGee Wood, University of Manchester Susan Warwick, University of Geneva James Pustejovsky, Brandeis University Stuart Shieber, Harvard University Kenneth Church, AT&T Bell Laboratories Robert Moore, SRI International Julia Hirschberg, AT&T Bell Laboratories Eduard Hovy, USC/Information Sciences Institute Paul Jacobs, General Electric Robert Kasper, Ohio State University Diane Litman, Columbia University Graeme Ritchie, University of Edinburgh Richard Sproat, AT&T Bell Laboratories Oliviero Stock, Institute for Scientific","& Technological Research"]},{"title":"September 1991 Volume 17, Number 3 Computational Linguistics Articles","paragraphs":["An Algorithm for High Accuracy Name Pronunciation by Parametric Speech Synthesizer Chinese Number-Names, Tree Adjoining Languages, and Mild Context-Sensitivity The Generative Power of Categorial Grammars and Head-Driven Phrase Structure Grammars with Lexical Rules Computation of the Probability of Initial Substring Generation by Stochastic Context-Free Grammars Erratum to: A Statistical Approach to Machine Translation"]},{"title":"Book Reviews","paragraphs":["Plan Recognition in Natural Language Sandra Carberry Current Research in Natural Language Generation Edited by Robert Dale, Chris Mellish, and Michael Zock A Computational Model of First Language Acquisition Nobuo Satake As Time Goes By: Tense and Universal Grammar Norbert Hornstein The Logical Structure of English: Computing Semantic Content Allan Ramsay Tony Vitale 257 Daniel Radzinski 277 Bob Carpenter 301 Frederick Jelinek and John D. Lafferty Reviewed by Randall J. Calistri-Yeh Reviewed by Ingrid Zukerman Reviewed by Robert C. Berwick Reviewed by Mary Dalrymple Reviewed by Martin Volk 315 325 327 330 334 337 340"]},{"title":"Books Received 344 Copyright Q1991 by the Association for Computational Linguistics.","paragraphs":["The following code, 0891-2017/91, indicates the copyright owners' consent that a single copy of an article may be made for personal use. The consent is given, however, on the condition that the copier pay the stated per-copy fee of $3.00 through the Copyright Clearance Center, Inc., 21 Congress Street, Salem, MA 01970, USA, for copying beyond that permitted by Sections 107 and 108 of the U.S. Copyright Law. This consent does not extend to other kinds of copying, such as copying for general distribution, for advertising or promotional purposes, for creating new collective works, or for resale. Such permission requests and other permission inquiries should be addressed to the Managing Editor at the address given on the inside front cover of this issue."]},{"title":"Computational Linguistics","paragraphs":["is abstracted and/or indexed in the following publications:"]},{"title":"Annual Review of Information Science and Technology, Computing Reviews, Current Contents: Social and Behavioral Sciences, Knowledge Engineering Review, Language and Language Behavior Abstracts, Linguistic Abstracts, Linguistic Bibliography, Science Abstracts","paragraphs":["(INSPEC Section C), and"]},{"title":"Social Science Citation Index.","paragraphs":["Volume 14 and subsequent volumes of"]},{"title":"Computational Linguistics","paragraphs":["are available on microfilm through University Microfilms International, 300 North Zeeb Road, Ann Arbor, MI 48106, USA."]},{"title":"Individual Subscriptions to Computational Linguistics","paragraphs":["are available only with membership in the Association for Computational Linguistics (ACL). Annual membership dues are as follows: regular, $25.00; full-time student with current student ID, $15.00; joint for couples with one subscription, $30.00. A membership application together with an order form for back issues and conference proceedings is included at the end of this issue. Send membership applications and address changes to Dr. Donald E. Walker (ACL), Bellcore, MRE 2A379, 445 South Street, Box 1910, Morristown, NJ 07960-1910, USA. However, note that it is also possible to pay in other currencies through banks in Switzerland and Japan."]},{"title":"Institutional Subscriptions","paragraphs":["are $70.00. Outside the U.S. add $14.00 postage and handling. Canadian subscribers also add 7% GST. Send institutional subscription orders and address changes to MIT Press Journals, 55 Hayward Street, Cambridge, MA 02142-1399, USA. To be honored free of charge, claims for missing copies must be made immediately upon receipt of the next published issue. Institutions should order back issues (before 1988) and all proceedings from the ACL at the address above."]}]}