{"sections":[{"title":"","paragraphs":["Computational Linguistics Volume 17, Number 1","Section 6 (\"On Translation\") consists of a single paper by van der Korst in which he presents a FG MT system. The principles of the system are very simple. The predication underlying a linguistic expression is language-neutral; therefore the theory provides a ready-made interlingua. If it is possible to parse and to generate, then it is also possible to translate. Of course, this is an oversimplification, since different languages typically use different subsets of the set of possible predicates. Thus, paraphrasing relations between predications are necessary. Van der Korst provides a lot of useful examples to illustrate the problems and achievements of his system.","The verdict: This is an important book, since it begins to sketch what a computational version of FG might look like. It is very important for people working in functional paradigms such as FG to bring their insights about language use to the design of NLP systems, which will have real users. However, the book is ultimately disappointing for a number of reasons. It has the feel of a collection of disparate papers that are united in their debt to Dik (1978) rather than by their participation in a coherent research program. The papers are inadequately cross-referenced and display many needless inconsistencies of style (e.g., \"PROLOG\" vs. \"Prolog'; endnotes vs. footnotes). The papers build very few bridges between computational FG and what is going on in the rest of NLP. As we have noted, some of the attempts to do so misfire. Perhaps most disappointing of all, the volume fails to raise what ought to be the most interesting question: what, if any, are the distinctive benefits of functional theories such as FG for NLP?"]},{"title":"References","paragraphs":["Bates, Madeleine (1978). \"The theory and practice of augmented transition network grammars.\" In Natural Language Communication with Computers, edited by Leonard Bolc, 191-259. Springer-Verlag.","Butler, Christopher S. (1985). Systemic Linguistics: Theory and Applications. Bats ford.","Dik, Simon C. (1978). Functional Grammar. North-Holland. (Third printing, 1981, Foris.)","Mellish, Christopher S. (1988). \"Implementing systemic classification by unification.\" Computational Linguistics, 14(1), 40-51. Norman Fraser is a research fellow at the University of Surrey. He is currently researching dependency parsing and dialog management. His address is: Social and Computer Sciences Research Group, University of Surrey, Guildford, Surrey, GU2 5XH, U.K.; e-mail: norman@soc.surrey.ac.uk."]},{"title":"A Computational Model of Metaphor Interpretation James H. Martin","paragraphs":["(University of Colorado at Boulder) Boston: Academic Press, 1990, xxiii + 229 pp. (Perspectives in Artificial Intelligence 8) Hardbound, ISBN 0-12-474730-2 Reviewed by Dan Fass Simon Fraser University A Computational Model of Metaphor Interpretation, a revised version of Martin's 1988 Ph.D. thesis, describes a computer program called MIDAS that contains an approach 106 Book Reviews to metaphor interpretation based on the \"conventional view\" of metaphor. The conventional view of metaphor, popularized by Lakoff and Johnson (1980), is that many metaphors belong to conceptual classes variously referred to as \"metaphorical concepts,\" \"conceptual metaphors,\" \"conventional metaphors,\" and \"stock metaphors.\" Examples of metaphorical concepts include 'argument is war, time is money,' and 'sad is down.' In the metaphorical concept 'argument is war,' for example, \" 'argument' is partially structured, understood, performed, and talked about in terms of 'war' \" (ibid., p. 5), as in the sentences \"He"]},{"title":"attacked","paragraphs":["every weak point in my argument\" and \"She"]},{"title":"shot down","paragraphs":["all my defenses.\"","The MIDAS program contains a \"knowledge base\" of conventional metaphors; that is, conventional metaphors are explicitly represented in MIDAS's lexicon. The program was part of Berkeley's UC (Unix Consultant) project, which developed a system that gives advice to naive computer users on how to use the Unix operating system. MIDAS was used to interpret and acquire conventional metaphors found in the Unix domain. Many example metaphors in Martin's book are from that domain, but other specialist domains are also considered, notably diseases and ideas. 1. Organization of the Book and Its Basic Ideas According to the preface, the book is about \"the systematic"]},{"title":"representation, use,","paragraphs":["and"]},{"title":"acquisition","paragraphs":["of knowledge about metaphors in the language\" (p. xxii). Chapter 1, which is very clear, summarizes Martin's main ideas and outlines the book's structure. MIDAS has three basic components: 1. The"]},{"title":"lexicon","paragraphs":["of word senses and conventional metaphors, which are represented using the KODIAK knowledge representation language. 2. The"]},{"title":"Metaphor Interpretation System (MIS),","paragraphs":["which interprets metaphors for which there is adequate, explicit knowledge. 3. The"]},{"title":"Metaphor Extension System (MES),","paragraphs":["which acquires \"novel\" metaphors for which there is no adequate knowledge by systematically extending, elaborating, and combining already-known metaphors. (Martin attaches much importance to the acquisition of new metaphors, which he regards as a form of language acquisition.)","Chapter 2 of the book reviews related work on computational approaches to metaphor and word-sense acquisition. Martin critiques what he calls \"knowledge-deficient\" approaches to metaphor interpretation that do not use explicit knowledge of conventional metaphors, but instead use some process of partial matching, inference, or analogy. He suggests that the more successful of these approaches use knowledge of conventional metaphors implicitly.","Chapter 3 describes Martin's view of conventional metaphor. A conventional metaphor is said to consist of a"]},{"title":"source, a target,","paragraphs":["and a set of"]},{"title":"associations","paragraphs":["linking the source and target (p. 36). The target \"consists of the concepts to which the words are actually referring\" (p. 7) while the source \"refers to the concepts in terms of which the intended target concepts are being viewed\" (ibid.). Martin suggests that some conventional metaphors are"]},{"title":"core metaphors","paragraphs":["while others are"]},{"title":"extended metaphors","paragraphs":["(p. 42). A core metaphor is a very general metaphor like non-living-thing-as-living-thing, which contains subparts shared by more specific metaphors. Extended metaphors are so called because they contain their own distinct subparts derived from core metaphors 107 Computational Linguistics Volume 17, Number 1 by various kinds of extension. For example, an extended metaphor might be a specialization of the source of a core metaphor, as with"]},{"title":"non-living-thing-as-plant,","paragraphs":["or a specialization of the target, as with"]},{"title":"process-as-living-thing.","paragraphs":["These core and extended metaphors, Martin argues, can be organized into hierarchies (p. 46) with inheritance of common subparts down those hierarchies.","Chapters 4 through 9 describe the representation, interpretation, and acquisition of conventional metaphors in Martin's model. Chapter 4 explains the representation of knowledge about metaphors in MIDAS's lexicon. Individual conventional metaphors are represented using a KODIAK knowledge structure called a"]},{"title":"metaphor-sense","paragraphs":["(p. 63), and hence contains a source, a target, and a set of associations. Each association is represented using another KODIAK structure called a"]},{"title":"metaphor-map.","paragraphs":["In other words, a metaphor-sense contains a set of metaphor-maps, each one representing an association that links concepts from the source and target. Indeed, \"metaphor-maps represent the building blocks out of which meaningful metaphor-senses are constructed\" (p. 67). Conversely, \"a metaphor-sense.., ties together sets of component metaphor-maps that together constitute a meaningful conventional metaphor\" (ibid.). To give an example: in the conventional metaphor"]},{"title":"non-living-thing-as-living-thing,","paragraphs":["the source is livingthing, the target is"]},{"title":"non-living-thing,","paragraphs":["and an association connects the source and target that a non-living-thing be viewed as a living-thing. This metaphor is represented as a metaphor-sense that contains a metaphor-map for the above association. Metaphor-senses and metaphor-maps are organized into abstraction hierarchies and hence can represent core and extended metaphors.","Chapter 5 describes the process of metaphor interpretation in MIDAS's MIS component. The algorithm for metaphor interpretation is given on page 95 and is designed to reflect Martin's view that literal and metaphorical interpretations have \"equal status\" and \"are evaluated using interpretation mechanisms that are fundamentally the same\" (p. 89). Two basic inference processes are used in interpretation,"]},{"title":"concretion","paragraphs":["and"]},{"title":"metaphoric unviewing,","paragraphs":["either separately or in tandem. Both are based on constraint checking and seek the most specific interpretation of a sentence by selecting an interpretation that most tightly matches the concepts derived from the words of the sentences. Concretion replaces an abstract concept with a more specific one; metaphoric unviewing replaces the source concept in a metaphor with the corresponding target concept.","Chapters 6-9 describe how MIDAS learns new metaphors through its MES component. Learning is achieved by applying three kinds of extension technique to conventional metaphors already in MIDAS's lexicon: combined extension, similarity extension, and core extension. Analogical reasoning is used in the similarity-extension (see p. 147) and core-extension techniques (see p. 170).","Chapter 10 shows that, equipped with suitable conventional metaphors, MIDAS can handle many, varied examples from the metaphor interpretation literature. For instance, Jerry Hobbs' example, \"N is"]},{"title":"at","paragraphs":["zero\" is handled using the conventional metaphor Is-At-Variable-Value (pp. 190-192), Yorick Wilks' \"Britain"]},{"title":"tried to leave","paragraphs":["the Common Market\" is treated using Enter-Association, a type of"]},{"title":"Enter-Metaphor","paragraphs":["(pp. 196-198), and \"My car drinks gasoline\" is interpreted using"]},{"title":"Drinking-Reduce-Amount (pp.","paragraphs":["203-205).","Chapter 11 contains a summary and briefly discusses some problems that Martin sees with his model. The major interpretation problem, according to Martin, is that the model blurs the distinction between conventional metaphors and word senses and that many of his conventional metaphors \"would have been treated as distinct unmotivated word senses in most previous analyses\" (p. 215). I agree, especially in the case for conventional metaphors and verb senses. For example, the conventional 108 Book Reviews metaphor used to interpret \"McEnroe killed Connors\" is Kill-Sports-Defeat, a type of Kill-Metaphor. Other analyses might well postulate Kill-Sports-Defeat as a verb sense rather than a conventional metaphor.","Although the book is well laid out and includes an index (always welcome), it is quite hard to separate instances of metaphor-senses from metaphor-maps in the text. In addition, the numbering of sentence examples is somewhat distracting. Each occurrence of a sentence is numbered separately; hence, for example, \"John gave Mary a cold\" is number (24a), (38a), (43), (45a), (46), and so on. Also, unfortunately, there is a discrepancy in Chapter 3 between the numbering of sentence examples and reference to them in the text -- (11) for (17), (12) for (18), through to (17) for (23) -- but fortunately it only lasts for five pages (pp. 37-42)."]},{"title":"2. Comments","paragraphs":["Martin did his Ph.D. at Berkeley, and his work is influenced by past research there on metaphor, idioms, and fixed phrases by Yigal Arens, Paul Jacobs, George Lakoff, Peter Norvig, Robert Wilensky, and others. Martin's work is probably the most extensive pursuit so far of a computational approach to the interpretation of conventional metaphors (for other approaches see, e.g., Barnden 1989, 1990; Carbonell 1982; Norvig 1989, pp. 609-610) and, it is probably fair to say, represents a step forward in our understanding of metaphor interpretation.","It would have been interesting to have had some discussion of differences between Martin's views of conventional metaphor and those of Lakoff and Johnson. It would also have been interesting to have seen more discussion of the generation of conventional metaphors. MIDAS was linked to a natural language generator in the UC system, which could produce metaphorical sentences using knowledge of conventional metaphors so that when a user employed a conventional metaphor in asking a question, the natural language generator would use the same metaphor in producing the answer (pp. 11-12). Despite this, metaphor generation is barely mentioned, though clearly Martin's model has something to say about this topic, one which has received very little attention from a computational perspective (though see, e.g., Jacobs 1987, pp. 323-324, 348-349).","MIDAS can probably interpret more sentence metaphors than any other existing system, including systems that do not use a conventional view of metaphor. Although it rather looks as if specific conventional metaphors such as Is-At-Variable-Value and"]},{"title":"Drinking-Reduce-Amount","paragraphs":["were added to MIDAS especially for interpreting particular sentences, MIDAS's coverage is a persuasive demonstration of the power of the conventional view of metaphor. However, Martin's description of his model left this reviewer with some questions about the apparent open-endedness of the conventional metaphor approach.","The first question is: how many conventional metaphors are there? The book does not contain a list of the conventional metaphors used in MIDAS. I compiled an informal list of metaphors from the figures, examples, and index given in the book and found 69. Of these, 10 were domain-independent .metaphors, including 7 very general ones. Of the 59 domain-specific metaphors, 19 were from the Unix domain, 12 were about diseases, and 10 concerned the communication of ideas. As can be seen, a large majority of the conventional metaphors were domain-specific ones. If we assume conservatively 10-15 conventional metaphors per domain, that would mean hundreds of metaphors in a system with decent coverage.","The second question is: how are conventional metaphors organized? On page 81, there is a hierarchy of metaphor-maps for the core metaphor"]},{"title":"Non-Living-Thing-","paragraphs":["109 Computational Linguistics Volume 17, Number 1"]},{"title":"As-Living-Thing","paragraphs":["that includes 12 extended metaphors. However, no taxonomies are given for the other very general core metaphors used in MIDAS, which are"]},{"title":"Location-Metaphor, At-State, Have-State, Container-Metaphor, Kill-Metaphor, and Eating-Metaphor.","paragraphs":["Moreover, there is little discussion of the relationship between these core metaphors.","The third question is: is there some way to reduce the enormous number of metaphorical interpretations that MIDAS seeks? Step 3 of the metaphor interpretation algorithm given on page 95 states that MIDAS collects \"all possible interpretations, both metaphorical and literal,\" including presumably direct application of the metaphors in MIDAS's knowledge base plus the use of MIDAS's metaphor extension techniques. Metaphors are sought where there are no constraint violations (p. 104). This is a vast amount of processing, and remember that MIDAS only uses 70 or so metaphors -- a larger system might contain hundreds. Martin might reply that realistic metaphor interpretation does involve an enormous amount of processing. He may be right."]},{"title":"References","paragraphs":["Barnden, John A. (1989). \"Belief, metaphorically speaking.\" In Proceedings, 1st International Conference on Principles of Knowledge Representation and Reasoning, Morgan Kaufmann.","Barnden, John A. (1990). \"Naive metaphysics: A metaphor-based approach to propositional attitude representation (unabridged version).\" Memorandum MCCS-90-174, Computing Research Laboratory, New Mexico State University.","Carbonell, Jaime G. (1982). \"Metaphor: An inescapable phenomenon in natural language comprehension.\" In Strategies for natural language processing, edited by Wendy G. Lehnert and Martin H. Ringle, 415-434. Lawrence Erlbaum Associates.","Jacobs, Paul S. (1987). \"Knowledge-intensive natural language generation.\" Artificial Intelligence, 33, 325-378.","Lakoff, George and Johnson, Mark (1980). Metaphors We Live By. The University of Chicago Press.","Norvig, Peter (1989). \"Marker passing as a weak method for text inferencing.\" Cognitive Science, 13, 569-620. Dan Fass is a visiting fellow at the Centre for Systems Science, Simon Fraser University, Canada. Before this, he worked for three years at the Computing Research Laboratory, New Mexico State University, U.S.A. His Ph.D. is from the University of Essex, England. His research interests include the computer understanding of metaphor and metonymy, lexical ambiguity, machinereadable dictionaries, ill-formed input, and beliefs. Fass's address is Centre for Systems Science, Simon Fraser University, Burnaby, British Columbia, Canada V5A 1S6; e-mail: fass@cs.sfu.ca."]},{"title":"Practical SGML Eric van Herwijnen (CERN)","paragraphs":["Dordrecht: Kluwer Academic Publishers, 1990, xviii + 307 pp. Paperbound, ISBN 0-7923-0635-X, $39.95 Reviewed by Carol Van Ess-Dykema U.S. Department of Defense and Carnegie Mellon University 110"]}]}