{"sections":[{"title":"Antilinguistics: A Critical Assessment of Modern Linguistic Theory and Practice Amorey Gethin","paragraphs":["Oxford: Intellect Ltd, 1990, iii + 275 pp. Hardbound, ISBN 1-871516-00-5, £14.95"]},{"title":"Reviewed by Geoffrey K. Pullum University of California, Santa Cruz","paragraphs":["One danger attendant upon reviewing a book as bad as this knuckle-headed assault on linguists and all they stand for is that one may inadvertently suggest by the length and vehemence of one's commentary that the book is worthy of extended discussion. Another is that by quoting the most strikingly absurd parts of the book the review might give an exaggerated sense of its entertainment value (this is not really a funny book, despite a few howlers). Yet perhaps a brief comment is called for, lest silence imply assent.","I would not dissent from the claim that there is plenty to be criticized in the present state of linguistics. The unjustified pretentions of much generative grammar and the inadequacies of some of its woeful attempts at description merit harsh criticism-- maybe even as harsh as the sort of ridicule and cruelty that I dispense elsewhere (Pullum 1991). But there is no utility in a purported challenge to a whole discipline written by someone who deals in naive panaceas and seems unable to understand the primary literature.","The production of this book is bad enough to make one suspect an amateur job: the page layout is often bad, the style is often awkward, and there are signs of carelessness (for example, beyond p. 180 every page number the index gives is incorrect). But the content is far worse. Sophomoric blunders abound: underlying constituent order confused with what speakers \"start with ... in their heads\" and surface structure with \"what they actually say\" (p. 30); innate general language acquisition mechanisms confused with innate rules for English grammar (p. 46); uncomprehended formulae botched (the arrowless \"transformation\" on p. 23, for example); well-known names are wrong (\"Deidre Wilson,\" pp. 28, 275; \"James Fodor,\" p. 195n; etc.); in a book on this level it is no surprise to find the old chestnut about the Eskimos' many words for snow turning up yet again (p. 221).","Gethin argues that modern linguistics is a jumble of cabalistic nonsense, and can be swept away by the simple truth that the key to everything is meaning. Language acquisition is no puzzle: people learn meanings \"by observation and imitation,\" and they \"join individual meanings together so that they make larger meanings\" (p. 9). That is all one needs to know about language; but modern linguists are afflicted with a \"systematizing mania that pretends to discover new profundity in what everybody knows already\" (pp. 11-12); they fail to see that \"there is no such thing as structure in language\" (p. 93). \"There is no mystery\" (p. 108), there is only meaning.","The targets of the book's ad hominem attacks include not only (of course) Noam Chomsky, but also an odd assortment of popularizers and interpreters. In fact, the bibliography is almost entirely restricted to secondary and tertiary sources like magazine articles, radio interviews, and pop science books, which exacerbates misreadings (see e.g.p. 187, where Gethin discusses a paraphrase by Jeremy Campbell of some remarks 240 Book Reviews by Ray Jackendoff adapting ideas of Noam Chomsky--Gethin's reader is four steps removed from the primary source). Neil Smith and Deirdre Wilson come in for an uncommon amount of hostility for their pro-Chomskyan paperback (1979). Surprisingly, Gethin also assaults Randolph Quirk and his colleagues, slamming their monumental descriptive work on modern English (1985) as if it were just so much more transformationalist drivel (pp. 75-89). One senses some score-settling with prestigious linguists at British universities.","When by chance Gethin gets hold of the linguistic ball for a moment, he unfailingly drops it. For example, asserting that all ambiguity is lexical ambiguity, he claims (p. 25) that Flying planes can be dangerous is only ambiguous \"because '-ing' has more than one meaning\" (the wrong morpheme to pick, of course; if he had located the ambiguity in the transitive/intransitive contrast in fly, he might have gotten a few people to listen). Prompted by some remarks of Smith and Wilson to discuss the possibility that some syntactic constraints could be relocated in the lexicon, he insists on depicting the linguists as bad guys: \"it is beneath them,\" he avers without evidence, \"to recognize that the only thing really at stake is how it is best to organize a dictionary\" (not a word about the numerous computational and theoretical linguists who work intensively on dictionary organization and lexical regularities and regard that work as important).","The book contains seemingly endless stretches of similar anti-syntax rant. Gethin pounds home repeatedly his plain man's view that all you really need to know is that words have meaning. Scores of example sets that Chomsky uses to illustrate syntactic problems are dismissed with comforting tautologies about meaning: we can ignore the syntax of control in purpose clauses because \"part of learning English is learning that 'for' expressions mean what they mean--that is all\" (p. 43); the Coordinate Structure Constraint is not needed to block *This boy, I want to invite this girl and to my party because the examples violating it \"are using 'and' in a very peculiar way that nobody would ever want to use it in real life\" (p. 56); the facts about wh-extraction from comparative clauses embedded in interrogatives can be disregarded because \"People form questions, or any language, to say what they want to say\" (p. 58); and so on.","It is all so simple, he begs us to believe: \"I am simply saying that meaning is meaning and without meaning there is no meaning\" (p. 97). It doesn't matter that meanings may be hard to tie down. Infinitival to, for example, \"has the meaning of to-ishness, and we can't define that, but we all (English speakers) know exactly what it means\" (p. 105); so much for the syntax of infinitival complements.","For philosophers, Gethin has some more striking assertions: that language, far from being a window on the mind, only corrupts us and obstructs our thinking (chapters 10 through 12); that there was no such thing as Nazi Germany, \"there are only particular individuals who do particular things on particular occasions\" (pp. 224-5); that \"we and everybody else would almost certainly be much better off if we were still in the trees, like the gorillas\" (p. 247); and much more. And for the computational linguist, pp. 247-249 contains a brief attack on computers as models of cognition (nothing original; just a casual paraphrase of Searle's Chinese room argument and an assertion due to Weizenbaum; no references).","I suppose nothing will convince Gethin that I am not just another corrupt defender of modern linguistics, covering up the failings of my discipline to protect my livelihood, maligning his crusade out of fear of being exposed. But no, I agree that much is wrong with modern linguistics, and with the Chomskyan paradigm in particular; I urge linguists to work on bringing to their discipline more of the rigor, applicability, and computational relevance it is often falsely credited with. They will only be wasting time if they stop to read Gethin's farrago of nonsense first. 241 Computational Linguistics Volume 17, Number 2","References","Pullum, Geoffrey K. (1991). The great Eskimo vocabulary hoax and other irreverent essays on the study of language. Chicago: The University of Chicago Press.","Quirk\" Randolph; Greenbaum, Sidney; Leech, Geoffrey; and Svartvik\" Jan (1985). A comprehensive grammar of the English language. London: Longman.","Smith, Neil, and Wilson, Deirdre (1979). Modern linguistics: The results of Chomsky's revolution. Harmondsworth: Penguin Books. Geoffrey K. Pullum is Professor of Linguistics at the University of California, Santa Cruz. He has published over a hundred articles in general, mathematical, and computational linguistics, and a dozen books, the latest being the third volume of Handbook of Amazonian Languages (ed. with Desmond C. Derbyshire, 1991), and The Great Eskimo Vocabulary Hoax (1991), a collection of scurrilous and irresponsible essays about linguists and their sins. Pullum's address is: Linguistics, UCSC, Santa Cruz, CA 95064; e-mail: gkp@ling.ucsc.edu 242"]}]}