{"sections":[{"title":"  The Acquisition of Imperfective Aspect Marking in Korean as a Second Language by Japanese Learners ","paragraphs":["Ju-yeon Ryua , Kaoru Horieb , and Yasuhiro Shiraic  a","Department of Cross-cultural Education, Tohoku University, 41 Kawauchi, Aoba-ku, Sendai, 980-8576 Japan","juyeon1212@mail.tains.tohoku.ac.jp b Department of Applied Linguistics, Nagoya University,","Furo-cho, Chikusa-ku, Nagoya-shi, Nagoya, 464-0601 Japan","horie@lang.nagoya-u.ac.jp c Department of Linguistics, University of Pittsburgh, 2801 Cathedral of Learning Pittsburgh, PA 15260","yshirai@pitt.edu Abstract. This paper investigates the developmental process through which L2 learners acquire two „imperfective‟ aspect markers in Korean, -ko iss- (progressive and resultative) and -a iss- (resultative) which attempts to identify language-general and language-specific patterns in the L2 acquisition of the Korean imperfective aspect by Japanese learners by comparing the results with previous research. Study 1 collected cross-sectional data from 55 Japanese learners of Korean as a foreign language and 18 Korean native speakers. The results show that the acquisition order was as follows: the progressive -ko iss- → the resultative -ko iss- → the resultative -a iss-. Study 2 examined the influence of instruction order by testing two groups of learners that were taught aspect markers in different orders. The results show that the order of instruction did not yield significant differences except in the rate of accuracy of the resultative marker -a iss- in the comprehension task. Keywords: Second language acquisition, Korean imperfective markers, L1 transfer, prototype, instruction order, pedagogical conditions   The work reported in this paper was supported in par by the fellowship from the Tohoku University International","Advanced Research and Education Organization.  Copyright 2010 by Juyeon Ryu, Kaoru Horie, and Yasuhiro Shirai"]},{"title":"1 Introduction","paragraphs":["It has been observed that there is a strong association between the inherent aspect of verbs and the acquisition of tense-aspect morphology. The acquisition of tense-aspect morphology has shown an interesting universal pattern in both first and second language acquisition (Andersen & Shirai, 1996). This universal tendency is referred to as the Aspect Hypothesis (Andersen & Shirai, 1994), which claims that there is a universal developmental sequence of tense-aspect markers: past tense form starts with achievement verbs, and progressive starts with activity verbs.","The Aspect Hypothesis has been verified through various cross-linguistic studies (see Bardovi-Harlig, 2000; Shirai, 2009 for a review). The studies of Asian languages have not only verified the Aspect Hypothesis (e.g. Shirai & Kurono, 1998) but also extensively investigated how imperfective aspect is acquired (see Li & Shirai, 2000 for the L1 acquisition of Chinese zai and zhe; Ishida, 2004, Sugaya & Shirai, 2007 for the L2 acquisition of Japanese -te i-). As for the L2 acquisition of Japanese imperfective aspect, it has been observed that -te i- appears first with activities for the progressive use and expands to achievements for result state use, with the PACLIC 24 Proceedings 677   assumption of progressive meaning as the prototype of -te i- (Shirai & Kurono, 1998). An early study of L2 Korean (Lee & Kim, 2007) found that the progressive -ko iss- developed earlier than the resultative -ko iss- and -a iss- in L1 English learners of Korean.","This study tests whether this arguably universal developmental pattern (the progressive is acquired earlier than the resultative) holds true for the L2 acquisition of Korean by Japanese learners, and in addition, this study surveys the influence of instructional order and acquisition order on the L2 acquisition of Korean imperfective aspect."]},{"title":"2 The Imperfective Aspect System in Korean","paragraphs":["Imperfective aspect markers in Korean can express two meanings: the progressive and the resultant state (Martin, 1992). When expressing an action-in-progress meaning, Korean takes -ko iss- as the progressive marker. Meanwhile, when expressing a resultant state meaning, Korean takes -ko iss- or -a iss-. Syntactically, when expressing a resultative state, -ko iss- and -a iss-show a complementary distribution depending on the transitivity of the main verbs, as shown in Table 1: -ko iss- co-occurs with transitive verbs, whereas -a iss- co-occurs with intransitive verbs (Lee, 1991).  "," -ko iss- has been generally treated as a progressive marker similar to the English progressive marker be -ing, as shown in (1a). However, it is not obligatory to employ the Korean -ko iss- to describe an ongoing event, unlike English be -ing and the Japanese -te i-. The simple present form in Korean in fact can encode an ongoing event like the Romance and other languages, as shown in (1a) and (1b).  (1a) Ku-ka talli-ko iss-ta (1b) Ku-ka talli-n-ta","he-Nom run-Prog-Dec he-Nom run-Prs-Dec","“He is running” “He is running”  In addition to its progressive meaning, -ko iss- can also describe a resultant state with transitive verbs such as verbs of wearing, carrying, and body posture (Lee, 1991). In (2), -ko iss- can be interpreted either as an ongoing event or a resultant state. This is because in the case of transitive verbs only -ko iss- can be chosen as the imperfective aspect marker in both cases of describing the progressive and the resultant state.  (2) Ku-ka moca-lul ssu-ko iss-ta he-Nom hat-Acc wear-Resl-Dec","“He is wearing a hat.” or “He is putting on a hat”  -a iss- has been found to be the resultative marker in Korean (Martin, 1992). However, whereas - ko iss- is compatible with transitive verbs, -a iss- can co-occur only with intransitive verbs in describing a persisting state resulting from a completed action, as in (3).  (3) Ku-ka chimtay-ey nwu-e iss-ta he-Nom bed-Loc lie-Resl-Dec “He is lying in bed.”  678 Student Papers   Since the participants in this study are Japanese learners of Korean, we need to describe the aspectual system of Japanese as compared with Korean. Table 2 shows comparison of Japanese and Korean imperfective aspect markers by inherent aspect of attached verbs. In this study, the four categories of inherent aspect of verbs are derived from Vendler (1967).  "]},{"title":"3 Previous studies on the acquisition of aspect","paragraphs":["Previous studies on the acquisition of tense/aspect have claimed that the development of tense/aspect morphology in L2 acquisition is strongly influenced by the inherent semantic aspect of the verbs to which the inflections are attached. This hypothesis, generally referred to as the Aspect Hypothesis (Andersen & Shirai, 1994, 1996; Shirai, 1991; Bardovi-Harlig, 2000; Li & Shirai, 2000), has as its central claims the following:  1. Past or perfective marking spreads from achievement and accomplishment to activities and","states. 2. In languages that distinguish the perfective-imperfective aspect, perfective past precedes","imperfective past. The imperfective starts with states and gradually spreads to activity and","telic verbs. 3. Progressive marking proceeds from activity to accomplishments or achievements.","Progressive is acquired earlier than past. 4. Progressive marking is not incorrectly overextended to statives.  In the acquisition of tense-aspect morphology, Shirai and Andersen (1995) proposed that the association observed between inherent aspect and verb morphology in L1 and L2 acquisition can be characterized as the development from prototypical to peripheral members. For example, the prototypical progressive that is first acquired by learners is „action-in-progress‟. This action-in-progress meaning is obtained when the progressive marker is attached to activity verbs and accomplishment verbs. However, progressive meaning with accomplishment verbs has been shown to be slower in development than with activity verbs, at least in L1 acquisition of English (Shirai 1991). Shirai and Andersen (1995) attributed this observation to the possibility that initial progressive morphology in English is strongly associated with [− telic] and [+dynamic] by comparing semantic features of activity verbs ([− punctual], [− telic], [+dynamic]) and accomplishments verbs ([− punctual], [+telic], [+dynamic]).","Several studies have addressed the questions concerning the prototype of the imperfective and how it is expanded (see Li & Shirai, 2000 for the L1 acquisition of Chinese zai and zhe; Shirai & Kurono, 1998 for the L2 acquisition of Japanese -te i-; Lee & Kim, 2007 for the L2 acquisition of Korean -ko iss- and -a iss- ). Shirai and Kurono (1998) tested the Aspect Hypothesis using L2 Japanese by L1 Chinese learners. It was observed that the Japanese imperfective aspect marker -te i- is strongly associated with activities in the progressive then with achievements for resultant states. Their study also indicated that learners have much difficulty acquiring the resultative meaning of -te i-. Although a few cases were reported of the PACLIC 24 Proceedings 679   opposite difficulty order (Ishida, 2004; Shibata, 1999), the majority of observations so far generally reach consensus that progressive meaning is easier than resultative meaning of -te i- in L2 Japanese (see Sugaya & Shirai 2007 for a thorough treatment of this issue).","In L2 Korean acquisition, Lee and Kim (2007) tested the Aspect Hypothesis in L1 English learners of L2 Korean, focusing on the imperfective aspect system and comparing the developments of the imperfective periphrastic constructions: the progressive -ko iss- and the resultative -ko iss-, and the resultative -a iss-. They collected cross-sectional data from 120 L1 English learners of L2 Korean using a sentence interpretation task and a guided picture description task. They found that the progressive -ko iss- was acquired earlier than the resultative -ko iss-/-a iss-. This shows the same developmental pattern as was found in Shirai and Kurono (1998): resultative marking is more difficult to acquire than progressive marking.","Lee and Kim (2007), however, failed to clarify the acquisition pattern between two „resultative‟ aspect markers, i.e. -a iss- and –ko iss-. They found a conflicting results in the acquisition patterns of the two „resultative‟ aspect markers; -a iss- and -ko iss- in their two different tasks. Moreover, Lee and Kim (2007) investigated only L1 English learners. In order to claim universal status for the developmental pattern, research must cover the acquisition of other source languages, too.","This study (study 1) aims to broaden the previous research, and examines the acquisition pattern of L1 Japanese learners, wherein we will test the predicted universal acquisition pattern comparing the data of L1 Japanese and L1 English learners. Moreover, this study (study 1) investigates how the resultative markers are acquired, by comparing the development of resultant state -ko iss- and -a iss- markers that were not made clear in earlier studies.","Furthermore, this study (study 2) verifies the effect of instructional order on the L2 acquisition of the imperfective aspect system. We surveyed the pedagogical conditions of Japanese learners in our study and those of English learners reported in Lee and Kim (2007) by analyzing the textbooks used and found that both groups of learners were introduced to the progressive -ko iss- first (first-year Korean), with the resultative -a iss- being introduced later (second-year Korean). Since this instructional order was used in both situations, it is not improbable that the progressive was acquired earlier than the resultative simply because the progressive was introduced earlier than the resultative. Thus, closer attention must be paid to the correlation between acquisition order and instruction order.","In addition, research done by Ishida (2004) found that L1 English learners of Japanese initially used -te i- as a resultative aspect marker more accurately than as a progressive, which disagrees with the idea of a universal developmental pattern. Ishida‟s learners were exposed to the resultative state -te i- long before the progressive -te i- was introduced, unlike in conventional curriculums. This study (study 2) investigates whether or not the instructional order influences the order of L2 Korean imperfective aspect acquisition by Japanese learners."]},{"title":"4 Study 1 4.1 Method and Participants","paragraphs":["We employed a cross-sectional design and used two different tasks, which were originally used by Lee and Kim (2007), one an interpretation task focusing on comprehension, and the other a sentence completion task which focused on production. In the interpretation task, the participants were asked to select the best matching picture for the sentence from three choices that were supplied. In the sentence completion task, the participants were asked to fill in the blanks with the appropriate inflected forms of the given infinitive verbs. The data were collected from 55 L2 Korean learners and 18 Korean native speakers. The 55 students were studying at the Korean Education Center in the Korean Consulate General in Sendai, Japan (age range = 27-63, mean age = 49.5). We divided the participants into three groups according to their proficiency level."]},{"title":"4.2 Results","paragraphs":["680 Student Papers  "]},{"title":"4.2.1 Sentence Interpretation Task","paragraphs":["The overall results appear in Table 3, which presents the accuracy of interpretation of the three aspect types. The data sets were analyzed by a repeated-measures ANOVA with the three aspect types as a within-subject factor and the proficiency levels as between-subject factors. A one-way repeated-measures ANOVA revealed there was a significant difference found between the three aspect types, F (2,108) =17.51, p < .01.   78.8 69.1","88.3","85.9 81.8","93.3 89.1 90.0 96.7 40 50 60 70 80 90 100 Beginnig Intermediate Advanced Resultative -a iss- Resultative -ko iss- Progressive -ko iss- ","Figure 1 Group mean scores of the comprehension task"," Table 4 and Figure 1 present the mean scores of the groups divided by level. We can see that the accuracy of the progressive -ko iss- was higher than the others within all levels. Furthermore, the accuracy of resultative -a iss- was the lowest of the three markers. This can be interpreted to mean that the progressive -ko iss- develops earliest in the three imperfective aspect markers, and that the resultative -a iss- develops most slowly."]},{"title":"4.2.2 Guided Production Task","paragraphs":["The overall results appear in Table 5. As Table 5 shows, target aspect marking was the most frequent in the progressive -ko iss-: 56.2%. However, the differences in frequencies of use between the two resultatives were small, 40.2% versus 41.4%. A one way repeated measures ANOVA was performed on the production score. We found that the differences between the three aspect markers were significant, F (2,108) = 6.31, p<.01. However, the results of a comparison of each pair by the Bonferroni method showed that the differences between the resultant -ko iss- and the resultant -a iss- were not significant, p = 1.00.  PACLIC 24 Proceedings 681      Figure 2 Group mean scores of the production task"," Table 6 and Figure 2 present the group mean scores divided by level. As can be seen, the progressive -ko iss- was more frequent than the other forms, within all levels. However, we cannot tell whether the resultative -ko iss- or -a iss- is more frequent.","In order to have more understanding of the acquisition pattern of the two resultatives, we examined the individual usage patterns. Table 7 shows which resultative marker the learners used in the resultant state target context. Adding the “exclusive” and “over-users” together in the separate -ko iss- and -a iss- categories, we can see that 14 learners over-generalized -ko iss-, and 7 learners over-generalized -a iss-. There were two times as many learners who over-generalized -ko iss- as there were learners who over-generalized -a iss-.","An examination of individual data thus revealed that Japanese learners are more likely to expand the use of -ko iss- from progressive to resultative than the resultative -a iss- to progressive use. Moreover, this may suggests that Japanese learners analogize from their L1 -te i- and expand the prototypical meaning of -ko iss- to the resultant state by the influence of L1 transfer.  682 Student Papers  ","In summary, the group data and the individual usage pattern data from the production task showed that learners tend to overgeneralize -ko iss- when they acquire the resultant state meaning. This suggests that the resultant -ko iss- is acquired earlier than the resultant -a iss-. Therefore, we argue that the sequence of acquisition is indeed: the progressive -ko iss- → the resultative -ko iss- → the resultative -a iss- ."]},{"title":"5 Study 2 5.1 Method and Participants","paragraphs":["We used the same tasks as the study 1. We tested two groups that were given different instructional order. We divided the same level‟s participants into two groups. The Resultative Group (n=18) was taught the resultative aspectual markers (-ko iss-/-a iss-) before the progressive unlike in conventional curriculums, and the Progressive Group (n=15) was taught the progressive marker -ko iss- first as the opposite order.","The learners of two groups were taught one aspectual meaning (the progressive or the resultative) first. The other meaning was introduced four months later in the same manner as Ishida (2004). At the end of the eight-month classroom study, a comprehension task (picture selection) and a production task (verb-form change) were employed. The 33 students were studying at the Korean Education Center in the Korean Consulate General in Sendai, Japan (age range = 27-59, mean age = 45.7). They were taking the second-year Korean language course."]},{"title":"5.2 Results","paragraphs":["The results (Tables 8, 9, 10) show that for most between-group and within-group comparisons, there was no significant difference. That is, there are few effects of instructional order.     ","However, in the comprehension task the Resultative Group outperformed the Progressive Group (p < .05) in the accuracy of the resultative marker -a iss-. Meanwhile, the Progressive PACLIC 24 Proceedings 683   Group showed significantly higher accuracy with the progressive marker -ko iss- and the resultative marker -ko iss- than the resultative –a iss- (p < .05). Both findings suggest instruction order to have a positive effect on the acquisition of the resultative marker -a iss- in the comprehension task.","Though not statistically significant, the fact that both groups performed better with the resultative -ko iss- than the progressive -ko iss- warrants further inquiry into the form-meaning mapping of aspectual markers between Korean and Japanese (Table 2) and focus-on-form teaching of the resultative -ko iss-. We attempted to examine this issue by surveying the pedagogical conditions of Korean imperfective markers. What we found was that the resultative -ko iss- was not explained explicitly as a particular function of grammar, and was exposed only through lexical expressions that described clothes with wearing verbs. Thus, it is safe to presume that the overall accuracy rate of the resultative -ko iss- increased significantly due to L1 transfer and being triggered by focus-on-form teaching.","Finally the results of our study support the Aspect Hypothesis because the accuracy rate for the typical resultative marker -a iss- was still lower than that for the progressive in spite of the possible effect of the order of instruction."]},{"title":"6 Conclusion","paragraphs":["In the present study, we observed a general pattern in the L2 acquisition of Korean imperfective aspect by Japanese learners: the progressive was acquired earlier than the resultative, which is consistent with previous research on the acquisition of dynamic imperfective marking in Japanese and Korean. Regarding the acquisition of Korean aspect markers -ko iss- and -a iss- by Japanese learners, we found that the acquisition order was the progressive -ko iss- → the resultative -ko iss- → the resultative -a iss-. We attribute this latter finding to L1 transfer from Japanese.","As for the effect of instructional order on the acquisition of the Korean imperfective aspect by Japanese learners, there were no significant differences observed except in the accuracy rate of the resultative marker -a iss- in the comprehension task. That is, the group who was taught the resultative first and the progressive later performed well on the comprehension of the resultative marker -a iss-."]},{"title":"References","paragraphs":["Andersen, R.W. and Shirai,Y. (1994). Discourse motivations for some cognitive acquisition principles. Studies in Second Language","Acquisition 16: 133-156. Andersen, R.W. and Shirai,Y. (1996). The primacy of aspect in first and second language acquisition:The pidgin-creole connection. In W C","Ritchie and T K Bhatia (eds.), Handbook of Second Language Acquisition, 527-570. San Diego, CA: Academic Press. Bardovi-Harlig, K. (2000). Tense and aspect in second language acquisition: Form, meaning, and use. Oxford: Blackwell. Ishida, M. (2004). The effect of recasts on acquisition of aspect in Japanese as a foreign language. Language Learning, 54: 311-394. Lee, E.H. and Kim, H.Y. (2007). On cross-linguistic variations in imperfective aspect: The case of L2 Korean. Language Learning 57:4,","651-685 Lee, H.S. (1991). Tense, aspect and modality: A discourse-pragmatic analysis of verbal suffixes in Korean from a typological perspective.","Unpublished doctoral dissertation, University of California, Los Angeles. Li, P., & Shirai, Y. (2000). The acquisition of lexical and grammatical aspect. Berlin: Mouton de Gruyter. Martin, S. (1992). A reference grammar of Korean. Tokyo: Charles E. Tuttle Company. Shibata, M. (1999). The use of Japanese tense-aspect morphology in L2 discourse narratives. Acquisition of Japanese as a Second","Language, 2: 68-102. Shirai, Y. (1991). Primacy of aspect in language acquisition: Simplified input and prototype.Unpublished doctoral dissertation, University","of California, Los Angeles. Shirai, Y. (2009). Temporality in first and second language acquisition. In W. Klein & P. Li (Eds.), The expression of time (pp. 167-193).","Berlin and New York: Mouton de Gruyter. Shirai, Y. and Andersen, R. W. (1995). The a cquisition of tense/aspect morphology: A prototype account. Language 71: 743-62 Shirai, Y. and Kurono, A. (1998). The acquisition of tense-aspect marking in Japanese as a second language. Language Learning 48: 245-","279 Sugaya, N. and Shirai, Y. (2007). The acquisition of progressive and resultative meanings of the imperfective aspect marker by L2 learners","of Japanese. Studies in Second Language Acquisition 29: 1-38. 684 Student Papers"]}]}