{"sections":[{"title":"","paragraphs":["The acquisition of word order in a topic-prominent language:","Corpus findings and experimental investigation",""," Thomas Hun-tak Lee Chinese University of Hong Kong PACLIC 24, Tohoku University, Sendai, Japan November 4-7, 2010  It is well-known that Chinese has SVO as predominant word order, with variant orders OSV and SOV marking topic and focus, intimately linked to the topic-prominence of the language. Assuming early setting of the head parameter in syntactic acquisition and the peripheral positions of topic and focus in clausal structure, one might hypothesize that Chinese-speaking children will acquire the predominant SVO order early, but develop the variant orders later. Such acquisition findings, if true, would seemingly go against the idea of a topic prominence parameter. This paper explores the development of topic prominence by examining word order in early child Chinese, based on naturalistic longitudinal corpora as well as cross-sectional experiments that investigated the relative accessibility of different word orders.  Our naturalistic data show that the word order of two-year-old Chinese children reflects adherence to canonical mapping of thematic roles to structural \\positions, as well as sensitivity to the unselectivity of subject and object. While sentences of OSV order appeared around two years of age, double nominative structures were virtually absent before three, suggesting that as a typological characteristic, topic-prominence is not acquired early. Our experimental results show that Mandarin-speaking children by three years of age have established SVO solidly as the dominant word \\order, on both comprehension and production, but still find the topicalized and fronting orders (OSV, SOV) difficult, indicating that the structures of the left periphery may be acquired at a later stage, and at different times. The implications of these acquisition findings for the topic prominence parameter will be explored.    PACLIC 24 Proceedings 15"]}]}