{"sections":[{"title":"Basic U\\bi\\ts of \\fexico\\bs a\\bd O\\b\\tologies: Words, Se\\bses a\\bd Co\\bcep\\ts","paragraphs":["∗∗∗∗   Hee-Rah\\b \\thae  Depa\\ftment of Linguistics and \\tognitive Science, Han\\bu\\b Unive\\fsity of Fo\\feign Studies Wangsan-\\fi, Mohyeon-myeon, Yongin-si, Gyeonggi-do 449-791, Ko\\fea h\\fchae@hufs.ac.\\b\\f  Abs\\trac\\t. Dictiona\\fies and ontologies a\\fe ve\\fy impo\\ftant \\fesou\\fces not only fo\\f linguistic \\fesea\\fch and applications but also fo\\f othe\\f a\\feas dealing with \\bnowledge. In gene\\fal, howeve\\f, they fall sho\\ft of ou\\f expectations. One \\feason fo\\f this unde\\f-expectation is that thei\\f basic units a\\fe not well-established. Dictiona\\fy head wo\\fds have to be wo\\fds \\fathe\\f than affixes o\\f ph\\fases. The meaning of a (head) wo\\fd has to be ca\\fved into diffe\\fent senses on the basis of objective c\\fite\\fia. In addition, building bloc\\bs of ontologies have to be (simple and/o\\f complex) concepts \\fathe\\f than senses. Keywords: Lexicons/Dictiona\\fies, Ontologies, Head wo\\fds, Senses, \\toncepts.","\\t \\t ∗ This wo\\f\\b was suppo\\fted by a 2010 \\fesea\\fch g\\fant f\\fom Han\\bu\\b Unive\\fsity of Fo\\feign Studies.  \\topy\\fight 2010 by Hee-Rah\\b \\thae."]},{"title":"1 I\\b\\troduc\\tio\\b","paragraphs":["Lexicons/Dictiona\\fies have been one of the most impo\\ftant \\fesou\\fces fo\\f linguistic \\fesea\\fch and applications. Ontologies a\\fe also becoming an indispensible \\fesou\\fce not only fo\\f linguistics but also fo\\f othe\\f a\\feas dealing with \\bnowledge. In many cases, howeve\\f, they fall sho\\ft of ou\\f expectations. One \\feason fo\\f this unde\\f-expectation is that thei\\f basic units a\\fe not wellestablished. The\\fe a\\fe two \\binds of basic units of dictiona\\fies: head wo\\fds and (wo\\fd) senses. It is a t\\fuism that head wo\\fds have to be wo\\fds \\fathe\\f than affixes o\\f ph\\fases. Howeve\\f, it is not always t\\fue that only wo\\fd units a\\fe \\fegiste\\fed as head wo\\fds, especially in the dictiona\\fies of agglutinative languages. In addition, the meaning of a wo\\fd has to be ca\\fved into diffe\\fent senses on the basis of objective c\\fite\\fia. On the othe\\f hand, building bloc\\bs of ontologies have to be (simple and/o\\f complex) concepts \\fathe\\f than senses.","In section 2, we will evaluate the mo\\fpho-syntactic status of head wo\\fds in a Ko\\fean dictiona\\fy. It will be shown that many head wo\\fds a\\fe ph\\fases and, hence, have to be \\femoved f\\fom the list of head wo\\fds. In addition, many elements that a\\fe t\\feated as affixes a\\fe actually wo\\fds and, hence, have to be \\fegiste\\fed as head wo\\fds. We need to \\fealize that agglutinative languages li\\be Ko\\fean have many clitics, i.e. (syntactic) wo\\fds which have some affixal p\\fope\\fties as well. In section 3, we will conside\\f issues \\felated to polysemy. We need to distinguish between homophony and polysemy, on the one hand, and between polysemy and vagueness, on the othe\\f. Lastly, in section 4, we will conside\\f basic units of ontologies. Some schola\\fs a\\fgue that they have to be wo\\fd senses \\fathe\\f than concepts. Howeve\\f, many schola\\fs assume that they have to be concepts \\fathe\\f than senses. We will show, based on a va\\fiety of phenomena, that the building bloc\\bs of ontologies should be concepts."]},{"title":"2 The Morpho-sy\\b\\tac\\tic S\\ta\\tus of Dic\\tio\\bary Head Words","paragraphs":["Basic building bloc\\bs of dictiona\\fies a\\fe thei\\f head wo\\fds. It is \\fathe\\f simple to identify wo\\fd units in such inflectional languages as English. Howeve\\f, the tas\\b is not so easy in such PACLIC 24 Proceedings 35  agglutinative languages as Ko\\fean. One \\feason fo\\f this difficulty lies in the fact that Ko\\fean has va\\fious types of “little wo\\fds/pa\\fticles” which a\\fe dependent on othe\\f elements phonologically but should be analyzed as wo\\fds syntactically. These pa\\fticles a\\fe called “clitics,” i.e. “g\\fammatical units with some p\\fope\\fties of inflectional mo\\fphology and some of independent wo\\fds” (Zwic\\by 1977, Zwic\\by & Pullum 1983, Zwic\\by 1985, etc.). Although clitic elements abound in Ko\\fean (Kuh 1988, \\thae & No 1998, \\thae 2005, \\thae 2007), t\\faditional app\\foaches have not given due attention to thei\\f existence. \\tonsequently, many (clitic) wo\\fds have not been conside\\fed as head wo\\fds.","In gene\\fal, multi-mo\\fpheme wo\\fds a\\fe composed of \\foots, de\\fivational affixes and/o\\f inflectional affixes, and have a mo\\fphotactic st\\fuctu\\fe of the following: ","(1) inflectional p\\fefix - de\\fivational p\\fefix - \\foot - de\\fivational suffix - inflectional suffix"," De\\fivational affixes a\\fe positioned inside of inflectional affixes. In Ko\\fean, howeve\\f, many elements which a\\fe neithe\\f de\\fivational affixes no\\f inflectional affixes can also be pa\\fts of those composite wo\\fds (\\thae 2007: 805): ","(2) a. [sensayng-nim -tul]-hanthey-man-un","teache\\f Hon Pl to only Top/\\tont\\f ‘only to the teache\\fs’ b. [cap -hi -si -ess -\\beyss -ta] -\\bo -yo","catch Pass Hon Past Modality Decl IQuot Hon","‘(It is said) that he (Hon) might have been caught.’  In these examples, [sensayng-n\\b\\t-tu\\f] and [cap-h\\b-s\\b-ess-keyss-ta] consist of \\foots (sensayng and cap-), de\\fivational affixes (-n\\b\\t and -h\\b) and inflectional affixes (-tu\\f, -s\\b, -ess, -keyss and - ta), which can be safely assumed to be wo\\fd-inte\\fnal elements. Howeve\\f, the elements outside the b\\fac\\bets can ha\\fdly be analyzed as eithe\\f de\\fivational o\\f inflectional affixes.","\\thae (2007) defines the elements outside the b\\fac\\bets in (2) as clitics, which have p\\fope\\fties of both inflectional affixes and independent wo\\fds. Depending on whethe\\f they have mo\\fe p\\fope\\fties of inflectional affixes o\\f of independent wo\\fds, clitics can be divided into seve\\fal subtypes (Nevis 1985, Nevis et al. 1994):","","(3) Ph\\fasal Affixes / Edge Affixes - Bound Wo\\fds - Obligato\\fy Leane\\fs"," As fo\\f the clitics in Ko\\fean, case ma\\f\\be\\fs can be defined as ph\\fasal affixes (\\thae 1991/2000), and postpositions and delimite\\fs a\\fe gene\\fally analyzed as bound wo\\fds, i.e. typical clitics.","Since clitics a\\fe not phonologically independent, we can easily distinguish them f\\fom \\fegula\\f independent wo\\fds. Howeve\\f, it is not so easy to distinguish clitics f\\fom affixes, because both of them a\\fe dependent on othe\\f elements. Zwic\\by & Pullum (1983) p\\fovide a list of diffe\\fences between wo\\fd-clitic combinations and stem-affix combinations. The main cause fo\\f these diffe\\fences is that the fo\\fme\\f, as a combination of two (syntactic) wo\\fds, a\\fe gove\\fned by syntactic p\\finciples, whe\\feas the latte\\f, as wo\\fds consisting of wo\\fd-inte\\fnal mo\\fphemes, a\\fe by mo\\fphological/lexical p\\finciples. Based on this fact, \\thae (2007: 809) p\\foposes that clitics, compa\\fed with affixes, can be cha\\facte\\fized as having the following p\\fope\\fties:","","(4) a. Have highe\\f p\\foductivity than affixes in combining with p\\feceding elements.","b. \\tombine with ph\\fases o\\f clauses \\fathe\\f than wo\\fd stems.","c. Whose p\\feceding elements themselves can be modified by othe\\f ph\\fases."," The “p\\feceding elements” in (c) indicate the “hosts” of clitics. These p\\fope\\fties of clitics will be used as main c\\fite\\fia fo\\f distinguishing clitics f\\fom affixes when we a\\fe going to analyze a 36 Invited and Plenary Talks st\\fing of multiple elements in Ko\\fean. Unde\\f the f\\famewo\\f\\b of \\thae (2007), Bai\\b & \\thae (2010b) and \\thae & Bai\\b (2010) evaluate the mo\\fpho-syntactic status of nominal ent\\fies and p\\fedicative ent\\fies, \\fespectively, of a \\fep\\fesentative medium-size Ko\\fean dictiona\\fy, i.e. Yonse\\b Korean D\\bct\\bonary. We found out two types of p\\foblematic cases. Fi\\fstly, many ph\\fasal elements a\\fe w\\fongly \\fegiste\\fed as headwo\\fds. Secondly, some elements a\\fe not \\fegiste\\fed as headwo\\fds because they a\\fe w\\fongly analyzed as affixes. Among the nominal and p\\fedicative headwo\\fds of the dictiona\\fy, many ent\\fies li\\be the following have to be analyzed as \\fegula\\f ph\\fases:"," (5) Regula\\f Ph\\fases as (W\\fong) Headwo\\fds: Nominal Ent\\fies","a. Nouns: ka\\fwu-yak (‘powde\\fed medicine’), ka\\ftay-path (‘a field of \\feeds’),","kacwuk-os (‘leathe\\f ga\\fments’), to\\f-kyeytan (‘a stone stai\\fway’), ...","b. P\\fonouns: ku-kes (‘that thing’), ku-pwun (‘that pe\\fson[Hon]’), ku-ccok (‘that side’), ...","c. Nume\\fals: kwu-s\\bp (‘ninety’), payk-\\tan (‘one million’), sa-s\\bp (‘fo\\fty’), ..."," (6) Regula\\f Ph\\fases as (W\\fong) Headwo\\fds: P\\fedicative Ent\\fies kakong-hata (‘to p\\focess’), sonsang-toyta (‘to be damaged’) nonuy-hata (‘to discuss’), pa\\fta\\f-toyta (‘to be developed’) ta\\fseng-hata (‘to achieve’), swupan-toyta (‘to be accompanied by’) \\tyencey-hata (‘to discha\\fge’), pan\\bp-toyta (‘to be b\\fought in’)  Although these ent\\fies a\\fe \\fega\\fded as compounds and a\\fe listed as headwo\\fds, they cannot be compounds. Fi\\fst of all, ext\\fa mate\\fials can be inse\\fted between the two component wo\\fds conce\\fned. In addition, unli\\be \\feal compounds, each of the component wo\\fds can be modified by othe\\f exp\\fessions. These facts show that they a\\fe just ph\\fases, which cannot be \\fegula\\f headwo\\fds. Among the headwo\\fds consisting of an independent wo\\fd and a clitic wo\\fd, some contain the clitic in the final position. This g\\foup of clitics is w\\fongly t\\feated as (de\\fivational) suffixes in the dictiona\\fy."," (7) \\tlitic-final Ph\\fases as (W\\fong) Headwo\\fds: Nominal Ent\\fies","kenchwuk-ka (‘an a\\fchitect’), kosotuk-chung (‘people in the high-income b\\fac\\bets’),","yeyswu\\f-k\\ban (‘one’s view of a\\ft’), cekaypa\\f-k\\buk (‘an unde\\fdeveloped count\\fy’), ... ","(8) \\tlitic-final Ph\\fases as (W\\fong) Headwo\\fds: P\\fedicative Ent\\fies anseng\\tacchwu\\t-\\tta (‘be suited’), kanan-hata (‘be poo\\f’), ancen-hata (‘be secu\\fe’), na\\tca-ta\\fta (‘be manly’), che\\fthong-kathta (‘be impenet\\fable’)","","Some othe\\fs contain the clitic in the initial position. This g\\foup of clitics is w\\fongly analyzed as","(de\\fivational) p\\fefixes in the dictiona\\fy.","","(9) \\tlitic-initial Ph\\fases as (W\\fong) Headwo\\fds: Nominal Ent\\fies","ka-kyeyyak (‘a p\\fovisional ag\\feement’), k\\bu-ceyto (‘the old system’), k\\t-s\\bp (\\tan wen)","(‘hund\\feds of thousands won’), nal-sayngsen (‘\\faw fish’), no-kyoswu (‘an old","p\\fofesso\\f’), ta-\\tokcek (‘multi-pu\\fpose’), \\fan-\\tan (nyen) (‘five-thousand yea\\fs’), \\fem-","sahoycek (‘pan-national’), \\f\\t-sayngsancek (‘unp\\foductive’), s\\bu-chen (kay) (‘seve\\fal","thousand pieces’), ... ","(10) \\tlitic-initial Ph\\fases as (W\\fong) Headwo\\fds: P\\fedicative Ent\\fies a. pis-: \\f\\ts-k\\bta, \\f\\ts-nakata, \\f\\ts-tayta, \\f\\ts-\\tacta, \\f\\ts-\\tekta PACLIC 24 Proceedings 37  b. say-: say-kka\\tahta, say-ppa\\fkahta, say-pha\\fahta, say-pha\\fayc\\bta, say-hayahta c. ye\\b-: yek-sencen (hata/toyta), yek-\\byong (hata/toyta)  The clitic wo\\fds in (9) come befo\\fe nouns and modify these nouns and, hence, can be catego\\fized as adnominals. Those in (10) have the function of modifying the following ve\\fbs and, hence, can be catego\\fized as adve\\fbs. ","In this section, we have seen that the\\fe a\\fe many ph\\fasal entities which a\\fe w\\fongly \\fegiste\\fed as headwo\\fds in the dictiona\\fy. One obvious p\\foblem of such a system is that all the lexical ent\\fies involved have to be \\fegiste\\fed twice, leading to a significant amount of \\fedundancy. Fo\\f example, although kakong-hata (cf. (6)) is \\fegiste\\fed as a headwo\\fd, we have to \\fegiste\\f kakong and hata as well. Notice that these wo\\fds appea\\f independently in such ph\\fases as [kakong ca\\f hata], in which the adve\\fb ca\\f ‘well’ is in between the two elements. The\\fe is a mo\\fe se\\fious p\\foblem. We would not be able to captu\\fe the fact that the only diffe\\fence between kakong-hata and [kakong ca\\f hata] is the one caused by the (non-)existence of ca\\f. Unde\\f that system, while the fo\\fme\\f is a lexical item listed in the dictiona\\fy, the latte\\f is a ph\\fase const\\fucted on the basis of syntactic mechanisms."]},{"title":"3 Se\\bse Dis\\ti\\bc\\tio\\bs","paragraphs":["Once we have identified the head wo\\fds of a dictiona\\fy, we a\\fe in a position to deal with the meanings of wo\\fds, i.e. the senses of wo\\fds. \\tu\\f\\fent dictiona\\fies have the following p\\foblems \\fega\\fding the definition of wo\\fd senses (At\\bins & Levin 1991, Ravin & Leacoc\\b 2000: 1-2). Fi\\fstly, the numbe\\f of senses and the o\\fganization of senses (senses vs. sub-senses) a\\fe not the same o\\f even simila\\f. Secondly, the wo\\fds used to define headwo\\fds a\\fe themselves polysemous. Thi\\fdly, the\\fe a\\fe cases whe\\fe a wo\\fd used in a specific context cannot be mapped into any definition in the dictiona\\fy. In addition to these p\\foblems, we found out that many senses a\\fe unduly specified in Ko\\fean dictiona\\fies, including Yonse\\b Korean D\\bct\\bonary (\\thae 2008). This ove\\f-specification of senses is mainly due to the influence of the complements and/o\\f modifie\\fs of the head wo\\fd in question.","In the face of these p\\foblems, we need a set of p\\fe-defined c\\fite\\fia to ca\\fve the meanings of wo\\fds into diffe\\fent senses objectively and systematically. Some wo\\fds have only one sense, i.e. monosemous, and many othe\\f wo\\fds have mo\\fe than one sense, i.e. polysemous. We need to conside\\f some impo\\ftant issues befo\\fe we t\\fy to identify wo\\fd senses. We need to cla\\fity, fo\\f example, the distinction between homonymy and polysemy, and between polysemy and indete\\fminacy/vagueness (Ravin & Leacoc\\b 2000: 2-6).","Homog\\faphs a\\fe a g\\foup of wo\\fds which have the same st\\fing of lette\\fs but a\\fe not \\felated etymologically and, hence, have diffe\\fent meanings. On the othe\\f hand, polysemes have the same etymological sou\\fce, and, hence, a\\fe \\felated semantically. Howeve\\f, the distinction is not always clea\\f because the etymologically \\felated meanings of a wo\\fd can, ove\\f time, become so diffe\\fent that the o\\figinal semantic \\felation can be obscu\\fed.","A mo\\fe difficult tas\\b is to dete\\fmine whethe\\f diffe\\fences in meaning a\\fe due to multiple senses of a wo\\fd o\\f a\\fe \\fealizations of a single sense. The\\fe have been p\\foposed some diagnostic tests fo\\f the tas\\b: logical tests, linguistic tests, definitional tests, etc. None of these a\\fe satisfacto\\fy, but they a\\fe useful (to some deg\\fee). Let us conside\\f the gende\\f diffe\\fence latent in the wo\\fd ch\\b\\fd. Let us t\\fy to decide whethe\\f the meanings of ‘male child’ and ‘female child’ a\\fe manifestations of two senses o\\f of a single sense. As we will see sho\\ftly, all the tests show that ch\\b\\fd is a single-sense wo\\fd.","Acco\\fding to the logical test, the wo\\fd conce\\fned is polysemous “if an asse\\ftion involving a wo\\fd can be both t\\fue and false of the same \\fefe\\fent.”",""," 38 Invited and Plenary Talks","(11) The Logical Test a. The feathe\\f is light and not light. b. #I met not a child but a child.  As the feathe\\f is both ‘light’ and ‘not light’ at the same time, the wo\\fd \\f\\bght can be judged to be polysemous. On the othe\\f hand, if a pe\\fson is a ‘child,’ it cannot be a ‘non-child.’ Hence, the gende\\f diffe\\fence in ch\\b\\fd cannot be \\fega\\fded as two sepa\\fate senses. The linguistic test is “a linguistic const\\faint on using multiple senses in a single usage of a polysemous wo\\fd.” ","(12) The Linguistic Test a. #A\\fthu\\f and his d\\fiving license expi\\fed last Thu\\fsday. b. Ma\\fy and Tom a\\fe still child\\fen.  Sentence (a) is biza\\f\\fe, i.e. “zeugmatic” because the \\feading of exp\\bre \\fequi\\fed by Arthur and that \\fequi\\fed by h\\bs dr\\bv\\bng \\f\\bcense a\\fe diffe\\fent senses. If an exp\\fession in such context as in (a) leads to a zeugma, it indicates that the wo\\fd in question is polysemous. As the wo\\fd ch\\b\\fd in (b) does not lead to a zeugma, we can assume that it is a monosemous wo\\fd. The definitional tes says that “a wo\\fd is polysemous if mo\\fe than a single definition is needed to account fo\\f its meaning.”  (13) The Definitional Test","a. Newspaper: ... a publication ..., ... an o\\fganization ...","b. A ch\\b\\fd is a human being who is not yet an adult. (Co\\f\\f\\bns COBUILD D\\bct\\bonary)"," If we a\\fe going to t\\feat the polysemous wo\\fd newspaper as a single-sense wo\\fd, it would have to be defined as in (a). On the othe\\f hand, we don’t have to use an exp\\fession li\\be a \\ta\\fe ... or a fe\\ta\\fe ... in defining ch\\b\\fd, as we can see in (b). ","Not all sense units show the same deg\\fee of autonomy (\\t\\foft & \\t\\fuse 2004). Sense units a\\fe usually delimited by “full sense bounda\\fies” and show the p\\fope\\fty of antagonism. Two antagonistic units a\\fe “mutually exclusive as foci of attention” (p. 112). Howeve\\f, the\\fe a\\fe some sense units which \\fesemble full senses in many \\fespects, but do not show antagonism (p. 115). Majo\\f subtypes of these sub-sense units a\\fe “facets” and “mic\\fosenses” (p. 116). Facets a\\fe “units that have a significant deg\\fee of autonomy, but can be unified to fo\\fm a global Gestalt.” Mic\\fosenses a\\fe “units that have a significant deg\\fee of autonomy, but can be unified into a supe\\fo\\fdinate catego\\fy.” The wo\\fd bank in the ‘financial’ sense has facets of [PREMISES], [PERSONNEL] and [INSTITUTION]. As an example of the latte\\f subtype, kn\\bfe has not only a hype\\fonymic \\feading but also seve\\fal hyponymous \\feadings, including cutle\\fy, weapon and (ga\\fden) tool \\feadings. We need to pay attention to these sub-sense units as well as full sense units in identifying the senses of wo\\fds (cf. the g\\fanula\\fity issue)."]},{"title":"4 Basic U\\bi\\ts of O\\b\\tologies","paragraphs":["The ontology is a hie\\fa\\fchical st\\fuctu\\fe of some semantic units. Some schola\\fs a\\fgue that the basic units have to be wo\\fd senses. In this app\\foach, an ontology is basically a wo\\fd net, a net of wo\\fd senses li\\be Wo\\fdNet. The ontology he\\fe is language dependent and insepa\\fable f\\fom the wo\\fd senses of a pa\\fticula\\f language. Most of all, we cannot use the ontology to figu\\fe out the simila\\fities and diffe\\fences among wo\\fd senses in one o\\f mo\\fe languages (cf. Mahesh (1996: 49) and Hi\\fst (2004: 6/14) fo\\f othe\\f p\\foblems).","Many schola\\fs, on the othe\\f hand, a\\fgue that the basic units of ontologies have to be (simple and/o\\f complex) concepts \\fathe\\f than senses. A cont\\fove\\fsy in this app\\foach is on the st\\fuctu\\fal natu\\fe of the concepts. Schola\\fs li\\be Wie\\fzbic\\ba assume that only conceptual p\\fimitives can be PACLIC 24 Proceedings 39  the building bloc\\bs and posits only 50-60 semantic p\\fimitives (Godda\\fd 1998: 58). Many schola\\fs, howeve\\f, assume that not only simple concepts but also complex concepts can be the building bloc\\bs. Mahesh (1996: 49) p\\fovides a p\\factical guideline to decide on the conceptual units: “... st\\fongly discou\\fages di\\fect encoding of wo\\fd senses as ontological concepts and at the same time const\\fains the develope\\fs f\\fom getting bogged down in unending decompositions of wo\\fd meanings into deep unde\\flying concepts and conceptual \\felations. ... not to decompose complex events o\\f objects unless we see a p\\factical need f\\fom a p\\foblem in analyzing an actual text.”  In this section, we will p\\fovide some pieces of evidence which show that the basic units of","ontologies should be some \\bind of conceptual units \\fathe\\f than wo\\fd senses. Fi\\fstly, the\\fe a\\fe","some wo\\fds which, although they have disjunctions in thei\\f definitions, cannot be \\fega\\fded as","polysemous (\\t\\fuse 2000: 34).  (14) a. Pr\\bncess: ‘female child of mona\\fch’ o\\f ‘wife of male child of mona\\fch’","b. Brother-\\bn-\\faw: ‘spouse's b\\fothe\\f’ o\\f ‘siste\\f's husband’"," As each of these monosemous wo\\fds contains two sepa\\fate concepts connected with the conjunction or, we can clea\\fly see that the wo\\fd senses can be b\\fo\\ben down into conceptual units. As co\\f\\fesponding wo\\fds in othe\\f languages do not necessa\\fily have the same set of concepts connected by the conjunction, it would be impossible to compa\\fe them unde\\f the wo\\fd sense app\\foach. Secondly, as we saw in section 3, the facets of a wo\\fd a\\fe not sepa\\fate (full) senses. Howeve\\f, fo\\f example, the facets of book, [TOME] and [TEXT], a\\fe “of distinct ontological types” (\\t\\foft & \\t\\fuse 2004: 122). Thi\\fdly, it is not clea\\f how we can deal with colo\\f te\\fms if we a\\fe going to assume that wo\\fd senses a\\fe the building bloc\\bs of ontologies. Actually colo\\f te\\fms cannot be defined with \\fefe\\fence to genus and diffe\\fentia. We have to \\feso\\ft to some conceptual units li\\be thei\\f hue, value and ch\\foma. ","Kinship te\\fms li\\be those in (14) p\\fovide st\\fong evidence fo\\f the usefulness of some conceptual units which may not be di\\fectly \\felated to the senses of the wo\\fds conce\\fned. We have p\\fovided an analysis of Ko\\fean, English, Japanese and \\thinese \\binship te\\fms, unde\\f an ontological f\\famewo\\f\\b (Bai\\b & \\thae 2010a, 2010c; Bai\\b & \\thae (this volume)). In the \\femainde\\f of this section, we will s\\betch the f\\famewo\\f\\b and see how it wo\\f\\bs with \\fefe\\fence to Ko\\fean and English \\binship te\\fms (\\fefe\\f to Bai\\b & \\thae (this volume) fo\\f Japanese and \\thinese \\binship te\\fms).","The f\\famewo\\f\\b consists of a simplified family t\\fee and some featu\\fes. Fi\\fstly, the family t\\fee implements some impo\\ftant p\\fope\\fties of va\\fious \\binship systems. Basically, the t\\fee contains th\\fee diffe\\fent types of \\binship \\felationships:  (15) a."]},{"title":"– :","paragraphs":["Di\\fect descendant/antecedent of (e.g., son"]},{"title":"–","paragraphs":["fathe\\f) b."]},{"title":"↔↔↔↔ :","paragraphs":["Sibling of (e.g., fathe\\f"]},{"title":"↔↔↔↔","paragraphs":["fathe\\f’ s female sibling) c."]},{"title":"---:","paragraphs":["Ma\\f\\fied to (e.g., fathe\\f"]},{"title":"---","paragraphs":["mothe\\f)  The family t\\fee, inco\\fpo\\fating these \\felations, can be \\fep\\fesented as follows:       40 Invited and Plenary Talks  (16) A Simplified Family T\\fee                 The ego has the numbe\\f “00” and the othe\\f nodes has a(n a\\fbit\\fa\\fy) numbe\\f. Some pai\\fs of the nodes a\\fe connected to each othe\\f in one of the th\\fee \\felations \\fep\\fesented by the symbols “ᅵᅵᅵᅵ,” “↔” and “---.”","Togethe\\f with the family t\\fee in (16), we use featu\\fes to \\fep\\fesent additional info\\fmation on the nodes of the t\\fee. The featu\\fes and thei\\f values a\\fe as follows: ","(17) a. SEX: {M(ale)}, {F(emale)} b. AGE: {O(lde\\f-than)}, {Y(ounge\\f-than)} c. ORDER: {F(i\\fs)t}, {Sec(ond)}, {L(as)t}  Among these featu\\fes, SEX and AGE have two values. The featu\\fe SEX divides the \\fefe\\fents of \\binship te\\fms into males and females. The featu\\fe AGE shows whethe\\f the \\fefe\\fent is ‘olde\\f than’ o\\f ‘younge\\f than’ the ego. This featu\\fe is ve\\fy useful in defining Ko\\fean \\binship te\\fms, because most of them a\\fe sensitive to the \\felative age of the ego and the add\\fessee. The featu\\fe ORDER is used when the \\fefe\\fent conce\\fned has a special status whethe\\f it is the fi\\fst, the second o\\f the last one among the siblings.","Kinship te\\fms a\\fe \\fep\\fesented as o\\fde\\fed n-tuples of the following, within the f\\famewo\\f\\b int\\foduced above: ","(18) <a, ..., n>"," The fi\\fst element, a, denotes the ‘ego’ and the last one, n, denotes the ‘add\\fessee.’ In between these two elements appea\\f all the elements \\fep\\fesenting the nodes between the ego node and the add\\fessee node in the t\\fee. In addition, each element of the n-tuple can have SEX, AGE and/o\\f ORDER featu\\fes. Fo\\f example, the te\\fm oyha\\f\\ten\\b ‘mate\\fnal g\\fandmothe\\f’ in Ko\\fean is \\fep\\fesented as <00, 10[SEX: F], 20[SEX: F]>. Unde\\f this \\fep\\fesentation, it is inte\\fp\\feted as ‘ego’s mothe\\f’s mothe\\f,’ which fits with ou\\f intuition.","Bai\\b & \\thae (2010c) p\\fovide an ontological analysis of Ko\\fean and English \\binship te\\fms. We ext\\facted about 200 Ko\\fean \\binship te\\fms f\\fom Yonse\\b Korean D\\bct\\bonary and 50 English Kinship te\\fms f\\fom LONGMAN D\\bct\\bonary of Conte\\tporary Eng\\f\\bsh (LDO\\tE). Both of these dictiona\\fies contain a\\found 45,000 lexical ent\\fies. Focusing on each sense of the \\binship te\\fms, we conside\\fed which nodes the ego and the add\\fessee of the sense belong to in the family t\\fee, and chec\\bed whethe\\f these nodes and those in between them need to be specified with any PACLIC 24 Proceedings 41  featu\\fes. Then, we encoded each sense of the te\\fms into the n-tuple fo\\fmat. Some of the analyses a\\fe shown below:  A\\balyses of some Korea\\b a\\bd E\\bglish ki\\bship \\terms ","Kinship Te\\fms Ko\\fean English Notations in the n-tuple fo\\fmat sonnye granddaughter <00, -10, -20[SEX:F]>","e\\ten\\b/\\toch\\bn \\tother <00, 10[SEX:F]> apec\\b/pwu father/dad <00, 10[SEX:M]>","atu\\f son <00, -10[SEX:M]>","tta\\f daughter <00, -10[SEX:F]> acwu\\ten\\b aunt <00, 10, 11[SEX:F]> na\\tphyen husband <00[SEX:F], 02[SEX:M]>","anay w\\bfe <00[SEX:M], 02[SEX:F]> ha\\fapec\\b grandfather <00, 10, 20[SEX:M]> \\tyenwu\\f\\b","daughter-\\bn- \\faw <00, -10[SEX:M], -11[SEX:F]> s\\bster <00, 01[SEX:F]> brother <00, 01[SEX:M]> nwu\\btongsayng <00[SEX:M], 01[SEX:F, AGE:Y]> oppa/orapw\\b <00[SEX:F], 01[SEX:M, AGE:O]> s\\bster-\\bn-\\faw-1 <00, 02 03[SEX:F]> s\\bster-\\bn-\\faw-2 <00, 01[SEX:M], 04[SEX:F]> ","brother-\\bn-\\faw-1 <00, 02, 03[SEX:M]> ","Brother-\\bn-\\faw-2 <00, 01[SEX:F], 04[SEX:M]> checey","<00[SEX:M], 02[SEX:F],","03[SEX:F, AGE:Y]>","kyeyswu <00[SEX:M], 01[SEX:M], 04[SEX:F]>","chena\\t <00[SEX:M, 02[SEX:F], 03[SEX:M]> \\taypwu <00[SEX:M], 01[SEX:F, AGE:O], 04[SEX:M]> cangson <00, -10[SEX:M, ORDER:Ft], -20[SEX:M, ORDER:Ft]> tangc\\b\\f <00[SEX:M], 10[SEX:M], 20[SEX:M], 21[SEX:M], 14[SEX:M], 05[SEX:M], -13[SEX:M]>"]},{"title":"5 Co\\bclusio\\b","paragraphs":["In this pape\\f, we have examined basic units of dictiona\\fies and ontologies: head wo\\fds, senses and concepts. Fi\\fstly, we have seen, on the basis of the mo\\fpho-syntactic status of the head wo\\fds in a Ko\\fean dictiona\\fy, that many head wo\\fds a\\fe actually ph\\fases and that many elements which a\\fe assumed to be affixes a\\fe (dependent) wo\\fds, i.e. clitics. Secondly, we have examined some issues \\felated to the classification of wo\\fd meanings into senses. In o\\fde\\f to solve the p\\foblems of cu\\f\\fent dictiona\\fies in dealing with senses, we need to have a p\\fe-defined set of objective c\\fite\\fia. Lastly, we have seen some pieces of evidence which show that the building bloc\\bs of ontologies should be concepts \\fathe\\f than wo\\fd senses. Especially, in the 42 Invited and Plenary Talks case of colo\\f te\\fms and \\binship te\\fms, we would not be able to do a systematic compa\\fative study on thei\\f meanings if we do not employ a system of conceptual units."]},{"title":"Refere\\bces","paragraphs":["At\\bins, B. T. and B. Levins. 1991. Admitting impediments. In U. Ze\\fnic\\b, ed. Lex\\bca\\f Acqu\\bs\\bt\\bon: Exp\\fo\\bt\\bng On-\\f\\bne Resources to Bu\\b\\fd a Lex\\bcon. Law\\fence E\\flbaum.","Bai\\b, S. and H-R. \\thae. 2010a. An ontological analysis of Ko\\fean \\binship te\\fms. Harvard Stud\\bes \\bn Korean L\\bngu\\bst\\bcs XIII. Ha\\fva\\fd-Yenching Institute.","Bai\\b, S. and H-R. \\thae. 2010b. A Mo\\fpho-syntactic evaluation of Ko\\fean dictiona\\fy headwo\\fds: Focusing on Nominal ent\\fies. A pape\\f p\\fesented at the 2010 Seoul Inte\\fnational \\tonfe\\fence on Linguistics. Seoul.","Bai\\b, S. and H-R. \\thae. 2010c. An ontological analysis of Ko\\fean and English \\binship te\\fms. A pape\\f p\\fesented at the Seventh Inte\\fnational \\tonfe\\fence on \\tognitive Linguistics (I\\t\\tS 2010). Beijing.","Bai\\b, S. and H-R. \\thae. (this volume). An ontological analysis of Japanese and \\thinese \\binship te\\fms.","\\thae, H-R. 1991/2000. The mo\\fphological status of nominal ‘pa\\fticles’ in Ko\\fean. In \\t. Lee and J.","Whitman, eds. Korean Syntax and Se\\tant\\bcs: LSA Inst\\btute Workshop, Santa \\t\\fuz, ’91. Thaeha\\bsa.","\\thae, H-R. 2005. Pa\\fticles in Ko\\fean: Focusing on ve\\fbal pa\\fticles [w\\fitten in Ko\\fean]. Language","Research, 41.3.","\\thae, H-R. 2007. \\tlitics and a classification of pa\\fts of speech in Ko\\fean [w\\fitten in Ko\\fean]. Korean","Journa\\f of L\\bngu\\bst\\bcs, 32.4.","\\thae, H-R. 2008. The c\\fite\\fia of sense classification and an analysis of Ko\\fean dictiona\\fy ent\\fies [w\\fitten in Ko\\fean]. A handout p\\fesented at the Fifth Wo\\f\\bshop on the Language-Neut\\fal Ontology. Han\\bu\\b Unive\\fsity of Fo\\feign Studies.","\\thae, H-R. and S. Bai\\b. 2010 A mo\\fpho-syntactic evaluation of Ko\\fean dictiona\\fy headwo\\fds: Focusing on p\\fedicative ent\\fies. A pape\\f p\\fesented at the Seventeenth \\tonfe\\fence of the Inte\\fnational \\ti\\fcle of Ko\\fean Linguistics (I\\tKL 2010). Ulaanbataa\\f.","\\thae, H-R. and Y. No. 1998 A su\\fvey of mo\\fphological issues in Ko\\fean: Focusing on syntactically \\felevant phenomena. Korean L\\bngu\\bst\\bcs 9, Inte\\fnational \\ti\\fcle of Ko\\fean Linguistics.","\\t\\foft, W. and A. \\t\\fuse. 2004. Polysemy: The const\\fual of sense bounda\\fies. In W. \\t\\foft and A. \\t\\fuse. Cogn\\bt\\bve L\\bngu\\bst\\bcs. \\tamb\\fidge Unive\\fsity P\\fess.","\\t\\fuse, D. A. 2000. Aspects of the mac\\fo-st\\fuctu\\fe of wo\\fd meanings. In Y. Ravin and \\t. Leacoc\\b. 2000.","Godda\\fd, \\t. 1998. Se\\tant\\bc Ana\\fys\\bs: A Pract\\bca\\f Introduct\\bon. Oxfo\\fd Unive\\fsity P\\fess.","Hi\\fst, G. 2004. Ontology and the lexicon. In S. Staab and R. Stude\\f, eds. Handbook on Onto\\fog\\bes. Sp\\finge\\f.","Kuh, H. 1988. The mo\\fphological status of Ko\\fean case ma\\f\\be\\fs. Papers fro\\t the S\\bxth Internat\\bona\\f Conference on Korean L\\bngu\\bst\\bcs.","Mahesh, K. 1996. Ontology development fo\\f machine t\\fanslation: Ideology and methodology. M\\t\\tS-96-292, \\tomputing Resea\\fch Labo\\fato\\fy. New Mexico State Unive\\fsity.","Nevis, J. A. 1985. F\\bnn\\bsh Part\\bc\\fe C\\f\\bt\\bcs and Genera\\f C\\f\\bt\\bc Theory. Ph.D. disse\\ftation, Ohio State Unive\\fsity.","Nevis, J. A., B. D. Joseph, D. Wanne\\f and A. M. Zwic\\by, compile\\fs. 1994. C\\f\\bt\\bcs: A Co\\tprehens\\bve B\\bb\\f\\bography. John Benjamins.","Ravin, Y. and \\t. Leacoc\\b, eds. 2000. Po\\fyse\\ty: Theoret\\bca\\f and Co\\tputat\\bona\\f Approaches. Oxfo\\fd Unive\\fsity P\\fess.","Zwic\\by, A. M. 1977. On C\\f\\bt\\bcs. Indiana Unive\\fsity Linguistic \\tlub.","Zwic\\by, A. M. 1985. \\tlitics and pa\\fticles. Language 61.2. PACLIC 24 Proceedings 43  Zwic\\by, A. M. and G. K. Pullum. 1983. \\tliticization vs. inflection: English n't. Language 59.3.  Dic\\tio\\baries Yonse\\b Korean D\\bct\\bonary. 1998. Yonsei Institute of Language and Info\\fmation Studies.","Doosandonga. 44 Invited and Plenary Talks"]}]}