{"sections":[{"title":"Evidentials and Epistemic Modal in Korean -Evidence from their interactions * Keywords:","paragraphs":["evidential, direct, inferential, epistemic modal, reportative.  "]},{"title":"Chungmin Lee ","paragraphs":["Department of Linguistics, Seoul National University Seoul 151-742, Korea","clee@snu.ac.kr Abstract. Recently J. Lee (2010) made the distinction clear about the evidential –te in Korean between inferential evidential reading with PAST and direct evidential reading with PRES in tense. She offers a modal analysis of this typologically interesting evidential. I argue here that this evidential category, though with some modal force, must be distinguished from an epistemic modal category of conjecture –keyss. If both elements co-occur in one sentence the certainty of the event involved certainly decreases (Pi-ka o-asskeyss-te-ra ‘It might have rained, inferring from my observation’) because of the doubly modalized situation. But evidentials primarily show information source rather than certainty/truth of propositions. The perceiver of sensory (visual) observation involved in the evidential –te sentence is its speaker but if the –te sentence ends with the reportative evidential –tay, then the perceiver is not equal to the speaker. Subject constraints and interactions are examined. If –te occurs in a non-final clause ending with the sequential/causal connective –(u)ni, the PRES clause denotes sequential relation with the third person subject, whereas the PAST clause denotes causal relation based on the internalized inferential result-experience as cause and the resulting consequence in the final clause with the first (and often third, but not second) person subject. * This research was partly supported by KRF-2009-342A00017 (Excellent Scholar Grant). I thank my colleagues and family for assistance in the grammaticality judgments of evidential sentences.  Copyright 2010 by Chungmin Lee"]},{"title":"1 Introduction","paragraphs":["Recently the observational evidential –te in Korean became a hot issue particularly when J. Lee (2010) made the distinction clear between inferential evidential reading with PAST and direct evidential reading with PRES in tense. She offers a modal analysis of this typologically interesting evidential, on the basis of modal subordination evidence. But here I argue that this evidential category must be distinguished from an epistemic modal category of conjecture –keyss and of certainty thulim-eps-i ‘certainly’ (or thulim-eps- ‘certain’).","The perceiver of sensory and psychological observation involved (senses of sight, hearing, smell, taste, touch, weight and feelings of dizziness, etc.) in the evidential –te sentence is the speaker of the sentence. If the –te sentence ends with the reportative evidential –tay/-ray, however, the perceiver switches to the report source, not the speaker of the whole utterance.","Strikingly, if the same –te co-occurs with the sequential/causal connective –(u)ni, the so-called non-equi subject constraint breaks down and the first person is required with PAST. The talk thus addresses various interactional aspects of –te with epistemic modal, with reportative evidential, and with a sequential/causal connective.   PACLIC 24 Proceedings 193  2 The Direct/Inferential –te and the Epistemic Modal –kess  The observational evidential –te denotes the speaker’s prior sensory, typically visual, observation of the event described if the event is without PAST, as follows: ","(1) Pi-ka o-te-ra","rain-NOM come- te-DEC","‘[I saw] it was raining.’"," As in (1), if the sentence lacks the PAST tense marker, the event described of raining was directly observed by the speaker before the speech time and therefore the event has occurred at a past time. But this past event can be accommodated into the flexibly extended now and someone who was in the rain and just came into the house can say: ","(1’) Cikum pakk-ey pi-ka o-ko iss-te-ra (contra Kwon 2009 and others)","now outside-at rain-NOM come PROG-te-DEC","‘[I saw] it is/was raining (PROG) outside.’"," The event time of raining and the time of the speaker’s direct observation overlap and are simultaneous at least at some point before the speech time. The use of cikum ‘now’ in (1’), however, is pragmatically extended by neighborhood concept from the speech time to the interval range reaching the observation time. The requirement of the speaker’s own direct (typically visual) observation leads to direct evidential reading, if the utterance is without PAST in tense (J. Song 2002, Chung 2008, J. Lee 2009). Contrast this with the situation where the event described is with PAST, as in ","(2) Pi-ka o-ass-te-ra rain-NOM come-PAST-te-DEC ‘[I inferred, based on my direct observation of the result evidence], that it (had) rained (already before my observation).  With PAST, as in (2), the event of raining in the past is inferred from the speaker’s own (direct) observation of the evidence (i.e. result) of raining (e.g. the wet ground). It is different from the direct observation of the event going on in question with no PAST in the –te sentence. The –te sentence (2), with PAST, is inferential (and indirect in some sense). But the speaker’s own (direct) observation (of the result evidence) is still required and we would not quite agree with the classification of evidentials into direct [event evidence] vs. indirect [inferential = result evidence and reportative]. In this sense, Lim’s (2010) classification of direct [-te] vs. indirect [reportative] is understandable. In Korean, sensory observation of event on one hand and of result or schedule for prediction on the other may form a subcategory and a reportative another. Even in the case of –te in a non-PAST sentence, the speaker’s sensory observation may not be of any direct observation of the event if the time of the event described by the sentence has a future temporal interpretation with ø-PAST, as in (3), or the epistemic conjectural modal –kess, as in (4). The time of conjecture by the modal -keyss can be identical to that of the described psychological event ‘feeling dizzy’ in (4a). The speaker saw Mia turning round and round. It is a piece of causal evidence of feeling dizzy. But the speaker has no direct access to the other’s current psychological state. Hence (4b) is anomalous. ","(3) Obama-ka (naycwu-ey) hankwuk-ey o –te –ra O -NOM next week-at Korea -to come-EV-DEC ‘[I read] Obama visits Korea next week.’ 194 Regular Papers","(4) a. Mia-ka ecirep-keyss -te -ra M –NOM dizzy-CONJ-EV-DEC ‘[I observed and guessed] Mia was dizzy.’ b. ?*Mia-ka ecirep -te -ra (vs. nay-ka ecirep -te -ra ‘[I felt] I am dizzy’) M –NOM dizzy-EV-DEC ‘[I observed] Mia is dizzy.’  With no PAST, (3) can get a future time interpretation, with or without a time adverbial. It becomes possible because the future reference time can be established from the context. Therefore, a simple ø-marked PRES with –te cannot guarantee direct evidence. Cotemporalness between the eventuality time and the observation time alone is the condition for direct evidence and it is marked by the evidential –te, along with the non-future PRES, contra Chung (2007), and if the ø-marked PRES is a syntactic tense, then a consequent cotemporalness in the denotational representation of pi-ka o-te-ø-ra ‘(I made a sensory observation that) it was raining’) ⇒","","(5) ∃t” [t” < NOW ̂∀w∈BEST(SO,ST/DX,w*, t”) →∃t’(t’ο t”  ̂rain’(w’)(t’))]] by J. Lee 2009 is not warranted because of its future time possibility when the topical reference time is future (NOW < t’’’). Certain subject constraints also exist because of the distinction between psychological and volitional action events (cf. J. Lee 2009). The traditional claim that –te shows ‘retrospection’ (Yang 1972 among others) is limited in the sense that it can co-occur with any future event, as in (3).","Some interesting aspect of the evidential [-te] is that it often shows ‘achieving entitlement, objectivity, and detachment’ in conversation (Kim 2005). For reconfirmation of the speaker’s initial claim with the assertion marker, (s)he even utters –te-ra-ku (ku = COMPL), attached to the initial claim (or with just an assumption or abstract self-quoting). The verb of saying ha-and the DEC marker has been omitted (‘I say that S’) in the matrix S and has been grammaticalized (pap-ul manhi mek-key toy-te-raku ‘I ended up eating much rice (because panchan ‘side-dish’ is salty). In order to ameliorate the hearer’s push of the speaker’s claim that people easily break up after marriage, guessing that it is because they hastily wed, the speaker shows detachment in ‘I don’t know if that’s the reason but’ manhi-tul heyeci-te-la-kwu: ‘many people break up, I would say.’ The speaker’s detachment or aloofness attitude often appears in conversational exchanges.","It is sometimes discussed whether the double PAST –ess-ess form can co-occur with the evidential –te. Observe (6). Because of its (cognitive) discontinuity interpretation (Lee 1987) a discrepancy between (6a) and (6b) arises. A natural situation fitting (6a), which denotes a natural force situation, is hard to find, whereas (6b), involving mobile people is quite possible, as opposed to (6c). Some un-doing of the described event must occur before the speech time. If the event has some clear un-doing effect, the double form can occur with the inferential evidential –te, as in (5c). ","(6) a. ??Pi-ka o-ass-ess- te -ra Cf. (2) rain-NOM come-PAST-PAST-te-DEC ‘[I observed] some discontinuity between the result of past rainfall and the speech time. [My observation of un-doing of rainfall result].’","b. Mia-ka hankwuk-ey o -ass-ess -te –ra M –NOM Korea-to come-PAST-PAST-EV-DEC ‘[I observed] some discontinuity between the result of Mia’s coming to Korea and the speech time. [So she must have left Korea].’ PACLIC 24 Proceedings 195 ","c. Mia-ka hankwuk-ey o -ass -te –ra M –NOM Korea-to come-PAST-EV-DEC ‘[I observed] the result of Mia’s coming to Korea. [So she must be in Korea].’  The traditional claim that –te shows ‘reporting’ (Suh 1977) is not adequate either in the sense that the speaker’s own action cannot be reported by this expression and that reporting can clearly be done by the separate ‘reportative’ evidential -tay.","The non-equi subject constraint [the subject NP of the complement clause cannot be identical with the speaker (Yang 1972) applies, as is well-known, when the event described involves the speaker’s own volitional action or non-psychological predicate but it is released if his/her action is objectified and observed as in video situations (the ‘I’ in video is a signal deictic ‘I’). The constraint does not apply to psychological predicates because the speaker’s psychological state is directly accessed by introspection when used with no PAST, as in ","(7) a. Na-nun/*Ku i-nun ecirep-te-ra","I -TOP/*He-TOP dizzy -te-DEC","‘{I am/*He is} dizzy’ (contra Suh’s (1977) explanation; cf. J. Lee (2010)).","b. Na/*Ku i-nun ecirep-ta (PRES) vs. Ku i-nun ecirep-ess-ta (PAST)) ‘I am/*He is dizzy vs. He/I was dizzy.’  What happens if –te occurs with a modal –keyss? It is not simply a future tense marker; its temporal meaning can be derived from the underlying conjecture or possibility modal category, independent of the evidential –te. Epistemic modality marks the speaker’s evaluation of the truth of a proposition, whereas evidentiality marks the speaker’s source of information (Faller 2010, Kratzer 2009 etc.). We can see their separate realizations in one sentence in Korean, as in (8). ","(8) Pi-ka o -ass -keyss -te -ra rain-NOM come-PAST-MOD-EV-DEC ‘It might have rained, judging from my observation.’  The conjectural assertion based on the modal –keyss is made upon the speaker’s observation of some evidence (by dint of the co-occurring evidential -te) for the conjecture. If the evidential –te is formerly analyzed as a quantifier over possible worlds with evidential assumptions or as an epistemic modal, which is reasonable (see J. Lee’s modal subordination argument), we can predict that (8), with a modal upon modal, is weaker than (9): ","(9) Pi-ka o-ass-keyss-ta ‘It might have rained’  without the evidential. Indeed the prediction is exactly born out; (8) is weaker than (9). Let’s consider a model in which different certainty rates are assigned by -keyss and –te, as follows: ","Table 1: Weakening of certainty by double occurrence a. the certainty rate by –keyss 70% b. the certainty rate by –te 95% c. the consequent certainty rate by –keyss-te 0.70 x 0.95 = 0.665 (66.5%)  The rate by the modal+evidential, c, is weaker than the rate by the modal -keyss alone 70%. Then, how about between (9) and (2)? (9), with conjecture modal, is weaker than (2), with observation evidentiality. If, however, a certainty modal (thulim-eps-i ‘certainly,’ ‘without fail’) 196 Regular Papers is compared with a sensory observation evidential, simple relative weakness is not easy to tell, though the observation evidential, as shown in (2), seems still stronger than the certainty epistemic modal adverb or predicate such as (10) below. It is because the modal, even the certainty one, is primarily based on conjectural inference, whereas the observation evidential shows the impression of objectivity by direct observation of the event or result/symptom. The adverb in (10a) is a bit stronger than the predicate (10b). A simple assertion can be assumed to be 100% certain here. Observe:  (10) a. thulim-eps-i pi-ka o-ass-ta certainly rain-NOM fall-PAST-DEC ‘Certainly it rained.’ b. pi-ka o-ass –um –ey thulim-eps-ta rain-NOM fall-PAST-NMNLZ-LOC fail -without-DEC ‘It is certain that it rained.’ c. Pi-ka o-ass-ta ‘It rained.’ ","Observation in information source, ‘type’ (Lim 2010), rather channel, or anchor, gives an impression of more directness than modal expressions which require inference and evaluation of insirectness. That seems to be why certainty epistemic modality in natural language such as must is far weaker than simple logical necessity, as in (11)."," (11) a.You must have a cold. Your nose is dripping. (inferred evidence) b. #Your nose must be dripping. I can see it. Kratzer (2010)  On the other hand, (9) can be followed by the reportative ø (=deleted ha- ‘say’) (see"]},{"title":"3 about this)","paragraphs":["and then by the observation evidential –te. See (12). Then, the conjecture or epistemic modal judgment is not made by the speaker but by the source of the report. The observation evidential –te simply denotes the speaker’s direct hearing the report from the source but adding it makes the whole sentence sound more detached from the speaker’s commitment."," (12) Pi-ka o -ass -keyss -ta -ø -te -ra rain-NOM fall-PAST-CONJ-DEC-REPORT-EV-DEC","‘[I directly heard that] it might have rained.’  In contrast, the order of the reportative and the observation evidential can be reversed. Then: ","(13) Pi-ka o -ass -keyss -te -ray","rain-NOM fall-PAST-CONJ -EV -DECREPORT","‘[I heard] from the report source the conjecture based on evidence that it might have","rained .’  The embedded conjecture and observation is made by the report source and the speaker of (13) is not committed to it because of the outermost declarative reportative. The order corresponds to the relative scope of elements.","Different situations need different category markers, which are conceptually distinct and tell why they sometimes occur independently and sometimes co-occur, particularly in Korean. . "]},{"title":"3 The Complex S Source of the Reportative –tay ","paragraphs":["PACLIC 24 Proceedings 197  The reportative evidential marker –tay (-ray after –te) originally comes by contraction (and grammaticalization occasionally) from a complex sentence with the higher subject as the source of information or the speaker of the complement clause. My complex S analysis proposed in Lee (1990) is still highly valid, as follows: ","(14) (ilki yeypo-eyse) Pi-ka o –n -tay (weather forecast-in) rain-NOM fall-PRES-REPORT ‘[(The forecast) says that] it is raining/will rain (now or in the afternoon).’","(15) a. s[PRO s[[pi-ka o –n -ta] -ko] hay [COMP –ko deletion]","rain-NOM fall-PRES-DEC-COMP say b. s[PRO s[pi-ka o –n -ta] hay] [h deletion after vowel]","c. --- s[pi-ka o –n -ta] ay [a+ay contraction]","d. --- s[pi-ka o –n –tay] = ‘(The forecast says) it rains.’ e. (ilki yeypo-eyse) weather forecast-in  The semantic or underlying higher subject (typically Topic-marked) of the derived (15d) or (14) is (15e), as an institutional subject/Topic, or if nothing occurs in front, a PRO is the source of the saying or report. The so-called ‘-ko ha’ deletion in the literature is not correct; it is a combination of syntactic deletion and phonological deletion plus reduction. (15e) cannot modify the embedded S. The need for such a complex S analysis is further shown by the following psychological adjective, which requires an Equi-Subject constraint by subjectification:  (16) Mia-ka ecirep-tay M -NOM dizzy-REPORT ‘Mia says she is dizzy.’","(17) a. s[Mia-ka s[[pro ecirep-ta]-ko] hay] b. s[Mia-ka s[pro ecirep-ta] hay] c. s[Mia-ka s[pro ecirep-ta] ay] d. Mia-ka ecirep-tay ‘Mia says she is dizzy.’  In the underlying structure (13a), the subject of the embedded complement clause pro must be co-referential with the subject of the higher verb of saying; the speaker alone feels dizzy at speech time in Korean. Therefore, the surface subject of (16) is the source (speaker) of the report content and the Experiencer of feeling dizzy. Consequently, it does not license any higher PRO subject as in non-psych predicates. If the psychological adjective changes to the verb form ecirewe ha- ‘shows the signs of being dizzy,’ getting objectified, with the general action verb ha- added, then the subject is the one who shows signs of being dizzy in the complement clause and typically requires a higher PRO subject of the saying verb, which is distinct from the surface subject. Observe (18) and its underlying structure (19):  (18) Mia-ka ecirewe ha-n-tay M –NOM dizzy do-PRES-REPORT ‘Mia is said to show signs of being dizzy.’ (19) s[PRO s[[Mia-ka ecirewe ha –n -ta] -ko] hay]","PRO M –NOM dizzy do-PRES-DEC-COMP say  The higher subject, the source of the report, often remains as an arbitrary PRO, but it can be specified any time, as followed, clearly showing the complex S structure:  198 Regular Papers (20) Mia chinkwu-ka Mia-ka ecirewe ha-n-tay M friend –NOM M-NOM dizzy do-PRES-REPORT ‘Mia’s friend says Mia shows signs of being dizzy.’  It is also possible to have double occurrence of Reportative, as in Mia-ka ecirep-ta-n-tay ‘It is said that Mia says she is dizzy.’ The reportative -tay [-ta + -ay] is simply for reporting a declarative type complement. All other basic sentential types such as interrogative, imperative, and propositive can have a reportative ending –ay attached to their respective complement sentential endings: -nunya, -ra, and -ca, ending up as respective reportatives: -nunyay, as in (21), -ray, and -cay","2 2 The promissive markers –ma and –ulkkey behave differently in complement clauses of saying verbs: V–ma-ko hayss-ta is possible but –ulkkey cannot be embedded. –Ma, cannot be form a contracted reportative such as *-may. So far these have not been treated together. Therefore, the declarative reportative –tanta form also comes from –ta-n-ta <[[--- -ta-ko] ha-n-ta] (see the deletion and contraction steps in (15) with -n: PRES, -ta: DEC in the matrix sentence). In this sense, Lim’s (2010) analysis of the initial–ta in –ta-n-ta as reportative loses generalization about different sentential endings in the complement clauses of –(h)a-n-ta ‘say.’ It originates from [(S radical)-ta-ko ha-n-ta ‘–DEC-COMP say-PRES-DEC. In Korean, -ta ha- (after Complementizer –ko deletion) becomes -ta-simply phonologically in various constructions such as Conditional –ta-myen (see No’s (2009) claim that an abstract metarepresntational interpretive feature of an assumption arises), Concessive -ra-to (in Weak NPI amwu-ra-to, Lee (1996)) and Confirmatory Reportative Question –ta-myen-se? (K. Song (2010)). In all these constructions, -ta is DEC and a deleted ha- can be a ø, which can be –ha or be grammaticalized as a representation of public/common assumption. Consider Question Reportative (21) and Confirmatory Reportative Question (22):  (21) a. Mia-ka na-hanthey pi-ka o-ass-nunyay -NOM I-to rain-NOM fall-PAST-QREPORT b. [Mia-ka na-hanthey [[pi-ka o-ass-nunya]-ko] hay] (a, b) ‘Mia asks me whether it rained.’ (22) Hankwuk yeca U-17 team-i FIFA World Cup-ul cwi-ess-ta-myense? Korea woman -NOM -ACC grab-PAST-DEC-said-and ‘I hear that the U-17 Korean Women’s soccer team grabbed FIFA World Cup and is it","true?’  The question reportative in (21a) can be preceded by the observation evidential –te (o-ass-tenyay). Then, Mia asks me whether it rained based on the result observation of “I,” the hearer in the embedded question complement, where a shift of perspective in -te arises, as explicitly characterized by Lim (2010), in terms of Kaplan’s character, intension and extension. But this shift also occurs in a –te proposition embedded in a reportative (as in –te-ray or –te-ra-n-ta).","Turning to acquisition, this reportative -tay is acquired as early as 2 of age in Korean (Lee 1990) and –te at 3. Papafragou et al (2007, 2010) report from their experiments that Korean children can hardly comprehend the meanings of the reportative evidential –tay and the assertion marker (their “evidential”) –e at 2 or 3, although they produce them well. But they admit that children can answer relevant questions. They regard this assertion marker –e as an evidential as well but it is certainly different from evidentials. It does not involve any information source or channel. Because comprehension normally comes earlier than production, their experiments, though diversely conducted, might have been a barrier to a real picture. Early cases of the reportative –tay at 2 are mostly like a quotative, the subject typically being the source of the report. Sometimes they report someone’s action with the actor as the subject. They don’t use the reportative -tay as a hearsay. It must be a use by grown-ups.’ –te is acquired PACLIC 24 Proceedings 199 ","a little later at early 3. Consider:  (23) Appa, appa, pwuek-eyse pap naymsay-ka na-te-ra dad dad kitchen-from boiled rice smell-NOM occur-TE-DEC ‘Dad, dad, there comes out the smell of boiled rice from the kitchen.’","CK 3 yrs 2 months and 10 days, coming out of the kitchen (direct smelling).","","If the reportative co-occurs with a preceding –te, the perceiver of sensory (visual) observation involved in –te is the original speaker of the (complement) event reported, not the speaker of the reportative sentence, as discussed already. Observe: ","(24) Mary-ka cip-ey iss –te -ray M -NOM home-at be –EV-REPORTATIVE ‘I was told that Mary is at home (observed by the person who told it).’  Although (24) is a simple sentence, it is underlyingly or semantically complex with the higher subject as the observer of the event reported, Mary’s being at home. The sensory observer is not the speaker of (24); it is outside of (24). Therefore, the following kind of S-initial reflexive anaphor caki is natural with an abstract higher semantic antecedent. Observe: ","(25) caki-ka pan-eyse kkolcci -–te –ray.","REFL-NOM class-in worst –EV-REPORTATIVE","‘[I was told (by the antecedent of ‘self’)] Self was the worst (bottom) in the class (as","she/he observed).’ ","However, there is a grammaticalized affectionate use of the reportative –ta-n-ta form (see Lim 2010). This affectionate use only occurs with the declarative complement type, with no other source of the report than the speaker himself (an abstract hypothetical representation). If there is other than the speaker as the source of the report, it must be interpreted as a complex sentence. The deletion of a reporting verb (ha-) is justified by all other complement types such as interrogative–nunya-n-ta, imperative V–ra-n-ta, propositive V–ca-n-ta. "]},{"title":"4 Interaction with –(u)ni , the Sequential/Causal Connective ","paragraphs":["Turning to the interaction of the evidential –te with the sequential/causal connective –(u)ni, we can see the sequential/causal connection between the preceding –(u)ni subordinate clause and the main clause. The connective –(u)ni has the meaning of the finding/discovery of the sequential/causal relation between the two clauses. Its co-occurrence with –te reveals an interesting constraint on the subject of the subordinate clause. The scope of the observation evidential –te before this sequential/causal connective is restricted to the subordinate clause, in which –te is embedded. 3  3 The reportative (-ta/-ca/-ra) ø can also be embedded in the subordinate connective clause, e.g. Mia-ka ka-ca- ø-ni, ka-ca ‘Because Mia says let’s go, let’s go,’ where –ni denotes a reason. .","Then, why is the subject of the –te subordinate clause subject to the constraint, as shown in (26)-(28)? (26) and (27), with PRES, show the same non-equi subject constraint as in the root. When with PRES, a –te clause can get its direct evidential reading of [[I saw] that S], observing the event under discussion objectively, and the connective is interpreted predominantly as sequential rather than causal. It is the speaker’s panoramic view. If the predicate, however, is psychological, then the speaker ‘I’ can be the subject (26’). Consider:  (26) Ku-i–ka /*nay-ka ture o -te -ni coyonghi anc-te-ra / anc-ass -ta 200 Regular Papers he –NOM I -NOM in come-EV-SEQ quietly sit-EV-DEC sit-PAST-DEC ‘She/*I came in [as I observed], and (then) she sat quietly (as I observed).’ (26’) Nay-ka ecirep-te-ni an tul-i-te-ra I –NOM dizzy-CONN not hear-EV-DEC ‘I was dizzy [as I experienced] and (then) couldn’t hear [as I experienced].’ (27) a. Ku-i–ka aykchey –rul masi - te-ni ssureci-te –ra he -NOM liquid –ACC drink –EV-SEQ fall -EV-DEC ‘He drank liquid [as I observed], and (then) he fell [as I observed].’ b. Kwurum –i kki -te-ni pi-ka o- -te –ra cloud -NOM gather -EV-SEQ rain-NOM come-EV-DEC ‘It got cloudy [as I observed], and (then) it rained [as I observed].’  But causal relation must be inference-based. The subject in (28), with PAST before –te, is typically restricted to the first person speaker in the –(u)ni subordinate clause.  (28) a. Nay-ka/*Ney-ka/??ku i-ka ture ka-ss –te –ni motwu nolla –te –ra I -NOM you-NOM/he-NOM enter –PAST-EV-CONN all be surprised","‘Because I/*you/??he went in [as I experienced], all were surprised (as I observed).’ b. Nay-ka/*Ney-ka/??ku i-ka inhyeng-ul chi-ess –te –ni inhyeng –i ssureci-ess-ta I -NOM you-NOM/he-NOM doll –ACC hit-PAST-EV- CONN doll-NOM fell","‘Because I/*you/??he hit the doll [as I experienced], it fell.’  There is a close relationship between the speaker’s internalized past experience based on the result of the event denoted by –te and the causal connection triggered by the connective –(u)ni. Capturing inference-based causal relation is more easily done by the speaker than by others. That’s why the PAST-te-ni favors the first person subject. But many speakers who just lean to the reasonable causal relation involved between the subordinate connective and main clauses tend to accept the third person subject utterances in (28). But no one accepts the second person subject utterances; all utterances end in DEC, not in Q. If they end in an interrogative sentential ending (-nya instead of -ra and –ta), the perspective of –te is shifted to the hearer, the second person, then the utterances in (28) with the second person subject become perfect. "]},{"title":"5 Declarative Type Sentential Endings: Are they all Evidentials? ","paragraphs":["I kept explaining how the sentential endings of –ney (surprise) and –ta (matching the expectation) are different from the assertion –e in our acquisition studies earlier, showing the following constraints in the order of occurring ((22a) occurs in SK’s data at 2):  (29) a. eps-ney eps-e (Similarly, eps-ta eps-e but ??eps-e eps-ta) absent-NEY absent-ASSERT","‘(It) is not here [I find], (It) is not here [I assert].’ b. *eps-e eps-ney","‘(It) is not here [I assert]. (It) is not here [I find].’  The declarative ending –ta is also different from the above two in Korean. The assertion marker –e, acquired earliest before 2, may be claimed to be a zero-evidential (Willett 1988), contra Papafragou et al (2007). The declarative sentence ending –ta in children and colloquial Korean is different from the formal and simply assertive use; it shows how something expected and represented in the mind is met by a real fact in the world. There is a slight sense of welcome. In this sense, the surprise marker –ney seems to be closer to evidential and the declarative ending –ta also may be considered in this respect, but not the assertive –e. PACLIC 24 Proceedings 201  Perceiving a state of affairs and asserting a proposition are separate in children and adults","alike. How to characterize and categorize such elements is another challenging task ahead. "]},{"title":"6 Conclusion ","paragraphs":["We tried to see the observational evidential –te in its interaction with a modal, a reportative evidential and a sequential/causal connective. We saw that the PAST-te-ni connective is based on inferential result evidential and is restricted to causal relation interpretation and because of subjectivity involved in result observation inference the non-final subordinate clause favors the first person subject. We clarified some issues and still left many unresolved. Korean evidentials show some complexity and uniqueness. "]},{"title":"References","paragraphs":["Chung, Kyung-Sook. 2007. Spatial Deictic Tense and Evidential in Korean. Natural Language","Semantics 15: 187-219. Faller, Martina. 2010. A Possible Worlds Semantics for (Illocutionary) Evidential. SALT 20. Kim, Mary Shin. 2005. Evidentiality in Achieving Entitlement, Objectivity, and Detachment in","Korean Conversation. Discourse Studies 7, 87-107. Kratzer, Angelika. 2009. Modality in Context. Paris lectures. Kwon, Iksoo. 2009. The Korean Evidential Marker -Te- Revisited: Its Semantic Constraints and","Distancing Effects. The Discourse Cognitive Linguistics Society of Korea Conference. 2009. Lee, Chungmin 1987."]},{"title":"Temporal Expressions in Korean. In Jef Verschueren et al (eds.), The Pragmatic Perspective: Selected Proceedings of the 1985 International Pragmatics Conference, 423-441, John Benjamins, Amsterdam.","paragraphs":["Lee, Chungmin. 1990. Pragmatic and Metapragmatic Aspects of Language Acquisition of Korean,’ at the 5th","Int’l Congress for the Study of Child Language, Budapest.","Lee, Chungmin. 1996. Negative Polarity Items in English and Korean. Language Sciences 18: 503-23.","Lee, Chungmin. 2010. The Acquisition of Modality. In C. Lee, G. Simpson and Y. Kim (eds.) The Handbook of Psycholinguistics III Korean, 187-220. Cambridge University Press.","Lee, Jungmee. 2010. The Korean Evidential –te: A Modal Analysis. In Bonami and Hofherr (eds.) Empirical Issues in Syntax and Semantics 7.","Lim, Dongsik. 2010. Evidentials and Interrogatives: A Case Study from Korean. Ph. D. Thesis. University of Southern California."]},{"title":"No, Eun-Joo. 2009. The Korean Conditional M","paragraphs":["arkers myen and tamyen: Epistemicity vs. Modes of Language Use."]},{"title":"Journal of","paragraphs":["East Asian Linguist"]},{"title":"ics","paragraphs":[". 18: 21–39. Papafragou, A. 2010. The Acquisition of Meaning: Evidentiality in Semantics and Cognition. SALT talk. Papafragou, A., P. Li, Y. Choi and C. Han. 2006. Evidentiality in Language and Cognition.","Cognition 103: 253-299. Song, Jae-Mog. 2002. A Typological Analysis of the Korean Evidential Marker – te. Eoneohag","32: 147-164. Song. Kyung An. 2010. Various Evidentials in Korean. In this volume. Suh, Jungsoo. 1977. Does –te Have a Function of Retrospection? Its Ending and Quotative","Moods (written in Korean). Eoneo (The Korean Journal of Linguistics) 2, 97-127. Yang, Insuk. 1972. Korean Syntax: Case Markers, Delimiters, Complementation, and Relativization. Ph. D. Thesis. University of Hawaii. 202 Regular Papers"]}]}