{"sections":[{"title":"Association for Computational Linguistics Proceedings of the ANLP-NAACL 2000 Student Research Workshop April 29 May 4, 2000 Seattle, Washington, USA Preface to the Student Research Workshop","paragraphs":["This was the inaugural year of the Student Research Workshop, which remodeled the traditional student session into a new format that allows students to present their research to a panel of scientific advisors in addition to the audience of workshop attendees. Panelists have an opportunity to prepare questions and comments prior to the workshop, so we hope this format will provide student authors with more detailed feedback and suggestions for further development of their research than would be possible in the traditional setting. The new format also allows a longer time for presentations (25 minutes) and for discussion of each paper by the panelists and audience members (15 minutes). We received 18 submissions and accepted 8 (44%) for inclusion in the workshop. These papers describe original unpublished work in progress in which all authors are students. We would first like to acknowledge and thank the panelists: James Allen, University of Rochester (USA) Claire Cardie, Cornell University (USA) Jennifer Chu-Carroll, Bell Labs (USA) Deborah Dahl, Unisys Corporation (USA) Barbara Di Eugenio, University of Chicago (USA) Jan Hajic, Johns Hopkins University (USA) Mary Harper, Purdue University (USA) Eduard Hovy, USC Information Sciences Institute (USA) James Lester, North Carolina State University (USA) Scott Miller, BBN Technologies (USA) Donia Scott, University of Brighton (UK) Each submission was reviewed blind by one non-student and two student researchers. We would like to thank all members of the review committee for their thoughtful comments and for their timely completion of the reviews: David Ahn, University of Rochester (USA) Timothy Baldwin, Tokyo Institute of Technology (Japan) Melanie Baljko, University of Toronto (Canada) Sabine Buchholz, Tilburg University (Netherlands) Patrick Caudal, Universit~ Paris 7 (France) Yllias Chali, University of Lethbridge (Canada) Hsin-Hsi Chen, National Taiwan University (Taiwan) Freddy Choi, University of Manchester (UK) Sherri Condon, University of Louisiana (USA) Deborah Dahl, Unisys (USA) Paul Davis, Ohio State University (USA) Jonathan DeCristofaro, University of Delaware (USA) Mona Diab, University of Maryland College/UMIA CS (USA) Mark Dras, University of Pennsylvania (USA) Richard Evans, University of Wolverhampton ( UK) Martha Evens, Illinois Institute of Technology (USA) Eileen Fitzpatrick, Montclair State University (USA) Mary Harper, Purdue University (USA) Woody Haynes, Illinois Institute of Technology (USA) Barbora Hladka, Charles University (Czech Republic) Kristiina Jokinen, Flanders Language Valley (Belgium) Vlado Keselj, University of Waterloo (Canada) Rodger Kibble, University of Brighton/ITRl (UK) Adam Kilgariff, University of Brighton/1TRl (UK) Anna Korhonen, University of Cambridge (UK) Irene Langkilde, University of Southern California/ISl (USA) Christophe Luc, Universit~ Paul Sabat&r (France) Diana Maynard, Manchester Metropolitan University (UK) Lisa Micfiaud, University of Delaware (USA) Derek Walker, University of Geneva (Switzerland) Teresa Zollo, University of Rochester (USA) We would like to acknowledge and thank Mary Harper, our Faculty Advisor and also the Principal Investigator on the NSF grant, for her considerable help and advice. We received much helpful guidance from the ACL Executive Board and the NAACL/ANLP 2000 Conference Executive Committee -- in particular Janyce Wiebe, Kathleen McCoy, Priscilla Rasmussen and Marie Meteer. Also, we extend a heart-felt thanks to last year's Student Session Co-Chairs, Anna Korhonen and Melanie Baljko, for their friendly and helpful replies to our many questions. Finally, we would like to thank the National Science Foundation for their generous support of this workshop under grant number 0001350-IIS. 1 The NSF grant allowed students who might have had no other means of support to travel to the workshop and interact with the scientific community. Student Research Workshop Co-Chairs: Donna Byron, University of Rochester (USA) Peter Vanderheyden, University of Waterloo (Canada) 1 Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the granting institution."]},{"title":"SRWi ANLP-NAACL 2000 Student Research Workshop Table of Contents Section 3: ANLP-NAACL 2000 Student Research Workshop (SRW) SRW Preface and List of Reviewers","paragraphs":["Donna Byron and Peter B. Vanderheyden, Program Committee Chairs ......................... SRWi"]},{"title":"Experimenting with the Interaction between Aggregation and Text Structuring","paragraphs":["Hua Cheng ..............................................................................................................................."]},{"title":"1 Efficient parsing strategies for syntactic analysis of closed captions","paragraphs":["Krzysztof Czuba ...................................................................................................................... 7"]},{"title":"Generating Text with a Theorem Prover","paragraphs":["Ivan I. Garibay ......................................................................................................................."]},{"title":"13 A Weighted Robust Parsing Approach to Semantic Annotation","paragraphs":["Hatem Ghorbel and Vincenzo Pallotta .................................................................................."]},{"title":"19 Corpus-Based Syntactic Error Detection Using Syntactic Patterns","paragraphs":["Koldo Gojenola and Maite Oronoz ........................................................................................ 24"]},{"title":"The use of error tags in ARTFL 's","paragraphs":["Encyclop6die:"]},{"title":"Does good error identification lead to good error correction ?","paragraphs":["Derrick Higgins ..................................................................................................................... 30"]},{"title":"Word Sense Disambiguation for Cross-Language Information Retrieval","paragraphs":["Mary Xiaoyong Liu, Ted Diamond, and Anne R. Diekema .................................................. 35"]},{"title":"Multiple Discourse Marker Occurrence: Creating Hierarchies for Natural Language Generation","paragraphs":["Sarah Louise Oates ................................................................................................................ 41"]},{"title":"SRWiii","paragraphs":[]}],"references":[],"cites":[]}
