{"sections":[{"title":"A NONCONFIGURATIONAL APPROACH TO THE WEAK CROSSOVER EFFECT IN KOREAN","paragraphs":["Chan Chung","Department of English Language and Literature Dongseo University, Pusan, Korea. Email: cchung@kowon.dongseo.ac.kr ABSTRACT Configurational approaches to weak crossover effects in Japanese and Korean have been proposed based on the notions such as c-command and reconstruction (e.g., [5], [25], and [26] among others). However, empirical problems arise from the approaches simply because they cannot fully account for the relevant Korean data. This paper proposes nonconfigurational operator binding conditions formulated in terms of obliqueness and linear precedence within the framework of Head-Driven Phrase Structure Grammar. The proposed syntactic operator binding conditions are formulated in only a necessary condition, which suggests that the pronominal binding possibilities are also determined by other factors such as discourse and/or processing factors. 1. INTRODUCTION Since at least [30], the weak crossover (WCO) effect has been used as a diagnostic for movement. In this paper, we assume that scrambling in Korean is licensed by a flat clausal structure and relative freedom of the linear precedence constraints among the non-head constituents, which entails that scrambling does not involve movement and thus leaves no trace. (See [2], [9], and [10] among others.) This predicts scrambling does not induce WCO effects at all. Then the putative WCO effect reported in the literature ([5], [6], [16], [25], and [26]) among others) must be accounted for in different ways.","In this paper, first, we will review [26]'s claim that the WCO effect occurs in the psych-verb construction with backward reflexivization in Japanese, showing that the construction actually cannot be considered to have the WCO effect in some respects and thus cannot be evidence that scrambling is an instance of movement. Then we will consider some canonical cases of WCO and some other relevant data, trying to show that the so-called WCO condition can be accounted for in nonconfigurational terms such as relative obliqueness and linear precedence between a pronominal and its binder, rather than in terms of c-command. To this end, we will explore binding conditions of non-locally bound anaphor caki 'self, the overt pronoun ku 'he', and the empty pronoun pro. 2. WEAK CROSSOVER EFFECT, MOVEMENT, AND CONFIGURATIONALITY Under the assumption that in Japanese, the non-locally bound reflexive zibun 'self has a property of a bound variable when it is locally A-bar bound, [26] argue for a VP node in Japanese, using the psych-verb construction with backward reflexivization. They claim that the construction can induce the WCO effect due to the existence of a VP node. The Korean sentences corresponding to the Japanese sentences in [26] are as follows:","(1) a.*[s [Np Mary-ka cakirlul miwehantanun\\t[vp nwukvvunarinwukwunkarlul koylopkeyhayssta] ] .","M-Nom self-Acc dislike\\tfact-Nom everyone-/someone-Acc\\tdepressed T̀he fact that Mary dislikes himself; has depressed everyone;/someone;.'","b.*[s [Np Mary-ka\\teakii-lul\\tmiwehantanun Basil]-i [vp nvvukwurlul \\tkoylopkeyhayss-ni]]?","M-Nom\\tself-Ace dislike\\tfact-Nom who-Acc\\tdepressed-Q Ẁhom; has the fact that Mary dislikes himself; depressed?' According to them, the sentences in (1) are unacceptable because the antecedent quantifier (nwukwuna-/nwukwnkalul 'everyone/someone' or nwukwu-lul 'who') is scrambled to the S-adjunction position at LF, resulting the' structure in (2): (2)\\t NP\\t"]},{"title":"S ","paragraphs":["NP","nwukwunarlul\\t[Mary-ka cakirlul miwehantanun NP\\tV t,\\tkoylopkeyhayssta Here, due to the existence of the VP node, the anaphor caki-lul neither c-commands nor is c-commanded by the variable (i.e., the trace), and thus the configuration in (2) fits the condition in (3), which is assumed to induce the WCO effect by [26]: (3) A variable cannot be the antecedent of a pronoun or an anaphor that it does not c-command.","[26] also claim that scrambling in Japanese (or Korean for that matter) must be an instance of move-a, based on the weak crossover effect in the same construction.","(4) a. [p\\tMary-ka\\tmiwehantanun\\tJohn-uli\\tsulphukeyhanta. M-Nom\\tself-Acc dislike\\tfact-Nom J-Acc \\tmake-sad Lit. 'The fact that Mary dislikes himself, made John; sad.'","b. *?John-ul, [NP Mary-ka\\tcaki-lul,\\tmiwehantanun sasil]-i\\t","t, sulphukeyhanta. J-Acc\\tM-Nom\\tselfAcc\\tdislike\\tfact-Nom\\tmake-sad","(5) a. [Np\\tMary-uy\\tcaki-lul,\\thyanghan salang]-i\\tJohn-ul,\\tnolakeyhayssta.","M-Gen\\tself-Acc toward\\tlove-Nom J-Acc\\tsurprised Lit. 'Mary's love toward himself; surprised John,:","b. *?John-lul,\\t[NP Mary-uy caki-lul,\\thyanghan salang]-i\\t","t;\\tnolakeyhayssta. J-Acc\\tM-Gen\\tself-Acc\\ttoward\\tlove-Nom\\tsurprised They argue that the ungrammaticality of (4b) and (5b) arises from the WCO effect that is caused by the movement of John-lul to the sentence initial position. That is, the non-local reflexive caki-lul 'self is not c-commanded by the trace. This results in the same configuration as in (2) at S-structure, which is predicted to be unacceptable due to the WCO effect condition in (3). They argue further that this is evidence for the hypothesis that scrambling is an instance of move-a.","One of the problems with [26]'s analysis is that it is hard to tell whether that kind of WCO effect exists at all in Korean. To see why, let us consider the sentences in (6)-(8), which are considered to be typical examples involving movement and its effect on binding of the non-locally bound anaphor caki . (See [5] and [25] among others, for the same observations.) (6) a. *[Cakiruy chinkwu]-ka\\tnwukwurlul \\t","self-Gen friend-Nom\\twho-Acc","Ẁho, did his, friend betray?'","b. Nwukwurlul\\t[cakiruy chinkwu]-ka who-Acc\\tself-Gen friend-Nom","(7) a. ICakiruy\\tchinkwu]-ka\\tnwukwunkarlul self-Gen\\tfriend-Nom\\tsomeone-Ace Lit. 'His; friend betrayed someone,.'","b. Nwukwunkarlul [cakiruy chinkwu]-ka someone-Acc\\tself-Gen friend-Nom paypanhayssni? betrayed-Q","t, paypanhayssni? betrayed-Q paypanhayssta. betrayed","t, paypanhayssta. betrayed -132-","(8) a. ICalciruy\\tchinkwu]-ka\\tJohnrul\\tpaypanhayssta. self-Gen\\tfriend-Nom\\tJ-Acc\\tbetrayed Lit. 'His; friend betrayed John;.'","b. John;-ul [calciruy\\tchinkwu]-ka\\tpaypanhayssta. J-Acc\\tself-Gen friend-Nom\\tbetrayed All the (b) sentences in (6)-(8) have the exactly the same structure as the one in (2) at least at S-structure, and they are all incorrectly predicted to be unacceptable by [261 due to the WCO effect condition in (3). From [261's point of view, one way to interpret the data in (6)-(8) might be to assume that the WCO effect induced"]},{"title":"at","paragraphs":["LF by quantifier movement is ameliorated by scrambling. However, this approach cannot be extended to the account of (4b) and (5b) because scrambling here does not ameliorate the WCO effect.","Also note that in [25], Saito himself acknowledges that the sentences in (4) and (5) may not be a set of data which evidently shows the WCO effects in Japanese. He provides the sentence in (9) which contains the wh-word dare 'who' and an overt bound variable soitu 'the guy' which he considers to induce the WCO effect in Japanese just as an English overt pronoun does. (9) ?Darero\\t[[soitu;-no\\thahaoya]-ga\\taisiteru] who-Ace the guy-Gen mother-Nom","\\t love Ẁho; does his; mother love ti.' [25] notices that this example is marginally acceptable in Japanese, while (1), (4b) and (5b) are unacceptable, and that these judgments cause some theoretical inconsistencies. He mentions that the judgment of (9) seems to be more solid, and that the ill-formedness of (1), (4b) and (5b) cannot be attributed directly to WCO effect (footnote 5 in [25]). From these observations, we may conclude that it seems impossible to consistently account for all the given data if we assume that sentences in (1), (4) and (5) all involve the WCO effect. That is, the claim is suspicious that the unacceptability of the psych-verb construction is due to the WCO effect. But if they are not instances of WCO effects, then they cannot be evidence for the claim that scrambling is an instance of move-a, and for the existence of a VP node. Investigations of what factors make worse the psych-verb constructions in (1), (4b) and (5b) remain for further study. 3. PRONOMINAL BINDING AND WEAK CROSSOVER EFFECTS 3.1 Data and Previous Analyses In this section, we will discuss some instances of canonical WCO effects and relevant data, trying to show that the WCO effects can be accounted for by general binding conditions of pronominal expressions such as the non-locally bound anaphor caki 'self, the overt pronoun ku 'he/she', and the empty pronoun pro.' We will try to show that even the canonical structure that is believed to induce WCO effects cannot be evidence for hierarchical clause structure in Korean.","Let us consider the following data first where a pronominal expression is contained within a subject NP and its antecedent is a complement (cf. (6)-(8)):","(10) a. 1Calcir/kuruy/proi chinkwuFka","self-/he-Gen/pro friend-Nom Ẁho; did his; friend betray?'","b. Nwukwurlul\\t[cakir/kuruy/proi who-Ace\\tself-/he-Gen/pro","(11) a. 1Calcir/kuruy/proi chinkwu]-ka","self-/he-Gen/pro friend-Nom","Lit. 'His; friend trusts everyone;.'","b. Nwukwunarlul [calcir/kuruy/proi everyone-Ace self-/he-Gen/pro nwukwurlul who-Ace chinkwu]-ka friend-Nom nwukwunarlul everyone-Acc chinkwu]-ka friend-Nom paypanhayssni? betrayed-Q paypanhayssni? betrayed-Q sinloyhanta. trust sinloyhanta. trust These examples are considered to be typical instances involving movement of a quantifier or wh-word and its effect on binding of the non-locally bound anaphor caki 'self, overt pronoun ku 'he' and empty pronoun pro. (See [5], [16], and [25] among others, for the same or similar observations.) In terms of GB, (10) and (11) might be accounted for by an assumption that the WCO effect occurs at LF by operator movement such as quantifier raising and wh-movement, but the effect is ameliorated by scrambling, i.e., scrambling needs to be assumed to be A-movement as in [17].","Unlike the typical English WCO effect, a similar pattern of judgment is obtained in Korean and Japanese even when the moved category is not a typical quantifier or wh-word, as shown in (12):","(12) a. rCaki,-/*kuruy/pro,\\tchinkwu]-ka\\tJohnr/ku namcarlul\\tpaypanhayta. self-/he-Gen/pro\\tfriend-Nom\\tJ-/the man-Acc\\tbetrayed Lit. 'His, friend betrayed John,/the man,.'","b. Johnr/ku namcarlul [cakir/kuruy/pro, chinkwu]-ka \\tt, paypanhayta. J-/the man-Acc\\tself-/he-Gen/pro\\tfriend-Nom\\tbetrayed According to [26], the examples with caki and ku in (12a) can be instances of the WCO effect since they assume that the definite antecedent (quasi-operator) also moves across the subject at LF in Korean and Japanese, and that its trace is a variable. However, it is not true that a definite and an indefinite always have the same binding possibilities in Korean (and perhaps in Japanese either), especially when the involved pronoun is pro. Note that pro in (12a) can have a linearly following definite antecedent, but not a linearly following indefinite antecedent, as shown in (10a) and (1 la). The different pro binding possibilities between definite and indefinite antecedents are also found in the so-called parasitic gap construction, as shown in (13) - (15):","(13) a. Johnr/ku namcarlul Mary-ka [ pro, cal alci \\tmoshameyto pwulkwuhako]\\tchotayhayssta. J-/the man-Acc\\tM-Nom\\twell know do not\\talthough\\tinvited M̀ary invited Johndthe man, although she does not know him, well.'","b. Mary-ka [ pro, cal alci\\tmoshameyto pwulkwuhako] Johnr/ku namcarlul chotayhayssta. M-Nom\\twell know do not\\talthough\\tJ-/the man-Acc\\tinvited","(14) a. Nwukwurlul\\tMary-ka [pro, cal alci\\tmoshameyto pwulkwuhako] chotayhayssni? who-Acc\\tM-Nom\\twell know do not\\talthough\\tinvited Ẁho, did Mary invite although she does not know him, well?'","b. ??/Mary-ka [pro, cal alci moshameyto\\tpwulkwuhako] nwukwurlul chotayhayssni?","M-Nom\\twell know\\tdo not\\talthough\\twho-Acc\\tinvited","(15) a. Nwukvvunarlul Mary-nun [pro, sakwuykito \\tceney]\\tcinachikey sinloyhanta. everyone-Acc M-Top\\tgetting acquainted before\\texceedly\\ttrust M̀ary exceedly trusts everyone; before getting acquainted with him.'","b. ??/Mary-nun [pro,\\tsakwuykito\\tceney] nvvukwunai-lul cinachikey sinloyhanta.","M-Top\\tgetting acquainted before everyone-Acc exceedly\\ttrust (13) shows that pro can be bound by a definite NP John-ul or ku namca-lul 'the man' regardless of its position, whereas (14) and (15) show that pro cannot be bound by an indefinite NP when the indefinite occurs after pro.","Let us consider other types of data, where a pronominal is contained within an NP and the operator is a subject:","(16) a. Nwurka\\t[cakir/lcuruy/pro,\\tchinkwu]-lul\\tpaypanhayssni? who-Nom self-/he-Gen/pro\\tfriend-Acc\\tbetrayed-Q Ẁho, betrayed his, friend?'","b. [Caki,-/*kuruy/pro, chinkwu]-lul \\tnwurka\\tt,\\tpaypanhayssni? self-/he-Gen/pro\\tfriend-Ace\\twho-Nom\\tbetrayed-Q","(17) a. Nwukwunkarka\\t[cakir/kuruy/pro, chinkwu]-lul\\tpaypanhayssta. Someone-Nom\\tself-/he-Gen/pro\\tfriend-Acc\\tbetrayed S̀omeone betrayed his, friend,.'","b. [Caki,-/*kuruy/pro, chinkwu]-lul \\tnwukwunkarka\\tpaypanhayssta. self-/he-Gen/pro\\tfriend-Acc\\tSomeone-Nom\\tbetrayed -134-","(18) a. John;-i\\t[calcii-/lcuruy/proi\\tchinkwu]-lul\\tpaypanhayssta. J-Nom\\tself-/he-Gen/pro\\tfriend-Acc\\tbetrayed J̀ohn betrayed his; friend.'","b. [Cakii-/*kuruy/proi chinkwu]-lui\\tJohnri\\t","paypanhayssta. self-/he-Gen/pro\\tfriend-Acc\\tJ-Nom\\t","betrayed In this case, caki or pro can be bound by the subject operator even when the operator follows it. In contrast, ku cannot be bound by the subject operator when it linearly follows pro.","To account for examples like (16X18) as well as (10)-(12), [25] assumes that at LF, the position for the scrambled NP can either disappear or be reanalyzed as an A position. If the position disappears, the NP in that position is reconstructed into the trace position, which allows a pronominal within the NP to be c-commanded by its antecedent (e.g., (16)-(18)). If the scrambled position is reanalyzed as an A position, the NP in the position becomes an antecedent that can command the pronominal (e.g., (10b)-(12b), (13a) and (14a)).","However, this reanalysis and reconstruction account turns out to be too strong when we consider the following examples:","(19) a. Ne-nun nwunwurhanthey [caki i/proi sensayngnim]-ul sokayhaycwuessni? you-Top who-to\\tself/pro teacher-Ace\\tintroduced-Q T̀o whom; did you introduce his; teacher?'","b. */??[Cakii/proi sensayngnim]-ul ne-nun\\tnwunwurhanthey sokayhaycwuessni?","self/pro\\tteacher-Acc\\tyou-Top who -to\\tintroduced-Q Following [25]'s accounts, if we reconstruct the scrambled NP caki/pro sensayngnim-ul 'his teacher' into the trace position at LF, (19b) is predicted to have the same judgment as (19a) by the same reason as in (16). However, this prediction is not born out since (19b) is much worse than (19a). This observation casts some doubts on the assumption that variable binding in Korean (and perhaps in Japanese too) can be accounted for by move-a and LF reconstruction.","Let us now consider a set of data that causes another problem to the reconstruction and reanalysis approach. Here an operator is embedded within an NP, as shown in (20) and (21):2 3","(20) a. INvvukwuruy kwake]-ka calcir/kui-lul/proi","who-Gen past-Nom self-/he-Acc/pro","Ẁhose; past bothered him?'","b. *Calcii-/kurlul/proi [nwukwui-uy kwake]-ka \\t","self-/he-Ace/pro who-Gen\\tpast-Nom (21) a. INwukwuruy kwakeklul","\\t","cakii-/kui-lca/proi who-Gen\\tpast-Acc\\tself-/he-Nom/pro ẁhose; past couldn't he; remember?'","b. *Calcii-/kurka/proi [nwukwuruy kwake]-lul self-/he-Nom/pro\\twho-Gen\\tpast-Acc koylophyessni? bothered-Q koylophyessni?","bothered-Q kiyek moshani? could not remember-Q kiyek moshani? could not remember-Q These examples show that when an operator is embedded within an NP, it cannot bind pronominals, regardless of linear order between the operator and pronominals. However, when the pronominals are also embedded within an NP and linearly follow the operator, the embedded operator can bind the pronominals, as shown in (22) and (23), which are counterparts of (20) and (21):","(22) a. [Nvvukwuruy kwake]-ka who-Gen\\tpast-Nom Ẁhose; past bothered his; wife?'","b. *[Cakii-/kuruy/proi anayklul self-/he-Gen/pro\\twife-Acc [cakii-/kuruy/proi\\tarray]-lul self-/he-Gen/pro\\twife-Acc [nwukwui-uy kwake]-ka who-Gen\\tpast-Nom koylophyessni? bothered-Q koylophyessni? bothered-Q","(23) a. *raki,-/kuruy/pro, emma]-ka\\t[nwukwuruy self-/he-Gen/pro\\tmother-Nom\\twho-Gen Ẁhose, past couldn't her, mother remember?'","b. [Nvvukwuruy kwake];-lul\\t[calcir/kuruy/pro, who-Gen\\tpast-Acc\\tself-/he-Gen/pro kwaket-lul past-Acc emma]-ka mother-Nom kiyek moshani? could not remember-Q kiyek moshani? could not remember-Q If we assume that a pronominal must be c-commanded by its operator to get bound, then obviously (22a) and (23b) are problematic since here the operator nwukwu 'who' is properly contained within an NP and thus the pronominal itself is never c-commanded by the operator.","To account for (22a) and (23b) in terms of c-command, following [24]'s slash indexing, we might assume that the operator nwukwu 'who' alone moves out of the NP into a higher A-bar position at LF to c-command the NP containing the pronominals. However, this analysis does not work for (20a) and (21a). If it is allowed in (22a) and (23b) to move the operator alone out of the NP into a higher position, the operator also can move in (20a) and (21a) to c-command the pronominals. Thus they are incorrectly predicted to be acceptable. 4 Also note that this quantifier raising technique does not work for (22) either, since the NP caki-/ku/pro anay-lul 'his wife' in (22b) can be reconstructed into the trace position at LF. Then (22b) has exactly the same structure as (22a) at LF, which incorrectly entails that (22b) is as acceptable as (22a).","When the antecedent is a non-operator (a definite), however, it is not necessary that the pronominals be embedded within an NP, as shown in (24) and (25), which are counterparts of (20) and (21):","(24) a. [John,-uy kwake]-ka caki,-/kurlul\\tkoylophyessta. J-Gen\\tpast-Nom self-/he-Acc\\tbothered J̀ohn's, past bothered him,.'","b *Geld,-/kurlul [Johnruy kwake]-ka\\tkoylophyessta. self-/he-Ace\\tJ-Gen\\tpast-Nom\\tbothered","(25) a. *Caki,-/kurica [Johnruy kwake]-lul \\tkiyekhaci\\tmoshayssta. self-/he-Nom J-Gen\\tpast-Acc\\tremember did not Lit. Ile, did not remember John's, past.'","b [Johnruy kwake];-lul\\tcalcir/kurka\\tkiyekhaci moshayssta. J-Gen\\tpast-Ace\\tself-/he-Nom\\tremember did not In these cases, caki and ku get bound if they linearly follow their antecedents. Here the position of pro is not specified since it is impossible to tell where the empty pronoun appears. However, it is clear that the pro versions of the sentences in (24) and (25) are all acceptable regardless of whether pro is a subject or an object. 3.2 0-Command, Linear Precedence, and Syntactic Condition on Pronominal Binding Let us now propose our own analysis of variable binding. Following standard assumptions, our nonconfigurational approach assumes that there are two kinds of pronominal binding, bound variable binding and discourse binding. The former is the case where the binder is an operator such as a quantifier or wh-word, and the latter is the case where the binder is a definite. Certain syntactic constraints are concerned with only bound variable binding. We assume that bound variable binding is conditioned by syntactic factors such as relative obliqueness and linear precedence between a pronominal and its binder, while discourse binding is not. Our main concern in this section is what syntactic conditions must be imposed on bound variable binding in Korean.","In [9], the obliqueness hierarchy in (26) for Korean is proposed for the syntactic condition on locally bound caki 'self . It states that a subject is less oblique than a complement, and complements are all equally oblique. (26) Subject < Complements We define the notion of proper o-command in (28), based on the definition of local o-command in (27): (27) Y locally o-commands Z if Y locally o-commands Z iff y is less oblique than Z. (28) Y properly o-commands Z iff y locally o-commands X properly dominating Z. -136-The notion of proper o-command differs from that of o-command only in that the former excludes the local o-command relation between Y and Z, while the latter includes it.","The other new definition we need is that of proper precedence in (29): (29) Y properly precedes Z iff Y precedes X properly dominating Z. According to (29), Y properly precedes Z in the following cases: (30) a. • • •\\t• • • Proper precedence differs from ordinary precedence in that the former describes a linear precedence relationship between non-sister constituents, excluding the linear relationship between sister constituents.","Also we divide three different pronominals discussed above into two subsorts depending on their syntactic similarity and difference. One subsort will be called x-pronoun whose binding seems to be conditioned by obliqueness and linear precedence. This includes the non-locally bound cab and pro. The other subsort will be called y-pronoun whose binding is conditioned only by linear precedence. This includes ku. In Head-Driven Phrase Structure Grammar (HPSG; [19]), these sorts can be represented by the sort hierarchy on nominal categories, as shown in (31): (31) nominal-ob.ect (nom-obi) \\t nonpronoun (npro)\\tpronoun (pron) personal pronoun\\to)\\tanaphor (ana) \\t x-pronoun (xpro)\\ty-pronoun (ypro)","Before formulating the variable binding conditions, we need to define another concept called operator-complex in [3]. [19] adopts the QUANTIFIER) STORE mechanism to handle quantifier scopes, which is developed from the idea of Cooper storage in [11]. The QSTORE takes as its value a set of quant(ifier)s. The feature structure of the sort quantifier) has DETERMINER) and RESTRICTED) IND(EX). The DET attribute takes as its value sort sem(antic)det(erminer) such asforall, exist, the, few, etc., while the RESTIND takes sort nom(inal)-obj(ect), which in turn has the INDEX and RESTR(ICTION) attribute. [20] extend the QSTORE mechanism to handle the wh-scopes as well as quantifier scopes. On this approach, for example, the wh-operator whom has the feature structure in (32a), which indicates that whom is a quantifier that has which as its semdet and its referent must be a person. The QSTROE value is often abbreviated as in (32b). -137- (32) a. —SYNSEM I LOC CAT HEAD noun CASE acc","VAL — SUBJ < > COMPS < > SPR<> CONTENT I INDEX [1] QSTORE DET which RESTIND INDEX [1]","RESTR RELN person INSTANCE [1] quant b. { [which [1] I person ([1])] } The value of QSTORE is structure-shared with the mother node by the Quantifier Inheritance Principle (QIP):","(33) Quantifier Inheritance Principle (QIP): The QSTORE value of a phrasal node is the union of the QSTORE values of the daughters less those quantifiers that are retrieved at that node. (33) states that the QSTORE value of a daughter node can be percolated up to the mother node until it is retrived. The retrieval of a quantifier can take place at any phrasal node whose CONTENT is a psoa (roughly, at any verbal phrasal category). Based on this QSTORE mechanism, [20] define the notion of the operator-complex (0-complex) as follows: (34) An 0-complex is a constituent whose QSTORE contains anon-definite quantifier or a wh-operator. According to the definition in (34), a quantifier such as everyone or a wh-word itself is an 0-complex since its QSTORE contains a non-definite quantifier or a wh-operator. An NP containing a quantifier or a wh-word like every mother or whose mother can also be an 0-complex since the QSTORE value in the specifier daughter is percolated up to the mother node by the QIP in (33), and thus the whole NP's QSTORE also contains the same quantifier or wh-operator as the specifier has.","Based on the notions such as proper o-command in (28), proper precedence in (29), the sort hierarchy in (31), and 0-complex in (34), we propose the variable binding conditions in (35) and (36) for each pronoun s 6","(35) Variable binding condition of x-pronoun: An x-pronoun X may be bound by an operator 0 only if either (i) 0 properly o-commands X or\\t(ii) 0-complex properly precedes X.","(36) Variable binding condition ofy-pronoun (Preliminary version): A y-pronoun Y may be bound by an operator 0 only if 0-complex properly precedes Y. (35) states that x-pronouns such as pro and non-locally bound caki can be bound by an operator if either (i) the operator is less oblique than the constituent properly dominating the x-pronouns; or (ii) the operator itself or a node dominating the operator precedes a constituent properly dominating the x-pronoun. (36) states that the y-pronoun ku can be bound by an operator if the operator itself or a node dominating the operator precedes a constituent properly dominating the y-pronoun. (35i) and (35ii) have similar effects as the LF reconstruction and reanalysis in [25], respectively. However, they make different predictions from [25]'s c-command based approaches in that all -138-the problematic data given above are no longer problems.'","As for (10) and (11), on our approach, the (a) sentences are all correctly predicted to be unacceptable because the operators nwukwu-lul 'who' and nwukwuna-lul 'everyone' neither properly o-command nor properly precede the pronominals. (14b) is predicted to be unacceptable by the same reason if we assume that an adjunct and a complement are equally oblique. In contrast, the (b) sentences in (10) and (11) are all correctly predicted to be acceptable because the operators properly precede the pronominals. (14a) is also predicted to be acceptable by the same reason.","Binding possibilities of (12), (13), (18), (24) and (25) are not detennin' ed by the operator binding conditions in (35) and (36) because the binders are definites, not operators. We will return to these examples in section 3.3.","As for caki and pro binding in (16) and (17), all the relevant sentences are correctly predicted to be acceptable regardless of positions of the pronominals and operators, because the operators properly o-command the pronominals. As for ku binding, the relevant (a) sentences are correctly predicted to be acceptable because the operators properly precedes ku. In contrast, the relevant (b) sentences are correctly predicted to be unacceptable. The operators"]},{"title":"do not","paragraphs":["properly precede the pronominals, and thus the condition in (36) is violated.","As for (20) and (21) as well as (22b) and (23a), all of them are correctly predicted to be unacceptable because the operator neither properly o-commands nor properly precedes the pronominals. In contrast, (22a) and (23b) are correctly predicted to be acceptable since the operator properly precedes the pronominals.","Also note that the pronominal ku does not seem to be affected by (in)definiteness of the binder. As shown in (12a), (18b), (24b) and (25a), ku cannot be bound by a linearly following binder regardless of the (in)definiteness of the binder. This fact provides another motivation for the sort hierarchy in (31) where the y-pronoun ku differs from x-pronouns such as caki and pro. To incorporate the observation on ku into the condition in (36), (36) may be revised into a more general condition as in (37):","(37) Binding condition of y-pronoun (Final version): A y-pronoun Y may be bound by an NP X only if X properly precedes Y. 3.3 Discourse Condition on Pronominal Binding Note that the binding conditions in (35) and (37) are formulated as a necessary condition but not as a necessary and sufficient condition. On our nonconfigurational approach, operator binding is conjunctively conditioned (i) by minimal syntactic constraints in (35) and (37); and (ii) by discourse and/or processing factors. In other words, for a pronominal to be appropriately bound by an operator, it must satisfy certain discourse or processing conditions as well as syntactic conditions. Thus on our approach, syntactic conditions alone may allow some sentences to be overgenerated, but they are filtered out by some discourse or processing conditions. For example, let us consider the following examples:","(38) [Nwukwuruy yeca chinkwu]-ka rcalcii-/kuruy/proi pwumonim]-ul pangmwunhayssni? who-Gen\\tgirl friend-Nom\\tself-/he-Gen/pro\\tparents-Acc\\tvisited-Q ẁhose; girl friend visited his; parents?' The only difference between the sentences in (22a) and (38) is that the head noun of the NP containing the operator nwukwu 'who' is replaced with a person, yeca chinkwu 'girl friend'. In this case, caki is bound not by nwukwu but by yeca chinkwu. On our analysis, the sentence in (38) satisfies the binding conditions in (35) and (37), and thus they are all predicted to be acceptable at the syntax level. However, caki binding here is filtered out by a certain processing factor, namely the intervention effect, which is one of the two crucial factors that are suggested by [18] and [19] to be relevant to binding of non-locally bound anaphor. The intervention effect can roughly be described"]},{"title":"as follows: a non-locally bound anaphor X is hard to interpret as coindexed with an NP Y when another NP W which can be a possible antecedent of X linearly intervenes between X and Y. From the perspective of intervention, the unacceptability of the sentence in (38) with","paragraphs":["caki"]},{"title":"is correctly predicted if we assume that a linear intervention effect","paragraphs":["occurs when yeca chinkwu"]},{"title":"'girl friend' appears between","paragraphs":["caki"]},{"title":"and its binder. In this paper, we have focused on what minimal syntactic conditions must be imposed on each pronominal. As for more discussions on such non-syntactic factors, we refer readers to some previous studies that will be listed below when we briefly discuss non-operator binding.'","paragraphs":["Now, let us consider examples where pronouns are bound by non-operators such as proper nouns and definites, as in (4), (12), (13), (18), (24) and (25). First of all, in general, non-operator binding of a pronominal seems to be similar to operator binding in that possibilities of non-operator pronominal binding is also affected by the obliqueness hierarchy (e.g., (18)) and linear order (e.g., (12), (24) and (25)). 9 However, the conditions in terms of obliqueness and linear order in (35) and (37) are not even necessary conditions for non-operator binding. For example, even though the NP dominating caki in (4a) or the NP dominating pro in (12a) and (13b) are not ocommanded or preceded by its antecedent, they are perfectly acceptable.","Then what conditions are imposed on non-operator pronominal binding? Discourse factors that have often been discussed in pronominal binding are as follows: point of view or empathy ([15], [28]), logophoricity ([27]), discourse salience of an antecedent in terms of a kind of obliqueness hierarchy ([3], [29]), and discourse salience of an antecedent in terms of familiarity ([23]), among others. As mentioned above, we will avoid any further discussion about these factors since they are beyond the scope of this paper. Instead, we will just roughly sketch how a certain discourse constraint is imposed on non-operator binding, based on [23].","[13] proposes that a difference between definites and indefinites arises from their distinct presuppositions. Definites have familiarity presuppositions, while indefinites have novelty presuppositions. According to her theory, the familiarity presupposition is satisfied when the index of the referent of a definite is a member of the presuppositional set involved. [23] discusses some instances of pronoun binding in English, proposing that binding possibilities of non-operator pronoun binding are determined by discourse salience of an antecedent. According to her, one of the crucial factors that makes the antecedent salient at the discourse level is its familiarity to interlocutors. Following [13]'s theory of familiarity presupposition, she proposes that a discourse bound pronoun is bound by an index of an element in a presuppositional set, not by an overt NP within the clause. Following her, we can assume that pronominals such as caki and pro in (4), (12), (13), (18), (24), and (25) are bound not by an overt NP within the clauses but by an index in a presuppositional set in the sense of [13]. That is, those sentences are felicitously uttered only when a presupposition that the referent of a definite antecedent is familiar to the interlocutors.","The familiarity presupposition may be considered as a necessary condition on non-operator binding but not as a sufficient condition, because satisfaction of the familiarity presupposition does not always make non-operator binding possible. For example, note that the binding possibilities of caki are more restrictive than that of pro, as shown in (12a). Here the antecedent NP is an object and linearly follows the pronominals caki and pro. In this case, even though the familiarity presupposition is satisfied, caki cannot be bound by the NP, while pro can. However, when the antecedent is a subject, as in (18b), caki also can bound by it. This contrast shows that we may need to consider more discourse factors for caki binding, such as empathy or point of view. According to [15]'s empathy hierarchy, it is easier for speakers to empathize with the referent of a subject than an object. It is generally well-accepted that the binding possibilities of non-locally bound caki are affected by this kind of empathy hierarchy. Then we can say that, due to the subjecthood of the antecedent, caki in (18b) can be bound by the antecedent, even though the antecedent follows it. In contrast, due to the non-subjecthood of the antecedent, it is hard for caki in (12a) to be bound by the antecedent when the antecedent follows it. 4. CONCLUSION To summarize, Korean may have the WCO effect at least at LF (e.g., (10a) and (l la)). The WCO and relevant phenomena can be relatively well accounted for by the operator binding condition for caki and pro in (35) and the binding condition for ku in (37). These conditions are formulated in nonconfigurational terms such as obliqueness and linear precedence, more specifically by the notions of the proper o-command and proper precedence, rather than by the reconstruction and reanalysis in [251 This leads us to the conclusion that the putative WCO effect in Korean can neither be evidence that a VP node exists nor be evidence that scrambling is an instance of move-a.","The proposed syntactic operator binding conditions are formulated in only a necessary condition, which suggests that the pronominal binding possibilities are also determined by other factors such as discourse and/or processing factors. A discourse condition is roughly proposed based on the notion of familiarity presupposition in terms of [13] and [23]. 5. NOTES 1.It is still controversial which pronominal induces the WCO effect in Korean and Japanese. For example, among others, pro is assumed to induce the WCO effect in [16]; ku 'he' in [61 and [5]; zibun 'self (caki in Korean) in [26]; and soitu 'the guy' in [25]. 2. From now on, we illustrate only the examples where the operator is a wh-word just for expository convenience. If we replace the wh-word with quantifiers such as nwukwunka 'someone' or nwukwuna 'everyone', we have exactly the same acceptability judgement. 3. The examples in (21) are called secondary strong crossover in [21]. 4. (21a) cannot be ruled out by Principle C, because the reconstruction into the trace position is not obligatory in [25]. That is, if the NP nwukwu-uy kwake-lul 'whose past' is reanalyzed as an A position without being reconstructed into the trace position, (21a) is not an example of Principle C violation. Moreover, note that the fully acceptable sentence in (25b) has exactly the same structure as (21a) except that the antecedent is replaced by Johnuy 'John's'. Thus, if (21a) were ruled out by Principle C, then (25b) should also be incorrectly ruled out by the same reason. 5. The condition in (35) may be considered as a descriptive generalization because it is a disjunction of two separate cases. The formulation through a deeper generalization remains for further study, if such a generalization exists. 6. We may simplify the notion of \"proper precedence\" in (35) and (36) into standard \"precedence\" if we rule out the examples in (20) by principle B. To this end, we may assume that the index value of the operator percolated up to the mother node also affects the binding possibilities, following [24]'s slash indexing technique. That is, in (20a) for example, the QSTORE value of the whole NP, nwukwu-uy kwake-lca 'whose past' contains the index of the operator nwukwu-uy 'whose' due to the QIP. If the index is assumed to be available for the binding theory, then (20a) can be eliminated by principle B, i.e., the pronouns are locally p-commanded by the whole NP [nwukwu-uy, kwake-ka"]},{"title":"ini","paragraphs":["; 'whose past'. However, the technical details remain for further study. 7. [3], [7], and [12] among others also propose that linear precedence is a crucial determining factor of operator binding. 8. [14] and [22] among others propose some syntactic accounts of the intervention effects (or blocking effects) on Chinese ziji 'self binding, based on feature agreements. However, [31] convincingly claim that none of those syntax-based accounts are plausible. [1] also proposes a syntactic account of an intervention effect on Japanese zibun 'self binding, based on honorific feature agreement, i.e., when there is a subject that triggers subject honorification, the long-distance binding of zibun by its higher subject is impossible. Whatever the involved feature is, however, it is unclear how this type of syntactic constraint can be extended to account for the intervention effect in (38), where caki on the one hand, and the binder nwukwu 'who' and the intervenor yeca chinkwu 'girl friend' on the other are properly dominated by separate NPs. Also note that the honorific constraint suggested by [1] does not exist in Korean. 9. However, non-operator binding is less restrictive than operator binding in the sense that a non-operator embedded within an NP can bind a pronominal even when the pronominal is not embedded within another NP. Compare (24a) and (25b) with (20a) or (21a). 10.[13] does not discuss whether a proper noun such as John in (61) and (62) is a definite or not. We assume that a proper noun also has the familiarity presupposition. 6. REFERENCES","[1] Aikawa, T. Reflexivity in Japanese and LF-Analysis of Zibun-Binding. Ph.D. Dissertation. The Ohio State University. 1993.","[2] Bouma, G. and G. van Noord. \"Word order constraints on Germanic verb clusters,\" Complex Predicates in Non-Derivational Syntax, ed by H. Erhard, A. Kathol, and T. Nakazawa. Syntax and Semantics Volume 30. New York: Academic Press. 1988.","[3] Brennan, S., M. Friedman, C. Pollard. \"A centering approach to pronouns,\" Proceeding of the 25th Annual","Meeting of the ACL. pp.155-162, 1987.","[4] Bresnan, J. \"Linear order, syntactic rank, and empty categories: on weak crossover,\" Formal Issues in Lexical-Functional Grammar. ed. by M. Dalrymple, et al. CSLI Publication. pp.241-274, 1995. -141- [5] Cho, J-H. \"On scrambling: reconstruction, crossover, and anaphor binding,\" Theoretical Issues in Korean","Linguistics, ed. by Y-K. Kim-Renaud. CSLI Publications. pp.255-274, 1994. [6] Choe, H, S. \"Restructuring parameters and scrambling in Korean and Hungarian,\" Configurationality,","ed. by Marracz, L. and P. Muysken. Dordrecht: Foris. pp.267-292, 1989. [7] Chomsky, N. \"Conditions on rules of grammar,\" Linguistic Analysis 2. pp.303-351, 1976. [8] Chomsky. N. Barriers. Cambridge: MIT Press. 1986. [9] Chung, C. \"Contrastive focus and exempt anaphor caki in Korean,\" I 1 th Pacific Asia Conference on","Language, Information and Computation, ed. by B.S. Park and J.B. Kim. Seoul: Kyung Hee University.","pp.307-316, 1996. [10]Chung, C. \"Argument composition and long-distance scrambling in Korean: an extension of the complex","predicate analysis,\" Complex Predicates in Non-Derivational Slyntax, ed by H. Erhard, A. Kathol, and T.","Nakazawa. Syntax and Semantics Volume 30. New York: Academic Press. pp.159-220, 1988. 111Cooper, R. Quantification and ,Syntactic Theory. Dordrecht:Reidel. 1983. [12]Gawron, J. and S. Peters. Anaphora and Quantification in Situation Semantics. CSLI Lecture Notes 19.","Stanford: CSLI. 1990. [13]Heim, I. The Semantics of Definite and Indefinite Noun Phrase. Ph.D Dissertation. University of","Massachusetts at Amherst. 1982. [14]Huang, C-T., C-C. Tang. \"The local nature of the long-distance reflexive in Chinese,\" Long-Distance","Anaphora, ed. by J. Koster and E. Reuland. Cambridge: Cambridge University Press. pp. 263-282, 1991. [15]Kuno, S. \"Subject, theme, and speaker's empathy: a re-examination of relativization phenomena,\" Subject","and Topic, ed. by C. Li. New York: Academic Press. pp.417-444, 1976. [16]Lee, Y-S. \"Scrambling and pronoun binding,\" Harvard Studies in Korean Linguistics IV, ed. by S. Kuno et","al. Seoul: Hanshin. pp.329-338, 1991. [17]Mahajan, A. The A/A-Bar Distinction and Movement Theory. Ph.D. dissertation, MIT. 1990. [18]Pollard, C. and I. Sag. \"Anaphors in English and the scope of binding theory,\" Linguistic Inquiry 23. pp.","261-303, 1992. [19]Pollard, C. and I. Sag. Head-Driven Phrase Structure Grammar. University of Chicago Press and CSLI","Publications. 1994. [20]Pollard, C and E. J. Yoo. \"Quantifiers, Wh-phrases and a theory of quantification,\" presented at the HPSG","workshop held at Tubingen University in Germany. 1995. [21]Postal, P. \"Remarks on weak crossover effects,\" Linguistic Inquiry 24. pp.539-556, 1993. [22]Progovac, L. \"Long-distance reflexive: movement-to-infl versus relativized SUBJECT,\" Linguistic Inquiry","24. pp.755-772, 1993. [23]Roberts, C. \"Salience, centering and anaphora resolution in discourse representation theory,\" Centering in","Discourse, ed. by M. Walker, et al. Oxford University Press. 1994. [24]Safir, K. \"Derivation, representation and resumption: the domain of weak crossover,\" Linguistic Inquiry, 27.","1996 [25]Saito, M. \"Long distance scrambling in Japanese,\" Journal of East Asian Linguistics 1. pp. 69-118, 1992. [26]Saito, M. and H. Hoji. \"Weak crossover and move-alpha in Japanese,\" NLLT. 1983. [27]Sells, P. \"Aspects of logophoricity,\" Linguistic Inquiry 18. pp. 445-479, 1987. [28]Tomabechi, H. \"Zero-pronominals, point-of-view, empathy perspective, and context-parameters,\" ms.","Carnegie Mellon University. 1989. [29]Walker, M., S. Cote and M. Iida. \"Japanese discourse and the process of centering,\" Proceeding of the 32nd","Annual Meeting of the ACL. 1994. [30]Wasow, T. Anaphora in Generative Grammar. E. Story-Scientia, Gent. 1979. [31]Xue, P., C. Pollard and I. Sag. \"A new perspective on Chinese ZIJI,\" WCCFL 15. 1995."]}]}