{"sections":[{"title":"Semi-Automatic Identification of Bilingual Synonymous Technical Terms from Phrase Tables and Parallel Patent Sentences","paragraphs":["Bing Lianga , Takehito Utsurob , and Mikio Yamamotob a","Graduate School of Systems and Information Engineering, University of Tsukuba, Tsukuba, 305-8573, JAPAN b Faculty of Engineering, Information and Systems, University of Tsukuba, Tsukuba, 305-8573, JAPAN Abstract. In the research field of machine translation of patent documents, the issue of acquiring technical term translation equivalent pairs automatically from parallel patent documents is one of those most important. We take an approach of utilizing the phrase table of a state-of-the-art phrase-based statistical machine translation model. In this task, we consider situations where a technical term is observed in many parallel patent sentences and is translated into many translation equivalents. We apply SVM to the task of identifying synonymous translation equivalent pairs and achieve almost 98% precision and over 40% F-measure. Then, in order to improve recall, we introduce a semi-automatic framework, where we employ the strategy of selecting more than one seeds for each set of candidates bilingual synonymous term pairs. By manually judging whether each pair of two seeds is synonymous or not, we achieve over 95% precision and 50% recall. Keywords: Bilingual Lexicon Acquisition, Synonyms, Phrase Tables"]},{"title":"1 Introduction","paragraphs":["For both high quality machine and human translation, a large scale and high quality bilingual lexicon is the most important key resource. Since manual compilation of bilingual lexicon requires plenty of time and huge manual labor, in the research area of knowledge acquisition from natural language text, automatic bilingual lexicon compilation have been studied. Techniques invented so far include translation term pair acquisition based on statistical co-occurrence measure from parallel sentences (Matsumoto and Utsuro, 2000), translation term pair acquisition from comparable corpora (Fung and Yee, 1998), compositional translation generation based on an existing bilingual lexicon for human use (Tonoike et al., 2006), and translation term pair acquisition by collecting partially bilingual texts through the search engine (Huang et al., 2005).","Among those efforts of acquiring bilingual lexicon from text, Morishita et al. (2008) studied to acquire technical term translation lexicon from phrase tables, which are trained by a phrase-based statistical machine translation model with parallel sentences automatically extracted from parallel patent documents. Recently, we further studied to require the acquired technical term translation equivalents to be consistent with word alignment in parallel sentences and achieved 91.9% precision with almost 70% recall. This technique has been actually adopted by a Japanese organization which is responsible for translating Japanese patent applications published by the Japanese Patent Office (JPO) into English, where it has been utilized in the process of semi-automatically compiling bilingual technical term lexicon from parallel patent sentences. In this process, persons who are working on compiling bilingual technical term lexicon judge whether to accept or not candidates of bilingual technical term pairs presented by the system.","Copyright 2011 by Bing Liang, Takehito Utsuro, and Mikio Yamamoto 25th Pacific Asia Conference on Language, Information and Computation, pages 196–205"]},{"title":"196","paragraphs":["Based on the achievement so far, in this paper, we consider situations where a technical term is observed in many parallel patent sentences and is translated into many translation equivalents. More specifically, in the task of acquiring technical term translation equivalent pairs, this paper studies the issue of identifying synonymous translation equivalent pairs. First, we collect candidates of synonymous translation equivalent pairs from parallel patent sentences. Then, we analyze features for identifying synonymous translation equivalent pairs. Finally, we apply the Support Vector Machines (SVMs) (Vapnik, 1998) to the task of identifying bilingual synonymous technical terms, and achieve the performance of almost 98% precision and over 40% F-measure. Then, in order to improve recall, we introduce a semi-automatic framework, where we employ the strategy of selecting more than one seeds for each set of candidates bilingual synonymous term pairs. By manually judging whether each pair of two seeds is synonymous or not, we achieve over 95% precision and 50% recall."]},{"title":"2 Japanese-English Parallel Patent Documents","paragraphs":["In the NTCIR-7 workshop, the Japanese-English patent translation task is organized (Fujii et al., 2008), where parallel patent documents and sentences are provided by the organizer. Those parallel patent documents are collected from the 10 years of unexamined Japanese patent applications published by the Japanese Patent Office (JPO) and the 10 years patent grant data published by the U.S. Patent & Trademark Office (USPTO) in 1993-2000. The numbers of documents are approximately 3,500,000 for Japanese and 1,300,000 for English. Because the USPTO documents consist of only patent that have been granted, the number of these documents is smaller than that of the JPO documents. From these document sets, patent families are automatically extracted and the fields of “Background of the Invention” and “Detailed Description of the Preferred Embodiments” are selected. This is because the text of those fields is usually translated on a sentence-by-sentence basis. Then, the method of Utiyama and Isahara (2007) is applied to the text of those fields, and Japanese and English sentences are aligned."]},{"title":"3 Phrase Table of an SMT Model","paragraphs":["As a toolkit of a phrase-based statistical machine translation model, we use Moses (Koehn et al., 2007) and apply it to the whole 1.8M parallel patent sentences. In Moses, first, word alignment of parallel sentences are obtained by GIZA++ (Och and Ney, 2003) in both translation directions and then the two alignments are symmetrised. Next, any phrase pair that is consistent with word alignment is collected into the phrase table and a phrase translation probability is assigned to each pair. More specifically, we construct a phrase table in the direction of Japanese to English translation, and another one in the opposite direction of English to Japanese translation. In the direction of Japanese to English translation, we finally obtain 76M translation pairs with 33M unique Japanese phrases, i.e., 2.29 English translations per Japanese phrase on average, with Japanese to English phrase translation probabilities P (pE | pJ ) of translating a Japanese phrase pJ into an English phrase pE. For each Japanese phrase, those multiple translation candidates in the phrase table are ranked in descending order of Japanese to English phrase translation probabilities. In the similar way, in the phrase table in the opposite direction of English to Japanese translation, for each English phrase, multiple Japanese translation candidates are ranked in descending order of English to Japanese phrase translation probabilities.","Those two phrase tables are then referred to when identifying a bilingual technical term pair, given a parallel sentence pair ⟨SJ ,SE⟩ and a Japanese technical term tJ , or an English technical term tE. In the direction of Japanese to English, given a parallel sentence pair ⟨SJ ,SE⟩ containing a Japanese technical term tJ , the Japanese to English phrase table is referred to when identifying a bilingual technical term pair. From the Japanese to English phrase table, candidates of translating tJ into English which are consistent with word alignment are collected. Then, those English"]},{"title":"197","paragraphs":["translation candidates are matched against the English sentence SE of the parallel sentence pair, and those which are not found in SE are filtered out. Finally, among the remaining translation candidates, t̂E with the largest translation probability P (tE | tJ ) is selected and the bilingual technical term pair ⟨tJ , t̂E⟩ is identified. The precision of identifying bilingual technical term pair here is 91.9%. Similarly, in the opposite direction of English to Japanese, given a parallel sentence pair ⟨SJ ,SE⟩ containing an English technical term tE, the English to Japanese phrase table is referred to when identifying a bilingual technical term pair. Figure 1: Developing a Reference Set of Bilingual Synonymous Technical Terms"]},{"title":"4 Developing a Reference Set of Bilingual Synonymous Technical Terms Table 1:","paragraphs":["Number of Bilingual Technical Terms: Candidates and Reference of Synonyms # of bilingual technical terms for the total 134 seeds average per seed Candidates of Synonyms ∣ ∣ ∣ ⋃ sJ","CBP(sJ )∣ ∣ ∣ = 22,473 167.7 Reference of Synonyms ∣ ∣ ∣ ⋃ sJE","SBP(sJE)∣ ∣ ∣ = 1,680 12.5 The following describes the procedure of developing a reference set of bilingual synonymous","technical terms from the whole 1.8M parallel patent sentences and the Japanese to English / En-","glish to Japanese phrase tables. Figure 1 illustrates the whole procedure. 1. First, a initial Japanese noun phrase t0","J is randomly selected from the Japanese part of the 1.8M parallel patent sentences.","2. Then, to the initial Japanese noun phrase t0","J , the following “Iteration: Generating Candidates Bilingual Synonymous Term Pairs” is applied, where the iteration is repeated steps of translation generation from the 1.8M parallel patent sentences and the Japanese to English / English to Japanese phrase tables1",". Next, the initial set CBP(t0","J ) of candidate bilingual","1","The number of iteration 6 here is based on our preliminary evaluation, and is decided so that most synonymous","bilingual technical terms are generated from the initial Japanese phrase t0","J , while the number of candidates other","than true synonyms is minimized. Throughout those steps, we simply avoid duplicate generation of terms."]},{"title":"198","paragraphs":["synonymous term pairs is generated as in the left half of Figure 1. Iteration: Generating Candidates of Bilingual Synonymous Term Pairs 1st step Given the input Japanese term t′","J , collect all the parallel sentence pairs which con-","tain t′ J from the 1.8M parallel patent sentences. Next, from each parallel sentence pair, t′ J is translated into English according to the procedure in the previous section, referring to the Japanese to English phrase table. Then, all the bilingual term pairs ⟨t′","J ,ti","E⟩ are collected into the initial set CBP(t′","J ) of candidates bilingual synonymous term pairs2",".","2nd step Similarly, for each English term tE in CBP(t′","J ), collect all the parallel sentence pairs which contain tE from the 1.8M parallel patent sentences, and translate tE into Japanese, referring to the English to Japanese phrase table. Then, all the bilingual term pairs ⟨ti","J ,tE⟩ are added to CBP(t′","J ).","3rd step Similarly, for each Japanese term tJ in CBP(t′","J ), collect all the parallel sentence pairs which contain tJ from the 1.8M parallel patent sentences, and translate tJ into English, referring to the Japanese to English phrase table. Then, all the bilingual term pairs ⟨tJ ,ti","E⟩ are added to CBP(t′","J ).","4th step Repeat the procedure of the “2nd step”.","5th step Repeat the procedure of the “3rd step”.","6th step Repeat the procedure of the “2nd step”.","After the candidate generation iteration, we restrict the set CBP(t0","J ) as having more than or","equal to 10 members (i.e., | CBP(t0","J ) |≥ 10). In the evaluation of this paper, out of 4,000","randomly selected initial Japanese noun phrases and corresponding initial sets CBP(t0","J ), about 350 sets satisfy the lower bound of the number of members.","3. Next, out of the members of the initial set CBP(t0","J ) of candidates bilingual synonymous","term pairs for the initial Japanese noun phrase t0 J , we select the seed bilingual term pair sJE = ⟨sJ ,sE⟩ as below: First, in order to distinguish technical terms and general terms and to select bilingual technical term pairs as seeds, we assume the candidates of seeds to satisfy at least one of the following requirements:","(a) The co-occurring frequency of the bilingual term pair in the 1.8M parallel patent sentences is less than 500.","(b) The character length of the Japanese term is more than two when it contains kanji (Chinese characters) or hiragana (Japanese characters). The Japanese term consists of more than one morpheme when all of its characters are katakana (Japanese characters for foreign words).","(c) The English term consists of more than one word. Then, we manually examine the bilingual term pair with the largest co-occurring frequency in the 1.8M parallel patent sentences. If the one with the largest co-occurring frequency is appropriate as a pair of technical terms, we select it as seed. Otherwise, we manually examine all the members of the initial set CBP(t0","J ) and select the most appropriate pair as","seed. If the initial set CBP(t0 J ) does not include any pair of bilingual technical terms, we discard the set CBP(t0","J ) at this step. In the evaluation of this paper, out of all the initial sets CBP(t0","J ), for about 29% of the initial sets, we keep the bilingual term pair with the largest co-occurring frequency as seed, for about 14% of them, we manually select as seed the pair other than the one with the largest 2 Throughout the steps from the “1st” to the “6th”, we only keep bilingual term pairs which satisfy the lower bound 6 as well as the upper bound 800 of the co-occurring frequency in the 1.8M parallel patent sentences."]},{"title":"199","paragraphs":["co-occurring frequency, and for the remaining 57%, we discard the initial sets CBP(t0","J ).It took about 5.5 minutes on average to manually examine all the members of each initial set CBP(t0","J ).","4. To the Japanese technical term sJ of the seed bilingual technical term pair sJE = ⟨sJ ,sE⟩, “Iteration: Generating Candidates Bilingual Synonymous Term Pairs” is applied. As the result of this iteration, the set CBP(sJ ) of candidates of bilingual synonymous technical term pairs is generated as in the right half of Figure 1. Here, we again restrict the set CBP(sJ ) as having more than or equal to 10 members (i.e., | CBP(sJ) |≥ 10). In the evaluation of this paper, about 90% of the sets CBP(sJ ) satisfy the lower bound of the number of members. Finally, we have 134 seed bilingual technical term pairs, where the number of bilingual technical terms in total and their average are shown in Table 1.","5. Finally, for each seed bilingual technical term pair sJE = ⟨sJ ,sE⟩, we manually divide the set CBP(sJ ) of candidates of bilingual synonymous technical term pairs into SBP(sJE), those of which are synonymous with sJE, and the remaining NSBP(sJE). As in Table 1, the number of bilingual technical terms included in SBP(sJE) in total for all of the 134 seed bilingual technical term pairs is 1,680, which amounts to 12.5 per seed on average."]},{"title":"5 Automatic Identification of Bilingual Synonymous Technical Terms by Machine Learning","paragraphs":["In this section, we apply the SVMs to the task of identifying bilingual synonymous technical terms, which we originally proposed in Liang et al. (2011)."]},{"title":"5.1 The Procedure","paragraphs":["First, let CBP be the union of the sets CBP(sJ ) of candidates of bilingual synonymous technical term pairs for all of the 134 seed bilingual technical term pairs. In the training and testing of the classifier for identifying bilingual synonymous technical terms, we first divide the set of 134 seed bilingual technical term pairs into 10 subsets. Here, for each i-th subset (i =1,...,10), we construct the union CBPi of the sets CBP(sJ ) of candidates of bilingual synonymous technical term pairs, where CBP1,...,CBP10 are 10 disjoint subsets3","of CBP.","As a tool for learning SVMs, we use TinySVM (http://chasen.org/t̃aku/ software/TinySVM/). As the kernel function, we use the polynomial (2nd order) kernel. In the testing of a SVMs classifier, we regard the distance from the separating hyperplane to each test instance as a confidence measure, and return test instances satisfying confidence measures over a certain lower bound only as positive samples (i.e., synonymous with the seed). In the training of SVMs, we use 8 subsets out of the whole 10 subsets CBP1,...,CBP10. Then, we tune the lower bound of the confidence measure with one of the remaining two subsets (henceforth named as the development set). With this subset, we also tune the parameter of TinySVM for trade-off between training error and margin. Finally, we test the trained classifier against another one of the remaining two subsets (henceforth named as the evaluation set). We repeat this procedure of training / tuning / testing 10 times, and average the 10 results of test performance."]},{"title":"5.2 Features","paragraphs":["Table 2 lists all the features used for training and testing of SVMs for identifying bilingual synonymous technical terms. Features are roughly divided into two types: those of the first type f1,...,f6 simply represent various characteristics of the input bilingual technical term ⟨tJ ,tE⟩, 3 Here, we divide the set of 134 seed bilingual technical term pairs into 10 subsets so that the numbers of positive (i.e., synonymous with the seed) / negative (i.e., not synonymous with the seed) samples in each CBPi (i =1,...,10) are comparative among the 10 subsets."]},{"title":"200 Table 2:","paragraphs":["Features for Identifying Bilingual Synonymous Technical Terms by Machine Learning class feature","definition ( where X denotes J or E,and⟨sJ ,sE⟩ denotes","the seed bilingual technical term pair )","f1: frequency log of the frequency of ⟨t J ,tE⟩ within the whole parallel","patent sentences features for bilingual","f2: rank of the Japanese term given tE, log of the rank of tJ with respect to the descending order of the conditional translation probability P(tJ | tE) technical terms ⟨tJ ,tE⟩","f3: rank of the English term given tJ , log of the rank of tE with respect to the descending order of the conditional translation probability P(tE | tJ )","f4: number of Japanese characters number of characters in tJ","f5: number of English words number of words in t E","f6: number of times generat-","ing translation by apply-","ing the phrase tables the number of times repeating the procedure of generating translation by applying the phrase tables until generating tE or tJ from sJ ,asinsJ →···→tJ → tE,or,sJ →···→tE → tJ","f7: identity of Japanese terms returns 1 when tJ = sJ f8: identity of English terms returns 1 when tE = sE features for the relation of","f9: edit distance similarity of monolingual terms f9(tX ,sX)=1− ED(tX,sX)","max(|tX|,|sX|) (where ED is the edit distance of tX and sX,and| t | denotes the number of characters of t.) bilingual technical terms","f10: character bigram similarity of monolingual terms f10(tX ,sX)= |bigram(tX)∩bigram(sX)|","max(|tX|,|sX|)+1 (where bigram(t) is the set of character bigrams of the term t.) ⟨tJ ,tE⟩ and the seed","f11: rate of identical morphemes (for Japanese) / words (for English) f11(tX ,sX)= |const(tX)∩const(sX)|","max(|const(tX)|,|const(sX)|) (where const(t) is the set of morphemes (for Japanese) / words (for English) in the term t.)","⟨sJ ,sE⟩ f12: subsumption relation of strings / variants relation of surface forms (for Japanese terms ) returns 1 when the difference of tJ and sJ is only in their suffixes, or only whether or not having the prolonged sound “”, or only in their hiragana parts.","f13: identical stem (for English terms) returns 1 when the numbers of constituent words of t E and sE are the same, and their corresponding constituents have the same stem.","f14: hyphen / space (for English terms) returns 1 when the difference of tE and sE is only whether having hyphen or space.","f15: compositional translation with an existing bilingual lexicon returns 1 when sJ can be compositionally generated by translating constituents of tE with an existing bilingual lexicon, or, sE can be compositionally generated by translating constituents of tJ with an existing bilingual lexicon (Tonoike et al., 2006).","f16: translation by the phrase table returns 1 when sJ can be generated by translating tE with the phrase table, or, sE can be generated by translating tJ with the phrase table. while those of the second type f7,...,f16 represent relation of the input bilingual technical term ⟨tJ ,tE⟩ and the seed bilingual technical term pair sJE = ⟨sJ ,sE⟩."]},{"title":"201","paragraphs":["Among the features of the first type are the frequency (f1), ranks of terms with respect to the conditional translation probabilities (f2 and f3), length of terms (f4 and f5), and the number of times repeating the procedure of generating translation with the phrase tables until generating input terms tJ and tE from the Japanese seed term sJ (f6).","Among the features of the second type are identity of monolingual terms (f7 and f8), edit distance of monolingual terms (f9), character bigram similarity of monolingual terms (f10), rate of identical morphemes / words (f11), string subsumption and variants for Japanese (f12), identical stems for English (f13), hyphen / space of English terms (f14), compositional translation with an existing bilingual lexicon4","(f 15), and translation by the phrase tables (f16)."]},{"title":"5.3 Evaluation Results Table 3:","paragraphs":["Evaluation Results of Automatic Identification of Bilingual Synonymous Technical Terms (%)","Precision Recall F-measure","Baseline (tJ and sJ are identical, or, tE and sE are identical.) 67.0 54.3 60.8","SVM Maximum Precision 97.5 28.7 43.9","Maximum F-measure 73.5 68.1 70.5 Table 4: Examples of Improvement in Automatic Identification of Bilingual Synonymous Technical Terms by SVM","(a) Correctly Judging as “Synonym” only by SVM seed ⟨sJ ,sE⟩ ⟨tJ ,tE⟩ Reference Baseline SVM (Maximum Precision) ⟨ , hold circuit⟩ ⟨ , holding circuit⟩ synonym not synonym synonym","(b) Correctly Judging as “Not Synonym” only by SVM seed ⟨sJ ,sE⟩ ⟨tJ ,tE⟩ Reference Baseline SVM (Maximum Precision) ⟨ , transfer unit⟩ ⟨ , transfer unit⟩ not synonym synonym not synonym","Table 3 shows the evaluation results for a baseline as well as for SVMs. As the baseline, we simply judge the input bilingual term pair ⟨tJ ,tE⟩ as synonymous with the seed bilingual technical term pair sJE = ⟨sJ ,sE⟩ when tJ and sJ are identical, or, tE and sE are identical. When training / testing a SVMs classifier, we tune the lower bound of the confidence measure of the distance from the separating hyperplane in two ways: i.e., for maximizing precision and for maximizing F-measure. When maximizing precision, we achieve almost 98% precision where F-measure is over 40%. When maximizing F-measure, we achieve over 70% F-measure with over 73% precision and over 68% recall.","Table 4 also show examples of improving the baseline by SVMs.","Table 4 (a) shows the case of correctly judging as “synonym” only by the proposed method. Here, the baseline judges as “not synonym”, since neither tJ and sJ nor tE and sE are identical. With the proposed method, on the other hand, f13 returns 1 since “holding” and “hold” have the same stem. Also, f16 returns 1 since, by the phrase tables, “” can be generated by translating “holding circuit”, and “” can be generated by translating “hold circuit”.","Table 4 (b) shows the case of correctly judging as “not synonym” only by the proposed method. Here, the baseline judges as “synonym”, since tE and sE are identical. With the proposed method, 4 As the existing Japanese-English bilingual lexicon, Eijiro (http://www.eijiro.jp/, Ver.79, with 1.6M translation pairs, is used."]},{"title":"202 Figure 2:","paragraphs":["The Procedure of Semi-Automatic Transitive Identification of Bilingual Technical Terms on the other hand, both edit distance similarity f9 and character bigram similarity f10 return 0 for the Japanese terms “” and “ ”. Also, f15 returns 0 since, by compositional translation with an existing bilingual lexicon, “” cannot be generated by translating “transfer unit”, nor “” cannot be generated by translating “transfer unit”."]},{"title":"6 Semi-Automatic Approach to Transitive Identification of Bilingual Synonymous Technical Terms","paragraphs":["Evaluation results of the previous section is satisfactory in terms of precision of identifying bilingual synonymous technical terms. However, its recall is relatively low, which needs to be improved. In this section, we allow semi-automatic approach to the task of identifying bilingual synonymous technical terms. In this approach, we assume that the SVM classifier trained by the procedure of section 5.1 is tuned so that it can achieve high precision against relatively easier instances, while it judges relatively harder instances as not synonymous, resulting in relatively low recall. Based on this assumption, we design a manual process which is responsible for examining whether pairs of bilingual technical terms judged by the SVM classifier as not synonymous are not actually synonymous."]},{"title":"6.1 The Procedure","paragraphs":["The detailed procedure of the semi-automatic approach is presented in this section.","1st step Suppose that we are given the SVM classifier trained by the procedure of section 5.1. Then, for a set CBP(sJ) of candidates of bilingual synonymous technical terms, apply the SVM classifier to every pair uJE = ⟨uJ ,uE ⟩ and vJE = ⟨vJ ,vE⟩ of the members of CBP(sJ ).","2nd step Next, for each member uJE = ⟨uJ ,uE⟩ of CBP(sJ ), collect uJE itself and other member vJE = ⟨vJ ,vE⟩ of CBP(sJ ) judged as synonymous with uJE by SVM into a set X(uJE) (Figure 2 (a))5",". X(uJE)={ vJE = ⟨vJ ,vE⟩ (∈ CBP(sJ )) ∣ ∣ ∣ vJE = uJE, or, vJE is judged as synonymous with uJE by SVM. }","5","Here, if both u1","JE and u2","JE are judged as synonymous with vJE,butu1","JE and u2","JE are judged as not synonymous,","we simply include both u1 JE and u2","JE in X(vJE)."]},{"title":"203 3rd step","paragraphs":["For each bilingual technical term pair uJE = ⟨uJ ,uE⟩ (∈ CBP(sJ )),if |X(uJE)| > 1 holds6",", then manually examine whether uJE is synonymous with the seed bilingual technical term pair sJE, i.e., whether uJE ∈ SBP(sJE) holds (Figure 2 (b)). If so, then collect the members of X(uJE) into XX(sJE) (Figure 2 (c)). Finally, the set XX(sJE) can be regarded as the final output of the procedure for semi-automatic transitive identification of bilingual technical terms that are judged as synonymous with the seed bilingual technical term pair sJE, and can be denoted as the following formula: XX(sJE)= ⋃ uJE∈SBP(sJE) X(uJE)"]},{"title":"6.2 Evaluation Results","paragraphs":["In the evaluation, for each of the 134 seed bilingual technical term pairs, we evaluate the precision, recall, and F-measure of the set XX(sJE). As in the case of the procedure of section 5.1, with the development set, we tune the lower bound of the confidence measure as well as the parameter of TinySVM for trade-off between training error and margin, so that we can control the precision of the set XX(sJE) as over 80%, 85%, 90%, and 95%. Evaluation results against the evaluation set are shown in Table 5. Here, we achieve over 95% precision with more than 50% recall, and over 90% precision with almost 70% recall. As can be clearly seen from these results, by simply transitively merging the results of identifying bilingual synonymous technical terms by SVM, we can improve the recall of bilingual synonym identification task7",". Table 5: Evaluation Results of Transitive Identification of Bilingual Synonymous Technical Terms (%)","Requirement for Precision against the Development Set Precision Recall F-measure > 80% 81.3 89.9 85.1 > 85% 86.9 80.9 83.4 > 90% 91.3 69.1 78.2 > 95% 95.2 53.1 67.9"]},{"title":"7 Related Works","paragraphs":["Among related works on acquiring bilingual lexicon from text, Itagaki et al. (2007) focused on automatic validation of translation pairs available in the phrase table learned by a statistical machine translation model, where their study differs with this paper in that Itagaki et al. (2007) did not study the issue of synonymous bilingual technical terms. Tsunakawa and Tsujii (2008) is mostly related to our study, in that they also proposed to apply machine learning technique to the task of identifying synonymous bilingual technical terms and that the features of machine learning studied in Tsunakawa and Tsujii (2008) are closely related those studied in this paper. However, Tsunakawa and Tsujii (2008) studied the issue of identifying synonymous bilingual technical terms only within manually compiled bilingual technical term lexicon and thus are quite limited in its applicability. Our study in this paper, on the other hand, is quite advantageous in that we start from parallel patent documents which continue to be published every year and then, that we can generate candidates of synonymous bilingual technical terms automatically. 6","This condition means that at least one technical term pair vJE is judged as synonymous with uJE by SVM. Other-","wise, we skip the process of manually examining the pair vJE. 7","In this evaluation, we simply measure the average number of the members uJE of SBP(sJE) for each of which   X(uJE) ","","","=1holds. This number represents that, for how many members of SBP(sJE), we can actually skip","examining whether uJE is synonymous with the seed bilingual technical term pair sJE. Out of the average 12.5","members per seed, in Table 5, the numbers are 0.9 for “> 80%”, 1.4 for “> 85%”, 2.2 for “> 90%”, and 4.0 for “>","95%”, respectively."]},{"title":"204","paragraphs":["Our study in this paper is also different from previous works on identifying synonyms based on bilingual and monolingual resources (e.g. Lin and Zhao (2003)) in that we learn synonymous bilingual technical terms from phrase tables of a phrase-based statistical machine translation model trained with very large parallel sentences.","In Liang et al. (2011), we proposed the framework of applying machine learning technique to the task of identifying bilingual synonymous technical terms in the process of acquiring technical term translation equivalent pairs from parallel patent documents. The major drawback of the framework of Liang et al. (2011) is in its low recall when preferring precision as over 90%. The framework proposed in Liang et al. (2011) is also employed in the first half of this paper, where the major contribution of this paper is in showing that the approach of manually merging synonym candidate sets identified by SVM in the first half of this paper is quite effective in improving low recall reported in Liang et al. (2011)."]},{"title":"8 Conclusion","paragraphs":["In the task of acquiring technical term translation equivalent pairs, this paper studied the issue of identifying synonymous translation equivalent pairs. We applied the SVMs to this task and achieved the performance of almost 98% precision and over 40% F-measure. Then, in order to improve recall, we simply introduced a semi-automatic framework, where we employed the strategy of selecting more than one seeds for each set of candidates bilingual synonymous term pairs. By manually judging whether each pair of two seeds is synonymous or not, we achieved over 95% precision and 50% recall. We are planning to incorporate the results of judgment by SVM when judging whether each pair of two seeds is synonymous or not."]},{"title":"References","paragraphs":["Fujii, A., M. Utiyama, M. Yamamoto, and T. Utsuro. 2008. Toward the evaluation of machine translation using patent information. In Proc. 8th AMTA, pp. 97–106. Fung, P. and L. Y. Yee. 1998. An IR approach for translating new words from nonparallel, comparable texts. In Proc. 17th COLING and 36th ACL, pp. 414–420. Huang, F., Y. Zhang, and S. Vogel. 2005. Mining key phrase translations from Web corpora. In Proc. HLT/EMNLP, pp. 483–490. Itagaki, M., T. Aikawa, and X. He. 2007. Automatic validation of terminology translation consistency with statistical method. In Proc. MT Summit XI, pp. 269–274. Koehn, P., H. Hoang, A. Birch, C. Callison-Burch, M. Federico, N. Bertoldi, B. Cowan, W. Shen, C. Moran, R. Zens, C. Dyer, O. Bojar, A. Constantin, and E. Herbst. 2007. Moses: Open source toolkit for statistical machine translation. In Proc. 45th ACL, Companion Volume, pp. 177–180. Liang, B., T. Utsuro, and M. Yamamoto. 2011. Identifying bilingual synonymous technical terms from phrase tables and parallel patent sentences. In Proc. 12th PACLING, #7. Lin, D. and S. Zhao. 2003. Identifying synonyms among distributionally similar words. In Proc. 18th IJCAI, pp. 1492–1493. Matsumoto, Y. and T. Utsuro. 2000. Lexical knowledge acquisition. In R. Dale, H. Moisl, and H. Somers, eds., Handbook of Natural Language Processing, ch. 24, pp. 563–610. Marcel Dekker Inc. Morishita, Y., T. Utsuro, and M. Yamamoto. 2008. Integrating a phrase-based SMT model and a bilingual lexicon for human in semi-automatic acquisition of technical term translation lexicon. In Proc. 8th AMTA, pp. 153–162. Och, F. J. and H. Ney. 2003. A systematic comparison of various statistical alignment models. Computational Linguistics, 29(1), 19–51. Tonoike, M., M. Kida, T. Takagi, Y. Sasaki, T. Utsuro, and S. Sato. 2006. A comparative study on compositional translation estimation using a domain/topic-specific corpus collected from the web. In Proc. 2nd Intl. Workshop on Web as Corpus, pp. 11–18. Tsunakawa, T. and J. Tsujii. 2008. Bilingual synonym identification with spelling variations. In Proc. 3rd IJCNLP, pp. 457–464. Utiyama, M. and H. Isahara. 2007. A Japanese-English patent parallel corpus. In Proc. MT Summit XI, pp. 475–482. Vapnik, V. N. 1998. Statistical Learning Theory. Wiley-Interscience."]},{"title":"205","paragraphs":[]}]}