{"sections":[{"title":"Annotating the Structure and Semantics of Fables  ","paragraphs":["Oi Yee Kwong","","Department of Chinese, Translation and Linguistics, City University of Hong Kong,","Tat Chee Avenue, Kowloon, Hong Kong","Olivia.Kwong@cityu.edu.hk Abstract. This paper outlines an annotation scheme we developed for a corpus of fables. Reference is made to previous studies on discourse structure and story grammar, as well as discourse relations and text coherence. The applicability and adequacy of the various frameworks for annotating and analysing fables are considered. The current work addresses several issues including the basic units for discourse segments, the distinction between structure and semantics in stories, the characteristics of fables, and the practicality and annotator-friendliness of the annotation scheme. A concise set of structural and semantic tags is thus synergised and applied. Some interim results and future directions are discussed. Keywords: Corpus annotation, Discourse relations, Narrative structure, Fables.   The work described in this paper was supported by a grant from City University of Hong Kong (Project No.","7008064).  Copyright 2011 by Oi Yee Kwong"]},{"title":"1 Introduction","paragraphs":["Stories are distinguished from other genres of discourse by their unique coherent structures and discourse relations. As a special kind of stories, fables share the typical structural and semantic properties of stories, and are often associated with a moral. It is thus even more cognitively demanding to understand fables than stories in general. Apart from the temporal and causal relations among the events happening in the story, one needs to figure out the lesson intended by the storyteller. Interestingly, the same fable could be retold in different ways, where storytellers deploy a wide range of lexico-grammatical constructions, rhetorical devices, and discourse strategies, within specific narrative structures, to convey the moral invariably. Hence, fables are often semantically deep despite their apparently simple structures.","To provide a useful resource for research on story understanding, a corpus containing various published versions of the Aesop’s Fables in English and Chinese is compiled. In this paper, we discuss the annotation scheme developed for marking up the discourse structure and semantics of the fables. In Section 2, we briefly review related work on discourse structure and story structure, and evaluate the applicability and adequacy of the various frameworks for annotating and analysing fables. The issue of basic analysis unit is addressed in Section 3. A concise set of structural and semantic tags is synergised, as described in Section 4 and Section 5. The paper is concluded with the work in progress and future directions in Section 6."]},{"title":"2 Related Work 2.1 Discourse Structure and Relation","paragraphs":["Grosz and Sidner’s (1986) computational model suggests that discourse structure comprises (1) a linguistic structure consisting of the discourse segments and some embedding relationship 25th Pacific Asia Conference on Language, Information and Computation, pages 275–282 275  that can hold between them, (2) an intentional structure accounting for the discourse purpose and individual discourse segment purposes, and (3) an attentional state dynamically recording the objects, properties and relations salient to the participants’ focus of attention as their discourse unfolds. The intentional structure is essential for understanding, but it is the most difficult to identify as it might or might not be readily indicated by surface linguistic devices, and is closely related to discourse participants’ beliefs and shared knowledge.","Mann and Thompson’s (1987) Rhetorical Structure Theory (RST) is considered closely related to the intentional structure in Grosz and Sidner’s model, while it is more functionally oriented. RST aims at giving a descriptive account of discourse relations holding between adjacent text spans, indicating the coherence and structure exhibited among natural text. A text is thus divided into units, essentially clauses, hierarchically structured and functionally organised with respect to a set of discourse relations, e.g. EVIDENCE, ELABORATION, CONCESSION, etc. Each relation defines how the two involved text spans, the nucleus and the satellite, functionally relate to each other with respect to the effect on the reader. RST relations are annotated in many corpora, e.g. the Potsdam Commentary Corpus (Stede, 2004).","Also centering on discourse relations, the annotation in the Penn Discourse Treebank (PDTB) emphasises less on the effect intended on the reader, but focuses on the semantic link between discourse segments. The annotation is mostly lexically triggered with discourse connectives including explicit connectives like subordinating conjunctions, coordinating conjunctions and adverbials, as well as implicit ones inferred by readers (Miltsakaki et al., 2008). A discourse connective is viewed as a predicate taking two abstract objects such as propositions, events, or situations as its arguments (Arg1 and Arg2), the simplest syntactic realisation of which is taken to be a clause. Arg1 and Arg2 are determined by how they are syntactically bound to the discourse connective, which indicates certain directionality as the nucleus/satellite distinction in RST. But unlike RST, PDTB has no restriction on how far an argument can be from its corresponding connective. The sense tags for the discourse connectives fall into four classes: TEMPORAL, CONTINGENCY, COMPARISON and EXPANSION, which are further fine-grained into types and subtypes. Pragmatic sense tags are also defined for rhetorical or pragmatic uses of connectives."]},{"title":"2.2 Story Structure and Story Point","paragraphs":["Story structure is a generally accepted notion (e.g. since Propp’s (1968) analysis of Russian folktales), and its psychological validity has been demonstrated (e.g. Mandler and Johnson, 1977; Thorndyke, 1977). But structure alone is not enough to account for the interestingness of stories, which Wilensky (1982a) attributes to the presence of story “point” arising from the goals and plans of the protagonists, and the conflicts therein.","Although story structure is deemed important, its representation has remained controversial. Rumelhart (1975) put forth a “story schema” defining “grammatical” stories by a set of phrase structure rules, e.g. Story  Setting + Episode, Episode  Event + Reaction, etc. These rules are to be interpreted with a set of semantic interpretation rules, e.g. ALLOW (Setting, Episode). The “grammar” was later revised and extended with transformational rules by Mandler and Johnson (1977), to give more flexibility in the precise ordering of the story constituents in practice. This grammar was further adapted for fables by Ryan (1991, cited in Ryan (2008)).","Hasan (1996), on the other hand, describes the plausible structure of nursery tales in a concise one-line pattern, called Generic Structure Potential (GSP), containing elements like Placement, Initiating Event, Sequent Event, Final Event, Finale, and Moral, with their optionality, ordering, and repetition shown. The meanings associated with individual structural elements and how they are realised by various lexico-grammatical patterns have been analysed for different kinds of stories (e.g. Sano and Thomson, 2007; Tan, 2009).","The notion of story grammar has triggered a series of discussions and debates (e.g. Black and Wilensky, 1979; Mandler and Johnson, 1980; Rumelhart, 1980; Beaugrande, 1982; 276 Fillmore, 1982; Mandler, 1982; Wilensky, 1982b). Wilensky (1982a) argued strongly against story grammar as a “grammatical” story is not necessarily an interesting story. Structure alone does not account for “storiness”. It is not the physical ordering of propositions but features such as goals and plots in a story which should be responsible for a good story. Interesting stories have a “point”, which often arises from conflicting goals. Obviously it involves very sophisticated inference to uncover such conflict, and it is thus more realistic to start our annotation with the semantic relations holding among discourse segments."]},{"title":"2.3 Applicability and Adequacy for Fables","paragraphs":["The various analytical frameworks above are important pointers for our current work, but it appears that none of them is directly adaptable for annotating fables. Some might be underspecified for actual annotation, while others might be inadequate to cover the features specific to fables. For instance, the intentional structure should be important for revealing how the storyteller gets the message across in a fable, and thus story comprehension, but the nature of the intentional structure (as in Grosz and Sidner) has not been very precisely defined and its recognition would involve too much subjective judgement from an annotator.","The elements used in individual frameworks might have mixed different levels of analysis. For example, Rumelhart’s (1975) story schema has been criticised for not being entirely structural, as many components like Consequence and Goal Path can only be determined semantically. Mann and Thompson (1987) also pointed out that the discourse relations in RST like ELABORATION and CONDITION are more semantic or ideational while others like MOTIVATION and ANTITHESIS are more pragmatic or presentational in nature.","The previous studies also worked on different text types, such as simple narratives involving only one protagonist, nursery tales, news reportage, etc. Most are monologues. Nevertheless, fables often involve more than one protagonist and dialogues are abundant. Hence the structural components in story schemas and the discourse relations like those in RST or PDTB may not be all relevant or adequate for fables. Although Grosz and Sidner’s discourse model was intended to account for dialogues, it lacks precise definitions of the structural components and is not ready to be used in annotation directly.","Hence we need to draw on the various frameworks and synergise an annotation scheme addressing our requirements and the features of fables. It is particularly important to separate the structural components from the semantic relations, which would be the focus in this paper. Ideally we also need to take care of the dialogues in fables and the pragmatics therein, but this would be left for the next step. On the practical front, it is also important to ensure the relevant linguistic properties can be feasibly and reliably annotated by most annotators with minimal training. The annotation schemes and the labels used should be relatively straightforward and unambiguous, and the subjective judgment should be minimised, or at least sufficiently guided."]},{"title":"3 Discourse Segmentation","paragraphs":["The first thing we need to operationalise is the unit of analysis. The many previous studies on story structure and discourse models would analyse the structural and semantic relations among discourse segments, locally or globally, but the actual unit often remains vague. Few state very precisely what counts as a discourse segment. For example, in Rumelhart’s (1975) analysis, the stories are said to be “parsed into single propositions”. Nevertheless, the resulting segments might include things which do not exist in the surface text but are only inferred by the reader, e.g. sadness. Mandler and Johnson (1977) pointed out that it may take several sentences in a text or only part of a sentence to form a proposition corresponding to a terminal node in the story structure. RST emphasises the consecutiveness of the text spans and the relation therein (Mann and Thompson, 1987), but the unit under analysis is apparently arbitrary and not precisely defined linguistically. Hence, though discourse segments are often roughly taken to be clausal units, they effectively include different linguistic units like clauses, sentences, or 277  paragraphs, even within the same analytical framework. This flexibility might be convenient for analysis, but it is not systematic enough especially for computational purposes, and the fuzziness often confuses human annotators in practice.","In our annotation, we stick to mostly clausal units as our minimal unit of analysis. Since events and states are important building blocks in a story, clauses expressing individual events and states are the basic discourse segments for our annotation and analysis. Currently only independent clauses, coordinate clauses, and specific types of adverbial clauses1","are treated as separate discourse segments. Others including complement clauses, relative clauses, subject or object clauses, etc. are kept together with the main clause in which they are embedded."]},{"title":"4 Structural Annotation","paragraphs":["It is observed that many of the terminal nodes in Rumelhart’s (1975) schema are absorbed into the intermediate level nodes in Mandler and Johnson’s (1977) schema which eventually all boil down to either state or event2",". In fact, apart from the high level nodes which can really be considered “structural” in nature, revealing the grouping of individual discourse segments into larger chunks, the other nodes are relatively semantic. States and events can possibly be suggested by the lexical items (particularly verbs) in individual discourse segments, but the rest require a lot more inference and sometimes subjective judgement. They can hardly be straightforwardly determined from the lexico-grammatical patterns of the surface text, but rely mostly on the reader’s interpretation of the temporal and causal chains underlying a sequence of events and/or states. Short versions of the fables might have a lot of such intermediate level structural components missing and these gaps would have to be filled by the reader.","To reduce the burden on the annotators so that the structural annotation can be more reliably done, our structural level tags are restricted to a few high level nodes and the terminal nodes, as explained in Table 1. Those at the intermediate level mostly involving semantic interpretation will be incorporated into the semantic annotation as discussed in the next section."," Table 1: Labels for Structural Annotation Structural Tag Definition Setting Setting introduces the background information of a story such as the main","protagonists, the context in which the story takes place, etc. Episode An episode corresponds to a self-contained description of a single incident","happening to the protagonists in the story. Setting and Episode can cover multiple","discourse segments, but are only marked at the first segment of each group. Internal Event An internal event corresponds to the cognitive functions of a protagonist,","including thoughts and plans, perceptions, etc. Internal State An internal state corresponds to the emotion and state of mind of a protagonist. Event An (external) event corresponds to any occurrence or happening in a story such as","an action or a change of state in the world. State A state corresponds to the condition of the world or of a person. Speech All verbal exchanges among the protagonists in the form of conversations and","expressed as direct speech are categorised as speech. Moral The moral is the lesson of the story, often appearing as an additional sentence at","the end to convey the message. ","","1 Adverbial clauses indicating condition, temporal relation, reason, result, purpose, concession, and contrast are treated as individual discourse segments. Other kinds such as those indicating time and place are currently not treated separately.","2 For example, the terminal nodes in Rumelhart’s (1975) scheme include State, Event, Change-of-state, Emotion, Desire, Action, Plan, and Subgoal, whereas Mandler and Johnson’s (1977) scheme has only four terminal nodes, namely State, Event, Internal Event, and Internal State. Others like Plan and Action appear as intermediate level nodes instead, which also include Simple Reaction, Complex Reaction, Goal Path, Attempt, Outcome, etc. 278"]},{"title":"5 Semantic Annotation","paragraphs":["Our semantic annotation focuses on the relation between adjacent text spans which may contain single or composite discourse segments, but we do not force annotators to build a complete hierarchical structure for any story.","As mentioned in the last section, many of the intermediate level nodes in the story schemas are not simply structural, but often involve semantic interpretation. Hence we try to absorb them into the semantic level annotation. With reference to PDTB and RST, as well as story schemas, the discourse semantic relations that are often found in fables and essential for their comprehension are identified and consolidated into a set of semantic labels. Similar to RST, we mark up the relations between two consecutive spans of text, and each span can cover multiple discourse segments. But instead of distinguishing between satellite and nucleus as in RST, or Arg1 and Arg2 as syntactically bound to the discourse connectives like PDTB, we simply identify the two spans bearing a relation, and render them in a tuple like <DSa> (is) <RELATION> (to) <DSb> where DSa can physically precede DSb in the text, or vice versa. In this way, the directionality is preserved, independent of the particular lexical and syntactic realisation of the relation. Hence complementary relations like CAUSE and RESULT can be merged into one, allowing us to use a more compact set of labels to streamline the annotation.","Practicality and annotator-friendliness are also very important. To enable the annotation to be done within a reasonable timeframe, we need to simplify the semantic labels and keep their number manageable, and to make them self-explanatory and easy to apply. So in the current annotation, we use a dozen semantic relation labels drawn from PDTB and RST. They fall into the four classes as in PDTB, namely TEMPORAL, CONTINGENCY, COMPARISON and EXPANSION, but we only maintain two levels of tags. This was done either by renaming the second-level tags in PDTB more specifically, or making them more encompassing, depending on the relevance of the relations to fables and the ease for annotators to identify them. The semantic labels are described below, with their correspondence in PDTB and RST indicated."]},{"title":"5.1 TEMPORAL Sequence","paragraphs":["(PDTB: Asynchronous, RST: SEQUENCE) indicates that the events/states in the two","spans are related temporally, the one in DSb after the one in DSa, as in (1).  (1) DS1 a crane ventured her long neck down the wolf’s throat DS2 and drew out the bone. <DS1> <Sequence> <DS2> ","Synchronous (PDTB: Synchronous, RST: N/A) indicates that the events/states in the two spans","happen (almost) simultaneously, as in (2).  (2) DS1 the cock flew up into a tree DS2 and perched himself on a high branch, DS3 while the dog dozed below at the foot. <DS1> <Sequence> <DS2> <DS1-DS2> <Synchronous> <DS3>  Circumstance (PDTB: N/A, RST: CIRCUMSTANCE) indicates that DSa is the situation where the event in DSb occurs, but they do not really happen in sequential order, as in (3).  (3) DS1 When he finally had to admit defeat, DS2 he retreated DS3 and muttered to himself ... <DS2> <Sequence> <DS3> <DS1 > <Circumstance> <DS2-DS3> 279 "]},{"title":"5.2 CONTINGENCY Reaction","paragraphs":["(PDTB: Cause – reason / result involving reaction, RST: VOLITIONAL CAUSE / VOLITIONAL RESULT / PURPOSE) indicates that the event/state in DSb is an external or internal response or action caused by the event/state in DSa, which could indicate some goal or desire or other things triggering the reaction, as in (4)."," (4) DS1 Moved by his pleas as well as the prospect of the money, DS2 a crane ventured her long neck down the wolf’s throat ... <DS1> <Reaction> <DS2>"," Causal (PDTB: Cause – remaining cases of reason / result, RST: NON-VOLITIONAL CAUSE / NON-VOLITIONAL RESULT) indicates that the event/state in DSb is caused by the event/state in DSa in general, which might not be intended, as in (5)."," (5) DS1 A wolf devoured his prey so ravenously DS2 that a bone got stuck in his throat ... <DS1> <Causal> <DS2>  Condition (PDTB: Condition – general, RST: subset of CONDITION) indicates that the event/state in DSa is a condition which will lead to the event/state in DSb in general, as in (6).  (6) DS1 If you tell lies once, DS2 nobody will believe you the next time. <DS1> <Condition> <DS2>"," Hypothetical (PDTB: Condition – hypothetical / unreal present / unreal past / factual present / factual past, RST: subset of CONDITION) indicates that the event/state in DSa is a condition which will lead to the event/state in DSb, and this is known to be applicable to the current situation but it may not always work this way, as in (7)."," (7) DS1 Had you been satisfied with your own feathers, DS2 you would have escaped the punishment of your betters, and also the contempt of your","equals. <DS1> <Hypothetical> <DS2>"," Fantasy (PDTB: N/A, RST: N/A) is similar to Hypothetical, but the consequence is not likely to be true even if the condition is true in reality. This is something new in our annotation. The logical relationship involving condition is usually taken simply as if X is true then Y is true, but the truth or reality of Y is often ignored. We specify this in our annotation to capture the unrealistic expectation or false conception of the protagonists and the lies they tell, as in (8)."," (8) DS1 If I double my hen’s allowance of barley, DS2 she’ll lay twice a day. <DS1> <Fantasy> <DS2>"]},{"title":"5.3 COMPARISON Contrast","paragraphs":["(PDTB: Contrast – juxtaposition / opposition, RST: CONTRAST / ANTITHESIS)","compares two things with respect to some dimension, as in (9).  (9) DS1 But the one in front is full of his neighbor’s faults; DS2 the one behind, full of his own. <DS1> <Contrast> <DS2> 280 Concession (PDTB: Concession – expectation / contra-expectation, RST: CONCESSION) indicates that the event/state in DSb is not expected to arise from the event/state in DSa, but it happens somehow, as in (10)."," (10) DS1 the fox jumped and sprang many times DS2 but failed in all his attempts. <DS1> <Concession> <DS2>"]},{"title":"5.4 EXPANSION Elaboration","paragraphs":["(PDTB: Conjunction / Instantiation / Restatement / List, RST: ELABORATION / RESTATEMENT) indicates that DSb provides additional information for DSa by giving examples, restating or generalising the situation, etc., as in (11).  (11) DS1 A bear used to boast of his excessive love for humankind, DS2 saying that he never touched or mauled a human corpse. <DS1> <Elaboration> <DS2>  Justification (PDTB: Pragmatic Cause, RST: EVIDENCE / JUSTIFY) indicates that DSb gives evidence or justifies for DSa, as in (12).  (12) DS1 but I don’t see how I could have done anything to the water DS2 since it runs from you to me, not from me to you. <DS1> <Justification> <DS2>"]},{"title":"6 Progress, Future Work and Conclusion","paragraphs":["We have thus outlined the annotation scheme that we have developed for marking up the structure and semantics of fables. To better distinguish between these two levels of analysis, and to increase annotator-friendliness, we have reformulated previous models on discourse and story structure, and consolidated a set of simplified labels for annotating the structural components and discourse relations in our corpus. The scheme has been applied by two annotators on an English version of the Aesop’s Fables, which contains 135 fables, with about 15.7K word tokens, 2.73K word types, and an average of about 116 words per story. Some quantitative comparison between the two annotators in this initial attempt is shown in Table 2 and Table 3 for structural and semantic annotation respectively. As Table 2 shows, despite the difference in the number of discourse segments (DS) excluding morals, the two annotators produced a comparable amount of Events and Speech, but they apparently agree less on States, Internal States and Internal Events. As Table 3 shows, although the two annotators identified a different amount of semantic relations (SR), the distribution over the four major classes of relations is quite similar. Their agreement on the subtypes, however, appears less consistent. More qualitative analysis to reveal the detailed difference in their conception is in progress.  Table 2: Comparison between Annotators on Structural Annotation","Annotator DS Event Int.Event State Int.State Speech 1 1644 68.5% 4.0% 2.3% 0.4% 24.9% 2 1478 65.2% 1.8% 5.7% 1.7% 25.6%  Table 3: Comparison between Annotators on Semantic Annotation","Annotator SR TEMPORAL CONTINGENCY COMPARISON EXPANSION 1 1120 51.3% 12.7% 5.8% 30.2% 2 912 51.8% 11.3% 9.2% 27.7%  281 ","Future development of the annotation needs to account for dialogues and pragmatics. For example, considerable usages of “if” in the fables, especially within dialogues, do not really indicate conditions, but rather, pragmatic conditions. This is especially obvious when the if-condition is followed by a rhetorical question (e.g. if a mere messenger can do as much damage as he’s already done, how shall I withstand the attack of the man who sent him?) which does not really indicate the consequence but rather some assertions. The moves within dialogues and the pragmatics therein, such as warning, sarcasm, regret, lecture, etc., will merit in-depth investigation in their own rights, particularly with respect to the intention of the storyteller. Hence one important future direction we anticipate is to enhance the current structural and semantic annotation with pragmatic annotation. The resulting annotated corpus is expected to contribute a valuable resource for researchers with diverse linguistic interests."]},{"title":"References","paragraphs":["Beaugrande, R. de. 1982. The Story of Grammars and the Grammar of Stories. Journal of","Pragmatics, 6:383-422. Black, J.B. and R. Wilensky. 1979. An evaluation of story grammars. Cognitive Science, 3:213-229. Fillmore, C.J. 1982. Story grammars and sentence grammars: some considerations. Journal of","Pragmatics, 6:451-454. Grosz, B.J. and C.L. Sidner. 1986. Attention, Intention, and the Structure of Discourse.","Computational Linguistics, 12(3):175-204. Hasan, R. 1996. The Nursery tale as a genre. In C, Cloran, D. Butt and G. Williams (Eds), Ways of","Saying: Ways of Meaning. London: Cassell. Mandler, J.M. 1982. Another story of grammars: Comments on Beaugrande’s “The story of","grammars and the grammar of stories”. Journal of Pragmatics, 6:433-440. Mandler, J.M. and N.S. Johnson. 1977. Remembrance of things parsed: story structure and recall.","Cognitive Psychology, 9:111-151. Mandler, J.M. and N.S. Johnson. 1980. On throwing out the baby with the bathwater: A reply to","Black and Wilensky’s evaluation of story grammars. Cognitive Science, 4:305-312. Mann, W.C. and S.A. Thompson. 1987. Rhetorical Structure Theory: A Theory of Text Organization.","ISI Research Report ISI/RS-87-190, University of Southern California. Miltsakaki, E., L. Robaldo, A. Lee and A. Joshi. 2008. Sense Annotation in the Penn Discourse","Treebank. Computational Linguistics and Intelligent Text Processing, Lecture Notes in","Computer Science, Vol 4919, pp.275-286. Propp, V. 1968. Morphology of the Folktale (translated by Laurence Scott). University of Texas,","Austin. Rumelhart, D. 1975. Notes on a schema for stories. In D. Bobrow and A. Collins (Eds.),","Representation and Understanding: Studies in Cognitive Science. New York: Academic Press. Rumelhart, D.E. 1980. On Evaluating Story Grammars. Cognitive Science, 4:313-316. Ryan, M-L. 2008. Story Grammars. In D. Herman, M. Jahn and M-L. Ryan (Eds.), Routledge","Encyclopedia of Narrative Theory. Routledge Ltd. Sano, M. and E. Thomson. 2007. Japanese Folk Tales: text structure and evaluative expressions. In","Proceedings of ASFLA Annual Conference 2007. Stede, M. 2004. The Potsdam Commentary Corpus. In Proceedings of the ACL-2004 Workshop on","Discourse Annotation, Barcelona, Spain, pp.96-102. Tan, X. 2009. Semantic Attributes and Lexicogrammatical Patterns: Genre Analysis of the Event","Sections of Grimm’s Fairy Tales. Journal of Cambridge Studies, 4(1): 50-63. Thorndyke, P.W. 1977. Cognitive structures in comprehension and memory of narrative discourse.","Cognitive Psychology, 9(1):204-215. Wilensky, R. 1982a. Points: A theory for the structure of stories in memory. In W. Lehnert and M.","Ringle (Eds.), Strategies for Natural Language Processing. Hillsdale, NJ: Lawrence Erlbaum,","pp.345-375. Wilensky, R. 1982b. Story Grammars Revisited. Journal of Pragmatics, 6:423-432. 282"]}]}