{"sections":[{"title":"Disfluencies in Consecutive Interpreting among Undergraduates in the Language Lab Environment 1    Kexiu Yin College of Education, De La Salle University 2401 Taft Avenue, Manila, 1004, Philippines yinkexiu@gmail.com   Abstract:","paragraphs":["Consecutive interpreting (CI) has gained increasing popularity and application in today’s world. Fluency is a criterion for CI output assessment. Although disfluencies among CI professionals were investigated in previous studies, little research has been done on the disfluency prevalence among CI undergraduate learners. Nor is the advantage of the language lab facilities studied in terms of helping beginning learners to improve speech fluency. Based on the analysis of 28 recorded CI outputs produced by students in a Chinese university, this paper attempts to identify clearly the frequencies of difluencies. The results show that the problems of overusing fillers and repeated words may be prevalent among CI beginning learners, while notable pause seems to be better controlled in the language lab environment. Then, the causes of the difluencies are explored and pedagogical suggestions are offered.   Keywords: Consecutive interpreting, pause, fillers, repetition, language lab","",""]},{"title":"Introduction ","paragraphs":["Consecutive interpreting (CI) is “a process in which adequate information is orally presented and transferred into another linguistic and cultural system” (Hu, 2006, p. 3). Among the forms of interpreting, e.g. simultaneous interpreting (SI) featured by the dependence on high-tech booth facilities and remote interpreting (RI) featured by the reliance on high speed internet connection, CI is the most frequently adopted for its low cost and moderate requirement on technical support. It is applied in interpreter-on-site business negotiations, press conferences, parent teacher meetings, interviews, and individual consultations. Responding to the increasing social demand for CI interpreters and English users of certain CI skills, a number of universities and colleges in China have offered CI as a compulsory core course for English majors.","In the assessment of CI output, fluency is an important criterion. Since CI output can be regarded as a natural speech delivered in the form of the target language and featured by spontaneous production, CI researchers share the findings on fluency in natural speech studies. Although categorized as disfluencies (Engelhardt et al., 2010; MacGregor et al., 2009; Corley & Stewart, 2008; Shriberg, 1999; Clark & Wasow, 1998), pause, fillers and repetition are by no means tantamount to fluency hindrance. Studies have shown that pause, fillers and repetition may help smooth speech, facilitate understanding and serve different communicative functions (Brennan & Schober, 2001, in Xu, 2010; Tissi, 2000; Hieke, 1981). Further, Clark & Tree (2002) propose moving the status of the fillers um and uh toward that of an interjection. The positive role of disfluecies in spontaneous speech is undeniable. However, it is also beyond dispute that disfluencies impair speech fluency when they exceed acceptable limits. Goffman states that      25th Pacific Asia Conference on Language, Information and Computation, pages 459–466 459 “[natural speech] segments must be patched together without exceeding acceptable limits of pauses, restarts, repetitions, redirections, and other linguistically detectable faults” (1981 in Mead, 2002, p. 78). Evidence also shows that disfluencies can affect language comprehension (Arnold & Tanenhaus, 2011; Xu, 2010; MacGregor, et al., 2009).","The studies aforementioned are based on the corpora of natural conversation and output of professional interpreters. Few, if any, investigations have focused on CI beginning learners. It is clear that these would-be interpreters are not professionals --- hence the limited applicability of the research findings in CI teaching. Besides, the objectives of CI courses at the beginner’s level vary in mainland China, as is the case in Taiwan. Kuo’s (2001) research shows that some of the schools in Taiwan offering CI courses aim to enhance students’ proficiency in listening comprehension and oral expression while some plan to prepare their students for advanced interpreting training at the graduate level. CI beginning learners in mainland China, mostly English majors in universities and colleges, demonstrate considerable difference in learning motivation and language proficiency. Further, had the previous studies investigated the frequencies of disfluencies, it would have been clearer whether pause, fillers and repetition are prevalent among the speakers, interpreters and learners.","This investigation aims at filling this gap. Based on the examination of the frequencies of pause, fillers, and repetition in 28 CI outputs produced by Chinese undergraduates, the investigation attempts to answer the following research questions:","1) What is the frequency of pause occurring in CI learners’ output?","2) What is the frequency of fillers occurring in CI learners’ output?","3) What is the frequency of repetition occurring in CI learners’ output?","4) What pedagogical suggestions can be made to improve CI learner’s fluency? "]},{"title":"Methodology  Participants","paragraphs":["A total of 28 students – 14 females and 14 males – participated in the study. These students were third-year English majors, taking up the course Interpretation 2, and enrolled in the English Department, Dianchi College, Yunnan University, Kunming, China. They had learned English for 9 years and passed the course Interpretation 1 by the time the study was conducted. The sampling validity is ensured by the ratio of 5:5:4 on their English proficiency as high: average: low in female and male groups respectively based on their performance in the courses of English listening, speaking and writing.  Instruments and Environment","The instruments used were the final exam of the course Interpretation 2 and the unstructured interview on their interpretation difficulties. The validity of the exam could be ensured without a pilot test, since it followed the test design of Intermediate-Level Shanghai Interpretation Accreditation, which gains nationwide recognition and is pursued by students at the level of third-year English majors in China. There were two tasks in the exam (see Appendix), Chinese-into-English (C-E) interpretation and English-into-Chinese interpretation (E-C). In the C-E task, a Chinese paragraph was read by the teacher at the normal speed, and then part by part with an interval of about 1 minute for the students to interpret. The paragraph was divided into 4 parts, each containing 2 or 3 sentences. The E-C task followed the same procedure, with a slight difference in that the paragraph was separated into 5 parts.","The other instrument – unstructured interview – was conducted throughout the semester and after the final exam among those who were willing to share their difficulties in practicing the interpretation.","The exam was conducted in an audio-visual language lab, where a total of 60 student booths were connected with the teacher console. Each student booth was equipped with a headset with integral microphone, a monitor and a PC.  Data Gathering Procedure 460","The language lab for the exam was the place where the participants had the practice, training and lectures of the course Interpretation 2 in the semester. The facilities of the language lab ensured that all the participants took the exam in the same environment, i.e. they heard the original utterance to be interpreted exactly at the same time through the headphone and then interpret into the microphone within the same duration for interpreting. The exam lasted for 15 minutes, with the entire process audiotaped and automatically stored on the computers of each booth. The participants were arranged in every four booths so as to minimize the possible influence from her/his classmates, and they were familiar with the environment and the equipment operation in the lab. Also, they had sufficient knowledge of the exam procedure, because there had been similar practices before the final exam. Altogether 28 CI outputs were selected for data analysis with the informed consent of the participants.  Interrating","An M.A. student from the Department of English and Applied Linguistics at De La Salle University was invited to interrate the 28 CI outputs. Since the investigation involves only frequency count, his lack of experience in teaching CI presented no problem for him to be a qualified rater after a short training. The two of us recorded the frequencies of notable pause, fillers, and repetition in the CI outputs independently and then convened to check the results.  Data Analysis","The learners’ use of pause, fillers, and repetition were investigated at two levels: the part level and the task level. There were 4 parts in the C-E task, and 5 parts in the E-C task. Each output contained both tasks. First, the part in which a pause of more than 5 seconds occurred was recorded as “with notable pause”. The ground of setting the criterion in the rating lies in the wide agreement on CI assessment that a pause longer than 5 seconds may be unacceptable to the audience and affect the on-site atmosphere (Lei & Chen, 2006). Second, the frequency of the fillers, er, um, and uh, was counted and recorded in each part. Third, based on the “typical and less typical disfluencies” criteria (Yaruss, 1998), the part was recorded as “with notable repetition” when the same word(s) got repeated adjacently three times or more, e.g. the part with the output that “the Duanwu Festival, also called the Dragon Boat Festival, falls on the, on the, on the fifth day of the fifth months of the Chinese lunar calendar”. Fillers were not taken as a type of repeated words for the purpose of this investigation, although some researchers (Clark & Wasow, 1998; Schachter et al., 1991) classify them under the category of repetition. "]},{"title":"Findings and Discussion  Pause occurring in CI learners’ output","paragraphs":["Pause is a dimension in evaluating speech fluency. As is specified above, a CI part containing a pause of more than 5 seconds was recorded as “with notable pause” in the investigation. Table 1 shows the frequency of the part with notable pause in task C-E and task E-C respectively. Table 1: Frequency of the part with notable pause","F M Task","f % f % Total%","C-E 9 16.1 18 32.1 24.1","E-C 7 10 10 14.3 12.1 NOTE: C-E: N = 4 parts * 14 outputs = 56 parts;","E-C: N = 5 parts * 14 outputs = 70 parts (F& M respectively).","As can be seen, the total frequencies of the part with notable pause in both tasks are less than 25% and thus are not alarming. However, the total frequency in task C-E is almost twice higher than that of task E-C, consistent with the result that the frequencies in task C-E in both female and male groups are much higher than those in task E-C. Also, the frequencies in male group are much higher than those in female group. Accordingly, three inferences may be drawn. First, the problem of notable pause seems to be not prevalent among the participants; second, 461","both female and male participants tend to be more likely to make notable pause in task C-E than","in task E-C; and third, female participants appear to perform better than male participants in","controlling the pause.","While Table 1 presents a general picture of the occurrence of notable pause in the outputs,","Table 2 further shows the frequency of the output with no notable pause.","Table 2: Frequency of the output with no notable pause","F M Task","f % f % Total %","C-E 8 57.1 3 21.4 39.3","E-C 9 64.3 7 50 57.1 NOTE: C-E: N = 14; E-C: N = 14 (F& M respectively).","With the exception of the frequency in task C-E in male group, other frequencies of the output with no notable pause are much higher than 50%. Besides, the frequencies in task E-C are higher than those in task C-E, and the frequencies in both tasks in female group are higher than those in male group. The data indicate that a) most participants were able to produce CI output with no notable pause; b) they performed better in task E-C than in C-E in this regard; and c) female participants had a better control of pause duration.","The results of Table 2 are consonant with those of table 1. The participants’ use of pause could be discussed in three ways. First, the satisfactory control of notable pause by the participants may be attributable to the adequate stress they felt in the exam. In the follow-up interview, participants said they were clearly aware that they could not afford a long pause in such exams as with fixed duration set for interpretation; they also said that when they vaguely heard others around start interpreting they would force themselves to start as well even without a full preparation. Therefore, it seems that adequate stress from the exam may play a positive role in controlling pause. Second, the general better performance in controlling pause in task E-C may relate to the participants’ higher language proficiency of the target language, i.e. Chinese as their L1. Under the exam stress, the participants forced themselves to say something even if they didn’t fully understand the original English utterance. It seems less difficult for them to extemporarily organize sentences in their L1 than in English. Third, the better performance of female group in both tasks may reflect that female participants tend to be more sensitive to the exam stress. In contrast, male learners might be less driven by the fixed time for interpreting and less affected by the environment. It is also possible that the female participants in the study were more proficient in speaking or other relevant language skills.  Fillers occurring in CI learners’ output","Fillers often occurring in speech include er, um, uh and other words of this kind. Table 3 gives the specific averages of fillers in the output used at the task level and the part level.","Table 3: Averages of fillers used at the task level and the part level","F M Total Task","∑f Mean 1 Mean 2 ∑f Mean 1 Mean 2 Mean 1 Mean 2","C-E 268 19.1 4.8 320 22.9 5.7 21 5.25","E-C 209 14.9 3.0 142 10.1 2.0 12.5 2.5","It is noted that the averages of fillers used in C-E at both the task and part levels in total as well as in both female and male groups are almost as twice as those in task E-C. Meanwhile, the averages in both tasks and at both levels present only slight difference between female and male groups. The data indicate that statistically in C-E task each participant tended to use about 5 fillers in each part and thus about 20 in total, and in E-C task each participant tended to employ about 3 fillers in each part and thus about 13 fillers in total. Since there seems to be no available specific criterion of acceptable frequency of fillers in CI assessment, a further examination of the output is necessary. Given that each part in both tasks consists of only 2 or 3 sentences, it is proposed to take an output containing less than 10 fillers in a task as an output with no notable fillers in that task. Table 4 provides the said frequencies in both tasks and the frequencies of the output with no fillers.  462","Table 4: Frequencies of the output with no notable fillers","Task f1 % f2 %","C-E 7 25 2 7.1","E-C 14 50 2 7.1 NOTE: f1= frequency of the output containing less than 10 fillers; f2 = frequency of the output","containing no fillers; C-E: N = 28; E-C: N = 28.","As shown in Table 4, there are less than 10% of outputs containing no fillers in both tasks, and exactly twice as many outputs in E-C task are free of notable fillers. With reference to the findings in Table 3, Table 4 suggests that about half of the participants tended to have the problem of overusing fillers in both C-E and E-C tasks, and the problem may be more prevalent in task C-E. However, it is possible for CI beginning learners to reduce the use of fillers, given the inspiriting finding that approximately one out of ten participants successfully avoided using any filler in the investigation.  Repetition occurring in CI learners’ output","Repetition in most data for the study adds little wanted information in speech and thus affects speech fluency. In the investigation, the part in which reiteration of the same word(s) occurs three times or more was regarded as “with notable repetition.” Table 5 presents the frequency of such parts.","Table 5: Frequency of the part with notable repetition","F M Task","f % f % Total % C-E 33 58.9 36 64.3 61.6 E-C 17 24.3 27 38.6 31.4","NOTE: C-E: N = 56; E-C: N = 70 (F& M respectively). It can be noted that in Table 5, over a half of the parts in task C-E and about one third of","the parts in task E-C were found with notable repetition. The frequencies in female group and","male group present unremarkable difference. Accordingly, it seems that repetition may be","overused by a majority of participants, both females and males, and in C-E task in particular.","Complementarily, Table 6 provides the frequency of the output free of notable repetition.","Table 6: Frequency of the output with no notable repetition","F M Task","f % f % Total %","C-E 2 14.3 3 21.4 17.9","E-C 5 35.7 5 35.7 35.7 NOTE: C-E: N = 14; E-C: N = 14 (F & M respectively).","As shown in Table 6, about 18 percent of C-E outputs and over 35 percent of E-C outputs were found with no notable repetition, and the frequencies present no remarkable differences between female and male groups. The frequencies display the possibility that notable repetition could be avoided by CI learners. Based on the results of Table 5 and Table 6, it seems that the problem of repetition may be prevalent among the participants in task C-E. Yet, there seems to be a lack of supportive data to identify whether the problem is prevalent in task E-C, because the frequency of outputs with notable repetition is roughly the same as that of the outputs free of notable repetition. However, it may be asserted that the problem of repetition could not be neglected in E-C task.","According to Clark & Wasaw (1998), repeated words, as well as fillers, are regarded as forms impairing fluency in spontaneous speech, most of which seem to reflect planning problems (p. 201). This statement explains the finding of the investigation that both repetition and fillers occur more frequently in task C-E than in E-C. In the tasks, the paragraphs to be interpreted were read at normal speed to the students before the part-by-part reading and interpreting so that the students had a general idea of the message to be interpreted. Apart from listening comprehension and memory, the difficulty in planning the CI output may be their proficiency of the target language. Since in E-C task, the target language is their L1, it seems natural that the participants used less fillers and repeated words than in C-E. 463 "]},{"title":"Implications ","paragraphs":["Abused pause, fillers and repetition exceeding acceptable limits are factors impairing speech fluency. The investigation shows that the problems of overusing fillers and repeated words may be prevalent among CI beginning learners, while notable pause seems to be under the participants’ better control in the language lad environment. Thus, pedagogical implications of the study can be gained in the following aspects.","First, adequate stress could help students avoid making notable pause. Selye (1956 in Riccardi, et al., 1998) points out that stress is not a merely negative phenomenon as there is also a positive stress (p. 95-96). In order to realize the positive function of stress in the CI process, a proper design of the practice and exam is of great importance. The mimic environment of a conference, court, interview and situations in which CI is applied could generate adequate stress. Jones (1998) points it out that professional public speaking ability tends to be considered part and parcel of the interpreter’s skills (p. 40). Moreover, a limit of maximum duration of pause could be worked out with the beginning learners and then strictly followed in the routine practice for the purpose of class training, i.e. a pause beyond the limit is to be avoided. Similarly, it is useful for the leaners to appreciate to what extent fillers can detract from fluency, though over-zealous outlawing of all fillers should not be encouraged (Mead, 2005, p. 54). It is worth mentioning that over stress may bring problems as well. With a lack of adequate planning, a rushing start may lead to the abuse of fillers and repeated words.","Second, the prevalence of overusing fillers and repetition calls for the attention and efforts of both undergraduate learners and instructors. It seems necessary to help students realize the problems in their CI output. As Schachter et al. (1991) has observed that one could be shocked by his/her apparent verbal clumsiness characterized by fillers, repeated words, false starts, to name but a few when listening to a tape recording his/her remarks (p. 362). The instructor could suggest that the students listen to the recorded tapes of their own CI output and record the frequencies of fillers and repetition. Then, the students could be suggested to keep a self-evaluation journal on their progress in overcoming the problems of fillers and repetition. In this way, the students may better aware of their problems and make more effective self-regulation.","Third, the general less satisfactory performance of the participants in task C-E than in task E-C reveals the need to improve their English proficiency. Although pause, fillers and repetition distribute and function differently in the speech, research has shown that disfluencies are associated with planning difficulty (Brennan & Schober, 2001, in Xu, 2010; Schachter et al., 1991). It seems safe to infer that notable disfluencies may be related to language incompetence which leads to planning difficulty. Therefore, regular practice on English speaking seems necessary and could be required as routine assignment. Also, memorizing words and reciting essays on topics relevant to C-E tasks may help students improve their language proficiency as well as familiarity with the topics. Fourth, the language lab environment can be explored for both instructor-on-site training and student autonomous learning (instructor-off-site). Since all the computers in the student booths are connected with the teacher console in a language lab, the instructor is able to monitor the interpreting process of several learners at the same time and provide immediate guidance. The facilities also ensure easy grouping and mimic working conditions. On the other hand, the language lab helps improve autonomous learning efficiency. The activities in the lab can be either audio-taped or video-taped, which brings at least two advantages in autonomous learning. One advantage is that the learners may keep adequate stress with the awareness of being recorded. This can be regarded as a positive stimulus compensatory for the absence of the instructor and the classmates as audience. After all, in actual consecutive interpreting the speaker, the interpreter and the audience are generally on-site. The other advantage is that learners can retrieve the record conveniently and then evaluate their own performance. Accurate self-assessment and the awareness of the problems could help learners make adjustment in the autonomous learning. 464","In addition, the study reveals a tendency that female participants performed better than male participants in controlling disfluencies. Further research can be made on whether and how gender, language competence and other variables work on the production of disfluencies.","Based on the above findings and discussion, the study calls for the recognition of disfluency as a fundamental problem in CI learning at the beginner’s level. Despite the constraints that the results can be hardly generalizable due to the limited data and that other variables such as accuracy are excluded from the data analysis, the study at least provides the specific frequency of disfluencies and thus clearly presents the problems among some Chinese undergraduates in CI learning.  "]},{"title":"References ","paragraphs":["Arnold, J. E. and Tanenhaus, M. K. 2011. Disfluency effects in comprehension: How new information can become accessible. In E. Gibson and N. Perlmutter (Eds.) The processing and acquisition of reference (pp. 197-217). Cambridge: MIT Press.","Clark , H. H. and Wasow, T. 1998. Repeating words in spontaneous speech. Cognitive psychology, 37, 201-242.","Clark, H. H. and Tree, J. E. F. 2002. Using uh and um in spontaneous speaking. Cognition, 84, 73-111.","Corley, Martin and Stewart, Oliver W. 2008. Hesitation disfluencies in spontaneous speech: The meaning of um. Language and Linguistics Compass, (4)2, 589-602.","Engelhardt, P. E., Corley, M., Nigg, J. T., and Ferreira, F. 2010. The role of inhibition in the production of disfluencies. Memory and Cognition, (38)5, 617-628.","Hieke, A. 1981. A content-processing view of hesitation phenomena. Language and Speech, (24)2, 147-160.","Hu, Gengsheng. 2006. Adaptation in consecutive interpreting. Perspectives: Studies in Translatology, 14 (1), 3-21.","Jones, R. 1998. Conference interpreting explained. Manchester: St Jerome Press.","Kuo, Hsing-hsiu. 2001. A Cognitive model of consecutive interpretation for teaching undergraduate students. Unpublished Master’s thesis. Taiwan: National Yunlin University of Science & Technology.","Lei, Tianfang and Chen, Jing. 2006. Challenging interpreting: A coursebook of interpreting skills. Shanghai: Shanghai Foreign Language Education Press.","MacGregor, L. J., Corley, M., and Donaldson, D. I. 2009. Not all disfluencies are equal: The effects of disfluent repetitions on language comprehension. Brain & Language, (111)1, 36-45.","Mead, Peter. 2002. Exploring hesitation in consecutive interpreting. In Giuliana Garzone and Maurizio Vizzi (Eds.), Interpreting in the 21st","century (pp.73-82). Philadelphia: John Benjamins North America.","Mead, Peter. 2005. Methodological issues in the study of interpreters’ fluency. The Interpreters’ Newsletter, 13, 39-63.","Riccardi, A., Marinuzzi, G., and Zecchin, S. 1998. Interpretation and stress. The Interpreters’ Newsletter, 8, 93-106.","Schachter, S., Christenfeld, N., Ravina, B., and Bilous, F. 1991. Speech disfluency and the structure of knowledge. Journal of Personality and Social Psychology, 60(3), 362-367.","Shriberg, E. 1999. Phonetic consequences of speech disfluency. Proceedings of International Congress of Phonetic Science (ICPhS), 1, 619-622. San Francisco.","Tissi, Benedetta. 2000. Silent pauses and disfluencies in simultaneous interpreting: A descriptive analysis. The Interpreters Newsletter, 10, 103-127.","Xu, Haiming. 2010. Pauses in conference consecutive interpreting from English into Chinese: An empirical study. Foreign Languages Research (119)1: 64-71.","Yaruss, J. Scott (1998). Real-time analysis of speech fluency procedures and reliability training. American Journal of Speech-Language Pathology (7)2, 25-37. 465  "]},{"title":"Appendix Transcript of the Final Exam for Interpretation 2  Task 1 C-E Interpretation ","paragraphs":["平大大 投 投 大 屈屈彩  屈屈念  屈屈感   Task 2 E-C Interpretation","(1) Perhaps the most interest development of music in the 20th century is jazz. It is unique, totally different from other music types, such as gypsy music, brass band music, and rock music. // (2) Nobody seems to know for sure where jazz got its name. It is said that jazz is derived from a Negro slang to jazz something, which means to play with it, alter it, and mess it up. // (3) However, it is clear that jazz began when the black slaves were brought from the Africa to work in the cotton plantations of the US. These people brought their strong sense of rhythm to the continent. // (4) The early songs of the slaves were sad, as they had little to be happy about. From these, grew the blues, which included bitter-sweet songs. // (5) Apart from the sad life, there must also have been happy occasions. The cheerfulness and high spirits added variation into the blues. Here was the birth of jazz.   About the author Kexiu Yin obtained her M.A degree in English Language and Literature from Yunnan University, China in 2005 and now she is a PhD candidate in De La Salle University-Manila, the Philippines. She is currently a lecturer in the School of Foreign Languages, Yunnan University, China. Her research interests include translation and interpretation studies and sociolinguistics. 466"]}]}