{"sections":[{"title":"The Co-occurrence of Two Delimiters: An Investigation of Mandarin Chinese Resultatives  ","paragraphs":["Jingxia Lin and Chu-Ren Huang"," Department of Chinese & Bilingual Studies","The Hong Kong Polytechnic University, Hong Kong","ctjlin@polyu.edu.hk, churen.huang@inet.polyu.edu.hk    Abstract. Tenny (1987, 1994: 79) proposes the Single Delimiting Constraint that the event described by a verb can only be delimited once (cf. Goldberg 1991, 1995). The constraint applies the effects of delimitedness as an aspectual property to the mapping of semantics and syntax, and explains why sentences with two delimiters (e.g., *Martha wiped the table dry1 clean2 Tenny 1994: 80) are unacceptable. The constraint is challenged with English counterexamples and modified by Matsumoto (2006) and Zhou (2008). However, this study proposes that the constraint holds for Mandarin Chinese resultatives, whereas the revised constraints do not. Furthermore, we point out that while two independent delimiters usually do not co-occur in Chinese, a second delimiter that further specifies or reinforces the endpoint/ endstate denoted by the first delimiter is allowed (cf. Tenny 1994, Goldberg 1991). The results of this study may shed light on event structure of Chinese.  Keywords: Single Delimiting Constraint; Unique Path Constraint; Mandarin Chinese resultatives  "]},{"title":"1 Introduction","paragraphs":["Delimitednes1","refers to “the property of an event’s having a distinct, definite and inherent endpoint in time” (Tenny 1994: 4). For instance, He ate an orange describes a delimited event because eating an orange has a definite endpoint, that is, when the whole orange is eaten; in contrast, the event described in He ran is undelimited because a running event can take place forever if no endpoint is explicitly expressed (Tenny 1994: 4). Tenny (1987, 1994: 79) proposes the Single Delimiting Constraint (SDC) that an event described by a verb can be delimited only once. A similar constraint the Unique Path Constraint (UPC) is proposed by Goldberg (1991: 368-369, 1995) that only one “distinct path” can be predicated of an argument denoting a physical object. The path in the UPC can be understood in two senses, either as a path for physical motion, or as a metaphorical path where the object undergoes a change of state. And the notion of a distinct path entails that the physical object cannot be in two locations or in two states at a time, or in both a location and a state at a time (ibid.). Both the SDC and the UPC apply the effects of delimitedness as an aspectual property to the mapping of semantics and syntax, and explain why sentences such as (1) are not acceptable.  (1) a. *Shirley sailed into the kitchen into the garden. (Goldberg 1991: 368) (two locations)  1 Delimitedness is also called “measuring-out” by Tenny (1994) or “scale” by Hay et al. (1999).  Copyright 2011 by Jingxia Lin and Chu-Ren Huang 25th Pacific Asia Conference on Language, Information and Computation, pages 519–524"]},{"title":"519 ","paragraphs":["b. *Martha wiped the table dry1 clean2. (Tenny 1994: 80) (two states) c. *Sam kicked Bill black and blue1 out of the room2. (Goldberg 1991: 368) (a location+ a state)  Before introducing counterexamples to the SDC and the UPC raised by linguists, we provide a few examples showing what elements can be delimiters, i.e. have a delimiting function. As illustrated in (1), prepositional directionals, e.g., into the kitchen and into the garden in (1a), and adjective resultatives, e.g., dry and clean in (1b), can be the delimiters contributing an endpoint or endstate for an event. In addition, telic verbs or verb phrases by themselves can be delimiting; these include achievements such as arrive and die, and accomplishments such as break and walk three miles (Tenny 1994, among others, cf. Goldberg 1991). According to the SDC and the UPC, no additional resultative is allowed if the verb in a clause is inherently delimiting. For instance, the box being open in (2) can only have a depictive reading, but cannot be understood as a result of the event of arrival (Rappaport Hovav and Levin 2010).  (2) The box arrived open.  Both the SDC and the UPC are found with counterexamples in English according to Matsumoto 2006, Zhou 2008, among others. For instance, two delimiters, e.g., broke and into pieces in (3a), or into thick pieces and into the bowl in (3b), can occur together for the same event.  (3) a. The vase broke1 into pieces2. (Zhou 2008: 229) b. I sliced the cheese into thick pieces1 into the bowl2. (Matsumoto 2006: 7)  For this reason, Zhou (2008) modifies the SDC that changes can be understood on different dimensions (e.g., time, space, property, degree) and delimiters describing changes on different dimensions can co-occur. As in (3a), Zhou points out that break and into pieces can occur together because the former specifies a change on the dimension of property (from being a whole into broken), whereas the latter describes a change on the dimension of degree (e.g., broken into several bigger pieces or into many smaller pieces). Matsumoto (2006:16) also proposes a revised UPC that spatial and non-spatial delimiters can co-occur if they describe aspects of “a single line of development” that an entity follows. For instance, the non-spatial phrase into thick pieces and the spatial phrase into the bowl in (3b) can co-occur because they specify a change of state and a change of location that an entity can undergo in a natural temporal order, that is, cheese is usually placed into a container such as a bowl after it is sliced into pieces. "]},{"title":"2 Chinese Resultatives Consistent with the SDC and the UPC","paragraphs":["We propose that Mandarin Chinese resultatives conform to the SDC and the UPC whereas the revised constraints by Zhou (2008) and Matsumoto (2006) do not hold. For instance, in (4) and (5), the (a) sentences describe a change of state, and the (b) sentences describe a change of location, which according to Zhou (2008), can be understood on different dimensions, and thus are allowed to co-occur by Zhou’s revised constraint. However, as (4c) and (5c) illustrate, these delimiters cannot co-occur for the event of cutting or the event of running.  (4) a. ba cai qie sui BA food cut shattered ‘cut the food into a state of shattered’  "]},{"title":"520 ","paragraphs":["b. ba cai qie dao panzi-li BA food cut arrive plate-inside ‘cut the food into the plate’  c. *ba cai qie sui1 dao panzi-li2 BA food cut shattered arrive plate-inside #‘cut the food into a state of shattered and into the plate” (intended meaning)  (5) a. Zhangsan pao lei le Zhangsan run tired ASP ‘Zhangsan became tired as a result of running.’  b. Zhangsan pao hui xuexiao le Zhangsan run return school ASP ‘Zhangsan ran back to the school.’  c. *Zhangsan pao hui xuexiao1 lei2 le Zhangsan run return school tired ASP #‘Zhangsan ran back to school and became tired as a result.’ (intended meaning)  In addition, it can be understood as a single line of development for food to be chopped into pieces and then moved into a plate, or for a person to become tired after running back to school. Therefore, the ungrammaticality of (4c) and (5c) also indicate that Matsumoto’s (2008) revision of the UPC does not hold for Chinese resultatives. In contrast, (4c) and (5c) become acceptable only if the SDC and the UPC are satisfied. Specifically, for (4c) and (5c) where two delimiters delimit one event, we can add a verb denoting a new (sub)event so that each delimiter delimits only one (sub)event. As illustrated in (6a), when a second verb fang ‘put’ is added, the sentence in (4c) becomes grammatical: the subevent denoted by the first verb qie ‘cut’ is delimited by the first delimiter sui ‘shattered’, whereas the new subevent denoted by fang ‘put’ is delimited by the second delimiter dao panzi-li ‘into the plate’. Besides serialization in (6a), verb copying is another means to satisfy the constraints (cf. Fang and Sells 2007). As in (6b), cf. (5c), the repeated verb contributes a (sub)event for the second delimiter lei ‘tired’ although the (sub)event overlaps with the that denoted by the first verb.  (6) a. ba cai qie sui1 fang dao panzi-li2 BA food cut shattered put arrive plate-inside ‘Cut the food into a state of shattered and put it into the plate”  b. Zhangsan pao hui xuexiao1 pao lei2 le Zhangsan run return school run tired ASP ‘Zhangsan ran back to school and became tired as a result.’  Therefore, although it is claimed that the SDC and the UPC have counterexamples in English, the Chinese resultatives conform to these constraints in that they do not allow the co-occurrence of two expressions that can independently delimit the same event; two independent delimiters co-occur only when there are two (sub)events in a clause.  "]},{"title":"521 3 The Second Delimiter Further Specifying/Reinforcing the First","paragraphs":["Both Tenny (1987, 1994) and Goldberg (1991, 1995) also discuss examples with two delimiters in English, but they argue that in these cases, there is still only one endpoint or endstate for the event. Following Gruber (1965), Tenny points out that a second delimiter is allowed only when it is to further specify the endpoint denoted by the first delimiter. In other words, when the first delimiter specifies a change of location and the resultant location can be “refined or elaborated upon” (Gruber 1965: 82, cf. Hay et al 1999, Kennedy & McNally 2005, among others), a second delimiter can occur in order to describe the location in more detail. For instance, (7a) has two to PPs to delimit the event of transferring the book: although New York in the first to PP can be understood as the endpoint for the path of book transfer, Bill, who is located in New York, is more specific than New York as the endpoint for the path, and thus it is possible for to Bill to occur as the second delimiter; in contrast, (7b) is not allowed because the second to PP is less specific than the first (Gruber 1965, Tenny 1994).  (7) a. John sent the book to New York to Bill. b. *John sent the book to Bill to New York.","(Gruber 1965, cited in Tenny 1994: 78)  Goldberg (1991, 1995) also argues that two directional PPs or adjective resultatives can co-occur if they designate the same path or state. For instance, according to Goldberg (1991), the second PP through the back door modifies the first PP out of the house in (8a), and the two resultatives in (8b) form only one constituent because one is modifying the other.  (8) a. She kicked him out of the house through the back door. b. He washed his face shiny clean. (Goldberg 1991: 370)  In Chinese too, clauses can be found with two delimiting expressions. For instance, both sui ‘shattered’ in (9a) and dao 3-limi zhi 8-limi ‘to 3-8 cm long’ in (9b) describe the endstate of the event of cutting, and they can co-occur in (9c), cf. (4).  (9) a. ba xiaomai jiegan qie sui BA wheat straw cut shattered ‘cut the wheat straw into a state of shattered’ (http://news.sina.com.cn/c/2010-06-09/073717631393s.shtml)  b. ba xiaomai jiegan qie dao 3-limi zhi 8-limi2 BA wheat straw cut arrive 3-cm to 8-cm ‘cut the wheat straw to 3-8cm in length’  c. ba xiaomai jiegan qie sui1 dao 3-limi zhi 8-limi2 BA wheat straw cut shattered arrive 3-cm to 8-cm ‘cut the wheat straw into a state of shattered to 3-8cm in length’ (http://info.china.alibaba.com/news/detail/v0-d1005654608.html)  Following Tenny and Goldberg, we argue that (9c) does not violate the SDC or the UPC. The wheat straw in (9) changes its state when it is shattered. However, “shattered” is not an absolute specification, but can be specified “in greater degrees of accuracy” (Gruber 1985: 82). Therefore, a"]},{"title":"522","paragraphs":["second delimiter ‘to 3-8cm long’ can occur and provide more precise information for the event of cutting. However, unlike English, in addition to the delimiter that further specifies the endpoint/endstate, Chinese allows another type of delimiter to follow an existing delimiter and function to reinforce the attainment of the endpoint/endstate denoted by first delimiter. In other words, the two delimiters in a clause provide the same degree of specification of an endpoint/endstate. For instance, the second delimiter dao ‘arrive’ in (10) does not add new information to the description of the event, but specifies the arrival at the endpoint (the school) which is also the endpoint of the event of returning denoted by hui ‘return’, a delimiting verb that dao ‘arrive’ follows.  (10) a. pao hui xuexiao run return school ‘run back to the school’  b. pao dao xuexiao run arrive school ‘run to the school’  c. pao hui1 dao2 xuexiao run return arrive school ‘run back to the school’  Two more examples are given in (11)-(12), where the state denoted by the second delimiting elements, diao ‘away’ and guang ‘empty’, is also a repetition of the endstate specified by the first delimiting elements: diao ‘away’ in (11b) reinforces the broken state of the vase (a broken vase is understood as a vase that is gone away); and guang ‘empty’ in (12b) reinforces the endstate of the event of forgetting, i.e. that person has been totally forgotten.  (11) a. na-ge huaping da sui le that-CLF vase hit shattered ASP ‘The vase was broken.’  b. na-ge heaping da sui1 diao2 le that-CLF vase hit shattered away ASP ‘That vase was broken.’ (Zhou 2008: 236)  (12) a. Zhangsan ba na-ge ren wang le Zhangsan BA that-CLF person forget ASP ‘Zhangsan forgot that person.’  b. Zhangsan ba na-ge ren wang1 guang2 le Zhangsan BA that-CLF person forget empty ASP ‘Zhangsan [totally] forgot that person.’  The second delimiters such as those in (10)-(12) can occur after a delimiter that denotes a state which either can be absolute specification (e.g., wang ‘forget’) or non-absolute specification (e.g., sui ‘shattered’), whereas the delimiters that further specify the endpoint/endstate of an event, as in"]},{"title":"523","paragraphs":["(9), are only allowed to follow a delimiter with a state that is non-absolute specification, i.e. a state that can be described in greater detail. "]},{"title":"4 Conclusions and future study","paragraphs":["This study shows that although further study is necessary for the inconsistency between the SDC/UPC and English data, Mandarin Chinese conforms to these constraints in that a verb can have only one delimiting expression. That is, the event denoted by the verb can only have one endpoint or endstate. When two elements with delimiting function are found in a predication in Chinese, the two actually express the same endpoint or endstate, with the latter either further specifying or reinforcing the endpoint or endstate denoted by the former. The results of this paper may illuminate the study of event structure of Chinese, especially the identification of delimited events and their constituents. The future study will verify our proposal through a corpus-based investigation of whether two expressions are found to independently delimit an event. Furthermore, the event types will also be analyzed when two delimiters co-occur and have one further specifying or reinforcing the other.   References Fang, J. and P. Sells. 2007. A Formal Analysis of the Verb Copy Construction in Chinese. In T.H. King and M. Butt, eds., Proceedings of the LFG07 Conference. CSLI On-line Publications. Goldberg, A. E. 1991. It can’t go up the chimney down: Paths and the English resultative. In Proceedings of the Berkeley Linguistic Society 17, 368-378. Goldberg, A. E. 1995. Constructions: A Construction Grammar Approach to Argument Structure. Chicago: University of Chicago Press. Gruber, J. S. 1965. Studies in Lexical Relations. Doctoral dissertation, MIT, Cambridge, MA. Hay, J., C. Kennedy and B. Levin. 1999. Scalar structure underlies telicity in “degree achievements”. In T. Mathews and D. Strolovitch, eds., Semantics and Linguistic Theory IX, pp. 127-144. Ithaca: CLC Publications. Kennedy, C. and L. McNally. 2005. Scale structure and the semantic typology of gradable predicates. Language, 81, 2: 345-381. Mastumoto, Y. 2006. Constraints on the co-occurrence of spatial and non-spatial paths in English: A close look at the Unique Path Constraint. Paper presented at the Fourth International Conference on Construction Grammar, University of Tokyo, Tokyo, September 2006. Rappaport Hovav, M. and B. Levin. 2010. Reflections on manner/result complementarity. In E. Doron, M. Rappaport Hovav, and I. Sichel, eds., Syntax, Lexical Semantics, and Event Structure, pp. 21-38. Oxford: Oxford University Press. Tenny, C. 1987. Grammaticalizing Aspect and Affectedness. PHD dissertation, MIT, Cambridge. Tenny, C. 1994. Aspectual Roles and the Syntax-semantics Interface. Dordrecht: Kluwer. Zhou, C. 2008. Danyi jiehua xianzhi yu BREAK lei jieguo jushi de tuidao [The Single Delimiting Constraint and the derivations of BREAK-type resultative constructions]. Xiandai Waiyu [Modern Foreign Languages], 31: 228-237. "]},{"title":"524","paragraphs":[]}]}