{"sections":[{"title":"The Order of Mandarin Chinese Motion Morphemes and the “Scalar Specificity Constraint”","paragraphs":["*",""," Jingxia Lin","","Department of Chinese & Bilingual Studies","The Hong Kong Polytechnic University","GH618, The Hong Kong Polytechnic University, Hong Kong","ctjlin@polyu.edu.hk   Abstract. This study investigates semantic constraints affecting the order of motion morphemes in Mandarin multi-morpheme motion constructions (e.g., tui-hui recede-return). It classifies Chinese motion morphemes into three major types and proposes a “Scalar Specificity Constraint” to account for the order in multi-morpheme motion constructions. The constraint not only provides a better coverage of the data of Chinese motion constructions from the perspective of the syntax-semantics interface, but also illuminates the distribution of motion verbs in other serial verb languages.   Keywords: order of motion morphemes, Scalar Specificity Constraint, Mandarin Chinese "]},{"title":"1 Introduction","paragraphs":["Mandarin Chinese (hereafter “Chinese”) often expresses directed motion events through a concatenation of verbal morphemes, e.g., gun „roll‟ and jin „enter‟ in gun-jin shui-li „roll into the water‟. 1","However, the order of these co-occurring motion morphemes is not flexible, e.g., *jin-gun shui-li enter-roll water-inside. This paper first reviews previous studies on the order of Chinese motion morphemes, and then provides proposals that can better explain the order. "]},{"title":"2 Previous Studies","paragraphs":["This section reviews previous studies on the order of motion morphemes in Chinese MMMCs, and shows that a more refined proposal is still necessary. "]},{"title":"2.1 RVC and the Morpheme Order","paragraphs":["Previous studies (e.g., Li and Thompson (1981), among others) treat Chinese motion constructions as a type of resultative verbal compounds (RVC), in which the second morpheme specifies the direction of motion as a result of the action denoted by the first morpheme (Li and Thompson 1981). For instance, in (1a) and (1b), the second morpheme luo „fall‟ and jin „enter‟ are understood as the results of the event of rolling.  (1) a. huapo chu buduan you xuanshi gun-luo landslide place continuously have hanging.stone roll-fall  * This paper is partially based on my dissertation. I would like to thank Beth Levin and Chaofen Sun for their insightful advice on the dissertation and Chu-Ren Huang for his helpful comments on the draft of the paper. The usual disclaimers apply. 1 This paper uses the term “motion morphemes” instead of “motion verbs” because previous studies have not reached a consensus on the lexical status of some motion morphemes. The lexical status of Chinese motion morphemes is not the focus of this study.  Copyright 2011 by Jingxia Lin","25th Pacific Asia Conference on Language, Information and Computation, pages 525–532 525","„There were hanging stones continuously rolling and falling from the place of","landslide‟ (PKU Corpus)2","","b. na-kuai tiaoshi gun-jin-le yan-xia de shui-jian that-CLF square.stone roll-enter-ASP cliff-below REL water.stream „That square stone rolled into the stream under the cliff.‟ (PKU Corpus)  However, the RVC account cannot explain why when luo „fall‟ and jin „enter‟ co-occur, only luo precedes jin (2a), but not vice versa (2b), given that both morphemes can have a result understanding, as (1a) and (1b) illustrate. (2) a. huran yi-kuai shizi luo-jin-le shui-li suddenly one-CLF pebble fall-enter-ASP water-inside","„Suddenly, a pebble fell into the water.‟ (PKU Corpus) b. *huran yi-kuai shizi jin-luo-le shui-li","suddenly one-CLF pebble enter-fall-ASP water-inside "]},{"title":"2.2 Temporal Sequences and the Morpheme Order","paragraphs":["Tai (1985: 50, also Li 1993) proposes that in Chinese, “the relative word order between two syntactic units is determined by the temporal order of the states” denoted by the units. While this principle holds for the order of motion morphemes denoting subevents with a sequential temporal relationship, it is unable to account for MMMCs where the motion morphemes denoting simultaneous subevents. For instance, a person can run and ascend stairs at the same time, especially if the person stands at the lower ends of the stairs before running, but only can pao „run‟ occurs before shang „ascend‟, but not vice versa, as in (3).  (3) a. ta pao-shang louti he run-ascend stairs „He went up the stairs running.‟ b. *ta shang-pao louti he ascend-run stairs "]},{"title":"2.3 Two-way Classification of Motion Morphemes and the Morpheme Order","paragraphs":["Talmy (1975, 2000) classifies motion morphemes into two types. One type is manner-of-motion morpheme that specifies how a motion event is carried out, e.g., gun „roll‟, pao „run‟. The other is path morpheme that specifies in which direction a motion event is carried out, e.g., luo „fall‟, jin „enter‟. When a manner-of-motion morpheme and a path morpheme occur together in a construction, the former must precede the latter, as in (1a) and (1b). However, as illustrated in (2), the two path morphemes luo „fall‟ and jin „enter‟ can occur together, and when they co-occur, luo can only occur before jin, but not vice versa. Therefore, the two-way classification is unable to account for the order of two co-occurring path morphemes. "]},{"title":"2.4 Four-way Classification of Motion Morphemes and the Motion Morpheme Hierarchy","paragraphs":["Based on recent study on “scale structure” (Rappaport Hovav and Levin 2010, Kennedy and McNally 2005), Lin and Peck (2011) classify Chinese motion morphemes into four types according to the type of scale each lexicalizes. A path is composed of contiguous points ordered between the starting point of motion and a reference object; the path can be understood as a scale because its ordered points indicate measurement values on the dimension of distance (Rappaport Hovav and Levin 2010). When the moving object change its location along the path,  2 PKU Corpus in this paper refers to the corpus of Modern Mandarin Chinese constructed by the Center for Chinese Linguistics at Beijing University. The corpus has 307,317,060 characters updated on 7/20/2009. See http://ccl.pku.edu.cn/. Abbreviations in this paper: ASP = Aspect marker; CLF = Classifier; REL = Relative clause marker. 526 the value changes too, so the change is understood as a scalar change which is measurable (Rappaport Hovav and Levin 2010). According to Lin and Peck, motion morphemes are first classified into scalar change (e.g., luo „fall‟, hui „return‟, jin „enter‟, equivalent to Talmy‟s (1975) path verbs) and nonscalar change motion morphemes (e.g., gun „roll‟, equivalent to Talmy‟s (1975) manner-of-motion verbs) depending on whether they lexicalize a scale or not. Scalar change motion morphemes are then classified into open scale (e.g., luo „fall‟) and closed scale motion morphemes (e.g., hui „return‟, jin „enter‟) depending on whether the scales have endpoints or not. Closed scale motion morphemes are classified into multi-point (e.g., hui „return‟) and two-point closed scale motion morphemes (jin „enter‟) depending on whether the scales have only two points (starting point and end point) or multiple points, i.e. whether the motion is instantaneous or durative. A set of independent diagnostics is proposed by Lin and Peck to determine which type each Chinese motion morpheme falls into. Then, they propose a Motion Morpheme Hierarchy formed of the four types of morphemes to predict the order of motion morphemes. In this hierarchy, nonscalar change motion morphemes are located at the farthest left, followed by open scale, multi-point closed, and two-point closed scale motion morphemes, as in (4).  (4) Nonscalar change (a): gun „roll‟ pao „run‟ fei „fly‟ zou „walk‟ etc.","Open scale (b): luo „fall‟ shang „ascend‟ xia „descend‟ tui „recede‟ sheng „ascend‟ etc.","Multi-point closed scale (c): hui „return‟ lai „come‟ qu „go‟ etc.","Two-point closed scale (d): jin „enter‟ chu „exit‟ dao „arrive‟ etc. According to Lin and Peck, in a motion construction, the motion morphemes are ordered from left to right according to how their types appear in the hierarchy. For instance, gun „roll‟ is located to the left of luo „fall‟ and jin „enter‟ in the hierarchy, so gun „roll‟ must occur before luo „fall‟ and jin „enter‟ when they co-occur, as in (1a) and (1b), respectively. Similarly, luo „fall‟ is located to the left of jin „enter‟ in the hierarchy, so luo „fall‟ must precede jin „enter‟, as in (2a). The hierarchy is able to account for a large amount of data in Chinese, as shown in the corpus studies by Lin and Peck.3"," However, Lin and Peck do not provide explanation why this hierarchy emerges; in addition, the hierarchy is a generalization of the morpheme order in existing Chinese motion constructions, but it does not explain why some combinations of motion morphemes do not exist in Chinese although they are allowed by the hierarchy. For instance, the hierarchy predicts that hui „return‟ as a multi-point closed scale motion morpheme can occur before jin „enter‟, which is a two-point closed scale motion morpheme, but these two morphemes seldom co-occur in Chinese, as in ??hui-jin fangjian return-enter room #„return into the room‟. Therefore, a more refined explanation is necessary for the order of motion morphemes in Chinese. "]},{"title":"3 Our proposal: Revised Motion Morpheme Hierarchy and the Scalar Specificity Constraint","paragraphs":["In section 3.1, we propose a revised motion morpheme hierarchy that can better predict the order in MMMCs. The hierarchy is verified by two corpus-based studies of recent Chinese novels. In Section 3.2, we propose the Scalar Specificity Constraint to account for why the hierarchy holds.  3 Lin and Peck (2011) do not treat the deictic motion morphemes lai ‘come’ and qu ‘go’ in construction-final position as real motion morphemes, as in pao-jin-lai run-enter-come ‘run in towards the deictic center’ and pao-jin fangjian lai run-enter room come ‘run into the room towards the deictic center’. Therefore, their hierarchy does not include the distribution of such lai ‘come’ or qu ‘go’. 527 "]},{"title":"3.1 Revised Motion Morpheme Hierarchy","paragraphs":["We observe that multi-point and two-point closed scale motion morphemes usually do not co-occur, for instance, *lai-jin come-enter, *hui-chu return-exit. The only exception is the two-point closed scale motion morpheme dao „arrive‟; dao can occur after all types of motion morphemes, including morphemes of its own type, i.e. two-point closed scale motion morphemes such as jin „enter‟ and chu „exit‟, as in (5).  (5) gun/luo/hui/jin-dao xuexiao roll/fall/return/enter-arrive school „roll to/fall to/return to/enter the school‟  Therefore, to better reflect the possible motion constructions that exist and do not exist in Chinese, we propose a revised Motion Morpheme Hierarchy in which multi-point and two-point closed scale motion morphemes are grouped together, whereas the special motion morpheme dao „arrive‟ is listed separately in a box with dotted-line border in the rightmost position of the hierarchy; the new hierarchy is given in (6).  (6) Nonscalar change (a): gun „roll‟ pao „run‟ fei „fly‟ zou „walk‟ etc.","Open scale (b): luo „fall‟ shang „ascend‟ xia „descend‟ tui „recede‟ sheng „ascend‟ etc.","Multi-point closed scale (c): hui „return‟ lai „come‟ qu „go‟, etc. Two-point closed scale (d): jin „enter‟ chu „exit‟, etc.","Special motion morpheme (e): dao „arrive‟ Two corpus-based studies of recent Chinese novels are carried out to verify the hierarchy. In the first study, we collect all MMMCs from selected chapters of four Chinese novels 4","and investigate whether the motion morphemes in those MMMCs are in an order consistent with the hierarchy. A total of 231 MMMCs are found consisting of two motion morphemes (the deictic motion morphemes lai „come‟ and qu „go‟ are not treated as a real motion morpheme, see Footnote 4). 5","Figure 1 illustrates the types of the 231 two-motion-morpheme MMMCs, along with their frequencies of occurrence. As Figure 1 shows, the morpheme order in 230 MMMCs is consistent with the hierarchy, whereas one MMMC is in an order that is not predicted by the hierarchy, i.e. the MMMC consisting of an open scale motion morpheme followed by a nonscalar change motion morpheme. This exception is given in (7).  (7) yiwusuoyou de piaopiao sheng-fei with.nothing MOD drifting scend-fly „[She] is ascending and flying in a drifting manner; nothing is with her.‟ (Kongzhong Xiaojie)  4 The corpus data includes the entire novel of Taiyang Chushi ‘The Sun was Born’ by Chi Li in 1992 (35,433 characters), the first six chapters from Diqiu de Hong Piaodai ‘The Earth’s Red Flying Ribbon’ by Wei Wei in 1998 (34,108 characters), the entire novel of Kongzhong Xiaojie ‘Flight Attendant’ by Wang Shuo in 1985 (29,185 characters), the first twelve chapters of Taiyang Zhao zai Sangganheshang by Ding Ling in 1952 (28,935 characters). 5 Thirteen MMMCs consisting of three motion morphemes (the final morpheme is not deictic lai ‘come’ or qu ‘go’) are found in the two corpus studies. For instance, duo-hui-dao zhouzi-pang stroll-return-arrive table-side ‘stroll back to the table’. The morpheme order of all these MMMCs is found to be consistent with hierarchy. However, no further discussion is given in this paper because of space limit. 528  However, (7) does not represent a strong challenge to the hierarchy for two reasons. First, the study finds 36 MMMCs consisting of a nonscalar change (e.g., zou „walk‟, pao „run‟) and an open scale motion morpheme (e.g., shang „ascend‟, xia „descend‟). Sheng-fei ascend-fly is the only instance in which the open scale motion morpheme precedes the nonscalar change motion morpheme. Second, in order to determine whether sheng „ascend‟ must precede fei „fly‟ whenever they occur together, both the orders, sheng-fei ascend-fly and fei-sheng fly-ascend, are searched for in the PKU Corpus. The results show that fei always precedes sheng. Therefore, it is likely that the instance of sheng-fei ascend-fly in (7) is a nonce use by the author.   Figure 1."]},{"title":"Frequencies of the types of two-motion-morpheme MMMCs ","paragraphs":["In the second corpus study, we choose the most frequently used motion morphemes from each type of motion morphemes found in Corpus Study 1. These morphemes are then searched for in the novel category of the PKU Corpus, and their relative order with the co-occurring motion morphemes are investigated.6","Table 1 lists the morphemes investigated.7"," ","Table 3 Motion morphemes to be investigated in Corpus Study 2 Morpheme types in the hierarchy Nonscalar change motion morpheme Open scale motion morpheme (Multi-point /two-point) closed scale motion morpheme dao „arrive‟ Motion morphemes investigated zou „walk‟ pao „run‟ shang „ascend‟ xia „descend‟ hui „return‟ chu „exit‟ dao „arrive‟  Figures 2-8 display the distribution of each key morpheme in two-morpheme MMMCs. In each figure, there are three columns, with the middle column representing the key morpheme, the column to its left representing the number of occurrences of different types of motion morphemes that precede the key morpheme, and the column to its right representing the number of occurrences of different types of motion morphemes that follow the key morpheme in MMMCs. Take Figure 2, for example: the motion morpheme in the middle column is zou „walk‟, which is the key morpheme. In total, 334 instances of zou were found to occur in MMMCs. The column to its right represents the different types of motion morphemes that occur  6 To make the manual analysis feasible, only the first 1,000 instances of each motion morpheme searched for in the novel category of the PKU Corpus were selected and analyzed. However, there are instances in which the morpheme searched for is not used in a MMMC, or even not used as a motion morpheme. Therefore, the numbers of MMMCs collected for analysis is much less than 7,000 (1,000 for each motion morpheme), as shown in Figures 2-8. 7 Multi-point closed scale and two-point closed scale motion morphemes (other than dao „arrive‟) do not co-occur, so they were grouped together as closed scale motion morphemes. 35 56 128 3 8 1 0 20 40 60 80 100 120 140 nonscalar change + open scale nonscalar change + multi-point closed scale nonscalar change + two-point closed scale open scale + multi-point closed scale open scale + two-point closed scale open scale + nonscalar change 529 after zou: 99 instances of dao „arrive‟, 201 instances of closed scale motion morphemes (including both multi-point closed and two-point closed scale motion morphemes, e.g., hui „return‟ in zou hui-lai walk return-come, jìn „enter‟ in zou-jin shangdian walk-enter store), and 34 instances of open scale motion morphemes (e.g., shang „ascend‟ in zou-shang che walk-ascend car). The column to the left of the zou column represents the types of motion morphemes that precede zou in MMMCs. However, as illustrated in Figure 2, no motion morpheme occurring before zou was found in the corpus search. The figures show that the distribution of the key motion morphemes in MMMCs is consistent with the revised hierarchy. Among them, Figure 8 shows that dao „arrive‟ can follow any type of motion morphemes. Other than dao, two closed scale motion morphemes do not co-occur, as predicted by the hierarchy. "," Figure 2. Zou „walk‟ Figure 3. Pao „run‟ "," Figure 4. Shang „ascend‟ Figure 5. Xia „descend‟ "," Figure 6. Hui „return‟ Figure 7. Chu „exit‟ 0 334 34 201 99 0 50 100 150 200 250 300 350 400","M preceding zǒu (0%)","zǒu 'walk' M following zǒu (100%) dào ‘arrive’ closed scale open scale nonscalar change 0 327 1 183 143 0 50 100 150 200 250 300 350","M preceding pǎo (0%)","pǎo 'run' M following pǎo (100%) dào ‘arrive’ closed scale open scale nonscalar change 28 0 28 0 5 10 15 20 25 30 M preceding shànɡ (100%) shànɡ 'ascend'","M following shànɡ (0%) dào ‘arrive’ closed scale open scale nonscalar change 29 1 30 0 0 5 10 15 20 25 30 35 M preceding xià (100%)","xià 'descend' M following xià (0%) dào ‘arrive’ closed scale open scale nonscalar change 36 4 119 79 0 20 40 60 80 100 120 140","M preceding huí (33.6%)","huí 'return' M following huí (66.4%) dào ‘arrive’ closed scale open scale nonscalar change 82 0 3 85 0 20 40 60 80 100","M preceding chū (100%)","chū 'exit' M following chū (0%) dào ‘arrive’ closed scale open scale nonscalar change 530  Figure 8. Dao „arrive‟ "]},{"title":"3.2 The Scalar Specificity Constraint","paragraphs":["We propose the “Scalar Specificity Constraint” that explains why the hierarchy in (6) emerges: the morpheme that is less specific about the scale in a motion event must precede the morpheme with more specific scalar information. In the remainder of this section, we first elaborate how the constraint gives rise to the hierarchy, including why two closed scale motion morphemes usually do not co-occur, then turn to dao „arrive‟ and give explanation why it can be exception.  -The Scalar Specificity Constraint gives rise to the Revised Motion Morpheme Hierarchy The Scalar Specificity Constraint requires a morpheme with more specific information about the scale to follow the one with less information; this explains why the hierarchy in (6) emerges.","First, in terms of degree of specification about a scale, nonscalar change motion morphemes (e.g., gun „roll‟) do not provide any information about the scale, open scale motion morphemes (e.g., luo „fall‟) specify the existence of a scale, whereas (both multi-point and two-point) closed scale motion morphemes such as hui „return‟ and jin „enter‟ not only specify the existence of a scale, but also the existence of an endpoint for the scale. Therefore, to satisfy the Scalar Specificity Constraint, when these morphemes form a hierarchy to predict morpheme order, they must follow an order as represented by the three boxes with solid-line border in (6).","Second, in terms of the degree of specification of a scale, a two-point closed scale motion morpheme (e.g., jin „enter)‟ is not more specific than a multi-point closed scale motion morpheme (e.g., hui „return)‟, or vice versa: both specify the existence of a scale and the existence of an endpoint for the scale. Therefore, conforming to the Scalar Specificity Constraint, two closed scale motion morphemes do not co-occur, as in *hui-jin fangjian return-enter room. This explains why the two types of morphemes should be grouped together in (6).","Compared with the Motion Morpheme Hierarchy proposed by Lin and Peck (2011), the revised hierarchy and the Scalar Specificity Constraint provide a more precise prediction of the morpheme order and a better coverage of the motion constructions in natural Chinese data.  -Dao „arrive‟ as a special motion morpheme The two-point closed scale motion morpheme dao „arrive‟ can follow other closed scale motion morphemes, as in hui-dao fangjian return-arrive room „return to the room‟ and jin-dao fangjian enter-arrive room „enter the room‟, whereas other two-point closed scale motion morphemes such as jin „enter‟ cannot follow another closed scale motion morpheme, as in *hui-jin fangjian return-enter room and *lai-jin fangjian come-enter room. In terms of the degree of specification of scale information, dao „arrive‟ is as specific as other two-point closed scale motion morphemes, i.e. they all specify the existence of a scale, as well as the existence of an endpoint for the scale. Therefore, the fact that dao „arrive‟ can follow closed scale motion morphemes represents an exception to the Scalar Specificity Constraint.","Lin (to appear) points out that although dao „arrive‟ lexicalizes a closed scale, it does not specify information about the direction in which a moving object moves to the reference object, nor what kind of reference object is involved in the motion event. In contrast, the other two-38 45 56 139 0 0 50 100 150","M preceding dào(100%) dào ‘arrive’","M following dào (0%) dào ‘arrive’ closed scale open scale nonscalar change 531 point closed scale motion morphemes such as jin „enter‟ and chu „exit‟ are highly specific about the reference object and path: jin „enter‟ expresses a boundary-crossing motion event involving motion from the outside to the inside of an enclosed region, whereas chu „exit‟ expresses a similar event in a reverse direction. For instance, jin „enter‟ and chu „exit‟ only select NPs expressing enclosed regions (e.g., house, but not table) as their complements, as in (6), whereas dao „arrive‟ can take any kind of reference object NPs as its complements, as in (7)."," (6) xiaomao jin fangzi-li/*zhuozi-shang le kitty enter house-inside/table-on.top.of ASP „The kitty entered the house/#The kitty entered on top of the table.‟ (7) xiaomao dao fangzi-li/zhuozi-shang le","kitty arrive house-inside/table-on.top.of ASP „The kitty went inside the house/The kitty went onto the table.‟  For this reason, when dao „arrive‟ occurs with another closed scale motion morpheme, it does not add new information about the reference object or path that may be different from or incompatible with the information denoted by the co-occurring motion morpheme. This explains why dao „arrive‟ can follow all kinds of motion morphemes, whereas jin „enter‟ and chu „exit‟ cannot. It also indicates that dao „arrive‟ should be treated as a special motion morpheme that the Scalar Specificity Constraint does not apply to. "]},{"title":"4 Conclusions","paragraphs":["To conclude, this paper proposes a revised Motion Morpheme Hierarchy that can better predict the order of motion morphemes in the description of directed motion events. In addition, it proposes the Scalar Specificity Constraint that accounts for why the hierarchy is valid, and explains why dao „arrive‟ behaves as an exception to the constraint. The results of this study not only shed light on the role of the scalar specificity a motion morpheme lexicalizes in determining the morpheme‟s distribution, but also may be extensible to the ordering of motion verbs/morphemes in other serial verb languages such as Thai (cf. Thepkanjana 1986, Muansuwan 2000) and Ewe (cf. Ameka and Essegbey 2001).   References Ameka, F. and J. Essegbey. 2001. Serialising languages: satellite-framed, verb-framed or neither. Paper presented at The 32nd Annual Conference on African Linguistics. University of California, Berkeley. Li, C. and S. Thompson. 1981. Mandarin Chinese: a Functional Reference Grammar. Berkeley: University of California Press. Li, Y. 1993. Structural head and aspectuality. Language (69), 480-504. Lin, J. To appear. The figure‟s final location must be identifiable: Localizer distribution in Chinese directed motion construction. Proceedings of the 37th","Annual Meeting of the Berkeley Linguistics Society. Lin, J. and J. Peck. 2011. The syntax of multi-morpheme motion construction in Chinese: An analysis based on scale structure. Studies in Language, 35(2), 337–379. Muansuwan, N. 2000. Directional serial verb constructions in Thai. In Proceedings of the 7th"," International HPSG Conference, UC Berkeley. Stanford: CSLI Publications. Rappaport Hovav, M. and B. Levin. 2010. Reflections on manner/result complementarity. In E. Doron, M. Rappaport Hovav, and I. Sichel, eds., Syntax, Lexical Semantics, and Event Structure, pp. 21-38. Oxford: Oxford University Press. Tai, J. H-Y. 1985. Temporal sequence and word order. In John Haiman, ed., Chinese. Iconicity in Syntax, pp. 49-72. Amsterdam: John Benjamins. Talmy, L. 1975. Semantics and Syntax of Motion. In John Kimball, ed., Syntax and Semantics 4, pp. 181-238. New York: Academic Press. Thepkanjana, Kingkarn. 1986. Serial Verb Construction in Thai. Ph.D. Dissertation, University of Michigan, Ann Arbor. 532"]}]}