{"sections":[{"title":"Logical Information Processing of Possibility and Negation: Cases from Taiwanese Hakka ∗ ","paragraphs":["Chioushing Yeh a , and Hueiling Laib  a Graduate Institute of Linguistics, National Chengchi University,","NO.64, Sec.2, ZhiNan Rd., Wenshan District, Taipei City 11605, Taiwan (R.O.C)","kyoko@nccu.edu.tw b Department of English, National Chengchi University,","NO.64, Sec.2, ZhiNan Rd., Wenshan District, Taipei City 11605, Taiwan (R.O.C)","hllai@nccu.edu.tw Abstract. This paper attempts to provide a refined description with a quantitative analysis about the deontic modals zo3-ded4 (做得) and sii2-ded4 (使得) in Taiwanese Hakka. While the affirmative-negative relationship is symmetrical structurally, it manifests in an asymmetrical manner semantically. The logic notations will be applied to clarify the intriguing interaction of possibility and negation. Under the interaction of semantic meanings and syntactic constructions, the representation of deontic modals in Taiwanese Hakka is therefore clearly elucidated. Keywords: possibility, necessity, negation, modality, Taiwanese Hakka"]},{"title":"1 Introduction","paragraphs":["The application of modals reflects the attitude and viewpoint of the speakers toward the","conversation. Two types of linguistic forms can be usually found, taking Taiwanese Mandarin","for example. The first one is the modal auxiliary verbs such as neng2 (能), hui4 (會), or ke3 yi3","(可以) as in (1) and (2). The other one is the potential construction [Verb-de(得)-C-O]. The","negative marker bu (不) is used to substitute de (得) and turns the affirmative potential","construction into a negative form [Verb- bu(不)-C-O] as exemplified in (3) and (4).  (1) 他能騙過你。","ta1 neng2 pian4 guo4 ni3 he able deceive across you ‘He is able to deceive you successfully.’  (2) 他可以騙過你。","ta1 ke3 yi3 pian4 guo4 ni3 he able deceive across you ‘He is able to deceive you successfully.’"," (3) 他騙得過你。","ta1 pian4 de guo4 ni3 he deceive PM1","across you  ∗ This study is partly based on the NSC research project On Hakka genericity-characterizing constructions: Lexical","semantics, event frames and information structure (NSC 100-2410-H-004-185-MY2). Special thanks extend to","four anonymous reviewers. We are solely responsible for possible errors.  Copyright 2011 by Chioushing Yeh, and Hueiling Lai 25th Pacific Asia Conference on Language, Information and Computation, pages 70–79 70","‘He is able to deceive you successfully.’","","(4) 他騙不過你。","ta1 pian4 bu guo4 ni3","he deceive NEG across you","‘He is unable to deceive you successfully.’"," In Taiwanese Hakka (TH), possibility can be expressed by modal verbs and the potential construction [Verb-de(得)-C-O] as well. The general form is zo3-ded4 (做得) while the less frequent one is sii2-ded4 (使得). Both cases are composed of a verb (that is, zo3 (做) or sii2 (使)) and ded4 (得). The affirmative and the negative types of deontic modals in TH present an asymmetric phenomenon. Based on the corpus data, the distribution of the linguistic forms of zo3-ded4 (做得), sii2- ded4 (使得), zo3-m5-ded4 (做毋得), sii2-m5-ded4 (使毋得), and m5-sii2 (毋使) is presented. Among our data, 229 tokens of zo3-ded4 (做得), 20 tokens of sii2- ded4 (使得), 43 tokens of zo3-m5-ded4 (做毋得), 13 tokens of sii2-m5-ded4 (使毋得), and 118 tokens of m5-sii2 (毋使) are collected. The data shows that zo3-ded4 (做得) is the dominating one to express possibility or permission in deontic modality; the adoption of zo3-m5-ded4 (做毋得) is preferred than that of sii2-m5-ded4 (使毋得) in expressing prohibition. However, the role to denote the idea of “not necessarily” falls on m5-sii2 (毋使) exclusively. The overall distribution is shown in Table 1:","","Table 1: The distribution of Taiwanese Hakka deontic modals 做 type 使 type TOTAL example 做得 使得","Number/Percentage 229 / 92% 20 / 8% 249 /100% example 做毋得 使毋得","Number/Percentage 43 / 77% 13 / 23% 56 / 100% example *毋做 毋使","Number/Percentage 0 / 0% 118 / 100% 100 / 100%  This paper therefore attempts to inspect the interaction between semantic manifestation and syntactic structure of TH modality which denotes possibility or necessity. The negation can trigger alternations of the modality or the proposition of modal sentences. In other words, the negator does not necessarily negate the meaning of the modal sentence in a corresponding manner.","The data of potential constructions and related data are mainly based on the Hoi2liuk7 dialect2","collected from written materials in Taiwan, including Hakka dictionary of Taiwan (臺 灣客家話辭典), Hakka Handbook (客語實用手冊), various story books such as Dungshi Hakka Storybooks (東勢客語故事集), Miaoli Hakka Storybooks (苗栗縣客語故事集), Little Prince (客家話小王子), The Story of Touqian River (頭前溪个故事), Missing under the Oil Tung Tree (油桐花下个思念), Hakka Jokes (客家笑料), Hakka magazines (客家雜誌), and from the oral data extracted from the NCCU Corpus of Spoken Hakka (國立政治大學客語口語 語料庫)3",". The Manual of Taiwanese Hakka Romanization System (臺灣客語拼音使用手冊)  1 The following abbreviations are applied for their corresponding grammatical functions: PM, a potential marker; NEG, a negative marker; PHA, a phase marker; PART, a particle; CL, a classifier; ASP, an aspect marker; and SF, a suffix. 2 In general, five Hakka dialect varieties can be observed in Taiwan: Si3yen3 (四縣) Hakka dialect, Hoi2liuk7 (海陸) Hakka dialect, Tai3pu1 (大埔) Hakka dialect, Ngieu5ping5 (饒平) Hakka dialect, and Seu3on1 (詔安) Hakka dialect. 3 For more detailed discussion of the NCCU Corpus of Spoken Hakka, please refer to Chu and Lai (2008). 71 promulgated by the Ministry of Education in 2009 is utilized to render the data. The tone diacritics are presented as 1 for yingping, 2 for yinshang, 3 for yinqu, 4 for yinru, 5 for yangping, 7 for yangqu, and 8 for yangru.4",""]},{"title":"2 Relevant Studies on Mandarin Modality","paragraphs":["Possibility can be expressed not only by deontic modals but also by potential constructions. Wei (2004) investigates the object position in verb-complement potential constructions in early Mandarin from a diachronic perspective. The default position of the object in Modern Chinese is after the complement in the V-C potential constructions such as kan4 de jian4 yue4 liang4 (看得見月亮) ‘be able to see the moon’ and kan4 bu jian4 yue4 liang4 (看不見月亮) ‘be unable to see the moon’. However, the data in the Tang and Song dynasties shows that the object is often preposed. In Wei’s analysis, the preposed object is in the “type A” construction while the object placed after the complement is in the “type B” construction. Both are illustrated in (5):","","(5) Type A construction: V-得/不-C-O","Type B construction: V- O-得/不-C"," In the Tang and Song dynasties, the structure of V- O-得/不-C is found in prevalence, while that of V-得/不-C-O is limitedly utilized. Nevertheless, both are developed due to the contraction of sub-clauses. Consider the following examples (Wei 2004: 671, 673):","","a. Type A construction: [V-得/不-C-O]","(6) 故學者多看不見這般所在。(《朱子語類‧論語十一》)","gu4 xue2zhe3 duo1 kan4 bu jian4 zhe4-ban1 suo3zai4","so scholar many see NEG see this-type place","‘So the scholars are incapable to see the point mostly.’","","b. Type B construction: [V-O-得/不-C]","(7) 如今趕他不上,回去了罷。(《平妖傳》二十七回)","ru2jin1 gan3 ta1 bu shang4, hui2qu1 le ba","Nowadays catch he NEG up back PART PART","‘Since (we/you) can not catch him up, (let’s) go back.’"," In Wei’s research, the complements in verb-complement potential constructions are all transitive verbs. Type A construction is contracted by two subclauses : [(S)V-Oi] ((學者)看這 般所在) and [(S)不-R-Oi] ((學者)不見這般所在). In other words, the position of O is not concerned with any movement. In a similar fashion, the first subclause [V-O] (趕他) in Type B construction: [V-得/不-C-O] denotes conditions while the second subclause [不-C] (不上) signifies results. When the construction is fixed to express potentiality, the two subclauses are contracted into one sentence. In this way, the two subclauses construct a verbal phrase which specifies potentiality.","Hsieh (2006) utilizes Chinese corpus to analyze Chinese modal verbs and adverbs which denote epistemic modality, deontic modality, dynamic modality and evaluative modality, with each of them including two subsystems. The study analyzes both affirmative modals and  4 The tone system of Hoi2liuk7 dialect is tabled as follows: 調號(tone number) 1 2 3 4 5 7 8 調值(pitch value) falling rising low level short high high level mid level short low Example song (霜) rhi (雨) zi (霽) siet (雪) lui (雷) tien (電) pok (雹)  72 negative ones. For instance, deontic modality encompasses affirmative ones such as neng2 (能) ‘can, be able to’, ke3 yi3 (可以) ‘can’, and hao3 (好) ‘can, be able to’ and negative ones like bu2 bi4 (不必) ‘need not’, bu2 yong4 (不用) ‘need not’, wu2 fang2 (無妨) ‘may as well’, mian3 (免) ‘need not’, and beng2 (甭) ‘need not’. However, little discussion has been put on items that can express either affirmative or negative usages. While the deontic modal neng2 (能) ‘can, be able to’ denotes possibility, its negative form bu4 neng2 (不能) ‘can’t’ expresses necessity instead. For instance, the sentence ni3 bu4 neng2 tou1 ren4 he2 dong1 xi1 (你不能偷任何東 西!) ‘You can’t steal anything!’ signifies prohibition. The mismatching mapping between possibility, necessity and negation therefore is needed to be further investigated."]},{"title":"3 Logical Structure of Modality","paragraphs":["In the extant framework, quite many efforts have been made regarding the classification of modality into various types and the different syntactic and semantic manifestations of these types (cf. Lyons 1977; Palmer 1979, 2001; Bybee et al. 1994; Talmy 1988, Sweetser 1991, among others).The extant knowledge has also shown that the negation of modal sentences can affect the semantic manifestation of modality. One of the famous achievements of Aristotle is the Square of opposition which provides a foundation in logic.","   To clarify the mapping of modals onto logical structures, five sentences are given by De Haan (2005) as below. The relationship between necessity and possibility can be represented by certain logical notations, where “p” stands for proposition, “◊” for possibility, “□” for necessity, “¬” for negation, and “≡” for equivalence."," (8) a. John must be a bachelor. □p b. John may be a bachelor. ◊p c. John must not be a bachelor. □¬p d. John need not be a bachelor. ¬□p e. John may not be a bachelor. ◊¬p (or ¬◊p5",") (De Haan 2005:53) ","Radden (2007) also signifies the logical equivalent relationship between possibility, necessity","and negation, as demonstrated in (9)6",": ","(9) a. poss p ≡ ~nec~ p b. nec p ≡ ~poss~ p c. ~poss p ≡ nec~ p d. ~nec p ≡ poss~ p","  5 Palmer (2003) claims that there is logical equivalence between “possible not” and “not necessary” (Palmer 2003:9). The logic notations of “◊¬p (or ¬◊p)” for (8e) therefore need further consideration. 6 “~” is the notation for negation (cf. “¬”(De Haan 2005)) in Radden’s article. 73 With the four pairs of equivalence relations, the basic system of modality is provided. Following De Haan (2005) and Radden (2007), the logic concept is adopted to deal with the interrelationship between possibility and negation exemplified by Hakka deontic modals zo3-ded4 (做得) and sii2- ded4 (使得)."]},{"title":"4 Possibility and Negation","paragraphs":["In this section, we will demonstrate the interaction of possibility and negation. The two lexicalized modals zo3-ded4 (做得) and sii2-ded4 (使得) express possibility. The corresponding semantic logic notation is “◊p”. ","(10) 你愛先請假正做得走。","ngi5 oi3 sen1 ciang2-ga2 zhang1 zo3-ded4 zeu2 you have to first ask-for-leave only-then can leave ‘You have to ask for leave first so then you are permitted to leave.’ ","(11) 這領衫使得送分你。 lia2 liang1 sam1 sii2-ded4 sung3 bun1 ngi5 this CL shirt can send to you ‘(I) can send the shirt to you.’"," To negate the modality, a negator is assigned before the modal verb. The negative form of “◊p” therefore is “¬◊p”. Take zo3-ded4 (做得) for example; the negative form consequently should be the combination of m5 (毋) and zo3-ded4 (做得) as *m5-zo3-ded4 (*毋做得). However, this is not the correct form in TH. The corresponding negative form of zo3-ded4 (做得) is zo3-m5-ded4 (做毋得) instead. The negative operator m5 (毋) is infixed in the modal verb zo3-ded4 (做得). The phenomena exhibited here can be captured by the analysis proposed by Wang (2005) on his application of reanalysis to deal with the Mandarin data of hen4-bu4-de2 (恨不得) ‘to itch to’. Reanalysis refers to a mechanism whereby the syntactic structure of a syntactic pattern is changed without changing its surface form (cf. Harris 2005). Wang (2005) proposes that the modern usage of the construction hen4-bu4-de2 (恨不得) ‘to itch to’ undergoes such a reanalysis whereby a syntactic structure has become a lexicalized item. The source construction and the innovative one are shown below:","","(12) a. Source construction:","恨 不得 VP","","","","b. Innovative construction:","恨不得 VP",""," In other words, hen4-bu4-de2 (恨不得) ‘to itch to’ experiences the process of lexicalization which is a linguistic change that “results in the production of new lexical/contentful items”(Brinton and Traugott 2005:96). By the same token, we can argue that zo3-ded4 (做得)/zo3-m5-ded4 (做毋得) in TH undergo the same kind of reanalysis in which lexicalized items with both affirmative and negative forms produced.","Now let us focus on the deontic modality of zo3-ded4 (做得)/zo3-m5-ded4 (做毋得). In TH ded4 (得) carries deontic meaning of permission and occurs post-verbally; the case in (13) shows an affirmative potential complement construction, and that in (14), a negative one: 74","(13) 該條魚仔食得。 gai5 tiau5 ng5 shid8 ded4 that CL fish eat DED ‘(You are) permitted to eat the fish.’ ","(14) 該條魚仔臭風了,食毋得。 gai5 tiau5 ng5 chiu3fung1 le1, shid8 m5 ded4 that CL fish smelly PART eat NEG DED ‘(You) can’t eat the fish since it is smelly.’ ","Ded4 (得) can also occur in the V-de(得)-C constructions as in (15):","","(15) 佢食得/毋飽。","gi5 shid8 e7","/m5 bao2","he eat PM/NEG full","‘He can/cannot be full.’ ","It is observed that the V-de(得)-C constructions indicate the state of results while the potential","complement constructions denote potentiality in a semantic account. The complement bao2 (飽)","‘full’ here denotes a stative result. Nevertheless, the element follows the morpheme ded4 (得)","can also be an active verb as exemplified in (16):  (16) 你愛先請假正做得走。 ngi5 oi3 sen1 ciang2-ga2 zhang1 zo3-ded4 zeu2","you have to first ask-for-leave only-then can leave","‘You have to ask for leave first so then you are permitted to leave.’ ","Following the patterns of (13) and (14), the negative form of zo3-ded4 (做得) therefore is","presented as zo3-m5-ded4 (做毋得) instead of *m5-zo3-ded4 (*毋做得), as in (17). The","linguistic performance of zo3(做)-type modals is shown in Table 2.  (17) 你無請假做毋得走。 ngi5 mo5 ciang2-ga2 zhang1 zo3-m5-ded4 zeu2","you no ask-for-leave only-then can’t leave","‘You can’t leave without asking (for leave).’  Table 2: The linguistic performance of zo3(做)-type modals","Logic notation Examples","Possibility Necessity","possible 做得(V) ◊p","possible not 做得毋(V) ◊¬p ¬□p","not possible *毋做得(V)","做毋得(V) ¬◊p □¬p"," The negation can affect the modality or the proposition. As introduced above, the negative forms of zo3-ded4 (做得) and sii2-ded4 (使得) are zo3-m5-ded4 (做毋得) and sii2-m5-ded4 (使毋得), respectively. While the two lexicalized negative forms are symmetrical structurally,  7 A phonetic bleaching occurs on morpheme ded4 (得), which pronounced as e (得). 75 the semantic interpretation of them is in diversity. The modal meanings of zo3-m5-ded4 (做毋得) and sii2-m5-ded4 (使毋得) are related to prohibition as in (18) and (19). The semantic logic notation therefore is “¬◊p ≡ □¬p”. ","(18) 內容 做毋得講出來。","nui7rhung5 ngai5 zo3-m5-ded4 gong2 chud4-loi5","content I can’t speak out-come","‘I can’t say anything about the content.’","","","(19) 垃圾使毋得儘採亂丟。","la2sab4 sii2-m5-ded4 cin2cai2 lon7-diu1","trash can’t random litter","‘Don’t litter at random.’ ","The performance of zo3-m5-ded4 (做毋得) and sii2-m5-ded4 (使毋得) which represent the","concept of necessity8","(that is, prohibitive in semantic field) does not imply the absence of the","negation of possibility. The logical form of m5-sii2 (毋使) is supposed to be “¬ + ◊p”. However,","the semantic logic interpretation is “¬□p” instead. In other words, (20) expresses the idea that","“it is not necessarily the case that this is true and it is possible that this is not true” (Radden","2007:226). The linguistic performance of sii2(使)-type modals therefore is exhibited in Table 3.  (20) 有麼个需要,隨時摎 講,毋使細義。","rhiu1 ma2gai3 si1rau3, sui5shi5 LAU ngai5 gong2, m5- sii2 se3ngi7","have what need anytime LAU I speak need-not courteous","‘Tell me what you need anytime. Make yourself at home.’ ","Table 3: The linguistic performance of sii2(使)-type modals","Logic notation Examples","Possibility Necessity","possible 使得(V) ◊p","possible not *使得毋(V)","毋使(V) ◊¬p ¬□p","not possible *毋使得(V) 使毋得(V) ¬◊p □¬p ","Table 4 depicts the comparison of zo3(做)-type and sii2(使)-type modals in TH9",".     8 The modal verbs which denote necessity in Taiwanese Hakka are tin3 chog8 (定著). However, while the lexicalized forms composed of the elements to denote possibility and negation can be observed (such as zo3-m5-ded4 (做毋得) and sii2-m5-ded4 (使毋得)), the ones composed of the elements to denote necessity and negation cannot. 9 One specific「NEG+M+NEG+VP」 construction is also observed here, which denotes the idea of “¬◊¬p ≡ □p” as well. However, while the [不得不-V] construction in Mandarin Chinese implies unwillingness of the speaker, the [做毋得毋-V] construction does not. (23) 講了恁多好話,缺點也做毋得毋提。","gong2 le1 an2 do1 ho2 fa3, kied4 diam2 rha7 zo3-m5-ded4-m5 ti5","speak PART so many good word defect too must mention ‘While (I) have spoken so many good words, I must mention the defects too.’ 76","Table 4: The comparison of zo3(做)-type and sii2(使)-type modals Logic notation 做 type 使 type TOTAL","◊p 做得 使得 Number/Percentage 229 / 92% 20 / 8% 249 /100%","¬◊p ≡ □¬p 做毋得 使毋得 Number/Percentage 43 / 77% 13 / 23% 56 / 100%","¬□p *毋做 毋使 Number/Percentage 0 / 0% 118 / 100% 100 / 100%"," With different linguistic forms, the information processing of possibility and negation can be presented in various ways. To express the meaning of ‘◊p (possible)’, both zo3-ded4 (做得) and sii2- ded4 (使得) can be applied. Zo3-m5-ded4 (做毋得) and sii2-m5-ded4 (使毋得), undergone the interaction of possibility and negation, denote the meaning of prohibition which relate to necessity ‘¬◊p ≡ □¬p (not possible = necessary not)’. Furthermore, while m5-sii2 (毋使) indicates ‘¬□p (not necessary)’, the linguistic form of m5-zo3 (毋做) does not have the modal function. In other words, m5-sii2 (毋使) predominates in the usage of ‘¬□p (not necessary)’. This paper therefore offers an analysis of the interaction of possibility and negation with logical information processing."]},{"title":"5 Concluding Remarks","paragraphs":["TH modality has been paid little attention to in the literature, not to mention the interaction of possibility and negation. Exemplified via deontic modals, this paper attempts to shed light on the issue under the manipulation of logic. Both the two lexicalized deontic modals zo3-ded4 (做得) and sii2-ded4 (使得) denote possibility, and zo3-m5-ded4 (做毋得) and sii2-m5-ded4 (使毋得) signify prohibition which relates to necessity. However, some differences can be observed in a distributional account. Zo3-ded4 (做得) and zo3-m5-ded4 (做毋得) dominate in Taiwanese Hakka usage. In other words, the members of zo3 (做) types are in predominance. On the contrary, the application of sii2-ded4 (使得) and sii2-m5-ded4 (使毋得) are fewer in linguistic use. Though it seems that the members of sii2 (使) types may suffer the situation of fading out, only m5-sii2 (毋使) can express the sense of ‘it is not necessarily the case that this is true’ or ‘it is possible that this is not true’. In other words, zo3 (做) types and sii2 (使) types occupy different functional statues in TH modality. In line with the concept of lexicalization, this study analyzes the intricate syntactic and semantic features exhibited by modal verbs in Taiwanese Hakka."]},{"title":"Selected References","paragraphs":["Brinton, Laurel J, and Elizabeth Closs Traugott. 2005. Lexicalization and Language Change. Cambridge: Cambridge University Press.","Bybee, Joan. 2005. Mechanisms of change in grammaticalization: The role of frequency. In Brian D. Joseph and Richard D. Janda, eds., The Handbook of Historical Linguistics, pp.602-623. Oxford: Blackwell.","Bybee, Joan, Revere Perkins, and William Pagliuca. 1994. The Evolution of Grammar: Tense, Aspect and Modality in the Languages of the World. Chicago: The University of Chicago Press.","Chu, Chauncey C. 1998. A discourse Grammar of Mandarin Chinese. New York and Berne: Peter Lang Publishing.","Chui, Kawai, and Hueiling Lai. 2008. The NCCU Corpus of Spoken Chinese: Mandarin, Hakka, and Southern Min. Taiwan Journal of Linguistics 6.2:119-144. 77 De Haan, Ferdinand. 2005. Typological approaches to modality. In William Frawley, ed.,","Approaches to Modality, pp. 27-69. Berlin: Mouton de Gruyter. De Haan, Ferdinand. 1997. The interaction of negation and modality: A typological study. New","York: Garland. Fischer, Olga, M. Norde, & H. Peridon. (eds.) 2004. Up and Down the Cline: The Nature of","Grammaticalization. John Benjamins. Frawley, William. (ed.) 2005. The expression of modality. Berlin: Mouton de Gruyter. Givon, T. 1995. Functionalism and Grammar. Amsterdam: John Benjamins. Harris, Alice C. 2005. Cross-linguistic perspectives on syntactic change. In Brian D. Joseph and","Richard D. Janda, eds., The Handbook of Historical Linguistics, pp. 529-551. Oxford:","Blackwell. Heine, Bernd. 2005. Grammaticalization. In Brian D. Joseph and Richard D. Janda, eds., The","Handbook of Historical Linguistics, pp.575-601. Oxford: Blackwell. Hopper, Paul J. and Elizabeth Closs Traugott. 2003. Grammaticalization. Cambridge:","Cambridge University Press. Huang, Lillian M.-J. 1980. The Resultative Complement in Mandarin Chinese. M.A. thesis,","University of Florida Johnson, Mark. 1987. The body in the mind. Chicago: University of Chicago Press.","Lyons, John.1982. Deixis and Subjectivity. Loquor, Ergo Sum? In Robert J. Jarvella and Wolfgangt Klein, eds., Spech, Place, and Action: Studies in Deixis and Related Topics, pp.101-124. New York: John Wiley and Sons, Ltd. Lyons, John. 1977. Semantics. Cambridge: Cambridge University Press. Nuyts, Jan. 2005. The modal confusion: On terminology and the concepts behind it. In A.","Klinge and Henrik H. Müller, eds., Modality: Studies in form and function, pp.5-38. London:","Equinox. Palmer, Frank R. 2001. Mood and modality (Cambridge Textbooks in Linguistics), 2nd edition.","Cambridge: Cambridge University Press. Palmer, Frank R. 1979. Modality and the English modals. London: Longman. Radden, Günter. 2007. Interaction of modality and negation. In Władysław Chłopicki, Andrzej","Pawelec, and Agnieszka Pokojska, eds., Cognition in Language: Volume in Honour of","Professor Elżbieta Tabakowska, pp.224-254. Kraków: Tertium. Sun, C.F. and T. Givon. 1985. On the so-called SOV word-order in Mandarin Chinese: A","quantified text study and its implications. Language 61(2), 329-351. Sweetser, Eve. 1991. From Etymology to Pragmatics: Metaphorical and Cultural Aspects of","Semantic Structure. Cambridge: Cambridge University Press. Talmy, Leonard. 1988. Force dynamics in language and cognition. Cognitive Science 2, 49-100. Traugott, Elizabeth Closs. 2005. Constructions in Grammaticalization. In Brian D. Joseph and","Richard D. Janda, eds., The Handbook of Historical Linguistics, pp.624-647. Oxford:","Blackwell. Traugott, Elizabeth Closs. 1995. Subjectification in grammaticalization. In D. Stein and S.","Wright, eds., Subjectivity and Subjectivisation, pp.31-54. Cambridge: Cambridge University","Press. Yue, Anne O. 2001. The verb complement construction in historical perspective with special","reference to Cantonese. In Hilary Chappell, ed., Sinitic Grammar: Synchronic and","diachronic perspectives, pp.232-265. Oxford: Oxford University Press. 屈承熹. 2010.《漢語功能篇章語法—從認知、功能到篇章結構》,文鶴出版社。 鍾榮富. 2001.《福爾摩沙的烙印-臺灣客家話導論(上、下冊)》。行政院文化建設委員會。 董秀芳. 2002. 〈論句法結構的詞彙化〉,《語言研究》3: 56-65. 78 何石松, 劉醇鑫. 2004.《現代客語詞彙彙編序篇》。臺北:台北市政府客家事務委員會。 謝佳玲. 2006. 〈漢語情態詞的語意界定:語料庫為本的研究〉,《中國語文研究》1: 45-63. 蔣紹愚. 1994.《近代漢語研究概況》。北京:北京大學出版社。 柯理思. 1995. 〈北方官話裡表示可能的動詞詞尾 “了”〉,《中國語文》1995.4(總 247):","267-278。 羅肇錦. 1990.《客語語法》。臺北:臺灣學生書局。 沈家煊. 2003.〈現代漢語“動補結構”的類型學考察〉,《世界漢語教學》2003.3: 17-23。 宋永圭. 2007. 《現代漢語情態動詞否定研究》。北京:中國社會科學出版社。 曹逢甫, 蕭素英. 2002.〈論漢語兩種關聯句式的語法與語意〉,《語言暨語言學》3.4:","811-838。 王燦龍. 2005. 〈詞彙化二例—兼談詞彙化和語法化的關係〉,《當代語言學》7.3: 225-236. 魏培泉. 2004.〈近代漢語能性動補結構中賓語的位置〉,《語言暨語言學》5.3: 663-704。 吳福祥. 2002. 〈漢語能性述補結構「V 得/不 C」的語法化〉,《中國語文》2002.1: 29-40。 79"]}]}