{"sections":[{"title":"*SEM 2013: The Second Joint Conference on Lexical and Computational Semantics Volume 2: Proceedings of the Seventh International Workshop on Semantic Evaluation (SemEval 2013) June 14-15, 2013 Atlanta, Georgia, USA","paragraphs":["Production and Manufacturing by Omnipress, Inc. 2600 Anderson Street Madison, WI 53707 USA Sponsored in part by: The US Defense Advanced Research Projects Agency (DARPA) Organized and sponsored in part by: The ACL Special Interest Group on the Lexicon (SIGLEX) The ACL Special Interest Group on Computational Semantics (SIGSEM)"]},{"title":"c⃝2013 The Association for Computational Linguistics Order copies of this and other ACL proceedings from: Association for Computational Linguistics (ACL) 209 N. Eighth Street Stroudsburg, PA 18360 USA Tel: +1-570-476-8006 Fax: +1-570-476-0860 acl@aclweb.org ISBN 978-1-937284-48-0 (Volume 1) ISBN 978-1-937284-49-7 (Volume 2)","paragraphs":["ii"]},{"title":"Introduction to *SEM 2013","paragraphs":["Building on the momentum generated by the spectacular success of the Joint Conference on Lexical and Computational Semantics (*SEM) in 2012, bringing together the ACL SIGLEX and ACL SIGSEM communities, we are delighted to bring to you the second edition of the conference, as a top-tier showcase of the latest research in computational semantics. We accepted 14 papers (11 long and 3 short) for publication at the conference, out of a possible 45 submissions (a 31% acceptance rate). This is on par with some of the most competitive conferences in computational linguistics, and we are confident will set the stage for a scintillating conference. This year, we started a tradition that we intend to maintain in all future iterations of the conference in integrating a shared task into the conference. The shared task was selected by an independent committee comprising members from SIGLEX and SIGSEM, based on an open call for proposals, and revolved around Semantic Textual Similarity (STS). The task turned out to be a huge success with 34 teams participating, submitting a total of 103 system runs. *SEM 2013 features a number of highlight events: Day One, June 13th:","• A timely and impressive panel on Towards Deep Natural Language Understanding, featuring the following panelists: – Kevin Knight (USC/Information Sciences Institute) – Chris Manning (Stanford University) – Martha Palmer (University of Colorado at Boulder) – Owen Rambow (Columbia University) – Dan Roth (University of Illinois at Urbana-Champaign)","• A Reception and Shared Task Poster Session in the evening, thanks to the generous sponsorship of the DARPA Deft program. Day Two, June 14th:","• In the morning, a keynote address by David Forsyth from the Computer Science Department at the University of Illinois at Urbana Champagne on issues of Vision and Language. It promises to be an extremely stimulating speech, and is not to be missed.","• In the early afternoon, a panel on the relation between and future of *SEM, the *SEM Shared Task, SemEval and other events on computational semantics. In this panel, we will attempt to clarify and explain as well as devise plans for these different entities.","• Finally, at the end of the day, an award ceremony for the Best Long Paper and Best Short Paper. iii As always, *SEM 2013 would not have been possible without the considerable efforts of our area chairs and an impressive assortment of reviewers, drawn from the ranks of SIGLEX and SIGSEM, and the computational semantics community at large. We would also like to acknowledge the generous support for the STS Task from the DARPA Deft Program. We hope you enjoy *SEM 2013, and look forward to engaging with all of you, Mona Diab (The George Washington University, General Chair) Timothy Baldwin (The University of Mebourne, Program Committee Co-Chair) Marco Baroni (University of Trento, Program Committee Co-Chair) iv"]},{"title":"Introduction to SemEval","paragraphs":["The Semantic Evaluation (SemEval) series of workshops focus on the evaluation and comparison of systems that can analyse diverse semantic phenomena in text with the aim of extending the current state-of-the-art in semantic analysis and creating high quality annotated datasets in a range of increasingly challenging problems in natural language semantics. SemEval provides an exciting forum for researchers to propose challenging research problems in semantics and to build systems/techniques to address such research problems. SemEval-2013 is the seventh workshop in the series. The first three workshops, SensEval-1 (1998), SensEval-2 (2001), and SensEval-3 (2004), were focused on word sense disambiguation, each time growing in the number of languages offered in the tasks and in the number of participating teams. In 2007 the workshop was renamed SemEval and in the next three workshops SemEval-2007, SemEval-2010 and SemEval-2012 the nature of the tasks evolved to include semantic analysis tasks outside of word sense disambiguation. Starting in 2012 SemEval turned into a yearly event associated with *SEM. This volume contains papers accepted for presentation at the SemEval-2013 International Workshop on Semantic Evaluation Exercises. SemEval-2013 is co-organized with the *SEM-2013 The Second Joint Conference on Lexical and Computational Semantics and co-located with The 2013 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies (NAACL HLT). SemEval-2013 included the following 12 tasks for evaluation: • TempEval-3 Temporal Annotation • Sentiment Analysis in Twitter • Spatial Role Labeling • Free Paraphrases of Noun Compounds • Evaluating Phrasal Semantics • The Joint Student Response Analysis and 8th Recognizing Textual Entailment Challenge • Cross-lingual Textual Entailment for Content Synchronization • Extraction of Drug-Drug Interactions from BioMedical Texts • Cross-lingual Word Sense Disambiguation • Evaluating Word Sense Induction & Disambiguation within An End-User Application • Multilingual Word Sense Disambiguation • Word Sense Induction for Graded and Non-Graded Senses v About 100 teams submitted more than 300 systems for the 12 tasks of SemEval-2013. This volume contains both Task Description papers that describe each of the above tasks and System Description papers that describe the systems that participated in the above tasks. A total of 12 task description papers and 101 system description papers are included in this volume. We are indebted to all program committee members for their high quality, elaborate and thoughtful reviews. The papers in this proceedings have surely benefited from this feedback. We are grateful to *SEM 2013 and NAACL-HLT 2013 conference organizers for local organization and the forum. We most gratefully acknowledge the support of our sponsors, the ACL Special Interest Group on the Lexicon (SIGLEX) and the ACL Special Interest Group on Computational Semantics (SIGSEM). Welcome to SemEval-2013! Suresh Manandhar and Deniz Yuret vi Organizers:","General Chair: Mona Diab (George Washington University)","Program Committee Chairs: Tim Baldwin (University of Melbourne) Marco Baroni (University of Trento)","STS Shared Task Committee Chairs: Anna Korhonen (University of Cambridge) Malvina Nissim (University of Bologna)","SemEval Chairs: Suresh Manandhar (University of York, UK) Deniz Yuret (Koc University, Turkey)","Publications Chair: Yuval Marton (Microsoft)","Sponsorship Chair: Bernardo Magnini (Fondazione Bruno Kessler)","Panel organizer: Martha Palmer (University of Colorado, Boulder)","Area Chairs: Shane Bergsma (Johns Hopkins University) Chris Biemann (TU Darmstadt) Eduardo Blanco (Lymba Corporation) Gemma Boleda (University of Texas, Austin) Francis Bond (Nanyang Technological University) Paul Cook (University of Melbourne) AmaçHerdagdelen (Facebook) Lauri Karttunen (Stanford University) Diana McCarthy (University of Cambridge) Roser Morante (University of Antwerp) Smara Muresan (Rutgers University) Preslav Nakov (Qatar Computing Research Institute) Roberto Navigli (Sapienza University of Rome) Hwee Tou Ng (National University of Singapore) Becky Passonneau (Columbia University) Laura Rimell (University of Cambridge) Caroline Sporleder (University of Trier) Fabio Massimo Zanzotto (University of Rome Tor Vergata) vii Program Committee for Volume 1: Nabil Abdullah (University of Windsor), Eneko Agirre (University of the Basque Country), Nicholas Asher (CNRS Institut de Recherche en Informatique de Toulouse), Eser Aygün, Timothy Baldwin (The University of Melbourne), Eva Banik (Computational Linguistics Ltd), Marco Baroni (University of Trento), Alberto Barrón-Cedeño (Universitat Politècnica de Catalunya), Roberto Basili (University of Roma, Tor Vergata), Miroslav Batchkarov (University of Sussex), Cosmin Bejan, Sabine Bergler (Concordia University), Shane Bergsma (Johns Hopkins University), Steven Bethard (University of Colorado Boulder), Ergun Bicici (Centre for Next Generation Localisation), Chris Biemann (TU Darmstadt), Eduardo Blanco (Lymba Corporation), Gemma Boleda (The University of Texas at Austin), Francis Bond (Nanyang Technological University), Paul Buitelaar (DERI, National University of Ireland, Galway), Razvan Bunescu (Ohio University), Harry Bunt (Tilburg University), Aljoscha Burchardt (DFKI), Davide Buscaldi (LIPN, Université Paris 13), Olivia Buzek (Johns Hopkins University), Nicoletta Calzolari (ILC-CNR), Annalina Caputo (Dept. Computer Science - Univ. of Bari Aldo Moro), Sandra Carberry (University of Delaware), Marine Carpuat (National Research Council), Irene Castellon (University of Barcelona), Julio Castillo (National University of Cordoba), Daniel Cer (Stanford University), Yee Seng Chan (Raytheon BBN Technologies), David Chen (Google), Colin Cherry (NRC), Jackie Chi Kit Cheung (University of Toronto), Christian Chiarcos, Sung-Pil Choi, Grzegorz Chrupała (Tilburg University), Philipp Cimiano (Univ. Bielefeld), Daoud Clarke, Bob Coecke (Oxford University), Paul Cook (The University of Melbourne), Bonaventura Coppola (IBM Research), Danilo Croce (University of Roma, Tor Vergata), Montse Cuadros (Vicomtech-IK4), Walter Daelemans (University of Antwerp, CLiPS), Ido Dagan (Bar-Ilan University), Avishek Dan (Indian Institute of Technology Bombay), Kareem Darwish (Qatar Computing Research Institute, Qatar Foundation), Dipanjan Das (Google Inc.), Marie-Catherine de Marneffe (The Ohio State University), Gerard de Melo (ICSI Berkeley), Pascal Denis, Mona Diab (GWU), Georgiana Dinu (University of Trento), Bill Dolan (Microsoft Research), Rebecca Dridan (University of Oslo), Kevin Duh (Nara Institute of Science and Technology), Micha Elsner (The Ohio State University), David Elson (Google), Stefan Evert (FAU Erlangen-Nürnberg), Dan Flickinger (Stanford), Anette Frank (Heidelberg Universiy), Andre Freitas (DERI, National University of Ireland, Galway), Claire Gardent (CNRS/LORIA, Nancy), Spandana Gella (University of Melbourne), Matthew Gerber (University of Virginia), Eugenie Giesbrecht (Karlsruhe Institute of Technology), Kevin Gimpel (Toyota Technological Institute at Chicago), Claudio Giuliano (FBK), Dan Goldwasser (University of Maryland), Edward Grefenstette (University of Oxford Department of Computer Science), Weiwei Guo (Columbia University), Iryna Gurevych (Ubiquitous Knowledge Processing (UKP) Lab), Yoan Gutiérrez (University of Matanzas), Nizar Habash (Columbia University), Bo Han (University of Melbourne), Lushan Han (University of Maryland, Baltimore County), Chikara Hashimoto (NICT), Mike Heilman (Educational Testing Service), Iris Hendrickx (Center for Language Studies, Radboud University Nijmegen), Verena Henrich (University of Tübingen), Aurelie Herbelot (Universität Potsdam), Amac Herdagdelen (Facebook), Veronique Hoste (Ghent University), Dirk Hovy (USC’s Information Sciences Institute), Nancy Ide (Vassar College), Adrian Iftene (Al. I. Cuza University of Iasi), Diana Inkpen (University of Ottawa), Sambhav Jain (LTRC, IIIT Hyderabad), Sneha Jha, Sergio Jimenez (National University of Colombia), Richard Johansson (University of Gothenburg), David Jurgens (University of California, Los Angeles), Dimitri Kartsaklis (University of Oxford), Lauri Karttunen (Stanford University), Sophia Katrenko (Utrecht University), Bill Keller (The University of Sussex), Douwe Kiela (University of Cambridge Computer Laboratory), Su Nam Kim, Alexandre Klementiev (Saarland University), Valia Kordoni (Humboldt University Berlin), Ioannis Korkontzelos (National Centre for Text Mining, The University of Manchester), Zornitsa Kozareva (USC Information Sciences Institute), Ivana Kruijff-Korbayova, Man Lan (ECNU), Jey Han Lau (University of Melbourne), Yoong Keok Lee (MIT), Alessandro Lenci (University of Pisa), Maria Liakata (University of viii Warwick), Ting Liu, Nitin Madnani (Educational Testing Service), Nikolaos Malandrakis (Signal Analysis and Interpretation Laboratory (SAIL), USC, Los Angeles, CA 90089, USA), Suresh Manandhar (University of York), Daniel Marcu (SDL), Erwin Marsi (Norwegian University of Science and Technology (NTNU)), Toni Marti (University of Barcelona), Diana McCarthy (University of Cambridge (DTAL)), John McCrae (University Bielefeld), Rada Mihalcea (University of North Texas), Shachar Mirkin (Xerox Research Centre Europe), Ray Mooney (University of Texas at Austin), Roser Morante (University of Antwerp), Paul Morarescu (Syracuse University), Mathieu Morey (Aix-Marseille Universit é), Alessandro Moschitti (DIS, University of Trento), Rutu Mulkar, Smaranda Muresan (Rutgers University), Preslav Nakov (Qatar Computing Research Institute, Qatar Foundation), Vivi Nastase (FBK), Roberto Navigli (Sapienza University of Rome), Ani Nenkova (University of Pennsylvania), Hwee Tou Ng (National University of Singapore), Shengjian Ni (College of Chinese Language and Literature,Wuhan University), John Niekrasz, malvina nissim (University of Bologna), Diarmuid Ó Séaghdha (University of Cambridge), Brendan O’Connor (Carnegie Mellon University), Kemal Oflazer (Carnegie Mellon University - Qatar), Akira Ohtani (Osaka Gakuin University), Manabu Okumura (Tokyo Institute of Technology), Lubomir Otrusina (Faculty of Information Technology, Brno University of Technology), Sebastian Pado (Heidelberg University), Alexis Palmer (Saarland University), Martha Palmer (University of Colorado), Rebecca J. Passonneau (Columbia University), Michael J. Paul (Johns Hopkins University), Anselmo Peñas (NLP & IR Group, UNED), Sasa Petrovic, Mohammad Taher Pilehvar (Sapienza University of Rome), Manfred Pinkal (Saarland University), Emily Pitler (University of Pennsylvania), Laura Plaza, Massimo Poesio (University of Essex), Tamara Polajnar (University of Cambridge), Simone Paolo Ponzetto (University of Mannheim), Hoifung Poon (Microsoft Research), octavian popescu (FBK-irst), Matt Post (Johns Hopkins University), Alexandros Potamianos (Technical University of Crete), Richard Power, Vinodkumar Prabhakaran (Columbia University), Stephen Pulman (Oxford University), Uwe Quasthoff, Carlos Ramisch (Université Joseph Fourier), Delip Rao (Johns Hopkins University), Reinhard Rapp (Aix-Marseille Université), Jonathon Read (University of Oslo), Marta Recasens (Stanford University), Siva Reddy (University of Edinburgh), Ines Rehbein (Potsdam University), Joseph Reisinger, Antonio Reyes (Laboratorio de Tecnologı́as Lingüı́sticas, Instituto Superior de Intérpretes y Traductores), Hannes Rieser, German Rigau (UPV/EHU), Ellen Riloff (University of Utah), Laura Rimell (University of Cambridge), Alan Ritter (University of Washington), Horacio Rodriguez (UPC), Carolyn Rose (Carnegie Mellon University), Andrew Rosenberg (CUNY Queens College), Paolo Rosso (Universitat Politècnica de València), Josef Ruppenhofer, patrick saint-dizier (IRIT-CNRS), Mark Sammons (University of Illinois at Urbana-Champaign), Fernando Sánchez-Vega (Laboratorio de Tecnologı́as del Lenguaje, Instituto Nacional de Astrofı́sica, Óptica y Electrónica, Puebla, Estado de México), Marina Santini, Christina Sauper, Roser Saurı́ (Barcelona Media), Hansen Andrew Schwartz (University of Pennsylvania), Aliaksei Severyn (University of Trento), Ehsan Shareghi (Concordia University - Master’s Student), Eyal Shnarch (Bar Ilan University), Niraj Shrestha (KUL), Ekaterina Shutova (University of California at Berkeley), Ravi Sinha, Gabriel Skantze (KTH Speech Music and Hearing), Aitor Soroa (assistant lecturer), Caroline Sporleder (Trier University), Manfred Stede (University of Potsdam), Herman Stehouwer (Max Planck for Psycholinguistics), Benno Stein, Matthew Stone (Rutgers University), Veselin Stoyanov (Facebook), Michael Strube (HITS gGmbH), L V Subramaniam (IBM Research India), Md. Sultan (University of Colorado - Boulder), György Szarvas (Nuance Communications AG), Stefan Thater (Universität des Saarlandes), Kristina Toutanova (Microsoft Research), Yulia Tsvetkov (CMU), Tim Van de Cruys (IRIT & CNRS), Antal van den Bosch (Radboud University Nijmegen), Eva Vecchi (CIMeC - University of Trento), Paola Velardi, Erik Velldal, Noortje Venhuizen, Sriram Venkatapathy (Xerox Research Centre Europel), Yannick Versley (University of Tuebingen), Darnes Vilariño (Benemérita Universidad Autónoma de Puebla), Aline Villavicencio (Institute of Informatics, Federal University of Rio Grande do SUl), Veronika Vincze (University of Szeged), Vinod Vydiswaran (University of Illinois), ix Ruibo WANG (Shanxi Univ. Wucheng Road 92, Taiyuan, Shanxi), Sai Wang (Shanxi University), Xinglong Wang, Yi-Chia Wang (Carnegie Mellon University), Bonnie Webber (University of Edinburgh), Julie Weeds (University of Sussex), Ben Wellner (The MITRE Corporation), Jan Wiebe (University of Pittsburgh), Michael Wiegand (Saarland University), Theresa Wilson (JHU HLTCOE), Kristian Woodsend (University of Edinburgh), Dekai Wu (HKUST), Stephen Wu (Mayo Clinic), Feiyu Xu (DFKI LT Lab), Jian Xu (The Hong Kong Polytechnic University), Eric Yeh (SRI International), Michael Yip (The Hong Kong Institute of Education), Deniz Yuret (Koc University), Roberto Zamparelli (Università di Trento), Fabio Massimo Zanzotto (University of Rome ”Tor Vergata”), Luke Zettlemoyer (University of Washington), and Hermann Ziak (Know-Center GmbH). Program Committee for Volume 2: Ameeta Agrawal (York University), Itziar Aldabe (University of the Basque Country (UPV/EHU)), Marianna Apidianaki (LIMSI-CNRS), Pedro Balage Filho (University of São Paulo), Alexandra Balahur (European Commission Joint Research Centre), Timothy Baldwin (The University of Melbourne), Marco Baroni (University of Trento), Osman Baskaya (Koc University), Emanuele Bastianelli (University of Roma, Tor Vergata), Wesley Baugh (University of North Texas), Lee Becker (Avaya Labs), Satyabrata Behera (IIT Bombay), Luisa Bentivogli (Fondazione Bruno Kessler), Steven Bethard (University of Colorado Boulder), Ergun Bicici (Centre for Next Generation Localisation), Jari Björne (University of Turku), Tamara Bobic (Fraunhofer SCAI), Lorna Byrne (University College Dublin), Marine Carpuat (National Research Council), Giuseppe Castellucci (University of Roma, Tor Vergata), Tawunrat Chalothorn (University of Northumbria at Newcastle), Nate Chambers (US Naval Academy), Angel Chang (Stanford University), Karan Chawla (Indian Institute of Technology Bombay), Colin Cherry (NRC), Md. Faisal Mahbub Chowdhury (University of Trento, Italy and FBK-irst, Italy), Sam Clark (Swarthmore College), Kevin Cohen (Computational Bioscience Program, U. Colorado School of Medicine), Paul Cook (The University of Melbourne), Francisco M Couto (University of Lisbon), Leon Derczynski (University of Sheffield), Mohamed Dermouche (AMI Software R&D / Université de Lyon, ERIC (Lyon 2)), ALBERTO DIAZ (Universidad Complutense de Madrid), Myroslava Dzikovska (University of Edinburgh), Michele Filannino (University of Manchester), João Filgueiras (INESC-ID), Björn Gambäck (Norwegian University of Science and Technology), Martin Gleize (LIMSI-CNRS), Yvette Graham (The University of Melbourne, Centre for Next Generation Localisation), Tobias Günther (University of Gothenburg), Yoan Gutiérrez (University of Matanzas), Hussam Hamdan (AMU), Qi Han (IMS, University of Stuttgart), Viktor Hangya (University of Szeged), Mike Heilman (Educational Testing Service), David Hope (University of Sussex), Diana Inkpen (University of Ottawa), Harshit Jain (International Institute of Information Technology, Hyderabad), Sergio Jimenez (National University of Colombia), David Jurgens (University of California, Los Angeles), Ioannis Klapaftis, Nadin Kökciyan (Bogazici University), Oleksandr Kolomiyets (KU Leuven), Ioannis Korkontzelos (National Centre for Text Mining, The University of Manchester), Milen Kouylekov (CELI S.R.L.), Amitava Kundu (Jadavpur University), Man Lan (ECNU), Natsuda Laokulrat (The University of Tokyo), Alberto Lavelli (FBK-irst), Els Lefever (LT3, Hogeschool Gent), Clement Levallois (Erasmus University Rotterdam), Omer Levy (Bar-Ilan University), Nikolaos Malandrakis (Signal Analysis and Interpretation Laboratory (SAIL), USC, Los Angeles, CA 90089, USA), Suresh Manandhar (University of York), Morgane Marchand (CEA-LIST / CNRS-LIMSI), Eugenio Martı́nez-Cámara (University of Jaén), Saif Mohammad (National Research Council Canada), Preslav Nakov (Qatar Computing Research Institute, Qatar Foundation), Roberto Navigli (Sapienza University of Rome), Sapna Negi (University of Malta), Matteo Negri (Fondazione Bruno Kessler), Diarmuid Ó Séaghdha (University of Cambridge), IFEYINWA OKOYE (University of Colorado at Boulder), Reynier Ortega Bueno (CERPAMID, Cuba), Niels Ott (Eberhard Karls Universität Tübingen), Prabu palanisamy (Serendio), John Pavlopoulos (Athens x University of Economics and Business), Ted Pedersen (University of Minnesota, Duluth), David Pinto (Benemérita Universidad Autónoma de Puebla), Matt Post (Johns Hopkins University), Thomas Proisl (FAU Erlangen-Nürnberg), Majid Rastegar-Mojarad (University of Wisconsin-Milwaukee), Hilke Reckman (SAS Institute), Robert Remus (University of Leipzig), Tim Rocktäschel (Humboldt-Universität zu Berlin, Knowledge Management in Bioinformatics, Unter den Linden 6, Berlin, 10099), Carlos Rodriguez-Penagos (Barcelona Media Innovació), Sara Rosenthal (Columbia University), Alex Rudnick (Indiana University), Jose Saias (Departamento de Informatica - Universidade de Evora), Daniel Sanchez-Cisneros (Universidad Carlos III de Madrid), Didier Schwab (Univ. Grenoble Alpes), Isabel Segura-Bedmar (Carlos III University of Madrid), Reda Siblini (Concordia University), Amanda Stent (AT&T Labs - Research), Jannik Strötgen (Heidelberg University), Nitesh Surtani (IIIT-H), Liling Tan (Nanyang Technological University), Philippe Thomas (Humboldt-Universität zu Berlin, Knowledge Management in Bioinformatics, Unter den Linden 6, 10099 Berlin), Tim Van de Cruys (IRIT & CNRS), Maarten van Gompel (Radboud University Nijmegen), Daniele Vannella (Sapienza University of Rome), Yannick Versley (University of Tuebingen), Christian Wartena (Hochschule Hannover - University of Applied Sciences and Arts), Deniz Yuret (Koc University), Vanni Zavarella (Joint Research Center - European Commission), Zhemin Zhu (CTIT Database Group, EEMCS, University of Twente), and Hans-Peter Zorn (UKP Lab, Technische Universit ät Darmstadt). Invited Speaker: David Forsyth (University of Illinois, Urbana-Champaign) Panelists for *SEM panel: Kevin Knight (USC Information Sciences Institute) Chris Manning (Stanford University) Martha Palmer (University of Colorado at Boulder) Owen Rambow (Columbia University) Dan Roth (University of Illinois at Urbana-Champaign) Panelists for Shared *SEM/SemEval panel: *SEM and SemEval organizers xi"]},{"title":"Table of Contents","paragraphs":["SemEval-2013 Task 1: TempEval-3: Evaluating Time Expressions, Events, and Temporal Relations","Naushad UzZaman, Hector Llorens, Leon Derczynski, James Allen, Marc Verhagen and James Pustejovsky . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 1","ClearTK-TimeML: A minimalist approach to TempEval 2013 Steven Bethard . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 10","HeidelTime: Tuning English and Developing Spanish Resources for TempEval-3 Jannik Strötgen, Julian Zell and Michael Gertz . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 15","ATT1: Temporal Annotation Using Big Windows and Rich Syntactic and Semantic Features Hyuckchul Jung and Amanda Stent . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 20","Semeval-2013 Task 8: Cross-lingual Textual Entailment for Content Synchronization Matteo Negri, Alessandro Marchetti, Yashar Mehdad, Luisa Bentivogli and Danilo Giampiccolo 25 SOFTCARDINALITY: Learning to Identify Directional Cross-Lingual Entailment from Cardinalities and SMT","Sergio Jimenez, Claudia Becerra and Alexander Gelbukh . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 34","SemEval-2013 Task 5: Evaluating Phrasal Semantics Ioannis Korkontzelos, Torsten Zesch, Fabio Massimo Zanzotto and Chris Biemann . . . . . . . . . . . 39 HsH: Estimating Semantic Similarity of Words and Short Phrases with Frequency Normalized Distance Measures","Christian Wartena . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 48","ManTIME: Temporal expression identification and normalization in the TempEval-3 challenge Michele Filannino, Gavin Brown and Goran Nenadic . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 53","FSS-TimEx for TempEval-3: Extracting Temporal Information from Text Vanni Zavarella and Hristo Tanev . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 58","JU CSE: A CRF Based Approach to Annotation of Temporal Expression, Event and Temporal Relations Anup Kumar Kolya, Amitava Kundu, Rajdeep Gupta, Asif Ekbal, Sivaji Bandyopadhyay . . . . . 64","NavyTime: Event and Time Ordering from Raw Text Nate Chambers . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 73","SUTime: Evaluation in TempEval-3 Angel Chang and Christopher D. Manning . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 78","KUL: Data-driven Approach to Temporal Parsing of Newswire Articles Oleksandr Kolomiyets and Marie-Francine Moens . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 83 xiii","UTTime: Temporal Relation Classification using Deep Syntactic Features Natsuda Laokulrat, Makoto Miwa, Yoshimasa Tsuruoka and Takashi Chikayama . . . . . . . . . . . . 88 UMCC DLSI-(EPS): Paraphrases Detection Based on Semantic Distance","Héctor Dávila, Antonio Fernández Orquı́n, Alexander Chávez, Yoan Gutiérrez, Armando Collazo, José I. Abreu, Andrés Montoyo and Rafael Muñoz . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 93","MELODI: Semantic Similarity of Words and Compositional Phrases using Latent Vector Weighting Tim Van de Cruys, Stergos Afantenos and Philippe Muller . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 98","IIRG: A Naive Approach to Evaluating Phrasal Semantics Lorna Byrne, Caroline Fenlon and John Dunnion . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 103","ClaC: Semantic Relatedness of Words and Phrases Reda Siblini and Leila Kosseim . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 108 UNAL: Discriminating between Literal and Figurative Phrasal Usage Using Distributional Statistics and POS tags","Sergio Jimenez, Claudia Becerra and Alexander Gelbukh . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 114 ECNUCS: Recognizing Cross-lingual Textual Entailment Using Multiple Text Similarity and Text Difference Measures","Jiang Zhao, Man Lan and Zheng-Yu Niu . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 118","BUAP: N-gram based Feature Evaluation for the Cross-Lingual Textual Entailment Task Darnes Vilariño, David Pinto, Saul León, Yuridiana Aleman and Helena Gómez . . . . . . . . . . . . 124","ALTN: Word Alignment Features for Cross-lingual Textual Entailment Marco Turchi and Matteo Negri . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 128","Umelb: Cross-lingual Textual Entailment with Word Alignment and String Similarity Features Yvette Graham, Bahar Salehi and Timothy Baldwin . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 133 SemEval-2013 Task 4: Free Paraphrases of Noun Compounds","Iris Hendrickx, Zornitsa Kozareva, Preslav Nakov, Diarmuid Ó Séaghdha, Stan Szpakowicz and Tony Veale . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 138","MELODI: A Supervised Distributional Approach for Free Paraphrasing of Noun Compounds Tim Van de Cruys, Stergos Afantenos and Philippe Muller . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 144","SFS-TUE: Compound Paraphrasing with a Language Model and Discriminative Reranking Yannick Versley . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 148","IIIT-H: A Corpus-Driven Co-occurrence Based Probabilistic Model for Noun Compound Paraphrasing Nitesh Surtani, Arpita Batra, Urmi Ghosh and Soma Paul . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 153","SemEval-2013 Task 10: Cross-lingual Word Sense Disambiguation Els Lefever and Véronique Hoste . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 158 xiv","XLING: Matching Query Sentences to a Parallel Corpus using Topic Models for WSD Liling Tan and Francis Bond . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 167","HLTDI: CL-WSD Using Markov Random Fields for SemEval-2013 Task 10 Alex Rudnick, Can Liu and Michael Gasser . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 171","LIMSI : Cross-lingual Word Sense Disambiguation using Translation Sense Clustering Marianna Apidianaki . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 178","WSD2: Parameter optimisation for Memory-based Cross-Lingual Word-Sense Disambiguation Maarten van Gompel and Antal van den Bosch . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 183 NRC: A Machine Translation Approach to Cross-Lingual Word Sense Disambiguation (SemEval-2013 Task 10)","Marine Carpuat . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 188","SemEval-2013 Task 11: Word Sense Induction and Disambiguation within an End-User Application Roberto Navigli and Daniele Vannella . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 193","Duluth : Word Sense Induction Applied to Web Page Clustering Ted Pedersen . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 202","SATTY : Word Sense Induction Application in Web Search Clustering Satyabrata Behera, Upasana Gaikwad, Ramakrishna Bairi and Ganesh Ramakrishnan . . . . . . . 207","UKP-WSI: UKP Lab Semeval-2013 Task 11 System Description Hans-Peter Zorn and Iryna Gurevych . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 212","unimelb: Topic Modelling-based Word Sense Induction for Web Snippet Clustering Jey Han Lau, Paul Cook and Timothy Baldwin . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 217","SemEval-2013 Task 12: Multilingual Word Sense Disambiguation Roberto Navigli, David Jurgens and Daniele Vannella . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 222 GETALP System : Propagation of a Lesk Measure through an Ant Colony Algorithm","Didier Schwab, Andon Tchechmedjiev, Jérôme Goulian, Mohammad Nasiruddin, Gilles Sérasset and Hervé Blanchon . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 232 UMCC DLSI: Reinforcing a Ranking Algorithm with Sense Frequencies and Multidimensional Semantic Resources to solve Multilingual Word Sense Disambiguation","Yoan Gutiérrez, Yenier Castañeda, Andy González, Rainel Estrada, Dennys D. Piug, Jose I. Abreu, Roger Pérez, Antonio Fernández Orquı́n, Andrés Montoyo, Rafael Muñoz and Franc Camara . . . . . 241","DAEBAK!: Peripheral Diversity for Multilingual Word Sense Disambiguation Steve L. Manion, and Raazesh Sainudiin . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 250","SemEval-2013 Task 3: Spatial Role Labeling Oleksandr Kolomiyets, Parisa Kordjamshidi, Marie-Francine Moens and Steven Bethard . . . . 255 xv SemEval-2013 Task 7: The Joint Student Response Analysis and 8th Recognizing Textual Entailment Challenge","Myroslava Dzikovska, Rodney Nielsen, Chris Brew, Claudia Leacock, Danilo Giampiccolo, Luisa Bentivogli, Peter Clark, Ido Dagan and Hoa Trang Dang . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 263","ETS: Domain Adaptation and Stacking for Short Answer Scoring Michael Heilman and Nitin Madnani . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 275","SOFTCARDINALITY: Hierarchical Text Overlap for Student Response Analysis Sergio Jimenez, Claudia Becerra and Alexander Gelbukh . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 280","UKP-BIU: Similarity and Entailment Metrics for Student Response Analysis Omer Levy, Torsten Zesch, Ido Dagan and Iryna Gurevych . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 285","SemEval-2013 Task 13: Word Sense Induction for Graded and Non-Graded Senses David Jurgens and Ioannis Klapaftis . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 290 AI-KU: Using Substitute Vectors and Co-Occurrence Modeling For Word Sense Induction and Disambiguation","Osman Baskaya, Enis Sert, Volkan Cirik and Deniz Yuret . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 300","unimelb: Topic Modelling-based Word Sense Induction Jey Han Lau, Paul Cook and Timothy Baldwin . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 307 SemEval-2013 Task 2: Sentiment Analysis in Twitter","Preslav Nakov, Sara Rosenthal, Zornitsa Kozareva, Veselin Stoyanov, Alan Ritter and Theresa Wilson . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 312","NRC-Canada: Building the State-of-the-Art in Sentiment Analysis of Tweets Saif Mohammad, Svetlana Kiritchenko and Xiaodan Zhu . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 321 GU-MLT-LT: Sentiment Analysis of Short Messages using Linguistic Features and Stochastic Gradient Descent","Tobias Günther and Lenz Furrer . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 328","AVAYA: Sentiment Analysis on Twitter with Self-Training and Polarity Lexicon Expansion Lee Becker, George Erhart, David Skiba and Valentine Matula . . . . . . . . . . . . . . . . . . . . . . . . . . . . 333 SemEval-2013 Task 9 : Extraction of Drug-Drug Interactions from Biomedical Texts (DDIExtraction 2013)","Isabel Segura-Bedmar, Paloma Mart ı́nez and Marı́a Herrero Zazo . . . . . . . . . . . . . . . . . . . . . . . . . 341 FBK-irst : A Multi-Phase Kernel Based Approach for Drug-Drug Interaction Detection and Classification that Exploits Linguistic Information","Md. Faisal Mahbub Chowdhury and Alberto Lavelli . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 351 WBI-NER: The impact of domain-specific features on the performance of identifying and classifying mentions of drugs","Tim Rocktäschel, Torsten Huber, Michael Weidlich and Ulf Leser . . . . . . . . . . . . . . . . . . . . . . . . . 356 xvi AMI&ERIC: How to Learn with Naive Bayes and Prior Knowledge: an Application to Sentiment Analysis Mohamed Dermouche, Leila Khouas, Julien Velcin and Sabine Loudcher . . . . . . . . . . . . . . . . . . 364","UNITOR: Combining Syntactic and Semantic Kernels for Twitter Sentiment Analysis Giuseppe Castellucci, Simone Filice, Danilo Croce and Roberto Basili . . . . . . . . . . . . . . . . . . . . . 369","TJP: Using Twitter to Analyze the Polarity of Contexts Tawunrat Chalothorn and Jeremy Ellman . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 375","uOttawa: System description for SemEval 2013 Task 2 Sentiment Analysis in Twitter Hamid Poursepanj, Josh Weissbock and Diana Inkpen . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 380","UT-DB: An Experimental Study on Sentiment Analysis in Twitter Zhemin Zhu, Djoerd Hiemstra, Peter Apers and Andreas Wombacher . . . . . . . . . . . . . . . . . . . . . . 384","USNA: A Dual-Classifier Approach to Contextual Sentiment Analysis Ganesh Harihara, Eugene Yang and Nate Chambers . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 390","KLUE: Simple and robust methods for polarity classification Thomas Proisl, Paul Greiner, Stefan Evert and Besim Kabashi . . . . . . . . . . . . . . . . . . . . . . . . . . . . 395 SINAI: Machine Learning and Emotion of the Crowd for Sentiment Analysis in Microblogs","Eugenio Martı́nez-C ámara, Arturo Montejo-R áez, M. Teresa Martı́n-Valdivia and L. Alfonso Ureña-L ópez . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 402 ECNUCS: A Surface Information Based System Description of Sentiment Analysis in Twitter in the SemEval-2013 (Task 2)","Zhu Tiantian, Zhang Fangxi and Man Lan . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 408","Umigon: sentiment analysis for tweets based on terms lists and heuristics Clement Levallois . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 414","[LVIC-LIMSI]: Using Syntactic Features and Multi-polarity Words for Sentiment Analysis in Twitter Morgane Marchand, Alexandru Ginsca, Romaric Besanco̧n and Olivier Mesnard . . . . . . . . . . . 418","SwatCS: Combining simple classifiers with estimated accuracy Sam Clark and Rich Wicentwoski . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 425","NTNU: Domain Semi-Independent Short Message Sentiment Classification Øyvind Selmer, Mikael Brevik, Björn Gambäck and Lars Bungum . . . . . . . . . . . . . . . . . . . . . . . . 430","SAIL: A hybrid approach to sentiment analysis Nikolaos Malandrakis, Abe Kazemzadeh, Alexandros Potamianos and Shrikanth Narayanan . 438 UMCC DLSI-(SA): Using a ranking algorithm and informal features to solve Sentiment Analysis in Twitter","Yoan Gutiérrez, Andy González, Roger Pérez, José I. Abreu, Antonio Fernández Orquı́n, Alejandro Mosquera, Andrés Montoyo, Rafael Muñoz and Franc Camara . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 443 xvii","ASVUniOfLeipzig: Sentiment Analysis in Twitter using Data-driven Machine Learning Techniques Robert Remus . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 450 Experiments with DBpedia, WordNet and SentiWordNet as resources for sentiment analysis in micro-blogging","Hussam Hamdan, Frederic Béchet and Patrice Bellot . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 455 OPTWIMA: Comparing Knowledge-rich and Knowledge-poor Approaches for Sentiment Analysis in Short Informal Texts","Alexandra Balahur . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 460","FBK: Sentiment Analysis in Twitter with Tweetsted Md. Faisal Mahbub Chowdhury, Marco Guerini, Sara Tonelli and Alberto Lavelli . . . . . . . . . . . 466","SU-Sentilab : A Classification System for Sentiment Analysis in Twitter Gizem Gezici, Rahim Dehkharghani, Berrin Yanikoglu, Dilek Tapucu and Yucel Saygin . . . . . 471","Columbia NLP: Sentiment Detection of Subjective Phrases in Social Media Sara Rosenthal and Kathy McKeown . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 478 FBM: Combining lexicon-based ML and heuristics for Social Media Polarities","Carlos Rodriguez-Penagos, Jordi Atserias Batalla, Joan Codina-Filb à, David Garcı́a-Narbona, Jens Grivolla, Patrik Lambert and Roser Saurı́ . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 483","REACTION: A naive machine learning approach for sentiment classification Silvio Moreira, João Filgueiras, Bruno Martins, Francisco Couto and Mário J. Silva . . . . . . . . . 490","IITB-Sentiment-Analysts: Participation in Sentiment Analysis in Twitter SemEval 2013 Task Karan Chawla, Ankit Ramteke and Pushpak Bhattacharyya . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 495","SSA-UO: Unsupervised Sentiment Analysis in Twitter Reynier Ortega Bueno, Adrian Fonseca Bruzón, Yoan Gutiérrez and Andres Montoyo . . . . . . . 501","senti.ue-en: an approach for informally written short texts in SemEval-2013 Sentiment Analysis task José Saias and Hilário Fernandes . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 508 teragram: Rule-based detection of sentiment phrases using SAS Sentiment Analysis","Hilke Reckman, Cheyanne Baird, Jean Crawford, Richard Crowell, Linnea Micciulla, Saratendu Sethi and Fruzsina Veress . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 513 CodeX: Combining an SVM Classifier and Character N-gram Language Models for Sentiment Analysis on Twitter Text","Qi Han, Junfei Guo and Hinrich Schuetze . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 520","sielers : Feature Analysis and Polarity Classification of Expressions from Twitter and SMS Data Harshit Jain, Aditya Mogadala and Vasudeva Varma . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 525","Kea: Expression-level Sentiment Analysis from Twitter Data Ameeta Agrawal and Aijun An . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 530 xviii","UoM: Using Explicit Semantic Analysis for Classifying Sentiments Sapna Negi and Michael Rosner . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 535","bwbaugh : Hierarchical sentiment analysis with partial self-training Wesley Baugh . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 539","Serendio: Simple and Practical lexicon based approach to Sentiment Analysis Prabu palanisamy, Vineet Yadav and Harsha Elchuri . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 543","SZTE-NLP: Sentiment Detection on Twitter Messages Viktor Hangya, Gabor Berend and Richárd Farkas . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 549","BOUNCE: Sentiment Classification in Twitter using Rich Feature Sets Nadin Kökciyan, Arda Çelebi, Arzucan Özgür and Suzan Üsküdarlı . . . . . . . . . . . . . . . . . . . . . . . 554 nlp.cs.aueb.gr: Two Stage Sentiment Analysis","Prodromos Malakasiotis, Rafael Michael Karampatsis, Konstantina Makrynioti and John Pavlopoulos . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 562","NILC USP: A Hybrid System for Sentiment Analysis in Twitter Messages Pedro Balage Filho and Thiago Pardo . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 568","UNITOR-HMM-TK: Structured Kernel-based learning for Spatial Role Labeling Emanuele Bastianelli, Danilo Croce, Roberto Basili and Daniele Nardi . . . . . . . . . . . . . . . . . . . . 573","EHU-ALM: Similarity-Feature Based Approach for Student Response Analysis Itziar Aldabe, Montse Maritxalar and Oier Lopez de Lacalle . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 580","CNGL: Grading Student Answers by Acts of Translation Ergun Bicici and Josef van Genabith . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 585","Celi: EDITS and Generic Text Pair Classification Milen Kouylekov, Luca Dini, Alessio Bosca and Marco Trevisan . . . . . . . . . . . . . . . . . . . . . . . . . . 592","LIMSIILES: Basic English Substitution for Student Answer Assessment at SemEval 2013 Martin Gleize and Brigitte Grau . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 598 CU : Computational Assessment of Short Free Text Answers - A Tool for Evaluating Students’ Understanding","IFEYINWA OKOYE, Steven Bethard and Tamara Sumner . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 603","CoMeT: Integrating different levels of linguistic modeling for meaning assessment Niels Ott, Ramon Ziai, Michael Hahn and Detmar Meurers . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 608","UC3M: A kernel-based approach to identify and classify DDIs in bio-medical texts. Daniel Sanchez-Cisneros . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 617","UEM-UC3M: An Ontology-based named entity recognition system for biomedical texts. Daniel Sanchez-Cisneros and Fernando Aparicio Gali . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 622 xix","WBI-DDI: Drug-Drug Interaction Extraction using Majority Voting Philippe Thomas, Mariana Neves, Tim Rocktäschel and Ulf Leser . . . . . . . . . . . . . . . . . . . . . . . . . 628 UMCC DLSI: Semantic and Lexical features for detection and classification Drugs in biomedical texts","Armando Collazo, Alberto Ceballo, Dennys D. Puig, Yoan Gutiérrez, José I. Abreu, Roger Pérez, Antonio Fernández Orquı́n, Andrés Montoyo, Rafael Muñoz and Franc Camara . . . . . . . . . . . . . . . . . 636 NIL UCM: Extracting Drug-Drug interactions from text through combination of sequence and tree kernels","Behrouz Bokharaeian and ALBERTO DIAZ . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 644 UTurku: Drug Named Entity Recognition and Drug-Drug Interaction Extraction Using SVM Classification and Domain Knowledge","Jari Björne, Suwisa Kaewphan and Tapio Salakoski . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 651","LASIGE: using Conditional Random Fields and ChEBI ontology Tiago Grego, Francisco Pinto and Francisco M Couto . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 660","UWM-TRIADS: Classifying Drug-Drug Interactions with Two-Stage SVM and Post-Processing Majid Rastegar-Mojarad, Richard D. Boyce and Rashmi Prasad . . . . . . . . . . . . . . . . . . . . . . . . . . . 667","SCAI: Extracting drug-drug interactions using a rich feature vector Tamara Bobic, Juliane Fluck and Martin Hofmann-Apitius . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 675 UColorado SOM: Extraction of Drug-Drug Interactions from Biomedical Text using Knowledge-rich and Knowledge-poor Features","Negacy Hailu, Lawrence E. Hunter and K. Bretonnel Cohen . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 684","UoS: A Graph-Based System for Graded Word Sense Induction David Hope and Bill Keller . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 689 xx xxi"]},{"title":"Conference Program Summary 08:00‐‐08:45 08:45‐‐10:30","paragraphs":["*SEM1 10:30‐‐11:00 11:00‐‐12:30 ST1 12:30‐‐2:00 2:00‐‐3:30 ST2 3:30‐‐4:00 4:00‐4:25 4:30‐‐6:00 6:30‐‐8:30 Opening Remarks and *SEM Long Papers 1 *SEM Recepon and STS Poster Session (PLN1) *SEM Panel: Toward Deep Natural Language Understanding: Kevin Knight, Christopher Manning, Martha Palmer, Owen","Rambow, and Dan Roth STS Shared Task 2 and STS Poster boosters Lunch Coffee Break Coffee Break STS Shared Task 1 *SEM Main Conference and STS Shared Task (Internaonal D) SemEval (starng on Day 2 below) Day 1: Thursday June 13th 2013 Registraon *SEM Short Papers 1 *SEM2 xxii 08:00‐‐08:30 08:30‐‐09:30 *SEM Short Papers 2 *SEM3 SemEval Session 1 SE1 09:30‐‐10:30 10:30‐‐11:00 11:00‐‐12:30 *SEM Long Papers 2 *SEM4 SemEval Session 2 SE2 12:30‐‐1:30","Lunch + Poster Session 1 for Tasks 1, 5, 8 SP1 1:30‐‐2:30 2:30‐‐3:30 *SEM Long Papers 3 *SEM5 SemEval Session 3 SE3 3:30‐‐4:00 4:00‐‐4:30 4:30‐‐5:30 5:30‐‐6:00 6:00‐‐6:30 08:40‐‐10:30 SemEval Session 5 SE5 10:30‐‐11:00 Coffee Break 11:00‐‐1:10 SemEval Session 6 SE6 1:10‐3:30 Lunch + Poster Session 3 for Tasks 2, 3, 7, 9, 13 SP3 SE4 SemEval (Internaonal E) Day 3: Saturday June 15th 2013 Day 2: Friday June 14th 2013","Best Papers Awards & Closing remarks *SEM7 Keynote Address: David Forsyth (PLN2) Joint Panel: Future of *SEM / STS Shared Task / SemEval (PLN3) Coffee + Poster Session 2 for Tasks 4, 10, 11, 12 SP2 *SEM Long Papers 4 *SEM6","4:30‐‐6:30 SemEval Session 4 Coffee Break Lunch (ends earlier!) Registraon SemEval (Internaonal E) *SEM Main Conference and STS Shared Task (Internaonal D) Coffee Break xxiii"]},{"title":"Conference Program Day 1: Thursday June 13, 2013 *SEM Main Conference and Shared Task Sessions (no SemEval on Day 1) Session PLN1: (6:30–8:30) *SEM Opening Reception and STS Poster Session (All SemEval attendees are invited) Day 2: Friday June 14, 2013 (08:00–08:30) Registration Session SE1: (08:30–09:30) Session 1","paragraphs":["08:30–08:40 Opening remarks","08:40–09:00 SemEval-2013 Task 1: TempEval-3: Evaluating Time Expressions, Events, and Temporal Relations Naushad UzZaman, Hector Llorens, Leon Derczynski, James Allen, Marc Verhagen and James Pustejovsky","09:00–09:20 ClearTK-TimeML: A minimalist approach to TempEval 2013 Steven Bethard","09:20–09:30 HeidelTime: Tuning English and Developing Spanish Resources for TempEval-3 Jannik Strötgen, Julian Zell and Michael Gertz Session PLN2: (09:30–10:30) Keynote address: David Forsyth (10:30–11:00) Coffee Break Session SE2: (11:00–12:30) Session 2","11:00–11:10 ATT1: Temporal Annotation Using Big Windows and Rich Syntactic and Semantic Features Hyuckchul Jung and Amanda Stent","11:10–11:30 Semeval-2013 Task 8: Cross-lingual Textual Entailment for Content Synchronization Matteo Negri, Alessandro Marchetti, Yashar Mehdad, Luisa Bentivogli and Danilo Giampiccolo","11:30–11:50 SOFTCARDINALITY: Learning to Identify Directional Cross-Lingual Entailment from Cardinalities and SMT Sergio Jimenez, Claudia Becerra and Alexander Gelbukh","11:50–12:10 SemEval-2013 Task 5: Evaluating Phrasal Semantics Ioannis Korkontzelos, Torsten Zesch, Fabio Massimo Zanzotto and Chris Biemannxxiv Day 2: Friday June 14, 2013 (continued)","12:10–12:30 HsH: Estimating Semantic Similarity of Words and Short Phrases with Frequency Normalized Distance Measures Christian Wartena Session SP1: (12:30–13:30) Lunch Break + Poster Session 1 for Tasks 1, 5, 8 SemEval-2013 Task 1: TempEval-3: Evaluating Time Expressions, Events, and Temporal Relations Naushad UzZaman, Hector Llorens, Leon Derczynski, James Allen, Marc Verhagen and James Pustejovsky ClearTK-TimeML: A minimalist approach to TempEval 2013 Steven Bethard ManTIME: Temporal expression identification and normalization in the TempEval-3 challenge Michele Filannino, Gavin Brown and Goran Nenadic HeidelTime: Tuning English and Developing Spanish Resources for TempEval-3 Jannik Strötgen, Julian Zell and Michael Gertz FSS-TimEx for TempEval-3: Extracting Temporal Information from Text Vanni Zavarella and Hristo Tanev ATT1: Temporal Annotation Using Big Windows and Rich Syntactic and Semantic Features Hyuckchul Jung and Amanda Stent JU CSE: A CRF Based Approach to Annotation of Temporal Expression, Event and Temporal Relations Anup Kumar Kolya, Amitava Kundu, Rajdeep Gupta, Asif Ekbal, Sivaji Bandyopadhyay NavyTime: Event and Time Ordering from Raw Text Nate Chambers SUTime: Evaluation in TempEval-3 Angel Chang and Christopher D. Manning KUL: Data-driven Approach to Temporal Parsing of Newswire Articles Oleksandr Kolomiyets and Marie-Francine Moens UTTime: Temporal Relation Classification using Deep Syntactic Features Natsuda Laokulrat, Makoto Miwa, Yoshimasa Tsuruoka and Takashi Chikayama SemEval-2013 Task 5: Evaluating Phrasal Semantics Ioannis Korkontzelos, Torsten Zesch, Fabio Massimo Zanzotto and Chris Biemann xxv Day 2: Friday June 14, 2013 (continued) HsH: Estimating Semantic Similarity of Words and Short Phrases with Frequency Normalized Distance Measures Christian Wartena UMCC DLSI-(EPS): Paraphrases Detection Based on Semantic Distance Héctor Dávila, Antonio Fernández Orquı́n, Alexander Chávez, Yoan Gutiérrez, Armando Collazo, José I. Abreu, Andrés Montoyo and Rafael Muñoz MELODI: Semantic Similarity of Words and Compositional Phrases using Latent Vector Weighting Tim Van de Cruys, Stergos Afantenos and Philippe Muller IIRG: A Naive Approach to Evaluating Phrasal Semantics Lorna Byrne, Caroline Fenlon and John Dunnion ClaC: Semantic Relatedness of Words and Phrases Reda Siblini and Leila Kosseim UNAL: Discriminating between Literal and Figurative Phrasal Usage Using Distributional Statistics and POS tags Sergio Jimenez, Claudia Becerra and Alexander Gelbukh Semeval-2013 Task 8: Cross-lingual Textual Entailment for Content Synchronization Matteo Negri, Alessandro Marchetti, Yashar Mehdad, Luisa Bentivogli and Danilo Giampiccolo ECNUCS: Recognizing Cross-lingual Textual Entailment Using Multiple Text Similarity and Text Difference Measures Jiang Zhao, Man Lan and Zheng-Yu Niu BUAP: N-gram based Feature Evaluation for the Cross-Lingual Textual Entailment Task Darnes Vilariño, David Pinto, Saul León, Yuridiana Aleman and Helena Gómez ALTN: Word Alignment Features for Cross-lingual Textual Entailment Marco Turchi and Matteo Negri SOFTCARDINALITY: Learning to Identify Directional Cross-Lingual Entailment from Cardinalities and SMT Sergio Jimenez, Claudia Becerra and Alexander Gelbukh Umelb: Cross-lingual Textual Entailment with Word Alignment and String Similarity Features Yvette Graham, Bahar Salehi and Timothy Baldwin xxvi Day 2: Friday June 14, 2013 (continued) Session PLN3: (13:30–14:30) Joint Panel: Future of *SEM / STS Shared Task / SemEval Session SE3: (14:30–15:30) Session 3","14:30–14:50 UNAL: Discriminating between Literal and Figurative Phrasal Usage Using Distributional Statistics and POS tags Sergio Jimenez, Claudia Becerra and Alexander Gelbukh","14:50–15:10 SemEval-2013 Task 4: Free Paraphrases of Noun Compounds Iris Hendrickx, Zornitsa Kozareva, Preslav Nakov, Diarmuid Ó Séaghdha, Stan Szpakowicz and Tony Veale","15:10–15:30 MELODI: A Supervised Distributional Approach for Free Paraphrasing of Noun Compounds Tim Van de Cruys, Stergos Afantenos and Philippe Muller Session SP2: (15:30–16:30) Coffee Break + Poster Session 2 for Tasks 4, 10, 11, 12 SemEval-2013 Task 4: Free Paraphrases of Noun Compounds Iris Hendrickx, Zornitsa Kozareva, Preslav Nakov, Diarmuid Ó Séaghdha, Stan Szpakowicz and Tony Veale SFS-TUE: Compound Paraphrasing with a Language Model and Discriminative Reranking Yannick Versley IIIT-H: A Corpus-Driven Co-occurrence Based Probabilistic Model for Noun Compound Paraphrasing Nitesh Surtani, Arpita Batra, Urmi Ghosh and Soma Paul MELODI: A Supervised Distributional Approach for Free Paraphrasing of Noun Compounds Tim Van de Cruys, Stergos Afantenos and Philippe Muller SemEval-2013 Task 10: Cross-lingual Word Sense Disambiguation Els Lefever and Véronique Hoste XLING: Matching Query Sentences to a Parallel Corpus using Topic Models for WSD Liling Tan and Francis Bond HLTDI: CL-WSD Using Markov Random Fields for SemEval-2013 Task 10 Alex Rudnick, Can Liu and Michael Gasser xxvii Day 2: Friday June 14, 2013 (continued) LIMSI : Cross-lingual Word Sense Disambiguation using Translation Sense Clustering Marianna Apidianaki WSD2: Parameter optimisation for Memory-based Cross-Lingual Word-Sense Disambiguation Maarten van Gompel and Antal van den Bosch NRC: A Machine Translation Approach to Cross-Lingual Word Sense Disambiguation (SemEval-2013 Task 10) Marine Carpuat SemEval-2013 Task 11: Word Sense Induction and Disambiguation within an End-User Application Roberto Navigli and Daniele Vannella Duluth : Word Sense Induction Applied to Web Page Clustering Ted Pedersen SATTY : Word Sense Induction Application in Web Search Clustering Satyabrata Behera, Upasana Gaikwad, Ramakrishna Bairi and Ganesh Ramakrishnan UKP-WSI: UKP Lab Semeval-2013 Task 11 System Description Hans-Peter Zorn and Iryna Gurevych unimelb: Topic Modelling-based Word Sense Induction for Web Snippet Clustering Jey Han Lau, Paul Cook and Timothy Baldwin SemEval-2013 Task 12: Multilingual Word Sense Disambiguation Roberto Navigli, David Jurgens and Daniele Vannella GETALP System : Propagation of a Lesk Measure through an Ant Colony Algorithm Didier Schwab, Andon Tchechmedjiev, Jérôme Goulian, Mohammad Nasiruddin, Gilles Sérasset and Hervé Blanchon UMCC DLSI: Reinforcing a Ranking Algorithm with Sense Frequencies and Multidimensional Semantic Resources to solve Multilingual Word Sense Disambiguation Yoan Gutiérrez, Yenier Castañeda, Andy González, Rainel Estrada, Dennys D. Piug, Jose I. Abreu, Roger Pérez, Antonio Fernández Orquı́n, Andrés Montoyo, Rafael Muñoz and Franc Camara DAEBAK!: Peripheral Diversity for Multilingual Word Sense Disambiguation Steve L. Manion, and Raazesh Sainudiin xxviii Day 2: Friday June 14, 2013 (continued) Session SE4: (16:30–18:30) Session 4","16:30–16:50 SemEval-2013 Task 10: Cross-lingual Word Sense Disambiguation Els Lefever and Véronique Hoste","16:50–17:10 HLTDI: CL-WSD Using Markov Random Fields for SemEval-2013 Task 10 Alex Rudnick, Can Liu and Michael Gasser","17:10–17:30 SemEval-2013 Task 11: Word Sense Induction and Disambiguation within an End-User Application Roberto Navigli and Daniele Vannella","17:30–17:50 unimelb: Topic Modelling-based Word Sense Induction for Web Snippet Clustering Jey Han Lau, Paul Cook and Timothy Baldwin","17:50–18:10 SemEval-2013 Task 12: Multilingual Word Sense Disambiguation Roberto Navigli, David Jurgens and Daniele Vannella","18:10–18:20 UMCC DLSI: Reinforcing a Ranking Algorithm with Sense Frequencies and Multidimensional Semantic Resources to solve Multilingual Word Sense Disambiguation Yoan Gutiérrez, Yenier Castañeda, Andy González, Rainel Estrada, Dennys D. Piug, Jose I. Abreu, Roger Pérez, Antonio Fernández Orquı́n, Andrés Montoyo, Rafael Muñoz and Franc Camara","18:20–18:30 DAEBAK!: Peripheral Diversity for Multilingual Word Sense Disambiguation Steve L. Manion, and Raazesh Sainudiin Day 3: Saturday June 15, 2013 Session SE5: (08:40–10:30) Session 5","08:40–09:00 SemEval-2013 Task 3: Spatial Role Labeling Oleksandr Kolomiyets, Parisa Kordjamshidi, Marie-Francine Moens and Steven Bethard","09:00–09:20 SemEval-2013 Task 7: The Joint Student Response Analysis and 8th Recognizing Textual Entailment Challenge Myroslava Dzikovska, Rodney Nielsen, Chris Brew, Claudia Leacock, Danilo Giampiccolo, Luisa Bentivogli, Peter Clark, Ido Dagan and Hoa Trang Dang","09:20–09:35 ETS: Domain Adaptation and Stacking for Short Answer Scoring Michael Heilman and Nitin Madnani xxix Day 3: Saturday June 15, 2013 (continued)","09:35–09:50 SOFTCARDINALITY: Hierarchical Text Overlap for Student Response Analysis Sergio Jimenez, Claudia Becerra and Alexander Gelbukh","09:50–10:00 UKP-BIU: Similarity and Entailment Metrics for Student Response Analysis Omer Levy, Torsten Zesch, Ido Dagan and Iryna Gurevych","10:00–10:20 SemEval-2013 Task 13: Word Sense Induction for Graded and Non-Graded Senses David Jurgens and Ioannis Klapaftis","10:20–10:30 AI-KU: Using Substitute Vectors and Co-Occurrence Modeling For Word Sense Induction and Disambiguation Osman Baskaya, Enis Sert, Volkan Cirik and Deniz Yuret (10:30–11:00) Coffee Break Session SE6: (11:00–13:10) Session 6","11:00–11:10 unimelb: Topic Modelling-based Word Sense Induction Jey Han Lau, Paul Cook and Timothy Baldwin","11:10–11:30 SemEval-2013 Task 2: Sentiment Analysis in Twitter Preslav Nakov, Sara Rosenthal, Zornitsa Kozareva, Veselin Stoyanov, Alan Ritter and Theresa Wilson","11:30–11:50 NRC-Canada: Building the State-of-the-Art in Sentiment Analysis of Tweets Saif Mohammad, Svetlana Kiritchenko and Xiaodan Zhu","11:50–12:00 GU-MLT-LT: Sentiment Analysis of Short Messages using Linguistic Features and Stochastic Gradient Descent Tobias Günther and Lenz Furrer","12:00–12:10 AVAYA: Sentiment Analysis on Twitter with Self-Training and Polarity Lexicon Expansion Lee Becker, George Erhart, David Skiba and Valentine Matula","12:10–12:30 SemEval-2013 Task 9 : Extraction of Drug-Drug Interactions from Biomedical Texts (DDIExtraction 2013) Isabel Segura-Bedmar, Paloma Mart ı́nez and Marı́a Herrero Zazo","12:30–12:50 FBK-irst : A Multi-Phase Kernel Based Approach for Drug-Drug Interaction Detection and Classification that Exploits Linguistic Information Md. Faisal Mahbub Chowdhury and Alberto Lavelli","12:50–13:10 WBI-NER: The impact of domain-specific features on the performance of identifying and classifying mentions of drugs Tim Rocktäschel, Torsten Huber, Michael Weidlich and Ulf Leser xxx Day 3: Saturday June 15, 2013 (continued) Session SP3: (13:10–15:30) Lunch Break + Poster Session 3 for Tasks 2, 3, 7, 9, 13 SemEval-2013 Task 2: Sentiment Analysis in Twitter Preslav Nakov, Sara Rosenthal, Zornitsa Kozareva, Veselin Stoyanov, Alan Ritter and Theresa Wilson AMI&ERIC: How to Learn with Naive Bayes and Prior Knowledge: an Application to Sentiment Analysis Mohamed Dermouche, Leila Khouas, Julien Velcin and Sabine Loudcher UNITOR: Combining Syntactic and Semantic Kernels for Twitter Sentiment Analysis Giuseppe Castellucci, Simone Filice, Danilo Croce and Roberto Basili GU-MLT-LT: Sentiment Analysis of Short Messages using Linguistic Features and Stochastic Gradient Descent Tobias Günther and Lenz Furrer AVAYA: Sentiment Analysis on Twitter with Self-Training and Polarity Lexicon Expansion Lee Becker, George Erhart, David Skiba and Valentine Matula TJP: Using Twitter to Analyze the Polarity of Contexts Tawunrat Chalothorn and Jeremy Ellman uOttawa: System description for SemEval 2013 Task 2 Sentiment Analysis in Twitter Hamid Poursepanj, Josh Weissbock and Diana Inkpen UT-DB: An Experimental Study on Sentiment Analysis in Twitter Zhemin Zhu, Djoerd Hiemstra, Peter Apers and Andreas Wombacher USNA: A Dual-Classifier Approach to Contextual Sentiment Analysis Ganesh Harihara, Eugene Yang and Nate Chambers KLUE: Simple and robust methods for polarity classification Thomas Proisl, Paul Greiner, Stefan Evert and Besim Kabashi SINAI: Machine Learning and Emotion of the Crowd for Sentiment Analysis in Microblogs Eugenio Martı́nez-C ámara, Arturo Montejo-R áez, M. Teresa Martı́n-Valdivia and L. Alfonso Ureña-L ópez ECNUCS: A Surface Information Based System Description of Sentiment Analysis in Twitter in the SemEval-2013 (Task 2) Zhu Tiantian, Zhang Fangxi and Man Lan Umigon: sentiment analysis for tweets based on terms lists and heuristics Clement Levallois xxxi Day 3: Saturday June 15, 2013 (continued) [LVIC-LIMSI]: Using Syntactic Features and Multi-polarity Words for Sentiment Analysis in Twitter Morgane Marchand, Alexandru Ginsca, Romaric Besanco̧n and Olivier Mesnard SwatCS: Combining simple classifiers with estimated accuracy Sam Clark and Rich Wicentwoski NTNU: Domain Semi-Independent Short Message Sentiment Classification Øyvind Selmer, Mikael Brevik, Björn Gambäck and Lars Bungum SAIL: A hybrid approach to sentiment analysis Nikolaos Malandrakis, Abe Kazemzadeh, Alexandros Potamianos and Shrikanth Narayanan UMCC DLSI-(SA): Using a ranking algorithm and informal features to solve Sentiment Analysis in Twitter Yoan Gutiérrez, Andy González, Roger Pérez, José I. Abreu, Antonio Fernández Orquı́n, Alejandro Mosquera, Andrés Montoyo, Rafael Muñoz and Franc Camara ASVUniOfLeipzig: Sentiment Analysis in Twitter using Data-driven Machine Learning Techniques Robert Remus Experiments with DBpedia, WordNet and SentiWordNet as resources for sentiment analysis in micro-blogging Hussam Hamdan, Frederic Béchet and Patrice Bellot OPTWIMA: Comparing Knowledge-rich and Knowledge-poor Approaches for Sentiment Analysis in Short Informal Texts Alexandra Balahur FBK: Sentiment Analysis in Twitter with Tweetsted Md. Faisal Mahbub Chowdhury, Marco Guerini, Sara Tonelli and Alberto Lavelli SU-Sentilab : A Classification System for Sentiment Analysis in Twitter Gizem Gezici, Rahim Dehkharghani, Berrin Yanikoglu, Dilek Tapucu and Yucel Saygin Columbia NLP: Sentiment Detection of Subjective Phrases in Social Media Sara Rosenthal and Kathy McKeown FBM: Combining lexicon-based ML and heuristics for Social Media Polarities Carlos Rodriguez-Penagos, Jordi Atserias Batalla, Joan Codina-Filb à, David Garcı́a-Narbona, Jens Grivolla, Patrik Lambert and Roser Saurı́ xxxii Day 3: Saturday June 15, 2013 (continued) REACTION: A naive machine learning approach for sentiment classification Silvio Moreira, João Filgueiras, Bruno Martins, Francisco Couto and Mário J. Silva IITB-Sentiment-Analysts: Participation in Sentiment Analysis in Twitter SemEval 2013 Task Karan Chawla, Ankit Ramteke and Pushpak Bhattacharyya SSA-UO: Unsupervised Sentiment Analysis in Twitter Reynier Ortega Bueno, Adrian Fonseca Bruzón, Yoan Gutiérrez and Andres Montoyo senti.ue-en: an approach for informally written short texts in SemEval-2013 Sentiment Analysis task José Saias and Hilário Fernandes teragram: Rule-based detection of sentiment phrases using SAS Sentiment Analysis Hilke Reckman, Cheyanne Baird, Jean Crawford, Richard Crowell, Linnea Micciulla, Saratendu Sethi and Fruzsina Veress CodeX: Combining an SVM Classifier and Character N-gram Language Models for Sentiment Analysis on Twitter Text Qi Han, Junfei Guo and Hinrich Schuetze sielers : Feature Analysis and Polarity Classification of Expressions from Twitter and SMS Data Harshit Jain, Aditya Mogadala and Vasudeva Varma Kea: Expression-level Sentiment Analysis from Twitter Data Ameeta Agrawal and Aijun An NRC-Canada: Building the State-of-the-Art in Sentiment Analysis of Tweets Saif Mohammad, Svetlana Kiritchenko and Xiaodan Zhu UoM: Using Explicit Semantic Analysis for Classifying Sentiments Sapna Negi and Michael Rosner bwbaugh : Hierarchical sentiment analysis with partial self-training Wesley Baugh Serendio: Simple and Practical lexicon based approach to Sentiment Analysis Prabu palanisamy, Vineet Yadav and Harsha Elchuri SZTE-NLP: Sentiment Detection on Twitter Messages Viktor Hangya, Gabor Berend and Richárd Farkas xxxiii Day 3: Saturday June 15, 2013 (continued) BOUNCE: Sentiment Classification in Twitter using Rich Feature Sets Nadin Kökciyan, Arda Çelebi, Arzucan Özgür and Suzan Üsküdarlı nlp.cs.aueb.gr: Two Stage Sentiment Analysis Prodromos Malakasiotis, Rafael Michael Karampatsis, Konstantina Makrynioti and John Pavlopoulos NILC USP: A Hybrid System for Sentiment Analysis in Twitter Messages Pedro Balage Filho and Thiago Pardo SemEval-2013 Task 3: Spatial Role Labeling Oleksandr Kolomiyets, Parisa Kordjamshidi, Marie-Francine Moens and Steven Bethard UNITOR-HMM-TK: Structured Kernel-based learning for Spatial Role Labeling Emanuele Bastianelli, Danilo Croce, Roberto Basili and Daniele Nardi SemEval-2013 Task 7: The Joint Student Response Analysis and 8th Recognizing Textual Entailment Challenge Myroslava Dzikovska, Rodney Nielsen, Chris Brew, Claudia Leacock, Danilo Giampiccolo, Luisa Bentivogli, Peter Clark, Ido Dagan and Hoa Trang Dang UKP-BIU: Similarity and Entailment Metrics for Student Response Analysis Omer Levy, Torsten Zesch, Ido Dagan and Iryna Gurevych ETS: Domain Adaptation and Stacking for Short Answer Scoring Michael Heilman and Nitin Madnani EHU-ALM: Similarity-Feature Based Approach for Student Response Analysis Itziar Aldabe, Montse Maritxalar and Oier Lopez de Lacalle CNGL: Grading Student Answers by Acts of Translation Ergun Bicici and Josef van Genabith Celi: EDITS and Generic Text Pair Classification Milen Kouylekov, Luca Dini, Alessio Bosca and Marco Trevisan LIMSIILES: Basic English Substitution for Student Answer Assessment at SemEval 2013 Martin Gleize and Brigitte Grau SOFTCARDINALITY: Hierarchical Text Overlap for Student Response Analysis Sergio Jimenez, Claudia Becerra and Alexander Gelbukh CU : Computational Assessment of Short Free Text Answers - A Tool for Evaluating Students’ Understanding IFEYINWA OKOYE, Steven Bethard and Tamara Sumner xxxiv Day 3: Saturday June 15, 2013 (continued) CoMeT: Integrating different levels of linguistic modeling for meaning assessment Niels Ott, Ramon Ziai, Michael Hahn and Detmar Meurers SemEval-2013 Task 9 : Extraction of Drug-Drug Interactions from Biomedical Texts (DDIExtraction 2013) Isabel Segura-Bedmar, Paloma Mart ı́nez and Marı́a Herrero Zazo UC3M: A kernel-based approach to identify and classify DDIs in bio-medical texts. Daniel Sanchez-Cisneros UEM-UC3M: An Ontology-based named entity recognition system for biomedical texts. Daniel Sanchez-Cisneros and Fernando Aparicio Gali FBK-irst : A Multi-Phase Kernel Based Approach for Drug-Drug Interaction Detection and Classification that Exploits Linguistic Information Md. Faisal Mahbub Chowdhury and Alberto Lavelli WBI-DDI: Drug-Drug Interaction Extraction using Majority Voting Philippe Thomas, Mariana Neves, Tim Rocktäschel and Ulf Leser WBI-NER: The impact of domain-specific features on the performance of identifying and classifying mentions of drugs Tim Rocktäschel, Torsten Huber, Michael Weidlich and Ulf Leser UMCC DLSI: Semantic and Lexical features for detection and classification Drugs in biomedical texts Armando Collazo, Alberto Ceballo, Dennys D. Puig, Yoan Gutiérrez, José I. Abreu, Roger Pérez, Antonio Fernández Orquı́n, Andrés Montoyo, Rafael Muñoz and Franc Camara NIL UCM: Extracting Drug-Drug interactions from text through combination of sequence and tree kernels Behrouz Bokharaeian and ALBERTO DIAZ UTurku: Drug Named Entity Recognition and Drug-Drug Interaction Extraction Using SVM Classification and Domain Knowledge Jari Björne, Suwisa Kaewphan and Tapio Salakoski LASIGE: using Conditional Random Fields and ChEBI ontology Tiago Grego, Francisco Pinto and Francisco M Couto UWM-TRIADS: Classifying Drug-Drug Interactions with Two-Stage SVM and Post-Processing Majid Rastegar-Mojarad, Richard D. Boyce and Rashmi Prasad xxxv Day 3: Saturday June 15, 2013 (continued) SCAI: Extracting drug-drug interactions using a rich feature vector Tamara Bobic, Juliane Fluck and Martin Hofmann-Apitius UColorado SOM: Extraction of Drug-Drug Interactions from Biomedical Text using Knowledge-rich and Knowledge-poor Features Negacy Hailu, Lawrence E. Hunter and K. Bretonnel Cohen SemEval-2013 Task 13: Word Sense Induction for Graded and Non-Graded Senses David Jurgens and Ioannis Klapaftis UoS: A Graph-Based System for Graded Word Sense Induction David Hope and Bill Keller AI-KU: Using Substitute Vectors and Co-Occurrence Modeling For Word Sense Induction and Disambiguation Osman Baskaya, Enis Sert, Volkan Cirik and Deniz Yuret unimelb: Topic Modelling-based Word Sense Induction Jey Han Lau, Paul Cook and Timothy Baldwin xxxvi"]}]}