{"sections":[{"title":"Book Reviews Reasoning and Discourse Processes","paragraphs":["This definition of synonymy provides us with a tool to relate the words in the vocabulary of a language to one another, and, hence, a tool with th,e aid of which we can define all the word-uses of each word-sign simply and in a form allowing comparisons of definitions. It can be objected that if this approach is applied to special vocabulary (technical and scientific terminology) in which synonymy is rare, the definitions of word-uses will often remain empty. The author analyzes various potential classifications of sets of synonyms (sets of rows) enabled by the synonymy definition, as well as the possibilities of their groupings. She finds a few ways of row grouping resulting in conceptual groupings similar to those found in thesauri. She made a computer experiment whose aim was to find out whether the suggested procedure of grouping is practicable for the natural language vocabulary. She selected 21 word-signs and, on the basis of information about them contained in the"]},{"title":"Oxford English Dictionary,","paragraphs":["assigned 500 rows to them (given in her Appendix 2). With aid of the computer, she tried to establish groupings similar to those in thesauri. The results have been satisfactory in part only. After modifying classification criteria, the author intended to carry out a new experiment involving about 2,000 rows. The results of thai: experiment were not mentioned in the chapter \"Twenty years later\".","Sparck Jones is looking for an answer to the question as to why we expect to find synonyms in natural languages. She arrives at the conclusion that synonymy is not a mere redundance and that it exists because, in the extra-linguistic world, we encounter situations that are unique, but, at the same time, similar to each other in certain aspects. Synonymy reflec'~s this fact; otherwise language would be an inadequate representation of the extra-linguistic world. She gives four models of the way linguistic symbols are set up and she claims that her Model 4 is the one that represents natural language:","Model 4:","a. A word-use may have more than one sign;","b. Two or more word-uses may have the same sign, where","these word-uses are similar. (p. 135) It remains unclear why also homonymy, which is included in her Model 2 and which does constitute a language relation, is not dealt with in Model 4, and why the word"]},{"title":"homonymy","paragraphs":["is never used in the book.","The book exemplifies an excellent way the efforts made to solve practical problems in computational linguistics bring new and promising knowledge in a field of linguistic theory. The rendering of the subject has a solid, logical structure; it is clear and systematic. The text is not burdened with the artificial linguistic terminology that flooded the linguistic publications of the sixties. It can be regretted that the book was not published at the time of its origin. Even for the present time, however, it yields a number of suggestions for linguistic research. NOTE The author states that \"word-meaning\" and \"word-use\" are to be regarded as synonyms and makes use of \"word-use\" throughout her book. I will do the same in this review."]},{"title":"Svatava Machovdt","paragraphs":["received her Ph.D. in computational linguistics frora Charles University, Prague, in 1970; she is presently a ,~enior scientific worker in the university's Computer Center. Her research has included lexical components of question-~,nswering systems and multilingual terminological databanks. Her address is: Matematicko-fyzik~lni fakult6, Univerzity Karlovy, Malostransk6 n. 25, 118 00 Praha, Czechoslovakia. REASONING AND DISCOURSE PROCESSES Terry Myers; Keith Brown; and Brendan McGonigle (eds.) (Respectively: University of Edinburgh, University of","Essex, and University of Edinburgh) (Cognitive Science Series) Academic Press: London, 1986, xii+295 pp. Hardbound, ISBN 0-12-512320-5, $69.00 (hb); ISBN","0-12-512321-3, $29.95 (sb)"]},{"title":"Reviewed by Robin Cohen University of Waterloo Reasoning and Discourse Processes","paragraphs":["is a collection of papers in the Cognitive Science series of Academic Press. The authors are largely from psychology and linguistics departments in the U.K. and Europe. The book begins with a brief preface, which clearly sets out the theme of the book: exploring the relation between verbal reasoning and discourse, with an aim of contributing to an adequate theory of natural language processing. The very first chapter of the book, written by the editors, serves to describe how the different authors address the theme mentioned in the preface. This chapter is an excellent summary of the upcoming chapters, providing the reader with an index into those parts of the book of most interest to his/her own research.","The editors divide the papers into two main topics: forms of representation and the role of inference for reasoning within discourse. The first six chapters discuss representation: \"whether rules of inference for-malized in a logical calculus adequately characterize the deductive component of the verbal reasoning capacity\". The remaining chapters are primarily concerned with characterizations of coherence; these considerations may introduce a deductive component into discourse.","The book thus addresses issues of concern to computational linguists. Constructing models for the processing of natural language requires considerations both of the form of the representation and the inferencing 86 Computational Linguistics, Volume 14, Number 4, December 1988 Book Reviews Language and Information required to build the representation. Characterizations of coherence may be useful in controlling the analysis, and considering the form of reasoning underlying the discourse may help to characterize the form. As the book focuses on discourse, particular issues such as reference resolution and the maxims of conversation are highlighted. There are in fact particular questions addressed in some of the chapters which are especially relevant to certain computational linguistics research efforts.","The first three chapters present conceptions of the form of reasoning underlying discourse, especially arguments. These papers are relevant to computational linguists involved in constructing models for the analysis of discourse. Johnson-Laird argues that logical form has no role in accounting for deductive competence. Connectives and quantifiers do not merit a special treatment; people need only know the truth conditions of these terms in order to make deductions. In another chapter, Moore presents some evidence for induction as a model of reasoning. In contrast, Allwoodclaims that speakers share a normative intuition, following traditional logic, of the shape of an argument. He contributes some insights as well into the role of utterance-level intentions in discourse structure. Hagert and Waern present some insight into the form of invalid plans underlying discourse. They comment on the need to distinguish inferences underlying actual sentences from those used for inferencing (i.e., the point of view of the observer and the speaker).","The last three chapters of the book, by Kempson, Wilson and Sperber, and Wilks, present an interesting discussion of the procedures for discourse processing. Kempson draws on some suggestions of Wilson and Sperber to discuss the relationship between semantic and pragmatic processing, with an application to anaphora resolution. She proposes a mapping from surface structure to a logical form, which then interacts with a pragmatic, relevance-driven rule of antecedent identification. Wilson and Sperber address the use of \"relevance\" to utterance-level analysis, which is seen as a process of hypothesis formation. Wilks then criticizes Sperber and Wilson for failing to distinguish beliefs of conversants, in interpreting inference in discourse.","In general, the collection is a useful reference. My main negative comment is that some of the papers do not include enough examples (which would be eminently useful for people constructing implementations), and as a result end up appearing too general, too superficial. But on the whole I continue to have faith that dialog between cognitive scientists (psychologists, linguists) and computer science researchers is possible, even for those computer science people without the aim of having a cognitively accurate model of human processing. The class of input to process can be made clearer, and intuitions for the characterizations of processing models can be provided. Robin Cohen's research concentrates on the structure of argument and discourse. Cohen's address is: Department of Computer Science, University of Waterloo, Waterloo, Ontario, Canada N2L 3G1. E-mail: rcohen@watdragon.waterloo.edu LANGUAGE AND INFORMATION Zeilig Sabbettai Harris (University of Pennsylvania) (Bampton lectures in America 28) New York: Columbia University Press, 1988, ix+ 120","pp. ISBN 0-231-06662-7; $20.00 (hb) Reviewed by Bruce Nevin BBN Communications Corporation The glib freedom with which we use the word information would lead one to suppose we know what we are talking about. Alas, not so. In a field that concerns itself with \"information processing\", it is remarkable if not embarrassing that there is still, after 40 years, no generally accepted, coherent definition of information to underwrite the enterprise.","It is well known that information theory is not concerned with the information content or meanings of particular texts or utterances. It interprets certain measures of probability or uncertainty in an ensemble of signal sequences (which may indeed be meaningless) as a metric of the difficulty of transmitting a given signal sequence, and then calls this metric, in a notoriously misleading way, the \"amount of information\" in the signal.","Carnap and Bar-Hillel 2 announced long ago what was essentially a ramification of Carnap's work in inductive logic and probability, a Theory of Semantic Information dealing solely with linguistic entities (\"state descriptions\" in some logical language) and what they stand for or designate. Carnap's aim was to devise measures of \"semantic content\" that would enable him to get at \"confirmation functions\" to underwrite inductive logic. Bar-Hillel's initial enthusiasm was to develop a perhaps broader \"calculus of information.\" Although the banner they dropped was taken up in the '60s by Hintikka and others, 3 it is safe to say that this line of thought has contributed little to a satisfactory definition of information.","Today, we witness the spectacle of Dretske and the situation semantics folks 4 mounted precariously on the Scylla of naive realism, tilting with Fodor atop the Charybdis of a mental representationalism that is philosophically more sophisticated but no less ad hoc in its misuse of metaphor: Unfortunately, a summary of the well-deserved doubt that each casts upon the merits of the other's case is beyond the scope of this review. Computational Linguistics, Volume 14, Number 4, December 1988 87"]}]}