{"sections":[{"title":"Book Reviews Briefly Noted","paragraphs":["And from this it follows that weak generative capacity, as usually conceived, cannot be the right notion of complexity to study in connection with human language (even if it were to be measured by a yardstick different from the Chomsky hierarchy).","Important as the three papers I have mentioned are, my favorite is the previously unpublished---and, this time, brand new--paper by Savitch on context-sensitive grammars. Most of the mathematics underlying the theory of computation and mathematical linguistics is familiar, but the implications of these results for empirical science are rarely discussed explicitly in the literature, and are not widely known. Savitch's contribution is one of the few places where a humdrum formal result, which has been known for a number of years, comes to life.","The point is essentially this: we know that the recursively enumerable (r.e.) languages are accepted by Turing machines, which may use an arbitrary amount of tape before accepting a given string, whereas the CSLs are accepted by (non-deterministic) TMs which have a certain (linear) bound on the amount of tape that may be used. Now, given any r.e. language, we can construct a rather similar CSL, in which the extra tape that was required for the computation is built into the input. To do this, a string of special marker symbols is appended to the end of the real input. A computation proceeds as it would in the original (unbounded) TM except that the marked cells are used instead of blank ones. If the TM runs out of the marked cells to hold intermediate results, then the computation is aborted without accepting. Intuitively, then, the CSL accepted is not very different from the underlying r.e. language, and we see that each r.e. language can be encoded as a CSL. Moreover, the process of converting this CSL to the underlying r.e. language is trivial: delete the marker symbols (though there is no algorithm for going from the r.e. language to the CSL).","Savitch argues, convincingly to my mind, that all this indicates that CSLs have all the structural complexity of r.e. languages, and hence are not suitable as a model of human language---or anything else. We have all been taught to think of the r.e. languages as including \"everything\", but in a real sense, so do the CSLs. For years, there was a feeling that recursiveness was something to strive for, but now we see that this was much too modest a goal. If human languages are characterized by certain structural universals (e.g., they all use reduplication but not prime length of a string as a grammatical device), then CSLs are already much too inclusive, for they contain all languages that can be characterized in such structural terms. Savitch's contribution should help open up the heavily fortified border between the mathematical theory of computation and empirical science. Perhaps it will be the beginning of a beautiful friendship.","In sum, this book is well worth careful study. It is by no means the last word on the subject, but for many it may well be the first word, and Savitch et al. have done an excellent job, both in their selections and in their commentaries, of giving a solid introduction to a sparsely cultivated but already complex field. They have also done much to foster the dissemination and the comprehension of formal complexity results in linguistics and to encourage accuracy and lucidity in the formulation, presentation, and interpretation of such results."]},{"title":"REFERENCES","paragraphs":["Daly, R. T. 1974 Applications of the Mathematical Theory of Linguistics. Mouton, The Hague, Netherlands.","Langendoen, D. T. 1977 On the inadequacy of type-3 and type-2 grammars for human languages, In Studies in Descriptive and Historical Linguistics: Festschrift for Winfred Lehmann Hopper, P. J. (Ed.). John Benjamins, Amsterdam, Netherlands, 159-172.","Lapointe, S. 1977 Recursiveness and deletion, Linguistic Analysis 3:227-266.","Levelt, W. J. M. 1974 Formal Grammars in Linguistics and Psycho-linguistics. Mouton, The Hague, Netherlands.","Peters, S. 1973 On restricting deletion transformations, In The Formal Analysis of Natural Languages Gross, Maurice; Halle, Morris; and Schiitzenberger, Marcel-Paul (eds.). Mouton, The Hague, Netherlands and Paris, France.","Ziff, P. 1960 Semantic Analysis. Cornell University Press, Ithaca, NY. NOTE Ziff (1960, pp.85-86) drew a different conclusion, namely, that proper names are not words, but this would still spell the end of any real raison d'c3tre for weak generative capacity studies in linguistics, since now when we look at sentences of a human language we must somehow distinguish those containing names from those that do not. Alexis Manaster-Ramer received his Ph.D. in linguistics from the University of Chicago in 1981, and has taught linguistics at the University of Michigan, and computer science at Wayne State University. He is editor of the book Mathematics of Language (John Benjamins 1987), and is presently organizing the new Association for Mathematics of Language. Manaster-Ramer's address is IBM T.J. Watson Research Center, PO Box 704, Yorktown Heights, NY 10598. BRIEFLY NOTED THE CAMBRIDGE ENCYCLOPEDIA OF LANGUAGE David Crystal (University College of North Wales) Cambridge University Press, Cambridge, England, 1987,","vii+472 pp. ISBN 0-521-26438-3, $39.50 (hb) David Crystal is well known as a linguist who has worked in such assorted areas as stylistics and language pathology. In addition to his research writings, be is also a popularizer of linguistics, being the author of an introductory book and a radio broadcaster in the U.K.","The present volume is also aimed at the general public, and is a particularly ambitious attempt to present the fascination (and breadth) of the sciences of language. Topics covered Computational Linguistics, Volume 14, Number 4, December 1988 103 Book Reviews Briefly Noted include such diverse matters as language typology, verbal taboos, the relationship between blood groups and dental fricatives, methods of teaching second languages, theories of hearing, how to buy a dictionary, suprasegmental analysis, spelling reform, cohesion in discourse, the history of linguistics, and calligraphy.","Despite its title, the book is not an encyclopedia in the usual sense: it is by a single author, is arranged in a conceptual hierarchy rather than alphabetical order, and is not really a reference book (although in some places the material is comprehensive enough for reference use). There are 65 articles, each from 2 to 18 (large) pages. The articles include many boxes, sidebars, pictures, and, occasionally, puzzles, in addition to the main text. While much of the material will be familiar to readers of this journal whose background is primarily in linguistics, chances are that they will still find something new and fascinating in this book. Readers who have come to computational linguistics through computer science and artificial intelligence will find it an entertaining way to broaden their background. --G.H. THE LANGUAGES OF THE WORLD Kenneth Katzner","London: Routlege and Kegan Paul, London, England (rev. ed.), 1986, x+376 pp. ISBN 0-7102-0861-8 (sb) A short catalogue of the languages of the world and their distribution, including, for 200 major languages, an example of text in the language, a translation, and a brief description of its history, distribution, and alphabet. THE FLIGHT FROM AMBIGUITY: ESSAYS IN SOCIAL AND CULTURAL THEORY Donald Nathan Levine (University of Chicago, IL) University of Chicago Press, Chicago, IL, 1985, x+248 pp. ISBN 0-226-47555-7 (hb); ISBN 0-226-47556-5, $12.95 (sb) The recent ascendency of computerized thoughtways constitutes a profound alteration in the system of world culture. •.. Among other outcomes, it has energized a recurrent modern wish to produce a wholly logical, univocal system of language.","Some devotees of this process have sought to map human \"natural\" language onto a computer program. This goal, however, has recently been pronounced futile by even its most dedicated proponents, who have come to conclude that for all the phonological, morphological, grammatical, syntactical, and semantic rules that govern them, natural languages remain incorrigibly ambiguous.","Although this conclusion seems maddening to computer scientists, is it really so unfortunate? Partly yes, partly no","This book expresses my deep conviction that the proper stance of moderns towards ambiguous language and thought is one of pronounced ambivalence. --From the preface CATEGORIAL GRAMMARS AND NATURAL LANGUAGE STRUCTURES Richard T. Oehrle, Emmon Bach, and Deirdre Wheeler (eds.) (University of Arizona, Tucson, AZ; University of","Massachusetts, Amherst, MA; University of Iowa) (Studies in Linguistics and Philosophy 32) D. Reidel, Dordecht, The Netherlands, 1988, vii+524 pp. ISBN 1-55608-030-1, $89.00, £57.95, Dr 190• (hb)","Most of the papers in this volume are based on presentations","given at a conference held in Tucson, AZ in June 1985. The","contents are as follows: \"Categorial grammars as theories of language\", by Emmon Bach \"The Lambek calculus\", by Johan van Benthem \"Generative power of categorial grammars\", by Wojciech Buszkowsld \"Semantic categories and the development of categorial grammars\", by Claudia Casadio \"Aspects of a categorical theory of binding\", by Gennaro Chierchia \"Type raising, functional composition, and non-constituent conjunction\", by David Dowty \"Implications of process-morphology for categorial grammar\", by Jack Hoeksema and Richard D. Janda \"Phrasal verbs and the categories of postponement\", by Geoffrey J. Huck \"Natural language motivations for extending categorial grammar\", by Edward L. Keenan and Alan Timberlake \"Categorial and categorical grammars\", by J. Lambek \"Mixed composition and discontinuous dependencies\", by Michael Moortgat \"Multi-dimensional compositional functions as a basis for grammatical analysis\", by Richard T. Oehrle \"Categoriai grammar and phrase structure grammar: An excursion on the syntax-semantics frontier\", by Carl J. Pollard \"Combinators and grammars\", by Mark Steedman \"A typology of functors and categories\", by Susan Steele \"Consequences of some categorially motivated phonological assumptions\", by Deirdre Wheeler Topics IN COGNITIVE LINGUISTICS Brygida Rudzka-Ostyn (editor) (University of Leuven) (Amsterdam studies in the theory and history of linguistic","science; Series IV: Current issues in linguistic theory 50) Amsterdam and Philadelphia: John Benjamins Publishing","Company, 1988, x+704 pp. ISBN 90-272-3544-9, $127.00 / Dr 285. (hb) Recent years have witnessed a growing interest in cognitive linguistics, a framework aiming at an adequate account of the relationship between language and cognition and as such involving human psychology, interpersonal relations, culture, and a host of other domains. Our purpose has been to present the theoretical premises of this framework and to explore its descriptive and explanatory potential with respect to a wide range of language phenomena. In pursuing this goal, we have frequently relied on corpus analyses, intensive field work, and other means of empirical verification. Crossing the boundaries of particular languages or language families has led additional support to the findings emerging from our research. --From the preface 104 Computational Linguistics, Volume 14, Number 4, December 1988 Book Renews Briefly Noted NATURAL LANGUAGE AND VOICE PROCESSING: AN ASSESSMENT OF TECHNOLOGY AND APPLICATIONS Terri C. Walker and Richard K. Miller SEAI Technical Publications, Madison, GA; 1987, 260 pp. ISBN 0-89671-083-1, $285.00 (Looseleaf binder) Why would someone pay hundreds of dollars for a report on an assessment of natural language technology when they could buy a text book and a subscription to"]},{"title":"Computational Linguistics","paragraphs":["for a fraction of the price? Such a report could well be worth the price to someone charged with making corporate policy on technology if it accurately digests information about current technology, gives credible projections of what will happen soon, and points the reader to useful sources, people, and organizations. The report by Tim Johnson (1985) did this well (see Jones's (1986) review in these pages).","Unfortunately, this new report, by Terri Walker and Richard Miller of SEAI Technical Publications, does not measure up to this standard. It catalogues, but it does little to digest or explain. For example, under the heading \"Research groups to watch\", there are 84 pages listing projects by 65 groups. But the listings seem to be mostly public-relations blurbs, many of them rather out of date, written by the groups themselves; there is no attempt to edit or interpret. Likewise, the chapter \"Commercial NL software\" seems to be directly copied from advertising or p.r. material. The technical introduction to NLU is also unoriginal; it is reprinted directly from a publicdomain NASA technical memorandum by William Gevarter, first published in April 1983.","But the main problems with the report seem to stem from the author-editors' apparently limited understanding of the field they profess to be assessing. The clearest demonstration of this (apart from their general failure to provide much interpretation of, or editorial judgment upon, the material they have collected) is their treatment of Weizenbaum's famous Eliza program. In the chapter entitled \"Early research in NLP\", Eliza is described as being \"first written as a joke and then taken seriously .... When it became clear that people liked Eliza and were often more honest talking to a computer than they would be talking to a human therapist, the stage was set for the development of more therapeutic software.\" Unfortunately, it seems that Walker and Miller are among those who take Eliza seriously, for it turns up again in the chapter on commercial NLP systems; a commercial version of the program (presumably sold as a game) is given equal billing with Artificial Intelligence Corporation's INTELLECT, Symantec's Q&A, and the Carnegie Group's Language Craft. (Incidentally, Dyer's BORIS program (1983), perhaps the most sophisticated story understander yet constructed, is also listed as an example of \"early research in NLP\".)","The chapter called \"Market analysis and forecast\" is all of two pages long. It briefly quotes other sources (including Johnson) to say that the market will go up.","It should also be mentioned that for $285, one expects the material to be presented with care. However, the proofreading seems to have mostly been by a spelling-checking program rather than a human; names are sometimes misspelled, but regular words of English never are, although on occasion they are anagrams or other variants of the words the writer clearly intended. A human copyeditor does, however, seem to have attended to the section on ill-formed input, where the examples of syntactically ill-formed text (taken from work by Charniak) have all been \"corrected\", thereby making the discussion rather weird. --G.H. REFERENCES","Dyer, Michael G. 1983 In-depth understanding: A computer model of integrated processing for narrative comprehension. The MIT Press, Cambridge, MA.","Johnson, Tim 1985 Natural language computing: The commercial applications. Ovum, London, England.","Jones, Mark 1986 Review of Johnson (1985). Computational linguistics 12(4); 308. LINGUISTICS AS A SCIENCE Victor H. Yngve (University of Chicago, IL) Indiana University Press, Bloomington, IN, 1986, viii+ 120 PP. ISBN 0-253-33439-X, $25.00 (hb); ISBN 0-253-20402-X, $9.50 (sb) In this book it is argued that linguistics (as studied through grammar) is not a scientific discipline. Basically, Yngve's argument focuses on the claim that linguistics is the scientific study of language. He argues that language, the object of study in linguistics, has no corresponding real-world object and hence cannot be tested against physical reality--a necessary criterion, Yngve claims, for a scientific study. On the basis of this, he concludes that \"language is not something that can be studied scientifically in any strict sense; and it is not an abstraction or model or theory of anything, for there is nothing for it to be an abstraction, model or theory of\" (p. 16). Any claim that linguistics is the scientific study of language cannot, Yngve maintains, be coherent.","To avoid this inherent contradiction, Yngve proposes the study of \"human linguistics\"mnamely, a scientific study of people and how they communicate. The theory is set out in terms of properties that are observable in the communicative behaviour of particular individuals. Properties can change through time and can have a causal effect on other properties. Yngve outlines a preliminary notational system for expressing these properties and \"observationally based\" general laws governing these properties. This book does not provide a fully fleshed-out alternative to current linguistic theories. The point at issue here is not the details of the theory, but rather the foundations and basic assumptions of the theory. After reevaluating the theoretical underpinnings of linguistic theory, Yngve outlines a new basis that he argues will avoid some of the fundamental problems in linguistic theory.","Throughout the book, Yngve's arguments are interesting, certainly controversial, and intent on shaking up the \"business as usual\" acceptance of assumptions on the authority of tradition that is found in many linguistic theories. Whether this new \"scientific\" foundation for linguistics will prove as promising as Yngve suggests remains to be seen. The task Yngve sets for himself is certainly a formidable one, and there remain a large number of questions and issues that will need to be addressed before \"scientific\" linguistics can be viewed as a viable working alternative to the mainstream linguistic theories."]},{"title":"--Barbara Brunson, Department of Linguistics, University of Toronto Computational Linguistics, Volume 14, Number 4, December 1988 105","paragraphs":[]}]}