{"sections":[{"title":"American Journal of Computational Linguistics Volume 6, Number 3-4 July-December 1980","paragraphs":["Computing Story Trees .................... 135 Alfred Correira Characterizing Indirect Speech Acts ............... 150 Gretchen P. Brown A Plan-Based Analysis of Indirect Speech Acts ........... 167 C. Raymond Perrault and James F. Allen"]},{"title":"Book Reviews NETL (S.E. Fahlman) .............. - . . .","paragraphs":["..... 183 Reviewed by Stuart C. Shapiro Understanding Spoken Language (D.E. Walker, Editor) ........ 186 Reviewed by Madeleine Bates The Process of Question Answering (W.G. Lehnert) ......... 187 Reviewed by Lance A. Miller and by John M. Morris"]},{"title":"The FINITE STRING Newsletter","paragraphs":["Minutes of the 1980 ACL Meeting ................ 190 Annual business meeting was held in Philadelphia Call for Papers - 1981 ACL Meeting ................ 192 Meeting will be held at Stanford, June 29 to July 1 Announcements ....................... 193 OAC, NCC, ICCH, Text Manip., IJCAI, ACM, Semantics, etc. Abstracts of Current Literature ................. 196 Fifty-five abstracts of recent publications ACL Membership List ..................... 211 About 900 entries, arranged geographically"]},{"title":"Microfiche (AJCL Mr. 86) Published Quarterly by the Association for Computational Linguistics AJCL","paragraphs":["The American Journal of Computational Linguistics (ISSN 0362-613X) is published quarterly by the Association for Computational Linguistics. Editor George E, Heidorn IBM Thomas J. Watson Research Center P.O. Box 218 Yorktown Heights, New York 10598 (914) 945-2776 Associate Editor Michael C. McCord Department of Computer Science 915 Patterson Office Tower University of Kentucky Lexington, Kentucky 40506 (606) 258-5126 Managing Editor Donald E. Walker SRI International 333 Ravenswood Avenue Menlo Park, California 94025 (415) 859-3071 Editorial Board 1978-1980: Wallace L. Chafe, University of California at Berkeley Raymond Reiter, University of British Columbia Charles J. Rieger III, University of Maryland Yorick Wilks, University of Essex 1979-1981 : Bozena Henisz-Thompson, Calif. Inst. of Technology Hubert Lehmann, IBM Heidelberg Scientific Center Wendy G. Lehnert, Yale University Robert F. Simmons, University of Texas at Austin David L. Waltz, University of Illinois 1980-1982: Ronald J. Brachman, Bolt Beranek and Newman Jerry R. Hobbs, SRI International Remko Scha, Philips Research Laboratories Stuart C. Shapiro, State Univ. of N. Y. at Buffalo Candace L. Sidner, Bolt Beranek and Newman Editorial Assistant Andrea R. McKenzie IBM Thomas J. Watson Research Center Submissions of all types of material should be made to the Editor at the address given above. Additional information concerning submissions is given on the inside back cover. Copyright © 1980 by the Association for Computational Linguistics. The code and copyright notice appearing at the bottom of the first page of an article in this journal indicate the copyright owner's consent that copies of the article may be made for personal or internal use, or for the personal or internal use of specific clients. This consent is given on condition that the copier pay for copying beyond that permitted by Sections 107 and 108 of the U.S. Copyright Law. The per-copy fee for each article appears after the dollar sign and is to be paid through the Copyright Clearance Center, Inc. This consent does not apply to other kinds of copying, such as copying for general distribution, for advertising and promotional purposes, for creating new collective works, and for resale. Such permission requests and other permission inquiries should be addressed to the Managing Editor at the address given above."]},{"title":"ACL","paragraphs":["The Association for Computational Linguistics is an international professional society with membership open to any person or institution whose professional goals relate to computational linguistics. President Bonnie Lynn Webber (1980) Computer and Information Science Moore School of Electrical Engineering University of Pennsylvania Philadelphia, Pennsylvania 19104 (215) 243-7745 Vice President Norman K. Sondheimer (1980) Sperry Univac P,O. Box 500 Blue Bell, Pennsylvania 19424 (215) 542-5896 Secretary-Treasurer Donald E. Walker SRI International 333 Ravenswood Avenue Menlo Park, California 94025 (415) 859-3071 Executive Committee Bertram C. Bruce (1978-80) Bolt Beranek and Newman, Inc. Stanley J. Rosenschein (1979-81) The RAND Corporation Wendy G. Lehnert (1980-82) Yale University Nominating Committee Paul G. Chapin (1978-80) National Science Foundation Jonathan Allen (1979-81) Massachusetts Institute of Technology Ronald M. Kaplan (1980-82) Xerox PaiD A/to Research Center Affiliations: The ACL is a constituent member of the American. Federation of Information Processing Societies, and is also associated with the International Committee on Computational Linguistics. Subscriptions to the AJCL are available only through membership in the ACL. Each subscription includes both hard-copy and microfiche versions of the Journal. Annual membership dues are $15 for individuals and $30 for institutions. Joint memberships for couples are available for $20, but provide only one subscription. Postage: The AJCL is normally mailed bulk-rate. First class mailing is available in North America for an additional annual charge of $6. Air-printed mailing is available overseas for an additional annual charge of $12. Back issues of the AJCL for the years 1974-1978 are available on microfiche only. The rates per annual volume are $15 for individuals and $30 for institutions. First class mailing of back issues is available in North America for an additional charge of $3 per volume. Air-printed mailing of back issues is available overseas for an additional charge of $6 per volume. There were no issues in 1979. Payments for dues or back issues should be sent to the ACL Secretary-Treasurer at the address given above. Checks should be made out to the Association for Computational Linguistics (or to ACL) and should be payable in U.S. dollars. There is an additional $1 charge for bank processing costs for checks that are not drawn on U.S. banks. Address changes should be sent to the ACL Secretary-Treasurer at the address given above."]},{"title":"A Note from the Editor:","paragraphs":["This issue of the"]},{"title":"American Journal of Computational Linguistics (AJCL)","paragraphs":["is a combined issue for the third and fourth quarters of 1980. It is Number 3-4, dated July-December.","This issue contains 94 pages, which is almost double the 50 pages per quarterly issue stated in my original proposal for producing this hard-copy"]},{"title":"Journal.","paragraphs":["[Details may be found in the news article on page 49 of the January-March 1980 issue of"]},{"title":"AJCL","paragraphs":["and in the proposal reproduced on page 68 in the Microfiche Supplement of that issue.] The first two quarterly issues of 1980 consisted of 62 and 64 hard-copy pages, respectively. These three issues together, then, provide a total of 220 hard-copy pages for the year (plus 9 pages of Microfiche Supplement). Included in these issues are nine rather long technical articles (130 pages), ten book reviews (16 pages), 133 abstracts (34 pages), a complete membership list (18 pages), and announcements, minutes and programs of meetings, etc. (22 pages).","In July, Michael McCord of the University of Kentucky became Associate Editor, and in October, Andrea McKenzie of IBM Research became Editorial Assistant. Both of these people contributed substantially to the publication of this issue.","In 1981 we intend to publish four smaller issues on a more nearly regular schedule. We currently have about 25 articles being refereed, about 25 books to be reviewed, and a backlog of about 25 abstracts to publish. But, we would like to have still more. We continue to welcome submissions of technical articles and other material (especially abstracts of technical reports and announcements of meetings) according to the guidelines given on the inside back cover."]},{"title":"George E. Heidorn, Editor","paragraphs":[]}]}