{"sections":[{"title":"Books Received","paragraphs":["Books listed below that are marked with a t have been selected for review in a future issue, and reviewers have been assigned to each. Reviewers are still sought for books marked with an *.","Authors and publishers who wish their books to be considered for review in"]},{"title":"Computational Linguistics","paragraphs":["should send a copy to the book review editor, Graeme Hirst, Department of Computer Science, University of Toronto, Toronto, Canada M5S 1A4. All books received will be listed, but not all can be reviewed. Technical reports and unpublished dissertations will not be listed or reviewed.","Readers who wish to review books for the journal should contact the book review editor, outlining their qualifications, by writing to the address above or sending electronic mail to gh@cs.toronto.edu. Obviously, we cannot promise the availability of books in anyone's exact area of interest. Phonological Acquisition and Phonological Theory John Archibald (editor) (University of Calgary) Hillsdale, NJ: Lawrence Erlbaum Associates, 1995, xxi + 204 pp. Hardbound, ISBN 0-8058-1352-7, $49.95 tMachine Translation: An Introductory Guide D. Arnold, L. Balkan, R. Lee Humphreys, S. Meijer, and L. Sadler (University of Essex) Oxford: NCC Blackwell, 1994, viii + 240 pp. Hardbound, ISBN 1-85554-246-3, $49.95, £40.00 Paperbound, ISBN 1-85554-217-X, $19.95, £18.99 tComputational Phonology: A Constraint-Based Approach Steven Bird (University of Edinburgh) Cambridge University Press (Studies in Natural Language Processing, edited by Branimir K. Boguraev), 1995, xv + 203 pp. Hardbound, ISBN 0-521-47496-5, $44.95 Language, Gesture, and Space Karen Emmorey and Judy Reilly (editors) (The Salk Institute for Biological Studies and San Diego State University) Hillsdale, NJ: Lawrence Erlbaum Associates, 1995, x + 454 pp. Hardbound, ISBN 0-8058-1378-0, $79.95 Neural Networks in Computer Intelligence LiMin Fu (University of Florida, Gainesville) New York: McGraw-Hill (McGraw-Hill Series in Computer Science), 1994, xix + 460 pp and 5.25-inch diskette. Hardbound, ISBN 0-07-911817-8, cdn$89.95 The Acquisition of the Lexicon Lila Gleitman and Barbara Landau (editors) (University of Pennsylvania and University of California, Irvine) [Originally published as a special issue of"]},{"title":"Lingua: International review of general linguistics,","paragraphs":["92(1-4), April 1994] Cambridge, MA: The MIT Press, 1994, vi + 492 pp. Paperbound, ISBN 0-262-57109-9, $39.95 Constructions: A Construction Grammar Approach to Argument Structure Adele E. Goldberg (University of California, San Diego) Chicago: The University of Chicago Press (Cognitive Theory of Language and Culture Series, edited by Gilles Fauconnier, George Lakoff, and Eve Sweetser), 1995, xi + 265 pp. Hardbound, ISBN 0-226-30085-4, $75.00, £59.95. Paperbound, ISBN 0-226-30086-2, $24.95, £19.95 Hybrid Problems, Hybrid Solutions John Hallam (editor) (University of Edinburgh) Amsterdam: IOS Press and Tokyo: Ohmsha (Frontiers in Artificial Intelligence and Applications, Volume 27), 1995, vii + 239 pp. Paperbound, ISBN 90-5199-216-5 (IOS) and 4-274-90040-1-C3000 (Ohmsha), no price listed Design and Production of Multimedia and Simulation-Based Learning Material Ton de Jong and Luigi Sarti (editors) (University of Twente and Istituto per le Tecnologie Didattiche, Consiglio Nazionale delle Ricerche) Dordrecht: Kluwer Academic Publishers, 1994, xvi + 253 pp. Hardbound, ISBN 0-7923-3020, $84.00, £56.00, Dr 140.00 The Antisymmetry of Syntax Richard S. Kayne (City University of New York Graduate Center) Cambridge, MA: The MIT Press (Linguistic Inquiry Monographs, edited by Samuel Jay Keyser, Number 25), 1994, xvii + 195 pp. Hardbound, ISBN 0-262-11194-2, $35.95. Paperbound, ISBN 0-262-61107-4, $17.95 432 Books Received tConstraint Grammar: A Language-Independent System for Parsing Unrestricted Text Fred Karlsson, Atro Voutilainen, Juha Heikkil/i, and Arto Anttila (editors) (University of Helsinki) Berlin: Mouton de Gruyter (Natural Language Processing 4, edited by Annely Rothkegel), 1995, viii + 430 pp. Hardbound, ISBN 3-11-014179-5, DM 268 Unaccusativity: At the Syntax-Lexical Semantics Interface Beth Levin and Malka Rappaport Hovav (Northwestern University and Bar Ilan University) Cambridge, MA: The MIT Press (Linguistic Inquiry Monographs, edited by Samuel Jay Keyser, Number 26), 1995, xiii + 336 pp. Hardbound, ISBN 0-262-12185-9, $39.95. Paperbound, ISBN 0-262-62094-4, $19.95 ,Japanese Sentence Processing Reiko Mazuka and Noriko Nagai (editors) (Duke University) Hillsdale, NJ: Lawrence Erlbaum Associates, 1995, x + 360 pp. Hardbound, ISBN 0-8058-1125-7, $89.95 Existential Cognition: Computational Minds in the World Ron McClamrock (State University of New York at Albany) Chicago: The University of Chicago Press, 1995, ix + 205 pp. Hardbound, ISBN 0-226-55641-7, $28.95, £23.25 tComputational Lexical Semantics Patrick Saint-Dizier and Evelyne Viegas (editors) (Institut de Recherche en Informatique de Toulouse, CNRS, and Brandeis University) Cambridge University Press (Studies in Natural Language Processing, edited by Branimir K. Boguraev), 1995, ix + 447 pp. Hardbound, ISBN 0-521-44410-1, $69.95 tSpoken Natural Language Dialog Systems: A Practical Approach Ronnie W. Smith and D. Richard Hipp (East Carolina University and Hipp, Wyrick and Company, Inc.) New York: Oxford University Press, 1994, xiv + 299 pp. Hardbound, ISBN 0-19-509187-6, $49.95 Conceptual Structures: Current Practices [Proceedings of the Second International Conference on Conceptual Structures, University of Maryland, August 1994] William M. Tepfenhart, Judith P. Dick, and John E Sowa (editors) (AT&T Bell Laboratories, University of Maryland, and State University of New York at Binghamton) Berlin: Springer-Verlag (Lecture Notes in Artificial Intelligence, edited by J. G. Carbonell and J. Siekmann, Volume 835), 1994, viii + 331 pp. Paperbound, ISBN 3-540-58328-9 and 0-387-58328-9, no price listed Beyond Names for Things: Young Children's Acquisition of Verbs Michael Tomasello and William E. Merriman (editors) (Emory University and Kent State University) Hillsdale, NJ: Lawrence Erlbaum Associates, 1995, vi + 421 pp. Hardbound, ISBN 0-8058-1250-4, $79.95 Grammatical and Conceptual Individuation in the Lexicon Piek Vossen (University of Amsterdam) Amsterdam: IFOTT (Studies in Language Use 15), 1995, xix + 439 pp. Paperbound, ISBN 90-74698-15-8, no price listed Discourse Comprehension: Essays in Honor of Walter Kintsch Charles A. Weaver III, Suzanne Mannes, and Charles R. Fletcher (editors) (Baylor University, University of Delaware, and University of Minnesota) Hillsdale, NJ: Lawrence Erlbaum Associates, 1995, xii + 426 pp. Hardbound, ISBN 0-8058-1534-1, $79.95. Paperbound, ISBN 0-8058-1535-X, $39.95 433"]}]}