{"sections":[{"title":"Who’s Missing in the Group? Argument Sharing in Core Cosubordinate Construction in Filipino *  ","paragraphs":["Aquiles P. Bazar III"," De La Salle University","2401 Taft Avenue, Manila, Philippines 1004 bazara@dlsu.edu.ph"," Abstract. This paper examines the relationship between two important arguments in core cosubordinate construction in Filipino: namely, controller found in the matrix core and the missing argument (controllee) in the linked core using the framework Role and Reference Grammar of Van Valin (2005). This paper has proved that there is really an argument sharing between two cores and each core plays a crucial role in the syntactic development of cosubordinate clauses. The first core assigns the juncture levels and nexus of relations of the units involved, whereas the second core determines the syntactic structure of the clause. The researcher also found out that regardless of the number of arguments found in the linked core, the matrix core argument which is also the controller is the same with the missing actor argument from the linked core. Keywords: cosubordination, arguments, control construction, nexus, core.  "]},{"title":"1. Introduction","paragraphs":["Cosubordination is defined as one type of nexus relation in which units of equivalent sizes are strung together in a coordinate-like relation with no marker of syntactic dependency is found between and among units (Olson, 1981). These units share some grammatical categories such as arguments, aspects, negation, and other operators. Argument sharing is a process in which one argument in the matrix core is the same with another argument found from the linked core. However, the problem lies in the syntactic representation of a cosubordinate clause in which there is a missing argument from the linked core. That seems to be a violation of a theory known as Completeness Constraint as it states that all arguments overtly expressed in the semantic representation of a clause must be realised in the syntax (Van Valin, 2005). Before we move on to our discussion of argument sharing, let us first clarify some terms in the literature. Control construction, as one theory applied in analysing argument sharing in cosubordination, refers to how the controller of the missing NP in the linked core is to be determined (Van Valin, 2005). In an ergative language like Filipino, subject control and object control cannot be used, for these terms will lead to some problems. Thus, non-subject actor, controller, or syntactic pivot will be used to avoid confusion. In sentence (1), the single argument of the matrix core realised by ko ‘I’ is in ergative case functioning as a non-subject actor in the construction and cannot be called either subject or object controller. The semantic role of the argument ko ‘I’ is assigned by its nucleus pinilit ‘tried’, a patient verb. The argument in the linked core, on the other hand, is missing but although this argument is not overtly expressed in the syntax, it is clear that this argument is the same with the syntactic argument in the matrix core making this non-subject actor the controller by default.  * Copyright 2008 - Aquiles P. Bazar III 123 22nd Pacific Asia Conference on Language, Information and Computation, pages 123–130 (1) Pinilit kong matulog ng maaga -in-pilit ko-ng ma-tulog ng ma-aga PAT.PERF-try.hard 1SG.ERG-LNK ACT-sleep OBL ADJ-early ‘I tried (hard) to sleep early.’  Even in transitive clauses like in sentence (2), the overt syntactic argument in the matrix core realised by Nanay ‘mother’ is the same with the missing argument from the linked core. It is apparent, however, that the matrix argument Nanay ‘mother’ is in ergative case and therefore functioning as a non-subject actor.  (2) Iniisip ni Nanay na lutuin ang pansit -in-iisip ni=Nanay na luto-in ang=pansit PAT-IMPRF-think ERG=mother LNK cook-PAT ABS=noodle ‘Mother is thinking of cooking the noodles’  On the other hand, in sentence (3), the second argument of the matrix core realised by ako ‘I’ is the controller of the construction, for the missing argument of the linked core is the same with this argument. Though this NP takes the role of a patient because of the semantic role of its verb, the term object control cannot be used, for this argument is in absolutive case and therefore functioning as a subject. The first argument, on the other hand, realised by niya ‘he or she’ is an ergative pronoun but not functioning as the subject of the construction.  (3) Pinilit niya akong matulog ng maaga -in-pilit niya ako-ng ma-tulog ng maga PAT.PERF-force 3SG.ERG 1SG.ABS ACT-sleep OBL ADJ-early ‘He/she forced me to sleep early.’"]},{"title":"2. Discussion","paragraphs":["In nonsubordinate constructions, the semantic role of the overt syntactic argument is determined by the nucleus of the first core which also assigns the nexus relations and levels of junctures of the units involved, whereas the nucleus of the second core assigns the syntactic structure of the sentence (attransitive, single argument, transitive) and the grammatical relations of its arguments. This is the case of a number of verbs in Filipino like pinilit ‘tried or forced’ that may be interpreted either as cosubordinate or coordinate depending on their function and meaning. In sentence (4), the verb pinilit ‘tried’ requires a single argument in the matrix core which is and must be the same with the missing argument from the linked core. This construction is interpreted as cosubordinate.  (4) Pinilit niyang buksan ang pinto in-pilit niya-ng bukas-an ang pinto PAT.PERF-try 3SG.ERG-LNK open-PAT ABS door ‘He/She tried to open the door.’  If the verb pinilit ‘forced’, on the other hand, functions as a causative verb requiring two arguments in the matrix core, one as an actor and the other as undergoer, the controller will therefore be realised by the undergoer and not by the actor. This is interpreted as coordinate construction, as shown in  Pinilit niya akong ligawan ang kapatid niya -in-pilit niya ako-ng ligaw-an ang kapatid niya PAT.PERF-try 3SG.ERG 1SG.ABS-LNK court-PAT ABS sister 3SG.GEN ‘He/she forced me to court his/her sister.’ 124 Having one overt syntactic argument in the matrix core is not an indication that this construction is cosubordinate. An example of this is the coordinate verb gusto ‘want’ in sentence (5) in which the matrix argument may be the same with the missing argument from the linked core, as shown in  (5) Gusto ni Lisang basahin ang libro gusto ni=Lisa-ng basa-in ang=libro want ERG=Lisa-LNK read-PAT ABS=book ‘Lisa wants to read the book’  However, the same overt syntactic argument in the matrix core may not also be the same with the actor argument in the linked core, as shown in  (6) Gusto ni Lisang basahin ko ang libro gusto ni=Lisa-ng basa-in=ko ang=libro want ERG=Lisa-LNK read-PAT=1SG.ERG ABS=book ‘Lisa wants me to read the book’  Levels of junctures are also assigned by the nucleus of the matrix core. This will be realised when the matrix core takes a ma-prefix. Sentence (7) is in core juncture, for the two cores have their own sets of arguments. The non-subject actor Marta is an argument of the matrix verb sumubok ‘tried’ as it assigns its semantic role, whereas the absolutive NP puto ‘rice cake’ is an argument of the linked verb iluto ‘cook’. The missing argument from the linked core, however, is the same with the matrix core Marta.  (7) Sumubok si Martang iluto ang puto -um-subok si=Marta-ng i-luto ang=puto ACT.PERF-try ABS=Marta-LNK PAT-cook ABS=rice.cake ‘Marta tried to cook (the) rice cake’  On the other hand, when the two verbs occur closer to each other, the argument Marta is no longer an overt sole argument of the verb sumubok ‘tried’ as seen in its morphosyntactic coding. In sentence (8), the role of the argument Marta which is in ergative case is no longer assigned by the actor verb sumubok ‘tried’ nor by the patient verb iluto ‘cook’ but these verbs merge as one requiring one set of arguments. There seems to be no argument sharing in this construction anymore because this sentence is in nuclear juncture.  (8) Sumubok iluto ni Marta ang puto -um-subok i-luto ni=Marta ang=puto ACT.PERF-try PAT-cook ERG-Marta ABS=rice.cake ‘Marta tried to cook (the) rice cake’  One important thing to realise about single-argument cosubordinate constructions is that if there is any argument in the clause, it belongs to the matrix core and not to the linked core. Sentence (9) shows control construction where the single overt syntactic argument realised by Pedro found in the matrix core is the controller by default; that is, the missing core argument of the actor verb tumakas ‘escape’ is also the same with this core argument.  (9) Tinagka ni Pedrong tumakas -in-tangka ni=Pedro-ng –um-takas PAT.PERF-try ERG=Pedro-LNK ACT-escape ‘Pedro tried to escape’ 125  Even when the two nuclei or verbs occur closer to each other, the presence of one overt syntactic argument will suffice the need for the second one, as shown in  (10) Sinubok umawit ni Lisa -in-subok um-awit ni=Lisa PAT.PERF-try ACT-sing ERG=Lisa ‘Lisa tried to sing’  What is interesting about a single-argument clause is when the two verbs take two different focus affixes to assign two different morphosyntactic codes to one syntactic argument. In the sentence below, the verb binalak ‘try’ takes the semantic role of a patient or undergoer, whereas the verb sumayaw ‘dance’ takes the role of an actor. The pronominal niya ‘he or she’ which is in ergative case agrees with the verb binalak and not with the verb sumayaw which is apparent for this pronominal clitic is an argument of this matrix core, as shown in  (11) Binalak niyang sumayaw sa plasa -in-balak niya-ng –um-sayaw sa plasa PAT.PERF-plan 3SG.ABS-LNK ACT.AGT-dance DAT park ‘She was planning to dance in the park.’  In sentence (12), the first core pinilit ‘try’ takes the role of a patient, whereas the linked core realised by kumalma ‘to be calm’ takes the role of an actor. It is apparent, however, that the missing argument from the linked core is the same with the overt core argument in the matrix core whose semantic role is determined by its nucleus.  (12) Pinilit niyang kumalma -in-pilit=niyang um-kalma PAT.PERF-try=3SG.ERG-LNK ACT-calm ‘She tried to (be) calm’  Even when the two verbs occur closer to each, it is clear that the semantic role of the overt matrix argument is determined by the matrix core or verb and not of the verb closer to it. In sentence (13), the role of the non-subject actor Lisa is determined by the matrix verb binalak ‘planned’ although the actor verb sumayaw ‘dance’ occurs closer to this argument.  (13) Binalak sumayaw ni Lisa sa plasa. -in-balak –um-sayaw ni Lisa sa plasa PAT.PERF-plan ACT.AGT-dance ERG Lisa DAT park ‘Lisa was planning to dance in the park.’  When the verb of the matrix core takes the role of an actor, it is still apparent that the morphosyntactic coding of the overt syntactic argument is determined by the semantic role of the matrix core, as shown in ","(14) Nagbabalak siyang sumayaw nag-babalak=siya-ng –um-sayaw ACT-IMPRF-plan=3SG.ABS-LNK ACT-dance ‘He/she is planning to dance.’  This is different from another structure very much closer to sentence (13) as discussed above. When the matrix verb takes the role of an actor and the second verb occurs closer to it, it is quite 126 apparent that the argument Lisa is no longer determined by any single verb as seen in sentence (15), but the two verbs nagbabalak ‘planning’ and isayaw ‘dance with’ merge as one forming one semantically complex verb having one set of arguments. Having said that, this construction is interpreted as a serial verb construction in nuclear lever.  (15) Nagbabalak isayaw ni Lisa ang bata nag-ba-balak i-sayaw ni=Lisa ang=bata ACT-IMPRF-plan PAT-dance ERG=Lisa ABS=child ‘Lisa planned to dance with the child’  Looking into the missing syntactic argument of the linked core, on the other hand, will make us realise that although this argument is the same with the overt syntactic argument of the matrix core, it takes a different morphosyntactic coding assigned by its nucleus. As shown in sentence (16), the matrix core binalak ‘planned’ assigns a patient role to its syntactic argument niya ‘he or she’. However, although the argument of the linked core ‘sumayaw ‘dance’ does not appear in the clause syntactically, we can conclude that the semantic role of this argument will be absolutive as assigned by its verb.  (16) Binalak niyang sumayaw (siya) -in-balak niya-ng –um-sayaw siya PAT.PERF-plan 3SG.ERG-LNK ACT-dance 3SG.ABS  If the argument of a single-argument cosubordinate clause takes the role of an actor in order to agree with the second verb, the result is ungrammaticality of the sentence, as shown in, ","(17) *Binalak sumayaw si Lisa sa plasa. -in-balak –um-sayaw si Lisa sa plasa PAT.PERF-plan ACT.AGT-dance ABS Lisa DAT park  Cosubordinate construction at core level becomes more complicated in transitive clauses. In a single-argument clause, the controller is the overt syntactic argument of the matrix core by default and there is no other overt syntactic core argument in the linked core. In transitive clauses, on the other hand, the controller in the construction is always realised by a non-subject actor as stated in La Polla and Van Valin (1997). Theory of obligatory control","1. Causative and jussive verbs have undergoer control.","2. All other (M-)transitive verbs have actor control."," In transitive cosubordinate clauses, the relationship between the controller in the matrix core and the controllee (missing argument) in the linked core, which are both actor arguments, is not affected by the number of arguments present in the linked core and the semantic role taken by the linked verb. Core chain illustrates control construction in which the overt core argument in the matrix core realised by Leo is the same with the missing argument from the linked core despite the presence of an absolutive argument pinto ‘door’.  (18) Pinilit ni Leong buksan ang pinto -in-pilit ni=Leo-ng bukas-an ang=pinto PAT.PERF-try ERG=Leo-LNK open-PAT ABS=door ‘Leo tried to open the door.’  Even if the linked core takes different semantic roles- e.g. instrumental, benefactive, locative-the missing argument from the linked core will still be the same with the non-subject argument 127 in the matrix core. In sentence (19), although the linked core realised by the verb ipansayaw ‘dance with’ takes the role of an instrument, the missing argument is still the same with the non-subject actor in the matrix core. The presence of an absolutive argument sapatos ‘shoes’ does not affect the argument sharing of the two cores making the nonsubject actor niya ‘he or she’ the controller.  (19) Pinilit niyang ipansayaw ang bagong sapatos -in-pilit=niya-ng ipan-sayaw ang=bagong=sapatos PAT.PERF-try=3SG.ERG-LNK INSTRM-dance ABS=new=shoe ‘He/she tried to dance with her new shoes’  In sentence (20), the linked core realised by the benefactive verb iluto ‘cook’ requires to have an absolutive argument realised by Ana. This does not affect the argument sharing of the two cores because the missing argument from the linked core is still the non-subject actor found in the matrix core. The semantic argument that is absent syntactically from the linked is recoverable from the matrix core.  (20) Sinubok ni Nanay na iluto si Ana ng paborito niyang meryenda -in-subok ni=Nanay na i-luto si Ana ng paborito niya-ng meryenda PAT.PERF-try ERG=Nanay LNK BEN-cook ABS Ana OBL favourite 3SG.GEN snack ‘Mother tried to cook Ana her favourite snacks’  Even if the two nuclei or verbs occur closer to each, the controller in the matrix core is the same with the missing argument from the linked core which is also an actor argument. The presence of other arguments even the absolutive arguments does not affect the controller-controllee relationship of the two cores, as seen in  (21) Pinilit kunin ni Alex ang pera kay May -in-pilit kuha-in ni=Alex ang=pera kay=May PAT.PERF-try get-PAT ERG=Alex ABS=money LOC=May ‘alex tried to get the money from May’  (22) Sinubok ipansayaw ng babae ang bago niyang sapatos -in-subok ipan-sayaw ng=babae ang=bago=niya-ng=sapatos PAT.PERF-try INSTRM-dance ERG=woman ABS=new=3SG.GEN-LNK=shoe ‘The woman tried to dance with her new shoes’  (23) Iniisip niyang pagkulahan ng damit ang bubong namin -in-i-isip=niya-ng pag-...-an-kula ng=damit ang=bubong=namin PAT-IMPRF-think=3SG.ERG-LNK LOC-bleach OBL=clothes","ABS=roof=2PL.GEN.EXCL ‘He/she is thinking to bleach their clothes on our roof’  When a matrix verb takes a ma-prefix, the argument sharing of the two cores is not affected, because although the matrix core argument is in absolutive case, the missing argument from the linked core is still the same with it, as seen in (24) Nagplano si Tatay na ibenta ang bukid nag-plano si Tatay na i-benta ang bukid ACT.PERF-plan ABS Father LNK PAT-sell ABS farm ‘Father planned to sell the farm’   128 (25) Nagsimula na si Lisang ipansayaw ang bagong damit nag-simula=na si=Lisa-ng ipan-sayaw ang=bagong=damit ACT.PERF-start=already ABS=Lisa INSTRM-dance ABS=new=dress ‘Lisa has started to dance with her new dress’  In sentence (26), there seems to have two absolutive arguments: one realised by the matrix core argument Rodel and the other realised by the linked core argument libro ‘book’. Although the linked verb sulatin ‘write’ has an absolutive verb, the fact remains that its missing argument is the same with the absolutive argument found in the matrix core and therefore making argument sharing possible in this construction.  (26) Sumubok si Rodel na sulatin ang libro -um-subok si Rodel na sulat-in ang libro ACT.PERF-try ABS Rodel LNK write-PAT ABS book ‘Rodel tried to write the book’  In the theory of obligatory control, it state that causative verbs should have undergoer control, whereas all other (M-)transitive verbs actor control. The verb nahirapan ‘have a hard time’ seems to be a violation of this theory. In control construction, only causative verbs must have undergoer control. But in sentence (27), the argument estudyante ‘student’ in absolutive case seems to be the controller. However, looking into structure will tell us that the verb nahirapan ‘having a hard time’ is uses a ma-prefix which predicts that its sole argument estudyante ‘student’ should be in absolutive case. And since nahirapan ‘have a hard time’ functions as an actor verb in the construction requiring only a single actor argument in the matrix core, its single argument will be its controller by default, and therefore not violating the theory.  (27) Nahirapan ang mga estudyanteng sagutin ang test na-...-an ang mga estudyante-ng sagot-in ang test ACT.PERF-have.a.hard.time ABS PL student-LNK answer-PAT ABS test ‘The students had a hard time answering the test.’ "]},{"title":"3. Conclusion ","paragraphs":["1. Non-subject actor is a better term to use in identifying the controller in cosubordinate construction. The use of subject control and object will lead the readers to confusion, because the language is interpreted to exhibit an ergative system.","2. In nonsubordinate constructions, the semantic role of the overt syntactic argument is determined by the nucleus of the first core which also assigns the nexus relations and levels of junctures of the units involved, whereas the nucleus of the second core assigns the syntactic structure of the sentence (attransitive, single argument, transitive) and the grammatical relations of its arguments.","3. In a single-argument clause, the overt syntactic argument found in the matrix core is the controller by default.","4. One important thing to realise about single-argument cosubordinate constructions is that if there is any argument overtly expressed in the clause, it belongs to the matrix core and not to the linked core.","5. In transitive cosubordinate clauses, the relationship between the controller in the matrix core and the controllee (missing argument) in the linked core, which are both actor arguments, is not affected by the number of arguments present in the linked core and the semantic role taken by the linked verb.  129 ABBREVIATIONS 1 first person 2 second person 3 third person ABS absolutive ADJM adjective marker ACT actor AGT agent ARG argument DAT dative ERG ergative EXPRSV Expressive particle BEN benefactive GEN genitive HON honorific particle INCMP Incompatibility particle IMPRF imperfective INSTRM instrumental LNK linker LOC locative MOD modality NEG negative marker OBL oblique PAT patient PERF perfective PL plural PRED predicate S subject SG singular SVC serial verb construction TAM tense/ aspect/ mood "]},{"title":"References","paragraphs":["Aikhenvald, Alexandra Y. 2003. 'Some Thoughts on Serial Verbs’, Paper presented at","International Workshop on Serial Verb Constructions, La Trobe University","Collins, Chris. 1997. Argument sharing in serial verb constructions. Linguistic Inquiry 28, 3:","461-497.","Hansell, M. 1993. Serial verbs and complement constructions in Mandarin: a clause linkage","analysis. In Van Valin, ed., 197-233.","Kroeger, Paul. 2004. Analyzing syntax: a lexical-functional approach. London. Cambridge","University Press.","Olson, M.L. 1981. Barai clause junctures: toward a functional theory of inter-clausal relations.","PhD dissertation, Australian National University.","Schachter, P & Otanes F. (1972). Tagalog reference grammar. Berkeley: University of","California Press.","Van Valin, R. & La Polla R. (1997). Syntax. London: Cambridge University Press.","Van Valin, R.(2005). Introduction to role and reference grammar. London: Cambridge","University Press.","Whitman, John and Waltraud Paul. 2005. Reanalysis and conservancy of structure in Chinese.","In: Batllori, M. et al. (eds.). Grammaticalization and parametric change. Oxford: OUP;","pp. 82 - 94. 130"]}]}