{"sections":[{"title":"A Morphooic Anyzer for Fiipino Verbs *","paragraphs":["Robert R. Roxasa and Gersam T. Mulaa"," a University of the Philippines Visayas – Cebu College","Cebu City, Philippines rrroxas@upv.edu.ph and gersammula@gmail.com Abstract. This paper presents a morphological analyzer that accepts Filipino verbs conjugated in different forms as inputs and analyzes them to produce the affixes used, the infinitive forms, and the tenses of the original input verbs. A prototype system was implemented and was fed with a file containing 1,050 Filipino verbs conjugated in various tenses using different types of affixes. The preliminary result showed that the accuracy rate was high in three expected outputs, i.e., tenses, infinitive forms, and affixes used. Keywords: morphological analyzer, context-driven machine translation system, Filipino verbs"]},{"title":"1.Introduction","paragraphs":["Filipino i lngug who vrb conjugtion r vry complx bcu it u diffrnt ffix (prfix, infix, nd uffix) combintion nd vn dupliction of yllbl or word. Whn looking up word in Filipino dictionry, on nd to know th infinitiv form of th vrb to b bl to find it. Thi i difficult tk for omon who i not fmilir with th wy Filipino vrb r conjugtd into ny of th thr tn: Pngngdn (Pt), Pngklukuyn (Prnt), nd Pnghinhrp (Futur). Th thr r commonly known tody Apktong Prpktibo, Apktong Imprpktibo, nd Apktong Kontmpltibo, rpctivly (Dizon, 2006). Bcu of th complxity of th lngug, utomtd morphologicl nlyzr will b difficult to contruct. So rrch hould b focud on how to cptur ll poibl form o tht mchin trnltion ytm cn produc ccurt trnltion. On pproch i to u lxicon tht tor th contxt-word tht hlp dtrmin th pproprit quivlnt word() in th trgt lngug. Th lxicon mut u th infinitiv form of th vrb to fcilitt th look up of vrb nd u hdword for non-vrb. So with thi kind of lxicon in mind, morphologicl nlyzr tht rturn th infinitiv form of vrb, it tn, nd it ffix() ud i ncry."]},{"title":"2.Review of Reted Works","paragraphs":["Whn omon ttmpt to crt ny mchin trnltion ytm for nturl lngug, it i not poibl to do wy with morphologicl nlyzr. On r of focu for morphologicl nlyzr i th nlyi of vrb. Vrb r uully conjugtd ccording to tn, numbr, voic, nd mod whil noun nd djctiv r uully dclind ccording to pron, numbr, c, nd dgr. Som lngug hv impl form of vrb inflction or conjugtion whil othr lngug hv complx form of inflction. Jpn w originlly thought to hv impl vrb inflction, thu it w not th cntrl ubjct on Nturl Lngug Procing * Copyright 2008 by Robrt R. Rox nd Grm T. Mul 467 22nd Pacific Asia Conference on Language, Information and Computation, pages 467–473 (NLP). But in rcnt pt, it hd bcom n importnt ubjct (Himitu nd Nitt, 1994). For othr lngug, vrb r lo givn much ttntion in rrch. Th lngug includ Chin (Kim, t. l, 2002), Jpn (Nkmur, 2007), nd Korn (Hong, t. l., 2004; Jun, 2007) to nm fw. For lngug tht hv complx wy of dding ffix nd dupliction of yllbl or word, n xcllnt morphologicl nlyzr i highly ncry. Filipino or Tglog i on th mot complx lngug in th world. So vrl rrch hv bn conductd in th r of morphologicl nlyi for th Filipino lngug. On i th TgSA (Tglog Stmmr Algorithm), which tckl on th xtrction of th tm of ny Tglog word (Bonu, 2003). Anothr morphologicl nlyzr, clld TgMA (Tglog Morphologicl Anlyzr), i dvotd to xtrcting th root word both for conctntiv nd non-conctntiv formtion (Fort, 2002). A ytm clld T2CMT (Tglog-to-Cbuno Mchin Trnltion) w dvlopd (Ft, 2004) tht ud TgMA nd TgSA for it morphologicl nlyzr. Evn bfor th TgMA nd TgSA, thr w lrdy morphologicl nlyzr tht w crtd nd ud in prototyp ytm tht upportd Englih-Filipino nd Filipino-Englih mchin trnltion ytm (Rox, 1998). TgMA (Fort, 2002) produc thr morphologicl tructur (morphm, CV, nd yllbiction) to rprnt n input vrb. To do thi, it nd to cn th ntir word in vrl tg. It trt by igning th ymbol “C” for cononnt or “V” for vowl to th morphm tructur chrctr by chrctr to gt th CV tructur. Thn it cn th CV tructur chrctr by chrctr to ign om cod (0-2) to “C” or “V” to gt th yllbifiction tructur. Thn th input rprnttion i fd to th GEN function in ordr to produc cndidt t. It thn cn th input tring yllbl by yllbl until th lt yllbl i ncountrd. Thn th rult i ubjctd to th EVAL function, whr th output of th GEN function i chckd gint th two lxicon (root nd ffix) nd ubjctd to om contrint to b bl to gt th right root of th vrb. Although TgMA w bl to morphologiclly nlyz 96% of th mpl vrb ccurtly (Fort, 2002), th proc of nlyzing n input vrb i quit long nd tdiou. It only output th root, tn, nd it ffix for prticulr input vrb. It do not produc th infinitiv or dictionry form of th originl input vrb. Th infinitiv form i lo uful bcu tht i wht on uully u to lookup word in dictionry. In fct, T2CMT (Ft, 2004) tht ud TgMA wrongly trnltd th Tglog word “nmty” (to di) to “pingi” (by mn of or through) in Cbuno, whn in fct, th Cbuno trnltion hould b “nmty” lo. If morphologicl nlyzr produc th infinitiv form, th trnltion would b corrct. Our propod ytm u th morphologicl nlyzr dvlopd in (Rox, 1989), which i bing xtndd to covr mor poibl vrb conjugtion. If you p “nmty” to our morphologicl nlyzr, it will giv th infinitiv form “mmty” nd tn i pt or prpktibo. If you conult dictionry, you will find tht it Englih trnltion i “to di,” which i th intndd mning. Thrfor, w bliv tht thr i till nd to dvlop morphologicl nlyzr tht u th infinitiv form whn chcking word in dictionry."]},{"title":"3.The Proposed Morphooic Anyzer","paragraphs":["Th morphologicl nlyzr prntd in thi ppr i jut on of th componnt of our Contxt-drivn Filipino-Englih Mchin Trnltion Sytm. Th nlyzr will b ud during th trnltion proc. Thi morphologicl nlyzr xmin ny Filipino vrb in vriou poibl inflction nd produc th ffix(), th infinitiv form, nd th tn of th input vrb. It hould b pointd out tht w hv no dt to how mny infinitiv form r thr in Tglog. W don’t know of ny tudy trying to count th infinitiv form of crtin lngug. Nturl lngug r volving. So it i difficult to ctgoriclly y tht prticulr lngug h tht numbr of infinitiv form. Th lxicon will hv to b updtd from tim to tim th lngug volv. 468 In thi rrch, w don't bothr o much on gnrting th root word bcu th ntri in our lxicon will contin th infinitiv or dictionry form of th vrb nd will b ccd uing tht form. W do, howvr, rcogniz th vlu of gtting th root of word, bing don in TgSA nd TgMA, but xtrcting th root of th word i mor uful in Informtion Rtrivl Sytm (IRS) thn in mchin trnltion ytm. W lo undrtnd tht th root of word i ud in om ytm to gt th right mntic of compound word in ordr to com up with bttr trnltion. Thi i not ncry in our propod Contxt-drivn Filipino-Englih Mchin Trnltion Sytm, of which th morphologicl nlyzr bing prntd hr i jut ubytm. W choo th right Englih quivlnt of Filipino word by chcking th nighboring word in ntnc nd vn in prgrph. Th nighboring word rv contxt of th word bing trnltd. So our lxicon mut b diffrnt on thn th uul dictionry. Th ffix r importnt bcu thy hlp in dtrmining th tructur of th ntnc, th mning of th ntir ntnc, tc. Th ubjct of th ntnc wll th objct will b ily rcognizd onc th ffix h bn dtrmind lrdy. For xmpl, if th ffix ud in th min vrb i “UM,” th ubjct of th ntnc trt with th word “ng,” “i” for pronl ubjct, or u th nomintiv c of pronoun. Th objct trt with th word “ng,” “ni” for pronl objct, or u th objctiv c of pronoun. Thi will b vry hlpful in th trnltion itlf. A for th tn of th vrb tht will b output by th nlyzr, it i lo vry uful for th trnltion proc. Fiure 1: Th flow of th morphologicl nlyzr’ ctiviti. reur no yes no existent non-existent irreur yes Error Mnipute the irreur verb","Check if verb is irreur First time? Input Verb Output the infinitive form, its ffix(es), nd its tense Form the","infinitive form of the verb Check Lexicon","Option exhusted? 469"]},{"title":"4.Extrctin Affixes, Infinitive Forms, nd Tenses","paragraphs":["In gtting th infinitiv form, th tn, nd ffix() of Filipino vrb, it firt conult th lxicon if th word i thr. If not, it chck whthr or not ll poibl option wr xhutd, in which c, it rport n rror. If thr r till option, it chck whthr or not it i th firt tim to proc th vrb. If it i, it h to chck whthr or not th vrb i irrgulr. If it i, it prform om mnipultion nd prpr for th formtion of th poibl infinitiv form of th vrb. If th vrb i rgulr, th nlyzr immditly tri to form th poibl infinitiv form. Figur 1 how th flow of ction to tk th input vrb i bing nlyzd.","Tense = past /* default tense, will be changed depending on","the input */","If (starting with a double vowel)","Tense = future","Replace 1st","vowel with “um” /* iinom -> uminom (inf.) */","Else if (duplicated 1st","two chars)","Tense = future","Replace 2nd","and 3rd","chars with “um”/* susulat -> sumulat (inf.)*/","Else if (1st char = 'd' & 3rd","char = 'r') and (2nd","char = 4th","char)","Tense = future","Replace 2nd","and 3rd","chars with “um” /* darating -> dumating (inf.) */","Else if (duplicated 1st","3 letters) and (1st","two chars = “ng”)","Replace 3rd","to 5th","chars with “um” /* ngingiti -> ngumiti (inf.) */","Else if (1st two chars) = “um”","If (3rd char <> 4th","char) /* do nothing, uminom = uminom (inf.) */","If (3rd char = 4th","char)","Tense = present","Remove the 3rd","char /* umiinom -> uminom (inf.) */","Else if (2nd & 3rd","char) = “um”","If (1st & 4th","chars) <> (5th","and 6th","chars)","/* do nothing, kumain = kumain (inf.) */","If (1st","& 4th","chars) = (5th","and 6th","chars)","Tense = present","Remove 5th","& 6th","chars /* kumakain -> kumain (inf.) */","If (1st","char = “d” & 5th","char = “r”) and (4th","char = 6th","char)","Tense = present","Remove 5th","& 6th","chars /* dumarating -> dumating (inf.) */","Else if (3rd & 4th","chars = “um”)","If (1st","two chars & 5th","char) <> (6th","to 8th","chars)","/* do nothing, ngumiti = ngumiti (inf.)*/","If (1st","2 chars & 5th","char) = (6th","to 8th","chars)","Tense = present","Remove 6th","to 8th","chars /* ngumingiti -> ngumiti (inf.) */ Fiure 2: Th pudo-cod for nlyzing “UM–” vrb. 470 Th nlyzr prform crtin numbr of p until it find th corrct infinitiv form of th input vrb. If ll option hv bn trid but till th gnrtd infinitiv i not found in th lxicon, it rport n rror. For ch p, it tri to gnrt th infinitiv form of th input vrb. If th gnrtd infinitiv form do not xit in th lxicon, it i poibl tht th option ud w not th corrct on. So it tri nothr option. Evntully, it will gnrt th corrct infinitiv form. Thn it rport th infinitiv form, th tn, nd th ffix() ud. Filipino vrb u on or mor ffix. So it i poibl tht mor thn 1 ffix i rportd.","Tense = past /* default tense, will be changed depending on","the input */","If (1st","two chars = “in”)","If (last syllable contains “o”)","Change “o” to “u”","If (3rd char <> 4th","char)","Move “in” to the end /* inalis -> alisin (inf.) */","If (3rd char = 4th","char)","Tense = present","Remove 1st","3 chars and suffix “in” /* inaalis -> alisin (inf.) */","Else if (2nd","& 3rd","chars = “in”)","If (last syllable contains “o”)","Change “o” to “u”","If (1st & 4th","chars) <> (5th","& 6th","chars)","Remove 2nd","& 3rd","chars & suffix “in” /* sinulat ->","sulatin (inf.) */","If (1st & 4th","chars) = (5th","and 6th","chars)","Tense = present","Remove 1st","4 chars & suffix “in” /* sinusulat -> sulatin (inf.) */","If(1st char = 5th","char) & (4th","char <> 6th","char) &","(4th char = 7th","char)","Tense = present","Remove 1st","4 chars & suffix “in” /* tinatrabaho ->","trabahuhin (inf.) */","Else if (last syllable ends with “in”)","Tense = future","If (1st 2 chars) = (3rd","& 4th","char)","Remove 1st","two chars /* susulatin -> sulatin (inf.) */","If (starting with a double vowel)","Remove 1st","char /* aalisin -> alisin (inf.) */","If(1st char = 3rd","char) & (2nd","char <> 4th","char) &","(2nd char = 5th","char)","Remove 1st","two chars /* tatrabahuhin -> trabahuhin (inf.) */ Fiure 3: Th pudo-cod for nlyzing “-IN” vrb. It hould b pointd out tht mtching poibl infinitiv form, drivd from th input vrb, with on in th lxicon, i no bttr thn gnrting th infinitiv form from th drivd root word nd th ffix ud in th input vrb. Thi i tru if th corrct root word i ud. But if th ytm h to gu for th corrct root word, it i poibl tht n incorrct root i ud, which will mk th trnltion fil. Thi i th c of th word “nmty” rportd in T2CMT (Ft, 2004). For irrgulr vrb, thy nd to b modifid bit o tht whn thy r pd to th ction tht gnrt th infinitiv form, it will gnrt th corrct infinitiv form. For intnc, in 471 gtting th infinitiv form of n irrgulr vrb “binibii,” th nlyzr conult Tbl 1 firt. Sinc th vrb “binibii” xit in th tbl, it chng th lt “i” to “h.” Th vrb “binibii” bcom “binibih.” Thi word i ud to gt th infinitiv form “bihin.” Figur 1 how th flow of ctiviti th nlyzr xcut. Tbe 1: Exmpl of om irrgulr vrb nd thir corrponding ction to tk.","Irreur Verb Action binili, binibili Chne the st “i” to “h” dinl, dindl Chne the st “” to “h” kinin, kinkin Remove the st “i” inunod, inuunod Remove the “o” dinkip, dindkip nilunod, nilulunod tinrbho, tintrbho bin, binb Remove the st “i” Chne “od” to “ur” Chne “o” to “uh” Add “h”","bingo, binbgo Chne “u” nd dd “h”","ginw, gingw Remove the st “” Thr r vrl vrb form or ctgori in Filipino: UM-, MAG-, -IN, MA-, MAGKA-, PAKI-, I-, -AN, MAGPA-, nd PA-IN (Apillr, 1981). Ech ctgory h corrponding lgorithm, which rv n option mntiond bov. Whn uing th nlyzr, th vrb i pd to ny of th lgorithm for dtrmining th ctgory tht th vrb blong nd until th right infinitiv form i found. Thi i don bcu om word mingly blong to crtin ctgory but ctully blong to diffrnt ctgory. If th gnrtd infinitiv form i not in th lxicon, mot likly it blong to diffrnt ctgory. Whn ll option hv bn trid nd th gnrtd infinitiv form do not xit, thn it mut b miplld word or n invlid Filipino vrb. Figur 2 how th pudo-cod for nlyzing “UM-” vrb (ctiv) nd Figur 3 how th pudo-cod for nlyzing “-IN” vrb (piv)."]},{"title":"5.Resuts nd Discussion","paragraphs":["Th prototyp morphologicl nlyzr w fd with 1,050 Filipino vrb conjugtd in thr diffrnt tn tkn from (Apillr, 1981) plu om vrb ud in vrydy lif. Th vrb blong to th UM-, -IN, -AN, I-, MA-, nd MAG- ctgori only. Tbl 2 how th prliminry rult. In dtrmining th tn of th input vrb, it rturnd 98.76% ccurtly, which i vry promiing. Th 1.14% rror for dtrmining th tn w primry cud by th irrgulr vrb form. Th undtrmind tn, which i 0.095%, w cud by th wrong input word. Tbe 2: Th rult of th initil tting. Expectedutput Crrect Errr Undetermined Tn 1,037 (98.76%) 12 (1.14%) 1 (0.095%) Infinitiv form 1,007 (95.90%) 42 (4.00%) 1 (0.095%) Affix 1,032 (98.28%) 17 (1.62%) 1 (0.095%) In dtrmining th infinitiv form of th vrb, it got 95.90% ccurcy rt, which i lo good initil rult. Th rror rt w 4.00% nd lmot ll of thm rultd from irrgulr vrb form. Out of th 42 rror, 14 r cud by filing to chng th “o” to “u” of th 472 pnultimt yllbl nd 4 r cud by filing to inrt “h” on th lt yllbl for vowlnding root without glottl top. Th undtrmind infinitiv form, which i 0.095%, i purly cud by th wrong input word. A for dtrmining th ffix of th vrb, th ccurcy rt i only 98.28%. Th rror rt of 1.62% w cud prtly by irrgulr vrb formtion but lrg prt of it w cud by th prnc of “in” or “ni” tht r lwy found ny “I-” vrb in thir pt nd prnt tn. Th undtrmind ffix w lo cud by th wrong input word. Mny of th rror will b grtly rducd by rfining th lgorithm. It hould b notd tht th tting w jut ingl-p bcu th lxicon i not yt fully functionl. W cn xpct highr ccurcy rt thn wht i prntd hr, if th multi-p pproch will b ud bcu om rror bov will b olvd by th multi-p pproch."]},{"title":"6.Concusion nd Future Works","paragraphs":["A morphologicl nlyzr tht nlyz th Filipino vrb nd produc thir ffix, infinitiv form, nd tn h bn prntd. Th prototyp w ttd with 1,050 vrb (rgulr nd irrgulr) conjugtd in thr diffrnt tn nd th initil rult howd high ccurcy rt for dtrmining th tn, th infinitiv form, nd th ffix ud. Th highr ccurcy rt i xpctd to vn improv onc th lxicon i in plc nd th multi-p pproch i lrdy implmntd. Futur work includ th implmnttion of th lxicon tht mploy n innovtiv wy of gtting th pproprit mning to upport contxt-drivn mchin trnltion ytm. W will lo dd othr vrb form tht wr not yt includd in th currnt prototyp nd prform furthr tt whn ll diffrnt form hv bn tkn into conidrtion. W will lo incr th dt t in th nxt tting."]},{"title":"References","paragraphs":["Apillr, P.S. 1981. Basic Taao. 8th","rvid d. Mnil: M&L Licudin Entrpri.","Bonu, D.E.J. 2003. Stemmin orithm for Taao Words. Mtr' Thi, D L Sll Univrity.","Dizon, C.B. 2006. Bukod 2 – Batayan kat sa Fiipino. Quzon City: Book Crft Publihing","Co., Inc.","Ft, J.G. 2004. T2CMT: Taao-to-Cebuano Machine Transation. Mtr' Thi, D L","Sll Univrity.","Fort, F.C.L. 2002. Constraint-based Morphooica nayzer for Concatenative and Nonconcatenative Morphooy of Taao Verbs. Mtr' Thi, D L Sll Univrity.","Himitu, T. nd Y. Nitt. 1994. An Efficint Trtmnt of Jpn Vrb Inflction for Morphologicl Anlyi. Proceedins of the 15th","Internationa Conference on Computationa Linuistics, pp. 194-200.","Hong, M., Y.-K. Kim, S.-K. Prk, nd Y.-J. L. 2004. Smi-Automtic Contruction of Korn-Chin Vrb Pttrn Bd on Trnltion Equivlncy. Proceedins of the Workshop on Mutiinua Linuistic Resource, pp. 87-92.","Jun, J.S. 2007. Co-Evnt Confltion for Compound Vrb in Korn. Proceedins of the 21st Pacific sia Conference on Lanuaes, Information, and Computation, pp. 202-209.","Kim, D., Z. Cui, J. Li, nd J.-H L. 2002. A Knowldg Bd Approch to Idntifiction of Sril Vrb Contruction in Chin-to-Korn Mchin Trnltion Sytm. Proceedins of the First SIGHN Workshop on Chinese Lanuae Processin.","Nkmur, H. 2007. Two Typ of Complx Prdict Formtion: Jpn Piv nd Potntil Vrb. Proceedins of the Pacific sia Conference on Lanuaes, Information, and Computation, pp. 340-348.","Rox, R.R. 1998. Prototype Machine Transator of Simpe Enish or Fiipino Sentences Usin Interinua. Mtr' Thi, Univrity of th Philippin t Lo Bño. 473"]}]}