{"sections":[{"title":"Scalar Implicatures: Pragmatic Inferences or Grammar? * ","paragraphs":["Chungmin Lee"," Dept of Linguistics Seoul National University Seoul 151-742, Korea clee@snu.ac.kr  Abstract. This talk discusses the nature of different kinds of scales and controversies over issues on the generation of scalar implicatures, particularly those in complex sentences involving disjunction and another operator in its scope, and so on. The pragmatic position based on Gricean reasoning in opposition to the grammatical position based on alternative semantics and LF syntax employing the exhaustivity (Exh) operator will be examined. The context-driven view and the default view largely still within the pragmatic position will also be discussed. In doing so, the talk will offer my position that scalar implicatures are motivated by Gricean pragmatic reasoning but that they are deeply and crucially rooted in the grammatical devices of Contrastive Topic (CT), overt or covert. CT requires PA (pero/aber) conjunction, i.e. ‘concessive But’ and that’s why scalar implicatures begin with but and its equivalents cross-linguistically. The CT operator rather than the exhaustivity (Exh) operator must be represented to be related to the previous discourse and the forward concessive conjunction. Keywords: scalar implicatures, Gricean reasoning, grammatical system, disjunction, context-driven vs. default, exhaustivity, Contrastive Topic, PA (concessive) conjunction. "]},{"title":"1. Introduction ","paragraphs":["*I express my gratitude to the audiences of LELNS 2006 in Tokyo and of ICKL 2006 in Guadalajara. I also deeply thank Rachel Roxas for her gracious patience in editing the Proceed’s with her team.  Copyright 2008 by Chungmin Lee 30 22nd Pacific Asia Conference on Language, Information and Computation, pages 30–45"]},{"title":"1. 1 Scales","paragraphs":["There are many gradable adjectives, to which different degrees of the state of an entity can be assigned such as clean and dirty (Kennedy 1999). The adjective clean shows the degree of no dirt on its subject entity (maximum standard, total-universal), as an <e, d> type function, taking an entity and returning a degree. Its antonym dirty, on the other hand, starts from the minimum degree of having dirt on an entity (minimum standard, partial-existential) (Yoon , Lee ). These adjectives, but not un-gradable adjectives such as alive and dead, can easily be modified by degree adverbs such as a little and very, and intensifiers such as terribly and awfully. But the so-called un-gradable adjectives can also generate scalar implicatures, as will be discussed later. Gradable adjectives typically constitute scales with degree modification on the same single adjectives (intra-lexically). In contrast, scales in connection with scalar implicatures may be different in the sense that they are typically formed by a set of scalar alternatives of different lexical items, mostly predicates. Horn’s (1972) scalar predicates are related by entailment asymmetrically – a stronger one entails the weaker one in the scale but not vice versa. A sentence containing a scalar value or item can generate a scalar implicature when the scalar value is replaced with a stronger item from the scale, resulting in an alternative sentence. All such stronger alternative sentences are implicated to be negated (or false):  (1) ScalAlt(φ) = {φ’: φ contains scalar value s and φ’ is formed from φ by replacing only s with a value from the same Horn scale} (2) Scalar Implicatures: ∀ φ’ ∈ ScalAlt(φ) . (φ’ ⇒ φ) ~> ∼φ’  This is a standard neo-Gricean approach to scalar implicature generation mechanism with limited formally defined scalar alternatives from among all possible alternatives generated by Grice’s informativeness Maxim of Quantity. Horn scales are as follows:  (3) a. Cardinals <1, 2, 3, --- > b. Quantifiers <some, half, most, all> c. Connectives <p or q, {p, q}, p and q> (Y. Lee 1995, Sauerland 2004) d. Modals <may (possible), must (necessary)> e. Adjectives <warm, hot> f. Verbs: <believe, know>; <like, love> f. Negatives <not all, few, none>; < ---, ~3, ~2, ~1>  31 If the values of a positive scale are negated, the scale is reversed, as in (3f). Hirschberg (1985=1991) extended the range of scales from entailment scales to non-entailment scales to generate similar scalar implicatures, as follows:  (4) a. Nominals of ranking <Harrison, Lennon>, <assistant professor, associate professor>, <porridge, (steamed) rice> b. Stages of events <dating, engaged, married>  So far all the scalar items or values discussed have been semantic predicates, but I propose that propositions also be scalar values, as follows:  (5) a. Propositions < Korea will beat Togo, Japan will beat Brazil>. b. Korea will beat Togo ~> But it is not the case that Japan will beat Brazil.  Hirschberg (1985) and Matsumoto’s (1995) further available scalar implicatures in specific contexts after entailment-based computation as in the exclusivity of disjunction should also be included in my propositional scales.1"," "]},{"title":"1. 2 Issues","paragraphs":["Chierchia (2004) and some other authors recently attacked Gricean and neo-Gricean theories of scalar implicature computation, claiming that these theories based on Gricean reasoning cannot account for the scalar implicatures of certain complex sentences involving disjunction etc.. Thus they proposed grammatical (semantic or syntactic) systems for computing scalar implicatures. Russell (2006) and others, on the other hand, have defended a global, Gricean pragmatic framework, offering arguments against the critics’ challenges. What do experimental studies of processing and acquisition of scalar implicatures say? Initially Breheny et al (2006) largely supports the context-driven pragmatic approach as opposed to the default approach, which says implicatures are associated with scalar items by  1 Sauerland’s (2004) footnote 2 shows one such context: Kai had peas or broccoli is less rewarding than Kai’s cleaning up his room. Then, the utterance implicates Kai didn’t clean up his room. This implicature is context-specific or particularized, whereas Kai didn’t have both peas and broccoli is generalized. It is interesting, however, to note that the relevant evaluative expression ‘rewarding’ is still a predicate. Such evaluative predicates, saying ‘higher in what?’ in the scale, must be underlyingly scalar, mediating propositions to scales. ‘Tough and glorious’ may underlie scale (5). The even-marked utterances are also propositional in likelihood implicature (as Horn, p.c., reminded me). 32 default as generalized conversational implicatures (GCIs). The context-driven approach claims that scalar implicatures arise only if there is some contextual reason, like Grice’s particularized conversational implicatures. The default view has a long neo-Gricean tradition from Horn (1972), Gazdar (1979), and Horn 1984) to Levinson (2000) and, in a sense, the view is a precursor, with its formally-defined notion of scales, to the proposed view of grammatical (semantic or syntactic) computational systems (CS), although it is still pragmatic with its use-related communicative inferences. This talk will take up some controversies over related issues between the different positions and try to address the big question of whether scalar implicatures are pragmatic inferences or grammar. Tentatively I can say that the generation of scalar implicatures is rooted in and motivated by pragmatic inferences and the interpretation of them is at least schematically and sometimes overtly triggered by grammatical devices of language-specific morphemes or intonation. "]},{"title":"2. Debates 2.1 Disjunction Problem","paragraphs":["In (3c), the Horn scale of connectives originally had <or, and>, with p and q entailing p or q and with p or q implicating p and q. But Chierchia (2004) indicated that a global approach in general fails to treat implicatures in complex sentences including cases with disjunction and another operator in its scope (also Schwarz 2000), as in (6), and proposed a local semantic system.  (6) Kai had the broccoli or some of the peas last night. (7) (6) > Kai didn't have the∼ broccoli and some of the peas last night.  Facing this problem of disjunction with another operator like some in its scope, Sauerland (2004) offered a solution by positing a pair of disjuncts {p, q} or {L, R} in between <or, and> in the scale, making it a partially ordered set. Otherwise, (7) is the only implicature generated and cannot handle (8), which Sauerland argues, is an intuitively adequate scalar implicature generated by (6).  (8) (6) > Kai didn't have all of the peas last night. ∼  33 Sauerland bases his claim on the intuition that if I happen to know that Kai ate all the peas last night and hear (6) I would say (9):  (9) No (#Yes), he had all of the peas last night.  Sauerland also discusses scalar items in the scope of negation, a logical operator, but negation reverses scales (Horn 1972, Atlas and Levinson 1981, Lee 2000 CLS 36) and scale reversal explains some past inadequacies in treatment. The assertion Sam didn't have all of the peas implicates Sam had some of the peas via double negation. Sauerland uses the cross product of the two scales expressed in sentences for their implicatures as in (10):  (10) Kai ate peas or broccoli on Monday or Tuesday. > [Kai ate peas and broccoli on Monday or Tuesday.] ∼∼ > [Kai ate peas or broccoli on Monday and Tuesday.]∼∼ ( > [Kai ate peas and broccoli on Monday and Tuesday.])∼∼  Saueland takes the position of Soames (1982) and Horn (1972, 1989) in viewing implicatures as epistemologically modalized. What follows from Grice’s maxims of conversation is that a stronger statement ψ is uncertain (~Kψ), a weak implicature, rather than that ψ is certainly false (K~ψ). K~ψ follows from ~Kψ only if some additional knowledge (such as that Kψ"]},{"title":"∨K","paragraphs":["~ψ holds). He arrives at the strong implicatures (7) and (8) of (6), the disjunctive utterance, using the distinction between weak and strong and moving from weak to strong, also using individual disjuncts p and q in (p or q). Sauerland criticizes Chierchia about his drastic departure from Gricean reasoning for a local semantic system on the grounds of the disjunction problem (“not valid”) and other empirical facts that are “less than clear.” Chierchia heavily relies on the conventional content for his “semantics.”"]},{"title":"2.2 Global vs Local Problem","paragraphs":["Russell (2006) examines Chierchia’s (2004) arguments on the following types of apparent embedded implicatures against Gricean analysis:  (11) a. Sam believes that some of his advisors are crooks. ~> l. Sam believes that not all of his advisors are crooks. ~> g. It is not the case that Sam believes that all of his advisors are crooks. . b. Sam knows that some of his advisors are crooks. ~>Not all of his advisors are crooks.  34 Chierchia claims that hearers can make conclusions about the negation of competing utterances as a whole a la Gricean reasoning in (11a.g.) and that implicatures are added to an expression’s meaning by the compositional semantics at each type t meaning (extensionalizing). The embedded S in (11) is computed to give a strong meaning of some of his advisors are crooks and not all of his advisors are crooks for (11a.l.). Russell also argues that (11a.l.) follows (11a.g.) in every context where Sam has some belief about whether all of his advisors are crooks. Russell argues that (11b) is apparently equally felicitous whether or not all of his advisors are crooks – in fact is not needed to cancel that supposition, whereas it is needed to cancel an ordinary scalar implicature, as in (12). (13) shows a case of Contrastive Focus (CF)-marking on some and all, and a restricted meaning of some but not all for some (Carston’s explicature).  (12) a. Sam knows that some of his advisors are crooks, and (in fact) they all are. b. Some of his advisors are crooks, and #(in fact) they all are. (13) It is better to eat some of the cake than it is to eat all of it.  Russell also treats DE contexts where their operators have a reversed pattern of implicatures.  (14) If Sam eats all his vegetables, he’ll get dessert. ~> It is not the case that if Sam eats some of his vegetables, he’ll get dessert.  This effect is predicted by Gricean reasoning, as Levinson (2001) notes, while Chierchia must stipulate a special rule for this, as Russell indicates. However, this place may be a meeting point between reasoning and semantics. Russell treats intervention as well. He strongly defends Gricean pragmatics of a very general global theory, looking for a better theory of competition for a wider range of implicarures resolution. "]},{"title":"3. Grammar and Exhaustivity","paragraphs":["After Chierchia’s (2004) semantics for scalar implicatures, Fox (2005) developed his LF syntax, positing an Exhaustivity operator, which is an abstract lexical item largely equivalent to ‘only’, following the exhaustivity semantics tradition (Groenendijk and Stokhof (1984) and others, to treat scalar implicatures in syntax. "]},{"title":"4. Conjunctive Discourse Markers, Contrastive Topic, Scales and Implicatures","paragraphs":["There are two different types of contrastive or adversative sentence conjunctions and their corresponding discourse markers (DM), as in:  35 (1) Concessive (Cncssv) PA type: pero/aber, -ciman; DM: haciman, kurehciman (2) Metalinguistic negation SN type: sondern/sino ; -ka anira; DM: kukey anira.  The Concessive (Cnsccv) PA type is fundamentally correlated with Contrastive Topic (CT) in the first conjunct and the SN type with Contrastive Focus (CF) construction, as I argued elsewhere (Lee 2006). The parallel applies even when an utterance with CT has no explicit second conjunct; its scalar implicature begins with the corresponding Cnsccv PA type DM ‘But’ in (1a). I will show how CT along with the PA type DM typically generates scalar implicatures and possibly implicatures by denial of ‘generic entailment’ (Koenig and Benndorf 1998), which I claim can be scalar, on one hand, and why CF along with the SN type fails to do so, on the other. I go back to the discussion of scales extended and repeat the propositional type of scales from 1.1 (5a) as (3):  (3) propositions < [Korea will beat Togo], [Japan will beat Brazil]>.  Horn is certain about his entailment scales and Hirschberg (1991) takes up some non-entailment scales, arguing that they also show the same scale behavior. I added a scale of entire propositions (of likelihood/easiness), as in (3), and will discuss a wider range of processes scales Hirschberg does not seem to cover shortly. (3) is exemplified by (4) in Korean:  (4) na-nun [hankwuk-i Togo-rul iki-l kes-i-ra-ko]-NUN mit-nun-ta I –TOP Korea -NOM T-ACC beat-PRE COMP-COP-CT believe ‘I believe [that Korea will beat Togo]CT . => (But not that Japan will beat Brazil.)  In (4), an overt CT marker –nun is used and if it occurs the implicature of the denial of a higher value is unavoidable. A CT-marked utterance is concessively admitted. If the marker does not occur, the implicature is evoked when the context licenses it, in which case I claim CT is overt. With the above scales, the principle in (5) applies:  (5) If p is uttered with overt (or covert) CT-marking in it, it is represented as ‘CT(p).’ Then concessively (and contrastively) (with PA ‘But’) ‘not q’ is conveyed (the speaker believes so), with the CT operator being associated with a CT-marked element (focal and topical) in p. In this case, q has a relevant and comparable stronger/higher element in one and the same scale to be denied. 36 If the elements in a scale are negated, simply the scale is reversed and the same principle applies (with the effect: if not-q is uttered with CT-marking, its representation ‘CT(not-q)’ conveys concessively (and contrastively) ‘p’ (a weaker/lower positive element). (6) Yumi-ka notebook-ul sa-ci-NUN anh –ass-ta => (haciman ---) Y -NOM -ACC buy-ci-CT not-PAST-DEC ‘Yumi CT did not buy CT a notebook PC CT.’ => But (buy CT ) just browsed ones or But (a notebook PC CT) Yumi bought just an organizer or But (Yumi CT ) Mia bought one.  In (6), the CT operator can be realized at the end of V-ci and can be associated with either with the verb, the object, the predicate, or the subject, depending on which one is focal. The verb and the object can be doubly CT-marked with doubly evoked implicatures and even the subject can be CT-marked at the same time but the triple CT-marking with triple implicatures is hard to compute and is rather avoided. This talk makes the distinction between typical conversational scalar implicatures (contextual, optional) and conventional scalar implicatures. The latter, unlike in Buring (2001), are those evoked by a Contrastive Topic (CT) contour (fall-rise (L+H*LH%) B accent) intonation or CT markers –nun (Korean) or –wa (Japanese) with high tone, shi (with tone 4-Fall) (Chinese), -thi (with high tone) (Vietnamese), i.e., a linguistic device. Unlike the former, the latter cannot be cancelled without roundabout epistemic hedges. Observe:  (7) A: You have many friends, don’t you? B: ses-UN iss-e. (K) 3-CT exist-DEC ‘I have THREECT‘ => (conventionally implicates) [haciman te-nun eps-e] ‘But not more than three.’ B’: I have THREECT. ?*((In fact, four.)) (the above implicature not cancelable) B”: san-nin-WA imasu. (J) [ga san-nin yori oku-wa arimasen] 3-CL-CTexist-DEC ‘I·have·THREECT’ (8) A. manh-ci-NUN anh-e (K) oku-WA nai-desu/arimasen (J) many -CT not [but a few] A’: I don’t have \\MANY/CT friends. [but a few] (9) A. manh-ci anh-e (K) oku nai-desu/arimasen (J) many not [but a few, no] A’: I don’t have MANY friends. [but a few, no] 37 (10) A: How did she do on her exam? B: She \\PASSED/CT (L+H*LH% or Fall-Rise B Accent) =>(conventionally) [But she didn’t ace the exam.] (?*In fact, she aced the exam.)  By the distinction between (8) and (9), the dispute between Horn (2005) and Chierchia (2004) about implicatures of negative scales seems to disappear; Chierchia’s claim that they are ‘somewhat weaker and flimsier’ is one-sided, dealing with conversational ones, and lacks the notion of CT, which Horn also lacks. With CT, Horn is right but without it, Chierchia is right. Let us consider further examples of CT with PA:  (11) a. watashi-wa kanozo-ga suki-deWA aru => [ga ai-shi-te -wa inai] (J) I -TOP her-NOM like - CT be but love-do-CON-CT not ‘I LIKECT her’ => ‘But I don’t LOVECT her. b. watashi-wa kanozo-o ai-shi-te-WA inai => [ga suki-de-wa aru] (12) chim thi bay => [nung ca thi lo] (Vietnamese) (a scalar implicature required by CT) ‘BirdsCT fly’ => ‘But fishCT swim’ (from a larger fixed set of animal kinds)  Let us turn to scales of processes with apparent ‘non-entailment’:  (13): <touch, push, beat, hurt, kill> < S1, S2, S3, S4, S5> Severity of attack < 1, 2, 3, 4, 5> Sm ̄Sn for each m<n  The logical structure of all the relevant and comparable alternative predicates (processes or events) at a more “abstract” level (I owe Seligman for this kind of level via e-mail 5/2/06) is not different from that of Horn’s “entailment” scales in generating scalar implicatures. Furthermore, this kind of process scales may be far more prevalent than Horn scales in every day language, as Potts hinted (in my talk at LELNS). Let’s take S1,..., S5 to abbreviate the increasing different degrees of the severity of my attack from low to high (less severe than) like levels 1, 2, ... 5, where the severity of a mere touch is level 1 and that of killing is level 5, then Sn implies (=entails) Sm for each m<n. In other words, we get some sort of abstract level ‘entailment’ in general. The scalar implicature of the CT-marked sentence (14)  (14) I PUSHEDCT her  38 in a suitable scalarity context, is that the (overall) severity of my attack was no higher than that of the push. If the severity of a push is at level 2, say, then this would entail S2, which in turn scalarly implicates that I didn't beat, hurt or kill her, with the aid of the PA connective/DM despite the fact that none of these processes in the scale literally entails pushing. No right side predicate literally asymmetrically entails the left side predicate for that matter. In severity the prototypical maximal element is killing, which behaves like universal quantifier, e.g.,  (15) a. ???I KILLEDCT her. Cf. b. ?*ALLCT came. (Lee 2000)  If, however, a context accommodates an extended scale including decapitate/dismember, S6, then (15a) can become appropriate with the implicature of [But I didn’t decapitate her]. This way, a scale of property degree ranking (along with information strength degree entailment) evokes scalar implicatures. Because scales are contextually (pragmatically) evoked, a positive scale in one context can be reversed in another context without polarity reversal marking, e.g.,  (16) a. <cwuk/kayu ‘porridge,’ ‘gruel,’ pap/gohan ‘rice,’ ‘meal’> cwuk-UN mek-ess-e ‘I ate PORRIDGECT.’ haciman pap-un an mek-ess-e ‘But not rice.’ b. <pap, cwuk> (<gohan, kayu>) [scale of nutrition and specialty]. pap-UN mek-ess-e ‘I ate RICECT. ’ haciman cwuk-un an mek-ess-e ‘But not porridge.’  This nature of context dependence of scales does not mean at all that there is no principle of scalarity we can rely on. It is a matter of choice between different gradable properties or dimensions in different contexts. In the ordinary scale of (16a), cwuk ‘porridge’ is weaker than pap ‘rice,’ in the dimension of meal status, generating a scalar implicature, unlike (16b), where the scale is reversed because of the new salient contrast in the context/world, which Hirschberg would see as a particularized conversational implicature (PCI), trying to unite these implicatures with Levinson’s (2000) lexicon-based generalized conversational implicatures (GCI) in her broader theory. Levinson maintains a general theory of GCI, arguing that all the mutual scale knowledge is based on the lexicons speakers carry on their backs from context to context. But I further claim that overt CT-marked scale implicatures are conventional; CT-marking involves linguistic devices of CT morphemes and CT intonations. For some uses of common nouns, however, there may be no scalehood of property/dimensionality as such. Those nouns may denote a list of non-scalar entities. But if they are once CT-marked, they can be said to generate quantity-based scalar implicatures; the total list of items constitute a sum and a CT-marked item is less than the sum and if that item is asserted the sum minus the item is denied to be conveyed 39 as a scalar implicature (Lee 1999). The CT-marked item’s prior potential Topic is the sum. The item is typically a part/kind of the sum denotation but it may be one item of the sum of apparently arbitrarily grouped objects in a special context, e.g., <monster, monster+beauty>.1 "]},{"title":"5. Contrastive Topic vs Only-like Exhaustivity Operator","paragraphs":["Groenendijk and Stokhof (1984) see the denotation of a question as a proposition which expresses the true (quality) and complete (quantity) answer, which is typically interpreted exhaustively, to that question in the same given world. They believe the answer Mary to the question Who came generally implies no one else came and stipulate a semantic exhaustivity operator that relates the answer to the abstract underlying the question. The exhaustivity operator is assumed to have the semantic effect of the word only, defined as Exh(A, P) = {w: w ∈ A and there is no w’ ∈ A such that w’<pw and w and w’ give the same denotation to all predicates distinct from P}. (17A), then, would mean ‘Mia and Sue came and no one else came.’ But other non-exhaustive (19) and wondering (18) interpretations are possible for the same question-answer in addition to an exhaustive interpretation (17). Consider the following dialogues:  (17) Q: Who came? A: Mia and Sue. Q’: Why didn’t Joe come? (18) Q: Who came? A: Mia and Sue. Q’: But no one else?/Did anyone else come? (19) Q: Who came? A: Mia and Sue. Q’: And who else? (modified from Sevi 2005)  The hearer has the option. But if the fragment answer has the CT contour (L+H*LH%) (e.g. in a situation where everyone is expected to come), a scalar implicature such as ‘but not Joe and Mary’ (from the contextually evoked scale <Mia&Sue, Mia&Sue&Joe&Mary>) is required and the response to the answer in (19) and ‘Did anyone else come?’ in (18) are odd. In Korean a fragment reply ending with the CT –nun is impossible (e.g. Mia-hako Sue-nun ‘Mia-and Sue-CT’) in all contexts including a post-verbal sentence final position (Lee 2001), although in English a CT intonation freely occurs S-finally and with fragments. If, however, an answer is taken to have a semantic exhaustivity operator with the meaning of only, as in most adoptions of the operator (Zeevat ms, Sevi 2005, Spector 2003, Fox 2006), the denial of the entire alternatives except the prejacent of the only clause or the one in the utterance is already at least entailed or asserted (and the prejacent is not asserted – ‘assertorically inert,’ of which the status is controversial over whether it is presupposed or conventionally implicated or what not (Horn 2002)). If that is the case, there is no room for scalar implicatures to arise of the same propositional content that has been already asserted or entailed. Consequently, the following conjunctions/discourses with PA type conjunction/DM are not acceptable: 40  (20) a. ?*Only Mia and Sue came but Joe and Mary didn’t come. b. ?*I only bought three books but not more than that. c. ???I only bought three books. But I did not buy more than that. d. ?*na chayk sey kwon-man sa-ss-e. haciman ke isang-un an sa-ss-e I book 3 CL-only buy-PAST-DEC But that more than not bought (same as c)  Without only or –man, the sentences in (20) are perfect; the potential implicatures can be explicitly uttered. With only, the second conjuncts or utterances are redundant and but/haciman there is incoherent. The DMs But (20c) and haciman (20d), without only, are monologic but they can occur dialogically with the same intent, e.g. A: Mia hapkyekhaysse ‘Mia passed’ B: haciman swusek-un mot haysse ‘But she didn’t ace the exam’). With only, the negative alternatives are already so assertive that the concessive use of but/(ha)ciman is not applicable in the conjunction or discourse. The concessive meaning of but is not truth-conditional; but and and are identical truth-conditionally. But in a PA but conjunction/discourse, the first conjunct/utterance is concessively admitted and the second one is stronger in its argument, claim or conclusion (Lee 2001, Anscrombre and Ducrot 1977). The exact translation of (20c) is rather a negative S na chayk sey kwon pakkey an sa-ss-e ‘(Lit.) I didn’t buy beyond three books,’ which is not distinct from the second part of (20d) and cannot be followed by it. Therefore, the use of only or its equivalent exh operator for generating a scalar implicature is not well justified. As a consequence, Sevi (2005) argues that scalar implicatures are not implicatures and that they are merely entailments of exh (A, Q), where A is taken to be a complete and partial semantic answer to some question Q, which may be explicit or implicit. The effect of the stronger meaning of A is analyzed as an ambiguity – depending on the optionality of the applicability of exh (applied to (17A) but not to (18A, 19A)). His argument is based on Grice’s maxim of quality – a true answer. As long as the stronger meaning of no one/nothing else (in the given domain) is entailed, there cannot be cancellation. But sentences with only and without it behave quite differently regarding their following conjunct/utterance, as we observed above, and the difference must be accounted for. My claim is that the PA type conjunction/DM is adjusted to occur with a prior concessive conjunct or utterance for the following conjunct or utterance, which is argumentatively stronger, and that overt or covert CT is exactly concessive for coherence between CT and PA. If the second PA part is not uttered, it must be conveyed as a scalar implicature because of the CT in the prior utterance. I see this as a sort of semantic ellipsis. Although the conveyed meaning is motivated pragmatically by general inference (Levinson 2000), its working in grammar is 41 already conventional and a way of representing it via CT as an operator, as shown in (5). In other words, only or exh is too strong. If a wh-word - information focus pair occurs in a question - answer pair, it is normally recast in an accommodated question - answer pair that contains a potential Topic - CT pair. A negative answer (if not metalinguistic) is typically associated with CT (see (6)). This explains why a CT utterance generates a scalar implicature and why a scalar implicature begins with a PA but. So far, conjunction types and information structure have been studied separately.  6. Metalinguistic Negation or SN (sino/sondern) Conjunction Let’s turn to the use of SN type conjunction/DM, shown in (2), that involves metalinguistic negation (MN). Typically a clause with MN is followed by the second (elliptical) clause led by an SN connective/DM (or connected by a comma/semicolon), distinct in form in most languages except in English (but) and French (mais). The MN clause may sometimes be implicit, as in (22) but rarely the other alternative offered.  (21) a. I am not HAPPY CF (*unhappy) but ECSTATIC CF. b. na-nun hayngpokha-n kes-i ani-ra hwangholhay. I TOP happy -COMP-NOM not-CONJ ecstatic (same as (a)) (22) Q. You read part of the mystery novel already, didn’t you? A. I read the WHOLE CF novel. (Not PART CF of it.) (23) a. It’s not eSOTeric; it’s esoTERic. (due to Burton-Roburts and Carston) b. Is the correct pronunciation eSOTeric or esoTERic?  The pairs of alternatives above are known to get extra heavy stress and I claim all of them constitute Contrastive Focus (CF), which, I claim, comes from a prior alternative disjunctive question (such as (23b)), either explicit or accommodated (Lee 2003). Then, the metalinguistic or echoed (Carston 1996) alternative is refuted on ‘whatever grounds’ (Horn 1985), the target of negation being claimed to be scalar implicatures, aspects of linguistic forms, or even propositions (Horn p.c.). This is in sharp contrast with concessive admission of the first conjunct/ utterance in CT-PA. In typical MN utterances such as (21) and (22), in which the negation, if interpreted in descriptive negation, creates contradictions, therefore, the conclusive positive alternative must be scalarly upward and assertorial, showing a scalar implicature blocking effect, unlike in CT. Such blocking and garden-path effect in Horn may not be real except in written English. The informational CF frame and its correlated SN connection, including a pause, comma and semicolon (see Potts 2005 for the importance of such orthographic marks), are crosslinguistically required. The contrastiveness here is tightly restricted, typically to a pair. In 42 correction type MN utterances, on the other hand, the refuted echoed alternative and the newly presented positive alternative do not constitute a scale – they are non-scalar in the sense of objectively recognized scale discussed above. A Contrastive Focus tone (L+)H* is generally higher in pitch than a presentational focus (Selkirk 2002) and a Corrective Focus is the highest in pitch (350 mh) among neutral focus, wh-Q/A information focus, and Corrective Focus, being higher in this order (Kang 1997). The corrective (all MN has certain corrective force) alternative can also be uttered dialogically by a different speaker starting with an SN DM (then, the first speaker’s utterance must be recast for CF in accommodation by the second speaker). "]},{"title":"7. Contrastive Topic - Pero/Aber vs. Contrastive Focus – Sino/Sondern","paragraphs":["Let’s consider the following follow-up responses by B and C that look alike but differ in CT-PA and CF-SN inferences (adapted from Dascal and Katriel 1977):  (24) A: Bill Gates is an economist. B: He is not an economist, but/aber/aval/-ciman he is a businessman. C: He is not an ECONOMISTCF but/sondrn/ela/anira a BUSINESSMANCF  Dascal and Katriel adopts and tries to improve Ducrot’s (1976, later Anscrombre and Ducrot 1977) intuitive argumentative theory, based on the different conjunction types, but neither they nor he show any sign of their correlation with CT and CF and fail to give a fully adequate characterization of the constructions. In (24A&B), it is true that B’s implicit conclusion may lead to “So, let’s hear his opinion,” regarding the goal/direction/force of argumentation in the context of discussing the economic situation and trying to get a specialist’s opinion. But it starts with a covert CT, generating a scale of <businessman, economist> in the rank order of degree of knowledge of economic affairs). Although he is not an economist [concessive admission], he has certain degree of knowledge of economic affairs as a businessman, though lower than an economist. From here, the argumentative goals may vary from context to context. The utterance part led by PA may be implicit as a scalar implicature with a similar effect. In (24A&B), A’s utterance is flatly refuted without concession by MN in CF and there is no room left for further consideration. The metalinguistically negated CF alternative is correlated with and requires SN connection. “So, there is no need to hear his opinion” is C’s conclusion regarding the argumentative goal.     43 8. Further Inferences in Contrastive Topic – Pero/Aber Correlation Consider the logical contrast of contradiction involving PA in (25a) and the compatibility between the negative pair of opposite gradable adjectives in (25b):  (25) a. *Yumi-nun khu-ciman cak-e *‘Yumi is tall but/aber she is short.’ b. Yumi-nun khu-ci-to anh-ciman/ko cak-ci-to anh-e ‘Yumi is not tall but is not short either/is neither tall nor short.’  The adjective ‘short’ is a contrary of ‘tall,’ entailing ‘not tall’ and constituting a contradiction with ‘tall.’ If (25a) changes to ‘Yumi is tall (with CT marking in Korean) but (she is) not very tall,’ via Quantity-maxim it becomes an instance of CT – PA conjunction. (25b) shows that ‘not tall’ licenses an in-between range of ‘neither tall nor short,’ ‘short’ being a part located at the extreme end of ‘not tall.’ In this case, the CT –nun cannot occur on both ‘tall’ and ‘short’ in Korean. It can occur on ‘tall’ but –to ‘also’ must occur on ‘short’ because of the repeated negation. The additive –to ‘also’ can occur on both with PA but it must occur on both if the conjunction is –ko ‘and.’ Turning to a prevalent CT-PA inference like (26), it suppresses a generic entailment of ‘tall persons play the basketball well,’ which otherwise can occur as an Rinference. (27) shows that because of ‘only’ in the CT phrase, the potential implicature turns entailed or asserted. Consider:  (26) Yumi-nun khu-ki-NUN hay ~> haciman nongkwu-rul cal mot-hay ‘Yumi is tall.’ ‘But cannot play the basketball well.’ (27) i pen –man –UN yongse-ha-n-ta → taum pen –ey-nun an hay this time-only-TOP (I) forgive next time-at-TOP not (I) do "]},{"title":"9. Concluding Remarks","paragraphs":["PA and SN are respectively correlated with CT and CF, which are information structural and quantificationally domain-restricted. CT-PA and CF-SN suppress R- and Q-implicatures, respectively. "]},{"title":"Scalar implicatures are motivated by Gricean pragmatic reasoning but they are deeply and crucially rooted in the grammatical devices of Contrastive Topic (CT), overt or covert. CT requires PA (pero/aber) conjunction, i.e. ‘concessive But’ and that’s why scalar implicatures begin with but and its equivalents cross-linguistically.  ","paragraphs":["44 References Anscrombre, J.-C. and O. Ducrot. 1977. Deux mais en francais? Lingua 43. 23-40. Breheny, R., N. Katsos, J. Williams. 2006. Are Generalized Scalar Implicatures Generated by Default? Cognition 100, pp. 434 - 463. Carston, R. 1996. Metalinguistic negation and echoic use. Journal of Pragmatics 25, 309-30. Chierchia, G. 2004. Scalar Implicatures, Polarity Phenomena, and the Syntax/Pragmatics Interface. Fox, Danny 2006. Free Choice and the Theory of Scalar Implicatures. Ms, MIT. Horn, Laurence. 1989. A Natural History of Negation. Chicago University Press. Horn, Laurence. 2002. Assertoric Inertia and NPI Licensing. CLS 38, II. 55-82. Keshet, Ezra. 2006. Scalar Implicatures with Alternative Semantics, SALT, Tokyo. Koenig, J.-P. and B. Benndorf 1998 ‘Meaning and Context: German aber and sondern,’ in J.-P. Koenig (ed) Discourse and Cognition, CSLI, Stanford. Lee, Chungmin. 2001. Acquisition of Topic and Subject Markers in Korean. In Issues in East Asian Language Acquisition 41-66, M. Nakayama(ed.) KLW Series Vol. 7, Kurosio Publishers, Tokyo, Japan. Lee, Chungmin 2003 ‘Contrastive Topic and/or Contrastive Focus,’ in Bill McClure (ed.) Japanese/Korean Linguistics 12. CSLI, Stanford Lee, Chungmin 2006 ‘Contrastive (Predicate) Topic/Focus and Polarity in Discourse,’ in von Heusinger and K. Turner (eds) Where Semantics Meets Pragmatics CRiSPI, Elsevier. Potts, C. 2005. The Logic of Conventional Implicatures. Oxford Studies in Theoretical Linguistics. OUP. Russell, B. 2006. Against Grammatical Computation of Scalr Implicatures, Journal of Semantics 23. 361-381. , Sauerland, Uli 2004 ‘On Embedded Implicatures,’ Journal of Cognitive Science 5 (1). Sevi, Aldo 2005 Exhaustivity, Tel Aviv University Dissertation. Zeevat, H. 1994 ‘Applying an Exhaustifying Operator in Update Semantics.’ In H. Kamp (ed.).          45"]}]}