{"sections":[{"title":" Korean Parsing Based on the Applicative Combinatory Categorial Grammar *","paragraphs":["Juyeon Kang, Jean-Pierre Desclés LaLIC Laboratory, Paris-Sorbonne University","28, Rue Serpente, 75006, Paris, France","kjuyeon79@yahoo.fr, jean-pierre.descles@paris4.sorbonne.fr Abstract. The Applicative Combinatory Categorial Grammar (ACCG) is a new approach to Categorial Grammars by using exclusively the Combinatory Logic. This extended categorial grammar that was originally developed by J.-P. Desclés and I. Biskri, allows us to tackle the problem of the Korean language parsing in which there exist many difficulties from a computational point of view. In this paper, we handle in particular some parsing problems in Korean such as the problem of case, the free word order phenomenon, the coordination structure and the long distance scrambling in the coordination structure. We will show throughout this work some new and robust solutions for the Korean parsing in the ACCG formalism by introducing combinators such as B, C*, Φ of Combinatory Logic developed by H.-B. Curry and R. Feys. Keywords: Korean, Parsing, Categorial Grammar, Combinatory Logic, ACCG.  "]},{"title":"1. Introduction","paragraphs":["In this paper, we propose a new approach to Categorial Grammars by introducing Curry’s Combinatory Logic (Curry & Feys 1958) in order to improve the parsing of Korean texts from a computational point of view.  Since the introduction of simple Categorial Grammars, different propositions were made to improve this formalism by adopting applicative languages such as the calculus of syntactic types proposed by J. Lambek (1961), the lambda-calculus proposed by A. Church, the combinatory logic created by the mathematician H.-B. Curry (1958), some attempts by the logician W. V. O. Quine, etc. These works are based on the mechanism of the application of an operator to an operand. Combinatory logic and lambda-calculus were applied to the analysis of grammatical and lexical meaning in natural languages by S. K. Shaumyan (1987) with his model of the Universal Applicational Grammar using Curry’s combinatory logic, which extends the simple Categorial Grammars: this model is easily implementable on computational tools using functional programming languages such as CAML, HASKELL and SCHEME. In the 80’s, important extensions were given by R. Montague, M. Moortgat (1988), J. Lambek and M. Steedman (1989). Combinatory Categorial Grammar (CCG) developed by Steedman (1989, 2001) was most often quoted and studied for the analysis of Korean sentences.  There exist several studies on Korean parsing based on the Categorial Grammar formalism. For example, the Korean Combinatory Categorial Grammar (KCCG) was developed by (Cha 2001 and Cha & Lee 2002) by extending the CCG of Steedman for the Korean parsing. The KCCG, having a purely computational approach, shows the ability to handle important linguistic phenomena of the Korean such as coordination, long distance scrambling, free word   Copyright 2008 by Juyeon Kang, Jean-Pierre Desclés 215 22nd Pacific Asia Conference on Language, Information and Computation, pages 215–224  order, etc. Cho and Park (2000) tried also to improve the complexity in the coordination, and Lee and Park (2003) proposed a morphological analysis of the irregular conjugation of Korean in order to conceive a morphological parser. The studies presented above and most of the related works are based exclusively on the CCG formalism of Steedman and developed in the purpose of a computational realization. Thus they often ignore the linguistic aspect of language and cannot capture some fine points such as morphological cases in Korean.  Compared to these works based on the CCG formalism, the ACCG formalism that we develop in this paper, is not only a computational but also a linguistic approach, namely it better reflects the linguistic aspect in the Korean natural language processing. Consequently, this advantage allows us to parse the Korean language in a more explicit way and to show clearly the morpho-syntactic structure of the Korean through our calculations. Thus, the ACCG formalism is a new approach which is both linguistic and computational. This formalism allows us to scope the difficult characteristics of the Korean that we can often find during automatic processing. In particular, we are interested in the problem of cases in Korean including the phenomenon of double case. Despite of their importance in parsing texts, cases have not been well studied from a computational point of view. Once we analyze the cases in the ACCG formalism, we will use some of the results of these analyses to handle the problem of free word order structure and coordination structure. This formalism leads us to easily analyze the free word order structure by a simple application of the combinatory rules we developed. This approach allows us to handle even long distance scrambling in the coordination structure, which is one of the most difficult problems in Korean parsing and has not been completely analyzed in other works (e.g. Cha 2001)."]},{"title":"2. Applicative Combinatory Categorial Grammar","paragraphs":["The Applicative Combinatory Categorial Grammar formalism is an extension of the Combinatory Categorial Grammar developed by Steedman. This ACCG formalism was originally developed by J-P. Desclés and I. Biskri (1995, 1996) for the analysis of coordination and subordination structure in French with the tools of Combinatory Logic by introducing canonical associations between some rules and the combinators. The purpose of this work is the automatic analysis of Korean sentences in which there exist the problems of case, free word order structure and coordination structure. Firstly, the ACCG provides the possibility to go beyond the well-known limits (such as the processing of a coordination, etc.) of simple Categorial Grammars. Secondly, this formalism allows the construction of logico-grammtical representations that provide a way to building semantico-cognitive representations in the general model of Applicative and Cognitive Grammar developed by J-P. Desclés (1990, 2003) with the three following levels: 1) morpho-syntactic configurations, 2) logico-grammatical representations, 3) semantico-cognitive representations. The ACCG builds applicative representations on the second level from the concatenated expressions given on the first level.  We present here the rules3","of the ACCG, for the analysis of Korean sentences.  Table 1: ACCG’s rules.","Application rules  3 B is a composition combinator. Its β-reduction is: Bfgx→f(gx). It is joined to the functional composition rule. This combinator allows us in particular to handle the free word order structure in the Korean sentence. C* is a type raising combinator joined to the type raising rules. Its β-reduction is: C*fg→gf. This combinator transforms the operand (argument) to operator (function). It is used essentially to analyze nouns of the Korean as the operators. 216  [X/Y : u1]-[Y : u2] -----------------------> [X : (u1 u2)] [Y : u1]-[X\\Y : u2] -----------------------< [X : (u2 u1)] Type raising rules [X : u] ----------------------->T [Y/(Y\\X) : (C* u)] [X : u] -----------------------<T [Y\\(Y/X) : (C* u)] Functional composition rules [X/Y : u1]-[Y/Z : u2] -------------------------->B [X/Z : (B"," u1 u2)] [Y\\Z : u1]-[X\\Y : u2] --------------------------<B [X\\Z : (B u2 u1 )]  Consider the following analysis of a Korean sentence in the ACCG. Sumi-ga Minju-lil man-ass-da. (Sumi met Minju.) Sumi-NOM Minju-ACC meet-PS-DC.  1.[N*4",": Sumi-ga] -5","[(N*: Minju-lil] - [(S\\N*)\\N*: man-ass-da ] 2.[S/(S\\N*):(C*Sumi-ga)]-[(N*:Minju-lil]-[(S\\N*)\\N*:man-ass-da ] (>T) 3.[S/(S\\N*):(C*Sumi-ga)]-[(S\\N*)/((S\\N*)\\N*):(C*Minju-lil)]-[(S\\N*)\\N*:man-ass-da ] (>T) 4.[S/((S\\N*)\\N*): (B(C*Sumi-ga)(C*Minju-lil))]-[(S\\N*)\\N*:man-ass-da] (>B) 5. [S: ((B(C*Sumi-ga)(C*Minju-lil))(man-ass-da))] (>)\\ 6. [S: ((C*Sumi-ga)((C*Minju-lil)(man-ass-da)))] \\ (B) 7. [S: ((C*Minju-lil)(man-ass-da))Sumi-ga] \\ (C*) 8. [S: (((man-ass-da)Minju-lil)Sumi-ga)] (\\C*)  We start from the concatenated sentence with assigned syntactic types. Then, we apply consecutively the type raising rules to “Sumi-ga” and “Minju-lil” which are operands, by introducing the combinator C*. This operation allows us to transform an operand into an operator. Then, we apply the functional composition rule to form a new operator “(B(C*Sumi-ga)(C*Minju-lil))” that will be applied to the operand “man-ass-da” at step 5. We reduce (in the Combinatory Logic formalism) consecutively the combinators B and C* to build a well-formed applicative expression at step 8. This expression gives a formal interpretation in terms of predicates, arguments and cases."]},{"title":"3. ACCG and the Korean Parsing 3.1.Case","paragraphs":["The Korean is an agglutinative language in which the words are formed by the linking of affixes to a radical such as the cases (or postpositions). In the syntactic and semantic analysis of the Korean sentence, the cases determine the grammatical roles of nominal syntagms (Sung 1999, Hong 1999, Nam 2001). In this paper we study five major cases6",": -ga as nominative marker, - lil/-ul as accusative marker, -eke as dative marker, -uy as genitive marker and -eso as locative marker.  We use predefined notations to facilitate our categorial analysis. ","Xo=S X1=(S\\N*) X2=(S\\N*)\\N*","X3=((S\\N*)\\N*)\\N*   4 The N*s are qualified Nouns such as N*nom, N*acc, etc. 5 The hyphen (-) means a concatenation at the syntactic level. 6 A description of Korean cases and their categorial analyses in the ACCG are presented in detail and with more examples in the Master’s thesis of KANG (2005). 217  To the two classical basic types N(nominal) and S(sentence), we add a new basic type N* for the complete nominal syntagms.  Let us analyze the following sentence including the five major cases:  Gyosil-eso, Sumi-ga Minju-eke na-uy chaek-ul ju-aes’-da. (In the class, Sumi gave my book to Minju.) Class-LOC Sumi-NOM Minju-DAT me-GEN book-ACC give–PS-DC  1.[N:Gyosil]-[(S/S)\\N):-eso]-[N:Sumi]-[N*\\N:-ga]-[N:Minju]-[N*\\N:-eke]-[N:na]-[(N*/N*)\\N:-uy]-[N:chaek]-[N*\\N:-ul]-[X3: ju-aes’-da] 2. [S/S: -eso Gyosil]- [N:Sumi]-[N*\\N:-ga]-[N:Minju]-[N*\\N:-eke]-[N:na]-[(N*/N*)\\N:-uy]- [N:chaek]-[N*\\N:-ul]- [X3: ju-aes’-da] (<) 3. [S/S:-eso Gyosil]- [N*:-ga Sumi]- [N:Minju]-[N*\\N:-eke]-[N:na]-[(N*/N*)\\N:-uy]-[N:chaek]-[N*\\N:-ul]- [X3: ju-aes’-da] (>) 4. [S/S:-eso Gyosil]-[N*:-ga Sumi]-[N*:-eke Minju]-[N:na]-[(N*/N*)\\N:-uy]-[N:chaek]-[N*\\N:-ul]-[X3: ju-aes’-da] (>) 5. [S/S:-eso Gyosil]- [N*:-ga Sumi]- [N*:-eke Minju]- [N*/N*: -uy na]- [N:chaek]-[N*\\N:-ul]- [X3: ju-aes’-da] (>) 6. [S/S:-eso Gyosil]- [N*:-ga Sumi]- [N*:-eke Minju]- [N*/N*: -uy na]- [N*: -ul chaek]- [X3: ju-aes’-da] (>) 7. [S/S:-eso Gyosil]- [N*:-ga Sumi]- [N*:-eke Minju]- [N*/N*: -uy na]- [N*: -ul chaek]- [X3: ju-aes’-da] (>) 8. [S/S:-eso Gyosil]- [N*:-ga Sumi]- [N*: -eke Minju]- [N*: ((-uy na)-ul chaek)]- [X3: ju-aes’- da] (>) 9. [S/S:-eso Gyosil]- [S/X1: C*-ga Sumi]- [N*: -eke Minju]- [N*: ((-uy na)-ul chaek)]- [X3: ju-aes’-da] (>T) 10. [S/S:-eso Gyosil]- [S/X1: C*-ga Sumi]- [X1/X2: C*-eke Minju]- [N*: ((-uy na)-ul chaek)]- [X3: ju-aes’-da] (>T) 11. [S/S:-eso Gyosil]- [S/X1: C*-ga Sumi]- [X1/X2: C*-eke Minju]- [X2/X3: C*((-uy na)-ul chaek)]- [X3: ju-aes’-da] (>T) 12 [S/S:-eso Gyosil]- [S/X2: B((C*-ga Sumi)(C*-eke Minju))]- [X2/X3: C*((-uy na)-ul chaek)]- [X3: ju-aes’-da] (>B) 13. [S/S:-eso Gyosil]- [S/X3: (B(B((C*-ga Sumi)(C*-eke Minju)))(C*((-uy na)-ul chaek))]- [X3: ju-aes’-da] (>B) 14. [S/S:-eso Gyosil]- [S: ((B(B((C*-ga Sumi)(C*-eke Minju)))(C*((-uy na)-ul chaek))ju-aes’- da)] (>) 15. [S:(-eso Gyosil ((B(B((C*-ga Sumi)(C*-eke Minju)))(C*((-uy na)-ul chaek))ju-aes’-da))] (>) 16.[S:(-eso Gyosil ((B(C*-ga Sumi)(C*-eke Minju))((C*((-uy na)-ul chaek)))ju-aes’-da))] (B*) 17.[S:(-eso Gyosil ((C*-ga Sumi)((C*-eke Minju)((C*((-uy na)-ul chaek))ju-aes’-da)))] (B*) 18.[S:(-eso Gyosil ((C*-eke Minju)(((C*((-uy na)-ul chaek))ju-aes’-da))-ga Sumi )] (C*) 19.[S:(-eso Gyosil ((((C*((-uy na)-ul chaek))ju-aes’-da)-eke Minju)-ga Sumi )] (C*) 20.[S:(-eso Gyosil((((ju-aes’-da)((-uy na)-ul chaek))-eke Minju)-ga Sumi ))] (C*) ","We show in the above analysis that the categorical calculus of the given sentence allows us, on","one hand, to verify the correct syntactic structure of the sentence by obtaining the result “S” at","step 15, and on the other hand, to obtain an applicative expression that underlies this sentence","structure. Furthermore, this analysis allows us to deduce the syntactic types of the used cases as","follows:","","Nominative marker (S/X1 )\\N","Dative marker (X1 /X2 )\\N or (X2","/X3",")\\N","Accusative marker (X2 /X3 )\\N or (X1","/X2",")\\N","Genitive marker ((X2 /X3",")/(X2","/X3","))\\N or ((X1","/X2",")\\(X1","/X2","))\\N or ((S/X1",")/(S/X1","))\\N","Locative marker1 (X1/X1)\\N","Locative marker2 (S/S)\\N"," This means that the cases in Korean function as operators that are applied to operands such as nouns including proper nouns, common nouns, collective nouns, materials nouns, etc. The types of cases are given here as a first approximation, namely we intend to go deeper into the assignation of types to cases. Our purpose is to find some invariants of these types in order to reduce the ambiguity and the complexity in the choice of one of the assigned types to each case during their application. This paper presents the first step in this direction. These types can be reused in other analyses which contain these same categories, namely the cases, to build an applicative expression corresponding to this sentence. Consequently, the construction of an applicative parsing tree is reduced to a simple calculus on the types. In the next sections, we handle the problem of the double cases, the free word order structure and the coordination considering the proposed types of cases."]},{"title":"3.1.1. Double nominative","paragraphs":["The problem of a double subject corresponding to a double nominative and of a double object corresponding to a double accusative is actually very important in the syntactic and semantic 218  study of Korean (Sung 1999, Hong 1999, Lee 2002, Chung 2003). This subject has not been well studied in the aspect of the natural language processing, so it is \\worth proposing a new analysis in the computational linguistic point of view.  In this paper we give a solution to the problem of the double nominative marker such as -ga. Sumi-ga maumsi-ga jo-ta. (Sumi has a good heart.) (Sumi’s heart is good.) Sumi-NOM heart-NOM be good-DC The above sentence having double nominative (-ga) of Sumi-ga and (-ga) of maumsi-ga can be interpreted in the other form “Sumi-uy maumsi-ga jo-ta”, namely the first -ga can be replaced by the genitive marker -uy without changing the meaning of the original sentence. This analysis leads us to calculate the syntactic types of the two occurrences of -ga.  We consider now the above sentence with a double nominative and the following processing. Sumi-ga maumsi-ga jo-ta.  1.[N :Sumi]-[(N*/N*)\\N :-ga]-[N :maumsi]-[N*\\N :-ga]-[X1 :jo-ta] 2.[N*/N* :-ga Sumi]- [N :maumsi]-[N*\\N :-ga]-[X1 :jo-ta] (<) \\ 3.[N*/N* :-ga Sumi]- [N*:-ga maumsi]-[X1 :jo-ta] \\ (>) 4.[N* : (-ga Sumi)-ga maumsi]- [X1 :jo-ta] \\ (>) 5.[S/X1 : C*((-ga Sumi)-ga maumsi)]- [X1 :jo-ta] \\ (>T) 6.[S : C*((-ga Sumi)-ga maumsi)jo-ta] \\ (>) 7.[S : (jo-ta((-ga Sumi)-ga maumsi))] \\ (C*)  This analysis shows that the second -ga is a real nominative marker that forms the subject of the sentence “maumsi-ga” and the first -ga is used as an element that forms the determinant “Sumi-ga” of the subject. Thus, we assign the syntactic type ((S/X1",")/(S/X1","))\\N to the first -ga and the syntactic type (S/X1",")\\N to the second -ga. The nominative case becomes more complex when we must process double nominative. The new assignation of type is: (S/X1",")\\N or ((S/X1",")/(S/X1","))\\N. The above analysis is new and different of the proposed analyses for the formal double cases in Korean (Cha 2001, Kang 2001) by the Categorial Grammars; it corresponds to the intuitive interpretation."]},{"title":"3.2.Free Word Order","paragraphs":["Free word order is a widespread phenomenon in Korean, so the processing of the Korean language becomes difficult. The position of the linguistic elements in the Korean sentence does not play an essential grammatical role because it is generally possible to permute these linguistic elements, namely subjects, direct/indirect objects, etc. except that verbs take always a position at the end of the sentence.  Consider the following examples having the free word order structure. a. Sumi-ga Minju-eke jilmun-ul hae-ss-da. (Sumi asked to Minju a question.) Sumi-NOM Minju-DAT question-ACC do-PS-DC b. Sumi-ga jilmun-ul Minju-eke hae-ss-da. c. Minju-eke Sumi-ga jilmun-ul hae-ss-da. d. Minju-eke jilmun-ul Sumi-ga hae-ss-da. e. Jilmun-ul Minju-eke Sumi-ga hae-ss-da. f. Jilmun-ul Sumi-ga Minju-eke hae-ss-da.  In the above examples the sentences have the same predicative interpretation (but the topic/comment interpretation is not invariant). So, the position of the elements is not very important in the Korean analysis. We propose now to analyze these sentences in the ACCG.  a) Sumi-ga Minju-eke jilmun-ul hae-ss-da. Sumi-NOM Minju-DAT question-ACC do-PS-DC « Sumi asked to Minju a question. » 1.[N: Sumi]-[N*\\N:-ga]-[N:Minju]-[N*\\N:-eke]-[N:jilmun]-[N*\\N:-ul]-[X3: hae-ssda] 2.[N*:-ga Sumi] – [N* : -eke Minju] – [N*:-ul jilmun] - [X3: hae-ss-da] (<) 219 ","« It’s to Minju that Sumi asked a question. » 3.[S/X1:(C*-ga Sumi)]-[N*:-eke Minju]-[N*:-ul jilmun]-[X3:hae-ss-da] (>T) 4.[S/X1:(C*-ga Sumi)]-[X1/X2:(C*-eke Minju)]-[N*:-ul jilmun]-[X3:hae-ss-da] (>T) 5.[S/X1:(C*-ga Sumi)]-[X1/X2:(C*-eke Minju)]-[ X2/X3: (C*-ul jilmun)]-[X3:hae-ssda] \\ (>T) 6.[S/X2:B(C*-ga Sumi)(C*-eke Minju)]-[ X2/X3: (C*-ul jilmun)]-[X3:hae-ss-da]","(>B) 7.[S/X3 :B(B(C*-ga Sumi)(C*-eke Minju)) (C*-ul jilmun)]-[X3:hae-ss-da] (>B) 8.[S: B(B(C*-ga Sumi)(C*-eke Minju)) (C*-ul jilmun) hae-ss-da] (>) 9.[S: (B(C*-ga Sumi)(C*-eke Minju)) ((C*-ul jilmun) hae-ss-da)] (>) 10.[S: (C*-ga Sumi)((C*-eke Minju) ((C*-ul jilmun) hae-ss-da))] (B) 11.[S: ((C*-eke Minju) ((C*-ul jilmun) hae-ss-da)) -ga Sumi] (C*) 12.[S: (((C*-ul jilmun) hae-ss-da) -eke Minju) -ga Sumi] (C*) 13.[S: ((((hae-ss-da) -ul jilmun) -eke Minju) -ga Sumi)] (C*) 1. [N:Minju]-[N*\\N:-eke]-[N:jilmun]-[N*\\N:-ul]-[N:Sumi]-[N*\\N:-ga]-[X3: hae-ssda] 2. [N* : -eke Minju] – [N* : -ul jilmun] – [N*:-ga Sumi] - [X3: hae-ss-da] (<) 3. [X1/X2:(C*-eke Minju)]-[N*:-ul jilmun]-[N*:-ga Sumi]-[X3: hae-ss-da] (>T) 4. [X1/X2:(C*-eke Minju)]-[X2/X3:(C*-ul jilmun)]-[N*:-ga Sumi]-[X3: hae-ss-da]","(>T) 5. [X1/X2:(C*-eke Minju)]-[X2/X3:(C*-ul jilmun)]-[S/X1:(C*-ga Sumi)]-[X3: hae-ssda] \\ (>T) 6. [X1/X3:B(C*-eke Minju)(C*-ul jilmun)]-[S/X1:(C*-ga Sumi)]–[X3: hae-ss-da]","(>B) 7. [S/X3: B(B(C*-ga Sumi)(C*-eke Minju))(C*-ul jilmun)]-[ X3: hae-ss-da] (>B) 8. [S: B(B(C*-ga Sumi)(C*-eke Minju))(C*-ul jilmun) hae-ss-da] (>) 9. [S: B(C*-ga Sumi)(C*-eke Minju)((C*-ul jilmun)hae-ss-da)] (B) 10. [S: (C*-ga Sumi)((C*-eke Minju)(C*-ul jilmun)hae-ss-da)] (B) 11. [S: ((C*-eke Minju)(C*-ul jilmun)hae-ss-da) -ga Sumi] (C*) 12. [S: (((C*-ul jilmun)hae-ss-da) -eke Minju)-ga Sumi] (C*) 13. [S: ((((hae-ss-da) -ul jilmun) -eke Minju) -ga Sumi)] (C*)  b) Sumi-ga jilmun-ul Minju-eke hae-ss-da. Sumi-NOM question-ACC Minju-DAT do-PS-DC « Sumi asked a question to Minju. »","1.[N:Sumi]-[N*\\N:-ga]-[N:jilmun]-[N*\\N:-ul]-[N:Minju]-[N*\\N:-eke]-[X3: hae-ss-da] 2.[N*:-ga Sumi] – [N*:-ul jilmun]-[N*:-eke Minju] - [X3: hae-ss-da] (<) 3.[S/X1:(C*-ga Sumi)]-[N*:-ul jilmun]-[N*:-eke Minju]-[X3:hae-ss-da] (>T) 4.[S/X1:(C*-ga Sumi)]-[X2/X3:(C*-ul jilmun)]-[N*:-eke Minju]-[X3:hae-ss-da] (>T) 5.[S/X1:(C*-ga Sumi)]-[X2/X3:(C*-ul jilmun)]-[X1/X2:-eke Minju]-[X3:hae-ss-da]","(>T) 6.[S/X1 :(C*-ga Sumi)]-[X1/X3:(B(C*-eke Minju)(C*-ul jilmun))]-[X3:hae-ss-da]","(<B) 7.[S/X3:B((C*-ga Sumi-ga)(B(C*-eke Minju-eke)(C*-ul jilmun)))]-[X3:hae-ss-da]","(<B) 8.[S:B((C*-ga Sumi)(B(C*-eke Minju)(C*-ul jilmun)))hae-ss-da)] (>) 9.[S:(C*-ga Sumi)((B(C*-eke Minju)(C*-ul jilmun))hae-ss-da)] (B) 10.[S:((B(C*-eke Minju)(C*-ul jilmun)) hae-ss-da) -ga Sumi] (C*) 11.[S:((C*-eke Minju)((C*-ul jilmun) hae-ss-da)) -ga Sumi] (B) 12.[S: (((C*-ul jilmun) hae-ss-da) -eke Minju) -ga Sumi] (C*) 13.[S: ((((hae-ss-da) –ul jilmun) -eke Minju) -ga Sumi)] (C*) e) Jilmun-ul Sumi-ga Minju-eke hae-ss-da question-ACC Sumi-NOM Minju-DAT do-PS-DC « It’s a question that Sumi asked to Minju. » 1. [N:jilmun]-[N*\\N:-ul]-[N:Sumi]-[N*\\N:-ga]-[N:Minju]-[N*\\N:-eke]-[X3: hae-ssda] 2. [N*:-ul jilmun] – [N*: -ga Sumi] – [N*:-eke Minju] - [X3: hae-ss-da] (<) 3. [X2/X3:(C*-ul jilmun)]-[N*:-ga Sumi]-[N*:-eke Minju]-[X3: hae-ss-da] (>T) 4. [X2/X3:(C*-ul jilmun)]-[S/X1:(C*-ga Sumi)]-[N*:-eke Minju]-[X3: hae-ss-da] (>T) 5. [X2/X3:(C*-ul jilmun)]-[S/X1:(C*-ga Sumi)]-[X1/X2: -eke Minju]-[X3:hae-ss-da]","(>T) 6. [X2/X3:(C*-ul jilmun)]-[S/X2:B(C*-ga Sumi)(C*-eke Minju)]-[X3: hae-ss-da] (>B) 7. [S/X3:B((B(C*-ga Sumi)(C*-eke Minju))(C*-ul jilmun))]-[ X3: hae-ss-da] (>B) 8. [S: B((B(C*-ga Sumi)(C*-eke Minju))(C*-ul jilmun))hae-ss-da] (>) 9. [S: (B(C*-ga Sumi)(C*-eke Minju))((C*-ul jilmun)hae-ss-da))] (B) 10. [S: (C*-ga Sumi)((C*-eke Minju)((C*-ul jilmun)hae-ss-da)))] (B) 11. [S:((C*-eke Minju)((C*-ul jilmun)hae-ss-da))) -ga Sumi] (C*) 12. [S:((C*-ul jilmun)hae-ss-da)) -eke Minju) -ga Sumi] (C*) 13. [S: ((((hae-ss-da)-ul jilmun) -eke Minju) -ga Sumi)] (C*) ","c) Minju-eke Sumi-ga jilmun-ul hae-ss-da. f) Jilmun-ul Minju-eke Sumi-ga hae-ss-da","Minju-DAT Sumi-NOM question-ACC do-PS-DC question-ACC Minju-DAT Sumi-NOM do-PS-DC","« It’s to Minju that Sumi asked a question. » « It’s a question that Sumi asked to Minju. »","1. [N:Minju]-[N*\\N:-eke]-[N:Sumi]-[N*\\N:-ga]-[N:jilmun]-[N*\\N:-ul]-[X3: hae-ss-","da]","2. [N* : -eke Minju] – [N* : -ga Sumi] – [N*:-ul jilmun] - [X3: hae-ss-da] (<)","3. [X1/X2:(C*-eke Minju)]-[N*:-ga Sumi]-[N*:-ul jilmun]-[X3:hae-ss-da] (>T)","4. [X1/X2:(C*-eke Minju)]-[S/X1:(C*-ga Sumi)]-[N*:-ul jilmun]-[X3:hae-ss-da] (>T)","5. [X1/X2:(C*-eke Minju)]-[S/X1:(C* -ga Sumi)]-[X2/X3:(C*-ul jilmun)]-[X3:hae-ss-","da] \\ ( >T)","6. [S/X2:(B(C*-ga Sumi)(C*-eke Minju))]-[X2/X3:(C*-ul jilmun)]–[X3:hae-ss-da]","(>B)","7. [S/X3:(B(C*-ga Sumi)(C*-eke Minju))(C*-ul jilmun)]- [X3:hae-ss-da] (>)","8. [S:(B(C*-ga Sumi)(C*-eke Minju))(C*-ul jilmun)hae-ss-da] (>)","9. [S:(C*-ga Sumi)((C*-eke Minju)(C*-ul jilmun))hae-ss-da)] (B)","10. [S:(((C*-eke Minju)(C*-ul jilmun))hae-ss-da) -ga Sumi] (C*)","11. [S: :(((C*-ul jilmun)hae-ss-da) -eke Minju) -ga Sumi] (C*)","12. [S: ((((hae-ss-da) -ul jilmun) -eke Minju) -ga Sumi)] (C*) 1. [N:jilmun]-[N*\\N:-ul]-[N:Minju]-[N*\\N:-eke]-[N:Sumi]-[N*\\N:-ga]-[X3: hae-ssda] 2. [N*:-ul jilmun] – [N*: -eke Minju] – [N*:-ga Sumi] - [X3: hae-ss-da] (<) 3. [X2/X3:(C*-ul jilmun)]-[N*:-eke Minju]-[N*:-ga Sumi]-[X3: hae-ss-da] (>T) 4. [X2/X3:(C*-ul jilmun)]-[X1/X2:(C*-eke Minju)]-[N*:-ga Sumi]-[X3: hae-ss-da]","(>T) 5. [X2/X3:(C*-ul jilmun)]-[ X1/X2:(C*-eke Minju)]-[S/X1:(C*-ga Sumi)]-[X3: hae-ssda] \\ (>T) 6. [X2/X3:(C*-ul jilmun)]-[S/X2: B(C*-ga Sumi)(C*-eke Minju)]-[X3: hae-ss-da]","(>B) 7. [S/X3: (B(B(C*-ga Sumi)(C*-eke Minju))(C*-ul jilmun))]-[ X3: hae-ss-da] (>B) 8. [S: (B(B(C*-ga Sumi)(C*-eke Minju))(C*-ul jilmun))hae-ss-da] (>) 9. [S: (B(C*-ga Sumi)((C*-eke Minju)(C*-ul jilmun)))hae-ss-da] (B) 10. [S: (C*-ga Sumi)(((C*-eke Minju)(C*-ul jilmun))hae-ss-da)] (B) 11. [S: (C*-ga Sumi)((C*-eke Minju)(hae-ss-da(-ul jilmun)))] (C*) 12. [S: ((C*-ga Sumi)((hae-ss-da(-ul jilmun)) -eke Minju))] (C*) 13. [S: ((((hae-ss-da)-ul jilmun) -eke Minju) -ga Sumi)] (C*)  d) Minju-eke jilmun-ul Sumi-ga hae-ss-da. Minju-DAT question-ACC Sumi-Nom do-PS-DC  For the six sentences, the six different analyses lead us to one unique and identical applicative expression. So with the simple application of the functional composition rules we presented above, we obtain one applicative parsing tree in the form of applicative expression from six sentences having each one different permutation of elements. Thus, we observe that the ACCG formalism gives a new and more efficient approach to the processing of the free word order structure. Moreover, these results can be automatically obtained by computer."]},{"title":"3.3.Coordination","paragraphs":["During the automatic processing of the natural language, the coordination structure is one of the most difficult characteristics not only in Korean (Cho & Park 2000), but also in French (Biskri & Desclés 2005) and (Biskri & Rochette 2007), and in English (Ste\\edman 2001). Coordination structure makes the analysis very complicated with the ellipsis of predicates, coordination between non constituted elements, long distance scrambling and the grammatical and syntactical ambiguity notably from a practical point of view.  In this paper, we are particularly interested in the problem of the ellipsis of predicates, non constituted elements and of a long distance scrambling in the Korean coordination. 220  For the categorial analysis of the Korean coordination structure, we use a rule which was originally developed for the French coordination analysis. We do not need to modify the rule; we use just a different strategy in the calculus for the Korean. This rule makes possible the coordination analysis notably of elements having the same function and type. The combinators used for the coordination analysis are B, C* and Ф7",". This combinator Ф can be explained in the following coordination rules proposed for Korean.  Table 2: Coordination rule8","for Korean.","[X :u1]-[CONJD : , / -go ]-[X :u2]","-------------------------------------------<CONJD>","[X: (Φ , u1u2)]  Consider the following example of the Korean coordination. In this example, we can see the ellipsis of the predicate in the first proposition, and “Sumi-ga gongbu-lil” and “Minju-ga yori-lil” are non-constituents.  Sumi-ga gongbu-lil , Minju-ga yori-lil han-da. (Sumi studies, Minju cook.) Sumi-NOM study-ACC CONJ Minju-NOM cook-ACC do-DC  1. [N:Sumi]-[N*\\N:-ga]-[N:gonbu]-[N*\\N:-lil]-[CONJ:,]-[N:Minju]-[N*\\N:-ga]-[N:yori]-[N*\\N:-lil]-[X2:han-da] 2.[N*:-ga Sumi]-[N*:-lil gongbu]-[CONJD:,]-[N*:-ga Minju]-[N*:-lil yori]-[X2:han-da] (<) 3.[S/X1:(C*-ga Sumi)]-[X1/X2:(C*-lil gongbu)]-[CONJ:,]-[S/X1:(C*-ga Minju)]-[X1/X2:(C*-lil yori)]-[X2:han-da] (>T) 4.[S/X2:(B(C*-ga Sumi)(C*-lil gongbu))]-[CONJ:,]-[S/X2:(B(C*-ga Minju)(C*-lil yori))]-[X2:han-da] (>B) 5.[S/X2:Φ,(B(C*-ga Sumi)(C*-lil gongbu))(B(C*-ga Minju)(C*-lil yori))]-[X2:han-da] (<CONJD>) 6.[S:(Φ,(B(C*-ga Sumi)(C*-lil gongbu))(B(C*-ga Minju)(C*-lil yori)))han-da] \\ (>) 7.[S:,((B(C*-ga Sumi)(C*-lil gongbu))han-da)((B(C*-ga Minju)(C*-lil yori)))han-da)] (Φ) 8.[S:,((C*-ga Sumi)((han-da)-lil gonbu))((B(C*-ga Minju)(C*-lil yori)))han-da] (B) 9.[S:,(((han-da)-lil gongbu)-ga Sumi)((B(C*-ga Minju)(C*-lil yori)))han-da] (C*) 10.[S:,(((han-da)-lil gongbu)-ga Sumi)((C*-ga Minju)((han-da)-lil yori)] (C*) 11.[S:,(((han-da)-lil gongbu)-ga Sumi)(((han-da)-lil yori)-ga Minju)] (C*)  The conjunction"]},{"title":",","paragraphs":["coordinates two expressions having the same type: (((han-da)-lil gongbu)- ga Sumi) and (((han-da)-lil yori)-ga Minju). These expressions are applicative expressions of propositions: Sumi studies and Minju cook that were presented here in the form of a logico-grammatical predicative relation. The introduction of the combinator Ф, at step 5, builds a new complex operator “Φ,(B(C*-ga Sumi)(C*-lil gongbu))(B(C*-ga Minju)(C*-lil yori))”. Then, at step 6, the reduction of the combinator allows us to apply the operators “B(C*-ga Sumi)(C*-lil gongbu)” and “B(C*-ga Minju)(C*-lil yori)” to the operand “han-da”."]},{"title":"3.3.1. Long Distance Scrambling","paragraphs":["The long distance scrambling is one of the types of Free Word Order phenomenon (e.g. short distance scrambling, etc.). In this paper, we are particularly interested in the long distance scrambling in the coordination structure in Korean. This phenomenon that we can often find in Korean makes very complicated the Korean parsing notably when it appears in a complex coordination structure. Through this paper, we try to give a simple and robust solution to this problem with some examples in Korean.  Let us consider the sentence which shows the long distance scrambling phenomenon.  Sunsaengnim-i Sumi-nun Minsu-lil pyunaehan-da-go saengakha -go, Minsu-nun Sumi-lil pyunaehan-da-go saengakhan-da. Professor-TOP Sumi-NOM Minsu-ACC prefer-DC-COMP think -CONJ Minsu-NOM Sumi-ACC prefer-DC-COMP think-DC (Sumi thinks that the professor prefers Minsu and Minsu thinks that the professor prefers Sumi.)  7 This is a combinator of coordination in the sense of Desclés and Biskri. The β-reduction rule is defined as follows: Фfgh→f(gx)(hx). f,g,h, are operators that will form a new complex operator Фfgh and x is its operand. 8 This coordination rule was originally presented for the analysis of a French coordination by Biskri and Desclés in the paper “Analyse de la coordination et de la subordination au moyen de la Grammaire Catégorielle Combinatoire Applicative” (written in French, 2005). 221   Fig. 1. shows the original structure of the above sentence by allowing us to understand the origin of the movement of elements in the sentence.   \\  Figure 1: Original structure of the above sentence.  As shown in the above figure, this is a coordination having the movement of subject (NP: Sunsaengnim-i) of the embedded sentence (P1) from both propositions to the head of the sentence. Namely, it concerns the topicalisation of Sunsaengnim-i.  We propose now to analyze this sentence in the ACCG formalism. Sunsaengnim-i Sumi-nun Minsu-lil pyunaehan-da-go saengakha-go, Minsu-nun Sumi-lil pyunaehan-da-go saengakhan-da.  1. [S/X1: C* -i Sunsaengnim]-[S/X1: C* -nun Sumi]-[X1/X2: C* -lil Minsu]-[X2: pyunaehan-da-go]-[X1\\S:saengakha]-[CONJ: -go ,]-[S/X1: C* -nun Minsu]-","[X1/X2: C* -lil Sumi]-[X2: pyunaehan-da-go]-[X1\\S: saengakhan-da] (>T)","2. [S/X1: C* -i Sunsaengnim]-[S/X1: C* -nun Sumi]-[X1: (C* -lil Minsu pyunaehan-da-go)]-[X1\\S: saengakha]-[CONJ:-go,]-[S/X1: C* -nun Minsu]-[X1: (C* - lil Sumi pyunaehan-da-go)]-[X1\\S: saengakhan-da] (>)","3. [S/X1: C* -i Sunsaengnim]-[S: (C* -nun Sumi (C* -lil Minsu pyunaehan-da-go))]-[X1\\S: saengakha]-[CONJ: -go,]-[S: (C* -nun Minsu (C* -lil Sumi pyunaehan-da-go))]-[X1\\S: saengakhan-da] (>)","4. [S/X1: C* -i Sunsaengnim]-[X1: saengakha-go (C* -nun Sumi (C* -lil Minsu pyunaehan-da-go))]-[CONJ:-go,]-[X1: saengakhan-da (C* -nun Minsu (C* -lil Sumi pyunaehan-da-go))] (<)","5. [S/X1: C* -i Sunsaengnim]-[X1: Ф -go, (saengakha-go (C* -nun Sumi (C* -lil Minsu pyunaehan-da-go))) (saengakhan-da (C* -nun Minsu (C* -lil Sumi pyunaehan-da-go)))] (<CONJD>)","6. [S: C* -i Sunsaengnim (Ф -go, (saengakha-go (C* -nun Sumi (C* -lil Minsu pyunaehan-da-go))) (saengakhan-da (C* -nun Minsu (C* -lil Sumi pyunaehan-da-go))))] (>)","7. [S: (Ф -go, (saengakha-go (C* -nun Sumi (C* -lil Minsu pyunaehan-da-go))) (saengakhan-da (C* -nun Minsu (C* -lil Sumi pyunaehan-da-go))) –i sunsaengnim )] (C*)","8. [S: (-go, (saengakha-go (C* -nun Sumi (C* -lil Minsu pyunaehan-da-go))-i sunsaengnim) (saengakhan-da (C* -nun Minsu (C* -lil Sumi pyunaehan-da-go))) –i sunsaengnim )] (Ф)","9. [S: (-go, (saengakha-go ((pyunaehan-da-go)-lil Minsu)-nun Sumi)-i sunsaengnim) (saengakhan-da ( ( pyunaehan-da-go)-lil Sumi)-nun Minsu) –i sunsaengnim )] (C*)  In this analysis, we have shown only the most important steps, without detailing the preliminary calculations. At step 5, the application of the coordination rule allows us to coordinate two propositions and at step 8, to distribute “Sunsaengnim-i” to the first and second coordinated propositions. At step 9, we obtain a grammatically well-formed applicative expression, which is the parsing tree of the given sentence.  Then, consider the example of the Korean coordination having the ellipsis of the predicate and the long distance scrambling.  Sunsaengnim-i Sumi-nun Minsu-lil pyunaeha -go, Minsu-nun Sumi-lil pyunaehan-da-go saengakhan-da Professor-TOP Sumi-NOM Minsu-ACC prefer CONJ Minsu-NOM Sumi-ACC prefer-DC-COMP think-DC (Sumi think that the professor prefers Minsu and Minsu think that the professor prefers Sumi.)  In this sentence, we observe the ellipsis of predicate in the first proposition that make a difference from the above example and also the long distance scrambling phenomenon as the above sentence. This kind of structure has not been well analyzed in other related works from computational point of view because of the complexity of the long distance scrambling phenomenon.  Let us analyze the above sentence. Sunsaengnim-i Sumi-nun Minsu-lil pyunaeha-go, Minsu-nun Sumi-lil pyunaehan-da-go saengakhan-da.  1. [S/X1: C* -i Sunsaengnim]-[S/X1: C* -nun Sumi]-[X1/X2: C* -lil Minsu]-[X2: pyunaeha]-[CONJ: -go ,]-[S/X1: C* -nun Minsu]-[X1/X2: C* -lil Sumi]-[X2:","pyunaehan-da-go]-[X1\\S: saengakhan-da] (>T)","2. [S/X1: C* -i Sunsaengnim]-[S/X1: C* -nun Sumi]-[X1: (C* -lil Minsu pyunaeha)]-[CONJ:-go,]-[S/X1: C* -nun Minsu]-[X1: (C* -lil Sumi pyunaehan-dago)]-[X1\\S: saengakhan-da] (>)","3. [S/X1: C* -i Sunsaengnim]-[S: (C* -nun Sumi (C* -lil Minsu pyunaeha))]-[CONJ: -go,]-[S: (C* -nun Minsu (C* -lil Sumi pyunaehan-da-go))]-[X1\\S: saengakhan-da] (>) 4. [S/X1: C* -i Sunsaengnim]-[S: Ф -go, (C* -nun Sumi (C* -lil Minsu pyunaeha)) (C* -nun Minsu (C* -lil Sumi pyunaehan-da-go))]-[X1\\S: saengakhan-da] (<) 5. [S/X1: C* -i Sunsaengnim]-[X1: saengakhan-da (Ф -go, (C* -nun Sumi (C* -lil Minsu pyunaeha)) (C* -nun Minsu (C* -lil Sumi pyunaehan-da-go)))] (<CONJD>) 6. [S: C* -i Sunsaengnim (saengakhan-da (Ф -go, (C* -nun Sumi (C* -lil Minsu pyunaeha)) (C* -nun Minsu (C* -lil Sumi pyunaehan-da-go))))] (>) 7. [S: (saengakhan-da (Ф -go, (C* -nun Sumi (C* -lil Minsu pyunaeha)) (C* -nun Minsu (C* -lil Sumi pyunaehan-da-go)))) –i sunsaengnim )] (C*) 8. [S: (saengakha-go (-go, (C* -nun Sumi (C* -lil Minsu pyunaeha))-i sunsaengnim) (C* -nun Minsu (C* -lil Sumi pyunaehan-da- go))) –i (Ф) 222  sunsaengnim )] 9. [S: (saengakha-go(-go, ((pyunaeha-go)-lil Minsu))-i sunsaengnim)-nun Sumi) ((pyunaehan-da-go)-lil Sumi)) –i sunsaengnim]-nun Minsu)] (C*)  In this work, as shown in our categorial analyses, we could handle the long distance scrambling phenomenon in the complex coordination structure with simple applications of the coordination rule and the type raising rule."]},{"title":"4. Conclusion","paragraphs":["As we have shown in this paper, this formalism allows us to scope the difficult characteristics of the Korean language. In particular, we could consider the cases in Korean as operators which play an essential role in the Korean analysis. The cases including double cases have not yet been well studied from a practical point of view. That is why our study is new and different.","We have shown the simple process of the calculation for the free word order structure which can be useful for the automatic processing. The process of calculation reveals clearly the syntactic order of the categories. We could also handle the coordination sentences having non constituent elements, ellipsis of predicates and even scrambling of the elements found in the coordination structure. Compared to other related works for the Korean language parsing using exclusively Steedman’s Combinatory Categorial Grammar, our attempts present a considerable challenge and a new approach resulting in the calculations of the Korean sentence that improve the above mentioned problems.  For the moment, it is possible to assign the several syntactic types to one case in this formalism. To resolve this complexity and ambiguity, we try to find some invariants for each case by calculating more complex sentences. Our results can automatically generate the applicative parsing tree in the form of the applicative expression. This kind of analysis by the categorial grammars can be combined in a more operational model such as the Applicative and Cognitive Grammar developed by J.-P. Desclés for a semantic analysis as a preliminary step to an analysis of a higher level. "]},{"title":"References","paragraphs":["Biskri, I. 1995. La Grammaire Catégorielle Combinatoire Applicative dans le cadre de la Grammaire Applicative et Cognitive, Ph.D.thesis, EHESS, Paris.","Biskri, I. and Desclés, J-P. 2005. Analyse de la coordination et de la subordination au moyen de la Grammaire Catégorielle Combinatoire Applicative, Colloque Typologie et modélisation de la coordination et de la subordination, LACITO-ParisIII (UMR 7107, CNRS), Paris.","Biskri, I. and Rochette, M, A. 2007. The operational annotation and the analysis of the correlative coordination in French, In Proceedings of the 2007 FLorida Artificial Intelligence Society, AAAI Press.","Cha J.W. 2001. Statistical Parsing for Korean Categorial Grammar, Ph.D.thesis, Pohang University of Science & Technology, Pohang, Korea.","Cha J.W. and Lee G.B. 2002. Structural disambiguation of morpho-syntactic categorial parsing for Korean, International Conference On Computational Linguistics, Proceedings of the 18th conference on Computational linguistics – Vol. 2, 1002~1006, Saarbrücken, Germany.","Cho, H.J and Park. J.C. 2000. Combinatory Categorial Grammar for the Syntactic, Semantic and Discourse Analyses of Coordination in Korean, Journal of KISS: Software and Applications, 27(4), 448-462, Korea.","Chung, G. 2003. Analyse des constructions à double nominatif/accusatif par l’opération de restructuration en Coréen. Classification syntaxique des constructions à adjectifs sôngsang, Ph.D.thesis, Marne-La-Vallée University, Paris. 223  Curry, H. and Feys, R. 1958. Combinatory Logic, Vol.I, North-Holland. Desclés, J.P. 1990. Langages applicatifs, langues naturelles et cognition, Hermès, Paris. Desclés, J-P and Biskri, I. 1996. Logique Combinatoire et linguistique : La Grammaire","Catégorielle Combinatoire Applicative, Mathématiques, Informatiques et Sciences","Humaines, n° 132, 39-68, Paris. Desclés, J.P. 2003. La Grammaire Applicative et Cognitive construit-elle des représentations","universelles?, LINX 48, Université Paris X, 139-160, Paris. Hong, J.S. 1999. Generative Grammar and Korean Cases, in Korean Cases and Particles by","Institute of Korean Language, Wolin, 83-112, Korea. Kang, B.M. 2001. Categorial Grammar (written in Korean), Institute of Korean Culture, Korea","University, Seoul, Korea. Kang, J.Y. 2005. Grammaires Catégorielles appliquées au coréen en comparaison avec le","français, Master’s thesis, Paris-Sorbonne University, Paris. Lambek, J. 1961. On the calculus syntactic types, Proceeding of symposia in Applied","Mathematics, vol. XII, America Mathematical Society, Providence, Rhode Island, 166-178. Lee H.J. and Park J.C. 2003. Morphological Analysis of Irregular Conjugation in Korean with","Micro Combinatory Categorial Grammar, Proceedings of the Korea Information Science","Society (KISS) Spring Conference, volume 30, number 1(B), 531-533, Korea. Lee, S.H. 2002. Korean Though Constructions and Double Nominative Constructions, In","Proceedings of the 9th","International Conference On HPSG, Seoul, Korea. Moortgat, M. 1988. Categorial Investigation, Logical and Linguistic Aspects of the Lambek","calculus, Foris Publications. Nam, G.S. 2001. The Syntax (written in Korean), Taehaksa, Seoul, Korea. Shaumyan, S. K. 1987. A Semiotic Theory of Natural Language, Bloomington, Indiana Univ.","Press. Steedman, M. 1989. Work in Progress: Combinators and grammars in natural language","understanding, Summer institute of linguistic, Tucson University. Steedman, M. 2001. The Syntactic Process, MIT Press/Bradford Books. Sung, K.S. 1999. Expression of Cases and Meaning of Particles (written in Korean), Wolin,","Seoul, Korea. 224"]}]}