{"sections":[{"title":"Semantic Change of the Selected Cebuano Words* ","paragraphs":["Rowanne Marie R. Maxilom, Ph.D"," University of San Carlos","P. del Rosario Street, 6000 Cebu City"," {wannex_007@yahoo.com}  Abstract  This study attempted to determine the types of semantic change of the selected Cebuano words from the written texts, specifically the Bisaya magazine and spoken language of Cebuano speakers aged 15 – 40 years old living in Cebu province. Twenty (20) Cebuano words were analyzed using Campbell’s (1998) and Crowley’s (1997) classifications of the semantic change. The results revealed that metaphor was the dominant type of semantic change in the written text and broadening was frequently-used in the spoken language.  Keywords: broadening, metaphor, semantic change, widening "]},{"title":"1. Introduction ","paragraphs":["“Earlier grammars and dictionaries reveal that Cebuano-Bisaya has undergone rapid changes in the course of the last four centuries.” (Wollf, 2001, p. 121). There are words listed in the earlier dictionaries that seem to be unknown in the current time. In fact, some of the young Cebuano speakers who are more exposed to other languages such as English do not understand the speech of their elders who used old Cebuano terms.","","Trask (1994) also pointed out that the young generation had a hard time in reading what the ancestors wrote 400 years ago. In the same manner, the descendants would surely find reading what the current generation of speakers is writing presently or the future generation could even hardly understand the tape recordings and films shown these days.","","Because of the cultural influences, the language was also affected. There are many Cebuano terms that are currently used by the native speakers that were originated in English and Spanish. In fact, “when the Spaniards left the Philippines in 1898 after almost 350 years of colonization...” as reported by Gonzalez (2004, p. 73), ten percent of the Filipinos spoke in Spanish.","   * Acknowledgment  This paper was made possible because of the following persons: Dr. Shirley Dita, who invited me to submit an article to PACLIC, Dr. Hsiu-chuan who encouraged me to write a paper in Historical Linguistics, Ms. Ma. Lourdes Apodaca, Mrs. Letty Espina, Mr. Joselito Flores, Miss Haidee Palapar, Dr. Hope S. Yu, and Mrs. Norly Plasencia, who were my informants and consultant, respectively.  Copyright 2008 by Rowanne Marie R. Maxilom   282 22nd Pacific Asia Conference on Language, Information and Computation, pages 282–289 ","However, thirty percent of the Filipinos could speak in English after the Philippines had been colonized by the Americans for forty eight years. In this manner, the colonization by the Spaniards and Americans could possibly account for the semantic change that was undergone by some Cebuano words.","","Bloomfield (1933) and Campbell (1998) defined semantic change as a change in the concepts that were associated with a term and the innovations that change the meaning of words.  With regard to the types of semantic change, Campbell (1998) and Crowley (1997) have the following classifications: First, widening or broadening refers to the increase of the meaning of words (Campbell, 1998) and a change in meaning which could result in a word processing additional meanings while retaining the original meaning (Crowley, 1997). For example, the English word ‘dog’ had a specific meaning of ‘a powerful breed of dog’ which has a broader meaning that includes ‘all breeds of dog’. ","Second, narrowing involves the change of meaning that decreases its range of reference into a fewer context (Campbell, 1998) and occurs when a word refers to only part of the original meaning (Crowley, 1997). For instance, the word ‘starve’ (i.e. to suffer or perish from hunger) came from the Old English word ‘steorfan’ (i.e. to die).","","Third, metaphor is a type of semantic change that involves one kind of thing in relation to another kind of thing that is somehow similar to the previous thing (Campbell, 1997). For example, the Cebuano word ‘higante’ which is similar to the concept ‘big’ is used in describing a great writer. ","Fourth, litotes is another type of semantic change that refers to exaggeration through understatement (Campbell, 1998). For instance, the phrase ‘of no small importance’ is mentioned that would mean ‘something that is too important’.","","Other types of semantic change that were identified by Campbell (1998) are metonymy, synechdoche, degeneratin or pejoration, and elevation or amelioration. Metonymy occurs when there is a change of meaning of a word which includes other senses that are not originally present but are closely associated with the word’s previous meaning. An example of metonymy is the Spanish word ‘plata’ (i.e. silver) that has been elaborated to mean ‘money’. ","Another type of semantic change is synechdoche (i.e. a part-to-whole relationship). For instance, the word ‘tongue’ means ‘language’. In addition, degeneration or pejoration takes place when the sense of the word has a negative assessment in the minds of the users. For instance, the word ‘spinster’ has a negative connotation of an unmarried older woman. Elevation or amelioration (i.e. a shift of meaning which has an increasingly positive value judgment) is also another type of semantic change. An example of this type of semantic change is the Spanish word ‘casa’ (i.e. house) which had a previous meaning in Latin that is ‘hut’ or ‘cottage’.  The other types of semantic change are taboo replacement and avoidance of obscenity which can also be called euphemism, hyperbole or exaggeration (i.e. shifts in meaning because of exaggeration through overstatement), and bifurcation or semantic split classified by Crowley (1997) (i.e. when a term acquires another meaning that relates to the original meaning). To provide a concrete example of taboo replacement is the use of the term ‘rooster’ instead of ‘cock’ to avoid obscene association of ‘cock’ with ‘penis’. In addition, an example of hyperbole is the use of word ‘terribly’ that means little more compared to ‘very’. Lastly, an illustration of 283  bifurcation is the English word ‘silly’ which had a cognate in German word ‘selig’ (i.e. blessed) and is derived from Seele ‘soul’. Semantic shift takes place when the meaning ‘blessed’ changes its meaning into ‘stupid’ or ‘reckless’ in Modern English.  Moreover, Campbell (1998) and Crowley (1997) argued that there were various causes of language change. First, climate and geography could account for language change. The languages of mountainous areas as pointed out by Crowley (1997) tended to change swiftly than the languages spoken closer to the sea level due to higher altitude. ","Second, foreign influence or substratum is also one of the causes of language change. According to Campbell (1998), the substratum theory of linguistic change involves the idea that if people migrate into an area and their language is acquired by the original inhabitants of the area, then any changes in the language can be put down to the influence of the original language. For example, the colonization Spaniards to the Philippines has influenced the Cebuano language, especially the counting system. ","Third, simplification is another cause of language change. In this cause, the production of sounds in one language (e.g. Spanish /v/) in the word verde would be simplified into Cebuano berde which means ‘green’. "]},{"title":"2. Related Literature ","paragraphs":["This section focuses on the studies concerning the semantic correlates in Cebuano (Adeva, 2005), semantic meanings of Cebuano and Hiligaynon enclitic adverbs (Lising, 2004), and the semantic reconstruction in Austronesian Linguistics (Zorc, 2004).  In Adeva’s (2005) study, the semantic correlate in Cebuano and the way the semantic correlate were reflected in the morpho-syntax and semantics of Cebuano were investigated. This study also determined the transitive and intransitive constructions of the Cebuano stories. Using Hoppes and Thompson’s (1980) transitivity hypothesis and Dixon’s (1994) syntactic-semantic primitive cited in Adeva’s (2005) study, the results revealed that in actor focus, two affixes (mi-/ni-~m-replesive) were evident and three affixes (i-, -un, -an) were evident in goal the focus. ","However, this study had only few number of Bisaya magazines where the stories were taken from. The parameter could have been clearly described so that the scales are clear and the semantic correlates of the grammar could be systematically presented.  Lising (2004) analyzed the semantic meanings and syntactic distribution of the Cebuano and Hiligaynon counterparts of Tagalog enclitic adverbs in Cebuano short stories and Hiligaynon plays. The data of this study were taken from the published short stories (i.e. Mga Piling Kuwentong Sebuwano, 1986) cited in Lising (2004) and plays (i.e. Dulaang Hiligaynon, 1996) cited in Lising (2004). The results of this study revealed that all 15 Tagalog enclitic adverbs have counterparts in Cebuano and Hiligaynon except for the politeness markers such as ‘ho’ and ‘po’. ","However, this study used two different genres (i.e. short stories and plays). The results of this study could be more reliable and valid when only a single genre was used.","","Zorc (2004) conducted a study on the semantic reconstruction in Austronesian linguistics. In this study, Zorc (2004) focused on the important points such as 1) the part was relatively silent, yet important steps have recently been made which should guide the researchers in the art and science of assigning meanings to etymon, 2) a full citation of semantic information for each entry should be done, 3) a careful investigation of the breadth and meaning 284  of cognates within any given set should be conducted, 4) all information with synchronic values should be compared and contrasted within the semantic system of the languages shown, 5) having done steps 2, 3, and 4, the extrapolation of a common core could only be successfully undertaken, and 6) the results could be assessed through consulting current and past semantic theory.  In this study, Zorc (2004) also argued that the semantic relationships (e.g. metaphor) could be considered as checks and balances for the semantic reconstruction method. On the contrary, the process of showing a full citation from every dictionary entry was time-consuming for the researchers. ","Although these studies dealt with the semantic aspects of language, none of these studies focused on the semantic change. Hence, a study on semantic change of Cebuano words should be conducted.  The semantic aspects of language have not been given much attention by the researchers. Zorc (2004) argued that semantics was considered outside the domain of most formal linguistic analysis. Ward (1971) who conducted a bibliographic survey of the Philippine linguistic studies also found that no studies have been conducted concerning the semantic change in Cebuano. Campbell (1998) and Crowley (1997) added that the semantic aspects of language were overlooked by many of the researchers in historical linguistics. Thus, a study on the semantic change of Cebuano words should be conducted to fill this gap. ","This paper attempted to determine and analyze the semantic change of the selected Cebuano words. Also, this paper aimed at determining the types of semantic change undertaken by the Cebuano words from the written texts and spoken data. "]},{"title":"3. Methodology  ","paragraphs":["The data were taken from Bisaya, a Cebuano-Bisaya magazine issued in 2004 and 2005. Twenty (20) words were chosen (i.e. 10 words from the short stories and feature articles of the authors residing in Cebu province to avoid lexical variation from the other Cebuano-speaking communities and 10 words from the spoken discourse). The list of words from the spoken language was assumed to be used by the Cebuano speakers who are assumed to be aged 15-40 years old living within Cebu province. Textual analysis was used in this study because the data were based on the magazine named Bisaya. Word is the unit of analysis since only the Cebuano words that underwent semantic change were chosen.  In analyzing the types of semantic change, the classifications of Campbell (1998), and Crowley (1997) were used. To validate the reason in using a metaphor in writing Cebuano literature such as short stories and feature articles, five (5) informants were asked about their personal reasons in using a metaphor in writing short stories and feature articles. Three informants were Cebuano writers of short stories and feature articles and two informants were writers of Filipino short stories. A consultant who was a student taking up Doctor of Arts in Languages and Literature at De La Salle University – Manila was also chosen to make the analysis of the data more reliable and valid. "]},{"title":"4. Results and Discussion ","paragraphs":["This section focuses on the semantic change of the selected Cebuano words from the written texts and spoken data. Examples of the data would be shown before the presentation of the data. 285  Examples of Metaphor  Written Text  Originally, higante only refers to the large creature. Its meaning is compared to the well-known writers as in (1).  (1) higante sa natad sa panulat (Vaño, 2004, p. 5) giant LCV field LCV writing ‘giant in the field of writing’  Spoken Language  The word uk-uk previously refers to the cockroach only. The characteristic of the person who is shy is associated with the cockroach.  (2) Nauwaw ang uk-uk ashamed ang cockroach ‘The cockroach is ashamed’ ","Examples of Widening  Written Text  The word atakehon deriving from the word ‘attack’ in English means ‘to siege’ has increased its meaning when it is used to describe a person who has a heart ailment.  (3) atakehon sa sakit sa kasingkasing (Lape, 2004, p. 11) attack LCV the ailment LCV heart ‘will have heart attack’  Spoken Language  Kodak is originally a brand name of the camera. Currently, it is used to refer to a camera in general by some Cebuano speakers.  (4) kodak (spoken language) ‘a brand name of a camera Kodak’ → ‘camera in general’  Table 1 presents the types of semantic change of the selected Cebuano words.  Table 1. Types of Semantic Change  Data Types of Semantic Change ∑ B M N BI S L ME SY D E EU H Written 4 6 0 0 0 0 0 0 0 0 0 0 10 % 40% 60% 0% 0% 0% 0% 0% 0% 0% 0% 0% 0% 100% Spoken 7 3 0 0 0 0 0 0 0 0 0 0 10 % 70% 30% 0% 0% 0% 0% 0% 0% 0% 0% 0% 0% 100% Legend: B – broadening M – metaphor N – narrowing BI – birfurcation","S – shift L – litotes ME – metonymy SY – synechdoche","D – degeneration E – elevation EU – euphemism H – hyperbole 286 "," The data on Table 1 revealed that the Cebuano words underwent semantic change in written and spoken data differently. With regard to the data taken from Bisaya magazine, metaphor (70%) was commonly-used while in the words based on the spoken data, widening (60%) was frequently-used. ","Based on the data from Bisaya, metaphor was frequently-used because Cebuano writers most likely used figurative speech such as metaphor in capturing the attention and building the readers’ interest. The Cebuano writers who were interviewed also used metaphors to let the readers understand the text easily, to show the relationship that exists between the people, to raise a higher level of thinking, and to clearly express the ideas.  This study supports Campbell’s (1998) theories of linguistic change that refers to the external factors such as the expressive uses of language, and the positive and negative social evaluations.  Concerning the spoken language, widening was the dominant semantic change. This result could be attributed to the Cebuano speakers’ expressive use of the language by broadening the original meaning of the word into a more expressive way of conveying the message to the listeners. Language contact (e.g. Spanish colonization which caused the borrowing of the word chica), social conventions (e.g. papa), technology (e.g. Kodak), religion (e.g. Judas), expressive use of language (i.e. berde ug dugo) could account for the linguistic change among the Cebuano words.  Furthermore, based on the analyzed words from Bisaya magazine, all selected words underwent semantic change through widening due to Cebuano itself since Cebuano language is playful and rich in providing meanings of the words used in written language in order to be appreciated by the readers of any literary works.  On the one hand, the two (2) analyzed Cebuano words which were evident in the spoken language such as ‘berde’ (i.e. is derived from the Spanish word ‘verde’) which means ‘green’, that is, an example of metaphor in spoken language; and the word ‘magtsika’ (i.e. is derived from the Spanish word ‘chica’ which means ‘girl’) that demonstrates broadening (i.e magtsika ta which means ‘let’s talk’) underwent semantic change because of Spanish-speaking colonizers who first introduced Spanish to the Cebuano speakers in Cebu province. To illustrate, instead of focusing on the literal meaning of the color green in the word ‘berde’ in the phrase ‘berde ug dugo’, the meaning was changed into ‘gay’ or ‘homosexual’. Hence, broadening and metaphor were the frequently-used types of semantic change of the selected Cebuano words found in the written text and spoken speech. "]},{"title":"4. Conclusions  ","paragraphs":["In determining the types of semantic change of the selected words in Cebuano, the results revealed that in the written text, metaphor was frequently used while broadening was the predominant type of semantic change in the spoken language.  Metaphor was predominantly used by the Cebuano writers to clearly express the ideas, let the readers clearly understand their points, and raise the readers’ thinking into a higher level.  Broadening was usually used in the spoken data due to various reasons such as language contact, social conventions, technology, religion, and expressive use of language. However, this study only used the twenty (20) selected Cebuano words as the data for the analysis. A replication of this study is recommended using discourse analysis of the spontaneous speech of 287  the Cebuano speakers who interact with their fellow native speakers of Cebuano to validate the results of this study.  Hence, this study is consistent with Campbell (1998) and Crowley (1997) studies that metaphor and broadening are the common types of semantic change. However, this study did not provide evidence of the other types of semantic change due to the limited number of Cebuano words. "]},{"title":"List of References ","paragraphs":["Adeva, F. M. 2005. Mga semantic koreleyt ng pagkatransitibo sa mga kwentong Sebwano. Philippine Journal of Linguistics, 36, 101- 156.  Bloomfield, L. 1933. Language. New York: Holt, Rinehart, and Winston.  Campbell, L. 1998. Historical linguistics: An introduction. London: Edinburgh University","Press.  Crowley, T. 1997. An introduction to historical linguistics. Oxford: Oxford University Press.  Flores, O. 2005. Ulahing panag-uban. Bisaya, February 2: 17 & 23.  Gallardo, A. 2004. Pres. GMA, gipalabi ang usa ka kinabuhi kaysa mga pagsaway ug kaakohan","sa America ug ubang nasod. Bisaya September 1:10.  Gonzalez, A. 2004. Applied linguistics and language teaching in the Philippines: Theory and","implications. Philippine Journal of Linguistics, 35, 69-74.  Lape, E. 2004a. Ang biyahi sa kasingkasing nga nangita sa matuod nga kalipay. Bisaya","December 22:3-15.  _________. 2004). Unsay purohan karong eleksiyon sa mga artistang kandidato. Bisaya February 4:10.  Lising, L. 2004. A comparative analysis of enclitic adverbs in Cebuano and Hiligaynon.","Tanglaw, 10, 77- 98.  Monternel, F. 2004a. Nganong dunay mga tinagoan sa kinabuhi nga dili mapasabot sa","tawhanong kaalam? Unsa ba gayoy misteryo sa kamatayon sa usa ka tawo? Bisaya November 3:11-17.  __________. 2004b. Pagduaw. Bisaya, November 3: 11.  Trask, R. 1994. Language change. London: Routledge.  Reyes, G. 2004a. Ang iring u gang kagabhion. Bisaya December 1:3.  _______. 2004d. May baybayon ang pikas bahin sa lawod. Bisaya February 11:3.  Vaño, R. 2004. Hinulamang kadaogan. Bisaya December 15:4-5.  Ward, J. 1971. Philippine linguistic studies: A bibliographic survey of the coverage in the","literature. Philippine Journal of Linguistics, 2, 91-115. 288 ","Wolff, J. 2001. Cebuano. In Jane Gary and Carl Rubino. (Eds.). Facts about he world’s languages. New York City: New England Publishing Associates, Inc.  Ybañez, J. 2004. Pinaskohan. Bisaya, December 29: 11.  Zorc, R. D. (2004). Semantic reconstruction in Austronesian linguistics. Philippine Journal of Linguistics, 35, 1-21.                   289"]}]}