{"sections":[{"title":"","paragraphs":["Computational Linguistics and Chinese Language Processing Vol. 11, No. 3, September 2006, pp. 281-296 281 © The Association for Computational Linguistics and Chinese Language Processing [Received February 16, 2006; Revised August 11, 2006; Accepted September 5, 2006]"]},{"title":"Tonal Errors of Japanese Students Learning Chinese: A Study of Disyllabic Words Ke-Jia Chang","paragraphs":["∗"]},{"title":", Li-Mei Chen","paragraphs":["+"]},{"title":"and Nien-Chen Lee","paragraphs":["+"]},{"title":"Abstract","paragraphs":["To foreigners, how to manage tone is the greatest challenge in learning Chinese. What causes foreign students to be unable to distinguish different tones is the phonological system of their native language. The accent in standard Japanese (Tokyo dialect) is distributed in the pitch change within each syllable, and the first syllable must be the opposite of the second in accent. The discrepancy between the tonal production of Japanese students learning Chinese and that of Chinese native speakers was investigated in this study. It is found that the two Japanese students in this study made the most frequent mistakes in reading Chinese disyllabic words when the first syllable was tone 2 or tone 3, and the tonal errors were mostly found in disyllabic words with tone combinations of 2-1, 2-4, and 3-4. We also found that in Group B (2-1, 2-2, 2-3, 2-4), whatever the original tones were, the two subjects always mispronounced them as 2-3. This is primarily attributed to the fact that, in Japanese, only one pitch peak is allowed in disyllabic compounds. Keywords: Japanese Students Learning Chinese, Disyllabic Words, Tonal Errors"]},{"title":"1. Introduction","paragraphs":["One of the most distinct features of Chinese is tone, in which each syllable has its own fixed tone, including both high-low distinctions and rising-falling variations. The acoustic characteristics of tones are mainly determined by pitch value. Tones are relatively defined. This so called “relativity” is the stability of pitch within the pitch range of an individual speaker.   ∗ Graduate Institute of Teaching Chinese as a Second Language, National Kaohsiung Normal University, Kaohsiung, Taiwan + Department of Foreign Languages and Literature, National Cheng Kung University, 1 University Rd., Tainan, Taiwan. Phone: (06)2757575 ext 52231 E-mail: leemay@mail.ncku.edu.tw The author for correspondence is Li-Mei Chen.   282 Ke-Jia Chang et al.","Some educators have suggested that Chinese learners could compensate for their tonal errors by practicing monosyllabic words. Yet, in actual classroom settings, it is found that the practice of tone combination is more important, especially that of disyllabic words. This is because both the learners and teachers often neglect the collaborative pattern of tones in spontaneous speech, such as the rules of tone sandhi and the patterns of tone combination. Language teaching should aim at a definite goal, and the teaching of tone combination ought to be focused on disyllabic words [Zhu 1997]. Zhu’s argument is grounded in the following two reasons. First, almost all combination patterns of monosyllabic words in spontaneous speech are included in disyllabic words. Therefore, disyllabic words could be regarded as the foundation. Second, modern Chinese is mostly made up of disyllabic words. Practicing disyllabic words could solve most problems in tone combinations.","The changes of Chinese tone in connected speech pose a serious problem to Chinese learners. It is also found in classroom settings that Japanese students often stumble in communication because of their tonal errors. This paper studies the phenomenon of tonal errors in disyllabic words made by Japanese students learning Chinese, particularly in finding which tones these errors mostly occur in. It also investigates the negative transfer effect of the Japanese accent in learning Chinese tones by Japanese students, for the purpose of making certain contributions to Chinese pronunciation pedagogy."]},{"title":"2. Literature Review 2.1 The Phonetic Features of Chinese and Japanese","paragraphs":["In Chinese, each syllable has its fixed tone. The high and low, falling and rising pitches depend on the vibration rate of the vocal cords (Figure 1). The constitution of Chinese tone is not determined only by pitch level, but also by transition patterns. There is a level tone, a rising tone, a falling tone, and a falling-rising tone which are caused by change in pitch. In addition to pitch, the intensity and duration of sound are also relevant to the make-up of the tone. Intensity indicates the weight or strength of a sound. For instance, the neutral tone in Chinese is related to sound intensity. The easiest and the most effective way to transcribe and record tones is the system of tone-letter proposed by [Chao 1968]. It classifies tone pitch into five degrees, and divides a perpendicular line into four parts to signify the particular location of the tone pitch on the scale. The low, mid-low, middle, mid-high, and high pitches are indicated by the numbers 1 to 5 respectively. The accurate tone-letter of each tone is represented by the high and low pitch, the rising and falling pitch, or the fluctuation of pitch. In a Chinese disyllabic phrase, the tones of the first and the second words are compromised for the sake of being euphonious [Wu 1992]. It is natural to make the pitch in the second syllable lower than that in the first. Take a disyllabic word with two rising pitches for example, the   Tonal Errors of Japanese Students Learning Chinese: A Study of Disyllabic Words 283 second rising pitch turns into low-rising (Figure 2). In a disyllabic word with two falling pitches, both syllables are lower due to the mutual influence of these two falling pitches (Figure 3)."]},{"title":"Figure 1. Frequency of calibration   ","paragraphs":["Nian Nian"]},{"title":"Figure 2. Word of tone 2-2 (年年, year-year) pronounced by the Chinese native speaker. (The blue line signifies tone.)  ","paragraphs":["Jheng Jh"]},{"title":"Figure 3. Word of tone 4-4 (政治, politics) pronounced by the Chinese native speaker.","paragraphs":["In Japanese phonetic features, accent bears the closest relationship to Chinese tone. There are two types of accents in the languages of the world [Hiroshi 2003]. One is “stress accent”, which uses the intensity of sounds to differentiate various lexical items. The other is “pitch accent”, which uses the pitch of sounds to distinguish one word from another. Japanese   284 Ke-Jia Chang et al. is classified as pitch accent language (termed as “accent” in the following sections). According to several researchers [Wang 1997; Jun 2001], the Japanese accent can be classified into two types--flat and non-flat. Wang also mentioned that some moras in Japanese must be pronounced with high pitch, and some with low pitch. “Mora” in Japanese means the duration of a sound. The accent in Japanese displays in the mora instead of in the syllable. For example, the word “shinbun” (news) has two syllables but four moras.","The difference between flat and non-flat type lies in the existence of the accent. The accent means there is a transition from high to low pitch in a word. The flat type does not have the accent whereas the non-flat type does. Falling type can also be classified into three patterns—H-L, L-H-L, and L-H. In the Compact Japanese-Chinese Dictionary [Liu et al. 2002], pitch change is illustrated by ◎, 1, 2, 3, 4, 5 at the end of the word. ◎ means that the first mora is pronounced with low pitch and the remaining moras are produced with high pitch, which may spread to the subsequent auxiliary. This is the flat type, such as hashi (chopsticks), and tomodachi (friend). 1 means the first mora is pronounced with high pitch whereas the subsequent with low pitch. This tone falls into the H-L pattern, such as neko (cat). 2 means that the first mora is pronounced with low pitch, the second with high pitch, and the subsequent with low pitch, including the following auxiliary. The words composed of two moras in this tone belong to the L-H pattern, while those composed of three or more moras belong to the L-H-L pattern, such as kawa (river) and nomimono (beverage). 3 means the first mora is pronounced with low pitch, the second and the third with high pitch, and the subsequent as well as the following auxiliary with low pitch. Words composed of three moras of this tone fall into the L-H pattern, while those composed of more than four moras belongs to the L-H-L pattern, such as otoko (man) and mizuumi (lake). 4 means that the first mora is pronounced with low pitch, the second to fourth with high pitch, and the subsequent with low pitch. Words composed of four moras in this tone belong to the L-H pattern, while those composed of five or more moras follow the L-H-L pattern, such as otouto (junior brother) and watashibune (ferry boat). 5 means the first mora is pronounced with low pitch, the second to the fifth with high pitch, and the subsequent mora with low pitch. In this tone, words with five moras belong to the L-H pattern, while those composed of six or more moras use the L-H-L pattern, such as oshougats (New Year) and tansangasu (carbon dioxide).","According to the patterns stated above, the accent in standard Japanese (Tokyo dialect) has the following characteristics. First, there can only be one part with high pitch in a word (with one mora or several consecutive moras). Second, the pitches of the first and the second moras must differ. If the first mora is pronounced with high pitch, the second one must be with low pitch. In the same way, if the first is with low pitch, the second must be with high pitch. Third, the pitch change in the first and third tones in Chinese does not occur in the Japanese accent.   Tonal Errors of Japanese Students Learning Chinese: A Study of Disyllabic Words 285","The Japanese accent and Chinese tone seem to be represented by pitch change. In Japanese, the accent is represented in the pitch change of each mora within a word. The basic component is a mora. However, in Chinese, tone is displayed in the pitch change within each syllable. The basic unit is a morpheme. There are four basic tones in Chinese (except for the neutral tone)—the high-level tone, mid-rising tone, low-falling tone, and high-falling tone. In terms of tone values, they are marked as 55, 35, 214, and 51 respectively (Table 1)."]},{"title":"Table 1. The diacritics in the system of tone-letter designated by [Chao 1968]","paragraphs":["tone types","Yinping (High-level) Yangping (mid-rising) Shangsheng (falling-rising)","Qusheng (high-falling) tone values 55 35 214 51 examples mā má mǎ mà duration mid-short mid-long longest shortest  "]},{"title":"2.2 The Tonal Errors of Japanese Students Learning Chinese","paragraphs":["There are three common errors made by Japanese students in learning Chinese [Zhu 1994]—flat tone, mispronunciation of multi-syllabic words, and stress of the neutral tone. Many Japanese students of Chinese pronounce disyllabic words in Chinese with rising-falling tones, regardless of their original tones, such as changing “chun1fong1” (spring breeze) to “chun2fong1” (pure breeze), and changing “fang1bian4” (convenient) to “fang2biang4” (room convenient). The cause of this mispronunciation is related to the “euphonic change” in Japanese. Whatever the original pitch pattern is, when two words are combined into one lexical item, only the L-H-L pattern is allowed. For example, the original pitch of “waseda” belongs to the H-L pattern while that of “daigaku” (university) the L-H pattern. When these two words are combined, the pitch of “wasedadaigaku” (Waseda University) turns into the L-H-L pattern. This is because in Japanese, there cannot be two pitch changes in one word, which means that only one pitch peak is allowed in Japanese compounds.","It is very difficult for Japanese students to distinguish tone 3 from tone 4, tone 2 from tone 3, and tone 2 from tone 4 in Chinese [He 1997]. They easily mistake tone 3 for tone 2.    286 Ke-Jia Chang et al."]},{"title":"3. Methodology 3.1 Subjects","paragraphs":["The subjects in this study were two Japanese students with a basic-intermediate level in Chinese. Both of them were from the Chinese Learning Center in National Sun Yat-sen University and had studied Chinese for three to six months. Subject X had better Chinese ability than subject Y. There was another subject Z, whose native language is Chinese, serving as the control group in this study. All subjects were required to read out the disyllabic words listed in the word chart in the same manner."]},{"title":"3.2 Procedure","paragraphs":["This study is divided into three parts. The first part is to make real-life interviews so as to collect natural data to supplement the word chart. The second is to ask the subjects to read out the disyllabic words in the word chart. In order to maintain the objectivity of this research, the word chart is divided into two lists, A and B, in which the contents are completely the same with only different arrangement of the order. The design of the word chart primarily follows that of [Zhu 1997]."]},{"title":"3.3 Design of Word Chart","paragraphs":["There are four tones in Chinese. If all four tones are arranged into disyllabic words, sixteen combination pairs are retrieved. Including the neutral tone, there are twenty possible combination pairs. In this study, these twenty pairs are divided into five groups--A, B, C, D, and E. The number 1, 2, 3, 4, 5 represent the high pitch, rising pitch, falling-rising pitch, falling pitch, and neutral tone, respectively, as illustrated below.  A:1-1、1-2、1-3、1-4 B:2-1、2-2、2-3、2-4 C:3-1、3-2、3-3、3-4 D:4-1、4-2、4-3、4-4 E:1-5、2-5、3-5、4-5 ","To avoid expectation of a pattern from the subjects, each group in the word chart has been rearranged. The word chart has been supplemented with Chinese phonetic symbols (bpmf) and all the disyllabic words listed come from basic vocabulary. Before the recording, the subjects were familiarized with the demo word chart with no time limit, and were not   Tonal Errors of Japanese Students Learning Chinese: A Study of Disyllabic Words 287 informed of the correct pronunciation. During the formal recording, if the subjects made any mistakes, they were allowed to self-correct with assistance from others prohibited. The third part of this experiment was to ask Chinese native speakers to take auditory tests and pick up the tonal errors of subject X and subject Y. The tonal errors were analyzed with the phonetic analysis software PRAAT."]},{"title":"3.4 Methods of Analysis","paragraphs":["First, we identified the tonal errors made by subject X and Y in pronouncing these five groups of sounds (A, B, C, D, E), and judged which subject had the most errors. Then, we investigated the ratio of tonal errors of these two Japanese subjects in each group of sounds to draw a comparison to the tone production of Chinese native speakers."]},{"title":"4. Results and Discussion 4.1 Ratio of Tonal Errors","paragraphs":["From Table 2 we can see that the tonal errors of Subjects X and Y are mostly concentrated in the sounds in Groups B and C. In other words, they are mostly compounds consisting of a first syllable that is tone 2 or tone 3."]},{"title":"Table 2. Ratio of tonal errors of subjects X and Y","paragraphs":["Second Syllable  First syllable "]},{"title":"1 2 3 4 5(E)","paragraphs":["Subjects X Y X Y X Y X Y X Y 1(A) 0.333 0.333 0.2 0 0.3 0.3 0.149 0.285 0.2 0.2 2(B) 0.4 0.8 0.25 0.75 0 0.5 0.4 1 0.667 0.333 3(C) 0.375 0.375 0.286 0.625 0 0.5 0.4 0.8 0.25 0.75 4(D) 0.333 0 0.333 0 0.167 0 0.2 0.4 0 0","Since the two subjects do not have the exactly same Chinese background, the ratio of tonal errors is compared with their individual average number. The ratio of tonal errors of subject X is 0.336 on average whereas that of subject Y is 0.4. Therefore, for subject X the ratio of tonal errors of more than 0.33 is high, while for subject Y 0.4. In the sounds of Group C (3-3), the ratio of tonal errors of subject Y appears high, which may imply that the subject has not been fully acquainted with the rules of tone sandhi.    288 Ke-Jia Chang et al."]},{"title":"Table 3. Ranking of ratio of errors in subjects X and Y","paragraphs":["Ranking of ratio of errors in subject X Ranking of ratio of errors in subject Y 1. 2-5 1. 2-4 2. 2-4、3-4、2-1 2. 3-4、2-1 3. 3-5、2-2 4. 3-2 5. 2-3、3-3","Although it is hard to see the similarity in distribution from the ranking of the two subjects’ ratio of tonal errors (Table 3), two interesting phenomena are found. First, by comparing their high ratio of tonal errors, it is shown that there is overlap in 2-1, 2-4, and 3-4. Second, the ratio of errors of 2-3 and 3-3 are the same in both subjects. The similarity of the results obtained from these two groups is mainly contributed to the fact that the tone sandhi of 3-3 is 2-3. However, the ratio of errors of subject Y in pronouncing 3-3 reaches as high as 0.5, which indicates that he has not yet fully managed the tone sandhi rules. What follow in the next section are individual tonal errors in each tone combination group."]},{"title":"4.2 Tonal Errors in Each Group Table 4. Error patterns of Group A in Subject X","paragraphs":["Standard 1-1 1-2 1-3 1-4 Mispronunciation 1-4 2-2 2-3 4-4"]},{"title":"Table 5. Error patterns of Group A in Subject Y","paragraphs":["Standard 1-1 1-2 1-3 1-4 4-2 --- 1-3/(1-2) 1-1 Mispronunciation 1-1 In Group A, we discover the error pattern of “rising falling tone” in the corpus of subject X, in which 1-2 and 1-3 are mispronounced as 2-2 and 2-3, respectively (Table 4). It is also found both subjects often mispronounce the first tone as the second or the fourth, as was indicated as a common error made by Japanese students [Chao 2003]. Subject Y always mispronounces 1-4 as 1-1 (Table 5). It is assumed that the subject is unable to articulate the fourth tone while the pitch of the first syllable remains as the first tone (Figures 4 and 5).   Tonal Errors of Japanese Students Learning Chinese: A Study of Disyllabic Words 289  Chejhan (Subject Y) 1-4 1-1(mispronounced)"]},{"title":"Figure 4. Mispronunciation of “chejhan” (車站, train station) by subject Y  Figure 5. Pronunciation of “chejhan” (車站, train station) by the Chinese native speaker Table 6. Error patterns in Group B in Subject X","paragraphs":["Standard 2-1 2-2 2-3 2-4 1-1 2-3 --- 1-4 Mispronunciation 1-1(2-2) 3-1(2-1) 1-4"]},{"title":"Table 7. Error patterns in Group B in Subject Y","paragraphs":["Standard 2-1 2-2 2-3 2-4 1-1 1-1 1-2/(1-3) 1-4 2-3 1-1/(2-2) 1-3 1-4 1-2/(2-2) 2-3/(2-4) 1-2 1-4 1-2 Mispronunciation 2-1","In the sounds of Group B, both subject X and Y mispronounce tone 2 as tone 1 (Tables 6 and 7), but with lower pitch than that of the native speaker. It is also found that the tone of the second syllable is mispronounced as well. In the sounds of Group B, there are four sounds of which the first syllable is correctly uttered but the second is mispronounced (if the rectified productions are not taken into account). For example, 2-2 is mispronounced as 2-3 by subject X and 2-1 as 2-3 by subject Y, 2-2 as 2-1 and 2-4 as 2-3. According to the findings above, both subjects make frequent errors in mispronouncing the sounds in Group B as 2-3. This is because in the Japanese accent only one pitch peak is allowed in a word, and after a high pitch   290 Ke-Jia Chang et al. there will only come a low pitch. It is rather difficult for Japanese students to maintain high pitch after the end of the second tone in 2-1 (Figures 6 and 7).  Meihua (Subject Y) 2-1 2-3 (Mispronunciation)"]},{"title":"Figure 6. Mispronunciation of “meihua” (梅花, rosette) by subject Y  Figure 7. Pronunciation of “meihua” (梅花, rosette) by the Chinese native speaker Table 8. Error patterns in Group C in Subject X","paragraphs":["Standard 3-1 3-2 3-3 3-4 2-1 3-1 ---- 2-1 4-1 3-3/(2-3) 2-4 Mispronunciation 1-1/(2-1)"]},{"title":"Table 9. Error patterns in Group C in Subject Y","paragraphs":["Standard 3-1 3-2 3-3 3-4 4-1 2-3 1-3 2-1 1-1 1-2 1-3 2-4/(2-3)/","1-3 1-1 1-1/1-2 1-3 2-1 2-1 1-4 Mispronunciation 2-2/1-1","In Group C, tone 3 of the first word is often mispronounced as tone 1 or tone 2 (Tables 8 and 9). Judging from the ratio of zero error of subject Y in pronouncing 3-3, the subject can completely manage the tone sandhi rules for the third tone. Similarly, it is found that subject X also has a ratio of errors of zero in pronouncing 2-3. As for subject Y, this subject’s ratios of tonal errors are both 0.5 in pronouncing 3-3 and 2-3, which indicates the subject has not yet   Tonal Errors of Japanese Students Learning Chinese: A Study of Disyllabic Words 291 been fully acquainted with the tone sandhi rules of the third tone. From Figures 8 and 9, one can see that the Chinese native speaker has a longer duration of 21 in pronouncing 214 of the sound “jhu” (self), whereas the duration of 14 is rather short. On the contrary, Japanese students have longer duration of 14 in pronouncing 214 whereas that of 21 is very short. As a result, it sounds like tone 2.  Jhujian (Subject X) 3-4 2-4(Mispronunciation)"]},{"title":"Figure 8. Mispronunciation of “jhujian” (主見, self opinion) by subject X  Figure 9. Pronunciation of “jhujian” (主見, self opinion) by the Chinese native speaker Table 10. Error patterns in Group D in Subject X","paragraphs":["Standard 4-1 4-2 4-3 4-4 Mispronunciation 1-1 ---- 1-3 1-4"]},{"title":"Table 11. Error patterns in Group D in Subject Y","paragraphs":["Standard 4-1 4-2 4-3 4-4 --- 2-1 --- 1-4 Mispronunciation 4-1","Group D has the lowest ratio of tonal errors, many of which are zero (Tables 10 and 11). Subject X mispronounces tone 4 of the first word as tone 1 most frequently, in keeping with what Zhu had proposed that this mispronunciation bears the features of rising-falling pattern. Since the tone value of the neutral tone is determined by the tone of the preceding syllable, it will be discussed in another section.     292 Ke-Jia Chang et al."]},{"title":"4.3 Ratio of Tonal Errors in Group E Table 12. Error patterns in Group E in Subject X","paragraphs":["Standard 1-5 2-5 3-5 4-5 Mispronunciation 2-5 2-1 2-5 ----"]},{"title":"Table 13. Error patterns in Group E in Subject Y","paragraphs":["Standard 1-5 2-5 3-5 4-5 2-5 1-5 2-5 ---- 3-5 1-5 Mispronunciation 1-5 Zhu has mentioned that neutral tone is often dealt with as tone sandhi in phonetic analysis as its tone values are determined by the tone in the preceding syllable. After tone 1 and tone 2, the pitch value of the neutral tone is 31; after tone 3, the pitch value is 4; after tone 4, the pitch value is 1. The duration of neutral tone is, in general, shorter. Although the pitch of the neutral tone is usually light and short, it is not invariable. The pitch of neutral tone is always changed according to what the end of preceding syllable is. A common error of subjects X and Y is the mispronunciation of 1-5 as 2-5 (Tables 12 and 13). In the following section, the researchers will investigate the discrepancy between Chinese native speakers and Japanese students of Chinese in pronouncing the neutral tone in disyllabic words.","When the first syllable is tone 1, it is found that the Japanese student has a greater degree of descent than that of the Chinese native speaker (Figures 10 and 11).  Jiejhe (Subject A) 1-5 2-5(Mispronunciation)"]},{"title":"Figure 10. Mispronunciation of “jiejhe” (接著, next) by subject X  Figure 11. Pronunciation of “jiejhe” (接著, next) by the Chinese native speaker  ","paragraphs":["Tonal Errors of Japanese Students Learning Chinese: A Study of Disyllabic Words 293","In “men” of “Renmen”, it is found that the Chinese native speaker pronounces the word with short duration whereas the Japanese student prolongs the word with the neutral tone (Figures 12 and 13).  Renmen (Subject X) 2-5 2-1(Mispronunciation)"]},{"title":"Figure 12.Mispronunciation of “renmen” (人們, people) by subject X  Figure 13. Pronunciation of “renmen” (人們, people) by the Chinese native speaker","paragraphs":["While the Chinese native speaker is pronouncing “paole”, the native speaker makes a slight rise in tone at the end of the second syllable. As for the Japanese student, the first sound is mispronounced as tone 2. Therefore, the tone shape is displayed with a descending curve (Figures 14 and 15).  Paole (Subject X) 3-5 2-5"]},{"title":"Figure 14. Mispronunciation of “paole” (跑了, have run) by subject X  ","paragraphs":["294 Ke-Jia Chang et al. "]},{"title":"Figure 15. Pronunciation of “paole” (跑了, have run) by the Chinese native speaker","paragraphs":["In the following example, it was also found that the Japanese student pronounced the second syllable with excess high pitch (Figures 16 and 17).  Na me (Subject X) 4-5 1-5(Mispronunciation)"]},{"title":"Figure 16. Mispronunciation of “na me” (那麼, so) by subject X  Figure 17. Pronunciation of “na me” (那麼, so) by the Chinese speaker 5. Conclusion","paragraphs":["This study focuses only on disyllabic words. In Japanese, there are tone variations and euphonic changes in words of more than two syllables. A rising-falling pattern was proposed [Zhu 1994] based on the pitch change of Japanese students and it was argued that regardless of the original pitch in Japanese, new compounds are always of Low-High-Low tones. The tonal errors of the two Japanese students in this current study are also similar to this pattern because of the negative transfer from the students’ mother tongue.","The tonal errors made by both subjects X and Y concentrated primarily in Groups B and C. The mispronunciation is mostly on words with first syllable of tone 2 or tone 3. Most of the errors are in 2-1, 2-4, and 3-4 tone combinations. Moreover, the ratio of tonal errors of 2-3 and   Tonal Errors of Japanese Students Learning Chinese: A Study of Disyllabic Words 295 3-3 are completely identical in these two subjects. From the tonal errors in Group C, the researchers found that the two students are confused with tone 3, tone 2, and tone 1.","In teaching Chinese tones, it is suggested that teachers could start from the pronunciation and listening comprehension of disyllabic words, instead of merely concentrating on drilling students using monosyllabic words. Teachers could first familiarize the learners with tone combinations by practicing tone variations in disyllabic words. In class, visual demonstrations such as graphs, gestures, and animated films could be utilized to help students understand tone variations. Generally speaking, whatever Chinese proficiency the students might have, they still cannot precisely distinguish different tones. Therefore, teachers should emphasize more on practicing contrastive tones to get students acquainted with the tone combinations in disyllabic words.","The authors only discuss the tonal errors of two subjects in this study. It is suggested that, in future study of related issues, more Japanese and Chinese subjects should be included to make the experimental results more representative. Moreover, tests on perceptual distinction could be added in further studies to obtain a more complete picture of the acquisition of Chinese tones.","Since the functions of Chinese tone and Japanese pitch accent differ, by means of contrastive analysis one can help teachers pay special attention to those tones Chinese learners frequently get confused, so as to make the learners fully acquainted with correct tone production in various tone combinations."]},{"title":"References","paragraphs":["Chao, L.- J., “Special Phonetic Instruction in Chinese to Japanese Students,” Journal of","Yunnan Normal University, 1(3), 2003, pp. 66-67. Chao, Y. R., A Grammar of Spoken Chinese, Berkeley: University of California Press, 1968.","He, P., “Studies in Basic Phonetic Instruction in Chinese to Japanese Students,” Language","Teaching and Linguistic Studies, 3, 1997, pp. 49-50.","Hiroshi, W., “The Theory of Japanese Stress and Phonetic Categorization,” Journal of Wu","Feng Institute of Technology, 11, 2003, pp. 283-286.","Jun, S., “Problems and Solutions of Japanese Learning Chinese Tones,” Proceedings of the International Symposium in Teaching Chinese to Japanese Students, 172. Peking: Chinese Social Science, 2001.","Liu, W.- S., J.-S. Ma, Y.- H. Tzeng, S.- K. Li, J.-J. Huang, and S.- S. Wang, Compact Japanese-Chinese Dictionary, Taipei: Tashin, 2002.","Wu, Z.- J., Introduction to the Phonetics of Modern Chinese, Peiking: Chinese Language Teaching, 1992.   296 Ke-Jia Chang et al.","Wang, S.- Y., “Japanese Tone and Pronunciation,” Foreign Languages in Fujian, 2, 1992, pp. 24-26.","Zhu, C., “Contrastive Experiments on the Suprasegmental Features of Chinese and Japanese,” Journal of East China University, 1, 1994, pp. 85-86.","Zhu, C., The Strategies of Foreign Students for the Phonetic Learning in Chinese. Peking: Language, 1997. "]}]}