{"sections":[{"title":"","paragraphs":["The Structure and Process of Talking About Doing James A. Levln and Edwin L. Hutchins","Center for Human Information Processing University of Callfornia, San Diego","People talk •bout what they do, often •t the same tame a• they are doing. This reporting has •n important function in coordinating aotlon between people working together on real eve~/day problems. Zt is also •n important acts'ca o£ data for social scientists sttu~ylng people's behavior. Xn this paper, we report on some •tudle• we are doing on report dialogues. We describe two kinds of phenomena we have identified, outline a preliminary process model that int•grat•• the report generation with the processes that are generating the actions being reported upon, and specify a systematic methodology For extracting relevant evidence bearing on these phenomena t~om text trenscrlpts of talk about doing to use in evaluating the model. ~OZW~W Reports of problm solving actions are often used a• evident• about the und•rlying cognitive processes involved in generating a problem solution, as \"problem solving protocols\" (Howell & Simon, 1972). However, these reports ere obviously a kind of language interaction in their own right, in which the subject i• reportlns on hls/hor own actions to the experimenter. We have analyzed problem solving protocols of people solving a puzzle called \"Hlsslonaries and Cannibals\" and have found that in their report•, people adopt • • point or view\" with respect to the problan, through • con•latent use of spatial detxts, For example, when a subject lays: \".., X can't send another cannibal across with another alssioflary or he will he outnumbered when he gets to the other side .., \" the deixis In her report places her as speaker off the • from\" side of the considered action, This is indicated both by the choice of the verb \"send\" and by the description of \"the other side\". ?he same suhjeot indicated the \"to n slde as her point or view in another part or her protocol: \",..'cause you've gotta have one person to hri~ back the boat...\" 4 Here, both the verb \"bring\" and the adverb \"back\" indicate \"point ot view\".","Although people almost always unmmbiguoualy specify • \"point of view\" within the problem they are solving in their reports, they also deny awareness of takAn| such • point cF view, However, this point or view is important to the underlying problem solving procesmas. The strongest evidence for this comes ~om the hi|h correlation ~etween Point or view and errors in problem solving actions. Subjects in the ~tlsslonarles and Cannibals task can make errors by Cabin| actions that violate the constraints or the task. Host of these errors occur on the side away frm their current \"point st view\", even theuah their point of view changes From one physical side to the other during the course or solving the punle, mre interesting is that most of the \"undetected\" errors emcur on the side •way from their point or view. Some errors arm spontaneously detected by the subject ~mmediately otter askant the action that leads to • violation! others ere \"undetected\". After the experimenter interrupts topolnt out these undetected errors, the subjects often switch point of view so that the violation condition is now on the same side a• the subjects' point of view.","We see the point of view indicated by •patlal delxls In the report of problem solving as reflec~ir~ an underlying allocation of effort (or attention). Pew errors occur with problem elements that •re given processing effort, while constraints that •re given little attention are more often violated. %n this way, these reports are reflecting changes Zn the organization of the problem element• that occur over the course of reaching a solution. We have also identified other ways in which report• embody the use of different conceptual organizations of the problem, including org•nlzatlons that vary from abstract to concrete and from perception oriented to action oriented. JUSTZrZCATZON~~","There •re multi-utterance structures that occur regularly in problem solving talk that we call • justltAoatlon argument structures.\" These structures have the form of: (did ) (do ) (since ) (could)+(not do)+(aotion).(bsc•use)->(Justitloatlon (will) argument) (Alternatively, these two segments san he reversed in order, by using connectiv•s like \"theretora\" or \"so\".) For example, these kinds of dialogue units occur in many ot the protocols studied by Newall & Simon (1972): \"hen letter has one and only one numerical value ,e. '([: One numerical value.) There are ten different letters and each of them has one numerloal value. Therefore, Z san, iooklng at the Wo D's each D is 5; therefore, T is zero.\" (Hewell& 8Amen,"]},{"title":"1972:230-231)","paragraphs":["Zn studying our problem solving protocols tram the ~tseionarles and Cannibals puzzle, we have Identltied several kinds of argument structures, depending on what kinds of problem solving approach ••oh subject took to the problem at each point An time. For example, one common justification argument structure is the • elimination cf alternative•\" struntur•: All av•Llabte aotlons A. From this state except A i can be ruled cut. Therefore-do actlon A i, Here is an-example of this Mind of argument struSture: • ... %f Z put a cannibal on, then he gee• hack and the guys on the other side of the river, the misslcnary, is outnumbered and he will be eaten. Zt % put on .... this is all my oonbinatioa• and permutation• .... 2t Z put ton mission•flea on, Z wan two cannibal• on the boat and send them back, then At As Just ridlculou• •t the other end .... so what %'11 have to do As one ot eenh.\"","Another argument rcrm Is one we call \"prapatio ark,sent\". (We have borrowed many or our naaes for 79 arlmemt etruoturoe Prom a rhotor%o boo~ (Perelmsn & O%hreohta-Tyteea, I~5g).) Altho~h 5hie book Ln I \"noru51vo\" aooount oF erlmentatLon, we PLnd £t valuable ae a ~Ado to our atSempt ~o l~VO i deaerlptlve aooount or naturaAly eeeurr~ng %nFomal \"or|lentat¢en\" eoe~rr%n| An our eub~eoto' reports oF theAr problem eolv~ng,) ?he prqitAe er|~mente %at MAng lOt%on A would Lead to relult R (Imonll ocher ~hlnSe). ROltA~t fl Le undoeLrlble. Therefore don't do aotlon A.","enemple Prom our pretooole lot 0,,, Hoth ~LeeAonar£ea are IO£ng 5o have to eema boom beoauee. 'oauea %T 5hey don't eemo booM, veil, one ~e~d pt left and eaten. So beth mAeeloaar~oe oeme book.... \" One XntoreatAng ~Ant about 5h~a ~rt~e~ar example %8 5hat ~t %e embedded wlthAn an \"el~mlnatAon of alternat£voo\" arll~Nnt etruoture. The5 %a, 5hAm \"prqitAo arluaent\" 18 used 50 el~aAnaSe one oF 5he alternatives, leav£ng only one 50 5eke.","A third kAad oF arguaen5 atruoSure we have ideaS%Fled 18 railed \"ende-moane\"t %P erase S oooure, then there ~e an aotAen A to set 5o seal O. ?herefore eesamLAah orate S am a eubleal. for exemplar \"... 3e Lr ever % oould |e5 ~hoee ever 5here, % Obviously, 5ham ar|wJent Fern %o similar 50 5he olaJe%o \"means-ends oflalye£o\" proposed ae ~rt of many serpent 5hear%re oF problem aolv%ng. The arlmmon5 Peru we hive identified bOOer v~en oIPCIAn k~ndo ot underlying oolnit%ve prooeeoing Is IoLng on, end thAI ~,~nd oF protooo% 5ext h~e been Ulld ll evLdonoe for 5his ~ndorXying prooeaming. Some people have lllUmOd t~H|5 5hal ~nd of languap Anteraotion oorreepondo to a euboea of 5he underly£n8 prooeseee (Nevoll i SAmon, ~973). Other people have questioned whether there %e any oorreapondenoe between vha5 people do Imd what 5hey say (NLsbett & ~llmon, 1977). Our position le 5hat 5here %e a Fairly rieh ~nSereoSien between motion and report o~ aot~cn, mioh we will doeorihe %n our report OF our prel~m~ary proaese node/, of doing and rlportinl. (This poeitinn %8 oin£1or 5o one outlined reeently hy Rrloeaon ~ SAmoa (1979).) A ~a~csaa ~ O~ nn~aq AH~ ~L~","He have been oonatruotlng a proeeee model oF problem solving ~thin an aot~vatlon preeemo ~unevork (Seven, 1976; 1970). ~15hAn 5hie FremevorK, nultAple proneness are 8%nultaneoue~y aot/.ve, end 5he 5he %nteraoC~ona between 5he aatlve prooeasea %o epeo~tAed by 5heir re~eeonCotiona %n a netvorM otruotur~ %one term memory. Emoh prooeoe %e so+lYe a oct+sAn aununS, with a oor~aAn smotmt oF nalIAenoln, and ~he more oaIAent a preoeaa As, 5he lar|er %5e %npae5 on oSher presences (and therefore on the overall prooeaoLng).","There ere prooeleee tha~ ere oloeely relltld ~O the ~r~romnoe oF 5he problem tooK, lad o~here tt~c are oZoeely related to the report of the task aoClona. ~n the psr~lo,,~ar problem demean of the H~aeionsr£ee and CannLbae8 pusxle, 5he ~aek POliCed ao~Lonl and obJeo~e are defined as oonoopco An the long 5emnemory thaC beoome aoClve durlng the ?rob/.em solving. The oonsCrl£n58 of 5he problem ape represented Ln 5he name way, and leC aoSivoSed 5o varying delrwee during 5he problem so/.v~ng. ~-roro ooour when the oonacre/.n~e are %neutrlolenC%y 8aAAenC to prevent an notion wh£oh landl ~o a v~o/.oS/.on oF 5ha& oonecraAnC.","Report related proeeaeoe impost 5he tao~ behavior by mod%Fy£n| 5he distribution o~ lelAenoe 5o 5he 5ask related proneness, \"Point oP v~ew\" of 5he problem lOlver hll L51 Ampeo~ on the presses%n| by add%n| ealAenea 5o 5hose ooSAvo eonoopte Jesse%sand ~th looatLon where the problem ~lver ham oonooptuaLly looated hAmthereelF, ~uet%P%eat%on arjUmlmt etruoturea"]},{"title":"l~l~lirly","paragraphs":["Ampao5 5he d%etr%butAon of emlAenoo by ~noreao%ng 5he sa%%enoe st or 5.see LnFerenee prooealol defined to be 8llJOO£lted wAth the arlumen5 structures. ~n 5h~e ~sy, ~aKua|e san lad 5he problem solving, by addle| 50 5he roeouraoe of 5he 5nAked soon5 proooeaeo, %t ann sees h~nder %t %t looks the problem solver into a psrtAoular orlenLutLon oF the problem 5hit %On't f~U~tFul, rap example, to 5he extent 5h~t llmlus|e use Foouaeea eaIAenoo sway From oonetrlAntl t~5 ire"]},{"title":"beL~J","paragraphs":["v%olated oaul~ng effete, end elpoOLlALy LF 5hAl ooourl to euoh In extent 5ha5 5hone IPrOrl Ire undeSeoSed, thin the FoOUSlL~ll eFFeot oF languilo elm be l bert%It 5o solving the problem.","80 tar, we have deoor%ba none phenomena ve Mve observed In our solleetion or problem solvlM reports, and also m prel~,,%nary proooea model st problem eo%v~nJ aat~on and report, How san we use sup data 5o evalu|te our model?","?here are Ray Levels oF evaluative tent:Leg that we could use. At one extreme, 5heor4eo sin be strongly evaluated by doriv:Ln| prodAot~ono Prom 5hem of' epoolF:Lo da5a, vhAoh Le 5hen eo%leo5ed. I~peo~ally when 5he prod:Late4 da5a are unexpeotedt th:Lo prov:Ldee a r~Joroua 5net OF s theory. At another extreme ~0 a \"ouFtAo~enoy teacn (Howell & 81mona 19TO), A model oF an orpn£mD porform.'Lnl name tael¢ pasha 5he euf'Fio%enoy 5on5 %F Lt aloe san perForu ohm name tank. Than %e the evaluatAon 5eat oemmon%y used today For strafe.sial AntelIA|enee models. A more r~l;orous 5eat %e 5n Cry to F~.5 a mode/. 50 • emma OF data. ?hAs ~e the evaluate.on 5eahn~quo moot often UJld today An evaluat~,ng ooln~tlve poyoholo|y 5hoor~ea. A Fourth Ceo~lqua %e to %denSity a set of \"or£cioxl\" phenomena In 5he data spinet MtAoh to evaluate a mode% OF the5 data, AI ~lluotratod ~.n the liJ~ below, th:Li £s a more powerful evaluation teoiutique 5hit e~nple euFt~o£enoy, but lees povorF~ 5hsn 5he other two 5eohnLquee. Vo Fee). 5hat It 5has point In 5he scats OF the opt, 5hie te 5he appropriate evoluat~on 500hnique to use 5o evalunto our presell modll ~n IAIh5 of our dltl.","1, -qLa~in{ilqnv; DOle the nodo~, I~obel~y porFoM0 ~ke the behavior being mdollld?","2. ~ ohann~: Dose 5he model exhib15 behavior that oorreeponda to observed seleo~ed • oritioaA phenomena n An the dal~a of interest?","3. Close ~ ~ ~S ~n the model exhih:L?, beJ'dltvior that oorreeponds oAoeely to the nneo of do5o el' interest?","~, Pridln~Lon ~ uni~nia~id dlEt~| Clfl the nodv4 exnib/.5 unexpeocod behavior the5 then son be observed?","%n order 50 emtreo5 5he phenomena we hove Adent~F%ed An our data For urns Ln evaluating our model, we have boon develop:Leg sod/no 5eol~niquee 5hat are used by trained human oodoPe. Theme oodere de~eo5 and annotate the oeourrenoe OF 5hems phenomena Ln ~,rammor:Lp~e OF prob/.en solvlng &oak. For exmmp/.e, we have been able to treAn ooder8 I:o reZAsbly de~erm£ne a 80 \"point of view\" for a problem solver at each point in the problem solving from a record of the problem solving report and a record of moves made. Then, we use this extracted trace to evaluate our model of the role of point of view in problem solving. SUMMARY","We have reported here a three pronged approach to the study of problem solving action and report: I) the collected of data on problem solving and talk about problem solving, 2) development of a process model of these behaviors, and 3) use of coding techniques to extract traces of \"critical phenomena\" from the transcripts for evaluating the model. So far, we have focussed our efforts on two types of problem solving phenomena: the changes in the problem solver's organization of the problem (\"point of view\"), and systematic multl-utterance structures used to express the forms of inference used to solve the problem (\"Justificatlon argument structures\").","Ericsson, K.A., & Simon, H.A. Thlnking-aloud protocols as data: Effects of verbalization. Pittsburgh, PA: Carnegle-Mellon University, C.I.P. Working Paper #397, 1979.","Levin, J.A. Proteus: An actlvation framework for cognitive process models. Marina de1 Rey, CA: Information Sciences Institute, ISI/WP-2, 1976.","Levin, J.A. Continuous processing with a discrete memory representation. Paper presented at The LNR Confluence, La Jolla, CA: Center for Human In/ormation Processing, UCSD, 1978.","Newell, A., & Simon, H.A. Human oroblem solvln~. Englewood Cliffs, NJ: Prentlce-Hall, 1972.","Nisbett, R.E., & Wilson, T.D. Telling more than we can know: Verbal reports on mental processes. Psychological Review. 1977, 84, 231-259.","Perelman, C., & Olbrechts-Tyteca, L. The new~: A treatise on~r~. Notre Dame, IN: University of Notre Dame Press, 1969. 81"]}]}