{"sections":[{"title":"","paragraphs":["Referential Properties of Generic Terms Denoting Things and Situations Elena V. PADUCHEVA Institute of Scientific and Technical Information, Academy of Sciences of the USSR Baltijskaja 1~ 125219 Noscow Abstract","(~ene:x'ic terms cam be divided into two refercnbi:Qly different groups. Generic term oi\" l,h~ :~':i~'st group is a name (or a definite dcsc.ci.ption) of the corresponding class of Objg>(;i;:~ (of° J~ ~:.i~ U a r s in South America ~i~'f. e~j~!.!~ci.; T h e w h a I e is a mammal). i!~ fo:-g~t].er:[c terms of the second group, we p,:'opose i;o treat them as genera], terms (in ~hc sense o±' WoOoQuine).\" -they are considered -to be ~'eferentially incomplete expressions ~,~hiub.~ \"when constituting the th-eme of a ge-, nez-i~: p,:,opus:i, tton, undergo quantification which :i.s exp:t'esse(J~ explicit],y or implicit- [!.y~ inside the verb phrase° ].o Ira-trod lotion","One of the mosl, important aspects of langu~ge comp~-ehension is comprehension of ~.- e f e _~ e n c e -,- :L~e~ of a correspondence })etweez~ ~{ ~Je~itence (and some of its consbifriends) and reality, which is brought about by the speaker in the speech act. As is usual for a logical approach to language, all types of reference, with the exception of concrete reference, are reduced to quantification of different kinds, and quantification can be defined~ with a sufficient de-g:L.ee of prec:ision, by stating truth conditions fox' sentences with the corresponding quantifier° ~eanwhile generic expressions (jl.t ]:)atctJ.ou].ar~ gene'rio terms) constitute a puzzle for a theory of reference, for any i)z, oposed formulation of truth conditions for .~Jentm:l.ces with generic terms is easily refuted by contradicting examples. Thus, an attempt to reduce referential meaning of the g(me:cic indefinite article in English to 'th~vl~ of the quantifier adjective (m~de in Jespersen 1927) can be demonstra-","ted to be futile; in fact, statement (la),","for exaunple, is usually considered to be","true, while (lb) is definitely false (thougjl","and all are synonyms): (1) a. N o r v e ~ c y vysokogo rosta","w e g i a n s are tall'","n o r v e ~ c y vysokogo","'E o r b. V s e rosta 'A 1 1 tall' n o r w e ~ i a n s are","An attempt to capture referential aspects of the meaning of a generic term with the help of a \"quantifier of majority\" (Parsons 1970) or a quantifier 'usually' raay be, perhaps, successful for sentence (la), which is approximately synonymous to sentence (2): (2) N o r v e ~ c y oby~no ~ysokogo rosta","'N o r w e g i a n s are usually tall~","but the idea of majority has nothing to do","with the meaning of such sentences as (3) Kit - mlekopitaju~ee","'The whale is a m~al'","(indeed, (3) ~ (3')*A whale is.usually a","mammal); or with the meaning of sentence (4) A t o m sostoit iz jadra i elektronov","'A t o m consists of the nucleus and","electrons'.","A suggestion was made to the effect that generic terms do not refer to entities of the real world at all. Thus, according to Wierzbicka 1980, in such sentences as (1) tallness is attributed not to a norwegian (i.e. not to a real person), but to our i m a g e of a norwegian. However, this claim, even if it is true, cannot be true for all species of generic expressions. Por one thing, generic terms can occur in the context of identity sentences, cf.","(5) Deti - ~to budu~ie ljudl","'Children are men to be'. And what is identity'if not identity of reference? 501","From a formal point of view, what characterizes generic noun phrases~ at least in languages without articles, such as Russian, is the fact that they do not comprise any determiners or quantifier adjectives, not only in the explicite but in the implicite form as well. In other words, generic ~Ps evade referential characterization: no words explicitel~ expressing the m o d e o f r e f e r e n c e of a noun phrase (cf. Pa~ du~eva ].985) can occur within a ge~leric NP; moreover, no words can be added to a generic NP to ~ake clear its referential meaning or meanings, as is obvious from examples (1) - (5). The analysis which follows aims at providing generic l~Ps with such an interpreta-tion of their referential import that would match this formal characterization. Our direct aim is to provide an analysis for generic NPs of hussian, but many of the problems discussed are semantic in nature and thus language independent. 2. Generic phrases denoting situations","Generic use is co~m~zon not only for noun phrases denoting objects, like thosein (J)-~ (5), but also for noun phrases with proposi-","tional meaning, cfo (6) C v e t e n i j e r~i vsegda napominaet ~mue na~alo vojny 'F ] o w e r i n g o f r y e always reminds me of the begining of the war'.","(7) U b i j s t v o otvratitel'no 'A s s a s s i n a t i o n is abomin-","able ' . }.ioreover, generic uses are possible also","for predicative denominations of situations:","(8) It often happens that a y o u n g","man overestimates","his resources.","(9) Operation is always dangerous when","t h e p a t i e n t i s m o r e","than 70.","(lO) K e d i n e s always in a hurry°","(ll) She usually got frightened when h e","brought her flowers.","(12) R y b a ~ n i e t s golovy 'A f i s h r o t s beginning with","its head'. (13) J o h n b e a t s h i s w i f e","in the yard. Study of generic reference is usually confined to one particular class of generic 5O2 terms ~ to those denoting objects° What we claim is that at least in this case broaden~ ing the object of investigation will not complicate the whole picture; just the oppo -~ site, it may contribute to its clarification° 3. Gener:[cs as a grs~nmatical problem","Generic use is a problem not only fo:c referential semantics but also for a de~, scriptive gra~rm~ar of a language° To mention just two points°","a) In the context of a generic NP grar~,.- matical Number (i.e. the opposition of Sin.,, gular vs. Plural) cannot retain its usual meaning. Ilowever, on the one hand, the choice of ~umber in generic NPs is not rigidly regulated~ i.e. synonymous variation of Number is possible, cfo","(14) a, L o 5 a d' - umnoje ~yvotnoje","'A h o r s e is a clever animal'°","b. L o ~ a d i ~-, m~uyje ~yvo~nyje","'11 o r s e s are clever animals'° On the other hand, Singular and Plural in generic, N~s -a~ce not- Tz~el~ \"i:n-be-rcl~angeable thus, it is impossible to say","(15) U has v dome zavels'a t a r a k a n","(Sg) in the meaning 'There are cockroaches in our house', if only in the context of a \"lan&axage game\", and it is absolutely impos-. sible to use sentence","(16) ~Glaz u ~toj ryby imeet formu","g r u ~ (Pl) in order to convey the meaning 'The eye of this fish has the shape of a p~ a r'o There is a strong feeling that the choice of grsm~- matical Number in generic NPs is dependent upon their referential properties; in other words, it seems that different classes of generic NPs can be delimitated with differ~ ent requirements as for the choice of Nma~ bet.","b) Another grammatical problem connected with generic expressions, concerns the choirs ce of Tense and Aspect of the verb in a ge~ neric proposition. In Lyons 1978 it is suggested that generic propositions lie out of the scope of the Tense opposition (ice, that they are omnitemporal). Lyons claims that this thesis is not disproved by such examp~ les as","(17) D i n o s a u r s were peaceful animals , because Past Tense in such sentences corresponds only-to the fact that dinosaurs are extinct and not to the fact that they have stopped being peaceful, as would be the case if Past Tense had been used here in its usual meaningo Still for such sentence as","(18) D i n o s a u r s died out (became","ext inc t ) it would be absurd to maintain that it is omaitemporal: in (].8) Past Tense has its most com~,~on meaning° 4.. Generic term and generic proposition","The main conclusion that can be drawn from the existing literature on generics (cfo a substantial review in Carlson 1978)is that generic expessions are heterogeneous (W~ that in Russian even less information can be got from the gra~mgatical form of a generic term than in English, because of the lack of ~rt.lcles)o Thus the line of analysis Which we follow in this study consists in making a series of delimitations that would divlde generic expressions into sew.~ral dif~ ferent groups so that each statement would apply only to that group of generic expressions :for which it :Ls trne.","~'irs[ o±' all, it J.s necessary to sepaz,a-te generic NPs when used in 'the context of a generic proposition (or generic statement) from their occurrences in all otheL\" contexts. We propose the following definition: A proposition is called generic if a generic noun phrase G constitutes its n o t [ o n a 1 t h e m e (topic), i.e. if this proposition is a b o u t Go Thus, in (19)proposition is generic:","(19) P r o f e s s i o n a 1 m a t h e -","m a t i c i a n will read the book","by M.Atja with pleasure. o[ndeed, (19) is a statement a b o u t professional mathematicians° Neanwhile, (20) is not a generic statement- ~","(20) The book by NoAtja will be of inte~","res-[t for p r o f e s s i o n a 1","mathematicians . In fact, (20) is not about mathematicians# its them8 is a concrete individualized ob~","ject ~ a book by ~oAtjao Generic NPs constituting the subject of a generic proposition are more readi].y sub- ~itted to semantic analysis, for in this con~- text referential import of genericity can be represented, at least in some oontexts~ a~ a kind. of quantification. Indeed, if a generic NP is a subject of a proposition, then the quantifier which bounds this NP has maximum scope~ its scope is the whole sentence. And if so then the referencial import of this quantifier, and hence of the generic NP, can be revealed by means of truth conditions of the sentence a s a w h o i e o Otherwise, ice. in cases where the generic ~iP does not constitute ~he subject of the pro~ position, it is altogether unclear, what proposition constitutes the scope of ~he supposed \"generic quantifier\"~ Thus, for sentences in (21) logical representation is a puzzle","(21) a. Ivan can kill a b e a r o b. John doesn't like p o I i c e ~-~","men°","c° Ego zasadili v kameru ~3 m e r t -~ niko v 'He was put into the cell for m e n s e n t e n c e d L o death'","But even for generic propositions th~.'re is no unique formu].ation of truth conditi-.~ ons valid for all the contexts° To formu~ late truth conditions for gener:i.c proposJ_.--~ tions exhaustivel~ i~ :is necessary to re~. veal all relevant oppositions of contexts, linguistic and extralingaistic~ iz~ which the generic subject of a generic proposi~ tion might occur (note that the subject of the proposition need not coincide wJ.th its grmamatical subject, especially in ~lussian)o 5. Generic NPs as names of classes","In some contexts generic terms can be successfully treated as names (or descrip~ tions) of the corresponding clans. ~k~r example, generic terms used as subjects of pre-~ dicates which are meaningless unless when predicated to classes (.as to be a ir~mr!jal; to become extinct in examples (3) and (18)), are best represented as names of classes (in English such' generic terms can only be mark~- ed by a definite article~ in Russian they have no special distinctive features), Cfo","(22) Nekogda j a g u a r byl z'aspros~ra~","hen pc vsemu zerauomu ~aru","'Soi~e time ago t h e j a g u a r","was spread all over the world'° In Burton-Roberts 1976 it is c].aimed that 5O3 generic terms which are actually names o:f classes, even when [;hey occupy the thematic position in the ut;terance, do not form any generic proposition~ ~P denoting a class and referring to a class, can be treated as a term with concrete re].'erence and with no correspo.~(lJ_mg quan. tifier in the logical repre. sentatJon of [.he proposifiion in question,","It i:~ obvious l;ha6 for generic terms that are names o]' el.asses their posib[o±t in the ~mematie o~: non.-thematic part of the sen.. I;ertee is r~'i'ereattai],v iri'elevttnbo","'.James of (;].tt:i;[.~ei~ .[,u many respects resemble .:m,s~ terms (such as )va.Lbe_< , ~pe=t~., :i D--. f O:[TuA~tJ=o[ [ e to. ) : l j ke mass te±'ms, names 0]:' cla~ses a) [~.~.ve sc~l,l;ez'ed ]?ef'ez'ence and b) easily, tol_e~-,ate partitive u,~eo ~.[.zus~k , sen..- (23) La l)al'nem gostoke vodjatsj~ t i g -~ 'There are t i g e :r s in the Far does not purport to mean that a i 1 t i - g c; r' s ].iv{; in 6he ]!'~r East, exactly like t.m n<z, tence .,here z. water in B].ie Vlcln].ty does not mesa that all water is in the vicinJ By 6o 9ener:ics as ~eneral ter[lls","As .['o.r t~]e '%Jpioal\" generic expressions exemplified, e.go, by (i), (2), (4), we suggest to Breat them as g e n e r a i [, e :~' m s in the sense of Quine 1953 or Carnap 1959o Genera]. term is an incomplete noun phrase, lacking referential specifica-~ rich. it has an e x t e n s i o n , which is determined by its ].inguistic mear~ing. Usually, ~he extension of a general ~erm is an :Lnfini%e set (or at least it is a set looked ugon as infinite; in other words, it is an o p e n set); cf~ extensions of such eneral terms as norwe2,~az]: (float includes all norwegians who exisBed~ exist now or will exist :in future), ator~, man etc. General term has no reference - unless it is used J.n the context of some a c t u a 1 i - z e r (~he term is clue to Sally 1955), that converts ~his general term into a singular term referring to a definite, object in some definiBe speech act.",".It is usually accepted, that general term,~.~ have a tw~ofold usage= the 2 can be used as p,'edicates (of. John is a n o r w e ~ J--. 3 0 4 ~._}.%)~ and besJ.des~ they can be used as sub."]},{"title":"\"]tac]tives,","paragraphs":["but or~ly in the conceit% o:t ~.~n &¢., tualizer ,-. a quant:i.:f':ier adjective er ~ de. te.rminez, (perhaps, imp].icite~ i oeo having; a zero exponent, as is often the case in a:c%i~ Cle-.laoi{.ing langtiages like I{tlssis.n)~ We o].sim th.at gener{~l germs a:('feJ:'d a.l.,qo of the third ~,ype of syntaebic and referential, u#Je:~ a general term can be u~ed as a subject of e~. generic pz'oposition on the co~.ditio.m that the quantification in this proposil;ion :i.~ a d v e r b i a ].~ J. oe.. qlAaatj~fJeatioll m&-~ ~=- kers of the subject fez-m a pari; of the p:~;e • dica-l;e, i.eo o J? the verb phrase of the same sentence° lm o~her wez'ds~ we propo,'.~e t(; treat ge~Jerio terms aq reiere:tzoJ.a].]V iD(;oi~t- .plebe expressions; their z'ei'erenoe is speoJ..-. fled outside the noun p.hrase JBself,. n Uhis respect ge~lerio use of [% noti~1 man i~1%he proposition l~,]aa41 j:s mo77591~ can be JJ en-[;ifJ~ed~. eog. ~ with the use of the same :ooun in SL~oh center(is an eiv e~/i ~nan or t~isj_~i~.ta~ where i[!e[n is def:i.ni~ely ~t general term lacking z\"ef'eo-. fence) and referential ¢harao~eristios of' '~he NP is specified by sorne external me~mso The same princi.ple works in such examples as","(24) There are r J. v e r s t h a b","d ~:\" y u p i a s tl m m e z, wh.ere rivez's that dry u ) in sumraer Lr; re-","~--: ..... 1-~ ........... :2. -- & £e_rencia]ly incomplete ~,aP: its re:Eereneial specification is contained :in t}tle veg, bex.-. pressing existe~cial quant-i.J~ica[iOno","~uant~flcaB~on in the V]? of a genez<Lc sentence may be of different kinds ~. both with respect to its form and with respect to its meaning. As for ib~ fob'm, q~antifica-. tion can be either i m p I [ o i t; e~ as in examp].e (1) or (4)~ or e x p ]. :i. e i t e~ an in (2); ore also the adverb usual]._,< ex-. plici~e]y expressing quantifica[ion in (25)","(25) A symphony u s u a I 1 ~ cons:i.~ts","of four parts~ As for its meanJ.ng~ quan.tJ.fioa~ion may be-- long to the type 'usua.]_l~'~ ~s in ([!.)~ to the type ~alwaya~ as in (4)~ and besides, ~here are great many other semanl;ic types of adverbial quantification J.a nai;ura]. ].a>,.-., g~~ages~ ~hese types of quanti£:ioabien being expressed expl:J.ciBely by adverbs or adve.c.. blals with hhe meaning ~ often' ~ ~'{mme ~irite~ ~&it~os% ~lways ~ etso ][% must be borne -Ln mind %ha% qua~itif:ke&-~ion, wb.e~tt implioi%e, often rer~laJ.Ils ].J.nguistiea].].$ ~'4- <~ ~.nde,. ,.n,zd. o.nd. substanti~:J,1]oy indefinite - in this case a p~:~oposition is understood with the type of quantific~,~tion that will bring it nearest to ~ruth, cf,~ such platitudes as Extremes meet -o to sound like t~th it must be understood Lts 'Extremes usually meet' or even 'It may be the cs,~e that extremes meet'.","Thus~ for \"typical\" generic propositions, such as (1), two properties are substantial: l) they a:ee quantified implicitely; 2) their quantification belongs to the semantic type gusually ~ !.ruth conditions for a typical generic proposition can be formulated as","follows (26) A ~eneric proposition with the sub-","ject s and the predicate P is t1~e if and only if for any xC-~ E s (where E s is the extension of the general 'term s) it is u s u a 1 1 y the case","that P(s) is true°","The meaning of usually[ can be described in the sa~e way as the meaning of other words is described in lexical semantics. Thus, s j!_s usuall~ ~ '~or most x E E s it is true that l~(x), and this situation is considered to be natural'° This definition gives an explanation to the following example f~'om Carlson 1978: sentence Books are usuall~)aj!erbacks sounds odd, though it is, perhaps, true that most books are now paperbasks° The fact is, that this situation is not as yet considered to be natural. 7o Adverbial quantificalion","In a similar way truth conditions for other types of adverbial quantification in generic p~opositions can be stated. What is important is the fact that there are contexts in ~hich adverbial quantification cannot be reduced to quantification over the extension of the subject term.","Take ex~np]e (27) Young people usually overestimate","their resourseso","~[ts meaning cannot be adequately represented by means of quantification over the set of all young people: (27) ~ 'Most young people overestimale their resourses'. What is ment in (27) is that f o r m o s t c a s e s when a young man estimates his (or her) resourses he overestimates them . So it is clear that quantification over situations and not over objects is involved here. In the same way we can represent the meaning of sentences (8) - (13) with generic names of situations from section 2. 8. Grammatical problems revisited","Referential oppositions that were introduced allow us to give explanations to at least some of grmnmatical phenomena connected with generics, ~lich were mentioned in section 3.","Thus,, (28a) and (28b) are not strictly synonymous:","(28) a. A m e r i k a n e c (Sg) delovit","'An american is effective'.","b,. A m e r i k a n c y (P1) delovity","'J~ericans are efficient' The difference in meaning may be ascribed to the fact that (285) is a usual type of generic propositions ~ile (28a) describes our mental image of an American (in the sense of Wierzbicka 1980).","Exceptional behavior of generic terms with respect to Tense, exemplified by (18), canbe explained by the fact that sentence (18) does not express a generic proposition: NP dinosaurs is here used as a name of class. Genuine generic propositions are, in fact, o~mitemporal. 9. Conclusion","Our investigation can be looked upon as a proof of the thesis that for typical generic noun phrases a logico-semantic interpretation can be given which strictly corresponds to their surface structure (in article-lacking languages): generic terms can be treated as referentially incomplete phrases, with qu~ntification expressed outside the phrase itself or not expressed at all. References Bully, Ch. (1955) Ob~gaja lingvistika i voprosy frano uzskogo jazyka. ~Ioskva: Izdatel'stvo inostr, lit. Burton-Roberts, N. (1976) On the generic indefinite article . - Language, v. 52, p. 427-448. 5O5 Carnap, R. (1959) Zna~enije i neobxodimost~o~ Moskva: Izdatel'stvo inostr, lit. Carlson, G.N. (1978) Reference to kinds j.n English. - Indiana university linguistic club. Jespersen, O. (1927) A modern English gram~o mar~ ~{eidelberg: Carl Winter's Universit[t buchhandlung. Lyons, J. (].978) Semantics. -L., etc.: Cambridge univ. press, v. 2o Padu~eva, E~V. (1985) ~yska~y~s,nie i ego so,~ otnesennost' s dejstvitel'nostju. - Noskva: Nm~ka. Parsons, T. (1970) 'An analysis of mass terms and s~aount ter~s.' - Foundations of language, vo 6, po 363o-388. Quine, WoOo (1953) From a logical point of view. - C~nbridge, Mass°: Harvard univ. press. Wierzbicka, A. (1980) Lingua mentalis. Sydney etc.: Aeado press° 506"]}]}