{"sections":[{"title":"Partial Orderings and Aktionsarten in Discourse Representation Theory","paragraphs":["lOtrt EBERLE","Institut for Maschinelle Spraehverarbeitung Universit~it Stuttgart Keplerstr.17 7000 Stuttgart West Germany Abstract This paper presents an approach to deal with the underspecification of Aktionsarten in German sentences. In German the difference between an accomplishment and the associated progressive state is often not marked on the sentence level. This distinction is important for correctly interpreting texts and for translation into languages which provide morphological markings of Aktionsarten. To maintain compositionality we suggest a two-step analysis of a text with respect to the temporal relations and the classification as events or states. This analysis is guided by the Discourse Representation Theory developed by Kamp and makes use of world knowledge and an inference component. The problem of classification can be reformulated as the problem of finding an embedding function f from the representational entities onto the domain of a model. The models we use are structures built from intervals of time, events and individuals. Considering intensional models of this type will allow us to give truth-conditions for progressive states related to corresponding accomplishments. We restrict ourselves to progressive states of intentional actions and use the beliefs of the agent. 1) Introduction: The influence of the criterion \"Aktionsart\" with respect to the temporal relations of temporal entities often seems to be overemphasized. On the one hand the correct dassiftcation is a problem, on the other hand, it seems that in more cases than assumed the influence of world knowledge is necessary to disambiguate the temporal relations. In this paper an approach is preseuted based on a two-step anal~Ls of a text. The first step consists in constructing a partial ordering on the basis of an approximate classification of the temporal units on sentence level, using the framework of D(iscourse) R(epresentatlon) T(heory)/cf.Kamp 1981a/. In the second step we try to obtain possible linear readings, using background-information, provided by a database, and an inference component that. is an extended version of the \"event-calculus\" /cf.Kowalski,Sergot/. The subdivision into two steps enables the temporal resolution component to work without a great number of inferencing processes. This contributes to a more modular-like structuring of the natural language processing-system. The goal is to represent ambiguous readings as such. The progressive state reading of an accomplishment leads to the problem called \"imperfeetive paradox\". Using the beliefs of the agent we try to give a solution for the subclass of intentional actions. The problem here is to deal with the time dependency of the content of someone's belief. 160 2) Partial Event-Structures The starting point of this paper is the conviction, following Kamp and others, that within the temporal units, events are primordial, and time is abstracted from them. The construction of pure temporal units can be based on the ultra-filter-construction introduced by Wiener /cf.Kamp 1979,1981b,van Benthem/: In order to model the natural underspecification of human perception, only the relations < , o (temporally smaller or overlap) are given within the event-structures in /Kamp 1979/along with the following axioms: A1 V el,e 2 e I < c 2 - > ~ e 2 < e 1 A2 Vel,e 2 e 1 <e 2 & e 2< e 3 -> e I < e 3 A3 Vel,e 2 e lee 2 -> e 2oe 1 A4 V e 1 e I o e 1 A5 Vel,e 2 e I <e 2 -~. ~e lee 2 A6 Vel,e2,e3,e 4 e l< e 2 & e 2oe 3 & e 3< e 4 -> e 1 < e 4 Including the axiom of linearity A7 Vel,e 2 e l< e 2 ; e lee 2 ; e 2< e I other relations llke \"subset\" or \"temporal equivalence\" can be defined out of these basic relations. This shows the fundamental significance of the relations < and o. The addition of new events can allow a more accurate statement o~ the temporal relations. If we start with an uttered relation of vague simultaneity between two events e I and e 2 expressed by e 1 o % and if it becomes clear from later passages of the text that there are events e 3 and e 4 with e 3 < e 2 < e 4 and e 3 o e 1 and e 4 o e 1 we can deduce by the Wiener construction, that the event et, seen as punctual at the beginning, consists of at least three moments of time tl, t2, ty Thus the internal structure of such events can become more elaborate as the text proceeds. In addition we can specify with greater precision the relation between events. In the case of e I and e 2 we are now able to conclude, that the overlap of the beginning has to be understood as a subset-relation between e 2 and e 1. In the following we will make use of this conception within the definition of our models for representations of texts. The Akfionsarten, redefined by Vandler, have frequently served as criterion to correctly construct tlme-structures from natural language-texts./cf.Dowty 1986,Hiurichs,Par tcc/. The opinion is not tenable however that telic events (accomplishments, achievements), in the absence of temporal adverbials, shift the reference time for new temporal units forward, and that activities, or so-called atelic events, and states do not. This is often argued in the literature. Exampte 1 : (e O) John I,~rote a program. (e 1) Ite togged in, (e z) opened his file and (e 3) began writing and correcting by using his papers. ExampLe 2: (e O) Yesterday a tot of things happened. (e 1) John bought a bicycte, (e 2) Mary den~tished Stantey's microwave oven. In example 1, el,...,e 3 are internally ordered subevents of e 0. In example 2, no obvious ordering between e I and e 2 exists. Without infereneing and using a detailed analysis of discourse fimctions as \"continuatiolf' or \"elaboration\" we can not establish the right ordering relations for =:uch cases. It is ewm harder to state correctly temporal relations within a compositions t approach: Exar%t~ [ e 3: (e O) John took the ptane to Frankfurt. (e 1) Then he took the train to Stuttgart. (s 1) As he'd had nothing to eat since breakfast (e 2) he bought e sandt~ieh at the station.","e) (e]) Then he bordered the train.","b) (e 3) Then he 19aoned his uife to say that he=d arrived, (e 4) before tsking the tram horle. Only when p,'ocessing the fourth sentence of example 3 (lo we discover that e 2 is an elaboration of e 1 in the case of a), whereas in b) e 2 is a continuation ~)f e 1. Thus what we should do in the first step of the analysis is to construct an underspecified ordering hoping that in the second step, on the basis of the representation* of the whole text, we can refine the conditions. We restrict ourselves to cases as in example 1 and 3, becansc here it suffices that one reference point is provided by the representation of the preceding text. To repret;ent the ambiguity between continuation and elaboration we need a relation \"not-before\". However to define \"not-before\" as a transitive relation the disjunction of < and o (< ; o) is not sufficient. This becomes clear from e:mmples 1 and 3 which would then be expressed by the following: %0 (<;o) e 1 (<;o) e 2 (<;o) e3\" (e 3 not-before e 2 not-before el... ) Because o is not transitive, for an admitted reading \"e 0 o e 1 o e 2 o e3\" (which would be true in cases where e 1 is a subevent of Co, e x a subevent of e 1 and so on) one cannot exclude the possibility that \"e 3 < el\" , which is surely not the case for such episodic readings.","Exempt e 4: e 3 -- e 2 e 1 Thus we have to require: V el,e 2 ( e 2 not-before e 1 <->e l<e 2;(e lee 2a(Ve s e s<e 1->e 3<%))). This suffices for transitivity as easily can be shown. Nevertheless we intend to tackle the problem in a second way; first because we want to be able to state a relation of isomorphy between event structures and Allen's interval structures /cf.Allen/, and second, because we want to make use of the eveut calculus of Kowalski and Sergot within our inference component. In their approach events are fike points. To this end we need extensions of pure event structures. It has been proposed, by Moens and Steedman among others /cf.Moens,Steedman/, partly with the intention of making Kowalski and Sergot's event calculus available for natural language systems, to represent the extent of structured events, i.e. accomplishments and activities, thereby conceding them starting and final events Cstart-events\" and \"stop\"- or \"culminafion-events\"). This method is also adopted within our approach. In combination with the Wiener method of constructing pure time units, this finer granulation allows us to conceive the o-relation as art equivalence relation for so-called secondary events, which, as we will see, is another way of solving the problem of \"not-before\". The model for DRS's used here is an extended version of the point-event-structure model with a domain of individuals proposed by Kamp. The version in this paper is a continuation of the modcl in/Reylc/. An extended point-event structure with a domain of individuals is given by: <E, 'l;,d, U,&b, <,o, start, end, F, G > where Ihe following is the case:","* E is tile set of events and is subdivided into primary and secondary events: Primer, Seeev. * Primer is subdivided into Acc (accomplishments), Act (activities) and Ach (achievements). * start, end are partial functions over the primary events with values in the domain of the secondary events such that each element of this domain is a value of one of these fimctions.","* Secev is subdivided into the subclasses Start (start-event), Stop (stop-event) and (htl (culmination-event). * S is the set of states. * P(T) stands for the set of periods which can be formed from the elements in T, which is the set of atomic, purely temporal units, whereby","* T contains all atomic elements which arc constructed out of E and S through the Wiener constrnction. * d is a (<,o)-homomorphism, which relates the events in E and the states in S to the corresponding purely temporal entities in P(T). *//is the set of individuals * The following holds: every accomplishment x is assigned exactly one start-event x I and either one stop-event x 2 or one cul-event x2, every activity x is assigned exactly one start-event x I and one stop-event ~, every achievement x is assigned exactly one cul-event x2, whereby tile assignment of secondary events to primary events, in combination with conditions about the relations <,o can be graphically illustrated as follows:","x x 6 Acc, or x 6 Act: ......... x I x 2 tx 1 <x2&x 1 ox&x2 ox&"]},{"title":"(VyEEUSUP(7\")","paragraphs":["(y < x ~-> y < Xl) & (x < y <-> x2 < y))) 161 x"]},{"title":"× EAch: ....","paragraphs":["x Z"]},{"title":"(x2ox&(VyEEUSUP(T)","paragraphs":["(x < y <-> x2 < y))) * The secondary events are considered as atomic:"]},{"title":"VxESecev, y,z~EUSUP(T) :","paragraphs":["~(yox&zox&y<z) The axiom s A1 - A6, extended to all temporal units of the domain, hold for the relations <,o, such that it follows that, with the inclusion of the linearity axiom : A7"]},{"title":"Vx,yEEUsUP(T):(x<y;xoy;y","paragraphs":["<x) o has the characteristic of being an equivalence relation, restricted to the secondary events. One can thus define:"]},{"title":"Vx,yESecev:x=py","paragraphs":["<-> xoy This allows the abbreviation \"x <p y\" for elements of"]},{"title":"Secev","paragraphs":["with \"x < y\" or \"x =p y\". */7, G are interpretation functions, such that F assigns every n-ary relation R a function over"]},{"title":"P(T),which","paragraphs":["assigns every"]},{"title":"i E P(T)","paragraphs":["a subset of U n G assigns every n~ary relation R a set of n+l-tupels out ofExU n * b is a function which assigns in a one-to-one-correspondence every state s E S a pair <i,<R,Ul,,..,un> > with <ul,...,Un> ~ F(R)(i) * In addition, the following correlation principle should hold: For every n-ary verb R and every n+l-tupel <e,ul,...,Un> E"]},{"title":"G(R)","paragraphs":["there exists a state s E S and an interval i E"]},{"title":"P(T)","paragraphs":["such that b(s) = <i,<R',ul,...,Un> > and either \"i c d(e)\" or \"i < d(e)\" , whereby R' represents the progressive variant ProgR of R. On the other hand, there should exist for every R', which is the progressive variant of an R and which is assigned an s by b, an n+ltupel E"]},{"title":"G(R)","paragraphs":["with the corresponding ordering and individual relations. In the system proposed here, a narrative text without any additional specifications which includes a series of events e I E"]},{"title":"Acc,","paragraphs":["e 2 E"]},{"title":"Ach,","paragraphs":["e 3"]},{"title":"EAcc","paragraphs":["would be assigned the following semantic representation: end( e 1 ) / < / / <p <p < start(el) ....... end(e2) ...... start (e3) end(e 3 ) Thus, the underspecification which is necessary in examples such as 1 and 3 is maintained without the side-effect of example 4. More exact relations can be established in a second step, using pragmatic knowledge, which completes the structure. In the case of example 2 we assume an indicing which does not allow an internal ordering. An advantage of this representation, using secondary events, for underspecified texts, over a representation with differentiated ordering relations, such as Allen's interval structures/eft.lien/, is, for example, its notational efficiency: If el,e 2 E"]},{"title":"Ace,","paragraphs":["then the following holds: start(el) <p start(e2) is equivalent to e 1 (= ;< ;o;s;siBdi;fi) e 2 162 Using the further restriction"]},{"title":"V e EAch,","paragraphs":["e 2"]},{"title":"ESecev:","paragraphs":["end(e) = e2->"]},{"title":"(VyEEUsUP(T):","paragraphs":["y < e 2 <-> y < e) one can show easily that within the event substructure of the extended point-event structure the relations that Allen uses can be defined in terms of o and < such that a relation of isomorphy holds between such extended event structures and Allen's interval structures. (In general this is not the case for the original event structures). 1 3) The imperfectlve paradox and the ambiguity of the Aktionsarten in German No attempts to solve the paradox that I an~ familiar with have been able to reduce the validity of a sentence in the progressive form to the validity of the same sentence without a progressive, which was the intent. 2 Moens and Steedman, with their aspectual net, have proposed a solution in which progressives are only generated from the activity readings of events. I will adopt this view to a certain extent, but will take it one step further, by bringing in beliefs, in order to create the possibility of reestablishing a direct relation at least for some kinds of accomplishments. The basic idea is that it is often only on the level of a text that the hearer can decide whether or not the culmination of an accomplishment, which has been introduced by a progressive, has actually been reached. Some texts will leave this decision open, others will force the existence of a culmination, and still others will force ihe nonexistence of a culmination. Especially in this last case, it is necessary to question the justification of the use of the progressive state for an accomplishment: how do we know the goal of an action if it is not attained? These possible characteristics of a text should be reflected by the different possibilities of assigning an embedding function relative to a DRS in a model M. We therefore require for a function f, which maps discourse referents of a DRS K onto entities in an expanded point-event structure with a domain of individuals, in addition to the usual features/eL Reyle/, the following: M I=f, K start(e) < end(e) iff startM(f(e)) <M endM(f(e)) and either endM(f(e)) E Stop M or endM(f(e)) E Cul M In addition the DRS construction algorithm must contain the rule: For all e E Ace, e' E E U S U P(T) : end(e) <p e' -> end(e) ~ Cnl If one requires, as in the correlation principle, that every state introduced by the progressive of an accomplishment verb be contained by an event, then the question whether e has a culmination (that is, represents a true accomplishment) or just a stop-point (that is , corresponds to the activity reading of an accomplishment), is transformed into the question of the existence of the corresponding f. Compat~ to this end the analogous approach in/Schulz/. In a subsequent paper we want to generalize the result with respect to the whole temporal substructure of an extended point-event structure. 2 Dowty's attempt using ~i~tcrtia worlds ~ seen'~s to lead to difficulties with respect to the correct non-subjective definition of the notion of an inertia world/el.Dowry 1970]. On the other hand, the question whether a corresponding expression in German is to bc read as the progressive of an accomplishment or as a real accomplishment will not necessarily be decided on tiae sentence level. We enter start(e) < end(e) and make the interpretation of end(e) depend on the possibility oi? finding an embedding ftmction f, Exampie 5: (e I) gans OberoDerte die Strasse.","(liana crossed/was crossing ti~e street) (e 2) Ein Last~a~len schoss our ihn zu ut~l","tA Lorry ai~proached him at speed and) (e 3) Oberrottte ihn auf der HShe des MitteLstreifens.","tran"]},{"title":"him","paragraphs":["o./er in the middte of the road.)","(e 4) Er storb aHf der Stetle. (Death was instantaneous.) In this constell~tion, the compositionally constructed e:t c- Ace cannot be truly interpreted as an accomplishment sittce Hans never arrived at the other side of the street. A simplified representation ha our system would give the followitig: ~.~od( e I ) / < /"]},{"title":"I","paragraphs":["<p <p <p starttel) ..... .. etxtt e2) ....... end(e3) ....... endt e4) Incorporating a spatial-temporal inference component (ill the second step of the analysis) which uses rules that deal with presuppositions and resltltiug state,,, with respect to events and states, one would get, in psetuloprolog notation: loe(stort(el),h,sidel(street)) end(e 1) G Cut -> loc(endtel),h,side2(street)) I oct end(e3), h, i n(st reet)) i oc(end(e4), h, i n(st reet)) term(e4,exists(h)) t rue(end(el ), exi st s(h)) On the basis of these facts one can conclude that no linear ordering of the secondary events can exist if end(el) C Cul lmlds. Therefore we make use of an extended version of the event-calculus by introducing for each finear reading which is to be tested \"auxiliary\" events to get endpoints for the introduced states if needed. If such events contradict with respect to a story an assumption wtfid~ one could call the relevance-principle, the proposed linear reading is rejected. This relevance-principle for instance would predict that in a story in which the agent crosses the street but is nevertheless later located in the street, an event of reentering the street should be mentioned. Tiros, every embedding function f, on the basis of the appropriate axioms, must map end(ca) onto an element from Stop M. e I is interpreted as a non-real accomplishment and this part of the text is no longer ambignous. When translating this representation into a natural language, the corresponding state-marker and not the corresponding twent-marker must be considered 3. ~A technical vm'iant of this alethod (with different embedding conditions) assigns every accomplishnleat a culmination point. The CuJlllillation points of accolnplishn'tetus which cannot be assigned a linear reading call be undel~tood as entrance points to an inertia world /cf. Dowry ~970/. For the sake of completeness, one would then have to generate additional stop l~fiats for such e's anti label them as norl-real acconxplishtllents~ as ill the first variant. 4) luteusionul model of a DRS Although the correlation principle implies a relation between a sentence wilh tire progressive form and the same sentence without, it also makes dependent on f the question of whether the corresponding event to a progressive form of an accomplishment can be read as a real accomplishment or not. If not, one must ask according to which criteria the special determinability of assertions about accomplishments is justified, since without the possibility of checking the result, the descriptions of progressives such as: Exampte 6: a) \"Hans war dabei auf don gerggipfel zu kLettern\" b) \"lions ~al' dabei auf die Iluette unterhaib des Gipfels zu klettern.\", in case the corrcspondiug events are not completed, collapse into the description of a perception of an activity: \"Hans klctterte\". What are the criteria for considering one state to be fulfilled at time t and the other not? It seems to me that one possibility of cwthtating such cases could consist in referring to beliefs. Thcrc is no doubt that not all accomplishments inw}lve agency, and even in the case of agency there is not always intcntionality by the agent (cf. Dowty's nolion of \"controllahility\"). But on thc one hand intentionality and associated activity can serve as a sufficient condition for the validity of a progressive state. On the other hand, in other cases, the introduction of beliefs can serve to represent expectations of the speaker or mentioned protagonists connected to tire introduction of such progressive states. Thus we get at least a further instrument to represent ambiguous readings. Our aim is uot to provide the correct truth-conditions for nonintentkmal cases. Here further research is needed. Wc restrict ourselves to the description of cases as in example 6 and we will concentrate on the notion of belief in a framework where time comes into play. For cases as in example 6 we require that: \"Hans ist dabei attf den Berggipfel zu klettern\" be true at t if an activity e of climbing by Hans in the direction of the peak exists where tce. and if Iqans has the intention of climbing the motmtain at t, i.e. in the \"belief state\" of llaus at t there exists an (:vent e wlfich he wants to accomplish. A DRS-Notation: IHans(tO"]},{"title":"I","paragraphs":["Berg(v) Is: JProg ktettern_auf(u,v) I Is':l p"]},{"title":"I","paragraphs":["Jbet ieve(u,p) [ IP:\" i r e n"]},{"title":"I le: Iktettern_auf(i, r )","paragraphs":["J"]},{"title":"JAc~te) Cut(end(e)) I l:t:rtv (°) ..... d(s) =Jd(s') .................... ig3","paragraphs":["For the interpretation of such DRS's it is useful to expand the concept of a DRS model. Extending the model of/Asher/, we define: Intensional point-event structure with a domain of individuals:"]},{"title":"< w,n,// //cc// //r>","paragraphs":["The following holds: * Wis a set of worlds"]},{"title":"*D=U(Dw:WEW ) * Dw = < <E,T,d,U, <,o, start, end, S,b>w,K,K',K\">","paragraphs":["For every"]},{"title":"w E W <E,T,d,U, <,o, start, end, S,b > w","paragraphs":["is a point-event structure with a domain of individuals and the corresponding conditions. K is a set of DRSs. K' is a set of \"delineated\" DRSs. K\" is a set of \"predicative\" DRSs. (For our porposes K' is of interest. K and K\" m'e mentioned only for the sake of completeness). *////G maps every relation R onto a function, which assigns to every w","E W an element out of the powerset of"]},{"title":"U ~N(~wXUwn U U\" U K\" U K'\" U K\"\").","paragraphs":["*////F maps \"believe\" onto a function which assigns to every w e W a function which assigns to every i E"]},{"title":"P(T)w","paragraphs":["a subset of (U w x powerset(K')), maps"]},{"title":"\"start\",\"end\",\"d\"","paragraphs":["onto functions, which assign to every w E W a function from E w onto Ew, resp. from E w onto"]},{"title":"P(T)w,","paragraphs":["(b w as b above), maps every relation R onto a function, which assigns to every w E W a function which assigns to every i E"]},{"title":"P(T)w","paragraphs":["a subset of","Uw\". f is an embedding function of a DRS K in an intensional model if f maps/ all individual reference markers of U k onto elements of U Uw, all event reference markers of U k onto elements of U Ew, all state reference markers of U k onto elements of U Sw, all DRS reference markers of U k onto elements of K, all n-place condition reference markers of U k onto n-ary predicative DRS's in K\", all belief reference markers of U k onto sets of \"delineated DRS's\" in K'. The decisive requirement on a belief-state such as above:"]},{"title":"ra I =w,e,K s' : IS' (p ~ u(IS'), p:IS E Con(IS'),","paragraphs":["where U(K0' ) is the universe and Con(is') the set of conditions of K0' ) iff 3 g ,f ~ g: g(p) = {k r' [ r' E I} for some set of indices I, and bw(f(s)) = <i,<believe,f(u),g(p)> > such that <f(u),g(p)> ~//believe//F(w)(i) and 3 k z' V k r' ~ {kr' I r' ~ I} such that k 2' < k r' (1~' is a proper portion of kr'), such that < f(u),k2'> E//believe//F(w)(i) and V k r' E {kr' I r' ~ I} q i r e i such that < f(u),kr'> E//believe//F(w)(ir) and k 3' < k 2' such that H/0,0,Ug(p),M/(k3' ) ~ H/g,Uk0,0,M/(IS ) and H/0,0,Ug(p),M/(k3'* ) $ 0 164 The essential but simplified principle is"]},{"title":"to","paragraphs":["be described as follows:","f is, as usual, an embedding function from U k into the domain of a point-event structure, indexed here with w. Beliefs are assigned structures. Since the beliefs of the agent can change within the considered time-interval we require that the value of p be a set of structures, {k r' [ 1 < r' _< m}. For the description of the belief - K 0 - to be true it is necessary that there is a proper portion - k 2' - that all the different belief-states have in common. One part of that portion - k 3' - should be described by K 0. We state that the description of the belief - K 0 - is correct when the set of possible worlds in which the corresponding part of the portion - k 3' - is true is contained in the set of possible worlds in which the description is true. The treatment of \"internal anchors\" remains to be integrated. For a more detailed review compare the basic model in"]},{"title":"lasher~,","paragraphs":["where, in particular, the function H is defmed along with the remaining truth conditions. 5. Conclusion: The system considered here allows a solely partial ordering of events anti states on the representational level, which can be completed on the basis of world knowledge stored in a data base, with respect to the ordering and the dassiflcation into Aktionsarteu. The compositionality principle for the construction of a semantic representation can thereby be maintained. Ambiguous readings are kept as such, impossible readings are rejected. The expansion to an intensional model for DRS's not only would permit in a certain way the restatement of the relation between some kinds of accomplishments and the corresponding progressive states , but it also would allow, through the use of the belief predicate, an extended version of the theory to correctly represent ambiguities such as is made clear in the following examples through the use of different indices. Exampte 7:"]},{"title":"\"Mary saw OswaLd shoot Kennedy\" a) Mary saw Oswald/Mary shoot KennedY/Mary so~ooe","paragraphs":["b) Mary saw /Mary shoot KennedY/Mary Osws ld/speakcr a) and b) are to be represented by different instantiatlons of the arguments for the predicate \"believe\". A further possible expansion, also relating to incomplete accomplishments, is the incorporation of unfinished objects."]},{"title":"Bibliography: ASItEILN.(1986), Belief in Discourse Representation Theory, in: Journal of Philosophical l,ogic 15 (1.986) pp.127-189 ALLEN,J.(1983)~ Maintaining Knowledge about Temporal Intervals, in: Comm.ACM 26 (1983) pp.832-843 VAN BENTItEM, I.(1983), The Logic of Time. Dordrecht : Reidel DOWI~',D.(1970), Word Meaning And Montague Grammar. Dordrecht : Reidet DOWf'¥,D.(19~R;), The Effects of Aspectual Class on the Temporal Structure of Discourse, in: Linguistics and Philosophy Vol.9, No,l (1986) pp.3%62 ~IINRICItS,E.(1986), Temporal Anaphora in Discourses of English, in: Linguistics and Philosophy Vol.9,No.1 (1986) pp.63-82 KAMP,H.(1979), Events,lnstants and Temporal Reference, in: Baeuerle,R./El,,li,U./von Stechow,A. (eds.) Semantics from Different Points of View. Berlin : Springer, pp.376-417 KAMP,rI.(1981a), A Theory of Truth and Semantic Representation, in: Groenendeijk ~t al (eds.) Formal Methods in the Study of Language. Mathematical (]entre Tract, Amsterdam KAMP,H.(1981b), Ev6nements, repr6sentation discarsives et rdf6rence temporelle, in: Language 64 KOWALSKI,R.,SI!!RGOT, M.(1985), A Logic-Based Calculus of Events, in: New Generation Computing 4(1) (1985) pp.67-95 MOENS,M.,S~I'EEI)MAN,M.(1986), The Temporal Dimension in Information Modelling and Natural Language Processing, Acord Deliverable 2.5, Edinburgli,1986 PARTEE,B.(19g4), Nominal and Temporal Anaphora, in: Linguistics and Philosophy Vol.7,No.3 (1984) pp.243-287 REYLE,U.(]986), Zeit uud Aspekt bei der Vcrarbeitung natuerlicher Sprachen. Dk,;sertation Institut fuer Linguistik der Universitaet Stuttgart,1986 SCHULZ,K.(]I.987), Event- and Interval Structures A Mathematical Comparision. FNS-Bericht-87-18 Forschuugsstelle for nafftrlichsprachliche Sys! eme, Universitht Tflbingen,1987 1.65","paragraphs":[]}]}