{"sections":[{"title":"A ~,\"e'aa~)lework ~bv Lexkat Setecth~n h~ Natm°a~","paragraphs":["ge~;vei Nire~tburg Ca, r~egie,.Mel#m Unive~'i~y /~'\".~;\". Nirenbu~ \" t :acm~gL~ Grotq, lnc A~M~'g~ef~ This t~i~ dc:~cdbcs a proeedmc Ru' lexical se.. le=,:![~ia~ of OlW, n-claSS k:xicN items in a natmal langp.age gca~:~atkm sysRm. A,l optimum R;xical seleetiol; ua}t~nig ~mlst [i~.: able tO Ira|nice. rt~.!lizati,'m decisions mldc; vary-. i~g rcugextna~ cit'cmastances. First, it must be N)le to iy;;,?-,i~ ~, withont the illlhlCUCe of coiitext~ based ou |llCT, ll. lug cm~e~poadcuces I~elwcen elemeuls of couccptual ill\" imt a,,d ~hu k:xic.~l i~e~'emo~y of thc talget language. S(m-O~ld, it must t~.~ ~,bh~ to use contextl~d constlaims, as sup° F;~f~ by coll~,.:adoaM iaf(~nuatio~ ii~ tfie gcneralion lexb c(m. '~ hi~d, ihcru lilllSt ])!) illt oplion O~ realizing input tepresenh liolts laonomiaally or th~ongh detinite dc.scripliuns. t,'il!;iii3, the~e nntst alsu b(3 au option of tLsing elliplical co~tstruciions. The ~tttum of 1)ackgtouud kuowledgc and th{; all o~ithu~ v/c sugge.~t lbr this task are. dcscrilav& The icxical xetcctiou prt~dttre iS a part of a couq)fehgnsive j~eltcra{ton Systeub D[OGI,2qE% Natnrai iaa;;~tago y, en~:laiion i~, haditk!nafiy divided into two stages: file nlt(;ml,'ee plmmiug ('what to. :lay') stal;~: aul! li~e lexical arm ,';ynhactic ;¢mlizafion (how to say it') stage. 'llle latte_., ~;tage consists, essentially, o[ ;~ larf~,e set ot re::diz:ltion choices fill the vmious nteunings of the iuput, \"../!dub th~ morphologk~d, synku;fic sad lexicai tne.'.uls el extm.ssion in the bq~gct lal~guage (TL). Research ~c,l×)rted here dc~tls with ~le protess (d\" lexk~l selection dmiug this s(~ol|d singe of generation. Many o'~ the exis|ing generatinu systems ha~,e bees conceived as cornlRlUenls cJ\" natfl[~l ~Ilngn~lgc intcrraces to datatmse sysJ~')lnS. In SutAh generators the lexical invettto~y can be strongly coustraiued withralt jeopardizing the quality of the iatcmctiun (eL, e,g., McKeown, 1985). Such systems ~meessarily cunccntrate on choosing aptnz)priate \"l'l, syutax .- indeed, gellCl'a~)rs Roe exp~xiled to produce atkqqllate sy~ltaclic stractqre.s, l,cx ~ ieal selcctiovi I~morne* ladle important when it is difficult R) constrain Ihe tytw'S of (mtpnt in genea~iiJon, aud, COllseqneutly, wheli the lexicon i;*x:t)mes large,. Mactfine hauslalion atul automatit: text summarization a~ among q~plicalifms thai by nature, require a wide range of outpuls amt iw.ve h) use a sizeable lexicon. Note that t)f these two the [()i'nlcf d(~3S lint involve n|tcratlce plaualng Rlld concentrates on lexical and symactic x~:.~lization.","la ~t~e n Ittmd hmguage genemtiou commmdty the task of lexical selcctio~t h;~; uot ye! alh'a,;ied a sufficient atnuunt of attentiua, though it was v~ddtesse.~t in a we]l-know~l early gcncratitnl project (Goldman, 1975) aud i~ wide]y nx;og~fized as an imlumant woblem (el. Dan- !us, 1994; 3~.~'ot:,S, 1995; Bienkowsld, 19fi6; attd the survcy dimming, /986). Oac motivation for lhis ~esenrclt was that we agree with Mat'-. cn~ (Iqff/~ p, 211) that 'most gencxaiion systems don't use words at alL' a~td we belkwe ~hal the quality of generation ouqmt will improve ~ignilicauO f on¢c an ad~luate lexical sclccti(a~ contponeat becom,.~ a :'taud:-a'd t~ {ff a N]2.G .';ystcm. ~'escmch J~c'poi-~eA in tills paper was lXMO~mcd within tile DIOGENES \"pmj(~l (l':[h~ ubuig, 19~{7), whose o~jeetivc is to l:,~ovide a high-quality gcllcra~:~r %: a knowledg~ol~qs,&l intedingnal machi.c translation sys~, tom, 'file in!rot *o this gcut;mtor is a set of a) world concept instance* that ce, pa'e,\",:>t lhc lhoi)0silional contenl of the original texL attd b) sets of mat pa~'ametc; valses [:hat repre.'mnt its pragmatic content, (Ihese cortcepts are repre.seuted in a frame.-orietlWd formalism aw.l are intcrconnecteA according to the rules of a special g~'ammar -- sea; NireuOmg ct M., 1986 for a detailed dcscdption.) In this paper we deal with a subset of the gencralion task, :lamely, the selection of Ol_W,a--class lexical items Io realize the meanings of ohject, event aud property tokens in tl~; iupuL Thus, ihe output of file geueratiou module described here is a lexical unit or a pronram in the target laugnage.","Ore' appruach (and especially the expected input) to text genaratio. is similar to that of the SEMSYN project (e.g. R6snea', 1986). l.exical selection is uot, however, an immediate concern of and is not tiiset~ssed at auy leugth ia SEMSYN descriptions (see, for iust-mcc,/,aubsch cl aL (1984, p. 492), aud a published analysis of pr¢~',tica/ difticnhic~; c> cnuntered by the project (tlattakata et al., 1996) d(x:s not addm!'.s 9~i:.i issue at all. Furthexnlore, since until very rt~:eutly that prqje~;t had m genelate sentencc-leugth texts (article titles), Ihc problem of dc.iiaite descriptions, prouominalizalion arid ellipsis did not ~wx:oiae acutely im-l×l~mt."]},{"title":"3 Why is it a difficult task?","paragraphs":["Dextral choice is not a stl~ightlb~ward task, Snppase we hay.': to express ill F, nglJsh the meaning 'a person whose sex is lUnle aud wh(}t;c affc is between 13 and 15 years.' What knowledge do people use in order to come up with an appropriate choice out of such candidate realizations as those listed in (1).","(1) boy, kid, teenager, youth, child, young man, schoolboy, adolescent, man,","Without a sentential context file choice, based on eloseuess of i|t~ nmauing match and genendity of meaning, should t~e boy. I;or a coulputer program to tm capable of making choices like this, ii Ilas to possess a preferenee-assigding capability on the nmtches betweetl tht: meaniugs of tile cattdidate lexical l~aliTatkm on the one hand aud tilt', input meaning unit (see the discussion of thc matching lUCtlic below)."]},{"title":"3A Collocations","paragraphs":["Lcxical choices am, however, tylfically made in centext. Conlextual rclations anloug lcxical units reflect lueauiflg.-iudilced consiraillts ori eamccarfence (selectional ~estrictions: admire utkes a human subject). Sometimes, however, it is difficult to formulate a cot~:cnrrencc C()llstraint ill terms of selectional rcslriclions alone. Ttnls, 10r cxanqfie, tile causative construction wilh the English inJhzence requires eae, t; ils Russian equivalent vlijanie requires okazyvat', aed the ]alter is not a Rnssian correlate of exert other Itmn ill the above and very R'.w similar syntagmatic conslructions. Why do wc use, in Euglish, shed with iea,'s or leaves but don't usuaUy say shed water out era bucket or they drop tear,*\" every time when <...>? Snch properties of the lexical sleek of a natural language ate called eolloeational. We will now ilhlsi~tte, Ihe c~meept of collouation through several examples,","Cousidcr thc conceptual Old,rater of a large quantity of, a (relative) value liar measuring quantities (of materMs, lknccs, qualities, properties, etc.). It is realized in Euglish in sorer&race with collocational propm'ties of the lexical units that arc ascxl its its ope.lands. Not every quantity goes with every realization of the above opeaattm Members of ~hc set <big, enormous, great, high, large, strong, wide> of potential realb,~ltions of a large quantity of call reoccur with every of file members of the set <amount, difficulty, expanse, selection, voltage> of quantities. We say high voltage but a large amount. It wouhl lx~ inapprollriate liar a generation system to produce someflfing like high selection or large dif3eulty. (Note that in parsing the problem of assigning a similar senatntk: marker to all file various expressions from tile e.x~allpl(,; C~tU~ in priuciple, be. tackled through a mechanism of metaplt(w pnmcssing (e.g., Cat'boneR, 1987), whereby a geueral heuristic rule is dcw;luped for processing metaphorical input belouging a single class, such as, for instance, a large quantity of... - see Lakoff and Johnson, 1980, 10r an extensive listing of potential metaphor classes; in generalion, however, the task is the opposite - to produce llucnt nmtaphorical lauguuge. Since this depends not on regularities of meaning, but mthcJ on the idiosyncrasies of nteaniug realization in the varlons natural langtmges, the general rules will be more difficalt to come by and furumlate,)","An additional class of collocations are the paradigmalic collocao lions. \"these am best exemplified by the 'set-complement' collocaliuns such as the English left and right or parents and chiMren. 'l~le knowi. edge of these collocations, for instauee, simplifies the proccss of lcxical selection of conjoined constructions, such as ladies and gemlemen.","Colloeatioual relatious are defined on lexical ualls, not meaning ~'epresentadons. The study of collocations asceuds to Firdi (195 It; it i:, 4 711 a central part of the Meaning -","Text school of linguistics ---","cf. Mel'~uk, 19'14; 1981. 'll,e importance of collocational propelzies in generations has been recognized (cf. Cummiug, 1986), bat relatively few systems actually include collocational information in their decision processes. 3.2 ElLipsis and Anaphora Certain contexts completely alleviate the problem of open-class lexical selection. Consider the following (gloss of an) input segment: (2) Clause1:BuyOohn3 book7), time|, focus: book7","Clause2:Bring(John3 book7 office~), belong-to(office~ John3),","time2: time~ > timeh focus: office|","Clause3:Read(John3 hook7), aspect: inchoative, time: after(timez) One of the adequate ways of realizing it is: (3) John bought a book. He brought this book to his office and","started to read it.","Ttiefe are seven instances of the three object-type concepts in the case-role slots of the input propositions above. Each of the three concepts is realized lexically only once. In two cases these meanings were realized through prononlinalization and in one each through definite description and ar| elliptic'/ construction. This example shows that non-lexical realization is an integral part of the process of lexical selection m generation.","In what fellows we briefly describe the system architecture,, the knowledge structures and the algorithm we use for selecting open-class lexical items in generation."]},{"title":"4 The System and the Knowledge DIOGF.NI~S is a dislributed natural language generation system featuring a blackboard-type control structure. The processing in it is concerto teated in the knowledge sources which are triggered by the state of the various blackboards. The latter contain the input to generation as well as all intermediate and final results of DIOGEN&S operation, represented uniformly in a frame-o|icoted knowledge representation language. Background knowledge in 9[OG~qES includes the following components relevant to the task of lexical selection: a concept lexicon, a set of knowledge structures that describe object ,qnd eveut-types in the (sub)world of the texts to be generated (the fn'st application of DIOG~'qES is; for example, in the domain of computer hardware maan~ds) o a generation lexicon that F,~ks (sub)world concepts (or, more accurately, their instances) with particular lexical units of the target Danguage.","paragraphs":["The above description is necessarily incomplete. See Nkanhurg, 1997 for an extensive specification of all the facets of DIOGrlNES.","'ll,e implementation vehicles for DIOGENRS ate, the Fraraekit lmowl- 'edge representation hmgaage (Carbonell and Joseph, 1985) and CMU CommonLisp running on an IBM PC RT.","Sample eoueept lexicon entries are illustrated in Figure 1. The figure shows a screen of the knowledge acquisition and main~nance system, called ONTOS (Nireuburg et al. 1988), which we use for a~quiring and mah~taining the lexicons. The figure shows a partial view of the concept network and three concept lexicon frame, s cow,responding to the concepts of research-workstation, memory and disk.","qbe following is a sample input tlmt will allow D[OG~qI~S tO produce the sentence The basic IBM personal computer XT consists of a system unit and a keyboard ((iI) clause].) (PROPOSITION part-ofl) (MODALITY real) (SUBWORLO computer-world) ((SPEECH-ACT definition) (DIRECT? us) (SPEAKER author) (HEARER reader)) (EOC[JS (GIVEN role].) (NEW (and role2 role3)))) ((PROPOSITION part-ofl) (IS--TOKEN-OF part-of) (PATIENT role].) (COUNTERPATIENT ((and role2 role3)) (ASPECT (P~ASE begin-end) (DURATION always))) Graph ~ro~aer: DEVICE elol~m r~e Edit: RESE(~RCH-IdORKSTDTIOH|illglKt C| t~o\" CIRa#:"]},{"title":"Lg~e","paragraphs":["Edlt.I RES[ ................................................ ~ I~V i IS-41 ( CCHPtD'ER- CO~P~WIEHT)","INkiEr-oF\"","(COHpIff£R) iZS-O (PEROOHOL) ~,[EICLASSE$ (DISK) iSUBCLASSES (IBH-PFJRT) DEFINITION (\"WORKIHG STORAGE FOR~ ~DEVIHXTION (\"hl=h p~=rmd\") THE CPU\") !I.EHGTH (0.5 TO 1.5) Ill|= ~z~to4 I~= ~lcJ~-o~: [UIOTH (0.1 TO 0,5) LEla£,TO 0.1 \"re 1000000) [HEIGHT (0.1 TO 0.5) WIDTH (o.1 TO 1000000) OPERATIHG-SYST£M (UHIX V~4S 05 HSDOS ÷ HEIG~Ff (O.i TO 1000000) ! 1= ~CPH HGCW) MASS (O.t TO 1000050) ! • t~ Ix~=Jltu~ f~ COW~%hr~: ~HAPE IL JlIAS-SS-PNRT (DISK CPU HEMORY) COLOR on. i ¢]=t= l~LI~OI£taa era= I'II3~IP~--J~L-OL~'~1~: ; ASK o,1 TO 1000000) iCS~L~PR E HH~L L ,I Cc4~annd)","(o.:","TO I000000) j IPQRT-OF\" ODJECT) I iI~ELOHGS-TO (CREATURE DRGAHIZATIOH) I igo~and> Top-: e~ i co.~.\";d7","d",",teme c;a;~: DI~( iPARY~OF (COHPUTER) !IS-A ( C f~4PUTE R-PERI PIIERAL 5¢","MEMORY) IIEFIHITIOR (\"Secondaru wtoras~\") alota ~,~ltel f~w ¢~]NtE~-~IF~| ~: ~UBCLASSES (DISK I/O-DEVI CE) list| ~i~tea from ~IC~-OlJ~: .EUGTH (0,I TO 1o00OO0) WIDTH","(0.1 TO 1000000; ~I:FN\" (0,I TO I000000) H05S (0.1 TO 1000000) SHfmPE NIL COLOR HIL AGE (0 i TO I000000)","Top-level c~and dlm10g =r.eh devloe Figure I. Concept Lexicon Entries 472 ((II) role]) (EXTENS IOJ~ IBM-PCI) ;an object instance to which all the various ;descriptions (inters]ors} of it refer; ;for example, \"John Sril]th\" can be intensionally ;represented as \"John,\" \"Mr. Smith,\" or \"Jim's ; father\" ;-- but it will refer to the same ;extension (INTENSION (IS-TOKEN-OF IBM-PC) (QUANTIFIER un] versal) (SUBWORLO computer-world) (MODEL XT) (CONFIGURATION minimal) ) ) ;\"basic\" r~Leans \"minimal\" ,~et of components ;that ca~] be called a PC; the best way of ;treating this is to define, in the onto]ogy, an ;attrlbut6 \"configuration\" whose domain will be ; (car house computer ...) -- anything that has a ;basic pzJce and extras, and whose range will be, ;fo~ the time being, (minimal regular extra) ( (ID role2) (F.XTENS ION comput er- syst era-unit I ) ( ]: NTENS ]:(IN (IS-TOKEN-OF computer-system-unit) (QUANTIFIER unlversal) (PART-OV IBM-PC model - XT) ;one needs [:his tautology; otherwise, system ;units have to be concept NAMES in the ;ontology. note the binding for the \"mode].\" ;which does the same compositionally, without ;pro] ifcrating names (SUBWOR]JD computer-world) ) ) ((ID role I) (EXTENSION computer-keyboard]) ( INTF.NS II)N (I S-TOKI£N -OF computer-keyboard) (QUANT I},'I ER universal) {PART-Oi '~ IBM-PC model - XT} (!;UBWOR%D computer-world} ) ) 40~ The (~e~cration Lexicon The main static knowledge source for generating of open-class items is a specialized"]},{"title":"generation","paragraphs":["lexicon (GL). The structure of an entry i. the g~neral]ou lexicon in DIOGENES is shown in Figure 2 (the BNF is incomplete wherever obvions): The importance value serves to ~stingulsh the sal~ney of the var-","ious relations for the idenfl~ of the entry head. Thus, f~ iustance;","generating youth instead of boy seems to be less a deviation than gen-","erating gld. Th~ is why the importance of the sex slot in the example","below is grea~r than that of the age s~t The sample GL entries below do not contain a full complement of","collocation re~fions.","(make-frame toss (is-token-of (value throw)) (direction (value up)","(importance 3)) (altitude (value high) (importance 3)) (velocity (value low) (importance 9)) (object (value coin) (lexeme (value \"toss\")) (syntactic-info (lexical-class verb) (verb-type transitive) (morph regular) (para-collocation (antonym catch) (synonym cast propel toss","fling hurl pitch pass))) (make-frame new (is-token-of (value age.CL)) (age (percent-of-range (0 25))) (domain (value non-living.CL)) (lexeme (value \"new\")) (syntactic-info (lexical-class adjective)) (morphologieal-info (comparative regular)","(superlative regular)) (para-~collocation (antonym old))) (make-frame boy (is-token-of (value person. CL)) (sex (value male)","(importance i0)) (age (value (2 15))","(importance 4)) (lexeme (value \"boy\")) (para-collocation (synonym lad kid child) (antonym girl adult) (hypernym person)) (syn-collocations-in (value boy.syn))) (make-frame boy.syn (agent-of (value play throw run jump) (strengh 0)) (place (value school playground ballfield) (strength 0))) GL-entry ::= ( <meaning-pattern><TL-pattern>* ) <meaning-pattern> ::= ( (token-of (value <CL-concept>))","[( <relation> (value <value>*)","(importance <importance-value>))]* ) <CL-concept> ::= {any concept in concept lexicon} <relation> ::~ {any relation from Concept Lexicon} <value> ::= (any concept or attribute (scale)","value in Concept Lexicon} <importance-value>::~ 1 l 2 l .-. l I0 <TL-patte~n> ::= (<TL-lexeme><lex-info><collocation>) <TL-lexeme> ::= (<language>TL-lexical-unit I (synonym TL-lexical-unit*)) <language> ::= english I spanish [ Japanese I ... <lex-info> ::~ ((<syntactic-info>) (morph <inflection-type>)) <syntactic-info> ::= {the contents of a syntactic dictionary","(cf. e.g. Ingria, 1987)} <inflection-type> ::= (an indication of irregularities in forming word forms,","e.g., @i[goose] - pl. @i[geese]} <collocation> ::= ( (<dimension> <dimension-value>*}* ) <dimension> ::= {the name of a (syntagmatic or paradigmatic)","collocation relation based on the CL slot names","for the concept in question} <dimension-value> ::= {a TL lexical unit (word or expression)","that can ordinarily collocate with the","TL lexical unit in <TL-lexeme> above","and connected to the TL unit on a","specified dimension; een be recursive} Figure 2. ~llle Structure of the Generation Lexicon. 473"]},{"title":"5 The Algorithm","paragraphs":["in the DIOGENES generator art inslar~tiation of a head-selecfing knowl.- edge source is triggered simultaneously for every event ,and role instance in the input representation. The results of their operafiou are posted to a public blackboard, so that ail knowledge source instances can draw on Ihis knowledge in their own decisiou processes. The knowledge sources responsible for selecting modifiers are triggered when the heads of their phrases have already been selected.","Figut~ 3 illustrates dm algorithm tora single lexical selection (head or modifier) knowledge source. If an input frame was already menlo tonext in the input, the question arises whether it should be realized non-lcxically, that is, using deictic means (this is the case with the seco ond appeanmce of John in (2)). If so, a proper realization must be, found and posted on the corresponding blackboard. If this process fails at arty point, We revert to the 'regular' case of lexical realization. This latter consists, first of all, in scanning the generation lexicon in semeh of a set of candidate realizations for the input frame. (1) is an example of such a set. When such a set is produced, we attempt to filter it by removhlg those candidates that are not compatible with realizations already decided upon for other input fi'ames in the same sentence. This processing is based on comparing the collocation infonnation in the lexicon entries for the members of various candidate realization seLq. F~r example, if a neighbor frame has already been realizexl as demonstrator, then the collocational intbrmation will filter out all mcmlxa's of (1) but youth, teenager, man. If the residual set has cardinality one, we post the result. Otherwise -- as in the case when no collocationnl intbrmatkm cnn be used -- we pmcexxl to select the ~v~aliz~tion based solely on the entries in the cnndidate realization set (ttmt is, without the ILT / First ~. No j No- ~c 'ca ~-~. .......... ~\" reference to ~'~--- ~.~\"~ realization ~-~"]},{"title":"frame","paragraphs":["~..concept ~ ..~. ..... )nd,cated../-"]},{"title":"--Choose -- I /","paragraphs":["Produce [ ..:J non-lexical candidate 1~ realization realization ] l","set ] ~..~ ...."]},{"title":"+o","paragraphs":["Process collocational constraints element filtered in choice above threshold? Yes context-independent of match Select meaning matching higher than best","metric threshold? . match"]},{"title":"Post result","paragraphs":["Figure 3. A procedure for selecting open-class lexicaI items during text generation. Incorporates the capability to intrcxhice anaphora and ellipsis. \"rakes into account collocational knowledge for pimlucing contextually appropriate realizatious. Augment Generation"]},{"title":"Lexicon","paragraphs":["474 heaefit of a context). This routine uses a well-defined inexact'matching metric that e~deulates distances between the meaning of the input franle and the raea,fings of the lexieai units in the candidate realizution set. The closest meaning is then selected and posted."]},{"title":"6 Stattas and Future Work","paragraphs":["The blackboard architecture and the inexact meaning matching module luts been implemented; the collocation treatment module has also been implemented, but extensive testing has not been performed due to the lack of a lm.ge-seale lexicon. The anaphora treatment module has been implemented for pronominalization only, and the nnmber of pronominali,~ation rules employed has to be and will be increased.","It is chair that the acquisition of the generation lexicon is a major and extremely labor-intensive task in natural language genelution. The acquisition of this dictionary, especially of the colloeafional information cannot at present be done automatically. But the efficiency of the team of human lcxicograplters working on this problem can be increased dramatically through the use of specialized intelligent interactive aids. We have developed one such Knowledge Base Maintenance System (el. Nirenbtwg et al., 1987) for rite acquisition of concept lexicons and will extend it so that it becomes applicable to the task of acquiring genernlJon ~exicons as well."]},{"title":"Acknowledgements","paragraphs":["The authors would like to thank Victor Raskin, James Pestejovsky, Rita McCardcll, Cad Pollard, Eric Nyberg, Scott Hufflnann, and Ed Kensclmft lbr fruitful discussions of the topic."]},{"title":"Referextces","paragraphs":["Bienkowski, M.A. 1986. A Computational Model for Extemporaneous Elaboratkms. CSL Report 1, Cognitive Science Laboratory, Princeton University.","Carbonell, J. and R."]},{"title":"Josepb.","paragraphs":["1985. FRAMEKIT, A Reference Manual. Department of Computer Science. Carnegie-Mellon University.","Cmnmmg, S. 1986. The Lexicon in Text Genelution. Paper pre° sent¢~l at ~.be LSA Linguistics Institute Workshop on Lexicon, New York. Dmdos, L. 1984. Conceptual and Linguistic Decisions in Gene~a-lion. In: Proceedings of COLING-84, pp. 501-504. Firth, J.R. 1951. Modes of Meaning. In: J.R. Firth, Papers ill Linguistics, London. Goldman, N. 1975. Conceptual Generation. In: R. Schank (ed.), Conceptual Information Processing. Amsterdam North Holland, pp."]},{"title":"289-3~2.","paragraphs":["I~anakata, K., A. Lesniewski, S. Yokoyama. 1986. Semantic-Based Generation of Japanese-Germml Translation System. Proceedings of COLING-86. Bonn, pp. 560-562.","Hovy, E. \"Integrating Text Planning and Production in Generation,\" in Proceedings of IJCAI-85, l.os Angeles, 1985.","Ingria, R. 1987. Lexical Information for Parsing Systems: t'oints of Convergence ,and Divergence. hu D. W~ker, A. Zaml~olii and N. Carzolari (errs.) Automating the Lexicon: Research and Pr.'~ctice in a MultiHngaal EnvirmLment. (in print).","Jacobs, P. 1985. A knowlexlge-based approach to language production. Ph.D. dissertation, University of California at Berkeley.","Laubsch, J., D. RiSsner, K. l-lanakata, and A. Lesniewski. 1984. Language Generation from Conceptual Structure: Syuthesis of German in a Japanese/Genuan MT Project. Proceedings of COLtNG-84. Stanford. pp. 491-494.","McKeown, K. 1985. Text Generatiml. Canlbridge University Press.","Mel'~uk, I.A. 1974. Towards a Theory of Linguistic Models of the Memllng-Text 'l~,pe. Moscow: Nauka.","Mel'~uk, I.A. 1981. Meaning - Text Models: A Recent Trend iu Soviet Linguistics. Annual Review of Anthropology. VoL 10, pp. 27-62.","Nirenburg, S., V. Raskin and A. Tucker. 1986, Ou Knowledge-Based Machuie Translation. Proceediugs of COL1NG-86. Bonn, pp. 627-632.","Nironburg, S. 1987. A Distributed System for Language Generation. Technical Report CMU-CMT-86-102. Carnegie-Mellon University. May.","Ni~'enburg, S., I. Monarch, M. Calvin and T. Kauimaan. 1988. ONTOS: A Knowledge Acquisition and Maintenance System. CMU-CMT Internal Memo.","R6sner, D. 1986. When Mariko Talks to Siegfried. Proceedings of COLING-86. Bonn, pp. 652-654. 4 7 5"]}]}