{"sections":[{"title":"How Language Structures Concepts - an Outline","paragraphs":["Leonard Talmy Department of Linguistics Center for Cognitive Science","State University of New York at Buffalo The Context of"]},{"title":"this Study","paragraphs":["For the past three decades, the mainstream of linguistics has focused its research agenda on the formal aspects of language, primarily syntax. By contrast, the more recent tradition of cognitive linguistics centers its research directly within the semantic stratum of language in order to observe how languages organize meaning and structure conception, and it examines the more formal stratum of language for its role in supporting these semantic functions."]},{"title":"The Contents of this Study","paragraphs":["The main goal of this study is to outline the fundamental conceptual structuring system of language. Language has a formally distinct component - that of closed-class forms - whose specific role is to serve a Structuring function: for example, schematizing the spatial relations between entities and the temporal relations between events. In this regard, language is perhaps unique within the range of cognitive systems such as perception, reasoning, and affect, so that mapping out the conceptual structuring system of language may serve as a model for comparable undertakings in the other cognitive systems. Open-Class vs. Closed-Class.","This work is based on a central feature of all known languages: that they have two distinct systems of elements. One system is the"]},{"title":"open-class","paragraphs":["or lexical system, comprised of elements that are great in number and readily augmented. The basic open-class forms are the stems of nouns, verbs, and adjectives. On the other side is the"]},{"title":"closed-class","paragraphs":["or grammatical system, comprised of elements that are relatively few in number and difficult to augment. These forms include not only inflections, but also particle forms such as prepositions and conjunctions, as well as grammatical relations, lexical categories, and syntactic structures.","The concepts expressed by closed-class forms are critical to this study: they constitute the core structuring system of language. This structuring function occurs in two domains: in discourse and in the conceptual inventory of language. Content vs. Structure in Discourse.","Semantically, open- and closed-class forms have complementary functions. Their meanings constitute, respectively, the content and the structure of a conceptual complex. This functional division of labor can be seen in the conceptual complex expressed by any portion of discourse, such as a single sentence.","To illustrate with a vernacular example, the sentence A rustler lassoed the steers contains three open-class elements, rustle, lasso, and steer. These determine the basic contents of the depicted scene - e.g., here, a Western landscape in which a cowboy whirls a loop of rope and flings it over the heads of male bovines neutered and bred for human consumption, in order to stem them from their owner.","While the sentence has only three open-class forms, each packed with a great deal of referential content, the closed-class forms, on the other hand, are much more numerous, with each form expressing a limited structural concept. They include such forms and meanings as -ed 'occurring before the time of speaking'; -s 'plurality of number'; the 'readily identifiable by the hearer'; a 'not readily identifiable by the hearer'; -er 'performer of an action'; the noun status of steer 'prototypically a physical object'; the verb status of to lasso 'prototypically an action'; the subject status of rustler 'functioning as an intentional agent executing the action'; and the object status of steers 'functioning as a patient affected by the action'. Together, these closed-class forms determine the main structural delineations of the depicted scene and of the speech context in which it is uttered: that there is one agent acting upon two or more objects, that this action takes place at a time before my telling you about it, and that I assume that you already know of the affected objects I am referring to, but that the agent is here newly introduced.","The different functions performed by these two classes of elements can be shown in relief by changing one class while keeping the other constant. Thus, changing only the closed-class forms of the example sentence could yield a new sentence like: \"Will the lassoers rustle a steer?\" Here, all the structural characteristics of the earlier referent have been altered - e.g., the interrogative instead of the declarative, future tense instead of past, and different assignments of number and definiteness. Yet, the substantive content is wholly comparable: still a Western cowboy landscape with theft of livestock by use of rope. If, however, the open-class forms are changed, as in the sentence \"A machine stamped the envelopes\", the structural delineations of the referent scene and of the speech context are the same as before, but the new content situates us in, say, an office building with office equipment, postal routines, and stationery.","In our theoretical framework, this function of closed-class forms to structure discourse is in-cluded under the notion of \"scene partitioning\". There are principles by which closed-class forms divide a referent scene and its speech context into entities on the one hand and on the other hand the processes that the entities execute and relations that they bear to each other. Alternative sets of closed-class forms within a stretch of discourse can impose different partitionings onto what would otherwise be the same scene. Typologically different languages regularly exhibit different forms of such partitioning. Content vs. Structure in the Conceptual Inventory of Language.","The second domain in which closed-class forms perform a structuring function is in the conceptual inventory of language in general or of any single language in particular. To demonstrate this, a certain critical observation must be made.","Open-class forms are free to express virtually any conceptual content. But closed-class forms are severely restricted as to the concepts they can refer to. For example, although many languages inflect nouns to indicate the number of the object referred to by the noun, no known language inflects the noun to indicate the color of its referent. Further, even within acceptable categories, such as that of number, not all member notions can be specified. Thus, while noun inflections in various languages mark such number distinctions as 'singular', 'dual', 'plural', and 'paucal', no i known inflections indicate such notions as 'even', 'odd', 'dozen', or 'countable'. On the other hand, such notions can be referred to by open-class forms - a fact demonstrated by the words just used. Thus, there are two levels at which closed-class forms across all languages are severely constrained as to the conceptual material they can refer to: the level of conceptual categories, and the level of the member notions within any conceptual category.","The fact that the closed-class component is limited to only a select set of concepts and conceptual categories accords it a specific and critical functional role in language. The closed-class component utilizes its relatively small conceptual inventory to structure the remainder of conceptual content, such as that which can be expressed by the open-class forms. That is, the closed-class component functions as the fundamental conceptual structuring system of language.","As a whole, the total inventory of structural concepts that can be expressed by closed-class forms exhibits the following property: it is hierarchically graduated. Thus, some of its concepts or conceptual categories have closed-class representation in all languages - e.g., the grammatical distinction between nouns and verbs, with their prototype reference to objects and processes. Some appear in many languages but not in all - e.g., the category of number. Some occur in only a few languages - e.g., the category of 'rate' with inflectional indication of 'fast' and 'slow'. And, of course, some conceptual categories, such as 'color', are outside the inventory entirely. While this inventory is universally available, each language has closed-class forms that represent only a subset of all the structuring concepts, and this subset is different in each language.","In the course of historical linguistic change, each language gradually shifts its subset of structuring concepts. Current theories of semantic change that include such processes as grammaticization and semantic bleaching have been good at accounting for the starting points of such change. But these theories have been inadequate in accounting for the semantic end point of a change - in fact, they have scarcely recognized the need for such an account. But the present theory of closed-class semantics recognizes the existence of a specific inventory of closed-class concepts in which any process of grammaticization must terminate.","To illustrate, :in present-day Enghsh, the verbs keep and hate - as in I keep skiing and I hate skiing - are both regular open-class forms. Now, if either of these verbs were to grammaticize so as to become a closed-class form (such as an auxiliary), while retaining its current core meaning, it is clear that hate would not undergo this process but that keep might well do so, much as the auxiliary form used to has already done. The present theory, though, supplies the reason for this difference in likelihood. The category of 'temporal structure', and the member notion of 'continuity' - as expressed by keep - are high in the graduated inventory of closed-class concepts. But the category of 'affect' is found to be quite low in the inventory, and the specific notion of 'hate' seems to be absent. Accordingly, no process of grammaticization will terminate with a closed-class form expressing the concept of 'hate'. Principles Determining which Concepts have a Structuring Function.","Further findings have uncovered certain principles that govern the kinds of concepts that can be expressed by closed-class forms and the kinds that are excluded. These principles are thus more general than the first-order identification of the structuring concepts found to be present in the universal inventory, and they are in part explanatory of those entries in the inventory. That is, the principles in large measure characterize what is treated as structural in language. 3","To illustrate, one organizing principle of this sort pertains to \"cognitive topology\". The principle is that closed-class forms that express spatial or temporal relations are largely topological in character, and exclude Euclidean specifics of magnitude and shape. The references of such closed-class forms are thus largely magnitude-neutral and shape-neutral.","For example, the closed-class preposition across prototypically designates a spatial schema consisting of two parallel lines and a perpendicular path from one to the other. But it is magnitude-neutral, as shown by the fact that it appears equally well in sentences whose referent scenes different greatly in magnitude: The ant crawled across my palm and The bus drove across the country. Comparably, the preposition through is shape-neutral. It can refer to motion along a line that lies within a medium, but it is neutral to the shape of this line, as shown by the fact that it can occur equally well in sentences referring to paths of greatly different contours: I zig-zagged through the woods and I circled through the woods.","To map out conceptual structure in language accurately, care must be taken to distinguish the actual properties of the qualitative geometry that structures closed-class reference in language from the forms of topology current in mathematics. Some differences can be illustrated with the English preposition in. This closed-class form refers schematically to location at points of a volume of space that is defined by a curved plane. Linguistic topology here resembles mathematical topology in that the preposition in is magnitude-neutral - it occurs equally well, e.g., in in the thimble and in the volcano. There is also a resemblance in that the form is shape-neutral, as seen in: in the well and in the trench.","On the other hand, the preposition is more geometrically abstract than standard mathematical topology in that it is also \"closure-neutral\" - it applies equally well to a completely or a partly closed surrounding, as in in the ball and in the bowl. Comparably, it is \"discontinuity-neutral\", as seen in in the bell-jar and in the birdcage. The objects in each of these pairs are treated as geometrically alike in language, whereas they are wholly different objects in mathematical topology.","In the other direction, a closed-class reference in certain respects is geometrically less abstract than in mathematical topology. Thus, the across schema, as in I swam across the lake, applies if my path extends between opposite points of the shore of a round lake, thus roughly bisecting the lake. But it does not apply if my path extends between two points rather close along the shore, thus dividing the lake into two portions of very different size. The linguistic principle that here appears to constrain the geometry of a closed-class schema is that - while the schema as a whole is magnitude-neutral - its parts must be of comparable magnitude.","Further study is needed for the problem of whether there is a \"principle of principles\" that provides a unified explanation for why conceptual structuring in language is accomplished by the particular set of factors found in the universal inventory and not by some other set. One may attempt a functional explanation - that all and only the structuring principles found in language serve requirements made necessary by other factors, such as the nature of communication or of perception. Basing his proposal on my previous research, Slobin (forthcoming) advances such a proposal. However, the present study so far can fault a number of the assumptions in this proposal as it stands. Major Categories of Structuring Concepts. J","It is not only the constraining principles just described that bring organization and order to the universal inventory of structuring concepts. In addition, these concepts fall into a relatively few large major categories, each of which structures a conceptualization with respect to some major factor. That is, the concepts and smaller conceptual categories that are expressible by closed-class forms in language cluster together in extensive imaging systems (as I have termed these major categories), each of which orchestrates one major aspect of structuring.","Four such imaging systems have to date been mapped out in some detail. In brief, the first three of these - which work together in a complementary fashion - are: configurational structure, the schematic delineations that partition the spatial and temporal dimensions of a referent scene; perspective point, the conceptual location from which one regards a referent scene; and distribution of attention, the pattern in which some elements of a referent scene are placed in the foreground of attention and others in the background. In addition, there is the imaging system of force dynamics - the different patterns of force relationships in which one object can act on another.","To give a single illustration, the two imaging systems of perspective point and distribution of attention can both be exemplified together with a contrasting pair of sentences. Both of these sentences can refer to the same situation - a set of houses located with respect to a valley. But due to their difference in closed-class forms, the two sentences evoke alternative conceptualizations of the situation - conceptualizations that differ with respect to choice of perspective point and distribution of attention. Thus, with the sentence There are some houses inn the valley, the closed-class forms direct a hearer to conceptualize the referent scene in the \"synoptic mode\" - i.e., with a stationary long-range perspective point and with a global scope of attention. But the new closed-class forms in There is a house every now and then through the valley direct one to conceptualize the same scene in the \"sequential mode\" - i.e., with a moving close-up perspective point and with a succession of local scopes of attention. Broader Cognitive Science Connections: The \"Overlapping Systems\" Model.","Determining the conceptual structure of language leads directly to its comparison with that present in other cognitive systems, such as perception, reasoning, affect, attention, memory, and cultural structure. The preliminary finding is that each cognitive system has some structural properties that may be uniquely its own; some further structural properties that it shares with only one or a few other cognitive systems; and some fundamental structural properties that it has in common with all cognitive systems. I term this the \"overlapping systems model\" of cognitive organization.","This model can be illustrated first with a pair-wise comparison of the structural properties in the cognitive system of language and that of visual perception. As for overlap, I have to date identified eight structural characteristics apparently shared by these two cognitive systems. One of these is their representation of configurational structure. Linguistic closed-class forms such as prepositions schematize spatial relations between objects, and vision appears to involve the perception of comparable schematic relations among objects. The remaining structural commonalities are: integrative structure: the formation of an overall schematic Gestalt for a represente d scene over space and through time; the multiple hierarchical embedding of structure; sensed interior structuring within bulk; the topological character of such structuring; the occurrence of two interacting subsystems: the contentful/Euclidean and the structural/topological; the distribution of attention over a represented scene; and the deployment of a perspective point over a represented scene.","On the other hand, some factors with a significant structural role in visual perception are at best minimally represented in the closed-class forms of languages. Thus, the structuring of a visual scene appears to rely greatly on the perception of bilateral symmetry, of rotation, and of dilation (expansion/contraction). But closed-class representation of these categories in language yields only a few forms. Thus, in English, bilateral symmetry may be represented solely by"]},{"title":"each other (They kissed each other);","paragraphs":["rotation only by"]},{"title":"around","paragraphs":["and"]},{"title":"over (The pole spun around / toppled over);","paragraphs":["and dilation only by"]},{"title":"in","paragraphs":["and"]},{"title":"out ( The gel spread out / shrank in).","paragraphs":["Conversely, linguistic closed-class forms express structural categories that appear to have little part in visual perception. For example, the linguistic category of 'reality status' can involve inflections that represent a proposition as factual, conditional, potential, or counterfactual. But there is little evidence that the visual perception of a scene involves a structuring or classifying of its contents in terms of such ascriptions of reality status.","Research inroads have been made into the structural comparison of language with each of several further cognitive systems besides that of visual perception - specifically, with the reasoning/inferencing system, the kinesthetic/somatosensory system, the affect system, and the cognitive system for cultural structure. In addition, a significant number of observations have been made as to structural properties that appear to run in common through all the cognitive systems. References","Slobin, Dan I. Forthcoming. Why are grammaticizable notions special? - a reanalysis and a challenge to learning theory. In M. Bowerman and S. C. Levinson (Eds.), Language acquisition and conceptual development (Cambridge University Press).","Talmy, Leonard. 1978. Figure and ground in complex sentences. Universals of Human Language, vol. 4: Syntax, ed. by Joseph H. Greenberg, 625-49. Stanford: Stanford University Press.","1983. How language structures space. Spatial orientation: theory, research, and application, ed. by Herbert L. Pick, Jr. and Linda P. Acredolo, 225-82. New York: Plenum Press.","1985. Lexicalization patterns: semantic structure in lexical forms. Language typology and syntactic description, vol. 3: Grammatical categories and the lexicon, ed. by Timothy Shopen, 57-149. Cambridge: Cambridge University Press.","--. 1988. Force dynamics in language and cognition. Cognitive Science 12.49-100.","--. 1988. The relation of grammar to cognition. Topics in cognitive linguistics, ed. by Brygida Rudzka-Ostyn, 165-205. Amsterdam: John Benjamins.","1991. Path to realization: a typology of event conflation. Berkeley Linguistics Society 17.480-520.","--. 1995. The Cognitive Culture System. The Monist, vol. 78, number 1, January 1995 (pp. 80-116).","--. 1995. Narrative structure in a cognitive framework. Deixis in narrative: a cognitive science perspective, ed. by Gail Bruder, Judy Duchan & Lynne Hewitt. Hillsboro, N J: Lawrence Erlbaum Associates, Inc.","In press. The windowing of attention in language. Grammatical Constructions: Their Form and Meaning, ed. by Masayoshi Shibatani and Sandra Thompson, 235-287. Oxford: Oxford University Press.","In press. Fictive motion in language and \"ception\". Language and space, ed. by Paul Bloom, Mary Peterson, Lynn Nadel ~ Merrill Garrett, 307-384. Cambridge, MA: MIT Press."]}]}
