{"sections":[{"title":"Syntagmatic and Paradigmatic Representations of Term Variation","paragraphs":["Christian Jacquemin LIMSI-CNRS","BP 133","91403 ORSAY Cedex","FRANCE"]},{"title":"j acquemin@limsi, fr Abstract","paragraphs":["A two-tier model for the description of morphological, syntactic and semantic variations of multi-word terms is presented. It is applied to term normalization of French and English corpora in the medical and agricultural domains. Five different sources of morphological and semantic knowledge are exploited (MULTEXT, CELEX, AGROVOC, Word-Netl.6, and Microsoft Word97 thesaurus). 1 Introduction In the classical approach to text retrieval, terms are assigned to queries and documents. The terms are generated by a process called automatic indexing. Then, given a query, the similarity between the query and the documents is computed and a ranked list of documents is produced as output of the system for information access (Salton and McGill, 1983).","The similarity between queries and documents depends on the terms they have in common. The same concept can be formulated in many different ways, known as variants, which should be conflated in order to avoid missing relevant documents. For this purpose, this paper proposes a novel model of term variation that integrates linguistic knowledge and performs accurate term normalization. It relies on previous or ongoing linguistic studies on this topic (Sparck Jones and Tait, 1984; Jacquemin et al., 1997; Hamon et al., 1998). Terms are described in a two-tier framework composed of a paradigmatic level and a syntagmatic level that account for the three linguistic dimensions of term variability (morphology, syntax, and semantics). Term variants are extracted from tagged corpora through FASTR 1, a unification-based transformational parser described in (Jacquemin et al., 1997).","Four experiments are performed on the French and the English languages and a measure of precision is provided for each of them. Two experiments are made on a French corpus [AGRIC] composed of 1.2 x 106 words of scientific abstracts in I FASTR can be downloaded www. limsi, f r/Individu/j acquemi/FASTR. from the agricultural domain and two on an English corpus [MEDIC] composed of 1.3 x 106 words of scientific abstracts in the medical domain. The two experiments in the French language are [AGRIC] + Word97 and [AGRIC] + AGROVOC. In the for-mer, synonymy links are extracted from the Microsoft Word97 thesaurus; in the latter, semantic classes are extracted from the AGROVOC thesaurus, a thesaurus specialized in the agricultural domain (AGROVOC, 1995). In both experiments, morphological data are produced by a stemming algorithm applied to the MULTEXT lexical database (MULTEXT, 1998). The two experiments on the English language are [MEDIC] + WordNet 1.6 or [MEDIC] + Word97; they correspond to two different sources of semantic knowledge. In both cases, the morphological data are extracted from CELEX (CELEX, 1998). 2 Term Variation: Representation and Exploitation Terms and variations are represented into two parallel frameworks illustrated by Figure 1. While terms are described by a unique pair composed of a structure--at the syntagmatic level--and a set of lexical items--at the paradigmatic level--, a variation is represented by a pair of such pairs: one of them is the source term (or normalized term) and the other one is the target term (or variant).","The syntagmatic description of a term is a con-text free rule; it is complemented with lexical information embedded in a feature structure denoted by constraints between paths and values. For instance, the term speed measurement is represented by: { Syntagm:{i°-+N2N1} } (N1 lemma) = measurement Paradigm: {N2 lemma> = speed"]},{"title":"(1)","paragraphs":["This term is a noun phrase composed of a head noun N1 and a modifier N2; the lemmas are given by the constraints at the paradigmatic level. This framework is similar to the unification-based representa-tion of context-free grammars of (Shieber, 1992). 341 Term","Variation ................................................................. Normalized term Variant Syntagmatic ,ev., transformation ~ [ ~ I ............... -~ ....."]},{"title":":-=","paragraphs":["............"]},{"title":":","paragraphs":["---~-~- ._ ~-'~---- -j .... ~ -: - _ _, Paradigmatic"]},{"title":"ILl\\","paragraphs":["L2 [ l/ILl// L2I andsemanfic I Ll' L2'I level"]},{"title":"speed ~m~ment ','~J","paragraphs":["links","lnstantiation of the [ource ............................ I_ ..................................... Figure 1: Two level description of terms and variations","At the syntagmatic level, variations are represented by a source and a target structure. At the paradigmatic level, the lexical elements of variations are not instantiated in order to ensure higher generality. Instead, links between lexical elements are provided. They denote morphological and/or semantic relations between lexical items in the source and target structures of the variation. For example, the variation that associates a Noun-Noun term such as the preceding term"]},{"title":"speedN= measurementN1","paragraphs":["with a verbal formof the head word and a synonym of the argument such as"]},{"title":"measuringvl maximaIh shorten- ingN velocityN,=","paragraphs":["is given by: Syntagm: { (N° -+ N2 N1) =0\" } (V0 --~ V1 (Prep ? Det ? (AINIPart)*) N~) (2)"]},{"title":"{ root)=(Vlroot) }","paragraphs":["Paradigm:"]},{"title":"{N12sem)=(Ni2sem )","paragraphs":["If this variation is instantiated with the term given in (1), it recognizes the lexico-syntactic structure"]},{"title":"Vl","paragraphs":["(Prep ? Det ? (AINIPart)*) N~ (3) in which V1 and"]},{"title":"measurement","paragraphs":["are morphologically related, and N~ and"]},{"title":"speed","paragraphs":["are semantically related. The target structure is under-specified in order to describe several possible instantiations with a single expression and is therefore called a"]},{"title":"candidate varia- tion.","paragraphs":["In this example, a regular expression is used to under-specify the structure2; another solution would be to use quasi-trees with extended dependencies (Vijay-Shanker, 1992)."]},{"title":"3 Paradigmatic relations","paragraphs":["As illustrated by Figure 2 and Formula (2), there are two types of paradigmatic relations between lemmas","2A stands for adjective, N for noun, Prep for preposition, V for verb, Det for determiner, Part for participle, and Adv for adverb. involved in the definition of term variations: morphological and semantic relations. The morphological family of a lemma l is denoted by the set"]},{"title":"FM(l)","paragraphs":["and its semantic family by the set"]},{"title":"FSL (l)","paragraphs":["or"]},{"title":"Fsc (l). Semantic","paragraphs":["family"]},{"title":"/~-~velocity","paragraphs":["Morphological family Semantic family Figure 2: Paradigmatic links between lemmas","Roughly speaking, two words are morphologically related if and only if they share the same root. In the preceding example,"]},{"title":"to measure","paragraphs":["and"]},{"title":"measure- ment","paragraphs":["are in the same morphological family because their common root is"]},{"title":"to measure.","paragraphs":["Let/: be the set of lemmas, morphological roots define a binary relation M from £ to/: that associates each lemma with its root(s): M E £ ~ £. M is not a function because compound lemmas have more than one root. The morphological family"]},{"title":"FM(l)","paragraphs":["of a lemma 1 is the set of lemmas (including l) which share a common root with l:"]},{"title":"Vle f~, FM","paragraphs":["(l) = {l' E /Z * 3r E /:, (/, r) E M A(/',r) E M} = M-I(M({I})) (4) 342 (liD(/:) is the power-set of £:, the set of its subsets.)","There are principally two types of semantic relations: direct links through a binary relation SL E /2 ~ £: or classes C E ~(l?(/:)). In the case of semantic links, the semantic family Fs~ (l) of a lemma 1 is the set of lemmas (including l) which are linked to l: FSL • IP(E) Vl E ~, FSL (l) = {l' • f~ * (l, Y) • SL} tJ {l} (5) = u {l} In the case of semantic classes, the semantic family Fsc (l) of a lemma l is the union of all the classes to which it belongs: (6) VleL, Fsc(l)= U","c U(l} (c~c)(̂tec)","Links and classes are equivalent, the choice of either model depends on the type of available semantic data. In the experiments reported here, direct links are used to represent data extracted from the word processor Microsoft Word97 because they are provided as lists of synonyms associated with each lemma. Conversely, the synsets extracted from WordNet 1.6 (Fellbaum, 1998) are classes of disambiguated lemmas and, therefore, correspond to the second technique.","With respect to the definitions of semantic and morphological families given in this section, the candidate variant (3) is such that V1 • FM(measurement) and N~ • FSL(speed) or N~ • Fsc (speed). 4 Morphological and Semantic","Families In the experiments on the English corpora, the CELEX database is used to calculate morphological families. As for semantic families, either WordNet 1.6 or the thesaurus of Microsoft Word97 are used. Morphological Links from CELEX In the CELEX morphological database (CELEX, 1998), each lemma is associated with a morphological structure that contains one or more root lemmas. These roots are used to calculate morphological families according to Formula (4). For example, the morphological family FM(measurementN) of the lemmas with measurev as root word is { commensurable A , commensurably Adv , countermeasureN, immeasurableA, immeasurablyAdv, incommensurableA, measurableA, measurablyAdv, measureN , measureless A , measurementN , mensurable A , tape-measureN, yard-measureN , measurev }. Semantic Classes from WordNet Two sources of semantic knowledge are used for the English language: the WordNet 1.6 thesaurus and the thesaurus of the word processor Microsoft Word97. In the WordNet thesaurus, disambiguated words are grouped into sets of synonyms--called synsets--that can be used for a class-based approach to semantic relations. For example, each of the five disambiguated meanings of the polysemous noun speed belongs to a different synset. In our approach, words are not disambiguated and, therefore, the semantic family of speed is calculated as the union of the synsets in which one of its senses is included. Through Formula (6), the semantic family of speed based on WordNet is: Fsc (speedN) = {speedN, speedingN, hurryingN, hasteningN, swiftnessN, fastnessN, velocityN, amphetamineN }. Semantic Links from Microsoft Word97 For assisting document edition, the word processor Microsoft Word97 has a command that returns the synonyms of a selected word. We have used this facility to build lists of synonyms. For example, FSn ( speed N ) = { speedN , swi]tnesss, velocityN , quicknessN , rapidityN , accelerationN , alacrityN , celerityN} (Formula (5)). Eight other synonyms of the word speed are provided by Word97, but they are not included in this semantic family because they are not categorized as nouns in CELEX. 5","Variations The linguistic transformations for the English language presented in this section are somehow simplified for the sake of conciseness. First, we focus on binary terms that represent 91.3% of the occurrences of multi-word terms in the English corpus [MEDIC]. Then, simplifications in the combinations of types of variations are motivated by corpus explorations in order to focus on the most productive families of variations. The 3 Dimensions of Linguistic Variations There are as many types of morphological relations as pairs of syntactic categories of content words. Since the syntactic categories of content words are noun (N), verb (V), adjective (A), and adverb (Adv), there are potentially sixteen different pairs of morphological links. (Associations of identical categories must be taken into consideration. For example, Noun-Noun associations correspond to morphological links between substantive nouns such as agent/process: promoter~promotion.) Morphological relations are further divided into simple relations if they associate two words in the same position and crossed relations if they associate a head word and an argument. Combining categories and positions, there are, in all, 64 different types of morphological relations. 343 In (Hamon et al., 1998), three types of"]},{"title":"semantic relations","paragraphs":["are studied: a link between the two head words, a link between the two arguments, or two parallel links between heads and arguments. These authors report that double links are rare and that their quality is low. They only represent 5% of the semantic variations on a French corpus and they are extracted with a precision of 9% only. We will therefore focus on single semantic links. Since we are only concerned with synonyms, only two types of semantic links are studied: synonymous heads or synonymous arguments.","The last dimension of term variability is the"]},{"title":"structural transformation","paragraphs":["at the syntagmatic level. The source structure of the variation must match a term structure. There are basically two structures of binary terms: X1 N2 compounds in which X1 is a noun, an adjective or a participle, and N1 Prep N~ terms. According to (Jacquemin et al., 1997), there are three types of syntactic variations in French: coordinations (Coot), insertions of modifiers (Modif), and compounding/decompounding (Comp). Each of these syntactic variations is further subdivided into finer categories."]},{"title":"Multi-dimensional Linguistic Variations","paragraphs":["The overall picture of term variations is obtained by combining the 64 types of morphological relations, the two types of semantic relations and the three types of syntactic variations (and their sub-types). There are different constraints on these combinations that limit the number of possible variations:","1. Morphological and semantic links must operate on different words. For example, if the head word is transformed by a morphological link, the only word available for a semantic link is the argument word.","2. The target syntactic structure must be compatible with the morphological transformations. For example, if a noun is transformed into a verb, the target structure must be a verb phrase. These two constraints influence the way in which a variation can be defined by combining different types of elementary modifications. Firstly, lexical relations are defined at the paradigmatic level: morphological links, semantic links or identical words. Then a syntactic structure that is compatible with the categories of the target words is chosen.","The list of variations used for binary compound terms in English is given in Table 1. 3 It has been experimentally refined through a progressive corpus-based tuning. The Synt column gives the target syntactic structure. The Morph column describes","3punctuations are noted Pu and coordinating conjunction CC. the morphological link: a source and a target syntactic category and the syntactic positions of the source and target lemmas. The Sere column indicates whether the variation involves a semantic link and the position of the lemmas concerned by the link (both lemmas must have an identical position). The"]},{"title":"Pattern","paragraphs":["column gives the target syntactic structure as a function of the source structure which is either X1N2, A1N2, or N1N2.","For example, Variation #42 transforms an Adjective-Noun term A1 N2 into N1 ((CC Det?) ? Prep Det ? (AIN[Part) °-a) N~ N1 is a noun in the morphological family of A1 (noted FM(A1)N) and N~ is semantically related with N2 (noted Fs(N2)). This variation recognizes malignancy in orbital turnouts as a variant of malignant tumor because malignancy and malignant are morphologically related, turnout and tumor are semantically related, and malignancyN inprep orbitaIA tumoursN matches the target pattern. Variation #56 is a more elaborated version of variation (2) given in Section 2."]},{"title":"Sample Syntactico-semantic Variants from","paragraphs":["[MEDIC] The first 36 variations in Table 1 do not contain any morphological link. They are built as follows. Firstly, the different structures of noun phrases are used as target structures. Twelve structures are proposed: head coordination (#1), argument coordination (#4), enumeration with conjunction (#7), enumeration without conjunction (#10), etc.","Then each transformation is enriched with additional semantic links between the head words or between the argument words. Semantic links between argument words are found in variations #(3n + 2)o<n<ll and between head words in variations #(3n)l<n<12. (Due to the lack of space, only variations #2 and #3 constructed on top of variation #1 are shown in Table 1.) Sample variants from [MEDIC] for the first 36 variations are given in Table 2. Some variations have not matched any variant in the whole corpus."]},{"title":"Sample Morpho-syntactico-semantic Variants","paragraphs":["Morpho-syntactico-semantic variations are numbered #37 to #62 in Table 1. Only 10 of the 64 possible morphological associations are found in the list of morphological links: Noun to Adjective on arguments (#37), Adjective to Noun on arguments (#39), etc. Each of these variations is doubled by adding a semantic link between the words that are not morphologically related. For example, variation (#40) is deduced from variation (#39) by adding a semantic link between the head words. Sample variants are given in Table 3. 344 Table 1: Patterns of semantic variation for terms of structure X1 N~. # Synt. Morph. Sere. Pattern 1 Coot -- 2 Coor -- Arg 3 Coor -- Head 4 Coor -- 7 Coor -- 10 Coor -- 13 Coor -- 16 Modif -- 19 Modif -- 22 Modif -- 25 Modif -- 28 Modif -- 31 Perm -- 34 Perm -- 37 Modif N--+A (Arg) -- 38 Modif N-+A (Arg) Head 39 Modif A-+N (Arg) -- 40 Modif A-+N (Arg) Head 41 Perm A--+N (Arg) -- 42 Perm A--+N (Arg) Head 43 Perm A--~N (Arg) -- 44 Perm A--4N (Arg) Head 45 Modif A-4Adv (Arg) -- 46","Modif A-+Adv (Arg) Head 47 Modif A-~A (Arg) -- 48 Modif A-~A (Arg) Head 49 Modif N-4N (Head) -- 50 Modif N-~N (Head) Arg 51 Modif N-+N (Arg) -- 52 Modif N~N (Arg) Head 53 Perm N-4N (Head) -- 54 Perm N-~N (Head) Arg 55 VP N--~V (Head) -- 56 VP N~V (Head) Arg 57 VP N--~V (Head) -- 58 VP N--~V (Head) Arg 59 NP N--cV (Head) -- 60 NP N-~V (Head) Arg 61 NP V--oN (Arg) -- 62 NP V--~N (Arg) Head Xl[sin] ((AINIPart) °-3 N Pu[','] ? CC) N2 Fs(X1)[sin] ((AINIPart) °-3 N Pu[','] ? CC) N2 Xl[sin] ((AINIPart) °-3 N Pu[','] ? CC) Fs(N2) X~[sin] (CC (AIN]Part) °-3) N2 X1 (Pu (A]NIPaxt) Pu ? CC (AINIPart)) N2 Xl[sin] (Pu (AINIPart) Pu (AINIPart) Pu ? CC (A[NIPart)) N~ Xl[sin] ((AINIPaxt) °-3 N Pu[','] CC) N2 X1 [sin] ((AIN]Part) °-3) N2 Xl[sin] (N Prep Det ? A T) N2 Xl[sin] (Pu[')'] (AIN]Part) ?) N2 X~[sin] (Pu['('] CC ? (AINIPaxt) ~-2 Pu[')']) N2 X,[sin] (Pu[','] (AINIPart)) N2 N: (V['be']lPu['(']) X1 N~ (V ? Prep Det ? (AIN]Paxt) °-3 ((N) CC Det?) ?) N1 FM(N1)A ((A]NIPart) °-3) N2 FM(Nz)A ((A[N]Paxt) °-3) Fs(N2) FM(A1)N ((AINIPart) °-3) N2 FM(Az)r~ ((AINIPart) °-3) Fs(N~) FM(At)N ((CC Det?) ? Prep Det ? (AINIPart) °-3) N2 FM(A1)N ((CC Det?) ? Prep Det ? (AINIPart) °-3) Fs(N2) N2 ((Prep Det?) ? (AIN]Paxt) °-3)"]},{"title":"FM(A1)N","paragraphs":["Fs(N2) ((Prep Det?) ? (AINIPart) °-3) FM(A1)N FM(A1)Adv ((AINIPart) °-a) N~ FM(A1)Adv ((AINIPart) °-3) Fs(N2) FM(A1)A ((AINIPart) °-3) N2 FM(A1)A ((AINIPart) °-a) Fs(N2) X1 ((AINIPart) °-3) FM(N2)N Fs(X1) ((AINIPaxt) °-a) FM(N2)N FM(N1)N ((AINIPart) °-a) N2 FM(N1)N ((AIN]Part) °-3) Fs(N2) FM(N2)N (Prep (AINIPart) °-3) N1 FM(N2)N (Prep (AINIPart) °-3) Fs(N1) FM(N2)v (Adv ? Prep ? (Det (N) ? Prep) ? Det ? (AINIPaxt) °-a) N1 FM(N2)v (Adv ? Prep ? (Det (N) ? Prep) ? Det ? (AINIPart) °-3) Fs(Nt) Nt ((N) ? V['be'] 7) FM(N2)v Fs(N1) ((N) ? V['be'] 7) FM(N~)v As ((AIN]Part) °-~ ((N) Prep) ?) FM(N~)v Fs(At) ((AIN[Part) °-2 ((N) Prep) ?) FM(N2)v FM(V1)N ((AINIPart) °-3) N2 FM (Vt)N ((AINIPart)°-3)Fs (N~) 6","Evaluation We provide two evaluations of term variant conflation. First, we calculate precision rates through a manual scanning of the variants. Secondly, we evaluate the numbers of variations extracted through the four experiments. Precision Because of the large volumes of data, only experiments on the French corpus are evaluated. [AGRIC] + AGROVOC produces 2,739 variations and 2,485 of them are selected as correct. Since the number of synonym links proposed by Word97 is higher, the number of variants produced by [AGRIC] + Word97 is higher: 3,860. 3,110 of them are accepted after human inspection.","The two experiments produce the same set of non-semantic variants (syntactic and morpho-syntactic variants). Associated values of precision are reported in Tables 4 and 5. The semantic variations are divided into two subsets: \"pure\" semantic variations and semantic variations involving a syntactic transformation and/or a morphological link. Their precisions are given in Tables 6 and 7.","As far as precision is concerned, these tables show that variations are divided into two levels of quality. On the one hand, syntactic, morpho-syntactic and pure semantic variations are extracted with a high level of precision (above 78%, see the \"Total\" values in Tables 4 to 6). On the other hand, the 345 Table 2: Sample variants from [MEDIC] using the variations from Table 1 (#1 to #36). # Term Variant 1 cell differentiation 2 primary response 3 pressure decline 4 adipose tissue 5 extensive resection 6 clinical test 7 adipic acid 8 morphological change 9 clinical test 10 electrical property 12 hypothesis test 16 acidic protein 17 absorbed dose 18 cylindrical shape 19 assisted ventilation 20 genetic disease 21 early pregnancy 22 intertrochanteric fracture","25 arteriovenous fistula","27 pressure measurement","28 identification test 29 electrical stimulus 31 combined treatment 32 genetic disease 33 increased dose 34 acrylonitrile copolymer 35 development area 36 cell death cell growth and differentiation basal secretory activity and response pressure rise and fall adipose or fibroadipose tissue wide or radical resection clinical and histologic examinations adipie, suberic and sebacic acids morphologic, ultrastrucrural and immunologic changes clinical, radiographic, and arthroscopic examination electrical, mechanical, thermal and spectroscopic properties hypothesis, comparability, randomized and non-randomized trials acidic epidermal protein ingested human doses cylindrical fiberglass cast assisted modes of mechanical ventilation hereditary transmission of the disease early stage of gestation intertrochanteric ) femoral fractures arteriovenous (A V) fistulas pressure (SBP) measure identification, sensory tests electric, acoustic stimuli treatments were combined disease is familial dosage was increased copolymer of aerylonitrile areas of growth destruction of the virusinfected cell Table 3: Sample variants from [MEDIC] using the variations from Table 1 (#37 to #62). Term Variant 37 cell component cellular component 38 work place workable space 39 embryonic developembryo development ment 40 angular measure-angles measure ment 41 deficient diet deficiency in the diet 42 malignant tumor malignancy in orbital turnouts 43 cerebral cortex cortex of the cerebrum 44 surgical advanceadvance in middle ear ment surgery 45 inappropriate secreinappropriately high TSH tion secretion 46 genetic variant genetically determined variance 47 fatty meal fat meals 48 optical system optic Nd-YA G laser unit 49 drug addiction drug addicts 50 simultaneous meaconcurrent measures surement 51 saline solution salt solution 52 flow limit airflow limitation 53 bile reflux flux of bile 55 measurement techmeasuring technique nique 57 age estimation estimating gestational age 58 density measure-measured COHb eoncen-ment trations 59 blood coagulation blood coagulated 60 concentration meadensity was measured surement 61 combined treatment combination treatment Table 4: Precision of syntactic variant extraction ([AGRIC] corpus). Coor Modif Comp Total 97.2% 88.7% 98.0% 95.7% Table 5: Precision of morpho-syntactic variant extraction ([AGRIC] corpus). A to N N to A N toN N to V Total 68.5% 69.6% 92.1% 75.3% 84.6% 346 Table 6: Precision of semantic variant extraction ([AGRIC] corpus). Word97 AGROVOC Sem Arg 76.3% 88.9% Sere Head 82.7% 91.3% Total 78.1% 91.0% Table 7: Precision of semantico-syntactic variant extraction ([AGRIC] corpus). texts in which words are disambiguated. Numbers of Variants Table 8 shows the numbers of term variants extracted by the four experiments. For each experiment and for each type of variation, three values are reported: the number of variants v of this type and two percentages indicating the ratio of these variants. The first percentage is ~ in which V is the total number of variants produced by this experi-","v in which T ment. The second percentage is is the number of (non-variant) term occurrences extracted by this experiment. Word97 AGROVOC Coor + sem 44.8% 62.6% Modif Jr sem 55.6% 87.5% A to N -1- sem 44.9% 0.0% N to A + sere 21.3% 0.0% N to N d- sem 0.0% 60.0% N to V d- sere 24.2% 44.4% Total 29.4% 55.0% combination of semantic links with syntax or with morphology results in poor precision (55% precision in average with the AGROVOC semantic links and 29.4% precision with the Word97 links, see line \"Total\" in Table 7).","The lower precision of hybrid variations is due to a cumulative effect of semantic shift through combined variations. For instance,"]},{"title":"former un rdseau continu","paragraphs":["(build a continuous network) is incorrectly extracted as a variant"]},{"title":"of formation permanente","paragraphs":["(continuing education) through a Noun-to-Verb variation with a semantic link between argument words. The verb"]},{"title":"former","paragraphs":["and the associated deverbal noun"]},{"title":"formation","paragraphs":["are two polysemous words. In"]},{"title":"formation permanente,","paragraphs":["the meaning is related to a human activity"]},{"title":"(to train)","paragraphs":["while, in"]},{"title":"former un rdseau continu,","paragraphs":["the meaning is related to a physical construction"]},{"title":"(to build).","paragraphs":["Despite the relatively poor precision of hybrid variations, the average precision of term conflation is high because hybrid variations only represent a small fraction of term variations (5.4% and 0.9%, see lines '% sem\" in Table 8 below). The average precision on [AGRIC] + Word97 is 79.8% and the average precision on [AGRIC] + AGROVOC is 91.1%.","The exploitation of semantic links extracted from WordNet in term variant extraction does not suffer from the problem of ambiguity pointed out for query expansion in (Voorhees, 1998). The robustness to polysemy is due to the fact that we are dealing with multiword terms that build restricted linguistic con-","The last line of Table 8 shows that variants represent a significant proportion of term occurrences (from 27.3% to 37.3%). The distribution of the different types of variants depends the semantic database and on the language under study. WordNet 1.6 is a productive source of knowledge for the extraction of semantic variants: In the experiment [MEDIC] + WordNet, semantic variants represent 58.6% of the variants, while they only represent 4.9% of the variants in the [AGRIC] + AGROVOC experiment. These values are reported in the line \"Tot. Sem\" of Table 8. Such results confirm the relevance of non-specialized semantic links in the extraction of specialized semantic variants (Hamon et al., 1998). 7","Conclusion The model proposed in this study offers a simple and generic framework for the expression of complex term variations. The evaluation proposed at the end of this paper shows that term variations are extracted with an excellent precision for the three types of elementary variations: syntactic, morpho-syntactic and semantic variations. The best performance is obtained with WordNet as source of semantic knowledge. Ongoing work on German, Japanese and Spanish shows that such a transformational and paradigmatic description of term variability applies to other languages than French and English reported in this study. Acknowledgement We would like to thank Jean Royaut@ and Xavier Polanco (INIST-CNRS) for their helpful collabora-tion. We are also grateful to B6atrice Daille (IRIN) for running her termer ACABIT on the data and to Olivier Ferret (LIMSI) for the Word97 macro-function used to extract the thesaurus. References AGROVOC. 1995."]},{"title":"Thdsaurus Agricole Multi- lingue.","paragraphs":["Organisation de Nations Unies pour l'Alimentation et l'Agriculture, Roma. 347 Table 8: Numbers of term variants. [AGRIC] [AGRIC] [MEDIC] [MEDIC] + Word97 + AGROVOC + WordNet + Word97 v v v v v v v v V ~\" VTT V V V'~T V V V~T V V V'~T Terms (T) Coor Modif Comp Perm Tot. Synt AtoA A to Adv AtoN NtoA NtoN NtoV VtoN Tot. Mor Sem Arg Sem Head Coor + sem Modif + sere Perm + sere A to A + sem A to Adv + s. A to N + sere N to A + sem N to N + sem N to V + sere N to V + sere Tot. Sem Variants (V) 5325 x 63.1% 173 5.6% 2.1% 346 11.1% 4.1% 1045 33.6% 12.4% × X X 1564 50.3% 18.5% 5325 x 68.2% 173 7.0% 2.2% 346 14.0% 4.4% 1045 42.1% 13.4% × X X 1564 62.9% 20.0% 25561 x 62.7% 531 3.5% 1.3% 1985 13,1% 4.9%","X X X 1146 7,5% 2.8% 3662 24.1% 9.0% 25561 x 72.7% 531","5.5% 1.5% 1985 20.7% 5.6%","× X X 1146 11.9% 3.3% 3662 38.1% 10.4% 17 0.5% 0.2% × × X 89 2.9% 1.1% 78 2.5% 0.9% 545 17.5% 6.5% 70 2.2% 0.8% × X X 17 0.7% 0.2% X × X 89 3.6% 1.1% 78 3.1% 1.0% 545 21.9% 7.0% 70 2.8% 0.9% )< × × 191 1.3% 0.5% 35 0.2% 0.1% 640 4.2% 1.6% 102 0.7% 0.3% 416 2.7% 1.0% 1230 8.1% 3.0% 21 0.1% 0.1% 191","2.0% 0.5% 35 0.3% 0.1% 640 6.7% 1.8% 102 1.1% 0.3% 416 4.3% 1.2% 1230 12.8% 3.5% 21 0.2% 0.1% 2635 27.4% 7.5% 799 25.7% 9.5% 180 5.8% 2.1% 397 12.8% 4.7% 30 1.0% 0.4% 100 3.1% 1.2% X X × 0 0.0% O.0% 0 0.0% 0.0% 22 0.7% 0.3% 10 0.3% 0.1% 0 O.0% 0.O% 8 0.3% 0.1% )< X × 747 24.0% 8.9% 3110 X 36.9% 799 32.2% 10.2% 16 0.6% 0.2% 84 3.4% 1.1% 5 0.2% 0.1% 7 0.3% 0.1% X X × 0 0.0% 0.0% 0 0.0% 0.0% 0 O.O% O.0% 0 0.0% O.O% 6 0.2% 0.1% 4 0.2% 0.1% × X × 122 4.9% 1.6% 2485 x 31.8% 2635 17.3% 6.5% 912 6.0% 2.2% 2555 16.8% 6.3% 183 1.2% 0.4% 3467 22.8% 8.5% 788 5.2% 1.9% 82 0.5% 0.2% 22 0.1% 0.1% 256 1.7% 0.6% 72 0.5% 0.2% 102 0.7% 0.3% 454 3.0% 1.1% 11 0.1% 0.0% 8904 58.6% 21.8% 15201 X 37.3% 629 6.6% 1.8% 698 7.3% 2.0% 102","1.1% 0.3% 1067 11.1% 3.0% 369 3.8% 1.0% 42 0.4% 0.1% 8 0.1% 0.0% 118 1.2% 0.3% 28 0.3% 0.1% 58 0.6% 0.2% 185 1.9% 0.5% 2 0.0% 0.0%","3306 34.4% %9.4 9603 x 27.3% CELEX. 1998. www. talc. upenn, edu/ readme_fi tes/ce fez. teatime, htmt. Consortium for Lexical Resources, UPenn.","Christiane Fellbaum, editor. 1998. WordNet: An Electronic Lexical Database. MIT Press, Cambridge, MA.","Thierry Hamon, Adeline Nazarenko, and Cdcile Gros. 1998. A step towards the detection of semantic variants of terms in technical documents. In Proceedings, COLING-A CL'98, pages 498-504, Montreal.","Christian Jacquemin, Judith L. Klavans, and Evelyne Tzoukermann. 1997. Expansion of multi-word terms for indexing and retrieval using morphology and syntax. In ACL - EACL'97, pages 24-31, Madrid.","MULTEXT. 1998. www..~p t. univ-ai~, fv/ p~'ojects/muttezt/. Laboratoire Parole et Langage, Aix-en-Provence.","Gerard Salton and Michael J. McGill. 1983. Introduction to Modern Information Retrieval. Mc-Graw Hill, New York, NY.","Stuart N. Shieber. 1992. Constraint-Based For-malisms. A Bradford Book. MIT Press, Cambridge, MA.","Karen Sparck Jones and John I. Tait. 1984. Automatic search term variant generation. Journal of Documentation, 40(1):50-66.","K. Vijay-Shanker. 1992. Using descriptions of trees in a Tree Adjoining Grammar. Computational Linguistics, 18(4):481-518, December.","Ellen M. Voorhees. 1998. Using wordnet for text retrieval. In Christiane Fellbaum, editor, WordNet: An Electronic Lexical Database, pages 285-303. MIT Press, Cambridge, MA. 348"]}]}
