{"sections":[{"title":"Lexical Semantics to Disambiguate Polysemous Phenomena of Japanese Adnominal Constituents Hitoshi Isahara","paragraphs":["and Kyoko Kanzaki","Communications Research Laboratory","588-2 Iwaoka, Iwaoka-cho, Nishi-ku Kobe, Hyogo, 651-2401, Japan {isahara, kanzaki}~crl.go.jp Abstract We exploit and extend the Generative Lexicon Theory to develop a formal description of adnominal constituents in a lexicon which can deal with linguistic phenomena found in Japanese adnominal constituents. We classify the problematic behavior into \"static disambiguation\" and \"dynamic disambiguation\" tasks. Static disambiguation can be done using lexical information in a dictionary, whereas dynamic disambiguation requires inferences at the knowledge representation level. 1","Introduction Natural language processing must disambiguate polysemous constituents in"]},{"title":"the input","paragraphs":["sentences. A good description of information necessary for disambiguation in the lexicon is crucial in high quality NLP systems. This paper discusses the treatment of linguistic phenomena in Japanese adnominM constituents and it focuses on how to generate the same semantic representation from different syntactic structures, and how to generate different semantic representations from a semantically ambiguous sentence. We exploit and extend the Generative Lexicon Theory (Pustejovsky, 1995; Bouillon, 1996) to develop a formal description of adnominal constituents in a lexicon which can offer a solution to these problems.","We classify the problematic behavior of Japanese adnominal constituents into \"static disambiguation\" and \"dynamic disambiguation\" tasks. Whereas static disambiguation can be done using the lexical information in a dictionary, dynamic disambiguation needs inferences at the knowledge representation level. This paper mainly discusses dynamic disambiguation. 2","Classification of the Usage of","Japanese Adnominal Constituents On consideration of the syntactic relations between adnominal constituents and their head nouns, we find that some adnominal constituents can appear both in the attributive and predicative positions (Sakuma, 1967; Martin, 1975; Makino and Tsutsui, 1986). However, some adjectives express different meanings when they appear in one or the other position and some adjectives can appear only in one of these two positions (Hashimoto and Aoyama, 1992). We have classified the semantic relations between adnominal constituents and their modified nouns, based on whether the paraphrasing from attributive position to predicative position is possible or not. There are three possibilities:","(Type A)A paraphrase can be made without changing the modifying relations semantically. Ad. + N -, N $~"]},{"title":"(ga)","paragraphs":["Ad. (N is Ad.)","Ad. = Adnominal constituent","N = Head noun of noun phrase which","is modified by Ad.","(Type B) A paraphrase can be made only when a noun is restricted by its context: the presence of modifiers or determiners, e.g., articles. Ad. + N --* ~:¢)(sono)"]},{"title":"N F~ (wa)","paragraphs":["Ad."]},{"title":"(that N is Ad.)","paragraphs":["(Type C) A paraphrase cannot be made at all, i.e., only the attributive position is available. Ad. + N --~ *none.","We can classify semantic relations between adnominal constituents and their head nouns into three types by the use of paraphrase. Paraphrases exist for both Type A and Type B, however, a paraphrase cannot be made at all for Type C. This difference is based on the fact that adnominal constituents in types A and B modify the referents of their modified nouns, while adnominal constituents in Type C do not modify their head nouns directly. Type C adnominal constituents modify (a) only a part of the meanings which their modified nouns allow, (b) the contents of the referents of their modified nouns, or (c) the states of being of the referents of their modified nouns. In this paper, we do not describe"]},{"title":"the","paragraphs":["semantic relations of (b) in detail but discuss 489 the semantic relations of (a) and (c) in the following section.","There is a set of adnominal constituents which has the function of both adnominal and adverbial constituents (Teramura, 1991), and the third relation (c) above is the adverbial semantic relation which holds between adnominal constituents and their head nouns."]},{"title":"3 Classification of Problematic Behavior of Japanese Adnominal Constituents","paragraphs":["It is important for the analysis of adjectives to con-sider what its head noun denotes in the sentence (Bouillon, 1996). Also, when we analyze word meanings, it is important to take both context and our world knowledge into account (Pustejovsky, 1995; Lascarides and Copestake, 1998). In this section, the behavior of Japanese adnominal constituents is classified into three types, depending on how the semantic representation of noun phrases is generated from information in the lexicon (Kanzaki and Isahara, 1997; Kanzaki and Isahara, 1998).","The types are: (1) the type where one must infer the attribute of the modified noun which is expressed by the adnominal constituent, (2) the type which necessitates inferences that change the structures of the semantic representation, and (3) the type whose adnominal constituents do not add information to the modified nouns but constrain the relations between constituents in the text. These types are explained in this section. Both semantic types A and B correspond to syntactic types 1 and 2. Type C corresponds to type 3. 3.1","Adnominal Constituents that Express","the Attributes of the Modified Noun","[Static disambiguation] This is the case where an adnominal constituent modifies a head noun semantically. Adnominal constituents modify nominals syntactically and most of these modify their head nouns semantically. Here, the \"analysis\" of the relationship between adnominal constituents and their head nouns concerns the choice of the particular attribute of the nouns which adnominal constituents modify. There are two types of inferences for disambiguation. 3.1.1 Adnominal Constituents that Express Unique Inherent Attributes of the Modified Noun This is the case in which the relation between the adnominM constituent and its modified noun, i.e., what slot of the modified noun the modifier fills, can be predicted. In Example 1,"]},{"title":"F@$~P~Tk (yuruyaka_na,","paragraphs":["gentle)_l is the attribute value of an instance of the concept I-~ t"]},{"title":"(keisha,","paragraphs":["slope)J . The instance [-{~"]},{"title":"~r (keisha,","paragraphs":["slope)J involves a unique inherent attribute, i.e., \"the angle (degree) of the slope,\" therefore"]},{"title":"r@~-~,~ (yuruyaka_na,","paragraphs":["gentle)J is taken to be a value on the scale of the slope. The noun in this example has a unique inherent attribute whose value is number or intensity. Example 1"]},{"title":"yuruyaka_na keisha ,","paragraphs":["gentle slope Japanese pronunciation literal translation 3.1.2 KEISHA (slope) YURUYAKA_NA (gentle)"]},{"title":"]degree I Adnominal Constituents that","paragraphs":["Express One of the Major Attributes of the Modified Noun This is the case in which the NLP system must identify the slot of the modified noun which is filled by the modifier. Most nouns do not have a unique inherent attribute but have several attributes that adnominal constituents may embody. In Example 2, [-:~1"]},{"title":"(otoko,","paragraphs":["man)J has several major attributes, e.g., name, age, character, and physique. An understanding system must choose a suitable attribute (i.e., physique in this example) to plug information in from these attributes. Example 2"]},{"title":"oogara_na","paragraphs":["large otoko man OTOKO (man) ~,~ age [ I\"- OOGARA_NA (large) name I ' ~._1\" physique/ vJ , character ~ [ ]","These types of adjectives can appear both in the predicative position and in the attributive position without changing their meanings (Sakuma, 1967; Teramura, 1991; Hashimoto and Aoyama, 1992)."]},{"title":"r:gk:~: (oogara_na,","paragraphs":["large)J in Example 2 can appear in predicative position, i.e., I-~:¢)~IJ~Jk:~"]},{"title":"(sono otoko wa oogara_da,","paragraphs":["that man is large)_l , with the same meaning that the man has a big physique.","We cannot decide on one particular attribute of the head noun without suitable semantic information. Also, still another problem remains here, that 490 is to identify whether the sentence needs a generic reading or whether it represents an instance of the concept. 3.2 Adnominal Constituents that Express","Attributes of the Situation Inferred","from the Modified Noun [Dynamic","disambiguation 1] In some cases, adnominal constituents do not modify instances of nouns themselves, but modify, instead, instances of events, situations, or knowledge that are inferred from (the context of) the modified noun. 3.2.1 The Case in which New Elements","must be Infered in the Semantic","Representation There are cases in which we have to infer new elements in the semantic representation so as to represent semantic relations between adnominal constituents and their modified nouns.","In Example 3, the adjective modifies some event participated in by the household members. A house cannot have a temporal scale as an attribute, however, an event, in this example, spring-cleaning, can be inferred from the context and therefore the adjective F~w"]},{"title":"(hayai,","paragraphs":["early)J can modify the event, e.g., the beginning time of spring-cleaning.","However, its computational implementation is not so simple, because there are metonymic extensions going on in this example. For example, even if an NLP system can find \"spring-cleaning\" in the context as an event whose \"begining-time\" is \"early,\" the system must infer the people living there from \"house\" and identify him/her as an agent of the spring-cleaning.","Some of these inferences are done using syntactic structure in English, however , that is not possible in Japanese. Such metonymic extensions are essential for determining the nature of the modifier/modified relationships in Japanese (Matsumoto, 1993). Example 3"]},{"title":"(oosoji_no) hayai ie","paragraphs":["(spring-cleaning) early house \"The house whose member begins spring-cleaning early.\" OOSOJI HAYAI (early) (spring-cleanin~) , [ I beginning-time --------~"]},{"title":"- II 'HITO( on)","paragraphs":["IE (house) I ]member ] ..--1 3.2.2 The Case in which a Concept must","be Converted into a Set of Concepts Adnominal constituents sometimes do not modify nouns as a whole but modify only specific features of a noun. Example 4 is ambiguous. The \"as a whole\" interpretation is that this person likes something and he/she is abnormal as a whole, i.e., this person has some mental disorder. The \"specific\" interpretation is that this person likes something abnormally, i.e., the way this person likes something is abnormal, i.e., this person is crazy about something x. Ambiguities of ['~,~"]},{"title":"(ijo_na,","paragraphs":["abnormal)_l in Example 4 will be discussed systematically below. Example 4"]},{"title":"ijo_na sensei-jutsu_no aikosha","paragraphs":["abnormal astrology enthusiast, one who likes something very much As a whole interpretation IJO AIKOSHA SENSEI-JUTSU abnormal) (enthusiast) (astrology)"]},{"title":"I Specific interpretation","paragraphs":["IJO AIKO-SURU SENSEI-JUTSU (abnormal) (like) (astrology) object object ~ [","To treat the \"specific\" interpretation, the system has to perform the concept conversion (Isahara and Uchida, 1995) shown in Figure 1.","As for the \"as a whole\" interpretation, an adnominal constituent modifies an extension of the modifiee (e.g., what is abnormal is a person who is an astrology enthusiast). Therefore, the object slot of (an instance of) \"abnormal\" is filled by (an instance of) \"enthusiast.\" In the \"specific\" interpretation, however, an adnominal constituent modifies part of the intensions to which the modifiee refers (e.g., what is abnormal is the way that person likes something). An analysis module converts the semantic structure (Figure 1) and the object slot of (an instance of) \"abnormal\" is filled by (an instance of) \"like\" which is extracted by the concept conversion.","1There is one more interpretation that \"an enthusiast who likes abnormal astrology,\" however, this interpretation is odd in this example. 491"]},{"title":"AIKOSHA (enthusiast) something Concept Conversion AIKO-SURU like) something object~ 'l agent----[-] [ ] ~HITO (perTn) \"enthusiast\" J Figure 1: Concept Conversion The concept conversion is, in a sense, a paraphrase of the original expression. The concept conversion is also useful in analyzing Example 5. Example 5 sensei-jutsu_no ijo_na aikosha astrology abnormal enthusiast Example 5 is not ambiguous, i.e., the only inter- pretation is % person who likes astrology abnor- mally,\" because the \"as a whole\" interpretation is not possible. Example 5 can be paraphrased into the phrase shown in Example 6. If I-~ (sensei- jutsu, astrology)A is semantically an object of r~ ~-\"f B (aiko_suru, like)A, r~$~c (ijo_ni, abnor- mally)2 cannot modify r~ (mono, person)J , be- cause the dependencies in this interpretation cross each other. Example 6 sensei-julsu_wo ijo_ni aiko_suru mono astrology abnormally like person Example 7 exhibits the adnominal constituent F~?~ (ijo, abnormal)J in a predicative position. Using the extension of the Late Closure strategy (Frazier, 1979), only the \"as a whole\" interpretation is possible. Example 7 aikosha_ga ijo_da enthusiast abnormal \"The enthusiast is abnormal.\" 3.3 Adnominal Constituents that Constrain the Relations between Constituents in the Text [Dynamic disambiguation 2] 3.3.1 Adnominal Constituents that do not Add Information to their Modified Nouns Directly Adnominal constituents mostly modify nouns syn- tactically and also semantically. However, some adnominal constituents work differently, i.e., they modify nouns syntactically but not semantically. Japanese nominal adjectivals F~: (junsui_na, pure)A, F~.~::~: (kanzen_na, perfect/complete).] and [-:~ < (mattaku, entire).] are typical examples of this type. 1-i~4~ (junsui_na, pure)A in Examples 8-10 and [-~.~: (kanzen_na, complete)_l in Examples 11-13 play different semantic roles. Example 8 junsui_na pure \"pure water\" Example 9 t~at ekkyo_wa border transgression mizu water junsui_na seiji_bomei datta. pure political (copula, flight past) \"The border transgression was a pure political flight.\" Example 10 junsui_na churitsu_wa mutsukashii. pure/strict neutrality difficult \"Strict neutrality is difficult.\" Example 11 kanzen_na shisutemu dewa nai. complete system (copula) (negation) \"This is not a complete (perfect) system.\" Example 12 nousakumotsu_wa kanzen_na syohizai dearu. farm products complete consumer (copula) products \"Farm products are nothing but consumer products.\" Example 13 kanzen_na mujin_no yakala complete uninhabited house \"absolutely uninhabited house\" 492","paragraphs":["In Example 8,"]},{"title":"Fi~ (junsuLna,","paragraphs":["pure)J describes the purity of water, i.e., it describes something within the \"water\" concept. The adnominal constituent I-gk:~Tz"]},{"title":"(oogara_na,","paragraphs":["large)J , in Example 2, expresses a value of an attribute of the modifiednoun, i.e., [-~"]},{"title":"(oloko,","paragraphs":["man)J . In contrast, the adnominal constituent [-~"]},{"title":"(junsui_na,","paragraphs":["pure)J , in Example 8, does not express a value of an attribute of the modified noun, i.e.,"]},{"title":"FT]( (raizu,","paragraphs":["water)] , but expresses the way some values fill attributes of this modified noun. That is \"nothing but water is a filler of an attribute of the referent.\" In Example 11,"]},{"title":"F-~_/k (kanzen_na,","paragraphs":["complete)] describes the completeness of a system as well, i.e., it describes something within the \"system\" concept, e.g., the function of the system. (Case 1)","In Example 9, Fi~"]},{"title":"(junsuLna,","paragraphs":["pure).l does not add information as to the purity of this political flight, however, it describes that there is only one purpose (or motivation), i.e., political flight, for this \"border transgression.\" In other words, there is no other motivation, such as sightseeing or economic reasons, which would explain this action. {-~,~:"]},{"title":"(junsui_na,","paragraphs":["pure)J describes something outside of the \"political flight\" concept. In Example 12, r~"]},{"title":":~.~ (kanzen_na,","paragraphs":["complete)J plays a very similar role to that in Example 9. It notes that there is only one purpose, i.e., consumer products, which describes \"farm products.\" In other words, there are no other usages, such as raw materials, for these products. (Case 2)","Both referents in Examples 8 and 9 are still \"water\" or \"political flight\" even if they are not \"pure,\" however, Example 10 means that strict neutrality is difficult, and \"not pure\" neutrality is not a neutrality in the strict sense of the word."]},{"title":"['~4~ (jnn- suLna,","paragraphs":["pure)3 describes the concept \"neutrality\" itself. As for Example 13, \"not absolutely\" uninhabited is not uninhabited in the strict sense of the word, as well. (Case 3)","There are similar phenomena involving many other adnominal constituents in Japanese. Formal treatment of these phenomena will be discussed in Section 4.1. 3.3.2 Adnominal Constituents which","Represents a State of Being Some adnominal constituents, e.g., F:~/:~"]},{"title":"(rippa_na,","paragraphs":["splendid)] can be used in attributive po-","sition so as to express the state of the modified noun. In Example 14, the adnominal constituent [-3~"]},{"title":"(rippa_na,","paragraphs":["splendid)J does not describe aspects of an island itself, but the nature of what is required for it to be considered an island. In other words \"this really is an island, not a large rock.\" Example 14"]},{"title":"rippa_na sh~ma","paragraphs":["(splendid) (island) \"Once this ocean mountain is elevated, or as we described above, its top appears above the ocean from the sea level falling, it will be a real island.\"","Whereas adnominal constituents in Examples 8 and 11 can appear both in the attributive position and in the predicative position without changing their meanings, and Examples 9, 10, 12 and 13 cannot appear in the predicative position without changing their meanings, when this F~&"]},{"title":"(rippa_na,","paragraphs":["splendid)J occurs in a predicative position, i.e.,"]},{"title":"F~h~ \"¢t:_~7~ (shima ga rippa_da)J,","paragraphs":["it means that \"the island is splendid,\" a state of the island s . As [--0:~"]},{"title":"(rippa_na,","paragraphs":["splendid) ~"]},{"title":"(shima,","paragraphs":["island)J without context has two interpretations, i.e., describing aspects of an island itself, \"the island is splendid,\" and describing the nature of what is required for it to be considered an island, when an NLP system analyzes this noun phrase, the system has to choose a suitable interpretation from these two possibilities in the context of the semantic relations between adnominal constituents and their modified nouns. Furthermore, in order to interpret the semantic relations between adnominal constituents and their modified nouns, it is sometimes necessary to infer instances of newly introduced concepts using both contextual and world knowledge. Example 3, I--~"]},{"title":"(hayai,","paragraphs":["early) ~"]},{"title":"(ie,","paragraphs":["house)_] , in Section 2.2.I illustrates this. It is important for a lexical semantic system to take both context and our world knowledge into account. We should analyze semantic functions of lexical items from several points of View."]},{"title":"4 Formal Treatment of Problematic Phenomena of Japanese Adnominal Constituents","paragraphs":["In this section we discuss the formal treatment of the phenomena described in Section 3.3.1, i.e., Cases 1, 2 and 3. 4.1 Hypothesis and Definition To handle these phenomena, we have established the following hypothesis and definition.","2 \"Real\" is a similar example in English. \"A real friend\" means \"true friend\" and \"His friend is real\" means \"his friend is not imaginary.\" 493"]},{"title":"[HYPOTHESIS]","paragraphs":["(a) There is something which can be shared by a plural number of constituents, e.g., there is some semantic definition which can contain/represent/embody/refer to various items. (b)"]},{"title":"Fi~IC~Z (junsui_na,","paragraphs":["pure)J works to constrain this number to one.","Extending the Generative Lexicon format, something pure is represented as"]},{"title":"Az[stg(x) A Telic = !1 Ae[~oa,~ob, ~c,...]]","paragraphs":["Here, '!1' is a function which restricts the number of its element to one. [DEFINITION]"]},{"title":"F~Z Uunsui_na,","paragraphs":["pure)3 is represented as"]},{"title":"pure ~ ASemN.ANewArg.[p(SemN, NewArg)] (1)","paragraphs":["Here,"]},{"title":"SemN","paragraphs":["and"]},{"title":"NewArg","paragraphs":["are underspecified types.","In syntax, an adnominal constituent takes a noun as a syntactic argument and returns the same syntactic category (i.e., a noun). Semantically, it takes the semantics of the noun first, and returns the semantics of a one-place function, that is it narrows the semantic definition of the noun.","Starting from (1), suppose we define 'p' as follows: Case 1"]},{"title":"(SemN","paragraphs":["is constitutive/mass material therefore"]},{"title":"NewArg","paragraphs":["is too.):"]},{"title":"p ~ Vy.[~(SemN(y)) --~ ~(y E NewArg)]","paragraphs":["This is logically equivalent to the following:"]},{"title":"p ~ ~3y.[~(SemN(y)) A (y e UewArg)] (3)","paragraphs":["In Example 8, Fi~:"]},{"title":"Ounsui_na,","paragraphs":["pure) ;t~"]},{"title":"(mizu,","paragraphs":["water)J ,"]},{"title":"SemN","paragraphs":["is water and"]},{"title":"NewArg","paragraphs":["is some liquid referred to by this example sentence. That is \"anything that is not water does not exist in this liquid.\" Case 2"]},{"title":"(SemN","paragraphs":["is individual entity/event.):"]},{"title":"p VU.[- (u=SemN) --~ ~(view( NewArg,","paragraphs":["y))]"]},{"title":"(4)","paragraphs":["In Example 9,"]},{"title":"Fi~i~#-J: (ekkyo_wa,","paragraphs":["border transgression) ~"]},{"title":"(junsui_na,","paragraphs":["pure) ~'~I:~"]},{"title":"(seiji_bomei,","paragraphs":["political flight)"]},{"title":"f~-9 f~o ( datta,","paragraphs":["(copula, past))3 ,"]},{"title":"SemN","paragraphs":["is"]},{"title":"\"a","paragraphs":["political flight.\" The sentence refers to the fact that \"the border transgression is a pure political flight.\" Thus, it is associated with the interpretation of NewArg, that is there is only one view of this action (border transgression), i.e., \"political flight.\"","It seems that the semantics of \"pure\" shares the basic logical structure as seen in (2), (4), however, case 3 requires a different treatment. Case 3"]},{"title":"(SemN","paragraphs":["is predicate/state.): If"]},{"title":"SernN","paragraphs":["is a predicate/state"]},{"title":"P, NewArg","paragraphs":["is generated as a sortal array of P and ~P. The binary predicate is coerced into a polar predicate. As for Example 10, neutrality is originally a binary sortal predicate, that is"]},{"title":"VP[neutrality(P) V neutrality(~P)].","paragraphs":["In this case, neutrality is coerced into two polar predicates, i.e., c~ which denotes \"strictly neutral\" and/3 which denotes \"strictly not neutral.\" '~ a' and '~ fl' denote \"not strictly\" neutral, or a range of situation which can be considered as neutral. 4.2 Adnorninal Constituents and Adverbial"]},{"title":"Constituents","paragraphs":["Japanese nominal adjectivals, such as F~"]},{"title":"(junsui,","paragraphs":["pure)_l , are inflected as follows 3."]},{"title":"F~(2~CZ (junsui_na,","paragraphs":["pure)J , adnominal"]},{"title":"FEW- OunsuLni,","paragraphs":["purely)_l , adverbial"]},{"title":"F~2~ (junsuLsa,","paragraphs":["purity)J < nominal The nominal adjectival Fi~d~"]},{"title":"(junsui,","paragraphs":["pure(ly))J modifies Fi~g::~"]},{"title":"(seiji-bomei,","paragraphs":["political flight)J syntactically in Example 15 (adnominal) and modifies"]},{"title":"Ffg-gfc (datla,","paragraphs":["(copula, past))J syntactically in Example 16 (adverbial). These two sentences have different syntactic structures, however, they have almost the same meaning 4. Descriptions in a lexicon of nominal adjectivals, such as F~I~"]},{"title":"(junsui,","paragraphs":["3These expressions belong to the same syntactic category, nominal adjectival. In English, on the contrary, the adnomihal constituent \"pure\" is an adjective and the adverbial constituent '~purely\" is an adverb.","4Readers might think that the Japanese copula in general syntactically takes a noun and returns some kind of verb phrase. Then, as in the ease of the English copula, the semantics of the Japanese copula is \"transparent.\" Thus, the function of 'tpure\" taking either the adnominal or the adverbial form should apply to the semantics of the common noun, 494 pure(ly))J , must be able to explain this kind of linguistic phenomena. Example 15"]},{"title":"junsui_na seiji-bomei dalta.","paragraphs":["pure political flight (copula, past)","Example 16 ~ ~ ~ ~ ~o"]},{"title":"junsui_ni seiji-bomei datta.","paragraphs":["purely political flight (copula, past) Example 17 ~ ~ \"~ ~ o"]},{"title":"sezjimbomei da~ta.","paragraphs":["political flight (copula, past)","A nominal refers to an extension of a thing with one or several intension(s). A copula refers to an instance of a state, which is a subconcept of an event. This state also has one or several extension(s) of events. The meanings of Examples 15, 16 and 17 are a function (or mapping) from extensions, i.e., \"the border transgression,\" to intensions, i.e., \"alternative views about a certain event.\" Then, Example 17, \"the border transgression was a political flight\" without \"pure,\" corresponds to alternative views about \"the border transgression,\" where the particular view as \"political flight\" is positively as-serted and others are left unstipulated. Then, Example 17 can be represented as follows;","statel(views","= extensionl(views = political flight,","intensionl2, ...) extension2(views = intension21,","intension22, ...) extension3(views = intension31,","intension32, ...)"]},{"title":"...) I'~ (junsui,","paragraphs":["pure(ly))3 in its adnominal usage (Example 15) corresponds to the views of an extension and constrains the number of intensions to one by using the function '!1' introduced in Section 4.1 as shown in the following; which is indistinguishable from other one-place verbs. However, some Japanese adjectives, e.g.,"]},{"title":"r~,~ (akai,","paragraphs":["red)2 can be used only as an adnominal constituent."]},{"title":"~,w (akai,","paragraphs":["red (adnominal)) ~"]},{"title":"(hako,","paragraphs":["box) E"]},{"title":"(da,","paragraphs":["(copula)) *~<"]},{"title":"(akaku,","paragraphs":["red (adverbial)) ~i"]},{"title":"(hako,","paragraphs":["box) E"]},{"title":"(da,","paragraphs":["(copula)) The copula in Examples 15-17 has a meaning similar to the verb \"exist,\" therefore, it is not \"transparent.\" Thus, it is necessary to analyze each of these sentences differently as we would sentences with ordinary verbs.","extensionl(views = intensionl, intension2, extensionl(views = intensionl) ...) Then Example 15 is represented as follows;","statel(views","= extensionl(views = political flight) extension2(views = intension21,","intension22 .... ) extension3(views = intension31,","intension32 .... )"]},{"title":"...) ['i~ (junsui,","paragraphs":["pure(ly))_l in its adverbial usage (Example 16) corresponds to a state and singles out one extension using the function '! 1' as the following shows;","statel(views = extensionl, extension2, ...) statel(views = extensionl) Then Example 16 is represented as follows;","statel (views = extensionl(views = political flight,","int ension21 .... ) )","Strictly speaking, these three example sentences represent different meanings. However, one tends to take no notice of this difference in daily conversation.","Here, we introduce a new hypothesis to explain the similarity of these representations. [HYPOTHESIS]","Extensions and intensions which are not mentioned by overt expressions are not stressed in the context. They contribute little to the interpretation of a sentence.","Therefore, Examples 15, 16 and 17 can be represented similarly as follows;","statel(views = extensionl(views = political flight))","The above simplification for Example 17 was all done following the above hypothesis, however, parts of the simplifications for Example 15 and 16 were dependent on the presence of \"pure.\" Therefore, the reliability of these simplifications is different. To discuss this interesting fact further is, however, beyond the scope of this paper. 495"]},{"title":"5 Conclusion","paragraphs":["This paper discussed the treatment of linguistic phenomena in Japanese adnominal constituents and it focused on how to generate the same semantic representation from different syntactic structures, and how to generate different semantic representations from a semantically ambiguous sentence.","In this paper, we classified the characteristics of adnominal constituents. That is (1) the type where one must infer what attribute of the modified noun is expressed by adnominal constituents, (2) the type necessitates inferences that change the structures of semantic representation, and (3) the type where the adnominal constituents do not add information to their modified nouns but constrain the relations between constituents in the text.","To achieve good results in natural language processing, e.g., high-quality machine translation, we have to consult lexicons based on concepts and so we exploited a concept representation method based on the Generative Lexicon Theory and a concept conversion module. Using these techniques, we explained how the semantic ambiguities of adnominal constituents can be dealt with by analyzing the modification relations between adnominal constituents and their modified nouns.","For a more precise explanation of adnominal expressions within our framework, it would be necessary to treat (1) the scope of negation, (2) negation and position of adnominal constituents, i.e., attributive and predicative position, and (3) disambiguation with regard to the context and the position of adnominal constituents.","H. Isahara and Y. Uchida. 1995. Analysis, genera-tion and semantic representation in contrast -- a context-based machine translation system --"]},{"title":"Systems and Computers in Japan,","paragraphs":["26(14).","K. Kanzaki and H. Isahara. 1997. Lexical semantics for adnominal constituents in Japanese. In"]},{"title":"Proc. of the Natural Language Processing Pacific Rim Symposium.","paragraphs":["K. Kanzaki and H. Isahara. 1998. The semantic con-nection between adonominal and adverbial usage of Japanese adnominal constituents. In"]},{"title":"Proc. of Workshop on \"Lexical Semantics in Context: Cor- pus, Inference and Discourse\" in lOth European Summer School in Logic, Language and Informa- tion.","paragraphs":["A. Lascarides and A. Copestake. 1998. Pragmatics and word meaning."]},{"title":"Journal of Linguistics,","paragraphs":["34(2). S. Makino and M. Tsutsui. 1986."]},{"title":"A Dictionary of Basic Japanese Grammar.","paragraphs":["The Japan Times. S. Martin. 1975."]},{"title":"A Reference Grammar of Japanese.","paragraphs":["Yale University Press.","Y. Matsumoto. 1993. Nihongo meisi-ku koozoo no goyooronteki koosatu (pragmaties of Japanese noun phrases)."]},{"title":"Nihongogaku (Japanese Linguis- tics),","paragraphs":["12(11). (in Japanese). J. Pustejovsky. 1995."]},{"title":"The Generative Lexicon.","paragraphs":["The MIT Press.","K. Sakuma. 1967."]},{"title":"Nihonleki Hyogen no Gengo Kagaku (Linguistics of Japanese Expressions).","paragraphs":["Kosei-sya Kosei-kaku. (in Japanese). H. Teramura. 1991."]},{"title":"Nihongo no shintakksu to imi III (Japanese syntax and meanings III).","paragraphs":["Kuroshio shuppan."]},{"title":"Acknowledgment","paragraphs":["We would like to thank Dr. James Pustejovsky of Brandeis University and Dr. Ann Copestake of CSLI for their extensive discussions on the formal treatment of the linguistic phenomena treated in this paper."]},{"title":"References","paragraphs":["P. Bouillon. 1996. Mental state adjectives: the perspective of generative lexicon. In"]},{"title":"Proc. of COL- ING96.","paragraphs":["L. Frazier. 1979."]},{"title":"On Comprehending Sentences: Syntactic Parsing Strategies (doctoral disserta- tion).","paragraphs":["Ph.D. thesis, UMass at Amherst.","M. Hashimoto and F. Aoyama. 1992. Keiyoshi no 3tsu no yoho (three usages of adjectives)."]},{"title":"Keiryo Kokugogaku (Mathematical Linguistics),","paragraphs":["18(5). (in Japanese). 496"]}]}
