{"sections":[{"title":"Discourse Relations: A Structural and Presuppositional Account Using Lexicalised TAG* Bonnie Webber","paragraphs":["Univ of Edinburgh bonnie@dai.ed.ac.uk"]},{"title":"Alistair Knott","paragraphs":["Univ of Otago alik@cs.otago.ac.nz"]},{"title":"Matthew Stone","paragraphs":["Rutgers Univ mdstone@cs.rutgers.edu"]},{"title":"Aravind Joshi","paragraphs":["Univ of Pennsylvania joshi @cis.upenn.edu"]},{"title":"Abstract","paragraphs":["We show that discourse structure need not bear the full burden of conveying discourse relations by showing that many of them can be explained"]},{"title":"non- structurally","paragraphs":["in terms of the grounding of"]},{"title":"anaphoric presuppositions","paragraphs":["(Van der Sandt, 1992). This simplifies discourse structure, while still allowing the realisation of a full range of discourse relations. This is achieved using the same semantic machinery used in deriving clause-level semantics."]},{"title":"1 Introduction","paragraphs":["Research on discourse structure has, by and large, attempted to associate all meaningful relations between propositions with"]},{"title":"structural","paragraphs":["connections between discourse clauses (syntactic clauses or structures composed of them). Recognising that this could mean multiple structural connections between clauses, Rhetorical Structure Theory (Mann and Thompson, 1988) simply stipulates that only a single relation may hold. Moore and Pollack (1992) argue that both informational (semantic) and intentional relations can hold between clauses simultaneously and independently. This suggests that factor-ing the two kinds of relations might lead to a pair of structures, each still with no more than a single structural connection between any two clauses.","But examples of multiple semantic relations are easy to find (Webber et al., 1999). Having structure account for all of them leads to the complex-ities shown in Figure 1, including the crossing dependencies shown in Fig. l c. These structures are no longer trees, making it difficult to define a compositional semantics.","This problem would not arise if one recognised additional,"]},{"title":"non-structural","paragraphs":["means of conveying semantic relations between propositions and modal * Our thanks to Mark Steedman, Katja Markert, Gann Bierner and three ACL'99 reviewers for all their useful comments. operators on propositions. This is what we do here: Structurally, we assume a \"bare bones\" discourse structure built up from more complex elements (LTAG trees) than those used in many other approaches. These structures and the operations used in assembling them are the basis for compositional semantics. Stimulated by structural operations, inference based on world knowledge, usage conventions, etc., can then make defeasible contributions to discourse interpretation that elaborate the non-defeasible propositions contributed by compositional semantics. Non-structurally, we take additional semantic relations and modal operators to be conveyed through"]},{"title":"anaphoric presuppositions","paragraphs":["(Van der Sandt, 1992) licensed by information that speaker and hearer are taken to share. A main source of shared knowledge is the"]},{"title":"interpreta- tion","paragraphs":["of the on-going discourse. Because the entity that licences (or \"discharges\") a given presupposition usually has a"]},{"title":"source","paragraphs":["within the discourse, the presupposition seems to link the clause containing the presupposition-bearing"]},{"title":"(p-bearing)","paragraphs":["element to that source. However, as with pronominal and definite NP anaphora, while"]},{"title":"attentional constraints","paragraphs":["on their interpretation may be"]},{"title":"influenced","paragraphs":["by structure, the links themselves are not structural.","The idea of combining compositional semantics with defeasible inference is not new. Neither is the idea of taking certain lexical items as anaphorically presupposing an"]},{"title":"eventuality","paragraphs":["or a set of eventualities: It is implicit in all work on the anaphoric nature of tense (cf. Partee (1984), Webber (1988),"]},{"title":"inter alia)","paragraphs":["and modality (Stone, 1999). What is new is the way we enable anaphoric presupposition to contribute to semantic relations and modal operators, in a way"]},{"title":"41 Ci Ci (a)","paragraphs":["R1 R 2 C I Ci C k Ci C i C k C m"]},{"title":"(b) (c)","paragraphs":["Figure 1: Multiple semantic links (R j) between discourse clauses (Ci): (a) back to the same discourse clause; (b) back to different discourse clauses; (c) back to different discourse clauses, with crossing dependencies. that does not lead to the violations of tree structure mentioned earlier.t","We discuss these differences in more detail in Section 2, after describing the lexicalised frame-work that facilitates the derivation of discourse semantics from structure, inference and anaphoric presuppositions. Sections 3 and 4 then present more detailed semantic analyses of the connectives for example and otherwise. Finally, in Section 5, we summarize our arguments for the approach and suggest a program of future work. 2 Framework In previous papers (Cristea and Webber, 1997; Webber and Joshi, 1998; Webber et al., 1999), we have argued for using the more complex structures (elementary trees) of a Lexicalized Tree-Adjoining Grammar (LTAG) and its operations (adjoining and substitution) to associate structure and semantics with a sequence of discourse clauses. 2 Here we briefly review how it works.","In a lexicalized TAG, each elementary tree has at least one anchor. In the case of discourse, the anchor for an elementary tree may be a lexical item, punctuation or a feature structure that is lexically null. The semantic contribution of a lexical anchor includes both what it presupposes and what it asserts (Stone and Doran, 1997; Stone, 1998; Stone and Webber, 1998). A feature structure anchor will either unify with a lexical item with compatible features (Knott and Mellish, 1996), yielding the previous case, or have an empty realisation, though one","1One may still need to admit structures having both a link back and a link forward to different clauses (Gardent, 1997). But a similar situation can occur within the clause, with relative clause dependencies - from the verb back to the relative pronoun and forward to a trace - so the possibility is not unmotivated from the perspective of syntax.","2We take this to be only the most basic level of discourse structure, producing what are essentially extended descriptions of situations/events. Discourse may be further structured with respect to speaker intentions, genre-specific presentations, etc. that maintains its semantic features.","The initial elementary trees used here correspond, by and large, to second-order predicate-argument structures - i.e., usually binary predicates on propositions or eventualities - while the auxiliary elementary trees provide further information (constraints) added through adjoining.","Importantly, we bar crossing structural connections. Thus one diagnostic for taking a predicate argument to be anaphoric rather than structural is whether it can derive from across a structural link. The relation in a subordinate clause is clearly structural: Given two relations, one realisable as \"Although o¢ [3, the other realisable as \"Because y ~5\", they cannot together be realised as \"Although ~ because y [3 &\" with the same meaning as \"Although o¢ [3. Because y 8\". The same is true of certain relations whose realisation spans multiple sentences, such as ones realisable as \"On the one hand oz. On the other hand 13.\" and \"Not only T- But also &\" Together, they cannot be realised as \"On the one hand o¢. Not only T. On the other hand 13. But also &\" with the same meaning as in strict sequence. Thus we take such constructions to be structural as well (Webber and Joshi, 1998; Webber et al., 1999).","On the other hand, the p-bearing adverb \"then\", which asserts that one eventuality starts after the culmination of another, has only one of its arguments coming structurally. The other argument is presupposed and thus able to come from across a structural boundary, as in","(1) a. On the one hand, John loves Barolo. b. So he ordered three cases of the '97. c. On the other hand, because he's broke, d. he then had to cancel the order. Here, \"then\" asserts that the \"cancelling\" event in (d) follows the ordering event in (b). Because the link to (b) crosses the structural link in the parallel construction, we take this argument to come non-42 structurally through anaphoric presupposition. 3","Now we illustrate briefly how short discourses built from LTAG constituents get their semantics. For more detail, see (Webber and Joshi, 1998; Webber et al., 1999). For more information on compositional semantic operations on LTAG derivation trees, see (Joshi and Vijay-Shanker, 1999).","(2) a. You shouldn't trust John because he never returns what he borrows.","b. You shouldn't trust John. He never returns what he borrows.","C. You shouldn't trust John because, for example, he never returns what he borrows.","d. You shouldn't trust John. For example, he never retums what he borrows. Here A will stand for the LTAG parse tree for \"you shouldn't trust John\" and a, its derivation tree, and B will stand for the LTAG parse tree for \"he never returns what he borrows\" and 13, its derivation tree.","The explanation of Example 2a is primarily structural. It involves an initial tree (y) anchored by \"because\" (Figure 2). Its derived tree comes from A substituting at the left-hand substitution site of y (in-dex 1) and B at the right-hand substitution site (in-dex 3). Semantically, the anchor of y (\"because\") asserts that the situation associated with the argument indexed 3 (B) is the cause of that associated with the argument indexed 1 (A).","The explanation of Example 2b is primarily structural as well. It employs an auxiliary tree (y) anchored by \".\" (Figure 3). Its derived tree comes from B substituting at the right-hand substitution site (index 3) of ),, and \"f adjoining at the root of A (index 0). Semantically, adjoining B to A via y simply implies that B continues the description of the situation associated with A. The general inference that this stimulates leads to a defeasible contribution of causality between them, which can be denied without a contradiction - e.g.","(3) You shouldn't trust John. He never returns what he borrows. But that's not why you shouldn't trust him.","Presupposition comes into play in Example 2c. This example adds to the elements used in Ex-","3The fact that the events deriving from (b) and (d) appear to have the same temporal relation in the absence of \"then\" just shows that tense is indeed anaphoric and has no trouble crossing structural boundaries either. ample 2a, an auxiliary tree anchored by \"for example\" (8), which adjoins at the root of B (Figure 4). \"For example\" contributes both a presupposition and an assertion, as described in more detail in Section 3. Informally, \"for example\" presupposes a shared set of eventualities, and asserts that the eventuality associated with the clause it adjoins to, is a member of that set. In Example 2c, the set is licensed by \"because\" as the set of causes/reasons for the situation associated with its first argument. Thus, associated with the derivation of (2c) are the assertions that the situation associated with B is a cause for that associated with A and that the situation associated with B is one of a set of such causes.","Finally, Example 2d adds to the elements used in Example 2b, the same auxiliary tree anchored by \"for example\" (~5). As in Example 2b, the causality relation between the interpretations of B and A comes defeasibly from general inference. Of interest then is how the presupposition of \"for example\" is licenced - that is, what provides the shared set or generalisation that the interpretation of B is asserted to exemplify. It appears to be licenced by the causal relation that has been inferred to hold between the eventualities denoted by B and A, yielding a set of causes/reasons for A.","Thus, while we do not yet have a complete characterisation of how compositional semantics, defeasible inference and anaphoric presupposition in-teract, Examples 2c and 2d illustrate one significant feature: Both the interpretive contribution of a structural connective like \"because\" and the defeasible inference stimulated by adjoining can license the anaphoric presupposition of a p-bearing element like \"for example\".","Recently, Asher and Lascarides (1999) have described a version of Structured Discourse Representation Theory (SDRT) that also incorporates the semantic contributions of both presuppositions and assertions. In this enriched version of SDRT, a proposition can be linked to the previous discourse via multiple rhetorical relations such as background and defeasible consequence. While there are similarities between their approach and the one presented here, the two differ in significant ways:","• Unlike in the current approach, Asher and Lascarides (1999) take all connections (of both asserted and presupposed material) to be structural attachments through rhetorical relations. The relevant rhetorical relation may be inher-"]},{"title":"43 ~/(because)","paragraphs":["~ [ ] ~ ~ A because because Figure 2: Derivation of Example 2a. The derivation tree is shown below the arrow, and the derived tree, to its right."]},{"title":"0,,\"","paragraphs":["s B Figure 3: Derivation of Example 2b ent in the"]},{"title":"p-bearing","paragraphs":["element (as with \"too\") or it may have to be inferred.","• Again unlike the current approach, all such attachments (of either asserted or presupposed material) are limited to the"]},{"title":"right frontier","paragraphs":["of the evolving SDRT structure.","We illustrate these differences through Example 1 (repeated below), with the"]},{"title":"p-bearing","paragraphs":["element \"then\", and Example 5, with the"]},{"title":"p-bearing","paragraphs":["element \"too\". Both examples call into question the claim that material licensing presuppositions is constrained to the right frontier of the evolving discourse structure.","(4) a. On the one hand, John loves Barolo. b. So he ordered three cases of the '97. c. On the other hand, because he's broke, d. he"]},{"title":"then","paragraphs":["had to cancel the order.","(5) (a) I have two brothers. (b) John is a history major. (c) He likes water polo, (d) and he plays the drums. (e) Bill is in high school. (f) His main interest is drama. (g) He"]},{"title":"too","paragraphs":["studies history, (h) but he doesn't like it much. In Example 1, the presupposition of \"then\" in (d) is licensed by the eventuality evoked by (b), which would not be on the right frontier of any structural analysis. If \"too\" is taken to presuppose shared knowledge of a similar eventuality, then the \"too\" in Example 5(g) finds that eventuality in (b), which is also unlikely to be on the right frontier of any structural analysis. 4 4The proposal in (Asher and Lascarides, 1999) to alter an 44","With respect to the interpretation of \"too\", Asher and Lascarides take it to presuppose a"]},{"title":"parallel","paragraphs":["rhetorical relation between the current clause and some-thing on the right frontier. From this instantiated rhetorical relation, one then infers that the related eventualities are similar. But if the right frontier constraint is incorrect and the purpose of positing a rhetorical relation like"]},{"title":"parallel","paragraphs":["is to produce an assertion of similarity, then one might as well take \"too\" as directly presupposing shared knowledge of a similar eventuality, as we have done here. Thus, we suggest that the insights presented in (Asher and Lascarides, 1999) have a simpler explanation.","Now, before embarking on more detailed analyses of two quite different"]},{"title":"p-bearing","paragraphs":["adverbs, we should clarify the scope of the current approach in terms of the range of"]},{"title":"p-bearing","paragraphs":["elements that can create non-structural discourse links.","We believe that systematic study, perhaps starting with the 350 \"cue phrases\" given in (Knott, 1996, Appendix A), will show which of them use presupposition in realising discourse relations. It is likely that these might include:","• temporal conjunctions and adverbial connectives presupposing an eventuality that stands in a particular temporal relation to the one currently in hand, such as \"then\", \"later\", \"mean-while\", \"afterwards\", \"beforehand\"';","• adverbial connectives presupposing shared knowledge of a generalisation or set, such existing SDRT analysis in response to a"]},{"title":"p-bearing","paragraphs":["element, would seem superfluous if its only role is to re-structure the right frontier to support the claimed RF constraint. T"]},{"title":"B A ~, [] ~, because for example","paragraphs":[". y (because)"]},{"title":"o/I 3 B % %","paragraphs":["Figure 4: Derivation of Example 2c T for example .","C~ OJ"]},{"title":"o,,I 3","paragraphs":["I"]},{"title":"5 for example B","paragraphs":["Figure 5: Derivation of Example 2d as \"for example\", \"first...second...\", \"for in-stance\";","• adverbial connectives presupposing shared knowledge of an abstraction, such as \"more specifically\", \"in particular\";","• adverbial connectives presupposing a complementary modal context, such as \"otherwise\";","• adverbial connectives presupposing an alternative to the current eventuality, such as \"instead\" and \"rather\". 5","For this study, one might be able to use the structure-crossing test given in Section 2 to distinguish a relation whose arguments are both given structurally from a relation which has one of its arguments presupposed. (Since such a test won't distinguish"]},{"title":"p-bearing","paragraphs":["connectives such as \"mean-while\" from non-relational adverbials such as \"at dawn\" and \"tonight\", the latter will have to be excluded by other means, such as the (pre-theoretical) test for relational phrases given in (Knott, 1996).) • 3 For example We take \"For example, P\" to presuppose a quantified proposition G, and to assert that this proposition is a"]},{"title":"generalisation","paragraphs":["of the proposition rc expressed by the sentence P. (We will write"]},{"title":"generalisation(rt, G.)","paragraphs":["A precise definition of"]},{"title":"generalisation","paragraphs":["is not necessary for the purposes of this paper, and we will assume the following simple definition: 5Gann Bierner, personal communication"]},{"title":"• generalisation(rc, G)","paragraphs":["iff (i) G is a quantified proposition of the form Q I (x, a(x), b(x)); (ii) it allows the inference of a proposition G r of the form"]},{"title":"Q2 (x, a(x), b(x) );","paragraphs":["and (iii)"]},{"title":"G'","paragraphs":["is inferrable from G (through having a weaker quantifier).","The presupposed proposition G can be licensed in different ways, as the following examples show: (6) a. John likes many kinds of wine."]},{"title":"For ex- ample,","paragraphs":["he likes Chianti. b. John must be feeling sick, because,"]},{"title":"for ex- ample,","paragraphs":["he hardly ate a thing at lunch. c. Because John was feeling sick, he did not"]},{"title":"for example","paragraphs":["go to work.","d. Why don't we go to the National Gallery. Then,"]},{"title":"for example,","paragraphs":["we can go to the White House.","Example 6a is straightforward, in that the presupposed generalisation \"John likes many kinds of wine\" is presented explicitly in the text. 6 In the remaining cases, the generalisation must be inferred. In Example 6b, \"because\" licenses the generalisation that many propositions support the proposi-6Our definition of"]},{"title":"generalisation","paragraphs":["works as follows for this example: the proposition n introduced by \"for example\" is"]},{"title":"likes(john, chianti),","paragraphs":["the presupposed proposition G is"]},{"title":"many(x, wine(x),likes(john,x),","paragraphs":["and the weakened proposition G I is"]},{"title":"some(x, wine(x),likes(john,x).","paragraphs":["~ allows G I to be inferred, and G also allows G ~ to be inferred, hence"]},{"title":"generalisation(rc, G)","paragraphs":["is true. 45 tion that John must be feeling sick, while in Example 6c, it licences the generalisation that many propositions follow from his feeling sick. We can represent both generalisations using the meta-level predicate, evidence(rt, C), which holds iff a premise rc is evidence for a conclusion C.","In Example 6d, the relevant generalisation involves possible worlds associated jointly with the modality of the first clause and \"then\" (Webber et al., 1999). For consistency, the semantic interpretation of the clause introduced by \"for example\" must make reference to the same modal base identified by the generalisation. There is more on modal bases in the next section. 4 Otherwise Our analysis of \"otherwise\" assumes a modal semantics broadly following Kratzer (1991 ) and Stone (1999), where a sentence is asserted with respect to a set of possible worlds. The semantics of \"otherwise ct\" appeals to two sets of possible worlds. One is W0, the set of possible worlds consistent with our knowledge of the real world. The other, Wp, is that set of possible worlds consistent with the condition C that is presupposed, t~ is then asserted with respect to the complement set Wo - Wp. Of interest then is C - what it is that can serve as the source licensing this presupposition. 7","There are many sources for such a presupposition, including if-then constructions (Example 7a-7b), modal expressions (Examples 7c- 7d) and in-finitival clauses (Example 7e)","(7) a. If the light is red, stop. Otherwise, go straight on.","b. If the light is red, stop. Otherwise, you might get run over","c. Bob [could, may, might] be in the kitchen. Otherwise, try in the living room.","d. You [must, should] take a coat with you. Otherwise you'll get cold.","e. It's useful to have a fall-back position. Otherwise you're stuck.","7There is another sense of \"otherwise\" corresponding to \"in other respects\", which appears either as an adjective phrase modifier (e.g. \"He's an otherwise happy boy.\") or a clausal modifier (e.g., \"The physical layer is different, but otherwise it's identical to metropolitan networks.\"). What is presupposed here are one or more actual properties of the situation under discussion. each of which introduces new possibilities that are consistent with our knowledge of the real world (W0), that may then be further described through modal subordination (Roberts, 1989; Stone and Hardt, 1999).","That such possibilities must be consistent with Wo (i.e., why the semantics of \"otherwise\" is not simply defined in terms of W r) can be seen by considering the counterfactual variants of 7a-7d, with \"had been\", \"could have been\" or \"should have taken\". (Epistemic \"must\" can never be counterfactual.) Because counterfactuals provide an alternative to reality, W e is not a subset of W0 - and we correctly predict a presupposition failure for \"otherwise\". For example, corresponding to 7a we have: (8) If the light had been red, John would have","stopped. #Otherwise, he went straight on. The appropriate connective here - allowing for what actually happened - is \"as it is\" or \"as it was\". 8","As with \"for example\", \"otherwise\" is compatible with a range of additional relations linking discourse together as a product of discourse structure and defeasible inference. Here, the clauses in 7a and 7c provide a more complete description of what to do in different circumstances, while those in 7b, 7d and 7e involve an unmarked \"because\", as did Example 2d. Specifically, in 7d, the \"otherwise\" clause asserts that the hearer is cold across all currently possible worlds where a coat is not taken. With the proposition understood that the hearer must not get cold (i.e., that only worlds where the hearer is not cold are compatible with what is required), this allows the inference (modus tollens) that only the worlds where the hearer takes a coat are compatible with what is required. As this is the proposition presented explicitly in the first clause, the text is compatible with an inferential connective like \"because\". (Similar examples occur with \"epistemic\" because.)","Our theory correctly predicts that such discourse relations need not be left implicit, but can instead be explicitly signalled by additional connectives, as in","8There is a reading of the conditional which is not counterfactual, but rather a piece of free indirect speech report-ing on John's train of thought prior to encountering the light. This reading allows the use of \"otherwise\" with John's thought providing the base set of worlds W0, and \"otherwise\" then in-troducing a complementary condition in that same context:","If the light had been red, John would have stopped.","Otherwise, he would have carded straight on. But","as it turned out, he never got to the light. 46","(9) You should take a coat with you because otherwise you'll get cold. and earlier examples.","(Note that \"Otherwise P\" may yield an implicature, as well as having a presupposition, as in","(10) John must be in his room. Otherwise, his light would be off. Here, compositional semantics says that the second clause continues the description of the situation partially described by the first clause. General inference enriches this with the stronger, but defeasible conclusion that the second clause provides evidence for the first. Based on the presupposition of \"otherwise\", the \"otherwise\" clause asserts that John's light would be off across all possible worlds where he was not in his room. In addition, however, implicature related to the evidence relation between the clauses, contributes the conclusion that the light in John's room is on. The point here is only that presupposition and implicature are distinct mechanisms, and it is only presupposition that we are focussing on in this work. 5 Conclusion In this paper, we have shown that discourse structure need not bear the full burden of discourse semantics: Part of it can be borne by other means. This keeps discourse structure simple and able to support a straight-forward compositional semantics. Specifically, we have argued that the notion of anaphoric presupposition that was introduced by van der Sandt (1992) to explain the interpretation of various definite noun phrases could also be seen as underlying the semantics of various discourse connectives. Since these presuppositions are licensed by eventualities taken to be shared knowledge, a good source of which is the interpretation of the discourse so far, anaphoric presupposition can be seen as carrying some of the burden of discourse connectivity and discourse semantics in a way that avoids crossing dependencies.","There is, potentially, another benefit to factor-ing the sources of discourse semantics in this way: while cross-linguistically, inference and anaphoric presupposition are likely to behave similarly, structure (as in syntax) is likely to be more language specific. Thus a factored approach has a better chance of providing a cross-linguistic account of discourse than one that relies on a single premise.","Clearly, more remains to be done. First, the approach demands a precise semantics for connectives, as in the work of Grote (1998), Grote et al. (1997), Jayez and Rossari (1998) and Lagerwerf (1998).","Secondly, the approach demands an understanding of the attentional characteristics of presuppositions. In particular, preliminary study seems to suggest that p-bearing elements differ in what source can license them, where this source can be located, and what can act as distractors for this source. In fact, these differences seem to resemble the range of differences in the information status (Prince, 1981; Prince, 1992) or familiarity (Gundel et al., 1993) of referential NPs. Consider, for example:","(11 ) I got in my old Volvo and set off to drive crosscountry and see as many different mountain ranges as possible. When I got to Arkansas, for example, I stopped in the Ozarks, although I had to borrow another car to see them because Volvos handle badly on steep grades. Here, the definite NP-like presupposition of the \"when\" clause (that getting to Arkansas is shared knowledge) is licensed by driving cross-country; the presupposition of \"for example\" (that stopping in the Ozarks exemplifies some shared generalisation) is licensed by seeing many mountain ranges, and the presupposition of \"another\" (that an alternative car to this one is shared knowledge) is licensed by my Volvo. This suggests a corpus annotation effort for anaphoric presuppositions, similar to ones already in progress on co-reference.","Finally, we should show that the approach has practical benefit for NL understanding and/or generation. But the work to date surely shows the benefit of an approach that narrows the gap between discourse syntax and semantics and that of the clause. References","Nicholas Asher and Alex Lascarides. 1999. The semantics and pragmatics of presupposition. Journal of Semantics, to appear.","Dan Cristea and Bonnie Webber. 1997. Expectations in incremental discourse processing. In Proc. 35 th Annual Meeting of the Association for Computational Linguistics, pages 88-95, Madrid, Spain. Morgan Kaufmann.","Claire Gardent. 1997. Discourse tree adjoining grammars. Claus report nr.89, University of the Saarland, Saarbriicken. 47","Brigitte Grote, Nils Lenke, and Manfred Stede. 1997. Ma(r)king concessions in English and German."]},{"title":"Discourse Processes,","paragraphs":["24(1 ):87-118.","Brigitte Grote. 1998. Representing temporal discourse markers for generation purposes. In"]},{"title":"Coling/ACL Workshop on Discourse Relations and Discourse Markers,","paragraphs":["pages 22-28, Montreal, Canada.","Jeanette Gundel, N.A. Hedberg, and R. Zacharski. 1993. Cognitive status and the form of referring expressions in discourse."]},{"title":"Language,","paragraphs":["69:274-307.","Jacques Jayez and Corinne Rossari. 1998. Pragmatic connectives as predicates. In Patrick Saint-Dizier, editor,"]},{"title":"Predicative Structures in Natural Language and Lexical Knowledge Bases,","paragraphs":["pages 306-340. Kluwer Academic Press, Dordrecht.","Aravind Joshi and K. Vijay-Shanker. 1999. Compositional semantics with lexicalized tree-adjoining grammar (LTAG)? In"]},{"title":"Proc. 3 rd Int'l Workshop on Compuational Semantics,","paragraphs":["Tilburg, Netherlands, January.","Alistair Knott and Chris Mellish. 1996. A feature-based account of the relations signalled by sentence and clause connectives."]},{"title":"Language and Speech,","paragraphs":["39(2-3): 143-183. Alistair Knott. 1996."]},{"title":"A Data-driven Methodo- logy for Motivating a Set of Coherence Rela- tions.","paragraphs":["Ph.D. thesis, Department of Artificial In-telligence, University of Edinburgh.","Angelika Kratzer. 1991. Modality. In A. von Stechow and D. Wunderlich, editors,"]},{"title":"Semantics: An International Handbook of Contemporary Re- search,","paragraphs":["pages 639-650. de Gruyter. Luuk Lagerwerf. 1998."]},{"title":"Causal Connectives have Presuppositions.","paragraphs":["Holland Academic Graphics, The Hague, The Netherlands. PhD Thesis, Catholic University of Brabant.","William Mann and Sandra Thompson. 1988. Rhetorical structure theory."]},{"title":"Text,","paragraphs":["8(3):243-281.","Johanna Moore and Martha Pollack. 1992. A problem for RST: The need for multi-level discouse analysis."]},{"title":"Computational Linguistics,","paragraphs":["18(4):537-544.","Barbara Partee. 1984. Nominal and temporal anaphora."]},{"title":"Linguistics & Philosophy,","paragraphs":["7(3):287-324.","Ellen Prince. 1981. Toward a taxonomy of given-new information. In Peter Cole, editor,"]},{"title":"Radical Pragmatics,","paragraphs":["pages 223-255. Academic Press.","Ellen Prince. 1992. The zpg letter: Subjects, definiteness and information-status. In Susan Thompson and William Mann, editors,"]},{"title":"Discourse Description: Diverse Analyses of a Fundraising Text,","paragraphs":["pages 295-325. John Benjamins.","Craige Roberts. 1989. Modal subordination and pronominal anaphora in discourse."]},{"title":"Linguistics and Philosophy,","paragraphs":["12(6):683-721.","Matthew Stone and Christine Doran. 1997. Sentence planning as description using tree adjoining grammar. In"]},{"title":"Proc. 35 th Annual Meeting of the Association for Computational Linguistics,","paragraphs":["pages"]},{"title":"198-205,","paragraphs":["Madrid, Spain. Morgan Kaufmann.","Matthew Stone and Daniel Hardt. 1999. Dynamic discourse referents for tense and modals. In Harry Bunt, editor,"]},{"title":"Computational Semantics,","paragraphs":["pages 287-299. Kluwer.","Matthew Stone and Bonnie Webber. 1998. Textual economy through closely coupled syntax and semantics. In"]},{"title":"Proceedings of the Ninth Inter- national Workshop on Natural Language Gen- eration,","paragraphs":["pages 178-187, Niagara-on-the-Lake, Canada.","Matthew Stone. 1998."]},{"title":"Modality in Dialogue: Plan- ning, Pragmatics and Computation.","paragraphs":["Ph.D. thesis, Department of Computer & Information Science, University of Pennsylvania.","Matthew Stone. 1999. Reference to possible worlds. RuCCS report 49, Center for Cognitive Science, Rutgers University.","Rob Van der Sandt. 1992. Presupposition projection as anaphora resolution."]},{"title":"Journal of Se- mantics,","paragraphs":["9:333-377.","Bonnie Webber and Aravind Joshi. 1998. Anchor-ing a lexicalized tree-adjoining grammar for discourse. In"]},{"title":"Coling/ACL Workshop on Discourse Relations and Discourse Markers,","paragraphs":["pages 86-92, Montreal, Canada.","Bonnie Webber, Alistair Knott, and Aravind Joshi. 1999. Multiple discourse connectives in a lexicalized grammar for discourse. In"]},{"title":"3 ~d Int'l Work- shop on Computational Semantics,","paragraphs":["pages 309-325, Tilburg, The Netherlands.","Bonnie Webber. 1988. Tense as discourse anaphor."]},{"title":"Computational Linguistics,","paragraphs":["14(2):61-73."]},{"title":"4B","paragraphs":[]}]}
