{"sections":[{"title":"Briefly Noted Computers and Writing: Models and Tools Noel Williams and Patrik Holt (editors)","paragraphs":["(Sheffield City Polytechnic and Heriot Watt University) Norwood, NJ: Ablex Publishing and Oxford: Intellect Ltd, 1989, xi + 166 pp. Hardbound, ISBN 0-89391-636-6 and 1-871516-03-X, $29.50. (Distributed outside North America by Blackwell Scientific Publications.)"]},{"title":"Computer Assisted Language Learning: Program Structure and Principles Keith Cameron (editor)","paragraphs":["(University of Exeter) Norwood, NJ: Ablex Publishing and Oxford: Intellect Ltd., 1989, x + 115 pp. Hardbound, ISBN 0-89391-560-2 and 1-871516-01-3, $22.50. (Distributed outside North America by Blackwell Scientific Publications.) These volumes, which I will refer to as the CAW volume (Williams and Holt) and the CALL volume (Cameron) are collections of papers from two conferences--a conference on Computers and Writing (CAW) held at Sheffield City Polytechnic in April 1988 and the Second National Conference on Computer-Assisted Language Learning (CALL) held at the University of Exeter in September 1987. Out of the nine papers in the CAW volume and the eight papers in the CALL volume, most seem to be directed toward people in the fields of CALL and CAW with little or no background in computational linguistics. However, a computational linguist reading the books might be interested in the descriptions of systems, discussions about the role of AI and CL in CALL and CAW, and speculations about the future of CALL and CAW.","Several papers address the question of the utility of artificial intelligence and computational linguistics in CALL and CAW. Keith Cameron, in the preface to the CALL volume, captures the prevailing attitude of most of the authors--an attitude of incremental progress. \"It is my belief that if those who research into AI are not too ambitious at the outset, that if the task, in true Cartesian fashion, is divided up into manageable modules, eventually a system which will achieve a high degree of efficiency will result\" (p. x).","Following this approach, the two volumes contain several examples of programs that use small amounts of natural language processing for manageable tasks. The emphasis is on usable systems adhering to pedagogical ,principles and, where possible, reflecting what is known about cognitive models of writing and second language acquisition. The systems described for CALL in-clude GENDER MENDER, which detects errors in French gender based on a statistical analysis of spelling; Venturereader, a set of reading and vocabulary programs with a text database that can be examined; and a Prolog program that uses heuristics to detect errors in French negatives and clitic pronouns. The CAW volume contains a description of RUSKIN, a post-writing tool that analyzes surface features of a text, such as sentence length, and compares them to a list of userentered variables about the type of text and the intended audience.","Although the two volumes describe several interesting CALL and CAW systems, there are ways in which they are not likely to be completely satisfying to a computational linguist. First, the systems described use natural language processing very conservatively, though they apply fairly reliable technology in creative ways. (An ambitious exception is Yazdani's paper on the ROALD story generation program in the CAW volume.) Second, many papers in the CALL volume are quite elementary from a computational linguistics standpoint, including introductions to things like phrase structure rules, Prolog, and data compression techniques for BASIC. Third, though many of the papers address cognitive and pedagogical issues having to do with foreign language acquisition, foreign language teaching, and models of writing, in most instances, the reader interested in such issues will probably be left wanting more. Finally, there is almost no discussion of natural language understanding incorporating semantic components in addition to syntax and morphology. For example, there are no programs described that produce a semantic representation of student input.","Even with these reservations, the books could be interesting for a computational linguist who is looking for examples of pedagogically sound applications of technology for working with text databases, error detection, parsing unrestricted text, etc. Several authors addressed the future of CALL and CAW asking what kinds of technology could 114 Briefly Noted be exploited effectively in the near future, and what kinds of systems could be built for various kinds of users. In most cases, natural language processing seems to be involved, and a little bit of natural language processing can go a long way toward improving the capabilities and flexibility of CALL and CAW"]},{"title":"systems.--Lori Levin, Center for Machine Translation, Carnegie Mellon University Specifying the Noun Phrase Peter-Arno Coppen","paragraphs":["(University of Nijmegen) Amsterdam: Thesis Publishers, 1991, xiv + 384 pp. Paperbound, ISBN 90-5170-105-5, $25.00, Dfl 45.00 In this study, three major linguistic research areas are combined, in an attempt to arrive at a detailed analysis of the noun phrase specifier system: the Chomskyan government and binding theory for syntax, the Montague grammar for formal semantics, and techno-linguistics (defined as the linguistic counterpart of language technology) for the computer implementation of both. Detailed at-tention is being paid to the interface between Chomskyan grammar and Montague grammar. It is shown that a Montague Semantics can be linked to a Chomskyan enriched surface structure successfully, without having to give up the principle of compositionality. The specifier system of the noun phrase in Dutch is analyzed in great detail, with a wealth of distributional facts supplied. Although most examples are given in Dutch, it is claimed that the analysis presented here has major implications for Universal Grammar. Finally, it is shown that a computer implementation based on this analysis is able to avoid well-known problems such as combinatorial explosion and the transparency problem.-"]},{"title":"From the publisher's announcement Advances in Artificial Intelligence: Natural Language and Knowledge-Based Systems Martin Charles Golumbic (editor)","paragraphs":["(IBM T. J. Watson Research Center) New York: Springer-Verlag, 1990, xiv + 303 pp. Hardbound, ISBN 0-387-97355-9, no price listed This book contains 14 papers in various areas of AI, all originally presented at conferences in Israel. The natural language papers are the following:","\"What's in a joke,\" by Michal Effratt;","\"Machinery for Hebrew word formation,\" by Uzzi Ornan;","\"Theory formation for interpreting an un-known language,\" by Ephraim Nissan;","\"Ontology, sublanguage, and semantic networks in natural language processing,\" by Victor Raskin;","\"Anticipating a listener's response in text planning,\" by Ingrid Zukerman."]},{"title":"The Georgetown Journal of Languages and Linguistics Richard J. O'Brien (editor)","paragraphs":["(Georgetown University) Washington, DC: Georgetown University Press, quarterly, Volume 1 (1990); ISSN 1048-4205, $15 per annum ($15 extra for overseas postage). This new linguistics journal includes a regular column entitled \"Languages and computers\" in which books, software, and papers published in"]},{"title":"Computational Linguistics","paragraphs":["and"]},{"title":"Machine Translation","paragraphs":["are reviewed. We look for-ward to their review of this notice."]},{"title":"The Great Eskimo Vocabulary Hoax and Other Irreverent Essays on the Study of Language Geoffrey K. Pullum","paragraphs":["(University of California, Santa Cruz) Chicago: The University of Chicago Press, 1991, x + 236 pp. Paperbound, ISBN 0-226-68534-9, $11.95 Any science enjoys a good bout of omphaloskepsis now and then, and linguistics is no exception. Hence the popularity of Geoffrey Pullum's columns that appeared under the heading \"TOPIC... COMMENT\" in the journal"]},{"title":"Natural Language and Linguistic Theory","paragraphs":["from 1983 to 1989. These columns weren't about language, but rather about linguists and the science of linguistics, and each quarterly column was eagerly anticipated, read, and discussed more than any technical article in an academic journal. All 23 of Pullum's columns are now published together as a book,"]},{"title":"The Great Eskimo Vocabulary Hoax.","paragraphs":["The columns cover topics ranging from silly things that Chomsky has written to bad citation etiquette and (the title essay) the 115 Computational Linguistics Volume 18, Number 1 seemingly invincible myth that Eskimos have many different words for snow. Pullum be-lieves strongly in the science of linguistics, and never hesitates to expose, parody, mock or abuse anyone or anything threatening the scientific integrity of the field. Indeed, several of the columns in the book are grouped under the heading \"Unscientific behavior.\"","In a chapter entitled \"Trench-mouth comes to Trumpington Street,\" Pullum tells how Cambridge University Press refused to publish Georgia Green's book"]},{"title":"Semantics and Syntactic Regularity","paragraphs":["(after it had already been printed) for fear that her example sentences were libellous; for example,"]},{"title":"Sheldon kicked Shirley","paragraphs":["was said to be defamatory of Sheldon, whoever he might be. \"Stalking the perfect journal\" sets out nine commonsense criteria for mechanical aspects of academic journals, which few journals actually meet--such as printing the full postal addresses of authors."]},{"title":"(Computational Linguistics","paragraphs":["scores 5 out of 9.) And \"Punctuation and human freedom\" takes on copyeditors (like those at"]},{"title":"Computational Linguistics--Hi,","paragraphs":["Lori!) who insist on making periods and commas precede closing quotation marks even when logic and truth demand otherwise.","Pullum's talent at mixing wit with diatribe and fact with fiction makes him a kind of Garry Trudeau of linguistics. Or maybe Dave Barry. (Can newspaper syndication be far away?) His engaging book will delight any linguist whose name does not appear in it.--"]},{"title":"G.H. Common Lisp Modules: Artificial Intelligence Jin the Era of Neural Networks and Chaos Theory Mark Watson","paragraphs":["(Science Applications International Corporation) New York: Springer-Verlag, 1991, vii + 207 pp. Paperbound, ISBN 0-387-97614-0, no price listed This book contains complete programs and modules in Common Lisp for a variety of artificial intelligence applications--parsing, speech recognition, neural net simulation, expert systems, and so on. They are all written in Common Lisp, and use a portable graphics interface (also included). They can be typed in from the book, or (preferably!) purchased on a disk from the author for $12. Included is considerable discussion of how each program works, and the theory behind each-- obviously essential for serious use of the programs. While none of the programs is exactly a major commercial product, each is sophisticated enough to be of considerable interest to any student of AI who wants to learn by playing with, and extending, real code. All would make good starting points for further projects.--G.H. 116"]}]}