{"sections":[{"title":"Linguistics & Language Behavior Abstracts Now entering our 26th year (135,000 abstracts to date) of service to linguists and language researchers worldwide. LLBA is available in print and also on-line from BRS and Dialog. Linguistics & Language Behavior Abstracts P.O. Box 22206 San Diego, CA 92]92-0206 Phone (619)695-8803 FAX (619) 695-0416 Fast, economical document delivery available. Special Offer Save 20% The Cambridge/ACL Series STUDIES IN NATURAL LANGUAGE PROCESSING AravindJoshi, Series Editor This series of monographs, texts, and edited volumes is published in cooperation with the Association for Computational Linguistics. THE LINGUISTIC BASIS OF TEXT GENERATION Laurence Danlos","paragraphs":["232 pp. line diagrams 32938-8 Hc List: $54.95 Discount: $43.96"]},{"title":"NATURAL LANGUAGE PARSING Psychological, Computational and","paragraphs":["Theoretical"]},{"title":"Perspectives David R. Dowty, Lauri Karttunen and Arnold M. Zwicky, Editors.","paragraphs":["432 pp. 10 tables/20 diagrams 26203-8 Hc List: $74.95 Discount: $59.96"]},{"title":"RELATIONAL MODELS OF THE LEXICON Representing Knowledge in Semantic Networks Martha Walton Evens, Editor","paragraphs":["400 pp. tables/line diagrams 36300-4 Hc List: $42.95 Discount: 34.36"]},{"title":"COMPUTATIONAL LINGUISTICS An Introduction Ralph Grishman","paragraphs":["208 pp. many line diagrams 31038-5 Pb List: $18.95 Discount: $15.16 Now available in paper..."]},{"title":"SEMANTIC INTERPRETATION AND THE RESOLUTION OF AMBIGUITY Graeme Hirst","paragraphs":["275 pp. 15 tables/25 diagrams 42898-X Pb List: $22.95 Discount: $18.36"]},{"title":"REFERENCE AND COMPUTATION An Essay in Applied Philosophy of Language Amichai Kronfeld","paragraphs":["207 pp. 36636-4 Hc List: $54.95 Discount: $43.96 39982-3 Pb List: $15.95 Discount: $12.76"]},{"title":"SEMANTIC PROCESSING FOR FINITE DOMAINS Martha Stone Palmer","paragraphs":["208 pp. 36226-1 HC List: $54.95 Discount: $43.96"]},{"title":"SYSTEMIC TEXT GENERATION AS PROBLEM SOLVING Terry Patten","paragraphs":["240 pp. Some line diagrams 35076-X Hc List: $42.95 Discount: $34.36 In the US and Canada, order from Cambridge University Press, Dept GLH 40 West 20th Street, New York, NY 10011-4211. All orders must be prepaid by check or charged on VISA or MasterCard. Residents of NY and CA add sales tax, Canadian residents add 7% GST. Shipping charges in the U.S. and Canada are $2.00 for the first book and $0.75 for each additional book."]},{"title":"Discount offer available to ACL members only. THE ACL-MIT PRESS SERIES in NATURAL LANGUAGE PROCESSING Aravind K. Joshi, Karen Sparck Jones, Mark Y. Liberman, Editors The ACL Series will offer books of high quality in the field of natural language processing, including human and machine speech production and understanding. It will cover a wide range of topics, both theoretical and applied, which should interest researchers not only in computational linguistics, but also in formal linguistics. The Series will include specially commissioned volumes, research monographs, textbooks, and on occasion, collections of high quality papers with clear unifying themes compiled under the editorship of distinguished researchers. The MIT Press publishes the ACL journal, Computational Linguistics. The Press also has a strong list in formal linguistics and publishes the journal Linguistic Inquiry. Submissions for the ACL Series should be directed to one of the Editors, or to Henry Bradford Stanton at The MIT Press ISSUES IN NATURAL LANGUAGE G edited by Peter Sells, Stuart M. Shieber, and Thomas Wasow William Rounds, AvarindJoshi, janet Fodor, and Robert Berwick are leading scholam in the In four separate essays they address the complex and natural-language-processing systems, both human and electronic. The editors' subtantial introduction details the progress and problems involved in attempts to relate these four areas of research.","paragraphs":["A Bradford Book $32.50"]},{"title":"COGNITIVE MODELS OF SPEECH PROCESSING Psycholinguistic & Computational Perspectives edited by Gerry T.M. Altmann Cognitive Models of Speech Processing presents extensive reviews of current thinking on psycholinguistic and computational topics in speech recognition and natural language processing, along with a substantial body of new experimental data and computational simulations.","paragraphs":["A Bradford Book $55.00"]},{"title":"PlAN RECOGNITION IN NATURAL lANGUAGE DIALOGUE Sandra Carberry In most current natural language systems each query is treated as an isolated request for information regardless of its context in dialogue. Sandra Carberry addresses the problem of creating computational stategies that can improve usercomputer communication by assimilating ongoing dialogue and reasoning on the acquired knowledge.","paragraphs":["A Bradford Book $35.00"]},{"title":"INTENTIONS IN COMMUNICATION edited by Philip R. Cohen, Jerry Morgan, and Martha E. Pollack This book address central questions about the nature of intention as it is understood in theories of communication, the crucial role of intention recognition in understanding utterances, and the use of principles of rational interaction in interpreting speech acts.","paragraphs":["A Bradford Book $45.00"]},{"title":"SPEAKING From Intention to Articulation Willem J.M. Levelt Willem \"Pim\" Levelt, Director of the Max Planck Institute for Psycholinguistics, covers the entire process of speech production, from message formulation to articulation to self-evaluation of speech.","paragraphs":["ABradford Book $39.95"]},{"title":"ARGUMENT STRUCTURE Jane Grimshaw Argument Structure is a contribution to linguistics at the interface between lexical syntax and lexical semantics. The main analytical focus is on passives, nominals, psychological predicates, and the theory of external arguments.","paragraphs":["Linguistic Inquiry Monograph No. 18 $25.OO"]},{"title":"MEANING AND GRAMMAR An Introduction to Semantics Gennaro Chierchia and Sally McConnell-Ginet","paragraphs":["$29.95"]},{"title":"THEMITPRFXS 55 Hayward Street Cambridge, MA 02142 THE AMERICAN ASSOCIATION OF UNIVERSITY PRESSES DIRECTORY 1991-1992 As an introduction and guide to the world of university presses, this directory will be an essential reference and resource to anyone who is, or wants to be, involved in scholarly publishing. The Association of American University Presses has for over fifty years worked to encourage the dissemination of scholarly research and ideas. Today the 102 members of the AAUP annually publish over 8,000 books and more than 500 periodicals. This directory offers a detailed introduction to the structure and publishing programs of AAUP member presses. Among its useful features are: [] Information on 102 university presses in the U.S., Canada, and overseas [] Complete addresses, phone and fax numbers [] Names and responsibilities of key staff [] Subject area guide, with 136 categories, indicating which presses publish in a given area [] Advice for authors on the submission of manuscripts Distributed for the Association of American University Presses The University of Chicago Press","paragraphs":["Please send me","QUAN. 1991-92 AAUP DIRECTORY 0-945103-05-0 Paper $14.95 Mail your order to:"]},{"title":"The University of Chicago Press","paragraphs":["11030 South Langley Avenue Chicago, IL 60628 Purchase orders and individual orders charged to Visa and MasterCard may be sent by Fax to: 312/660-2235 Shipping and handling: Please add $2.00 for the first book and $.75 for each additional book. Customers outside the U.S.A. should add $3.00 for the first book and $.75 for each additional book.","Total order $.__","Sales tax (IL addresses 8%) $.~ Shipping and handling $,~ [] Check or money order enclosed Please charge [] VISA [] MasterCard [] Institutional purchase order attached Phone # ( ) Credit Card # Exp. date_ SIGNATURE Name Address City/State/Zip"]},{"title":"SA 1010 ACL 1992 DUES STATEMENT AND CHANGE OF ADDRESS FORM Provide Complete Information To Insure Accurate ACL MEMBERSHIP DIRECTORY Entry","paragraphs":["Membership in the Association for Computational Linguistics is for the calendar year, regardless of when dues are paid. Membership includes a full year of the ACL journal Computational Linguistics, reduced registration at most ACL-sponsored conferences, and discounts on ACL-sponsored publications. A late payment fee will be charged for renewals made after 1 March; this fee does not apply to new members. Students taking a full-time program of courses and not earning a regular income qualify for a reduced rate. Institutions now subscribe to the journal through MIT Press Journals, 55 Hayward Street, Cambridge, MA 02142 USA; (+1-617)253-2889. Back issues and proceedings are available only from the ACL Office, except that institutions should backorder journals from 1988 on through MIT Press. An order form is on the other side of this statement. Payments for dues, back issues, and proceedings can be made in Europe and Japan as well as the U.S.; most Europeans should pay through Europe; read the directions under the heading PAYMENT below carefully. Identify your institutional affiliation if it is not part of your address. Also provide telephone country & city codes and computer network & email address. Write legibly, please! FULL NAME ADDRESS INSTITUTION TELEPHONE COMPUTER NETWORK & EMAIL ADDRESS Provide prompt notification of address changes; copies returned because of bad addresses wilt not be remailed until a $3.00 postage and handling fee is remitted. MEMBERSHIP DUES FOR 1991: Dues for Regular Members are $25. Couples with the same mailing address may become Joint Members for $30; they will receive only one set of publications, but each will be eligible for all other member benefits. Students taking a full-time program of courses and not earning a regular income may become Student Members for $15 with copy of current student ID. Surface mailing costs are included in the membership dues. CHECK MEMBERSHIP CATEGORY: I--IRegular($25) I-1Joint($30) 13Student($15 with ID) DUES $ Optional 1st class or air ($10 U.S., Canada, Mexico; $20 elsewhere): OPTIONAL DUES MAILING $.__ $10 late payment for renewals after I March 1991 LATE PAYMENT FEE $","TOTAL DUES PAYMENT $__ INTERNATIONAL FUND: The ACL set up a fund in 1982 to make ACL memberships and publications available to colleagues who have difficulty in using their national currencies for international transactions or for whom membership would otherwise be impossible. Contributions may be tax-deductible in various countries; check local regulations.","INTERNATIONAL FUND $","PAYMENT: Prepayment is necessary; invoices are available on request. The U.S. dollar price is definitive when","paying in other currencies. Checks and money orders should be made out to the Association for Computational","Linguistics (or to ACL). Payments can be made to one of the addresses below, as follows:","1. To Walker in the USA; mail this dues statement with a check or money order payable to ACL. Bank drafts cannot be accepted. PAYMENTS MUST BE MADE IN U.S. DOLLARS, DRAWN ON A U.S. BANK OR IN U.S. OR CANADIAN DOLLARS (CONVERTED AT THE CURRENT EXCHANGE RATE), DRAWN ON A CANADIAN BANK.","2. To Rosner in Europe; mail this dues statement with a check or money order in Swiss francs or the equivalent in your local currency on the day the check is written, payable to ACL. Ensure that the check is payable in Switzerland or France. Do not issue a cheek or money order in U.S. dollars unless it is drawn on a U.S. Bank. Payment can also be made by bank transfer to ACL account number 141.880.LAV at the Union Bank of Switzerland, 8 rue de Rhone, CH-1211 Geneva 11, SWITZERLAND. Send Rosner a copy of the bank transfer as well as the dues statement. EUROPEAN MEMBERS SHOULD PAY THROUGH ROSNER UNLESS THEY HAVE A U.S. OR CANADIAN BANK ACCOUNT.","3. To Nagao in Japan; transfer an equivalent amount in yen on the day of payment to \"Dai-ichi Kangyo Bank, Hyakumanben Branch; Ordinary Deposit, 476-1319944; Name: Keisangengogakkai Kaihi Nagao Makoto.\" Mail this dues statement to Walker together with a copy of the bank transfer. Also send Nagao a copy of the bank transfer. Note: THE DUES STATEMENT MUST BE SENT TO WALKER TO BE PROPERLY RECORDED IN THE ACL OFFICE. Dr. Donald E. Walker (ACL) Dr. Michael Rosner (ACL) Bellcore, MRE 2A379 IDSIA 445 South Street, Box 1910 Corso Elvezia 36 Morristown, NJ 07960-1910, USA CH-6900 Lugano, SWITZERLAND (+ 1-201 )829-4312 (+41-91 )22-88-81 walker@ flash.bellcore.com mike@idsia.uu.ch Prof. Makato Nagao (ACL) Electrical Engineering Kyoto University Yoshida, Sakyo, Kyoto, JAPAN (+81-75)753-5344 nagao@ pine.kuee.kyoto-u.ac.jp","ORDER FORM FOR ACL BACK ISSUES AND PROCEEDINGS BACK ISSUES: Back issues of Computational Linguistics are available from the ACL, as well as two special supplements: a Directory of Graduate Programs in Computational Linguistics and a Survey of Computational Linguistics Courses. Surface mailing costs axe included in the prices; additional charges for 1st class or air delivery are noted. Institutions must order back issues from 1988 on through MIT Press Journals, 55 Hayward Street, Cambridge, MA 02142 USA; (+1-617)253-2889. CIRCLE VOLUME-YEARS REQUESTED (Each: Members $15; others $25): BACK ISSUES $ 1st class or air (Each volume-year: $5 U.S., Canada, Mexico; $10 elsewhere): BACK ISSUE MAILING $__ Microfiche only: 1974 1975 1976 1977 1978 [No issue publisbedin 1979] CIRCLE VOLUME-YEARS REQUESTED (Each: $25 Regular, $15 Student; others $50): BACK ISSUES $.__ lst class or air (Each volume-year: $1O U.S., Canada, Mexico; $2O elsewhere): BACK ISSUE MAILING $ Print: 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 (Institutions must order 1988-1991 through MIT Press Journals) CHECK SUPPLEMENTS REQUESTED (Members $5; others $10): SUPPLEMENTS $ 1st class or air (each: $3 U.S., Canada, Mexico; $6 elsewhere): SUPPLEMENT MAILING $.__ [] 1986 Directory of Graduate Programs [] 1986 Survey of Courses PROCEEDINGS: Proceedings are available for the ACL conferences listed below, including the COLING-84 volume, which was also the 22nd ACL Annual Meeting. The COLING-86 proceedings can be ordered through the ACL or directly from Bonn as noted below; shipment is from Bonn. The COLING-88 and COLING-90 proceedings are also available from the ACL. Surface mailing costs are included in the prices; additional charges for 1st class or air delivery are noted. CHECK ACL PROCEEDINGS REQUESTED (each: Members $25; others $50): ACL PROCEEDINGS $ 1st class or air (each: $8 U.S., Canada, Mexico; $16 elsewhere): ACL PROCEEDINGS MAILING $ ACL ANNUAL MEETINGS []17th, San Diego, 1979 N18th, Philadelphia, 1980 fql9th, Stanford, 1981 []20th, Toronto, 1982 []21st, Cambridge, 1983 -22nd, see COLING-84 below []23rd, Chicago, 1985 []24th, New York, 1986 []25th, Stanford, 1987 [726th, Buffalo, 1988 []27th, Vancouver, 1989 [728th, Pittsburgh, 1990 []29th, Berkeley, 1991 [730th, Newark, 1992 (delivery in July) CONFERENCES ON APPLIED NATURAL LANGUAGE PROCESSING 171st, Santa Monica, 1983 fq2nd, Austin, 1988 []Third, Trent•, 1992 (delivery in May) EUROPEAN CHAPTER CONFERENCES []lst, Pisa, 1983 []2nd, Geneva, 1985 []3rd, Copenhagen, 1987 []4th, Manchester, 1989 I-qSth, Berlin, 1991 CHECK COLING PROCEEDINGS REQUESTED (prices and charges for optional 1st class or air delivery differ): []COLING-84, Stanford, 1984 (Members $45; others $90) COLING-84 PROCEEDINGS $.__ 1st class or air ($12 U.S., Canada, Mexico; $24 elsewhere): COLING-84 PROCEEDINGS MAILING $ nCOLING-86, Bonn, 1986 (through ACL: $65 surface delivery; $80 air): COLING-86 PROCEEDINGS $.__ (through Bonn: 95 DM surface delivery; 120 DM air; order from IKS e.V., Poppelsdorfer Allee 47, D-5300 Bonn 1, WEST GERMANY; +49/228/735645; UPK000%DBNRHRZ1.BITNET; pay IKS by check or by bank transfer to Bank ftk Gemeinwirtschaft Bonn, Account no. 1205 163 900, BLZ 380 101 11) []COLING-88 (2 volumes), Budapest, 1988 (Members $75; others $150):COLING-88 PROCEEDINGS $.__ 1st class or air ($16 U.S., Canada, Mexico; $32 elsewhere): COLING-88 PROCEEDINGS MAILING $ []COLING-90 (3 volumes), Helsinki, 1990 (Members $95; others $190): COLING-90 PROCEEDINGS $ 1st class or air ($20 U.S., Canada, Mexico; $40 elsewhere): COLING-90 PROCEEDINGS MAILING $.__ PAYMENT: Prepayment is necessary; invoices are available on request. Checks should be made out to the Association for Computational Linguistics (or to ACL). Payments can be made in U.S. dollars drawn on a U.S. bank to Walker at the address below. Payments can also be made in Switzerland by check or bank transfer and in Japan by bank transfer only; for details see the other side of this form.","SEND TO Dr. Donald E. Walker (ACL) FROM Belle•re, MRE 2A379 445 South Street, Box 1910 Morristown, NJ 07960-1910, USA"]},{"title":"Guidelines for Submissions","paragraphs":["Manuscripts for Computational Linguistics should be submitted on letter-size paper (8.5 by 11 inches, or A4), double-spaced throughout, including footnotes and references. The paper should begin with an informative abstract of approximately 150-250 words. Manuscripts must be written in English. Contact the editor regarding the possibility of electronic submission. Submissions may be made in any of the following categories: Papers: This category includes contributions that report significant new research results in computational linguistics or that provide critical reviews of the literature on a particular topic. The length of a paper depends on its content, but it is suggested that manuscripts be limited to forty double-spaced pages. That is the equivalent of thirty journal pages. Each paper is fully refereed, being read by at least two members of the editorial board and usually by an additional expert in the particular subject area. The submission of an article to CL for refereeing means that the author certifies the manuscript is not copyrighted; nor has it been published or submitted for publication to another refereed journal. If any version of the paper has appeared, or will appear, in a non-refereed publication, the details of such publication must be made known to the Editor at the time of submission. The final version of a paper tentatively accepted for publication must be accompanied by a Copyright Transfer Agreement signed by all of the authors or, in the case of a \"work for hire,\" by the employer. This written transfer is necessary under the 1978 U.S. Copyright law. Letters to the Editor: This category includes statements of opinion on issues relevant to the readership. The Editor and the editorial board will evaluate the appropriateness of these contributions for inclusion. Five copies of papers or three copies of letters should be sent to: James E Allen, CL Editor University of Rochester Department of Computer Science Rochester, NY 14627, USA (+1 716) 275-5288; acl@cs.rochester.edu Squibs and Discussions: This category includes short articles reporting technical results, discussions of results, algorithms, or new computational linguistic data or tools of interest to the journal readership. Submissions should generally not exceed eight double-spaced pages and should be submitted to: James Pustejovsky, CL Squibs and Discussions Co-Editor Brandeis University Computer Science Department Waltham, MA 02254, USA (+1 617) 736-2709; jamesp@cs.brandeis.edu Book Section: Anyone interested in reviewing a book, or in suggesting a book for review, should contact the Book Review Editor; publishers may also submit copies of books for review directly to: Graeme Hirst, CL Book Review Editor University of Toronto Department of Computer Science Toronto, CANADA M5S 1A4 (+1 416) 978-8747; gh@cs.toronto.edu The FINITE STRING: Send (a) summaries of research in progress -- of particular interest would be perspectives on the activities at a particular institution; (b) announcements of meetings of potential interest to the membership; and (c) personal notes (e.g., honors, moving, changes in status) to The FINITE STRING Editor. Time-sensitive material should be received by the first day of the second month of each quarter to appear in the next issue. Submissions (where possible in electronic form) should be sent to: Ralph Weischedel, FINITE STRING Editor BBN Systems & Technologies 10 Moulton Street Cambridge, MA 02138, USA (+1 617) 873-3496; weischedel@bbn.com Founded in 1962, the Association for Computational Linguistics (ACL) is the primary scientific and professional society for natural language processing research and applications. A European chapter was established in 1982. Besides publishing Computational Linguistics, the ACL holds international meetings (annually in North America, biennially in Europe) where the state-of-the-art in natural language processing research and development is presented. It also sponsors a series of books on natural language processing through The MIT Press. Recently, special interest groups on the Mathematics of Language, the Lexicon, Parsing, Generation, and Computational Phonology have been formed; others are likely to be added. President (1992) Vice-President (1992) Secretary-Treasurer (1977-92) Executive Committee (1991-92) (1992-93) (1992-94) Journal Editor Series Editors Nominating Committee (1990-92) (1991-93) (1992-94) ACL EUROPEAN CHAPTER OFFICIALS Chair (1991-92) Secretary (1986-92) Treasurer (1982-92) Advisory Committee (1991-92) Nominating Committee (1989-92) (1991-94) Kathleen McKeown Columbia University Computer Science Department New York, NY 10027, USA (+1 212) 854-8194; mckeown@cs.columbia.edu Fernando Pereira AT&T Bell Laboratories 600 Mountain Avenue, 2D447 Murray Hill, NJ 07974-0636, USA (+1 908) 582-3980; pereira@research.att.com Donald E. Walker Bellcore, MRE 2A379 445 South Street, Box 1910 Morristown, NJ 07960-1910, USA (+1 201) 82.9-4312; walker@flash.bellcore.com President, Vice-President, Secretary-Treasurer, and Martha Stone Palmer, National University of Singapore Martha Pollack, University of Pittsburgh Bente Maegaard, Centre for Language Technology James E Allen, University of Rochester Aravind Joshi, University of Pennsylvania Mark Liberman, University of Pennsylvania Karen Spa rck Jones, University of Cambridge Candy Sidner, Digital Equipment Corporation Jerry R. Hobbs, SRI International Ralph Grishman, New York University Christian Rohrer University of Stuttgart Institute for Machine Translation Keplerstrasse 17 D-7000 Stuttgart -1, GERMANY (+49 711) 121 31 29; rohrer@adler.philosophie.uni-stuttgart. Beat Buchmann Credit Suisse Department RU PO Box 590, Schanzeneggstrasse 3 CH-8021 Zurich, SWITZERLAND (+41 1) 333 31 26; beat@idsia.uu.ch Michael Rosner IDSIA Corso Elw'zia 36 CH-6900 Lugano, SWITZERLAND (+41 91) 22 88 81; mike@idsia.uu.ch Margaret King, ISSCO Ewan Klein, University of Edinburgh Ji, irgen Kunze, Central Institute for Linguistics Anna SSgvall-Hein, University of Uppsala (Chair) Jan Landsbergen, Institute for Perception Research Henrik Holmboe, Aarhus School of Business Petr Sgall, Charles University"]}]}