{"sections":[{"title":"","paragraphs":["Book Reviews"]},{"title":"Semantic Structures Ray Jackendoff","paragraphs":["(Brandeis University) Cambridge, MA: The MIT Press (Current Studies in Linguistics 18), 1990, xiv + 322 pp. Hardbound, ISBN 0-262-10043-6, $34.95 Reviewed by Yorick Wilks New Mexico State University In this book a citation appears in passing to Roger Schank on page 93. On page 36 is a section on \"preference rules\" in which we are told that verbs prefer objects of certain types, and that when these are not available in a sentence there may still be an acceptable structure if not too many sentence constraints are broken. The preference can even constitute a \"default value.\" All this is within a large project to construct semantic or conceptual expressions of word meaning on which inference can be done (p. 11), largely verb centered, and expressed in an internal \"I-language\" free from the demands of model theoretic semantics. A typical coding is this (p. 53): drink V (NPj}"]},{"title":"[Event","paragraphs":["CAUSE"]},{"title":"([Thing ]i~ [Event GO ([Thing","paragraphs":["LIQUID]j,"]},{"title":"[Path TO ([place","paragraphs":["IN ([Thing MOUTH OF ([Thing"]},{"title":"]i)])])])])]","paragraphs":["Those in AI and CL who used to make a living 20 years ago writing down these kinds of fantasy codings and making the parentheses match will feel a strong pang of nostalgia if they open this book. If they also used to write about preference rules as a way of using such structures in parsers, the pang will be even stronger. The fun bit is that Jackendoff attributes all this nowhere but to his own earlier works. There is no mention of those hundreds of Schank's students, and his student's students, slaving over such codings (e.g., the systems described by Schank (1975), Schank and Riesbeck (1981); or compare Wilks (1973)). Jackendoff overreaches himself when he claims that preference rules will overcome the problem of Wittgensteinian \"family resemblances\" and imprecise concept boundaries (p. 36). This is a real delusion of grandeur, especially as a glance at, say, Charniak and Wilks (1976) would have shown him not only lots of such conceptual codings, their relationship to preference rules, etc., but even a brief tutorial on Wittgenstein explaining exactly why such systems won't solve philosophical problems as well,","They say middle age is when everyone you meet reminds you of someone you've met before, and the academic equivalent must be that everyone's work starts to remind you of your own. The true situation might be the very reverse of what I'm suggesting: perhaps the AI and CL semantics of the late 1960s and early 1970s was systematically 95 Computational Linguistics Volume 18, Number 1 copying the ideas of contemporary linguists: Fodor, Katz, Weinreich, Giv6n, Gruber, and even Jackendoff. A glance at the codings of those days shows that that is not so, though everyone on both sides was probably more in Fillmore's debt than they admitted at the time.","Anyone who doubts all this, or has memories only fifteen minutes old (a proven research advantage in AI) should turn up the 1970s AI and CL codings of the word"]},{"title":"drink","paragraphs":["as formal versions of glosses such as \"animate entities causing liquids to move towards human apertures.\" But Jackendoff seems to have done a lot more work on them and particularly on the explicit relationship of the lexical codings to related syntactic structures, which was often left implicit in the structure of the parser in the early CL work I referred to.","It may well be said that these superficial similarities are irrelevant (all this FOR, WITH, IN, TO, FROM, etc., occurring identically in lexical codings in both traditions!). They could have just grown up 95% alike by chance (like real mice and marsupial mice in Australia) with no obvious causal influence on each other but only their respective environments. Perhaps, too, one's lexical codings cannot be considered out of a procedural context--for there is as yet no neutral or polythetic lexicon, however much we might all want one so all lexical codings are perhaps dependent on the theory within which they play a role, and so superficial similarities may be irrelevant.","Following that line of argument, Jackendoff's structures could not be judged or considered apart from their declared role, which is that of a lexicon within a linguistic program closer, he says (p. 3), to Chomsky's original one in"]},{"title":"Syntactic Structures,","paragraphs":["than to more recent grammatical theories, one where the semantics component is also generative and not merely \"interpretive,\" while avoiding a position where the semantics is the main generative component, a position he identifies with Montague Grammar and GB theory. All these are dusty struggles of long ago, and the lexical codings in this book are not designed to play a part in any process that a reader of this journal would recognize as computational. Indeed, they are in the good old high style of the imaginary procedures of the transformational generative grammar tradition, simultaneously denied to be procedures while plainly being described in that manner. Certainly they have resulted in no serious computer programs. Being something of a throwback, as it were, this book brings out just how much relations between AI/CL and linguistics have improved, with a generally agreed-upon definition of what a process is and what empirical evidence is. It was not always so.","Yet all this can make you wonder about Cognitive Science. Maybe the bargain isn't quite what we thought: that of researchers working on similar problems but in different conventional disciplines, reading each other's papers and getting together sometimes in nice places to swap insights. Maybe it means some kind of giant ripoff, where you don't have to acknowledge any sources, because in one's own discipline one is doing theoretically based work, while the others, no matter how similar their work seems, are just ad hockery and are ripe for pillage.","Oh, and by the way, Jackendoff works in the same university as James Pustejovsky (cf. Pustejovsky 1991) and"]},{"title":"he","paragraphs":["doesn't get a reference either, so, whatever the NOT-ACQUAINTED function is, it isn't one of simple distance over time or space. If computational linguists still need handcrafted lexical codings (though automatic construction is now the name of the game, of course) they have a long and honorable tradition of making up their own, and would not obviously profit from the ones in this book. 96 Book Reviews","References","Charniak, Eugene, and Wilks, Yorick (eds.) (1976). Computational Semantics. Amsterdam: North-Holland.","Pustejovsky, James (1991). The Generative Lexicon: A Theory of Computational Lexical Semantics. Cambridge, MA: The MIT Press.","Schank, Roger (ed.) (1975). Conceptual Information Processing. Amsterdam: North-Holland.","Schank, Roger, and Riesbeck, Christopher K. (eds.) (1981). Inside Computer Understanding: Five Programs Plus Miniatures. Hillsdale, NJ: Lawrence Erlbaum Associates.","Wilks, Yorick (1973). \"An artificial intelligence approach to machine translation.\" In Computer Models of Thought and Language, edited by Roger Schank and Kenneth Colby. San Francisco: Freeman. 114-151. Yorick Wilks has worked in natural language understanding and machine translation for over 20 years. His books include Grammar, Meaning, and the Machine Analysis of Language, Artificial Believers (with Afzal Ballim), and Automatic Natural Language Parsing (edited with Karen Sparck Jones). He is director of the Computing Research Laboratory, New Mexico State University, Las Cruces, NM 88003; e-mail: yorick@nmsu.edu 97"]}]}