{"sections":[{"title":"Author Index Volumes","paragraphs":["6--17 Allen, James. F. see Perrault, C. Raymond 6(3-4):167-182 Alshwi, Hiyan 13(3--4): 195-202 Processing Dictionary Definitions with Phrasal Pattern Hierarchies. Alshawi, Hiyan 16(3): 133-144 Resolving Quasi Logical Forms. Bachenko, Joan see Johnson, Carroll 8(2): 55-84 Bachenko, Joan and Fitzpatrick, E. 16(3): 155-170 A Computational Grammar of Discourse-Neutral Prosodic Phrasing in English. Ballard, Bruce W. and Tinkham, Nancy L. 10(2): 81-96 A Phrase-Structured Grammatical Framework for Transportable Natural Language Processing. Ballard, Bruce W. see Biermann, Alan W. 6(2): 71-86 Banks, Amelie see Rayner, Manny 16(2): 86-112 Barton, G. Edward Jr. 11(4): 205-218 On the Complexity of ID/LP Parsing. Bennett, Winfield S. and Slocum, Jonathan 11(2-3): 111-121 The LRC Machine Translation System. Benson, David B. see Main, Michael G. 9(1)\" 11-21 Berwick, Robert C. 8(3-4): 97-109 Computational Complexity and Lexical-Functional Grammar. Berwick, Robert C. 10(3--4): 189-202 Strong Generative Capacity, Weak Generative Capacity, and Modern Linguistic Theories. Biermann, Alan W. and Ballard, Bruce W. 6(2): 71-86 Toward Natural Language Computation. Biermann, Alan W. see Fink, Pamela E. 12(1): 13-36 Biewer, Axel; Feneyrol, Christian; Ritzke, Johannes; and Stegentritt, Erwin 11(2-3): 137-154 ASCOF -- A Modular Multilevel System for French-German Translation. Binot, Jean-Louis see Jensen, Karen 13(3-4): 251-260 Birnbaum, Lawrence see Schank, Roger C. et al. 6(1): 13-30 Black, Alan W. see Ritchie, Graeme D. 13(3--4): 290-307 Black, John E. see Weischedel, Ralph M. 6(2): 87-109 Boguraev~. Bran and Briscoe, Ted 13(3-4): 203-218 Large Lexicons for Natural Language Processing: Utilizing the Grammar Coding System of LDOCE. Boitet, Christian see Vauquois, Bernard 11(1): 28-36 Bourbeau, Laurent see Isabel]e, Pierre 11(1): 18-27 Brew, Chris 17(4): 375-408 Systemic Classification and its Efficiency. Briscoe, Ted see Boguraev, Bran 13(3-4): 203-218 Brown, Gretchen P. 6(3--4): 150-166 Characterizing Indirect Speech Acts. Brown, Peter; Cocke, John; Della Pietra, Stephen; Della Pietra, Vincent J.; Jelinek, Frederick; Lafferty, John D.; Mercer, Robert L.; and Roossin, Paul S. 16(2): 79-85 A Statistical Approach to Machine Translation. Byrd, Roy J.; Calzolari, Nicoletta; Chodorow, Martin S.; Klavans, Judith L.; Neff, Mary S.; and Rizk, Omneya, A. 13(3-4): 219-240 Tools and Methods for Computational Linguistics. Calzolari, Nicoletta see Byrd, Roy J. et al. 13(3-4): 219-240 Carberry, Sandra 14(3): 23-37 Modeling the User's Plans and Goals. Carberry, Sandra 15(2): 75-96 A Pragmatics-Based Approach to Ellipsis Resolution. Carbonell, Jaime G. and Hayes, Philip J. 9(3--4): 123-246 Recovery Strategies for Parsing Extragrammatical Language. Carpenter, Robert see Gazdar, Gerald et al. 14(1): 1-19 Carpenter, Robert 17(3): 301-314 The Generative Power of Categorial Grammars and Head-Driven Phrase Structure Grammars with Lexical Rules. Author Index Cercone, Nick see Strzalkowski, Tomek 15(3): 171-186 Chen, K.-J. see Lee, Lin-Shan et al. 17(4): 347-374 Chester, Daniel 6(2): 87-96 A Parsing Algorithm that Extends Phases. Chien, Lee-Feng see Lee, Lin-Shan et al. 17(4): 347-374 Chin, David N. see Wilensky, Robert et al. 14(4): 35-85 Chodorow, Martin S. see Byrd, Roy J. et al. 13(34): 219-240 Church, Kenneth Ward and Hanks, Patrick 16(1): 22-29 Word Association Norms, Mutual Information, and Lexicography. Church, Kenneth Ward and Patil, Ramesh 8(3-4):139-149 Coping with Syntactic Ambiguity or How to Put the Block in the Box on the Table. Clifford, James 14(4): 10-34 Natural Language Querying of Historical Data Bases. Cocke, John see Brown, Peter et al. 16(2): 79-85 Cohen, Philip R. 10(2): 97-146 The Pragmatics of Referring and the Modality of Communication. Cohen, Robin 13(1-2): 11-24 Analyzing the Structure of Argumentative Discourse. Correira, Alfred 6(3--4): 135-149 Computing Story Trees. Croft, William see Hobbs, Jerry R. et al. 13(34): 241-250 Dahl, Veronica 7(3): 149-164 Translating Spanish into Logic through Logic. Dahl, Veronica and McCord, Michael C. 9(2): 69-91 Treating Coordination in Logic Grammars. Dahlgren, Kathleen and McDowell, Joyce 15(3): 149-170 Knowledge Representation for Commonsense Reasoning with Text. Damerau, Fred J. 7(1): 30-42 Operating Statistics for the Transformational Question-Answering System. Davidson, James and Kaplan, S. Jerrold 9(2): 57-68 Natural Language Access to Data Bases: Interpreting Update Requests. Davies, Todd see Hobbs, Jerry R. et al. 13(3-4): 241-250 Dawar, Anuj and Vijay-Shanker, K. 16(1): 11-21 An Interpretation of Negation in Feature Structure Descriptions. D6cary, Michel and Lapalme, Guy 16(3): 145-154 An Editor for the Explanatory and Combinatory Dictionary of Contemporary French (DECFC). Della Pietra, Stephen see Brown, Peter et al. 16(2): 79-85 Della Pietra, Vincent J. see Brown, Peter et al. 16(2): 79-85 DeRose, Steven J. 14(1): 31-39 Grammatical Category Disambiguation by Statistical Optimization. des Tombe, Louis see Johnson, Rod et al. 11(2-3): 155-169 Dyer, Michael G. see Zernik, Uri 13(3-4): 308-327 Dyer, Michael G. see Quilici, Alex et al. 14(3): 38-51 Edwards, Douglas see Hobbs, Jerry R. et al. 13(3-4): 241-250 Evans, Roger see Mellish, Chris 15(4): 233-249 Fasolo, Michela see Velardi, Paola et al. 17(2): 153-170 Fass, Dan and Wilks, Yorick 9(3-4): 178--187 Preference Semantics, Ill-Formedness, and Metaphor. Fass, Dan 17(1): 49-90 met*: A Method for Discriminating Metonymy and Metaphor by Computer. Feneyrol, Christian see Biewer, Axel et al. 11(2-3): 137-154 Finin, Tim see Kass, Robert 14(3): 5-22 Fink, Pamela E. and Biermann, Alan W. 12(1): 13-36 The Correction of IU-Formed Input Using History-Based Expectations with Applications to Speech Understanding. Fisher, Anthony J. 15(3): 139-148 Practical Parsing of Generahzed Phrase Structure Grammars. Fitzpatrick, E. see Bachenko, Joan Flowers, Margot see Quilici, Alex et al. Friedman, Joyce see Warren, David S. Gazdar, Gerald; Pullum, Geoffrey, K.; Carpenter, Robert; 16(3): 155-170 14(3): 38-51 8(3-4): 123-138 121 Computational Linguistics Volume 18, Number 1 Klein, Ewan; Hukari, Thomas E.; and Levine, Robert D. 14(1): 1-19 Category Structures. Goodman, Bradley A. 12(4): 273-305 Reference Identification and Reference Identification Failures. Granger, Richard H. 9(3-4): 188-196 The NOMAD System: Expectation-Based Detection and Correction of Errors during Understanding of Syntactically and Semantically Ill-Formed Text. Grishman, Ralph; Hirschman, Lynette; and Nhan, Ngo Thanh 12(3): 205-215 Discovery Procedures for Sublanguage Selectional Patterns: Initial Experiments. Grosz, Barbara J. and Sidner, Candace L. 12(3): 175-204 Attention, Intentions, and the Structure of Discourse. Guida, Giovanni and Mauri, Giancarlo 10(1): 15-30 A Formal Basis for Performance Evaluation of Natural Language Understanding Systems. Haas, Andrew 15(4): 219-232 A Parsing Algorithm for Unification Grammar. Haas, Andrew 16(4): 213-233 Sentential Semantics for Propositional Attitudes. Hanks, Patrick see Church, Kenneth Ward 16(1): 22-29 Hayes, Philip J. and Mouradian, George V. 7(4): 232-242 Flexible Parsing. Hayes, Philip J. see Carbonell, Jaime G. 9(3-4): 123-146 Heidorn, George E. see Jensen, Karen et al. 9(3-4): 147-160 Hendrix, Gary G. (Chair) 8(2): 56-61 Natural Language Interface, from Proceedings of the Workshop on Applied Computational Linguistics in Perspective. Hinrichs, Erhard W. 14(2): 3-14 Tense, Quantifiers, and Contexts. Hirschmann, Lynette see Grishman, Ralph et al. 12(3): 205-215 Hirst, Graeme 7(2): 85-98 Discourse-Oriented Anaphora Resolution: A Review. Hirst, Graeme see Morris, Jane 17(1): 21-48 Hobbs, Jerry R. and Shieber, Stuart M. 13(1-2): 47-63 An Algorithm for Generating Quantifier Scopings. Hobbs, Jerry R.; Croft, Wi][liam; Davies, ~dd; Edwards, Douglas; and Laws, Kenneth 13(3-4): 241-250 Commonsense Metaphysics and Lexical Semantics. Huang, James see Lee, Lin-Shan et al. 17(4): 347-374 Hukari, Thomas E. see Gazdar, Gerald et al. 14(1): 1-19 Isabelle, Pierre and Bourbeau, Laurent 11(1): 18-27 TAUM-AVIATION: Its Technical Features and Some Experimental Results. Jacobs, Paul S. 11(4): 219-242 PHRED: A Generator for Natural Language Interfaces. Jiippinen, Harri and Ylilammi, Matti 12(4): 257-272 Associative Model of Morphological Analysis: An Empirical Inquiry. Jelinek, Fredrick see Brown, Peter et al. 16(2): 79-85 Jelinek, Frederick and Lafferty, John D. 17(3): 315-324 Computation of the Probability of Initial Substring Generation by Stochastic Context-Free Grammars. Jensen, Karen; Heidorn, George E.; Miller, Lance A.; and Ravin, Yael 9(3-4): 147-160 Parse Fitting and Prose Fixing: Getting a Hold on Ill-Formedness. Jensen, Karen and Binot, Jean-Louis 13(3-4): 251-260 Disambiguating Prepositional Phrase Attachments by Using On-Line Dictionary Definitions. Jensen, Karen see Zadrozny, Wlodek 17(2): 171-210 Johnson, Carroll and Bachenko, Joan 8(2): 55-84 Applied Computational Linguistics in Perspective, from Proceedings of the Workshop on Applied Computational Linguistics in Perspective. Johnson, Mark 17(2): 131-152 Features and Formulae. Johnson, Rod; King, Maghi; and des Tombe, Louis 11(2-3): 155-169 EUROTRA: A Multilingual System under Development. 122 Author Index Jones, Marlene L. see Kalita, Jugal K. et al. 12(2): 107-124 Joshi, Aravind and Levy, Leon S. 8(1): 1-11 Phrase Structure Trees Bear More Fruit than You Would Have Thought. Justeson, John S. and Katz, Slava M. 17(1): 1-20 Co-occurrences of Antoymous Adjectives and Their Contexts. Kac, Michael B.; Manaster-Ramer, Alexis; and Rounds, William C. 13(1-2): 25-30 Simultaneous-Distributive Coordination and Context-Freeness. Kaplan, S. Jerrold see Davidson, James 9(2): 57-68 Kalita, Jugal K.; Jones, Marlene L.; and McCalla, Gordon I. 12(2): 107-124 Summarizing Natural Language Database Responses. Kass, Robert and Finin, Tim 14(3): 5-22 Modeling the User in Natural Language Systems. Katz, Slava M. see Justeson, John S. 17(1): 1-20 Kay, Martin (Chair) 8(2): 74-78 Machine Translation, from Proceedings of the Workshop on Applied Computational Linguistics in Perspective. King, Maghi see Johnson, Rod et al. 11(2-3): 155-169 Kittredge, Richard (Chair) 8(2): 79-82 Sublanguages, from Proceedings of the Workshop on Applied Computational Linguistics in Perspective. Klavans, Judith L. see Byrd, Roy J. et al. 13(3-4): 219-240 Klein, Ewan see Gazdar, Gerald et al. 14(1): 1-19 Kwasny, Stan C. and Sondheimer, Norman K. 7(2): 99-108 Relaxation Theories for Parsing Ill-Formed Input. Lafferty, John D. see Brown, Peter et al. 16(2): 79-85 Lafferty, John D. see Jelinek, Frederick 17(3): 315-324 Langendoen, D. Terence and Postal, Paul M. 10(3-4): 187-188 Comments on Pullum's Criticisms. Langendoen, D. Terence see Postal, Paul M. 10(3-4): 177-181 Lapalme, Guy see D6cary, Michel 16(3): 145-154 Lappin, Shalom and McCord, Michael C. 16(4): 197-212 Anaphora Resolution in Slot Grammar. Laws, Kenneth see Hobbs, Jerry R. et al. 13(3-4): 241-250 Lebowitz, Michael see Schank, Roger C. et al. 6(1): 13-30 Lee, Lin-Shan; Chien, Lee-Feng; Lin, Long-Ji; Huang, James; and Chen, K.-J. 17(4): 347-374 An Efficient Natural Language Processing System Specially Designed for the Chinese Language. Leon, Marjorie see Vasconcellos, Muriel 11(2-3): 122-136 Levine, Robert D. see Gazdar, Gerald et al. 14(1): 1-19 Levy, Leon S. see Joshi, Aravind 8(1): 1-11 Lin, Long-Ji see Lee, Lhl-Shan et al. 17(4): 347-374 Luria, Marc see Wilensky, Robert et al. 14(4): 35-85 Main, Michael G. and Benson, David B. 9(1): 11-21 Denotational Semantics for \"Natural\" Language Question-Answering Programs. Manaster-Ramer, Alexis see Kac, Michael B. et al. 13(1-2): 25-30 Mann, William (Chair) 8(2): 62-69 Text Generation, from Proceedings of the Workshop on Applied Computational Linguistics in Perspective. Mann, William C. and Moore, James A. 7(1): 17-29 Computer Generation of Multiparagraph English Text. Mann, William C. see Webber, David J. 7(3): 165--177 Martin, James see Wilensky, Robert et al. 14(4): 35-85 Martin, William A. 7(3): 137-147 Roles, Co-Descriptors, and the Formal Representation of Quantified English Expressions. Mauri, Giancarlo see Guida, Giovanni Mayfield, James see Wilensky, Robert et al. McCalla, Gordon I. see Kalita, Jugal K. et al. McCord, Michael C. Slot Grammars. McCord, Michael C. 10(1): 15-30 14(4): 35-85","12(2): 107-124 6(1): 31-43 15(1): 33-52 123 Computational Linguistics Volume 18, Number 1 Design of LMT: A Prolog-Based Machine Translation System. McCord, Michael C. see Dahl, Veronica 9(2): 69-91 McCord, Michael C. see Lappin, Shalom 16(4): 197-212 McCoy, Kathleen F. 14(3): 52-63 Reasoning on a Highlighted User Model to Respond to Misconceptions. McDowell, Joyce see Dahlgren, Kathleen 15(3): 149-170 McKeown, Kathleen R. 9(1): 1-10 Paraphrasing Questions Using Given and New Information. Melcuk, Igor and Polgu~re, Alain 13(3--4): 261-275 A Formal Lexicon in the Meaning-Text Theory (Or How to Do Lexica with Words). Mellish, C.S. 14(1): 40-51 Implementing Systemic Classification by Unification. Mellish, Chris and Evans, Roger 15(4): 233-249 Natural Language Generation from Plans. Mercer, Robert L. see Brown, Peter et al. 16(2): 79-85 Miller, Lance A. see Jensen, Karen et al. 9(3-4): 147-160 Milne, Robert 12(1): 1-12 Resolving Lexical Ambiguity in a Deterministic Parser. Moens, Marc and Steedman, Mark 14(2): 15-28 Temporal Ontology and Temporal Reference. Montgomery, Christine (Chair) 8(2): 70-73 Concept Extraction, from Proceedings of the Workshop on Applied Computational Linguistics in Perspective. Moore, James A. see Mann, William C. 7(1): 17-29 Moore, Robert C. see Shieber, Stuart M. et al. 16(1): 30-42 Morris, Jane and Hirst, Graeme 17(1): 21-48 Lexical Cohesion Computed by Thesaural Relations as an Indicator of the Structure of Text. Mouradian, George V. see Hayes, Philip J. 7(4): 232-242 Nagao, Makoto; Tsujii, Jun-ichi; and Nakamura, Jun-ichi 11(2-3): 91-110 The Japanese Government Project for Machine Translation. Nakamura, Jun-ichi see Nagao, Makoto et al. 11(2-3): 91-110 Nakhimovsky, Alexander 14(2): 29-43 Aspect, Aspectual Class, and the Temporal Structure of Narrative. Neff, Mary S. see Byrd, Roy J. et al. 13(3--4): 219-240 Nirenburg, Sergei and Raskin, Victor 13(3-4): 276-289 The Subworld Concept Lexicon and the Lexicon Ivianagement System. Nhan, Ngo Thanh see Grishman, Ralph et al. 12(3): 205-215 O'Shaughnessy, Douglas D. 15(2): 97-108 Parsing with a Small Dictionary for Applications such as Text to Speech. Paris, C4cile L. 14(3): 64--78 Tailoring Object Descriptions to a User's Level of Expertise. Passonneau, Rebecca J. 14(2): 44-60 A Computational Model of the Semantics of Tense and Aspect. Patil, Ramesh see Church, Kenneth 8(3-4): 139-149 Pazienza, Mariia T. see Velardi, Paola et al. 17(2): 153-170 PeUetier, Francis J. see Schubert, Lenhart 8(1): 27-44 Pereira, Fernando C.N. 7(4): 243-256 Extraposition Grammars. Pereira, Fernando C. N. see Warren David H.D. 8(3--4): 110-122 Pereira, Fernando C.N. 16(1): 1-10 Categorial Semantics and Scoping. Pereira, Fernando C. N. see Shieber, Stuart M. et al. 16(1): 30M2 Perrault, C. Raymond 10(3-4): 165-176 On the Mathematical Properties of Linguistic Theories. Perrault, C. Raymond and Allen, James F. 6(3--4): 167-182 A Plan-Based Analysis of Indirect Speech Acts. Polgu~re, Alain see Melcuk, Igor 13(3-4): 261-275 Postal, Paul M. and Langendoen, D. Terence 10(3-4): 177-181 English and the Class of Context-Free • Languages. Postal, Paul M. see Langendoen, D. Terence10(3-4): 187-188 Pullum, Geoffrey K. 10(3--4): 182-186 On Two Recent Attempts to Show that English is Not a CFL. Pullum, Geoffrey K. 124 Author Index see Gazdar, Gerald et al. 14(1): 1-19 Pulman, Stephen G. see Ritchie, Graeme D. 13(3-4): 290-307 Pustejovsky, James 17(4): 409-441 The Generative Lexicon. Quilici, Alex; Dyer, Michael G.; and Flowers, Margot 14(3): 38-51 Recognizing and Responding to Plan-Oriented Misconceptions. Radzinski, Daniel 17(3): 277-300 Chinese Number-Names, Tree Adjoining Languages, and Mild Context-Sensitivity in Natural Language Discourse. Raskin, Victor see Nirenburg, Sergei 13(3-4): 276-289 Ravin, Yael see Jensen, Karen et al. 9(3--4): 147-160 Rayner, Manny and Banks, Amelie 16(2): 86-112 An Implementable Semantics for Comparative Constructions. Ritchie, Graeme D.; Pulman, Stephen G.; Black, Alan W.; and Russell, Graham J. 13(3-4): 290-307 A Computational Framework for Lexical Description. Ritzke, Johannes see Biewer, Axel et al. 11(2-3): 137-154 Rizk, Omneya A. see Byrd, Roy J. et al. 13(3-4): 219-240 Robinson, Ann E. 7(1): 1-16 Determining Verb Phrase Referents in Dialogs. Roossin, Paul S. see Brown, Peter et al. 16(2): 79-85 Rounds, William C. see Kac, Michael B. et al. 13(1-2): 25-30 Rounds, William C. 14(4): 1-9 LFP: A Logic for Linguistic Descriptions and an Analysis of its Complexity. Russell, Graham J. see Ritchie, Graeme D. 13(3-4): 290-307 sato, Paul T. 14(1): 20-30 A Common Parsing Scheme for Left- and Right-Branching Languages. Savitch, Walter 15(4): 250-261 A Formal Model for Context-Free Languages Augmented with Reduplication. Schank, Roger C.; Lebowitz, Michael; and Birnbaum, Lawrence 6(1): 13-30 An Integrated Understander. Schubert, Lenhart and Pelletier, Francis J. 8(1): 27-44 From English to Logic: Context-Free Computation of 'Conventional' Logical Translation. Selfridge, Mallory 12(2): 89-106 Integrated Processing Produces Robust Understanding. Seo, Jungyun and Simmons, Robert F. 15(1): 19-32 Syntactic Graphs: A Representation for the Union of All Ambiguous Parse Trees. Shapiro, Stuart C. 8(1): 12-26 Generalized Augmented Transition Network Grammars for Generation from Semantic Networks. Shieber, Stuart M. see Hobbs, Jerry R. 13(1-2): 47-63 Shieber, Stuart M.; van Noord, Gertjan; Pereira, Fernando C. N.; and Moore, Robert C. 16(1): 30-42 Semantic-Head-Driven Generation. Sidner, Candace L. 7(4): 217-231 Focusing for Interpretation of Pronouns. Sidner, Candace L. see Grosz, Barbara J. 12(3): 175-204 Simmons, Robert F. see Seo, Jungyun 15(1): 19-32 Slocum, Jonathan 11(1): 1-17 A Survey of Machine Translation: Its History, Current Status, and Future Prospects. Slocum, Jonathan see Bennett, Winfield S. 11(2-3): 111-121 Sondheimer, Norman K. see Kwasny, Stan C. 7(2): 99-108 Sondheimer, Norman K. see Weischedel, Ralph M. 9(3-4): 161-177 Stabler, Edward P., Jr. 13(1-2): 1-10 Restricting Logic Grammars with Government-Binding Theory. Steedman, Mark see Moens, Marc 14(2): 15-28 Stegentritt, Erwin see Biewer, Axel et al. 11(2-3): 137-154 Stock, Oliviero 15(1): 1-18 Parsing with Flexibility, Dynamic Strategies, and Idioms in Mind. Strzalkowski, Tomek and Cercone, Nick 15(3): 171-186 Non-singular Concepts in Natural Language Discourse. Tinkham, Nancy L. see BaUard, Bruce W. 10(2): 81-96 Tomita, Masaru 13(1-2): 31-46 An Efficient Augmented-Context-Free Parsing Algorithm. 125 Computational Linguistics Volume 18, Number 1 Tsujii, Jun-ichi see Nagao, Makoto et al. 11(2-3): 91-110 Tsutsumi, Taijiro 16(2): 71-78 Wide-Range Restructuring of Intermediate Representations in Machine Translation. van Noord, Gertjan see Shieber, Stuart M. et al. 16(1): 30-42 Vasconcellos, Muriel and Leo, Marjorie 11(2-3): 122-136 SPANAM and ENGSPAN: Machine Translation at the Pan American Health Organization. Vauquois, Bernard and Boitet, Christian 11(1): 28-36 Automated Translation at Grenoble University. Velardi, Paola; Pazienza, Maria T.; and Fasolo, Michela 17(2): 153-170 Semantics of Paragraphs. Vijay-Shanker, K. see Dawar, Anuj 16(1): 11-21 Vitale, Tony 17(3): 257-276 An Algorithm for High Accuracy Name Pronunciation by Parametric Speech Synthesizer. Warren, David H. D. and Pereira, Fernando, C. N. 8(3-4): 110-122 An Efficient Easily Adaptable System for Interpreting Natural Language Queries. Warren, David Scott and Friedman, Joyce 8(3M): 123-138 Using Semantics in Non-Context-Free Parsing of Montague Grammar. Webber, Bonnie Lynn 14(2): 61-73 Tense as Discourse Anaphor. Webber, David J. and Mann, William C. 7(3): 165-177 Prospects for Computer-Assisted Dialect Adaptation. Weiner, E. Judith 10(1): 1-14 A Knowledge Representation Approach to Understanding Metaphors. Weischedel, Ralph M. and Black, John E. 6(2): 87-109 Responding Intelligently to Unparsable Inputs. Weischedel, Ralph M. and Sondheimer, Norman K. 9(3-4): 161-177 Meta-rules as a Basis for Processing Ill-Formed Output. Wilensky, Robert; Chin, David N.; Luria, Marc; Martin, James; Mayfield, James; and Wu, Dekai 14(4): 35-85 The Berkeley UNIX Consultant Project. Wilks, Yorick see Fass, Dan 9(3-4): 178-187 Woods, William A. 6(1): 1-12 Cascaded ATN Grammars. Wu, Dekai see Wilensky, Robert et al. 14(4): 35-85 Ylilammi, Matti see Jappinen, Harri 12(4): 257-272 Zadrozny, Wlodek and Jensen, Karen 17(2): 171-210 Semantics of Paragraphs. Zernik, Uri and Dyer, Michael G. 13(3-4): 308-327 The Self-Extending Phrasal Lexicon. Zoeppritz, Magdalena 7(2): 109-119 The Meaning of OF and HAVE in the USL System. 126"]}]}