{"sections":[{"title":"","paragraphs":["Computational Linguistics Volume 18, Number 3"]},{"title":"S4mantique et Recherches Cognitives Francois Rastier","paragraphs":["(Centre National de la Recherche Scientifique) Paris: Presses Universitaires de France (Formes S6miotiques), 1991, 262 pp. Paperbound, ISBN 2-13-043825, FF 185"]},{"title":"Reviewed by Jean-Pierre Corriveau Carleton University","paragraphs":["In this superbly written essay, Francois Rastier, a distinguished French linguist with several books on interpretative semantics, questions the foundations of linguistics and cognitive science in order to investigate the role of semantics with respect to the other disciplines of this 'new' interdisciplinary science of cognition. The book is organized into three sections: the first, of 100 pages, considers the history and epistemology of cognitive science; the second, of particular relevance to computational linguists, studies in 60 pages the relationship between semantics and AI; and the last, of 70 pages, investigates the interactions between semantics on the one hand, and psychology and neurosciences on the other hand.","Before developing these different studies, Rastier clearly states his positions in a 10-page introduction. In his opinion, \"linguistics is a descriptive, partially predictive science [and] empirical rationalism 1 is the philosophical approach best suited to the theoretical activity of the linguist \"2 (p. 12) for it can account for the multiplicity of de-terminations proper to linguistic objects such as texts. Only the dogmatic rationalist, guilty of unwarranted theoretical reductionism, searches for methodological universals \"that he invents and reifies, admiring himself for their discovery\" (p. 12). For Rastier, diversity, not unity, is taken to be the fundamental problem of linguistics. In particular, context, both linguistic and nonlinguistic, is taken to be an integral"]},{"title":"unpredictable","paragraphs":["component of comprehension, accounting for the multiplicity of interpretations. One may reduce context to a Montague-like index, but recognizing the existence of contextual variables says little about their instantiation. Consequently, for Rastier, \"linguistic performance consists in adapting oneself to a situation whose parameters escape the computational paradigm\" (p. 13). Linguistics is viewed as a subdiscipline of semiotics, a social science, concerned with actual tongues, 3 concrete linguistic communication, and cultures--three factors systematically downplayed, if not ignored, by cognitive science.","This introduction sets the tone for the rest of the book and presents its two recurring themes: a systematic attack on universalism (its leaders and its philosophical underpinnings) and a strong argument in favor of the existence and autonomy of a semiotic level, which includes semantics, the world of the Saussurian"]},{"title":"signifid,","paragraphs":["distinct","from the conceptual level.","Section 1 starts with an investigation into the nature, history, and assumptions of","cognitive science. According to Rastier, only the functionalist postulate, which assumes 1 Unfortunately, the notion of \"empirical rationalism\" is not elaborated upon in the book. 2 Throughout this review, quotations are my own translations from the French text. 3 Following Rastier, I will use the term tongue (the French langue) throughout this review rather than the predominant term language (langage), which Rastier rejects because of its formalist connotations. 360 Book Reviews that humans and machines are able to understand in similar ways, gives unity to cognitive science. But the interdisciplinary nature of the field does not grant it the status of a science, and thus Rastier quickly disposes of the expression cognitive science in favor of the more prudent cognitive researches. 4 This is not merely a point of terminology. In effect, Rastier dismisses the existence of a science of cognition, unduly created by the functionalist credo that has come to dominate epistemology with the emergence of the computer. Furthermore, AI is taken to be not a science but a technology whose object of study belongs first to philosophy: the interdisciplinary nature of cognitive studies does not avoid their purely technical functionalist views. For example, the reduction of rationality to formality, the conflation of meaning and representation, and the be-lief that an algorithm can validate a theory, all proceed from functionalism. Orthodox cognitivism, as best exemplified by the 'MIT school,' especially Chomsky and Fodor, rests on these three misconceptions. Most of the essay is spent attacking this particular position. Regarding connectionism, as well as Winograd's recent argumentation for a 'new design,' which both attempt to appropriate phenomenology and Heidegger to themselves, Rastier only briefly deplores the misuse of Heideggerian phenomenology, which is profoundly antitechnological, to improve a technology, namely AI.","Having dismissed cognitive science per se, Rastier argues that only comparative linguistics can account for the diversity of tongues and dialects, and thus participate in cognitive researches. Formal approaches to human communication require a universal grammar, unduly distinct from a lexicon, which standardizes tongues into 'natural language,' ignoring in the process all cultural facets of human communication. Thus, linguistics is erroneously specialized into a computationalist science of language: formalists restrict the object of study of linguistics but yet, paradoxically, require theoretical universals proper to dogmatic rationalism (whose universalism Rastier relates to American imperialism and ethnocentrism!). What is in question is the nature of linguistics per se. Rastier pleads convincingly for a humanist approach to linguistics; one, in particular, that does not rely on the Chomskyan distinction between semantics (concerned with the problem of reference) and pragmatics (concerned with the problem of inference). For this separation not only logicizes semantics but, more importantly, incorrectly conflates meaning and representation. This leads Rastier to discard all cognitive theories of meaning (denotational semantics including possible worlds and procedural semantics, primitivism a la Schank or Wilks, propositionalism, etc.). In fact, Rastier rejects the traditional instrumental view of language based on the idealistic Aristotelean triad of meaning, which \"bans semantics from linguistics and makes it dependent on an ontology, which is the only thing able to link words to reality through the mediation of concepts\" (p. 90). Instead, in order to rehabilitate linguistics as a social science and separate semantics from psychology, Rastier considers signifi6s of tongues and mental representations to be distinct, mutually conditioning cultural formations. A nondeterministic relativism is adopted, as defined by the following: \"The semantic structures of a text constrain the psychic representations that accompany its utterance and its interpretation, without however determining its meaning in the strong sense of the term\" (p. 97). Sapir and Whorf as anthropologists are credited with giving culture its due importance in linguistics, despite their seeming linguistic determinism.","Up to this point of the discussion, Rastier's arguments are mostly philosophical. But for the rest of the section, the linguist proper takes over and argues at a technical 4 Though awkward in English, the phrase cognitive researches is the best translation I can offer for recherches cognitives in which the plural subtly marks the disparity of research fields pertaining to cognition. 361 Computational Linguistics Volume 18, Number 3 level for a differential semantics, based on the principle of dissimilation, which supports nondeterministic relativism. In essence, the Saussurian concept of value is taken to define the true reality of linguistic units in that the value of a signifi6 is determined by its position with respect to the tongue taken as a system: \"The linguistic meaning is not (or not only) constituted by the reference to things, or by the inference between concepts, but also and firstly by the difference between linguistic units... The signifi6 of a lexie 5 is defined as a value; the differences [between semes] that constitute this value determine its operational contents, that is, the set of its possibilities for assembling in texts... The operational contents constrain the eidetic contents, without however determining it in the strong sense\" (pp. 101-103). The task of the linguist then consists in determining semantic classes, through the study of lexical commutations and co-occurrences, and social norms. Traditional objections to Saussurian semantics are shown to rest on the rejected Aristotelean triad. Moreover, Rastier refers to another of his books to claim that differential semantics has the advantage of being unified, that is, of also addressing inference and reference. In the end, the subsuming thesis is that every semantic occurrence is unique and that any semantic type is but a conceptual reconstruction: \"not only are there no two synonymous words, but there are no two identical occurrences of the same word\" (p. 114). Examples with synonyms, tautologies, and parataxic sequences, all extensively studied by the author in previous work, illustrate the discussion.","In the second section of the book, Rastier investigates the relationship between semantics and AI, though this may seem pointless after having rejected its dominant theories of meaning. First, semantic networks are considered. Rastier agrees with Wilks in trying \"to assimilate the structures of knowledge to textual structures, rather than the opposite, for the representation of language is the difficult task, and the representation of knowledge per se is meaningless outside of this\" (p. 130). Rastier remarks that the knowledge value of a network is not dependent on it. Instead, the knowledge value of a text (and thus of the network that could model it) is defined not in terms of its truth but of the relation between the text's cohesion and coherence. The point of the complicated argumentation is two-fold: (a) concepts cannot be modeled independently from language, and (b) semantics is not reducible to any sort of logic. For Rastier, the relationship between reference and inference constitutes the fundamental problem of formal semantics. AI has not reconciled these two complementary views of semantics (though Sowa is praised for addressing this precise problem). Instead, with the emergence of cognitive science, AI has merely moved away from formal semantics toward cognitive semantics in which meaning becomes plausible inferences, that is, to a psychological ontology, ultimately opening the door to connectionist networks and their statistical decisions. Second, Rastier dissects AI formalisms with respect to the fundamental problem of relevance. After reviewing existing approaches, Rastier concludes that they are unable to accommodate a signifi6 constructed differently for each occurrence of its significant. In other words, no a priori mechanisms (such as necessary conditions, scriptal lexicons, or selectional features) offers a valid solution to the problem of relevance. Finally, the section ends with philosophical considerations regarding human-machine dialogs. The argument here is easy to follow, contrasting with the burdened presentation of the rest of the section. The Turing test, viewed as a founding technological myth, is quickly discarded and a list of six abilities missing in current interfaces is established (including lying and negotiating). Rastier also requires the system to model the user in order to attenuate the problem of relevance. 5 Defined in Rastier's glossary as \"a stable grouping of morphemes, forming a functional unit.\" 362 Book Reviews But in the end, Rastier rejects the maximalist AI goal of a perfect simulation, for \"in practice, the user knows very well if he is addressing a man or a machine, and adapts consequently\" (p. 174).","The last section of the book considers psychology and neurosciences from a semantic perspective. Psycholinguistics is immediately discredited, as it keeps 'proving' Chomskyan theories without noticing their contradictions! Rastier's next target (the word isn't too strong!) is Rosch's theory of categorization, which is swiftly demolished from philosophical, linguistic, and methodological viewpoints, and labeled as an \"impoverished variant of Aristotle's ideas\" (p. 188). The underlying theme is familiar: prototypes are merely universals. But Rastier's expertise, which allows him to exhibit linguistic phenomena supporting a cultural diachronic view of tongues, makes this entertaining reading.","Up to this point, the reader probably has only a fragmented view of Rastier's proposal. In order to introduce a semiotic level per se, Rastier hypothesizes a semantic perception, that is, semantic processing generally akin to form recognition. For him, mental images are the psychological correlates of the linguistic signifi6s. It follows that propositionalism is once again thrashed. Semantics is taken to constrain not only perception but also mental imagery, which depends on context and is taken to be part of the referential process. Semantic dissimilation is related to perceptive inhibition and semantic assimilation to priming. In effect, Rastier skillfully specifies the delicate boundary between linguistics and psychology while constantly criticizing the universalism subsuming cognitive psychology. The section ends with a scathing review of Chomskyan nativism and Fodorian modularism, both contradicted, according to Rastier, by recent results in neurosciences. Abandoning the Platonic idea of a universal grammar, genetically encoded according to Chomsky, linguistics and neurosciences must instead cooperate to understand the epigenesis of the brain and the mechanisms of learning, especially in its socio-cultural facets.","The epilogue summarizes Rastier's anticognitivist positions and his thesis on the existence of a semiotic level, mediating between the mental and neuronal states.","As a whole the book has a few more flaws than just the absence of any index and some annoying editing mistakes, especially in the footnotes. First, Rastier says little about connectionism. Despite flatly rejecting the neuronal metaphor, labeling massive parallelism as just another technology, equating local connectionism to scriptal lexicons, and complaining that connectionism still conflates signifi6s and representations, Rastier praises Smolensky, some work on ambiguity, and the importance given to learning. Second, Rastier does not elaborate on the positions of traditional opponents of AI. Consequently, his anticomputationalist stance does not seem sufficiently motivated. Third, he too often refers to his previous work without sufficiently elaborating on his theses for this book to be self-contained. In some cases, the absence of an adequate summary of his ideas results in opaque paragraphs that muddle his technical explanations. The two-page glossary is of little help to the nonlinguist. Fourth, because the book is not self-contained, some arguments in favor of differential semantics lose some of their weight, and some of the discussion loses its sense of direction. At times, especially in Section 2, the reader is saturated with attacks on cognitivism without immediately being able to perceive Rastier's point and decide whether his proposals address and solve the problems he presents. Typically, there is a serious shortage of examples illustrating his proposed mechanisms, with the consequence that the book will probably be unpalatable to the layman. Finally, a minor complaint: having linked differential semantics to the French Enlightment, Saussure, and Greimas, the author should have provided some comment on post-structuralism, reception theory, and deconstruction. 363 Computational Linguistics Volume 18, Number 3","In my opinion, this essay is important for computational linguists and cognitive scientists in general, for it questions from the viewpoint of a scholar the foundations of their work and sketches an alternative program of research for linguistics. In particular, Rastier goes far beyond Sowa in tracing the origins of philosophical, psychological, and linguistic theories. This is not a mere (highly instructive) exercise of erudition but, as Rastier clearly states, a challenge to traditional occidental idealism. Also, this historical perspective allows him to skin those researchers who 'discover' ideas dating to the nineteenth century, if not to Greek philosophers. Beyond Chomsky and Fodor, Rastier's favorite targets include Rosch, Grice, Fillmore, and Jackendoff. Finally, the book is up to date on work in AI, and its caustic iconoclastic attacks on all (current and historical) leaders of cognitive science are not only quite entertaining, but also educational inasmuch as they suggest an interesting classification of a large body of research. Jean-Pierre Corriveau is an assistant professor at Carleton University. His interests include memory-based natural language processing and reader-based understanding. His address is: School of Computer Science, Carleton University, Ottawa, Canada KIS 5B6. emaih jeanpier@scs.carleton.ca 364"]}]}