{"sections":[{"title":"September 1992 Volume 18, Number 3 Computational Linguistics Special Issue on Inheritance: II Articles","paragraphs":["Making DATR Work for Speech: Lexicon Compilation in SUNDIAL Inheritance and Complementation: A Case Study of Easy Adjectives and Related Nouns A Practical Approach to Multiple Default Inheritance for Unification-Based Lexicons"]},{"title":"Technical Correspondence Automatic Clustering of Languages Book Reviews","paragraphs":["Towards a Theory of Cognition and Computing J. Gerard Wolff Papers in Laboratory Phonology I: Between the Grammar and Physics of Speech John Kingston and Mary E. Beckman, eds. S4mantique et Recherches Cognitives Francois Rastier Computational Morphology: Practical Mechanisms for the English Lexicon Graeme D. Ritchie, Graham J. Russell, Alan W. Black, and Stephen G. Pulman Intelligent User Interfaces Joseph W. Sullivan and Sherman W. Tyler, eds. Adaptive Parsing: Self-Extending Natural Language Interfaces Jill Fain Lehman Generalized LR Parsing Masaru Tomita, ed. Literature and Cognition Jerry R. Hobbs Briefly Noted Francois Andry, Norman M. Fraser, Scott 245 McGlashan, Simon Thornton, and Nick J. Youd Dan Flickinger and John Nerbonne 269 Graham Russell, Afzal Ballim, John 311 Carroll, and Susan Warwick-Armstrong Vladimir Batageljl Toma~ Pisanski, and Damijana Ker~,i~ Reviewed by Philip Swann Reviewed by Scott Meredith 339 353 357 Reviewed by Jean-Pierre Corriveau 360 Reviewed by Evan L. Antworth 365 Reviewed by Paul Luff 368 Reviewed by Julia Johnson 374 Reviewed by Giorgio Satta Reviewed by Janyce Wiebe 377 382 388 Published Quarterly by the MIT Press for the Association for Computational Linguistics"]},{"title":"Computational Linguistics Editor Managing Editor Associate Editor Book Review Editor The FINITE STRING Editor Squibs and Discussions co-editors Editorial Board Members 1990-92: 1991-93: 1992-94:","paragraphs":["ISSN 0891-2017 James E Allen University of Rochester Computer Science Department Rochester, NY 14627, USA (+1 716) 275-5288 acl@cs.rochester.edu Donald E. Walker Bellcore, MRE 2A379 445 South Street, Box 1910 Morristown, NJ 07960-1910, USA (+1 201) 829-4312 walker@flash.bellcore.com Robert C. Berwick Massachusetts Institute of Technology Artificial Intelligence Laboratory Cambridge, MA 02139, USA (+1 617) 253-8918 berwick@ai.mit.edu Graeme Hirst University of Toronto Computer Science Department Toronto, CANADA M5S 1A4 (+1 416) 978-8747 gh@ai.toronto.edu Ralph M. Weischedel BBN Systems & Technologies 10 Moulton Street Cambridge, MA 02138, USA (+1 617) 873-3496 weischedel@bbn.com James Pustejovsky Brandeis University Computer Science, Ford Hall Waltham, MA 02254, USA (+1 617) 736-2709 jamesp@cs.brandeis.edu Robert J. P. Ingria BBN Systems & Technologies 10 Moulton Street Cambridge, MA 02138, USA (+1 617) 873-3582 ingria@bbn.com Kenneth Church, AT&T Bell Laboratories Julia Hirschberg, AT&T Bell Laboratories Robert Moore, SRI International James Pustejovsky, Brandeis University Stuart Shieber, Harvard University Susan Warwick, University of Geneva Eduard Hovy, USC/Information Sciences Institute Paul Jacobs, General Electric Robert Kasper, Ohio State University Diane Litman, Columbia University Graeme Ritchie, University of Edinburgh Richard Sproat, AT&T Bell Laboratories Oliviero Stock, Inst. for Scientific","& Technological Research Jared Bernstein, SRI International Edward J. Briscoe, University of Cambridge Peter E Brown, IBM/TJ Watson Research Center Sandra Carberry, University of Delaware Robert Dale, University of Edinburgh Mary Dalrymple, Xerox-Palo Alto Research Center Pierre Isabelle, CWARC Communications Yuji Matsumoto, Kyoto University John Nerbonne, German Research Center for AI K. Vijay-Shanker, University of Delaware"]},{"title":"September 1992 Volume 18, Number 3 Computational Linguistics Special Issue on Inheritance: II Articles","paragraphs":["Making DATR Work for Speech: Lexicon Compilation in SUNDIAL Inheritance and Complementation: A Case Study of Easy Adjectives and Related Nouns A Practical Approach to Multiple Default Inheritance for Unification-Based Lexicons"]},{"title":"Technical Correspondence Automatic Clustering of Languages Book Reviews","paragraphs":["Towards a Theory of Cognition and Computing J. Gerard Wolff Papers in Laboratory Phonology I: Between the Grammar and Physics of Speech John Kingston and Mary E. Beckman, eds. S6mantique et Recherches Cognitives Francois Rastier Computational Morphology: Practical Mechanisms for the English Lexicon Graeme D. Ritchie, Graham J. Russell, Alan W. Black, and Stephen G. Pulman Intelligent User Interfaces Joseph W. Sullivan and Sherman W. Tyler, eds. Adaptive Parsing: Self-Extending Natural Language Interfaces Jill Fain Lehman Generalized LR Parsing Masaru Tomita, ed. Literature and Cognition Jerry R. Hobbs Francois Andry, Norman M. Fraser, Scott McGlashan, Simon Thornton, and Nick J. Youd Dan Flickinger and John Nerbonne Graham Russell, Afzal Ballim, John Carroll, and Susan Warwick-Armstrong Vladimir Batagelj, Toma~ Pisanski, and Damijana Ker~i~ Reviewed by Philip Swann Reviewed by Scott Meredith Reviewed by Jean-Pierre Corriveau Reviewed by Evan L. Antworth Reviewed by Paul Luff Reviewed by Julia Johnson Reviewed by Giorgio Satta Reviewed by Janyce Wiebe 245 269 311 339 353 357 360 365 368 374 377 382 Briefly Noted 388 Copyright (~1992 by the Association for Computational Linguistics. The following code, 0891-2017/92, indicates the copyright owners' consent that a single copy of an article may be made for personal use. The consent is given, however, on the condition that the copier pay the stated per-copy fee of $3.00 through the Copyright Clearance Center, Inc., 27 Congress Street, Salem, MA 01970, USA, for copying beyond that permitted by Sections 107 and 108 of the U.S. Copyright Law. This consent does not extend to other kinds of copying, such as copying for general distribution, for advertising or promotional purposes, for creating new collective works, or for resale. Such permission requests and other permission inquiries should be addressed to the Managing Editor at the address given on the inside front cover of this issue. Computational Linguistics is abstracted and/or indexed in the following publications: Annual Review of Information Science and Technology, Computer Abstracts, Computing Reviews, Current Contents: Social and Behavioral Sciences, Knowledge Engineering Review, Language and Language Behavior Abstracts, Linguistic Abstracts, Linguistic Bibliography, Science Abstracts (INSPEC Section C), and Social Sciences Citation Index. Volume 14 and subsequent volumes of Computational Linguistics are available on microfilm through University Microfilms International, 300 North Zeeb Road, Ann Arbor, MI 48106, USA. Individual Subscriptions to"]},{"title":"Computational","paragraphs":["Linguistics are available only with membership in the Association for Computational Linguistics (ACL). Annual Membership Dues are as follows: regular, $25.00; student -- taking a full-time program of courses and not earning a regular income, $15.00; joint -- for couples receiving one subscription, $30.00. A membership application together with an order form for back issues and conference proceedings is included at the end of this issue. Send membership applications and address changes to Dr. Donald E. Walker (ACL), Bellcore, MRE 2A379, 445 South Street, Box 1910, Morristown, NJ 07960-1910, USA. However, note that it is also possible to pay through banks in Switzerland and Japan. Institutional Subscriptions are $75.00. Outside the U.S. add $14.00 postage and handling. Canadian subscribers also add 7% GST. Send institutional subscription orders and address changes to MIT Press Journals, 55 Hayward Street, Cambridge, MA 02142-1399, USA. To be honored free of charge, claims for missing copies must be made immediately upon receipt of the next published issue. Institutions should order back issues (before 1988) and all proceedings from the ACL at the address above."]},{"title":"Editors' Note","paragraphs":["Inheritance mechanisms and their implications for description, theory, and processing have become an increasingly important research topic in computational linguistics. In two special issues of"]},{"title":"Computational Linguistics,","paragraphs":["a sample of current research in this area will be presented. Volume 18, Number 2 In \"Inheritance in Natural Language Processing,\" Daelemans, De Smedt, and Gazdar outline some of the motivations that have led to the widespread use of inheritance mechanisms in computational linguistics and provide a survey of the recent literature.","Bouma, in \"Feature Structures and Nonmonotonicity,\" introduces default unification as a means of reconciling inheritance with unification grammars. A formalism based on monotonic multiple inheritance in networks of typed feature structures is proposed in Zajac's paper \"Inheritance and Constraint-Based Grammar Formalisms.\"","Some linguistic frameworks have explicitly incorporated inheritance into their the-ories. One of these is described \"Inheritance in Word Grammar\" by Fraser and Hudson.","While most work has used inheritance networks as a means to store static information, a number of researchers have also begun to explore their utility in language processing. An example of this is provided by van der Linden in \"Incremental Processing and the Hierarchical Lexicon.\" Volume 18, Number 3 The main area of application of inheritance networks has been the structure and or-ganization of computational lexicons. In the second of the two special issues, three alternative approaches to inheritance in lexical representation are presented.","Andry, Fraser, McGlashan, Thornton, and Youd employ a DATR lexicon in the context of a Unification Categorical Grammar in \"Making DATR Work for Speech: Lexicon Compilation in SUNDIAL.\"","In \"Inheritance and Complementation: A Case Study of Easy Adjectives and Related Nouns,\" Flickinger and Nerbonne apply a default inheritance framework to the lexical representation of complementation phenomena.","Finally, Russell, Ballim, Carroll, and Warwick-Armstrong introduce a language for defining multiple default inheritance networks for the lexicon, inspired by objectoriented programming, in \"A Practical Approach to Multiple Default Inheritance for Unification-Based Lexicons.\" Walter Daelemans Gerald Gazdar, Guest Editors (~) 1992 Association for Computational Linguistics"]}]}