{"sections":[{"title":"利理漏  劉麟  ","paragraphs":["{g9124, chaolin}@cs.nccu.edu.tw"]},{"title":"","paragraphs":["zmgao@ntu.edu.tw  d省力d 路ef來路d利 料來不漏dfd dfd 利 selectional preference dd collocation f 1.6 d 1 f"]},{"title":"Key Words ","paragraphs":["論eeee理ecollocationse selectional preferences"]},{"title":"1 論 ","paragraphs":["computer-assisted item generationdCAIGitem pools d年來 [2][6]f利力d 量d力來d了 [11]fd路料量d路 句d率 量f 論d 利 理natural language processingd路率漏cloze itemf","理行漏fd 句template-base立句 [3]d諸來立句 [2]f 不 料d LDC <http://www.ldc.upenn.edu/> OTA <http://ota.ahds.ac.uk/>d行立料d句f了 句易dd句理 來 [16]fd利路量d濾d 句漏f便 f","力 理 來 句d 便 multiple-choice漏f了見d漏 漏fJohns [7] Steven [17] concordance collocation 念 料fConiam [1] 料word frequency類 f 2003 年d路來力d利 路料漏來 [4][18]f","d數理f例d dfd keyword matching concordancerd連串句 d量fd漏不 句f 1 了漏例d句stemd keyddistractorf  1 漏例","句d來f易度item facility度item discriminationd [12]fd 更略d若 [1][4]d不f了 類d了word sense disambiguationd料 句d利 collocation selectional preference [10] 來f 立令d度 f","2 漏流d3 料d f 4 句d 5 collocation selectional preference 略f 6 f"]},{"title":"2  ","paragraphs":["2","2 漏f漏兩d兩 f句target sentence retriever d料tagged corpus漏句f item specificationddf 3 f 量f target-dependent item requirementsd f例dCollege Entrance Examinationsd漏 數 7 28 [18]d來立f d不d數量 f  3","句target sentenceddistractor generator ecollocation selectional preference 參來f 3 d句 漏f  料","  句 句 漏"]},{"title":"3 料來 ","paragraphs":["料 d 利 路 web crawler Taiwan Journal <http://taiwanjournal.nat.gov.tw>eTaiwan Review <http://publish.gio.gov.tw/FCR/fcr.html> China Post <http://www.chinapost.com.tw> f更度 d率見f料d 163,719 句d了 3,077,474 word token 31,732 word typef","HTML f了ee 來d落句切 句d來f Reynar MXTERMINATOR 句f MXTERMINATOR Brown Wall Street Journal 料 97.5%句率 [15]f句d利來f","料漏率f 利 Ratnaparkhi MXPOST 料dMXPOST Pen Treebank [13]fd lemmaf例d若 classified VBNd classifyi若 JJd classifiedfd Lin MINIPAR [8] 句f MINIPAR arrive at in order to 不f不d f","d MINIPAR 了partial parsed 漏f句若 MINIPAR d 利行f便d w d句 w d w signal wordsignalf","歷漏都ee [18]d 漏d句行 fdeid i例d Jimmy builds a grand building 句d build grand 都 building id f","若d諸讀f e例句行d WordNet <http://www.cogsci.princeton.edu/wn/> iee類class selectional preference collocation 度d HowNet <http://www.keenage.com\\verb> f"]},{"title":"4 句 ","paragraphs":["2 d句料句f句candidate target sentence句f利 MXPOST d 易f了句ditem generator f行 selectional preference 念f"]},{"title":"4.1 Selectional Preference","paragraphs":["利 selectional preference 行dd句 d句類fSelectional preference 切 例說d chair 垷句 Susan interrupted the chair d [10][14]f句polysemous word來 句f","HowNet dd漏 eef selectional preference 度d 類d令 w π 類 HowNet d ),( πν wf w π 參 ν 率d π w 類d )(wfv w 參 ν 率d不 類f w π selectional preference 度 (1) j )(),(),( wfwfwA ννν ππ = (1)","料 w 參 ν d不論 w d )(wfv 累 1 f令 s w ν d },,,{)( 21 ys πππ K=Π s 類d 料 w s 參 ν )(sΠ∈π d ),( πν wf 數 y/1 f 1 3 eatetell find HUMANeFOOD 兩類料f 1 d eat d類 FOODd tell f","1 Selectional preference 料  ν =","eat tell find HUMAN 0.047 0.487 0.108 類 FOOD 0.441 0.005 0.057"]},{"title":"4.2 ","paragraphs":["4.1 selectional preference WordNet d句 f了d句行f若 WordNet dfd若 d句 They say film makers don't spend enough time developing a good story 例說f句 spend d WordNet d spend 兩j 1. (99) spend, pass – (pass (time) in a specific way; “How are you spending your summer vacation?”) 2. (36) spend, expend, drop – (pay out; “I spend all my money in two days.”)","pass (time) in a specific wayd pay outfWordNet () head wordsd數di() 例句df論d d不fd spend 1 j passd 2 jextend dropf","句 spend 行d spend 句 fd句理f d若料句d不f 領數d tΩ f","d不例句句dspend context度d 裡d spend 切f句 They say film makers don't spend enough time developing a good story 例d spend 句makerstime 類d spend 例句類f若 spend 例句 spend 句d數df 領例句數d sΩ f","w WordNet n d令 },,,{ 21 nθθθ K=Θ w f w iθ WordNet im f不 w iθ f },,,{ ,2,1, imiiii λλλ K=Λ w iθ f","MINIPAR 句 T d f w 句 T μ(T)f令 },,,{),( ),(,2,1 TTTTwT μψψψ K=Ψ T w fd Tk,ν T w Tk,ψ d },,,{),( ),(,2,1 TTTTwT μννν K=Γ w Tk,ψ f","w i iθ d j ji,λ 數d利 (1) ji,λ T Tk,ψ selectional preference 度df ∑ = )( 1 ,, ),( )(1 , T k TkjiTkA T μ ν ψλ μ  iθ 數d iθ 數f ∑∑=Ω == )( 1 ,, 1 ),(",")(11 ),|( ,T k Tkji m jiit Tki A Tm Tw μ ν ψλ μθ (2)","(2) 句 T w iθ 數f selectional preference 度 ),( ,,, TkjiTkA ψλν 數 tΩ 兩數落 0 1 f","WordNet 例句d例句句 度句f利句f令 T S w 句 w iθ 例句f列 3 d iθ 例句 數 sΩ f 例句d (3) iθ 例句數d數 f T(θi | w,T)","1. w T S ),( wTΨ ),( wSΨ d w ),( wTΓ ),( wSΓ f },,,{),( ),(,2,1 TTTTwT μψψψ K=Ψ },,,{),( ),(,2,1 SSSSwS μψψψ K=Ψ },,,{),( ),(,2,1 TTTTwT μννν K=Γ },,,{),( ),(,2,1 SSSSwS μννν K=Γ","2. T w Tj,ψ S w Sk,ψ SkTj ,, νν = d Tj,ψ HowNet Tjn , 類d },...,,{)( ,,,2,,1,,, TjnTjTjTjTj πππψ =Π d Sk,ψ HowNet Skn , 類d },...,,{)( ,,,2,,1,,, SknSkSkSkSk πππψ =Π f )( ,TjψΠ 類 lTj ,,π d )( ,SkψΠ 類 msk ,,π mSklTj ,,,, ππ = f類d累 數 ),( TM iθ Tjn ,/1 f",";0),( =TM iθ unmatched; as ),( allmark , wTTj Γ∈ν ));(;0(for ++<= jTjj μ","));(;0(for ++<= kSkk μ","))( and unmatched) (( if ,,, SkTjTj ννν =","{","matched; as mark ,Tjν",");;0(for , ++<= lnll Tj",");;0(for , ++<= mnmm Sk","TjiimSklTj nTMTM ,,,,, 1),(),( )( if +== θθππ }","3. (3) 度量句例句d d數f )( ),( ),|(","T TM Tw i is","μθ θ =Ω (3) 句 T w iθ 數d (2) ),|( Twit θΩ 數 (3) ),|( Twis θΩ 例句數d若 數 (4) thresholdd句 T w 數fd若 ),|( Twit θΩ ),|( Twis θΩ d度不d 不率d句d f 6.1 論不率f","),|(),|(maxarg TwTw isit ii θθ θ Ω+Ω Θ∈ (4)"]},{"title":"5 ","paragraphs":["漏了f若不 d不fd諸 漏洞df 易參fd fd識 d不句ff 易f略d fdculture-dependent略d d力 f","了d [12][18]f ρ d ρ n d n m f n d ]10/,10/[ nmnm +− f f度fitnessd f度類類 collocation d 類 HowNet f","3 d料f句若 d句df 句dd","句f 令 },,,{ 21 qtttT K= 不f T 列兩濾 j() eed () 兩 句clausef令"]},{"title":"TT ⊂'","paragraphs":["句 T d }',,','{' '21 qtttT K= d κ pointwise mutual informationdf },,,{ 21 א= SSSC K 料 句d )(κΠ )'( itΠ κ 'it 類d ))(Pr( κΠ 料 ηS w )(wΠ )(κΠ 不例i理 ))'(Pr( itΠ 料 ηS )(χΠ )'( itΠ 不例f })()( and contains |1{","1 ))(Pr("]},{"title":"∑","paragraphs":["≠Π∩Π א =Π η φκκ η S wwS })'()( and contains |1{","1 ))'(Pr("]},{"title":"∑","paragraphs":["≠Π∩Π א =Π η φχχη S ii tSt","d ))'(),(Pr( itΠΠ κ 料 ηS w )(wΠ )(κΠ e )(χΠ )'( itΠ 不例f })'()( and )()( and where , contains |1{ 1","))'(),(Pr( φχφκχχκ","η η ≠Π∩Π≠Π∩Π≠ א=ΠΠ"]},{"title":"∑","paragraphs":["S ii twwwSt 度 (5)f"]},{"title":"∑","paragraphs":["∈ ΠΠ ΠΠ− = Tt i i i tt q f ' ))'(Pr())(Pr( ))'(),(Pr( log '1 )( κ","κ κ (5)","若 )(κf 0.3df了 collocation 數d f 0.3 (5) 220 練料d 練料 1992 年 2003 漏f"]},{"title":"6 6.1 ","paragraphs":["理 索論 [10]f不異 異d率落 40% 90% [14][19]f 不劣d若不 SENSEVAL dd 論f 2 率 = 0.4 = 0.7 38.0%(19/50) 57.1%(16/28) 68.4%(13/19) 34.0%(17/50) 63.3%(19/30) 71.4%(15/21) 26.7%(8/30) 55.6%(10/18) 60.0%(6/10) 36.7%(11/30) 52.4%(11/21) 58.3%(7/12)","料料 160 句d句f 了 50 e50 e30 30 d 160 WordNet d 數量 2 verification frightened 19 have d 4.85 f 160 行d 率d率 2f","baseline欄率d見d 見 WordNet f兩欄(4)d不 0.4 0.7率f 4.2 dd留 度不d了 率f不令d率d了率rejection ratef 料不更句d率d率 f","WordNet 都例句d例句d 不例句數d sΩ 0 f WordNet 例句 dj不例句f ddf 例句d不f若d WordNetd見例句f"]},{"title":"6.2 漏 ","paragraphs":["4 3 fd 數f  4 3","item generator 200 f了 deed不數f參 [18]d 1992 年 2003 年漏d不 4 d例j 35%e 30%e 20% 14%fd例 77 e62 e35 26 句f","裡ddf (4) 0.7df 3dd 2 不f率d 3 率f 不論d 2 d 1 f","d [18] 例d 200 漏 d 4 1 f 料來句dd 來率f 4 d數d f","d量d f 3 句率 類 數量 句率 77 66.2% 62 69.4% 35 60.0% 26 61.5% 漏 65.5% 4 率 類 數量 率 64 90.6% 57 94.7% 46 93.5% 33 84.8% 漏 91.5%"]},{"title":"6.3 更 ","paragraphs":["d 路 [4]fd 兩j fd 4 dd deed fdfd 路行d立f 錄student modelingd利料易度 度f","了不漏d了idiomphrase f 5 了f更d 力 [5]f 見來de說e讀ed 力 [9]f  5 例"]},{"title":"7 論 ","paragraphs":["論d了理d漏d 益f流d 漏f不易d理 了數年f句d不 dfd理d 來落d句d句 不d度 [10]f","略來漏f利 collocation 料ddd 90%d f","量漏d數 d不立f 1.6 d 1 fd來 率dd不來更f","f句d 句did易度 d度iddd d率f  不d不 料d不來參論f 91-2411-H-002-080 92-2213-E-004-004 df"]},{"title":"參","paragraphs":["[1] D. Coniam, A preliminary inquiry into using corpus word frequency data in the automatic generation of English language cloze tests, Computer Assisted Language Instruction Consortium, 16 (2–4), 1997, 15–33.","[2] P. Deane, K. Sheehan, Automatic item generation via frame semantics, Education Testing Service: http://www.ets.org/research/dload/ncme03-deane.pdf (2003).","[3] I. Dennis, S. Handley, P. Bradon, J. Evans, S. Nestead, Approaches to modeling item generative tests, in: Item Generation for Test Development [2] 53–72, 2002, 53–72.","[4] Z.-M. Gao, C.-L. Liu, A Web-based assessment and profiling system for college English, Proc. of the 11th Int’l Conf. on Computer Assisted Instruction, 2004, CD–ROM.","[5] S.-M. Huang, C.-L. Liu, Z.-M. Gao, Toward computer assisted learning for English dictation, Proc. of the 2003 Joint Conf. on Artificial Intelligence, Fuzzy Systems, and Grey Systems, 2003, CD–ROM.","[6] S. H. Irvine, P. C. Kyllonen (Eds.), Item generation for test development (Lawrence Erlbaum Associates, 2002).","[7] T. Johns, http://web.bham.ac.uk/johnstf/timcall.htm.","[8] D. Lin, Dependency-based evaluation of MINIPAR, Proc. of the Workshop on the Evaluation of Parsing Systems in the 1st Int’l Conf. on Language Resources and Evaluation, 1998,.","[9] C.-L. Liu, Using mutual information for adaptive student assessments, Proc. of the 4th","IEEE Int’l Conf. on Advanced Learning Technologies, 2004, to appear.","[10] C. D. Manning, H. Schütze, Foundations of statistical natural language processing (MIT Press, 1999).","[11] A. Oranje, Automatic item generation applied to the national assessment of educational progress: Exploring a multilevel structural equation model for categorized variables, Education Testing Service: http://www.ets.org/research/dload/ncme03-andreas.pdf (2003).","[12] C. J. Poel, S. D. Weatherly, A cloze look at placement testing, Shiken: JALT (Japanese Assoc. for Language Teaching) Testing & Evaluation SIG Newsletter, 1 (1), 1997, 4–10.","[13] A. Ratnaparkhi, A maximum entropy part-ofspeech tagger, Proc. of the Conf. on Empirical Methods in NLP, 1996, 133–142.","[14] P. Resnik, Selectional preference and sense disambiguation, Proc. of the Applied NLP Workshop on Tagging Text with Lexical Semantics: Why, What and How, 1997, 52–57.","[15] J. C. Reynar, A. Ratnaparkhi, A maximum entropy approach to identifying sentence boundaries, Proc. of the Conf. on Applied NLP, 1997, 16–19.","[16] K. M. Sheehan, P. Deane, I. Kostin, A partially automated system for generating passage-based multiple-choice verbal reasoning items, paper presented at the Nat’l Council on Measurement in Education Annual Meeting (2003).","[17] V. Steven, Classroom concordancing: vocabulary materials derived from relevant authentic text, English for Specific Purposes, 10 (1), 1991, 35–46.","[18] C.-H. Wang, C.-L. Liu, Z.-M. Gao, Toward computer assisted item generation for English vocabulary tests, Proc. of the 2003 Joint Conf. on Artificial Intelligence, Fuzzy Systems, and Grey Systems, 2003, CD–ROM.","[19] Y. Wilks, M. Stevenson, Combining independent knowledge sources for word sense disambiguation, Proc. of the Conf. on Recent Advances in NLP, 1997, 1–7."]}]}