{"sections":[{"title":"A System to Solve Language Tests for Second Grade Students Manami Saito Nagaoka University of Technology saito@nlp.nagaokaut.ac.jp Kazuhide Yamamoto Nagaoka University of Technology yamamoto@fw.ipsj.or.jp Satoshi Sekine New York University Language Craft sekine@cs.nyu.edu Hitoshi Isahara National Institute of Information and Communications Technology isahara@nict.go.jp   Abstract","paragraphs":["This paper describes a system which solves language tests for second grade students (7 years old). In Japan, there are materials for students to measure understanding of what they studied, just like SAT for high school students in US. We use textbooks for the students as the target material of this study. Questions in the materials are classified into four types: questions about Chinese character (Kanji), about word knowledge, reading comprehension, and composition. This program doesn’t resolve the composition and some other questions which are not easy to be implemented in text forms. We built a subsystem for each finer type of questions. As a result, we achieved 55% - 83% accuracy in answering questions in unseen materials."]},{"title":"1 Introduction","paragraphs":["This paper describes a system which solves language tests for second grade students (7 years old). We have the following two objections.","First, we aim to realize the NLP technologies into the form which can be easily observed by ordinary people. It is difficult to evaluate NLP technology clearly by ordinary people. Thus, we set the target to answer second grade Japanese language test, as an example of intelligible application to ordinary people. The ability of this program will be shown by scores which are familiar to ordinary people.","Second aim is to observe the problems of the NLP technologies by degrading the level of target materials. Those of the current NLP research are usually difficult, such as newspapers or technological texts. They require high accuracy language processing, complex world knowledge or semantic processing. The NLP problems would become more apparent when we degrade the target materials. Although questions for second grade students also require world knowledge, it is expected that the questions become simpler and are resolved without tangled techniques."]},{"title":"2 Related Works","paragraphs":["Hirschman et al. (1999) and Charniak et al. (2000) proposed systems to solve “Reading Comprehension.” Hirschman et al. (1999) developed “Deep Read,” which is a system to select sentences in the text which include answers to a question. In their experiments, the types of questions are limited to “When,” “Who” and so on. The system is basically an information retrieval system which selects a sentence, instead of a document, based on the bag-of-words method. That system retrieves the sentence containing the answer at 30-40% of the time on the tests of third to sixth grade materials. In short, Deep Read is very restricted compared to our system. Charniak et al. (2000) built a system improved over the Deep Read by giving more weights for verb and subject, and introduced heuristic rules for “Why” question. Though, the essential target and method are the same as that of Deep Read."]},{"title":"43 3 Question Classification","paragraphs":["First, we bought five language test books for second grade students and one of them, published by KUMON, was used as a training text to develop our system. The other four books are referred occasionally. Second, we classified the questions in the training text into four types: questions about Chinese character (Kanji), questions on word knowledge, reading comprehension, and composition. We will call these types as major types. Each of the “major types” is classified into several “minor types.” Table 1 shows four major types and their minor types. In practice, each minor type farther has different style of questions; such as description question, choice question, and true-false question. The questions can be classified into approximately 100 categories. We observed that some questions in other books are mostly similar; however there are several questions which are not covered by the categories.  Major type Minor type Kanji Reading, Writing, Radical, The","order of writing, Classification Word knowledge Katakana, How to use Kana, Appropriate Noun, To fill blanks for Verb, Adjective, and Adjunct, Synonym, Antonym, Particle, Conjunction, Onomatopoeia, Polite Expression, Punctuation mark Reading comprehension Who, What, When, Where, How, Why question, Extract specific phrases, Progress order of a story, Prose and Verse","Composition Constructing sentence, How to write composition","Table 1. Question types"]},{"title":"4 Answering questions and evaluation result","paragraphs":["In this section, we describe the programs to solve the questions for each of the 100 categories and these evaluation results. First we classified questions. Some questions are difficult to cover by the system such as the stroke order of writing Kanji. For about 90% of all the question types other than such questions, we created programs for basically one or two categories of questions. There are 47 programs for the categories found in the training data.","In each section of 4.1 to 4.3, we describe how to solve questions of typical types and the evaluation results. The evaluation results of the total system will be reported in the following section.","Table 2 to 4 show the distributions of minor types in each major type, “Kanji,” “Word knowledge,” and “Reading comprehension,” in the training data and the evaluation results. Training and evaluation data have no overlap."]},{"title":"4.1 Kanji questions","paragraphs":["Most of the Kanji questions are categorized into “reading” and “writing.” Morphological analysis is used in the questions of both reading and writing Kanji; we found that large corpus is effective to choose the answer from Kanji candidates given from dictionary. Table 2 shows it in detail. This system cannot answer to the questions which are asking the order of writing Kanji, because it is difficult to put it into digital format.","The system made 7 errors out of 334 questions. The most of the questions are the errors in reading Kanji by morphological analysis.","In particular, morphological analysis is the only effective method to answer questions on this type. It would be very helpful, if we had a large corpus considering reading information, but there is no such corpus."," Training data Test data Ques-","tion type The rate of Q in training data[%] The used knowledge and tools Correct","ans.","(total) Correct ans. (known type Q., total)","Reading 27 Kanji dictionary, Morphological analysis"," 96(100)"," 6(8,8)","Writing 61 Word dictionary, Large corpus"," 220(222)"," 63(66,66) Order of writing","6 - 0(20)"," 0(0,2) Combination of Kanji parts","3 - 0(10)"," 0(0,0) Classify Kanji","3 Word dictionary, Thesaurus"," 11(12)","","0(0,0)","Total 100 - 327(364) 69(74,76)","Table 2. Question types for Kanji"]},{"title":"4.2 Word knowledge questions","paragraphs":["The word knowledge question dealt with vocabulary, different kinds of words and the structure of sentence. These don’t include Kanji questions and reading comprehension. Table 3 shows different types of questions in this type."]},{"title":"44","paragraphs":["For the questions on antonym, the system can answer correctly by choosing most relevant answer candidate using the large corpus out of multiple candidates found in the antonym dictionary.","The questions about synonyms ask relations of priority/inferiority between words and choosing the word in a different group. These questions can usually be answered using thesaurus.","Ex.1 shows a question about particle, Japanese postposition, which asks to select the most appropriate particle for the sentence.","The system produces all possible sentences with the particle choices, and finds most likely sentences in a corpus. In Ex.1, all combinations are not in a corpus, therefore shorter parts of the sentence are used to find in the corpus (e.g. “ (1) ”, “ (2) ”). In this case, the most frequent particle for (1) is “” in a corpus, so this system outputs incorrect answer. Ex.1 [//]()  Select particle which fits the sentence from {wo,to,ni} [1] (1) (2)","apple-(1) orange-(2) buy","(1) correct= (to) system= (wo)","(2) correct= (wo) system= (wo) ","The questions of Katakana can be answered mostly by the dictionary. The accuracy of this type is not so high, found in Table 2, because there are questions asking the origin of the words, most Katakana words in Japanese has a few origins: borrowed words, onomatopoeia, and others. Because we don’t have such knowledge, we could not answer those questions.","The questions of onomatopoeia include those shown in Ex.2. The system uses co-occurrence of words in the given sentence and each answer candidate to choose the correct answer in Ex.2, “ .” However, it was not chosen because the co-occurrence frequency of “ ,” the word in the sentence, and “,” incorrect answer, is higher.","Ex.2 [ ] ○","Choose the most appropriate onomatopoeia (1) (A large object is rowing slowly)","[]","The questions of word knowledge are classified into 29 types. We made a subsystem for each type. As there are possibly more types in other books, making a subsystem for each type is very costly. One of the future directions of this study is to solve this problem.","Training","data Test data Question type The rate of Q in training data[%] The used knowledge and tools Correct","ans.","(total) Correct ans. (known type Q., total)","Anonym 18 Antonym dictionary, Large corpus 26(27) 12(15,21) Synonym 11 Thesaurus 14(17) 34(44,83) Particle 19 Large corpus 25(28) 16(17,17) Katakana 25 Word diction-","ary, Morpho-","logical analysis 18(37) 19(22,52) Onomatopoeia","19 Large corpus, Morphological analysis 18(29) 16(20,31) Structure of sentence","5 Morphological analysis 7(7) 20(22,22) How to use kana 2 - 0(3) 0(0,19) Dictation of verb 2 - 0(3) 0(0,0) Total 100 - 108(151) 117(140,245) Table 3. Question types for Word knowledge"]},{"title":"4.3 Reading comprehension questions","paragraphs":["The reading comprehension questions need to read a story and answer questions on the story. We will describe five typical techniques that are used at different types of questions, shown in Table 4.","Pattern matching (a) is used in questions to fill blanks in an expression which describes a part of the story. In general, the sequence of word used in the matching is the entire expression, but if no match was found, smaller por-tions are used in the matching. Ex.3 Fill blanks in the expression","Storypartial  ","(In a few days, the flower withers and gradually changes its color to black.)","Expression (1)(2)","(The flower (1) and change its color to (2).)","Answer(1) (withers) (2) (black)","The effectiveness of this technique is found in this example. The other methods will be needed when questions will be more difficult. At the time, this technique is very useful to solve many questions in reading comprehension."]},{"title":"45","paragraphs":["When the question is “Why” question, keywords such as “ (thus)” and “ (because)” are used.","For example, when questions start with “When ( )” and “Where ( ),” we can restrict the type of answer word to time or location, respectively. If the question includes the expression of “ ” (“” is a particle to indicate direction/specification), the answer is also likely to be expressed with “ni” right after the location in the story. (The kind of NE (Named Entity) and particle right after word (b))","For the questions asking the time or location about the entire story, this system outputs the appropriate type of the word which appeared first in the story. Although there are mistakes due to morphological analysis and NE extraction, this technique is also consistently very useful.","The technique which is partial matching with keywords (c) is used to seek an answer from story for “how,” “why” or “of what” questions. Keywords from the question are used to locate the answer in the story.","Ex.4 ","Frequency in the large corpus is used to find the appropriate sentence conjunction. (d) Answer is chosen by comparing the mutual information of the candidate conjunctions and the last basic block of the previous sentence. How-ever, this technique turns out to be not effective. Discourse analysis considering wider context is required to solve this question.","The technique which uses distance between keywords in question and answers (e) is supplementary to the abovementioned methods. If multiple answers are found, the answer candidate that is the closest in the story text to the keywords in questions is generated. These keywords are content words and unknown words in the text. This technique is found very effective.","In Table 4, the column “Used method” shows the techniques used to solve the type of questions, in the order of priority. “f” in the table denotes means that we use a method which was not mentioned above.","(How big are chicks when they hatched?) Textpartial"," (The size of chicks when they hatched is about the size of your thumb.)   ","Answer (size of thumb)   5IFSBUFPG 5SBJOJOHEBUB 5FTUEBUB RVFTUJPOTJO 6TFE DPSSFOUXOT DPSSFOUBOT USBJOJOHEBUB<> NFUIPET UPUBM LOPXOUZQF2UPUBM","8IPTBJE CBG","5IFPUIFST CFG","-JLFXIBU DCF","0GXIBU DGF","8IBUEPJOH DBG","8IBUJT BF","8IBUEP\"TBZ CBGF","8IPMFTUPSZ C","1BSUPGTUPSZ","8IPMFTUPSZ C","1BSUPGTUPSZ CGD","DG","D","CDG","B","","E","G","G",""," 8IZ )PX",")PXMPOHIPXPGUFOIPXMBSHF 5PUBM 1BSBHSBQI 5IFPUIFST","5PGJMMCMBOLT","/PUIBWFJOUFSSPHBUJWFQSPOPVO","$POKVODUJPO","1SPHSFTTPSEFSPGBTUPSZ 8IFSF 8IFO 8IP 2VFTUJPOUZQF 8IBU     Table 4. Question types for Reading comprehension"]},{"title":"46 5 Evaluation","paragraphs":["We collected questions for the test from different books of the training data. The proposition of the number of questions for different sections is not the same as that of the training data. Table 2 to 4 show the evaluation results in the test data for each type. Table 5 shows the summary of the evaluation result. In the test, we use only the questions of the type in training data. The tables also show the total number of questions, the number of questions which are solved correctly, and the number of questions which are not one of the types the system targeted (not a type in the training data).","The ratio of the questions covered by the system, questions in test data which have the same type in the training data are 97.4% in Kanji, 57.1% in word knowledge, and 64.7% in reading comprehension. It indicates that about a half of the questions in word knowledge isn’t covered. As the result, accuracy on the questions of the covered types in word knowledge is 83.6%, but it drops to 47.8% for the entire questions. It is because our system classified the questions into many small types and builds a subsystem for each type.","The accuracy for the questions of covered type is 83.4%. In particular, for the questions of Kanji and word knowledge, the scores in the test data are nearly the same as those in the training data. It presents that the accuracy of the system is provided that the question is in the covered type. However, the score of reading comprehension is lower in the test data. We believe that this is mainly due to the small test data of reading comprehension (only 34) and that the accuracy for “Who” questions and the questions to fill blanks in the test data are quite difficult compared to the training data.","/VN /VN /VN 3$\"","3$\"","3$\"","PG PG PG LOPXO UPUBM JOUPUBM","BMM2 LOPXO DPSSFOU UZQF2 <> PGLOPXO","UZQF2 BOT <> UZQF2<>",",BOKJ 8PSELOPXMFEHF","3FBEJOH $PNQSFIFOTJPO","5PUBM   Table 5. Evaluations at test data  * Rate of Correct Answer"]},{"title":"6 Discussions","paragraphs":["We will discuss the problems and future directions found by the experiments."]},{"title":"6.1 Recognition and Classification of Questions","paragraphs":["In order to solve a question in language test, students have to recognize the type of the question. The current system skips this process. In this system, we set up about 100 types of questions referring the training data and a subprogram solves questions corresponding to each type. There are two problems to be solved. First, we have to design the appropriate classification and avoid unknown types in the test data. From the experiment, we found that the current types are not enough to solve this problem. Second, the program has to classify the questions automatically. We are building this system and are forecasting it quite optimistically once a good format is provided."]},{"title":"6.2 Effectiveness of Large Corpus","paragraphs":["The large corpus of newspapers and the Web are used effectively in many different cases. We will describe several examples.","In Japanese, there are different Kanji for the same reading. For example, Kanji for “(au: to see, to solve correctly) are “(to see)” or “(to solve correctly)” for “(to see people)” and “(to solve an answer correctly),” respectively. This type of questions can be solved by counting the expressions with Kanji in the corpus. It is similar to word sense disambiguation.","In the questions of particle complement, such as “ (umbrella) // (locative-, conjunctive-, and objective particles) (home) // (to left) (Intentional sentence is ‘I left the umbrella at home’)”, it can be solved by counting the expressions with each particle in a corpus. This method is mentioned in Matsui 2004 but the evaluation result was not reported. When the answer is not found for the entire expression, the answer is searched by deleting some contexts. Most questions of filling blank types, similar strategy is helpful to find the correct answer.","In summary, the experiments showed that the large corpus is quite useful in several types of"]},{"title":"47","paragraphs":["questions. We believe it would be quite difficult to achieve the same accuracy by compiled knowledge, such as a dictionary of verbs, antonyms, synonyms, and relation words, and a the-saurus."]},{"title":"6.3 World Knowledge","paragraphs":["The questions sometimes need various types of world knowledge. For example, “A student enters junior high school after graduated from elementary school.” And “People become happy, if he receives something nice from someone.” It is a difficult problem how to describe and how use that knowledge. Another type of world knowledge includes origin of words, such as foreign borrowed word or onomatopoeia. As far as we know, there is no comprehensive knowledge of such in electronic form. It is required to design attributes of world knowledge and to use them flexibly when applying then to solve the questions."]},{"title":"6.4 Difference between Reading Comprehension and Question Answering","paragraphs":["The current QA systems identify the NE type of questions and seek the answer candidate of the type. However, the questions in the reading comprehension don’t limit the answer types to person and organization, even if the question is “Who” type question. For example, “raccoon dog behind our house” or “the moon” can be the answer. Also, the answer is not always a noun phrase, but can be a clause, for example, “the time when new leaves growing on a branch” for questions asking time. There are different kinds of questions, which are asking not the time of specific event but the time or season of the entire story. For example “When is this story about?” In this case, the question can’t be answered by just extracting a noun phrase.","However, at the moment, we can’t conclude if the question can or cannot be answered without really understanding it. Sometime, we can find a correct answer without reading the story down the line or understanding the story perfectly. It is one of the future works."]},{"title":"6.5 Other techniques: discourse and anaphora","paragraphs":["Some techniques other than morphological analysis, frequency of appearance in a corpus, and question answering methods are used in our system. We raise two issues. One of those is the discourse analysis. It is required in the questions to assign the order of paragraphs, and to select appropriate sentence conjunction. The other is anaphora analysis, which is very important, not only to indicate the antecedent, but also to find the link of mentions of entities."]},{"title":"7 Conclusion ","paragraphs":["several interesting NLP problems were found. Hi Comprehension system”. Ch er-based Language Understanding K. of K. atural Language Processing, 2004,  We develop a system to solve questions of second grade language tests. Our objectives are to demonstrate the NLP technologies to ordinary people, and to observe the problems of NLP by degrading the level of target materials. We achieved 55% - 83% accuracy and"]},{"title":"References","paragraphs":["rschman, L., Light, M., Breck, E. and Burger, J. D. “Deep READ: a Reading ACL, 1999, pp 325-332. arniak et al., “Reading Comprehension Programs in a Statistical-language-Processing Class”. Workshop on Reading Comprehension Tests as Evaluation for Comput Systems. 2000. Matsui: “Search Technologies on WWW which utilize search engines”. (In Japanese) Journal Japanese Language, February, 2004, pp 34-43. Yoshihira, Y. Takeda, S. Sekine: “KWIC System on WEB documents”, (In Japanese) 10th Annual Meeting of N pp 137-139.  F (http://languagecraft.jp/dennou/) igure 1. A Snapshot of the system"]},{"title":"48","paragraphs":[]}]}