{"sections":[{"title":"","paragraphs":["Proceedings of the EACL 2009 Workshop on Cognitive Aspects of Computational Language Acquisition, pages 1–9, Athens, Greece, 31 March 2009. c⃝2009 Association for Computational Linguistics"]},{"title":"Towards a formal view of corrective feedback Staffan Larsson and Robin Cooper Department of Philosophy, Linguistics and Theory of Science University of Gothenburg {sl,cooper}@ling.gu.se Abstract","paragraphs":["This paper introduces a formal view of the semantics and pragmatics of corrective feedback in dialogues between adults and children. The goal of this research is to give a formal account of language coordination in dialogue, and semantic coordination in particular. Accounting for semantic coordination requires (1) a semantics, i.e. an architecture allowing for dynamic meanings and meaning updates as results of dialogue moves, and (2) a pragmatics, describing the dialogue moves involved in semantic coordination. We illustrate the general approach by applying it to some examples from the literature on corrective feedback, and provide a fairly detailed discussion of one example using TTR (Type Theory with Records) to for-malize concepts. TTR provides an analysis of linguistic content which is structured in order to allow modification and similarity metrics, and a framework for describing dialogue moves and resulting updates to linguistic resources."]},{"title":"1 Introduction","paragraphs":["Here are a few examples of corrective feedback: A: That’s a nice bear. B: Yes, it’s a nice panda. Abe: I’m trying to tip this over, can you tip it","over? Can you tip it over? Mother: Okay I’ll turn it over for you. Adam: Mommy, where my plate? Mother: You mean your saucer? Naomi: Birdie birdie. Mother: Not a birdie, a seal. Naomi: mittens. Father: gloves.","The first one is made up, the others are quoted from various sources in (Clark and Wong, 2002) and (Clark, 2007). In general, corrective feedback can be regarded as offering an alternative form to the one that the speaker used. We are interested in interactions such as these since we believe that dialogue interaction plays an important role in establishing a shared language, not only in first (or second) language acquisition but also in the coordination of meaning in adult language, in histori-cal language change, and in language evolution.","Two agents do not need to share exactly the same linguistic resources (grammar, lexicon etc.) in order to be able to communicate, and an agent’s linguistic resources can change during the course of a dialogue when she is confronted with a (for her) innovative use. For example, research on alignment shows that agents negotiate domain-specific microlanguages for the purposes of discussing the particular domain at hand (Clark and Wilkes-Gibbs, 1986; Garrod and Anderson, 1987; Pickering and Garrod, 2004; Brennan and Clark, 1996; Healey, 1997; Larsson, 2007). We will use the term semantic coordination to refer to the process of interactively coordinating the meanings of linguistic expressions.","This paper presents work towards a formal theory of corrective feedback, and semantic coordination in general. It takes a view of natural languages as toolboxes for constructing domain-specific microlanguages, and provides an analysis of linguistic content which is structured in order to allow modification of, and similarity metrics over, meanings.","According to (Cooper and Ranta, 2008), a “language” such as Swedish or English is to be 1 regarded as a collection of resources (a “toolbox”) which can be used to construct local microlanguages. We take the view that speakers of natural languages are constantly in the process of creating new language to meet the needs of novel situations in which they find themselves.","Accounting for corrective feedback requires (1) dynamic representations of concepts which can be modified in various ways, in a process of semantic coordination, and (2) a description of dialogue strategies involved in semantic coordination.","Accordingly, the research effort which the work presented here is part of aims towards an account of semantic coordination in dialogue, consisting of two parts:","1. semantics: an account of how meanings (and concepts) can be updated","2. pragmatics: an account of how meanings (and concepts) are coordinated in dialogue and how dialogue moves governing coordination are related to semantic updates","These parts will be presented below, starting with the pragmatics. At the end of the paper, we will step back and consider the implications of our tentative results."]},{"title":"2 The pragmatics of corrective feedback","paragraphs":["To get a handle on the pragmatic processes involved in corrective feedback, we will show how such interactions can be analysed in terms of dialogue moves related to semantic updates. This approach builds on, and extends, the Information State Update approach to dialogue management (Traum and Larsson, 2003). 2.1 A taxonomy of corrective feedback Below, we classify our examples into four kinds of corrective feedback. • Example 1: “In-repair” – Abe: I’m trying to tip this over, can you","tip it over? Can you tip it over? – Mother: Okay I’ll turn it over for you. • Example 2: Clarification request – Adam: Mommy, where my plate? – Mother: You mean your saucer? • Example 3: “Explicit replace” – Naomi: Birdie birdie. – Mother: Not a birdie, a seal. • Example 4: “Bare” correction – Naomi: mittens. – Father: gloves. 2.2 Dialogue moves for corrective feedback We will now introduce a representation of dialogue moves used in corrective feedback. The general format we will use is • offer-form: TYPE(ARGS)","where ARGS may include one or several of the following: • proposed form (P below) • replaced form (R below) • sentence frame (F below)","In the representation above, TYPE is one of the following, corresponding to the kinds of corrective feedback distinguished above: • in-repair • cr • explicit-replace • bare In-repair The in-repair type of corrective feedback takes two arguments, the proposed form and a sentence frame. It is generally preceded by an utterance containing the sentence frame applied to the replaced form. • offer-form:in-repair(P , F )","For illustration, let’s look again at our example, now with typography indicating PROPOSED FORM, replaced form and sentence frame: A(be): Can you tip it over? M(other): Okay I’ll TURN it over for you.","In relation to A’s utterance, M ’s utterance contains the same sentence frame F , roughly “[Mother] it over”. However, they differ in that whereas M ’s utterance has the proposed word P = “TURN”, A’s utterance has R = “tip”. If we 2 say that sentence frames can be applied to expressions, resulting in the “ ” in the frame being replaced with the expression (much as in lambda reduction), we can say that A’s utterance has the form “F (R)” = “[Mother] it over”(“turn”) = “[Mother] turn it over” whereas M ’s utterance has the form “F (R)”. M ’s utterance corresponds to the dialogue move: offer-form:in-repair(“turn”, “[M] [it] over”)","Note that the syntactic parallelism is not complete; we have ignored the complication that one utterance contains “can” and the other “will” (in reduced form). The notion of sentence frame used here is a simplification of a more complex relation of syntactic and semantic parallelism which needs to be further explored.","Note also that in addition to providing corrective feedback, M ’s utterance also accepts the content of the previous contribution. Note that M might instead have said something like “No, but I’ll turn it over for you”. Clarification requests As in the case of in-repair offers, offers involving clarification requests also provide the proposed form together with a sentence frame linking the move to a previous utterance by the child; presuming that the latter has the form ”... F (R)”, the offer can be represented as offer-form:cr(P , F ) Let’s revisit our example, making explicit the","P , F and R parameters: A(dam): Mommy, where my plate? M(other): You mean your SAUCER?","Here, we have F = “[Adam’s] ”, R = “plate” and P = “SAUCER”. Accordingly, we can describe M ’s utterance as a dialogue move: offer-form:cr(“saucer”, “[A’s] ”)","Typically, CRs have the interpretation “you mean/want F (P )?”. In addition to offering an alternative form P of expression, a clarification request also explicitly raises the issue whether the offer of P is accepted, and is typically followed by a positive (or negative) answer by the child.","Note that CRs, as well as some other types of offers, may not be intended as corrections by the adult, but simply as attempts at understanding what the child wants to communicate. The crucial point for our purposes here is the effect these moves have on the addressee, rather than the underlying intention. In general, if I learn something from someone else, it may not be of great importance for my learning if they intended for me to learn it or not. Explicit replace In contrast to in-repairs and clarification requests, explicit offers of replace-ments need not rely on sentence frames to figure out the replaced form, as it is (as the name indicates) explicitly mentioned in the offer. N(aomi): Birdie birdie M(other): Not a birdie, a SEAL We represent this kind of dialogue move thus: offer-form:explicit-replace(P , R) In the example, the move is offer-","form:explicit-replace(“seal”, “birdie”). Explicit","replace offers are preceded by an utterance","consisting of or containing the replaced form R,","and typically have the form “(that’s) not DET R,","(that’s) DET P ” or similar. Explicit replace offers differ from in-repairs and","clarification requests by clearly signalling that the","replaced form is not appropriate, and by being","clearly intended as providing corrections rather","than (just) figuring out what the child is trying to","communicate. Bare offers Bare offers are the formally simplest kind of corrective feedback, consisting simply of the proposed form. Naomi: Mittens Father: GLOVES. The dialogue move representation is offer-form:bare(P )","In the example, the move is offer-form:bare(“gloves”). Since neither sentence frame or replaced form is provided, the replaced form must be figured out from the conversational situation as a whole. Just as explicit replace offers, bare offers are primarily intended as providing 3 corrections.","2.3 Generalising the dialogue move representation The different variants for corrective feedback all do basically the same work; they indicate that the child needs to modify his or her take on the meaning of the proposed term, and perhaps also the replaced term. A possible difference is that some forms more clearly provide evidence that the replaced form is not appropriate, whereas others leave this open. Ignoring this complication for the moment, we can provide a general form for the various types of offers of new forms, with the proposed form and the replaced form as arguments:","offer-form(P , R)","Using this representation, the dialogue move analyses above can be reformulated as, in the order they appear above: • offer-form(“turn”, “tip”) • offer-form(“saucer”, “plate”) • offer-form(“seal”, “birdie”) • offer-form(“gloves”, “mittens”)","In moves which do not explicitly indicate the replaced form R, contextual interpretation involves chart alignment and reasoning about active edges (represented here by the sentence frame) to locate an expression R parallel to P in the previous utterance. 2.4 Agents that coordinate resources As in the information state update approach in general, dialogue moves are associated with information state updates. For semantic coordination, the kind of update is rather different from the one associated with dialogue moves for coordinating on task-related information, and involves updating the linguistic resources available to the agent (grammar, lexicon, semantic interpretation rules etc.), rather than e.g. the conversational scoreboard as such. Our view is that agents do not just have monolithic linguistic resources as is standardly assumed. Rather they have generic resources which they modify to construct local resources for sublanguages for use in specific situations. Thus an agent A may associate a linguistic expression c with a particular concept (or collection of concepts if c is ambiguous) [c]A","in its generic resource. In a particular domain α c may be associated with a modified version of [c]A",", [c]A","α . In some cases [c]A","α may contain a smaller number of concepts than [c]A",", representing a decrease in ambiguity. Particular concepts in [c]A","α may be a refinement of one in [c]A",", that is, the domain related concepts have an extension which is a proper subset of the extension of the corresponding generic concept. This will, however, not be the case in general. For example, a black hole in the physics domain is not normally regarded as an object described by the generic or standard meaning of black hole provided by our linguistic resources outside the physical domain. Similarly a variable in the domain of logic is a syntactic expression whereas a variable in experimental psychology is not and quite possibly the word variable is not even a noun in generic linguistic resources.","Our idea is that the motor for generating new such local resources in an agent lies in coordinating resources with another agent in a particular communicative situation s. The event s might be a turn in a dialogue, as in the examples we are discussing in this paper, or, might, for example, be a reading event. In a communicative situation s, an agent A may be confronted with an innovative utterance c, that is, an utterance which either uses linguistic expressions not already present in A’s resources or linguistic expressions known by A but associated with an interpretation distinct from that provided by A’s resources. At this point, A has to accommodate an interpretation for c which is specific to s, [c]A","s , and which may be anchored to the specific objects under discussion in s.","Whereas in a view of semantics inherited from formal logic there is a pairing between a linguistic expression c and an interpretation c′","(or a set of several interpretations if c is ambiguous), we want to see c as related to several interpretations: [c]A","s for communicative situations s, [c]A","α for domains α (where we imagine that the domains are collected into a complex hierarchy or more and less general domains) and ultimately a general linguistic resource which is domain independent, [c]A",". We think of the acquisition of a pairing of an expression c with an interpretation c′","as a progression from an instance where c′","is [c]A","s for some particular communicative situation s, through potentially a series of increasingly general domains α where c′","is regarded as being one of the interpretations in [c]A","α and finally arriving at a state where 4","c′","is associated with c as part of a domain indepen-","dent generic resource, that is, c′","is in [c]A",". There","is no guarantee that any expression-interpretation","pair will survive even beyond the particular com-","municative situation in which A first encountered","it. For example, the kind of ad hoc coinages","described in (Garrod and Anderson, 1987) us-","ing words like leg to describe part of an oddly","shaped maze in the maze game probably do not","survive beyond the particular dialogue in which","they occur. The factors involved in determin-","ing how a particular expression-interpretation pair","progresses we see as inherently stochastic with pa-","rameters including the degree to which A regards","their interlocutor as an expert, how many times the","pairing has been observed in other communicative","situations and with different interlocutors, the util-","ity of the interpretation in different communicative","situations, and positive or negative feedback ob-","tained when using the pairing in a communicative","situation. For example, an agent may only allow a","pairing to progress when it has been observed in at","least n different communicative situations at least","m of which were with an interlocutor considered","to be an expert, and so on. We do not yet have a","precise proposal for a theory of these stochastic as-","pects but rather are seeking to lay the groundwork","of a semantic treatment on which such a theory","could be built."]},{"title":"3 The semantics of corrective feedback 3.1 Representing concepts using TTR","paragraphs":["We shall make use of type theory with records (TTR) as characterized in Cooper (2005; 2008) and elsewhere. The advantage of TTR is that it integrates logical techniques such as binding and the lambda-calculus into feature-structure like objects called record types. Thus we get more structure than in a traditional formal semantics and more logic than is available in traditional unification-based systems. The feature structure like properties are important for developing similarity metrics on meanings and for the straightforward definition of meanings modifications involving refinement and generalization. The logical aspects are important for relating our semantics to the model and proof theoretic tradition associated with compositional semantics. Below is an example of a record type: [ REF : Ind SIZE : size(REF, MuchBiggerThanMe) SHAPE : shape(REF, BearShape) ]","A record of this type has to have fields with the same labels as those in the type. (It may also include additional fields not required by the type.) In place of the types which occur to the right of ‘:’ in the record type, the record must contain an object of that type. Here is an example of a record of the above type:    REF = obj123 SIZE = sizesensorreading85 SHAPE = shapesensorreading62 COLOUR = coloursensorreadning78   ","Thus, for example, what occurs to the right of the ‘=’ in the REF field of the record is an object of type Ind, that is, an individual. Types which are constructed with predicates like size and shape are sometimes referred to as “types of proof”. The idea is that something of this type would be a proof that a given individual (the first argument) has a certain size or shape (the second argument). One can have different ideas of what kind of objects count as proofs. Here we are assuming that the proof-objects are readings from sensors. This is a second way (in addition to the progression of local resources towards general resources) that our theory interfaces with a statistical non-categorical world. We imagine that the mapping from sensor readings to types involves sampling of analogue data in a way that is not unsimilar to the digitization process involved, for example, in speech recognition. Again we have nothing detailed to say about this at the moment, although we regard it as an important part of our theory that it is able to make a connection between the realm of feature vectors and the realm of model-theoretic semantics.","Types constructed with predicates may also be dependent. This is represented by the fact that arguments to the predicate may be represented by labels used on the left of the ‘:’ elsewhere in the record type. This means, for example, that in considering whether a record is of the record type, you will need to find a proof that the object which is in the REF-field of the record has the size represented by MuchBiggerThanMe. That is, this type depends on the value for the REF-field.","Some of our types will contain manifest fields (Coquand et al., 2004) like the REF-field in the following type: 5 [ REF=obj123 : Ind SIZE : size(REF, MuchBiggerThanMe) SHAPE : shape(REF, BearShape) ] [ REF=obj123:Ind] is a convenient notation for [ REF : Indobj123 ]","where Indobj123 is a singleton type. If a : T , then Ta is a singleton type and b : Ta (i.e. b is of type Ta) iff b = a. Manifest fields allow us to progressively specify what values are required for the fields in a type.","An important notion in this kind of type theory is that of subtype. For example, [ REF : Ind SIZE : size(REF, MuchBiggerThanMe) ] is a subtype of [ REF : Ind ] as is also [ REF=obj123 : Ind ] The subtype relation corresponds to that of subsumption in typed feature structures. This gives us the ability to create type hierarchies corresponding to ontologies (in the sense, for example, of OWL). Such ontologies (coded in terms of record types) play an important role in our notion of resources available to an agent. In fact, modelling concepts in terms of record types commits us to a view of concepts which is very closely related to work on ontologies. But our view of the creation of local situation specific and domain related resources in addition to generic resources means that agents have access not to a single generic ontology but also situation specific and domain related ontologies. And, perhaps most important of all, the process of semantic coordination with an interlocutor can involve local ad hoc adjustment to an ontology. This plays an important role in characteriz-ing the options open to an agent when confronted with an innovative utterance. We attempt to illustrate this below by working in more detail through a specific example. 3.2 “Panda” as an example of innovative use We provide an analysis of B’s utterance in our initial example as a move of offering “panda” as an alternative for “bear”, and as potentially triggering an update on A’s concepts for “bear” and “panda”. A: That’s a nice bear B: Yes, it’s a nice panda","The dialogue move analysis of this example is offer-form:in-repair(“panda”, “[it] is a nice ”), or in the generalised format offer-form(“panda”, “bear”).","We assume that, before B’s utterance, A has a single concept of “bear” in a domain called “zoo”, that is, a unique member of the collection [bear]A","zoo. We represent it in Figure 1. A’s take on the communicative situation where B’s utterance takes place (that is, A’s dialogue information state, much simplified for expository reasons) is shown in Figure 2. This is intended to describe a situation at a zoo, where a bear-shaped object much bigger than A is in focus (FOO here stands for “Focused Object”).","What happens after B’s utterance? First, we assume that B correctly understands A’s utterance as offering “panda” as an alternative for “bear”. Now, assuming that B has not observed the word “panda” before, A needs to create a panda-concept [panda]A","s , local to the communicative situation s resulting from B’s utterance. Since “panda” has been aligned with “bear”, it is natural to base the new panda concept on the bear concept, associated with the domain. Here A is confronted with a fundamental choice. Should a condition ‘panda(REF)’ be added to the concept in addition to the condition ‘bear(REF)’ making the panda concept be a subtype of the bear concept or should the panda condition replace the bear condition, making panda and bear sisters in the ontology? There is not enough evidence in this simple exchange to determine this.1","We will choose to replace the bear condition with the panda condition. But there is more that must happen.","A has observed that the use of “panda” in s refers to the focused object obj123. Following the principle of contrast (Clark and Wong, 2002) which states that “(s)peakers take every difference in form to mark a difference in meaning”, B takes “panda” to have a different meaning than “bear” in some respect other than that it is a panda as opposed to a bear, and looks for something about obj123 which might distinguish it from previously observed bears. For example, the child might decide that it is the colour (black and white) that","1","And indeed many people can reach adulthood, the present authors included, without being sure whether pandas are a kind of bear or not. 6       REF : Ind PHYS : phys-obj(REF) ANIM : animate(REF) SIZE : size(REF, MuchBiggerThanMe) SHAPE : shape(REF, BearShape) BEAR : bear(REF)       Figure 1: A’s “bear” concept in the domain “zoo” before the interaction    DOMAIN : zoo SHARED :   FOO=obj123 : Ind COM=[ C1 : nice(FOO) C2 : bear(FOO) ] : RecType      Figure 2: A’s take on s distinguishes it from previously observed bears (which have all been brown)2",". A now creates a situated interpretation [panda]A","s of “panda”, based on [bear]A","zoo, as shown in Figure 3.","But now if colour is being used to distinguish between bears and pandas in situation s, A should create a refined bear concept for s, namely Figure 4 reflecting the hypothesis that bears are brown. If A is optimistic, possibly influenced by the degree of expertise which A assigns to B (“Mummy knows about zoos”), A might immediately associate the concept in Figure 4 with the zoo domain, that is, make it be a new value for [bear]A","zoo and similarly for a dereferenced version of Figure 3, that is a version in which the manifest field is replaced by [ REF : Ind] . Finally, A’s new","take on s is shown in Figure 5; A has accepted that","the focused object is a panda."]},{"title":"4 Conclusion","paragraphs":["We have sketched an account of how concepts can be updated as a result of language use in interaction. Such processes enable coordination of domain-specific microlanguages, involving a domain-specific grammar and lexicon, an ontology, and a mapping between lexicon and ontology.","There are many mechanisms for semantic coordination, some of which can be described as corrective feedback: clarification requests, explicit corrections, meaning accommodation (observing instances of language use and silently adapting to successful instances) and explicit negotiation. Semantic coordination, in turn, is a kind of language coordination (other kinds include e.g. phonetic co-","2","This account relies on A having a memory of previously observed instances of a concept, in addition to the concept it-self (which in the case of “bear” does not contain information about colour). ordination). Finally, language coordination coexists with information coordination, the exchang-ing and sharing of information (agreeing on relevant information and future action; maintaining a shared view on current topics of discussion, relevant questions etc.). Arguably, the main point of language coordination is to enable information coordination.","Semantic coordination happens in dialogue; it is part of language coordination; and it is a prerequisite for information coordination. If we say that a linguistic expression c has meaning only if it is possible to exchange information using c, then semantic coordination is essential to meaning. A linguistic expression c has meaning in a language community when the community members are sufficiently coordinated with respect to the meaning of c to allow them to use c to exchange information. In other words: meaning emerges from a process of semantic coordination in dialogue."]},{"title":"Acknowledgement","paragraphs":["This research was supported by The Swedish Bank Tercentenary Foundation Project P2007/0717, Semantic Coordination in Dialogue. 7        REF=obj123 : Ind PHYS : phys-obj(REF) ANIM : animate(REF) SIZE : size(REF, MuchBiggerThanMe) SHAPE : shape(REF, BearShape) COLOUR : colour(REF, BlackAndWhite) PANDA : panda(REF)        Figure 3: A’s situated interpretation of “panda” in situation s.        REF : Ind PHYS : phys-obj(REF) ANIM : animate(REF) SIZE : size(REF, MuchBiggerThanMe) SHAPE : shape(REF, BearShape) COLOUR : colour(REF, Brown) BEAR : bear (REF)        Figure 4: A’s local “bear” concept after integrating B’s utterance    DOMAIN : zoo SHARED :   FOO=obj123 : Ind COM=[ C1 : nice(FOO) C2 : panda(FOO) ] : RecType      Figure 5: A’s revised take on s 8"]},{"title":"References","paragraphs":["S. E. Brennan and H. H. Clark. 1996. Conceptual pacts and lexical choice in conversation. Journal of Experimental Psychology: Learning, Memory and Cognition, 22:482–493.","H. H. Clark and D. Wilkes-Gibbs. 1986. Refering as a collaborative process. Cognition, 22:1–39.","Eve V. Clark and Andrew D. W. Wong. 2002. Pragmatic directions about language use: Offers of words and relations. Language in Society, 31:181– 212.","E. V. Clark. 2007. Young children’s uptake of new words in conversation. Language in Society, 36:157–82.","Robin Cooper and Aarne Ranta. 2008. Natural languages as collections of resources. In Robin Cooper and Ruth Kempson, editors, Language in Flux: Relating Dialogue Coordination to Language Variation, Change and Evolution. College Publications, London.","Robin Cooper. 2005. Austinian truth, attitudes and type theory. Research on Language and Computation, 3:333–362.","Robin Cooper. 2008. Type theory with records and unification-based grammar. In Fritz Hamm and Stephan Kepser, editors, Logics for Linguistic Structures. Mouton de Gruyter.","Thierry Coquand, Randy Pollack, and Makoto Takeyama. 2004. A logical framework with dependently typed records. Fundamenta Informaticae, XX:1–22.","Simon C. Garrod and Anthony Anderson. 1987. Say-ing what you mean in dialogue: a study in conceptual and semantic co-ordination. Cognition, 27:181– 218.","P.G.T. Healey. 1997. Expertise or expertese?: The emergence of task-oriented sub-languages. In M.G. Shafto and P. Langley, editors, Proceedings of the 19th Annual Conference of the Cognitive Science Society, pages 301–306.","Staffan Larsson. 2007. Coordinating on ad-hoc semantic systems in dialogue. In Proceedings of the 10th workshop on the semantics and pragmatics of dialogue.","Martin J. Pickering and Simon Garrod. 2004. Toward a mechanistic psychology of dialogue. Behavioral and Brain Sciences, 27(02):169–226, April.","David Traum and Staffan Larsson. 2003. The information state approach to dialogue management. In Ronnie Smith and Jan Kuppevelt, editors, Current and New Directions in Discourse & Dialogue. Kluwer Academic Publishers. 9"]}]}
