{"sections":[{"title":"","paragraphs":["Intentionality and Human Conversations. Jaime G. Carbonell Jr.","Department of Computer Science Yale University - New Haven, Connecticut Abstract","This paper analyzes principles of human conversation based on the conversational goals of the participants. Several conversational rules are proposed that seem crucial to the process of interpreting and generating conversations. These rules, as well as other aspects of the conversation process, are embodied in MICS, a computer program that generates one side of a conversation. The process model underlying MICS, and some illustrative output, are presented. I) Formulating rules about human conversations.","This paper is an empirical approach to understanding the processes that underlie human conversations. Since the task of codifying all the knowledge required for modeling human discourse is monumental, we confine our approach to formulating rules about the conversational intent of utterances in the course of a dialog. This approach leads us to investigate the effects of shared assumptions and knowledge between the speakers, the social and interpersonal relations of the speakers, and the inferences that must be made by both speakers in a conversation. We take a different approach to analyzing conversations than other research efforts, such as those adopting the speech-acts paradigm (Mann et al [1977]) or investigating task-specific dialogs (Grosz [1977])o in the hope that our new perspective will shed some light on otherwise obscure or neglected aspects of human discourse.","Consider the following conversation fragment between Bill and John, two college students sharing an apartment:","I) JOHN: Hi, what's new, Bill? BILL: l'm going to visit my folks tonight. We can analyze Bill's utterance in Conversation Fragment (I) in terms of its immediate meaning, that is, a representation of Bill's utterance in Conceptual Dependency or some other meaning representation. This, however, is a very incomplete analysis of what Bill said. Why did Bill say that he was visiting his folks? Bill could just as easily have said, \"I'm going to brush my teeth tonight.\" This utterance, however, doesn't answer John's question; brushing one\"s teeth is not \"something new\". Therefore, we could propose a rather simple conversational rule:","RULE I : If a question is asked in the course of a conversation, the other participant should answer this question.","Rule I, however, is a little too naive. Suppose Bill's answer was: \"There are a few more microns of dust on the windowsill than the last time you asked me that question.\" This is indeed \"something new\", but we would think of Bill as a wise guy for answering the question literally rather than addressing what John \"must have meant\". What did John really mean? John must have been looking for something out of the ordinary and of some intrinsic importance. Let us propose a new rule to incorporate this principle:","RULE 2: In the formulation of an answer, the speaker should address the true significance of the question, not just its literal meaning.","What is the true significance of a question? In Conversation Fragment (I), Bill might have answered: \"The J-particle angular momentum of +3/2 was confirmed today.\" John, a literature major who does not understand Physics, may not be inclined to continue the conversation. Therefore, Bill's answer is not what was called for, unless Bill intentionally wanted to end the conversation. This example suggests that Bill missed something in establishing the true significance of John's question. John did, indeed, explicitly ask to hear something new; implicitly he meant something important and out of the ordinary. The J-particle answer conforms to these requirements, but it is still an inappropriate response. Therefore, the true significance of John's answer must include John's conversational goal. Why did John ask \"What's new\"? The answer is, obviously, to start a conversation with Bill. Bill, being aware of this conversational goal, needs to choose an answer that attempts to initiate conversation. That is, Bill should choose a topic of conversation that John can talk about and that John may be interested in. Conversational Rule (3) summarizes this discussion:","RULE 3: In introducing a new topic of conversation, the topic should be chosen so that both speakers have some knowledge and interest in its discussion.","The process of understanding the conversational import of an utterance may be conceptually divided into two primary subprocesses: I) determine the conversational goal of the utterance, and 2) establish the real, often implicit, meaning of the utterance. Lehnert [1977] analyzes the process of establishing the real meaning of questions. Our analysis focuses on the conversational goals of the participants and the establishment of a shared knowledge base between the participants. It is this shared cultural, personal, and factual knowledge that the conversational participants leave implicit in each commtmication. To illustrate this fact, consider Conversational Fragment (2):","2) JOHN: Do you want to go out and try the bar","at Monument Square? BILL: I'm going to visit my folks tonight.","Real significance of Bill's utterance: i) No, I do not want to go to the M~nument Square bar.","ii) My reason for not wanting to go is that","I made a previous commitment, and I cannot be in two places at once tonight. 141","ill) The previous commitment is a visit to my folks.","iv) I am telling you about the reason why I cannot go drinking with you rather than just saying \"no\" because I do not want you to get angry at me.","v) I may also wish to shift the topic of conversation to a discussion about my fam il y.","Bill knows that John will interpret his answer so as to conclude its real significance; otherwise Bill would have chosen to explicitly state the real significance. How does Bill know that John will understand him correctly? Clearly Bill and John must share some common sense knowledge such as: a) A person cannot be in two places at once. b) Previous commitments should be honored. c) If X's invitation or suggestion is turned down by Y without apparent reason, then X is likely to get upset at Y. d) If a person introduces a new topic in a conversation, he may want to discuss the current topic further, Both Bill and John are aware that they share a common cultural knowledge base. This knowledge is very crucial in determining what is said in the conversation. Bill must have considered (1) through (iv) before deciding that is was sufficient to say only (ill). How did Bill decide to say only (ill)? He must have concluded that John would infer (i) , (ii) and (iv) without difficulty. Thus, Bill knew about John's general knowledge because of their common cultural background and their personal relation. Bill used this knowledge to decide what to say in the c onv er satlon.","In the course of a conversation, people make assumptions about each other's knowledge. It is sometimes easier to see what these conversational assumptions are when they turn out to be incorrect, as in the following example:","3) PETE: How are you going to vote on Proposition 13? MARY: On what? PETE: You know, the property tax limitation.","MARY: Oh yeah. I'm not registered to vote. Which way were you trying to convince me to vote?","PETE: I was hoping you would help me make up my mind.","MARY: Actually, I don't give a damn about politics. At the beginning of the conversation Pete ass~ed that Mary knew what Proposition 13 was, that she was able to vote, that she would vote, and that she had already decided how to vote on Proposition 13. All of these assumptions turned out to be incorrect, and the course of the conversation turned towards clarifying the incorrect ass~ptions. This example is an instance of a more general rule of conversation:","RULE 4: If a participant in a conversation discovers that his assumptions about the shared knowlege between the two speakers is incorrect, then he will steer the conversation to I) establish a common knowledge base on","a specific topic, or 2) discover what their shared knowledge","is in general, or 3) shift the conversational topic to","some matter where a common knowledge","base is more likely to exist, or 4) end the conversation.","The assumptions discussed thus far have been of a factual nature, but assumptions are also made about the conversational intent of the participants and about their interest in the conversational topic. Mary inferred Pete\" s conversational intent incorrectly: He was seeking advice, not trying to lobby for or against Proposition 13. Pete started the entire conversation on the wrong topic by assuming that Mary was interested in politics or taxes. A conversation about a topic that one of the participants finds uninteresting will usually digress to other topics or fizzle out as the uninterested party volunteers no new information, finds an excuse to do something else, or states outright that the conversation is boring (as was the case in our example).","Erroneous assumptions about conversational intent lead to misunderstandings because each speaker will address the perceived intent of the other speaker's utterance. It is, therefore, imperative to correctly infer the other speaker's conversational intentions in order for the conversation to proceed naturally. The type misunderstanding that often results from incorrectly perceived conversational intentions is, on occasion, exploited in creating certain types of jokes, as in example 4: 4) SON: Dad, I robbed the liquor store yesterday. DAD: How could you ever do such a thing, son?","SON: Well, I got me this gun, and I pointed it at the cashier...","To illustrate the importance of the implicit conversational goals and shared knowledge between the participants in a conversation, we present a few more dialog framents between Bill and John, the two college students sharing an apartment. In each example, as in conversations (I) and (2), Bill utters the same response, but its meaning is significantly different, depending on the context of the conversation."]},{"title":"5)","paragraphs":["JOHN: Are you broke again? You are going to have to come up with your share of the rent this month. BILL: I'm going to visit my folks tonight. 142","Meaning of Bill's utterance: (i) Yes, l'm broke again. (il) Yes, I'll try to contribute my share of","the rent.","(iii) My parents might give me some money if","I ask them. (iv) If I visit them and ask them in person I","have a better chance of getting some money. (v) I'll visit them tonight and then I'll ask","them for money.","When we read Conversation Fragment (5), we infer that Bill may be going to ask his parents for money. How do we do this? We do not share knowledge with Bill to the effect that his parents have money or that Bill is willing to ask them for money. The answer is based on a conversational rule:","RULE 5: The utterances in a conversation should be connected by continuity of topic, common conversational goals, and each participant addressing the intent of the utterances of the other participant. Since the reader assumes that Rule (5) is true for Conversation Fragment (5), he concludes that there must be a connection between Bill needing money and the visit to his parents. The reader then infers the most likely connection: Bill will ask his parents for money. John must also make this inference based on Rule (5), unless he knows that Bill regularly visits his parents to ask for money. The significant point illustrated in example 5 is that the conversation focused the inference mechanism to find a connection between the respective utterances. Therefore, conversational principles can play an important role in focusing human reasoning processes. The principle of focusing inference processes on significant or interesting aspects of conversational utterances and events is developed into a theory of human subjective understanding in Carbonell [1978].","Let us continue with the conversational fragments between Bill and John: 6) JOHN: How come you never see your family? BILL: I'm going to visit my folks tonight.","Meaning of Bill's utterance: (i) I do visit my family. (ii) Supporting evidence: I'm going to visit","them tonight. (iii) Therefore, what you just said is not true.","7) JOHN: Can I borrow your car? I got this heavy date tonight. BILL: I'm going to visit my folks tonight.","Meaning of Bill's utterance: Alternative I. (i) No, you cannot borrow my car tonight. (il) I am"]},{"title":"going","paragraphs":["to visit my folks tonight. (iii) I need to drive there. (iv} The car cannot be fn two places at once. Alternative II, (i) Yes, you can borrow my car tonight. (ii) I am going to be at my folk's place,","where I don't need to use it."]},{"title":"8)","paragraphs":["JOHN: Can I have the apartment to myself? I got this heavy date tonight. BILL: I'm going to visit my folks tonight.","Meaning of Bill's utterance: (i) Yes, you can have the apartment. (ii) What you want is for me to be elsewhere. (iii) I was planning on that any~my, since I","am visiting my folks tonight.","Conversation fragments (6), (7) and (8) illustrate the degree to which the understanding o f cony er sat ional utterances i s expectation-driven. The expectations are generated from previous utterances according to rule 5; the toplc, intent, and conversational goals introduced earlier in the conversation will be addressed by later utterances. In each case the same utterance on Bill's part is understood differently, depending on the context established by John' s previous utterance. Utterances in a conversation do not usually have a meaning independent of the rest of the conversation; their meaning is part of the context of the entire conversation. Thus, it is easy to see why quoting only a short passage from a conversation (or a political speech) can give that passage has an entirely different meaning from what was originally intended.","The shared knowledge between two speakers depends on many different factors. Two speakers share a large amount of basic knowledge by merely being members of the human race (e.g. the basic drives that motivate humans such as hunger, self-preservation, etc .). More knowledge is shared if the two speakers are members of the same culture. (Much of the cultural and more basic human knowledge necessary to understand natural language is discussed in Schank and Ableson [1977].) If the two participants hold the same type of job, are professional colleages, or have the same special interests, then they will share some rather specific knowledge. Two people with the same special interests (such as football or radio-astronomy) will usually steer the conversation to a discussion of their common interest s.","RULE 6: The topic of a conversation may drift to a subject where the conversational participants share a great amount of knowledge.","Another factor that determines the knowledge shared by the participants in a conversation is their interpersonal relation, i.e., how well they know each other. In conversational fragment (7), Bill's response can be interpreted in two different weys by the reader, but_ John will i~terpret his response unambiguously. John must know whethe~ Bill's response means tha~ Bill needs 143 the car or whether John is free to use it ; otherwise, Bill would have been more specific in his answer.","Social relations and the perceived goals of conversational participants play an important role in interpreting the meaning of conversational utterances. Let us first consider the influence of the social relations between the two participants :","9) ARMY GENERAL: I want a juicy hamburger. STAFF AIDE: Right away, sirl","i0) 7-YEAR-OLD: I want a juicy hamburger. MOTHER: Maybe next wsek. We are having","chicken today.","II) PRISON INMATE I: I want a juicy hamburger. PRISON INMATE 2: Me tool Everything here","tastes like cardboard.","The utterance \"I want a juicy hamburger\" is interpreted differently in each dialog fragment. The difference in the interpretations is based on the different social relations existing between the two conversational participants. In Dialog (9) the utterance was interpreted to mean a direct order to the staff aide: \"Get me a hamburger and make sure it is julcyl\" In Dialog (I0), the 7-year-old was expressing a request to his mother, hoping that his mother might comply. In Dialog (II), the same statement was interpreted as nothing more than wishful thinking. The fir st inmate made no order or request to the second inmate. Hence, the first utterance of each dialog fragment implies a different conversational goal depending upon the differences in the social relations of the conversational participants. The social context and the relationship between the two speakers generate expectations that guide the course of the conversation. A staff aide e~pects to be ordered about by a general. A mother expects her son to ask her for favors. Prison inmates cannot expect each other to do thinks that are made impossible by their incarceration. These expectations lead to a formulation of different conversational goals for the utterance, \"I want a juicy hamburger ,\" in each conversational fragment. The conversational principle exemplified in our discussion is summarized as Conversational Rules"]},{"title":"(7) and (8):","paragraphs":["RULE 7: The social relationship between the participants in a conversation generates expectations about the intentional meaning of utterances in the conversation. These expectations are used to determine the conversational goals of each participant.","RULE 8: Each speaker's perception of the conversational goals of the other speaker determines his interpretation of the other speaker\" s utterances.","Di f ferences in understanding o f conversational goals lead to different responses in a dialog, as illustrated in Conversation Fragments (9), (I0) and (Ii). We saw how a social relationship between two people can influence their interpretation o f each other\" s conversational goals. Two strangers can also make assumptions about each other's conversational goals based on appearances, social circumstances and each other\" s occupation. Consider, for instance, the various responses to John's question in the example below:","Scenario: John walked up to a parson in the corner and asked : \"DO you know how to get to Elm Street?\"","12.1) The stranger replied: \"You go two blocks toward that tall building and turn right.\"","12.2) The cab driver in the corner replied: \"Sure; Hop in. Where on Elm do you want to go?\"","12.3) The person, who was holding up a map and a piece of paper with an Elm Street address on it, replied : \"No, could you tell me how to get there?\"","12.4) The child answered: \"Yes, I know how to get there! \"","The question was interpreted to mean four different things, depending on whom John spoke to. If a stranger asks, \"Do you know how to get to X,\" the listener usually interprets this to mean \"I want to go to X, but I do not know how to get there. Please give me directions.\" Since the occupation of a cab driver is to take people to their destination it is perfectly legitimate for him to interpret the question as: \"If you know how to get to X please take me there.\" The person who is visibly lost and trying to find his way may interpret John's question as: \"You seem to be lost. Can I help you find your way?\" Response (12.3) illustrates that the responder did not infer that John's goal was to go to Elm street, in contrast with the two previous responses. A child often interprets questions of the form: \"Do you know Y\" literally, possibly inferring that the person asking the question is quizzing him. As in our previous examples, the differences in interpretation can be ~plained in terms of differences in the perceived goals of the participants in the conversation. II) MICS: A process model of human conversation.","The phenomenon of human conversation is too comple~ for any single study to do justice to more than a narrow aspect of the problem. In order to fully understand human conversations we may have to understand all human cognitive reasoning processes. Our research approach can be outlined as follows: I) Study many sample conversations; 2) try to establish some relatively general rules of conversation; 3) encode these rules into a process model; 4) see if this model accounts for certain aspects of human conversation; 5) realize that we solved hardly more than a minute part of the problem, and 6) reiterate the research process in a (hopefully positive) feed-back loop.","The conversational rules discussed in the first section address problems that need to be considered if one is to understand human 144 conversations. There is little doubt, as demonstrated by countless examples, that conversational goals, shared knowledge between speakers, social relationships between speakers ', and the conversational import of each utterance in a dialog are aspects of human discourse that need to be analyzed if one is to understand how human conversations work. Analyzing these aspects, however, solves only a small subset of the larger problem of how conversations function. For instance, the problem of topic selection in a conversation needs to be addressed. How does a person change the topic in a conversation? How are new topics chosen? These questions are analyzed in Schank [1977]. Here we propose some additional ideas on the impact of shared knowledge and interests on topic-selection.","MICS (Mixed-Initiative Conversational System) is a fully implemented computer program that generates one side of a natural-language conversation. MICS embodies the conversational rules discussed in this paper, a topic transition mechanism based on Schank [1977], and the idea of a conversational syntax. Conversational syntax is a set of rules that help to characterize well-formed conversations. For instance, the following four rules are among the twenty conversational syntax rules in MICS:","RULE 9: Do not repeat information in the course of a conversation unless explicitly r eque st ed.","RULE I0: Do not say things that the other speaker already knows about.","RULE II: If the other speaker says something that violates one's beliefs, then respond in kind by re-asserting the violated belief.","RULE 12: If insulted, return the insult or end the conversation. MICS illustrates that the conversational rules, topic transition rules and conversational syntax rules provide a sound, if possibly incomplete approach to the modeling of human conversation. MICS is able to generate reasonable conversations about domains on which it has some knowledge, but there are still many short-comings, as illustrated in the examples that follow.","MICS \"knows\" about itself as a person (e.g. it believes itself to be a computer programmer) and uses a model of the other conversational participant that contains certain information about the speaker, such as his social status, his occupation, his relationship with other people and his areas of special interest and more detailed knowledge. The model of the other speaker is a necessary part of the conversational model, since it enables MICS to apply the conversational rules. When MICS talks to a stranger, it builds a model of the speaker; in fact~ one of its conversational goals is to learn about the person with whom it is conversing. In the dialog that follows (an actual computer run), MICS starts out knowing nothing about Dave. MICS CONVERSATION LOG ******** 10/11/77 ******* HELLO, WHAT IS YOUR NAME? I am Dave. WHAT'S NEW TODAY, DAVE? Nothing, What's your name? MY NAME IS MICS. What is your job? I AM A COMPUTER PROGRAMMER That's nice. WHAT DO YOU DO FOR A LIVING? I MICS takes the initiative by asserting I its conversational goal of learning I about Dave. I am still a student. DO YOU LIKE BEING A STUDENT? For the time being yes. WHAT WILL YOU DO AFTERWARDS? I want to be a professor some day. WHAT DO YOU DO FOR FUN? i MICS formed a person-frame for Dave. At this I point, the conversational goal of trying to I establish an area of mutual interest and I shared knowledge is activated. I smoke dope. YOU MIGHT 6ET STONED IF YOU SMOKE TOO MUCH. I know, that's the idea. YOU MI~T 6ET IN TROUBLE IF THE COPS CATCH YOU. All right, stop moralizing, what do you do for fun? I LIKE TO PLAY CHESS That sounds boring. NO, IT IS A LOT OF FUNI My brother Eric plays chess. HE MUST BE SMART. I have to go. Bye Mics. NICE TALKING TO YOU, DAVE","As a result of the conversation, MICS knows something about Dave, in particular that one of his llfe goals is to becomle professor. MICS's conversational goals cause it to establish its own conversational topics. When a new topic is introduced by the human speaker, MICS stays on the chosen topic or chooses a closely related topic. Another rule of conversation is invoked in the above dialog :","RULE 13: Each participant in the conversation has the conversational goal of saying things that are important to the other participant. When the human participant says that he likes to smoke marijuana, MICS finds in its memory that smoking marijuana is illegal and can lead to the smoker getting stoned. Accord ing to MIC S ' s 145 beliefs getting stoned is undesirable, and doing something illegal leads to undesirable consequences. MICS determines that it is important for Dave to know about the bad consequences of his acts. Therefore, applying Rule (13), MICS warns Dave about the evils of marijuana. It is evident that MICS should have known that Dave knows that smoking marijuana leads to getting stoned, and that, in fact, getting stoned is Dave's primary purpose for smoking marijuana. If MICS knew this fact, then Conversational Syntax Rule (I0) would prevent MICS from warning Dave about getting stoned • Therefore, MICS needs a better mechanism for deciding what knowledge it shares with the other speaker. It is very difficult to determine what the other person already knows and what he is able to infer, but this is a problem that cannot be circumvented if we are to model human discourse.","The conversational syntax rule of countering a belief violation (Rule II) caused MICS to object when Dave said that playing chess (MICS's favorite pastime) was not exciting • Since the two participants could not find a common area of interest, the conversation ended without any s ubstantitive dialog. This illustrates Conversational Rule (4), discussed in the previous section. Let us analyze a conversation between MICS and Pete, someone who MICS believes to be its friend. HELLO, WHAT IS YOUR NAME? Pete. WHAT'S NEW TODAY, PETE? Professor Stevenson is giving us an exam friday. STEVENSON GIVES DIFFICULT EXAMS. Yeah~ do you know that Dave is probably going to flunk? THAT'S GOING TO MAKE IT HARD FOR DAVE TO BECOME A PROFESSOR. Too bad, Dave is not too smart anyways. YES, DAVE LIKES TO SMOKE DOPE. l've got to go and study. YOU WILL DO WELL IN THE EXAM.","The above conversation illustrates the usefulness of shared knowledge between the two participants. Pete and MICS both know about taking ~ams, and they have a common acquaintance -","Dave. MICS is able to use what it learned about Dave in its previous conversation. MICS' s response to Dave possibly flunking the exam illustrates Conversational Rules (3), (5) and (7). The continuity of the conversation is preserved. The chosen topic transition is probably of interest to Pete, as inferred by MICS in the following manner: Pete introduced Dave into the conversation; therefore, he probably wants to talk about Dave. Not fulfilling a life goal (e.g. becoming a professor) is an inherently important consequence to Dave; therefore, Pete is probably interested in knowing this consequence. Rule 7 applies because in the social relationship between Pete and MICS (they are friends) it is OK to talk about mutual acquaintances • (It is NOT necessarily OK for a judge and a defendant, for instance, to discuss mutual acquaintances.)","MICS's utterance about it being difficult for Dave to become a professor illustrates the inferenceing that proceeds in the course of a conversation. The inferences are directed at the most serious consequences of the preceeding utterance: flunking the exam. Focusing the inference process by importance criteria was found to be necessary in order to keep conversations from digressing into uninteresting topics.","When Pete states that Dave is not too smart, MICS reacts by verifying this evaluation. Since in the previous conversation Dave chose to ignore MICS's warnings about smoking marijuana, MICS concluded that Dave was not too bright. This conclusion is used as supporting evidence to back Pete's evaluation. The process of responding to opinions is captured in conversational rule 14: RULE 14: If a speaker in a conversation states an","opinion, the other speaker should consider","whether or not he agrees with the opinion.","The first speaker usually has the conver-","sational goal of ~mnting feedback (usually","agreement) on his oDinion.","The last exchange in the above dialog illustrates a deficiency in MICS determination of the conversational goals. When Pete says, \"I've got to go and study,\" he means, \"I want to end the conversation,\" but inferring this conversational goal requires understanding what it means to study. One cannot infer from the phrase, \"I've got to go ...\", that the conversation should terminate. For instance, if Pete says, \"I've got to go to Europe ,\" he probably wants to introduce his upcoming trip as a new topic of conversation. The knowledge that studying and talking cannot proceed simultaneuously is necessary in order to conclude that Pete wanted to end the conversation.","The primary usefulness of the MICS system is that it sheds light on problems about the rules of conversation that might otherwise remain unnoticed • The feedback from testing the implementation of our conversational model forces us to be more precise and complete in our formulation of our ideas about conversation. The following is a conversation fragment from a later version of MICS which has a more sophisticated inference capability for determining the knowledge that it shares with the other speaker. For instance, MICS infers that if a person voluntarily chooses to pursue a certain activity, then that person is aware of the intended consequences of this activity. Ashtrays. WHAT ABOUT ASHTRAYS? Ashtrays are useful. DO YOU SMOKE? Yes. YOU MIGHT GET CANCER IF YOU SMOKE TOO MUCH. Who cares, anyway I smoke dope, not tobacco. I SEE. YOU LIKE TO GET HIGH. It is better than getting drunk. NOT NECESSARILY. YOU MIGHT GET CAUGHT BY THE COPS. 146","Figure (I) is a diagram of the control flow of MICS. As a process model of conversation, MICS is a useful tool, but it is far from a complete or even an entirely correct model of human conversation. MICS is a 3 level production system. The first set of productions is the conversational-syntax rules. These rules formulate contraints on the nature of the utterance that MICS will generate next in order to insure that the conversation follows a proper, \"natural\" course. Some of these constrains take the form of conversational goals used by the other two sets of productions rules. The second set of rules is the topic selection productions. These productions generate topic transitions guided by conversational goals and the amount of shared knowledge between the speakers • Several alternative things to say may be generated in this phase of the processing. These, as well as the conversational goals are stored in a short term memory (STM) and are used by the third, and theoretically most significant phase of the program: the topic evaluation rules.","The third set o f productions encodes the conversational rules discussed throughout this paper. These rules use the STM information, the memory models of the self and the other speaker, CONV. SYNTAX RULES"]},{"title":"LTM","paragraphs":["MODEL OF / ' 'I","I LISTENER i I I GOALS OF"]},{"title":"I","paragraphs":["SELF t I EVENT / MF~ORY CAC ' S"]},{"title":"/ / r","paragraphs":["and an inferencer when necessary. The purpose of these rules is to choose the most interesting topics (to both the self and the other speaker) from the alternatives generated by the second set of production rules. The inferencer is used to determine what the other speaker is likely to know and which aspect of the topic he would be most interested in discussing. Thus, the menaing of an utterance is produced by the third set o f production rules.","The utterances are generated in English by a rather crude phrasal English generator. The utterances from the other speaker are analyzed for their meaning and conversational form by a primitive, key-concept oriented analyzer.","Disclaimer: MICS is a first-pass process model of a theory of conversation, not a theory of learning about other people. As such, its ability to learn about the other conversational participants is not as general as the dialogs presented in this paper may suggest. MICS learns about the other speaker by instantiating a prototypical-person frame - a data structure that encodes the more generally applicable facts about people and their social relations. INPUT SENTENCE","ANALYSIS I TOPIC/C-TYPE"]},{"title":"I I","paragraphs":["/"]},{"title":"/ /// -/,,,/","paragraphs":["EVALUATION RULES ENGLISH GENERATOR ENGLISH RESPONSE","TOPIC SELECTION RULES TRANSITIO~"]},{"title":"I","paragraphs":["W~OTHER TOPIC~ SELECTIONS F INTEREST MICS CONTROL-FLOW FIGURE 1 STM"]},{"title":",,I /","paragraphs":["147 Conclusion.","believe that the best way to analyze a problem as difficult as modeling human discourse is to forge ahead by creating rules that capture important aspects of the conversation problem. The usefulness of these rules should be tested in a reactive environment such as an interactive computer program. Since conversation is not a problem that can be isolated from other aspects of human cognitive behavior, we are researching it in conjunction with other aspects of Artificial Intelligence. A process-based theory o f haman conversation should give some insight into other Natural Language Processing issues in particular, and AI modeling of human reasoning processes in general. Re fer ences.","Carbonell, J. G. 1978. Computer Models of Social and Political reasoninB, PhD. Thesis, Yale University, New Haven, Conn.","Grosz, B. J. 1977. The Representation and Use of Focus in a System for Understanding Dialogs, Proc. of the fifth IJCAI., MIT, Cambridge, Mass.","Lehner t, W. 1977. The Process of Question Answering, PhD Thesis. Tech. Report 88, Yale University, New Haven, Conn.","Mann W., M~ore J., Levln J. 1977. A Comprehension Model for Human Dialogue, Proc. of the fifth IJCAI. MIT, Cambridge, Mass.","Schank, R. C. and Abelson R. P. 1977. Scripts, Goals, Plans and Understanding, lawrence Lawernce Erlba~n. Hillside, NJ.","Schank, R. C. 1977. Rules and topics in conversation, Cognitive Science, Vol. I, No. 4. 148"]}]}