{"sections":[{"title":"","paragraphs":["THE ROLE OF METAPHORS IN DESCRIPTIONS OF EMOTIONS","Andrew Ortony and Lynn Fainsilber University of Illinois at Urbana-Champaign","Why do we use metaphors? For nearly 2000 years, the most generally accepted answer was that people only use metaphors for rhetorical purposes. Metaphorical language was thought to be merely ornamental -- the seasoning of language, exploited for effect by poets and politicians 1, as compared with the cold factual language of the scientist. This view, however, is now no longer accepted (see, for example, Gentner, 1982; Boyd, 1979). It is now assumed, at least by psychologists and linguists, that metaphors, and their close cousins, analogies, are important tools of cognition and communication, providing us with unfamiliar ways of conceptualizing familiar things, and familiar ways of conceptualizing unfamiliar things (Lakoff & Johnson, 1980; Ortony, 1979; Vosniadou & Ortony, in preparation). Yet, what is still assumed, rather than demonstrated, is that nonliteral uses of language are sometimes necessary for accomplishing such goals, rather than merely convenient or elegant ways of doing so. In this paper we present a sort of empirical existence proof that there are some things whose descriptions appear to invoke much more use of metaphorical language than others. This, while not establishing the necessity of metaphors, certainly is a first step.","In theory, there are at least three communicative functions that metaphor might serve(Ortony 1975). First, they might allow one to express that which is difficult or impossible to express if one is restricted to literal uses of language. Evidence for this \"inexpressibility\" claim would constitute encouraging support for the necessity-of-metaphors view. A second possible function of metaphors is that they may constitute a particularly compact means of communication. Although conscious experience is continuous in form, the linguistic system we use to talk about it is comprised of discrete elements (lexical items). Unlike more literal forms of language, metaphor may enable us to convey a great deal of information in a succinct manner by obviating the need to isolate the predicates to be expressed into their corresponding lexical representations. Finally, metaphors may help capture the vividness of phenomenal experience. If metaphors convey chunks of information rather than discrete units, they can paint a richer and more detailed picture of our subjective experience than might be expressed by literal language. This we call the \"'vividness\" claim.","In this paper we shall concentrate on the first and last of these possible functions. In order to do so, we need to examine a discourse domain for which a prima facie case can be made for supposing that literal language will often be inadequate and which lends itself to variations in vividness. There doubtless are many such domains. The one that we selected was that of internal states, in particular, emotional states. The literature on the linguistic expression of emotions suggests a relatively high incidence of figurative language use (e.g., Davitz, 1969), providing pragmatic reasons for believing that the context of (linguistic) emotional expression may be a profitable one within which to study metaphor production. Emotional states seemed well-suited for our purposes because they tend to have an elusive, transient quality that is difficult to describe using literal language, although, of course, they can usually be labeled using literal language. Thus, while it might be easy for a person to label an emotional state as, for example, \"fear,\" it is difficult to provide a literal description of the quality of some particular experience of fear. Furthermore, because emotions vary in intensity, one might expect differential levels of vividness.","There seem to be two possible ways in which people might try to communicate the quality of an emotional state. First, a speaker might use literal language to describe the events that triggered the emotional state and hope that the hearer correctly infers how he or she felt. For example, a person might describe the details of being mugged, hoping that a listener would recognize the emotional experience as the type one would have if one were attacked by a mugger. In such a case, the literal description would not describe the quality Of","lWinston Churchill once renmrked: \"How infinite is the debt owed to metaphors by politicians who want to speak strongly but are not sure what they are going to say\"! 181 the subjective state itself but would merely identify its eliciting conditions (Ortony, Clore & Collins, in preparation). Alternatively, a speaker might use a metaphor in an attempt to describe the quality of an emotional state. For example, one might say that one felt as though one's insides were a butter churn. Here, the metaphorical description does represent an attempt to characterize the quality of a subjective state.","Although we think that emotions constitute a good domain for studying metaphor production, it does not follow that the use of metaphorical description will be equally prevalent for different facets of emotions. Emotion theorists frequently attribute differential significance to the subjective experience of emotion (De Rivera, 1977) or to their associated actions or action tendencies (Frijda, in press). It may be that the subjective experience of an emotion can benefit more from a metaphorical description than the associated action or action tendency. Consider the subjective experience of some specific case of anger. The quality of such a subjective state cannot be publicly observed. In contrast, the actions to which an anger experience might give rise, for example, pounding one's fist on the table, are publicly observable. Thus, one might expect people to employ more metaphorical descriptions when trying to characterize the subjective experiential quality of emotional states than when trying to characterize the overt behaviors associated with such states. The intensity of emotions that might also be expected to influence the use of metaphorical language. It is possible that relatively mild emotional states are sufficiently unremarkable that speakers are more willing to settle for simply labeling them, whereas the vividness of intense emotional states might sometimes generate a more pressing need for detailed description.","To investigate some of these issues we ran a simple experiment in order to examine the production of metaphors during descriptions of emotional states and events. We predicted that people would be more likely to use metaphors and metaphorical comparisons when describing how they felt when they were experiencing an emotion than when describing what they did when they experienced it. We also thought it possible that more metaphorical language would be used in descriptions of intense as compared to mild emotional states. The two hypotheses combined could be construed as predicting an interaction of description type (feelings vs actions) and intensity, with the intensity factor having a greater effect on feeling descriptions than on action descriptions. Descriptions of feeling states, which may already make use of metaphorical language, may be especially likely to use metaphors when the states are intense. On the other hand, it could be argued that although intense emotions are more vivid than less intense ones, the associated actions do not necessarily enjoy a corresponding increase in vividness. This is admittedly a tenuous argument, so the prediction of an interaction between description type and intensity is made with less confidence than the predictions of main effects for these variables. Finally, in the experiment to test these hypotheses, the valence of the emotions was manipulated to determine whether this factor has any systematic effect on metaphor use.","Subjects were asked to describe either how they felt when they experienced certain emotions, or what they did when they experienced them. The emotions used included four positive ones (happiness, pride, gratitude, and relief) and four negative ones (sadness, fear, resentment, and shame). Note that the particular hypotheses to be tested do not depend in any important way on exactly which emotions are used. In addition to providing descriptions involving emotions of different valence, subjects were required to describe situations involving either very intense experiences of them or very mild ones.","Metaphors were identified in the transcripts of interview sessions. Protocols were scored in terms of idea units (Johnson, 1970) because metaphors are generally better conceptualized as single ideas than as individual words. Metaphor production was then measured in terms of the proportion of all distinct idea units that were metaphorical in nature. In other words, the measure of metaphor production was the ratio of metaphor types to the total number of idea unit types appearing in a protocol 2. A variety of considerations led us to operationalize metaphor production in this manner. We were concerned that possible systematic differences in the amount of verbal output produced during descriptions of the different emotion-inducing events might contaminate the","~3ther indices were also used, such as the absolute number of metaphor types and the proportion of the total number of idea units that were metaphorical. The choice of measure made little difference to the pattern of results 182 measure of metaphor production, such that high verbal output might lead to a high production of metaphor, and low verbal output might be associated with little metaphor use. If so, metaphor production would be a consequence of verbal output per se and this effect might conceal any differential use of metaphor during descriptions of feelings and actions. By looking at the ratio of metaphor types to the sum of both metaphorical and non-metaphorical idea units, the potential confounding of metaphor production and amount of linguistic output was partially avoided. A second concern was that subjects' tendency to repeat words and phrases during an oral account might artificially inflate the measurement if metaphorical tokens as opposed to types were used.","The results showed that a significantly greater proportion of metaphors occurred in descriptions of feeling states (17%) than in descriptions of actions (4%) 3 . Furthermore, the mean percentage of metaphor types used in descriptions of intense emotions (12%) was significandy greater than in descriptions of mild ones (9%). Two factors (intensity and valence) interacted with the type of description (feelings versus actions). First, there was a significandy greater increase in metaphor production when describing the feelings associated with intense emotions than when describing the actions associated with intense emotions. Second, although of less theoretical interest, while in the description of actions there was a tendency for more metaphors to be produced for negative than for positive emotions, this trend was reversed for descriptions of feelings. The patterns of these interactions are shown in the Tables below which show the percentage of idea unit types that were metaphor types. Description Type","Intensity Mild Intense Feelings 14.7 19.6 Actions 3.5 4.5","Valence Description Positive Negative Type Feelings 18.7 15.6 Actions 3.2 4.9","The results also revealed that there were eight times as many frozen, or dead, metaphors as there were novel ones. More interesting, however, is the fact the the ratio of novel to frozen metaphors was greater for intense emotions (12%) than for mild ones (8%), suggesting perhaps that when people are experiencing intense feeling states, they are more likely to generate striking and complex metaphors to explain how they feel. To the extent that novel metaphors are more metaphorical than frozen ones, and assuming that intense emotional states are more vivid than mild ones, this finding of more novel metaphors for intense emotions adds support to the vividness claim because it suggests a qualitative as well as quantitative increment in metaphor use.","To summarize, we have offered evidence that metaphorical language may make it possible for people to convey what would otherwise be difficult or impossible to express. This seems to be the case with the quality of unobservable internal states like emotions, as evidenced by our results showing the predominance of metaphorical language during descriptions of feeling states as opposed to actions, especially when those states are intense. So, for example, when one of our subjects reported that he felt like \"a storm was brewing inside,\" he succeeded in conveying a particular quality of his subjective experience that is richer, more vivid, and more specific than could have been conveyed had he merely labeled the experience as \"resentment.\" For the most part, the types of metaphors that people used to describe their emodons were figurative forms that have become conventionalized in the English language. When novel metaphors were used, they seemed to be particularly evident in descriptions of intense feeling states. Taken together, our results suggest that the inclination of psychologists and linguists to reject the classical Aristotelian view of metaphor as merely linguistic decoration, in favor of a view that accords it an indispensable communicative function is empirically, as well as theoretically, supportable. 3i.e., the percentage of metaphor types averaged across emotions and subjects. 183 References Boyd, R. (1979). Metaphor and"]},{"title":"theory","paragraphs":["change: What is \"metaphor\" a metaphor for? In A. Ortony (Ed.)"]},{"title":"Metaphor and thought.","paragraphs":["New York: Cambridge University Press. Davitz, J. R. (1969)."]},{"title":"The language of emotion.","paragraphs":["New York, N.Y.: Academic Press. De Rivera, J. (1977)."]},{"title":"A structural theory of the emotions.","paragraphs":["New York: International Universities Press. Frijda, N. (in press)."]},{"title":"The emotions.","paragraphs":["New York: Cambridge University Press. Gentner, D. (1982) Are scientific analogies metaphors? In D. Miall (Ed.),"]},{"title":"Metaphor: Problems and perspectives.","paragraphs":["Brighton, England: Harvester press. Johnson, R.E. (1970). Recall of prose as a function of the structural importance of the linguistic unit."]},{"title":"Journal of Verbal Learning and Verbal Behavior, 29,","paragraphs":["12-20. Lakoff, G. & Johnson, M. (1980)."]},{"title":"Metaphors we live by.","paragraphs":["Chicago: University of Chicago Press. Ortony, A. (1975). Why metaphors are necessary and not just nice."]},{"title":"Educational Theory, 25,","paragraphs":["45-53. Ortony, A. (Ed.). (1979)."]},{"title":"Metaphor and thought.","paragraphs":["New York: Cambridge University Press. Ortony, A., Clore, G. L. & Collins, A. (in preparation)."]},{"title":"Principia pathematica: Some cognitive foundations of the emotions.","paragraphs":["S. Vosniadou & A. Ortony (Eds.). (in preparation)."]},{"title":"Similarity and analogical reasoning.","paragraphs":["New York: Cambridge University Press. 184"]}]}