{"sections":[{"title":"","paragraphs":["Determiners, Entities, and Contexts Deborah A. Dahl Paoli Research Center","SDC/A Burroughs Company","P.O. Box 517 Paoli, PA 19301 ) 1. Introduction","I am concerned with the relationship between the forms of linguistic expressions, noun phrases in particular, and the discourse entities to which they refer, s That is, when does a noun phrase introduce a new referent into the discourse? My concern in particular is to specify the role that the discourse context plays in answering this question. A simple first approach to the relationship between noun phrases and discourse entities might suggest that definite noun phrases refer to entities which are assumed to be mutually known to the speaker and hearer, and indefinite noun phrases refer to entities which are not mutually known, and thus, that discourse context plays no role at all. This discussion will point out problems with this approach for both definite and indefinite noun phrases. I will describe examples where definite noun phrases are used to introduce new referents, and, conversely, where"]},{"title":"indefnite","paragraphs":["noun phrases do"]},{"title":"not","paragraphs":["introduce new referents. In the first case, the local focus structure provides a guide to recognising that a new entity is involved, and in the second case, the recognition that no new entity is introduced is based on the given/new status of propositions in the discourse.","I will begin by describing certain definite descriptions that introduce new entities. I will then describe some examples where indefinite descriptions do not introduce new entities. In each case, I dill discuss some related processing issues.","I will restrict the current discussion to deal with cases where the mutual knowledge is based on the discourse context, rather than on knowledge that the speaker and hearer bring to an interaction. In the canes of indefinltes, I will also restrict my discussion to sententlal contexts where an indefinite"]},{"title":"could","paragraphs":["introduce a new entity; in other words, to"]},{"title":"specific","paragraphs":["contexts, as distinguished from non-specific contexts as discussed in ~rince1981]. 2. Implicit Associates","The case of definite noun phrases that are intended to introduce new discourse entities has been relatively well-researched, in particular by~awkins1978, Hawkins1984] Hawkins points out that entities that have a slot/frame relationship with previously introduced entities often have a definite determiner. For example, in (1) There were loud noises com;,g from a starting sir compressor. The drive shaft was sheared. it is possible to refer to the drive shaft with a definite noun phrase because of its relationship with the previously mentioned starting slr compressor, even though the drive shaft has not been mentioned. This same relationship is described by ~rince1981] as"]},{"title":"in/errable,","paragraphs":["and is also discussed in ~Ieim1982]. Because we understand the drive shaft mentioned in {1)to be not just any drive shaft but the drive shaft that is part of the air compressor mentioned in the previous sentence, a full understanding of this noun phrase must capture this relationship. The new noun phrase is"]},{"title":"imp]ielt[¥ associated","paragraphs":["with the"]},{"title":"local/oeus","paragraphs":["as described in ~)ahI1986], and[Sidner1979].","s The research described in this paper was supported in part by DARPA under contract N000014-85-C-0012, administered by the Office of Naval Research, and by • post-doct~rsd fellowship in Copitive Science from the Sloan Foundstion. I have received helpful comments on this paper from John Dowdinc, Lynette Hirechman, Marci• Linebarger, Marth• Palmer, Rebecc• SchiS'man, and Bonnie Webber. October 1, 1986 154 In (2d), for example, the referent for the paper seems to be the paper associated with the new package even though there is a previously mentioned entity which matches the noun phrase; that is, the paper in (2b). (2) a. A package arrived yesterday.","b. The wrapping paper was beautiful.","c. ~Tnlle I was admiring it, another package arrived.","d. I removed the paper.","After the focus change to mlr pae]:age, the associates of the new package seem to he preferred as referents over previously mentioned items, even if the old items had been in focus at one time. This is consistent with Sidner's algorithm. ~ 3. Spec|F;c Attr;butlves The second main point to be dealt with in this paper is that of indefinite noun phrases in specific contexts, which nevertheless fall to introduce new discourse entities. Most of those who have discussed indefinites seem to have assumed that an indefinite reference in a specific context invariably introduces a new discourse entity. This includes the discussions in ~-[.Clark1977] and ~-[e[m1982]. However, there is a class of indef;nites, which I have called speclJ~c a~trlbu~iees ~Dah11984~, which I claim do not have this function. Consider the example,","(3) a. Dr. Smith told me that exercise helps. h. Since I heard it from a doctor, I'm inclined to believe it. An entity, Dr. Smith, is introduced in (3a), and an indefinite noun phrase, a doctor, is used in (3b). It is clear that this noun phrase is not intended to introduce a second doctor into the discuss;on. This is an example of a spec~j~c attrlbut~ee. I use the term speeij~c in the sense that a specific reference means that the speaker has a particular individual in mind when s/he uses the indefinite description. It is clear in (3), for example, that the speaker did not hear that exercise helps from some unspecified doctor, but from Dr. Smith.","The term a~trlbu~iee, as used by ~Donnellan1971], can also be applied to these indefinites, although it was originally suggested only for definites, because the specific identity of Dr. Smith is not relevant to the predication, only Dr. Smith's attribute of being a doctor. (See~Dahl1984 .] for detailed arguments about the applicabll[ty of this term.)","There are tw~ important issues that must be dealt with in a treatment of specific attributives. First, there is the issue of recognizing that the noun phrase in fact is not being used to introduce a new entity. Second, it is necessary to recognize the speaker's purpose in using an indefinite noun phrase, when a definite noun phrase would have been possible. Both of these issues have implications for language generation as well as understanding. For example, in the first case a ]~nguage generator w~ have to decide when it is possible to use a specific attributive, and in the second case, it wall have to decide whether a specific attributive would be useful in accomplls}~ug its communicative goals.","I have previously suggested ~Dsb11984~hat a specific attributive can be recognized by its occurrence in a proposition that is glwen as in (3), is related to a given proposition by simple entailment as in (4), or is related to a given proposition by a plausible inference, as in (5). (4) Mary and Bill both volunteered to walk the dog. Since at least one pcrsoft is"]},{"title":"wi]l~g","paragraphs":["to walk the dog, we don't have a problem.","SA discussion by [Heim19821 suggests that introduction of a new entity with a definite noun phrase is a violation of a felicity condition, and is therefore to be handled by a repair or accomodation mechanism. Since accommodation mechanisms are typically triggered by the failure of normal processing, Heim's approach suggests that a failure of normal proceesing would have to occur before • system could recopise that • new referent was being introduced. If normal proee..i.g means searching through the discourse context for a referent matching the new description, then the example in (2) provides evidence against this position, since the correct processing cannot have been invoked by the failure to find a match-in• referent in the previous discourse. October 1, 1986 155","(5) A: I'm afraid I miscalculated Jones's insulin dosage. B: What happened? A: IIe died. B: So, a"]},{"title":"patient","paragraphs":["has finally died due to your carelessness. (inference 'Jones is a patient')","Thus, in order to determine when an indefinite introduces a new entity, it is necessary to know whether the proposition in which it occurs is f~ven or nero. For this, we need a representstion of the events and situations described in the discourse, which can then be examined in order to determine when a proposition is given or new. Such a representation, of course, will be needed in any case for pronouns or full noun phrases that refer to events and situations. For example, in the PUNDIT text processing system, (described in ~a~ner1986] ), a representation is built for each event or situation mentioned. A'noun phrase like the"]},{"title":"failure in","paragraphs":["(6) or it in (7) can then he recognized as a reference to something previously mentioned. (6) The starting air compressor fal]ed when the oll pressure dropped below 60 psig."]},{"title":"The failure","paragraphs":["occurred during the engine start.","(7) The starting air compressor failed when the oil pressure dropped below 60 psig. I~ occurred during the engine start. The difference in processing between (6) and (7) on the one hand and specific attributives on the other is that for the specific attributives we are saying that something analogous to reference resolution should be performed on clauses, as we]] as on noun phrases. That is, we want to ask whether th;~ event has been mentioned before, or can be inferred from something that has been mentioned. If so, we can match corresponding participants so that it is possible to recognize that no new entity is being introduced, s","The second issue raised by specific attributives is the speaker's purp()se in selecting an indefinite when a definite would have been possible. This seems to he related to the use of indefin|tes in genera] to serve to deemphaslze the particular individual referred to whUe emphasizing its genera] class. In (3), for example, it is not the fact that ~}~im doctor told me that exercise would help that is relevant, but rather that the person has the property of being a doctor. Notice the"]},{"title":"contrast between (3)","paragraphs":["and"]},{"title":"(8).","paragraphs":["(8) a. Dr. Smith told me that exercise helps. h. Since I did hear it from the doctor I'm inclined to believe it. (8) suggests that there is something special about Dr. Smith in particular that makes this advice reliable, while (3) does not.","To sum up, I have discussed two categories of noun phrases which demonstrate the effects of discourse context on determining whether a new entity is introduced. Implicit associate definites introduce new entities which are related to the local focus. Specific attributives refer to prevlous]y introduced entities in given propositions. Minimally, specific attributes have to be recognized, in order to prevent the creation of an extra discourse entity, and this requires a representation of given propositions. In addition, a complete understanding of specific attributes requires a recognition of the speaker's reason for choosing an indefinite when a definite would have been possible."]},{"title":"References ~ah]1984~.'~","paragraphs":["Deborah A. Dahl, The Rise of Shared Knowledge."]},{"title":"Penn Review o/Lingulatlcs","paragraphs":["8, 1984, pp. 1-14.","8This raises the issue of what discourse Zosds would be served by repeating something that is already liven. There s~e probably a number of' reuons to do this. Investiz~ing them would be u interesting topic for future reselrch. October 1, 1986 156"]},{"title":"~Dah11984 k~ Deborah A. Dahl, Recognizing Specific Attributives, presented ath the 59th Annual Meeting of the Linguistic Society of America, Baltimore, 1984. ~1988] Deborah A. Dahl, Focusing and Reference Resolution in PUNDIT, Presented at AAAI, Philadelphia, PA, 1986. ~onneUan1971] Keith Donnel]an, Reference and Definite Descriptions. In Semantlem, D~D. Steinberg and L.A. Jakobovits (ed.), Cambridge University Press, Cambridge, 1971. ~-I.Clark1977] Herbert H.Clark and Eve H.Clark, . In P, ychology ar, I Language, Harcourt, Brace, Jovanovich, New York, 1977. [Hawklns1978] John A. Hawkins, Definiteness and IndeJ/n~feneu. Humanities Press, Atlantic Highlands, New Jersey, 1978. ~-Iawkins1984] John A. Hawkins, A Note on Referent Identifiability and Co-Presence. Journn/ o/ Pragmat~ea, 1984. [Heim1982] Irene R. Helm, The ..ecmant~es o~ Dej~nlte and lnde.~n~te Noun Phrases. Unpublished Ph.D. dissertation, University of Massachusetts, Amherst, ]V~, September 1982. [P*Imer1988] ]V~artha S. Palmer, Deborah ~ Dahl, Rebecca J. SchiEman, Lynette Hirscbman, 1VIarcia Linebarger, and John Dowding, Recovering Implicit Information, to be presented at the 24th Annual Meeting of the Association for Computational Linguistics, Columbia University, New York, August 1986. ~rince1981] Ellen F. Prince, Toward a Taxonomy of Given-New Information. In Radical Pragmaties, Peter Cole (ed.), Academic Press, New York, 1981. [SidnerI979] Candace Lee Sidner, Towards a Computational Theory of Definite Anaphora Comprehension in English Discourse, MIT-AI TR-537, Cambridge, I~L~, 1979. October 1, 1986 157","paragraphs":[]}]}