{"sections":[{"title":"Data-Driven and Ontological Analysis of FrameNet for Natural Language Reasoning Ekaterina Ovchinnikova","paragraphs":["1"]},{"title":", Laure Vieu","paragraphs":["2,3"]},{"title":", Alessandro Oltramari","paragraphs":["2"]},{"title":", Stefano Borgo","paragraphs":["2"]},{"title":", Theodore Alexandrov","paragraphs":["4","1","University of Osnabrück, 2 LOA-ISTC-CNR Trento, 3","IRIT-CNRS Toulouse,4","University of Bremen","1","eovchinn@uos.de, 2 lastname@loa-cnr.it, 3","vieu@irit.fr, 4","theodore@math.uni-bremen.de","Abstract This paper focuses on the improvement of the conceptual structure of FrameNet for the sake of applying this resource to knowledge-intensive NLP tasks requiring reasoning, such as question answering, information extraction etc. Ontological analysis supported by data-driven methods is used for axiomatizing, enriching and cleaning up frame relations. The impact of the achieved axiomatization is investigated on recognizing textual entailment."]},{"title":"1. Introduction","paragraphs":["In recent years, NLP research has shown that semantic knowledge plays an important role in solving tasks which require reasoning, such as question answering, information extraction etc. Much attention has been paid to the representation of lexical meaning and the development of lexical-semantic resources. Two of these resources, namely WordNet (Fellbaum, 1998) and FrameNet (Ruppenhofer et al., 2006), have been especially successfully involved in various NLP systems. FrameNet (FN) has a shorter history in NLP applications than WordNet, but lately more and more researchers demonstrate its potential to improve the quality of question answering (Shen and Lapata, 2007) and recognizing textual entailment (Burchardt et al., 2009). However, the resource still has several considerable shortcomings. In previous studies it was found that low coverage of the current version of FN makes its successful application to the real textual data difficult (Shen and Lapata, 2007; Cao et al., 2008). Several researches have worked on extending the lexicon of FN by using WordNet (Burchardt et al., 2005) as well as different distributional methods (Cao et al., 2008). We want to make a further step in the direction of improving FN1","and take a look at the conceptual structure of the resource. In this paper we show that in addition to coverage incompleteness, FN suffers from conceptual inconsistency and lacks axiomatization which can prevent appropriate inferences. For the sake of discovering and classifying conceptual problems in FN we investigate the FrameNet-Annotated corpus for Textual Entailment, FATE (Burchardt and Pennacchiotti, 2008). Then we propose a methodology for improving the conceptual organization of FN. The main issue we focus on in our study is axiomatization and restructuring of the frame relations in FN. The methodology is based on ontological analysis which presupposes studying frames on the basis of formal principles and ontological relations like dependence, part-of, participation, etc. and possibly linking frames with categories in a formal ontology. The benefits of using ontological principles for constraining computational lexical resources 1 In this paper we explore the English FrameNet release 1.3. have been demonstrated in the literature, see e.g. (Prevot et al., 2009). For our purposes we use DOLCE (Masolo et al., 2003), the ontology which has been successfully applied for achieving a formal specification of WordNet (Oltramari et al., 2002). For supporting ontological choices we apply a data-driven analysis of similarity between frames. Indeed, the proposed methodology for the improvement of the resource basically consists of the following steps:","1. discovering and classifying conceptual problems in FN through investigating the FATE corpus; 2. clustering frames for","• identifying those frames which concern related concepts in order to make ontological analysis easier by focusing on specific domains of FN and • discovering missing frame relations; 3. performing ontological analysis which implies","• the clarification of the ontological status of frames (linking frames with DOLCE),","• a study of the frame relations, fostering their axiomatization;","4. checking whether the improved relational structure of FN gives advantages with regard to recognizing textual entailment. The paper is organized as follows: We first introduce FN and give a short overview of the main approach using the resource for reasoning (section 2.). In section 3. we investigate the conceptual problems in FN. Sections 4. and 5. describe data-driven and ontological analysis of frames and frame relations. Section 6. provides a methodology for cleaning up frame relations and a case study aiming at investigating the impact of the cleaned up relational network on recognizing textual entailment. The last section concludes the paper."]},{"title":"3157 2. FrameNet for Reasoning","paragraphs":["FrameNet is based on frame semantics (Ruppenhofer et al., 2006). The lexical meaning of predicates in FN is represented in terms of frames which describe prototypical situations spoken about in natural language. Every frame contains a set of roles (or frame elements, FEs) corresponding to the participants of the described situation. Predicates with similar semantics are assigned to the same frame, e.g. both give and hand over refer to the GIVING frame. Additionally, semantic relations such as inheritance, causation or precedence, are defined on frames, e.g. the KILLING and DEATH frames are connected with the causation relation. FEs of the connected frames are also linked, e.g. VICTIM in KILLING is linked with PROTAGONIST in DEATH. Frames are subdivided into lexical and non-lexical. Whereas lexical frames are based on linguistic evidence2",", non-lexical frames and frame relations represent an attempt to create a conceptual structure which is intended for enabling an analysis of paraphrases as well as providing a basis for inference. The previous attempts of using FN for reasoning mostly consider the paraphrasing task which consists in matching FN-annotated text fragments. Such matching becomes nontrivial if the text fragments are annotated with different frames. Considering the example below, in order to match at least 11 people in (b) with Humans in (a) and in an avalanche in (b) with An avalanche in (a) one needs to use the semantic relation between KILLING and DEATH.3 (a) [An avalanche]CAUSE has struck a popular skiing resort in Austria, [killing]KILLING [at least 11 people]VICTIM. (b) [Humans]PROTAGONIST [died]DEATH [in an avalanche]CAUSE.4 Following the strategy sketched above Shen and Lapata (2007) make use of the inheritance relation in FN for question answering. Scheffczyk et al. (2006) propose a reasoning procedure involving all types of FN relations."]},{"title":"3. Conceptual Problems in FrameNet","paragraphs":["For finding conceptual problems in FN we have investigated the FN-Annotated corpus for Textual Entailment, FATE (Burchardt and Pennacchiotti, 2008), manually annotated with frame and role labels. It consists of the 800 (T, H) entailment pairs. We have analyzed the cases when T was known to entail H (400 pairs) aiming to find out whether the matching strategy as described in section 2. is sufficient for establishing entailment. In 170 cases direct matching was possible. For 131 pairs this approach does not work because of a) annotation problems, such as mismatch in role assignment and missing annotation; b) different conceptualizations of T and H resulting in different, semantically","2","For most of the lexical frames FN provides annotated examples from the British National Corpus.","3","In this paper we ignore aspects related to matching FEs which have different lexical and syntactic realization. In applications the reader will find several solutions, such as using WordNet, extract-ing syntactic heads or using statistical similarity measures.","4","In the framework of FN a predicate in a predicate-argument construction is annotated with a frame name (e.g. KILLING, DEATH) and other elements are annotated with some FEs of that frame (e.g. CAUSE, VICTIM, PROTAGONIST). unrelated, framings. For 99 pairs the same facts in T and H were represented by different frames which are related semantically and could be mapped on each other with the help of reasoning. FN relations enable correct inferences only for 17 such pairs. In the following we categorize the problems discovered in the remaining 82 pairs. 3.1. Incompleteness of the Frame Relations Some frames which are currently not linked in FN suggest themselves to be mapped on each other. In the example below, the frames SURVIVING and RECOVERY are not connected in FN. (t) ...[people]SURVIVOR who [survive]SURVIVING [Sars]DANGEROUS SITUATION ... (h) [Those]PATIENT who [recovered]RECOVERY [from Sars]AFFLICTION ... Such FEs as PLACE, TIME, CAUSE, are parts of many frames, and linguistically often correspond to modifiers (e.g., adjectival or adverbial phrases). However, the description of temporal, spatial and other features of an event can also be the primary object of a sentence, giving rise to “attribute frames”. In (h) of the example below the location China is annotated with the BEING LOCATED frame, while in (t) it fills the PLACE role of the BUSINESS frame. For resolving such cases one needs to have links between general “at-tribute frames” and some of the FEs of specific frames. (t) ... [First Automotive Works [Group]BUSINESS] BUSINESS NAME, [China’s]PLACE vehicle maker... (h) [First Automotive Works Group]THEME is [based]BEING LOCATED [in China]LOCATION. 3.2. Problems in the Inheritance Structure The inheritance relation in the taxonomy presupposes that everything which is true about the semantics of the “parent” is also true for all its “children”. In FN inheritance concerns FEs, semantic restrictions on the FEs and relations to other frames. Thus, conceptual mistakes in the frame taxonomy may cause important reasoning problems. The sentence below is annotated in FATE with PART WHOLE which inherits from PART PIECE in FN. The role WHOLE in PART WHOLE in related to SUBSTANCE in PART PIECE. Thus, fillers of WHOLE are also substances. This inference enables an ontologically wrong conclusion about Aceh province being a substance. Many [[parts]PART]PART WHOLE [of tsunami-battered Aceh province]WHOLE were not safe... 3.3. Lack of Axiomatization Since the FN relations are not axiomatized, many logical inferences are impossible. Considering the example below, the FEs of SUSPICION in (h) can be correctly mapped onto the FEs of NOTIFICATION OF CHARGES in (t) via the following path in FN: NOTIFICATION OF CHARGES subframe of ARRAIGNMENT subframe of CRIMINAL PROCESS is preceded by CRIMINAL INVESTIGATION is used by SUSPICION.5 However, this path does not guarantee the entailment. For enabling the desired conclusion one should provide axiomatization of the precedence and subframe relations and replace is used by with an axiomatized dependency relation. 5 The descriptions of FN relations can be found in section 5."]},{"title":"3158","paragraphs":["(t) [Three leaders ...]ACCUSED were [charged]NOTIFICATION OF CHARGES [with illegally diverting money to their organization]CHARGES ... (h) [Three leaders ...]SUSPECT are [suspected]SUSPICION [of stealing money]INCIDENT."]},{"title":"4. Data-Driven Analysis","paragraphs":["As we have seen in the previous section, many useful relations between frames are not captured in the current version of FN. This section proposes a methodology for detecting clusters of frames which are likely to be semantically related. If two frames occur in the same cluster and the corresponding frame relation is missing in FN then we propose to add it. Moreover, clusters are used for identifying those frames which concern related concepts. Given frame clusters, the FN engineer can proceed with cleaning-up by focusing on specific domains of FN step-by-step rather than being encountered with the whole range of frames and relations at once. Frame relatedness measures have been extensively investigated in (Pennacchiotti and Wirdth, 2009) We have based our clustering on two of these measures described below.6 1. Overlapping frame elements Frames sharing more than n infrequent7","frame elements are considered to be semantically related and belong to the same cluster. The best result was achieved with n = 2. The algorithm produced 228 clusters suggesting 1497 relations not contained in the current version of FN. 100 randomly selected clusters were investigated manually by two experts which have reported that 73 clusters contain semantically related frames with the overall agreement of 0.85. 2. Co-occurrence of lexemes evoking frames in corpora Frequently co-occurring frames are supposed to be semantically related. Given two frames f1 and f2 the measure of their co-occurrence in a corpus C is estimated as the pointwise mutual information (pmi): pmi(f1, f2) = log2","|Cf 1,f","2|","|Cf 1||Cf","2| , where Cfi is the set of contexts in which fi occurs and Cf1,f2 is the set of contexts in which f1 and f2 co-occur. Sentences from a newspaper corpus (Guardian, 2 600 000 sentences) have been used as contexts. A frame f belongs to a cluster if for all fi in this cluster pmi(f, fi) is above a threshold t. The best result was achieved with t = −17 (−26 < pmi < −8). The algorithm produced 113 clusters suggesting 1149 relations not contained in the current version of FN. 100 randomly selected clusters were investigated manually by two experts which have reported that 65 clusters contain semantically related frames with the overall agreement of 0.85. Note that the obtained clusters are non-standard, because a frame can belong to more than one cluster. Moreover, there are frames not belonging to any cluster. These features correspond to the semantic nature of frames which can both 6 Obtained frame clusters are available online at","http://www.cogsci.uni-osnabrueck.de/","∼eovchinn/FNClusters 7 occurring less frequently than average belong to different conceptual scenarios or be conceptually isolated."]},{"title":"5. Ontological Analysis","paragraphs":["In order to axiomatize relations defined on FN frames, one needs first to understand what the frames describe, i.e. what the frame relations actually relate. Frames abstract from a special kind of natural language (NL) expressions, namely from predicates with their arguments in the sense of linguistic semantics.8","NL expressions refer to situations in a world. The term situation is borrowed from Situation Theory: “The world consists not just of objects, or of objects, properties and relations, but of objects having properties and standing in relations to one another. And there are parts of the world, clearly recognized (although not precisely individuated) in common sense and human language. These parts of the world are called situations.” (Barwise and Perry, 1980) Thus, frames abstracting from NL expressions describe types of situations. Therefore we analyze and decompose frames in terms of situations and their parts which can be described by NL predicate-argument constructions. In order to characterize situations corresponding to frames we employ categories elaborated in the framework of the Descriptive Ontology for Linguistic and Cognitive Engineering, DOLCE (Masolo et al., 2003), the ontology which has been designed for capturing the ontological categories underlying natural language and human commonsense and successfully applied for achieving a formal specification of WordNet (Oltramari et al., 2002). The most important DOLCE categories which we refer to in this paper are perdurant, endurant and quality.9","The distinction between perdurants and endurants, or, in other words, between events and objects, is related to their behavior in time. At any time an endurant is present, all parts of the endurant are present too. Perdurants are only partially present at every time moment, i.e. some of their temporal parts (their previous or future phases) may be not present. For example, if somebody reads a book then the book is wholly present at a given time during reading, while some temporal parts of the reading are not. The main relation between endurants and perdurants is that of participation: an endurant exists in time by participating in some perdurant. Qualities are entities which can be perceived or measured: shapes, sounds, weights etc. They refer to features of specific entities and exist as long as these entities exist. DOLCE distinguishes between a quality (e.g., the color of a specific rose), and its value (e.g., a particular shade of red). Barwise and Perry’s situations are event-like entities10","so 8","We mean phrases and clauses here. There is no frame abstracting from a complex sentence like John went to the bank and Bill stayed at home, but there are frames abstracting from adjective phrases like the young man. 9","For more details see (Masolo et al., 2003). 10","Here “event” has a large acceptation including stative perdurants. It has been considered that Barwise and Perry’s situations are akin to Kim’s events, Kim’s theory yielding a much wider view on events than Davidson’s (Pianesi and Varzi, 2000)."]},{"title":"3159","paragraphs":["it seems natural to consider frames as denoting types of perdurants. More precisely, frames would denote sets of perdurants, formalizing frames as unary predicates taking situations as arguments. As in all theories of events, perdurants in DOLCE happen in time, and this feature is clearly present in many frames. However, for some other frames this is less clear. For instance, some frames are triggered by nouns denoting the category of an endurant, e.g., PEOPLE (a man), and it is rather debatable that a situation like John being a man is located in time. Other frames describe relations between perdurants, e.g., RELATIVE TIME (my birthday preceded Lea’s arrival), which the large majority of authors would be reluctant to consider some sort of “higher-order” perdurant, as explained in (Pianesi and Varzi, 2000). In fact, in FN, such frames are never involved in temporal frame relations like precedence or causation which instead freely apply to frames clearly describing perdurants. Thus it is safer to assume that the “situations” used in FN denote types of perdurants or facts, the latter being a category of abstract entities, present in DOLCE but not yet really analyzed.11","Some frames seem to denote only perdurant types, others only fact types, and yet others would seem to group together situations of both sorts. For example, RECIPRO-CALITY is a very general frame describing a symmetrical relationship. It can refer to an event like chatting and to a relation like being similar. Based on the categories described above we define the following main types of situations which can be used for classifying most of the FN frames:","1. “Event” situation: a perdurant with its participants, e.g. the SELF MOTION frame (John runs in the park)","2. “Object” situation: a fact that an endurant has some non-temporal property, for instance the property of being of a given category, e.g., PEOPLE (a man)","3. “Quality” situation: a perdurant or a fact involving the attribution of a temporal or non-temporal quality to an endurant or a perdurant, e.g. COLOR (This rose is red, perdurant), TAKING TIME (The war lasted four years, fact)","4. “Relation” situation: a perdurant or a fact involving a relation between endurants and/or perdurants, e.g. PART WHOLE (This park is a part of the town, fact), LOCATIVE RELATION (Lea is next to John, perdurant), RELATIVE TIME (my birthday preceded Lea’s arrival, fact) The content of frames as well as frame relations can be specified in a logical form. In the following we analyze frame relations which currently are present in FN, characterize them in terms of axioms and define constraints on them. Before doing so we introduce several basic temporal relations between perdurants which underly the axiomatization of some frame relations. As already mentioned be-fore, perdurants exist in time, i.e. they have temporal qualities whose values are temporal intervals having a starting 11 Future work on facts is clearly needed, and such work is ex-","pected to enrich the present analysis of situations in FN. (start(p)) and an ending (end(p)) time point. Given two perdurants p1 and p212","• starts before(p1, p2) ↔ start(p1) < start(p2),","• temp precedes(p1, p2) ↔ end (p1) ≤ start(p2),","• temp includes(p1, p2) ↔ (start(p1) ≤ start(p2) ∧ end (p1) ≥ end (p2)),","• strict temp inc(p1, p2) ↔ (temp includes(p1, p2) ∧ (start(p1) ̸= start(p2) ∨ end (p2) ̸= end (p1))). Now let us turn to characterizing the sort of axioms represented by FN relations. For a frame f being instantiated by a situation s we will write f (s) specifying to which ontological type s belongs if needed. Inheritance The inheritance relation in FN is claimed to be similar to the ontological relation is-a. Informally speaking, “any-thing which is strictly true about the semantics of the Parent must correspond to an equally or more specific fact about the Child” (Ruppenhofer et al., 2006). It concerns FEs, semantic restrictions on the FEs and relations to other frames. As usual, in logical terms, f1 inherits f2 corresponds to the following axiom: ∀s(f1(s) → f2(s)). Perspective COMMERCE BUY and COMMERCE SELL are two perspectives of the COMMERCE GOODS TRANSFER frame. The use of the perspective relation “indicates the presence of at least two different points-of-view that can be taken on the Neutral frame” (Ruppenhofer et al., 2006). This relation is useful for reasoning, since some paraphrases can be analyzed in terms of perspectives. For example, John sold a book to Mary describes the same situation as Mary bought a book from John. Perspectives refer to the same situation. Therefore f1 is a perspective of f2 represents the following axiom: ∀s(f1(s) ↔ f2(s)).13 Subframe Some frames in FN are complex and refer to sequences of situations which can themselves be separately described as frames. The complex frame is connected to its components via the subframe relation. For example, COMMITTING CRIME, CRIMINAL INVESTIGATION and CRIMINAL PROCESS are subframes of CRIME SCENARIO. The subframe relation embodies axioms involving the ontological parthood between the situations or elements involved in 12 Hereafter we use fi for frame names, and the sorted variables","s, si for situations, p, pi for perdurants and en, eni for endurants. 13 This axiom does not grasp the asymmetric character of the","relation between a perspectivized and a neutral frame."]},{"title":"3160","paragraphs":["the situations denoted by the two frames. In the overwhelming majority of cases the subframe relation is defined in FN on frames referring to the situations of the type “Event”. In small number of cases it is defined on frames referring to “Objects”. These two cases need to be distinguished because for “event”-situations the parthood relation applies to the situations themselves, i.e., perdurants, while for “object”-situations the parthood relation mainly applies to the endurants involved in the situations. More-over, the quantifications involved in the axioms don’t fol-low a unique pattern: there is a difference between the cases when the whole presupposes the existence of a part and when the part presupposes the existence of the whole. Accordingly, we split f1 is a subframe of f2 into 4 axiom patterns as follows. 1. Subframe of “Events” The predicate sub ev is used here for temporal proper parthood between perdurants.14","We make use of the following theorem about parthood on perdurants. ∀p1p2(sub ev (p1, p2) → (strict temp inc(p2, p1) ∧ spatially includes(p2, p1))) (a) the part presupposes the existence of the whole ∀p1(f1(p1) → ∃p2(f2(p2) ∧ sub ev (p1, p2))) For example, EMPLOYMENT END (f1) presupposes EMPLOYMENT SCENARIO (f2), but not vice versa. Thus, if one stops to be employed at X (he/she quites or is fired) then naturally one has been employed at X. On the other hand, being employed does not necessarily presuppose quitting. (b) the whole presupposes the existence of a part ∀p2(f2(p2) → ∃p1(f1(p1) ∧ sub ev(p1, p2))) For example, GETTING SCENARIO presupposes PRE GETTING (possession phase), but not vice versa. X getting Z from Y presuppose Y having Z. Obviously, if Y has Z it does not mean that he/she will give it to X. 2. Subframe of “Objects” The predicate part of is used here for proper parthood between endurants (which, again, can be easily defined in DOLCE). The predicate sub obj is used for proper parthood between facts about endurants (not analyzed in DOLCE). (a) the part presupposes the existence of the whole ∀s1en1((f1(s1) ∧ FE 1(s1, en1)) → ∃s2en2(f2(s2) ∧ FE 2(s2, en2) ∧ part of (en1, en2) ∧ sub obj (s1, s2))) 14","This relation can be defined on the basis of the DOLCE parthood relation P . In this paper we don’t reproduce the axiomatization of P, the details can be found in (Masolo et al., 2003). where FE 1 and FE 2 stand for the frame elements names describing the main objects 15","of these two “Object-situation” frames. For example, BUILDING SUBPARTS presupposes BUILDINGS (e.g. part of (room, building)). Thus, reading the sentence Mary left the room we can infer that this room is a part of some building.","(b) the whole presupposes the existence of a part ∀s2en2((f2(en2) ∧ FE 2(s2, en2)) → ∃s1en1(f1(en1) ∧ FE 1(s1, en1) ∧ part of (en1, en2) ∧ sub obj (s1, s2))) There is no example for this kind of relation in the current version of FN. However, e.g. the frames ARCHITECTURAL PART and BUILDINGS could be associated in this way (e.g. part of (f loor, house)). Precedence The precedence relation characterizes the temporal order on sequences of situations, and therefore applies only to frames instantiated by perdurants. For example, FALL ASLEEP precedes BEING AWAKE in the SLEEP WAKE CYCLE scenario. In most FN uses of this relation, the existence of the later situation presupposes that the preceding situation has taken place. However, the opposite also occurs, for example GET A JOB presupposes BEING EMPLOYED AFTERWARDS. Precedence naturally in-volves temporal relations. Therefore it can be instantiated only by perdurants (e.g., situations of the type “Event”). The axioms that relations f1 precedes f2 represent have the following form. 1. a situation presupposes an antecedent situation ∀p2(f2(p2) → ∃p1(f1(p1) ∧ temp precedes(p1, p2))) 2. a situation presupposes a following situation ∀p1(f1(p1) → ∃p2(f2(p2) ∧ temp precedes(p1, p2))) Causation The causative relations ‘causative of’ and ‘inchoative of’ capture relationships between frames instantiated by perdurants, mostly of the type “Event”. For example, the KILLING and the DEATH frames are connected via the causative of relation. The effect situation is always presupposed by its cause. Thus, f1 is causative of f2 and f1 is inchoative of f2 correspond to axioms of a unique form: ∀p1(f1(p1) → ∃p2(f2(p2) ∧ causes(p1, p2))). At the moment DOLCE does not have an appropriate causation theory on its disposal. This is a matter of further in-vestigation. In this paper we assume a very simplified causation theory: causes(p1, p2) → ¬(starts before(p2, p1)). There are cases when relations between frames characterize a typical relationship rather than a (necessary) generic dependence as above. For example, a state “being recovered” 15 Evoking both frames and corresponding frame elements, e.g.","the PERSON FE in the PEOPLE frame."]},{"title":"3161","paragraphs":["is necessary preceded by “having a disease”, while “being cured” only typically causes “being recovered”. Therefore we suggest to introduce a “weak” variant of every frame relation (except inheritance and perspective) using non-monotonic implication. This is left for the future as the logic used by DOLCE does not include non-monotonic consequence. Using The “using” relation in FN represents a very general kind of link. It is mostly used in the cases in which “a part of the scene evoked by the Child refers to the Parent frame” (Ruppenhofer et al., 2006). For example, OPERATE VEHICLE uses MOTION. We have analyzed the pairs of frames connected via “using” in FN and came to the conclusion that in most of the cases “using” can be substituted by some of the relations defined above (including their “weak” variants). Otherwise, it stands for general dependence axioms of the following form, where the predicate depends denotes specific individual dependence (see (Masolo et al., 2003)). ∀s1(f1(s1) → ∃s2(f2(s2) ∧ depends(s1, s2))) Frame relations imply more than the axioms above which only express constraints on the situations instantiating them. When two situations actually instantiate a specific link between frames, e.g., for the causative of relation, when two specific situations are related by the causes predicate, in addition, FE mappings provide information about identical entities which are elements of the both situations. So, if frame f1 is related to frame f2 with a relation, then, in addition to the axioms above, we have a series of axioms of the form:","∀s1s2((f1(s1) ∧ f2(s2)) → (rel(s1, s2) ↔ ∀x(FE 1(s1, x) ↔ FE 2(s2, x)))), where the frame element FE 1 in f1 is mapped to the frame element FE 2 in f2, and where rel stands for the predicate associated with the frame relation, i.e., causes for causation relations, sub ev for subframe of event relations, etc.16 On the one hand, this axiom guarantees that given a text fragment annotated with f1, if there is a relation connect-ing f1 to f2, we can correctly annotate the corresponding frame elements in f2. For example, given a sentence An avalanche killed John we can prove John died. On the other hand, given a text fragment annotated with f1 and f2, related in FN by some frame relation, and such that all mapped FEs in f1 and f2 annotate the same linguistic refer-ents, we can infer a relation (causes, sub ev etc) between the corresponding situations. For example, given a sentence An avalanche killed John and he died we can infer the causation relation between the killing and death events which will not be inferred in the case of An avalanche killed John and Mary died.17","16","For the inheritance and perspective relations rel(s1, s2) should be replaced with true.","17","Obviously, such inferences may produce mistakes by connecting unrelated events. However, introducing these links may be useful in practice for inferring discourse relations. In order to avoid possible inference mistakes one can replace equivalence with implication in the axiom under consideration."]},{"title":"6. Cleaning up frame relations 6.1. Constraints for cleaning up frame relations","paragraphs":["Proceeding from understanding of frames and frame relations presented in the previous section we propose the following constraints for cleaning up frame relations. Given two frames f1 and f2 connected with a relation r 1. define the types of situations that instantiate f1 and f2,","2. if r is a temporal relation (causation or precedence) make sure that both f1 and f2 refer to perdurant situations types, 3. define whether r has a necessary or a typical character,","4. check whether the axioms listed in the previous section apply to all instantiations of f1 and f2. For example, let us consider the semantic relation between the frames BIRTH referring to situations of the type “Event” and PEOPLE referring to “Objects”. A precedence link which might seem to be possible here is rejected because “Object” frames cannot be involved in temporal relations. An intuitive explanation is that birth can precede people’s lives but not people themselves. Instead a necessary dependency link could be chosen for the BIRTH-PEOPLE pair. Let us make an example of a possible violation of the axioms proposed in section 5. Consider the GETTING SCENARIO frame which has three subframes in FN: PRE GETTING (X possesses Z), GETTING (Y gets Z from X) and POST GETTING (Y possesses Z). Subframes are supposed to be phases of a complex scenario. However, one could doubt that GETTING SCENARIO is introduced correctly, because the subframe relation implies that the whole period of time when X or Y possessed Z is included into the getting scenario which may not necessarily reflect the intended meaning of getting. Precedence relations may be enough here. Besides defining the correct type of relation between two frames, it is important to ensure that FEs of the related frames are linked in an appropriate way. Inferences with frames are extensively based on FEs, since fillers of the linked FEs are supposed to refer to the same entity. Therefore, if FE 1 in f1 is linked to FE 2 in f2 where f2 is inferred from f1 then everything which is true about FE 2 must be also true for FE 1. For checking whether a link between two FEs is reasonable we propose to assign ontological categories to the possible fillers of the corresponding FEs and apply the OntoClean methodology (Guarino and Welty, 2004). OntoClean was developed mainly for evaluating the ontological adequacy of hierarchical relationships. This approach is based on very general notions taken from philosophy, like ‘essence’, ‘identity’ and ‘unity’ and adapted to conceptual modeling by means of suitable meta-properties (whose function is to impose formal constraints on the hierarchical structure considered). Some of the FEs in FN are already typed with semantic types which are organized in a small hierarchy of around 40 nodes. For example, the VICTIM FE in the frame KILLING is typed as Sentient. For most of the FEs the typing is missing. Moreover, the FN developers admit that the current"]},{"title":"3162","paragraphs":["hierarchy of semantic types is incomplete and suggest to use WordNet instead: “Because we cannot anticipate all of the Semantic Types that will be useful for tagging FEs, it will certainly also be desirable to categorize the fillers of our FEs using WordNet” (Ruppenhofer et al., 2006). We propose to use the basic categories of DOLCE as described in (Oltramari et al., 2002). For the lack of space, we do not elaborate on the application of OntoClean to FN inheritance in this paper. To illustrate how the analysis of FE links works, let us make an example. In section 3. we have considered the inheritance of the PART WHOLE frame from PART PIECE with the WHOLE FE linked to SUBSTANCE. Looking at the lexemes evoking PART PIECE and the corresponding annotated examples we conclude that the WHOLE FE can be filled either by entities of the type Amount of matter (piece of cake) or Mental Object (snippet of knowledge), while WHOLE in PART WHOLE can be filled by Physical object (body part), Mental Object (part of my idea), Process (part of the interview process). Thus, WHOLE covers a wider range of ontological categories than SUBSTANCE and therefore cannot inherit from SUBSTANCE. 6.2. Case Study In order to demonstrate how the proposed cleaning up methodology works in practice, we apply it to a cluster of frames related to the concept of medical treatment with RECOVERY as the central frame. Fig. 1 (left side) shows the frames which are related to RECOVERY in FN by a path of 1 or 2 relations. Our clustering algorithms described in section 4. have additionally discovered semantic relations between RECOVERY and the following frames: HEALTH RESPONSE, CAUSE HARM, EXPERI-ENCE BODILY HARM, SURVIVING, PERCEPTION BODY. Fig. 1 (right side) shows the “cleaned up” relational network. All but one Using links were replaced with the typical dependency relation. The RECOVERY-MEDICAL CONDITIONS link was substituted with the precedence relation because of its clearly temporal character (having a disease always precedes recovery). The causation link between CURE and RECOVERY was replaced by the typical causation. All inheritance links are left as they are, because none of them violates the proposed constraints. More relations have been added which link the frames suggested by our clustering algorithms to the frames described above. For investigating the impact of the restructured relational network on recognizing textual entailment we have selected the (T,H) pairs from FATE such that both T and H are annotated with one of the “medical” frames. The test set contains 39 (T,H) pairs, in 18 cases T entails H. We have computed textual entailment using the Nutcracker system (Bos and Markert, 2006) which combines deep semantic analysis techniques provided by a robust wide-coverage CCGparser with theorem proving. Textual entailment was computed a) without frame annotation (NFA), b) with frame annotation but without axioms (FA), c) with frame relations axiomatized as shown in Fig. 1 (right side) (FA&A), d) with frame relations and complex axioms as described below (FA&CA).18 18 We especially thank Johan Bos for the fruitful coopera-Table 1: Results of recognizing textual entailment for the 39 RTE-2 pairs annotated with “medical” frames in FATE.","NFA FA FA&A FA&CA Correct proofs 1 4 7 10 Wrong proofs 1 1 1 1 Overall accuracy 0.56 0.5 0.61 0.78 Only one correct proof was found without employing frame annotation.19","Adding frame and frame element annotation allowed to prove 3 more entailments. 3 more proofs were found with the help of frame relations. Manually going trough the (T,H) pairs used in the experiment we have discovered that finding a proof failed in 12 cases because of a) incompleteness of the FATE annotation (8), b) Nutcracker processing errors (5), c) lack of the general non-definitional knowledge (7). The last observation corresponds to the findings reported in (Clark et al., 2007). Clark et al. (2007) have considered 100 positive entailment pairs from the RTE3 set and concluded that the majority of the (T,H) pairs require the knowledge of the non-definitional type for their resolution. For example, arriving to a hospital usually means being hospitalized, suffering from a disease usually means having the disease etc. After having added 5 manually created axioms linking “medical” frames in a non-definitional way, we got 3 more correct entailment proofs. The final results are shown in table 1. Although the presented case study cannot be considered as an evaluation of our approach, it gives an interesting in-sight to the practical aspects of applying frame relations to natural language reasoning. First observation is that although a large amount of frame relations can be automatically extracted from FN and detected by the clustering algorithms, the cleaning up procedure resulting in high quality axioms still requires a considerable amount of manual work for checking the correctness of the discovered frame relations and possibly writing non-definitional axioms. The described case study suggests that adding frame annotation does not necessarily increase the overall performance of the Nutcracker RTE system, cf. overall accuracy for NFA and FA. This observation corresponds to the conclusion of (Burchardt et al., 2009). Having investigated the impact of frame semantics on textual entailment, Burchardt et al. (2009) report that considered RTE algorithms based on frame labeling only insignificantly outperform algorithms based on simple word overlap and claim that “the issue of knowledge modeling has emerged as the major factor limit-ing the applicability of frame semantics in RTE”. Burchardt et al. (2009) express the hope that improving and enriching the semantic structure of FN will help to overcome the current limits of FN applicability. This hope is again supported by the results of our case study, showing that adding axioms improves the overall accuracy. tion concerning integration of the frame axioms into Nutcracker, http://svn.ask.it.usyd.edu.au/trac/candc/wiki/nutcracker.","19","Logical reasoning is one of the several mechanisms which Nutcracker uses for RTE. Since in this paper we are interested in inferences, we have concentrated on proofs only."]},{"title":"3163","paragraphs":["Transitive_action Medical_instruments Cure Institutionalization Recovery Medical_conditions Health_response Graduable_attributes Cause_harm Surviving Medical_professionals People_by_vocation Medical_specialities Observable_bodyparts Perception_body","Experience_bodily_harm Recovery Medical_conditions Observable_bodyparts Graduable_attributes","CureInstitutionalization Medical_specialities Medical_instrumentsMedical_professionals People_by_vocation Transitive_action Inheritance Using Precedence Typical precedence Dependency Typical dependency Typical causationCausation Figure 1: “Medical” cluster: frame relations from FN (on the left) enriched and cleaned up (on the right)."]},{"title":"7. Conclusion","paragraphs":["In this paper we have investigated problems in the conceptual structure of FrameNet with respect to natural language reasoning and proposed a methodology for enriching, axiomatizing and cleaning up frame relations. Our methodology includes a data-driven analysis of frames resulting in discovering new frame relations and an ontological analysis of frames and frame relations resulting in axiomatiz-ing relations and formulating constraints on them. Additionally, we have described a case study aiming at demonstrating how the proposed methodology works in practice as well as investigating the impact of the restructured and axiomatized frame relations on recognizing textual entailment. The presented results cannot serve as an evaluation of the proposed approach, however, they highlight interesting aspects of practical applications of the frame relations to natural language reasoning. The performed study consists of three main parts which in-dicate the directions for our future work: 1) automatic extraction of missing frame relations, 2) ontological analysis of frames and 3) applications of FrameNet to RTE. Concerning automatic relation extraction, we plan to develop algorithms mapping frame elements of the related frames as well as to work on automatic detection of the relation types using algorithms for inference rules discovery similar to (Lin and Pantel, 2001). For a better understanding of the ontological nature of frames DOLCE needs to be extended to include an analysis of facts. Moreover, the application of OntoClean to the taxonomy of frames and frame elements requires further elaboration. Going into the direction of applying FN to RTE, in the near future we plan to convert existing frame relations into axioms as described in section 5 automatically and evaluate their impact on a full RTE test set."]},{"title":"8. References","paragraphs":["J. Barwise and J. Perry. 1980. The Situation Underground. Stanford Working Papers in Semantics, 1:155.","J. Bos and K. Markert. 2006. Recognising textual entailment with robust logical inference. In Machine Learning Challenges, volume 3944 of LNAI, pages 404–426.","A. Burchardt and M. Pennacchiotti. 2008. FATE: a FrameNet-Annotated Corpus for Textual Entailment. In Proc. of LREC’08.","A. Burchardt, K. Erk, and A. Frank. 2005. A WordNet Detour to FrameNet. In Sprachtechnologie, mobile Kommunikation und linguistische Resourcen, volume 8.","A. Burchardt, M. Pennacchiotti, S. Thater, and M. Pinkal. 2009. Assessing the impact of frame semantics on textual entailment. Natural Language Engineering, 15(4):527–550.","D. De Cao, D. Croce, M. Pennacchiotti, and R. Basili. 2008. Combining word sense and usage for modeling frame semantics. In Proc. of STEP 2008, pages 85–101.","P. Clark, P. Harrison, J. Thompson, W. Murray, J. Hobbs, and C. Fellbaum. 2007. On the role of lexical and world knowledge in rte3. In Proceedings of the ACL-PASCAL Workshop on Textual Entailment and Paraphrasing, pages 54–59.","C. Fellbaum, editor. 1998. WordNet: An Electronic Lexical Database. MIT Press, first edition.","N. Guarino and C. Welty. 2004. An overview on ontoclean. In S. Staab and R. Studer, editors, Handbook on Ontologies. Springer Verlag.","D. Lin and P. Pantel. 2001. DIRT-Discovery of Inference Rules from Text. In Proceedings of KDD-01, pages 323– 328.","C. Masolo, S. Borgo, A. Gangemi, N. Guarino, and A. Oltramari. 2003. WonderWeb Deliverable D18. Technical report.","A. Oltramari, A. Gangemi, N. Guarino, and C. Masolo. 2002. Restructuring wordnet’s top-level: The ontoclean approach. In Proc. of OntoLex 2002, pages 17–26.","M. Pennacchiotti and M. Wirdth. 2009. Measuring Frame Relatedness. In Proc. of EACL 2009, pages 657–665.","F. Pianesi and A. Varzi. 2000. Events and event talk: An introduction. In Speaking of Events, pages 3–47. Oxford University Press.","L. Prevot, S. Borgo, and A. Oltramari. 2009. Interfacing Ontologies and Lexical Resources. Ontologies and the Lexicon, pages 195–216.","J. Ruppenhofer, M. Ellsworth, M.R. Petruck, C.R. Johnson, and J. Scheffczyk. 2006. FrameNet II: Extended Theory and Practice. International Computer Science Institute.","J. Scheffczyk, C. F. Baker, and S. Narayanan. 2006. Ontology-based reasoning about lexical resources. In Proc. of OntoLex 2006.","D. Shen and M. Lapata. 2007. Using Semantic Roles to Improve Question Answering. In Proc. of EMNLP-CoNLL, pages 12–21."]},{"title":"3164","paragraphs":[]}]}