{"sections":[{"title":"Metaphor Corpus Annotated for Source – Target Domain Mappings Ekaterina Shutova*, Simone Teufel*","paragraphs":["*Computer Laboratory, University of Cambridge 15 JJ Thomson Avenue, Cambridge CB3 0FD, UK","Ekaterina.Shutova@cl.cam.ac.uk, Simone.Teufel@cl.cam.ac.uk","Abstract Besides making our thoughts more vivid and filling our communication with richer imagery, metaphor also plays an important structural role in our cognition. Although there is a consensus in the linguistics and NLP research communities that the phenomenon of metaphor is not restricted to similarity-based extensions of meanings of isolated words, but rather involves reconceptualization of a whole area of experience (target domain) in terms of another (source domain), there still has been no proposal for a comprehensive procedure for annotation of cross-domain mappings. However, a corpus annotated for conceptual mappings could provide a new starting point for both linguistic and cognitive experiments. The annotation scheme we present in this paper is a step towards filling this gap. We test our procedure in an experimental setting involving multiple annotators and estimate their agreement on the task. The associated corpus annotated for source target domain mappings will be publicly available."]},{"title":"1. Introduction","paragraphs":["Metaphors arise when one concept is viewed in terms of the properties of the other. Here are some examples of metaphor. (1) How can I kill a process? (Martin, 1988)","(2) And then my heart with pleasure fills, And dances with the daffodils.1 In metaphorical expressions seemingly unrelated features of one concept are associated with another concept. In the example (1) the computational process is viewed as some-thing alive and, therefore, its forced termination is associated with the act of killing. Various views on metaphor have been discussed in linguistics and philosophy (Gentner, 1983; Black, 1962; Hesse, 1966; Wilks, 1978; Lakoff and Johnson, 1980). All of these approaches share the idea of an interconceptual mapping that underlies the production of metaphorical expressions. In other words, metaphor always involves two concepts or conceptual domains: the target and the source. Consider the following examples.","(3) He shot down all of my arguments. (Lakoff and Johnson, 1980)","(4) He attacked every weak point in my argument. (Lakoff and Johnson, 1980) According to Lakoff and Johnson (1980), a mapping of the concept of argument to that of war is employed here. The argument, which is the target concept, is viewed in terms of a battle (or a war), the source concept. The existence of this analogy allows us to talk about arguments using the war terminology, thus giving rise to a number of metaphors. Traditional approaches to metaphor annotation in corpora include manual search for lexical items used metaphorically (Pragglejaz Group, 2007), for source and target domain vocabulary (Deignan, 2006; Koivisto-Alanko and 1 taken from the verse “I wandered lonely as a cloud” written","by William Wordsworth in 1804. Tissari, 2006; Martin, 2006) or for linguistic markers of metaphor (Goatly, 1997). Although there is a consensus in the linguistics and NLP research communities that the phenomenon of metaphor is not restricted to similarity-based extensions of meanings of isolated words, but rather involves reconceptualization of a whole area of experience in terms of another, there still has been no proposal for a comprehensive procedure for annotation of cross-domain mappings. However, a corpus annotated for conceptual mappings could provide a new starting point for both linguistic and cognitive experiments. The annotation scheme we present in this paper is a step towards filling this gap. We test our procedure in an experimental setting involving multiple annotators and estimate their agreement on the task. The focus of our current study is on single-word metaphors expressed by a verb. The annotators were asked to (1) classify the verbs in the text into two categories: metaphorical or literal and (2) identify the interconceptual mapping for each expression they tagged as metaphorical. We compiled lists of categories that are generally frequent source and target concepts. The annotators selected the categories from the lists that in their judgement described the source and target concepts best or suggested their own category if the relevant list did not contain the desired one."]},{"title":"2. Metaphor Identification in Corpora","paragraphs":["Although humans are highly capable of producing and comprehending metaphorical expressions, the task of distinguishing between literal and non-literal meanings and, therefore, annotating metaphor in text appears to be challenging. This is due to the variation in its use and external form, as well as a not clear-cut semantic distinction. Gibbs (1984) suggests that literal and figurative meanings are situated at the ends of a single continuum, along which metaphoricity and idiomaticity are spread. This makes demarcation of metaphorical and literal language fuzzy."]},{"title":"3255 2.1. Metaphor and Polysemy","paragraphs":["The theorists of metaphor distinguish between two kinds of metaphorical language: novel (or poetic) metaphors, that surprise our imagination, and conventionalized metaphors, that become a part of an ordinary discourse. “Metaphors begin their lives as novel poetic creations with marked rhetorical effects, whose comprehension requires a special imaginative leap. As time goes by, they become a part of general usage, their comprehension becomes more automatic, and their rhetorical effect is dulled” (Nunberg, 1987). Nunberg calls such metaphors “dead” and claims that they are not psychologically distinct from literally-used terms. This scheme demonstrates how metaphorical associations capture some generalisations governing polysemy: over time some of the aspects of the target domain are added to the meaning of a term in a source domain, resulting in a (metaphorical) sense extension of this term. Copestake and Briscoe (1995) discuss sense extension mainly based on metonymic examples and model the phenomenon using lexical rules encoding metonymic patterns. Along with this they suggest that similar mechanisms can be used to account for metaphoric processes, and the conceptual mappings encoded in the sense extension rules would define the limits to the possible shifts in meaning. However, it is often unclear if a metaphorical instance is a case of broadening of the sense in context due to general vagueness in language, or it manifests a formation of a new distinct metaphorical sense. Consider the following examples.","(5) a. As soon as I entered the room I noticed the difference. b. How can I enter Emacs? (6) a. My tea is cold. b. He is such a cold person. Enter in (5a) is defined as “to go or come into a place, build-ing, room, etc.; to pass within the boundaries of a country, region, portion of space, medium, etc.”2","In (5b) this sense stretches to describe dealing with software, whereby COM-PUTER PROGRAMS are viewed as PHYSICAL SPACES. However, this extended sense of enter does not appear to be sufficiently distinct or conventional to be included into the dictionary, although this could happen over time. The sentence (6a) exemplifies the basic sense of cold – “of a temperature sensibly lower than that of the living human body”, whereas cold in (6b) should be interpreted metaphorically as “void of ardour, warmth, or intensity of feeling; lacking enthusiasm, heartiness, or zeal; indifferent, apathetic”. These two senses are clearly linked via the metaphoric mapping between EMOTIONAL STATES and TEMPERATURES. A number of metaphorical senses are included in WordNet, however without any accompanying semantic annotation. 2 Sense definitions are taken from the Oxford English Dictio-","nary. 2.2. Metaphor Identification Procedure Pragglejaz Group (2007) proposes a metaphor identification procedure (MIP) within the framework of the Metaphor in Discourse project (Steen, 2007). The procedure involves metaphor annotation at the word level as opposed to identifying metaphorical relations (between words) or source–target domain mappings (between concepts or domains). In order to discriminate between the words used metaphorically and literally the annotators are asked to follow the guidelines (as set out in the paper of Pragglejaz Group (2007)):","1. Read the entire text-discourse to establish a general understanding of the meaning. 2. Determine the lexical units in the text-discourse","3. • For each lexical unit in the text, establish its meaning in context, that is, how it applies to an entity, relation, or attribute in the situation evoked by the text (contextual meaning). Take into account what comes before and after the lexical unit.","• For each lexical unit, determine if it has a more basic contemporary meaning in other contexts than the one in the given context. For our purposes, basic meanings tend to be – More concrete [what they evoke is easier to","imagine, see, hear, feel, smell, and taste]; – Related to bodily action; – More precise (as opposed to vague); – Historically older; Basic meanings are not necessarily the most frequent meanings of the lexical unit.","• If the lexical unit has a more basic current-contemporary meaning in other contexts than the given context, decide whether the contextual meaning contrasts with the basic meaning but can be understood in comparison with it. 4. If yes, mark the lexical unit as metaphorical. Such annotation can be viewed as a form of word sense disambiguation with an emphasis on metaphoricity."]},{"title":"3. Mappings Annotation Scheme","paragraphs":["The annotation scheme we propose is based on some of the principles of the metaphor identification procedure developed by Pragglejaz Group (2007). We adopt their definition of basic sense of a word and their approach to distinguish-ing basic senses from the metaphorical ones. We modify and extend the procedure to identify source – target domain mappings by analyzing the contexts in which a word appears in its basic and metaphorical senses. 3.1. Source and Target Domain Categories One of the first attempts to create a multi-purpose knowledge base of source–target domain mappings is the Master Metaphor List (Lakoff et al., 1991). It includes a classification of metaphorical mappings with the corresponding"]},{"title":"3256","paragraphs":["Source concepts PHYSICAL OBJECT LIVING BEING ADVERSARY/ENEMY LOCATION DISTANCE CONTAINER PATH GATEWAY PHYSICAL OBSTACLE (e.g. barrier) DIRECTIONALITY: e.g. UP/DOWN BASIS/PLATFORM DEPTH GROWTH/RISE MOTION JOURNEY VEHICLE MACHINE/MECHANISM STORY LIQUID ... Table 1: Frequent source concepts examples of language use. This resource has been criticized for the lack of clear structuring principles of the mapping ontology (Lönneker-Rodman, 2008). The taxonomical levels are often confused, and the classes of concepts are not mutually exclusive. However, to date it is the most comprehensive resource of metaphorical mappings and its source and target domain categories were repeatedly adopted for NLP research (Barnden and Lee, 2002; Lönneker, 2004). Following these approaches we rely on a subset of categories from the Master Metaphor List and extend it with novel categories identified in the data annotated by the authors of this paper. The examples of the frequent source and target categories according to our data are demonstrated in Tables 1 and 2 respectively. It should be noted that we do not expect the compiled lists to be exhaustive. We tested their coverage on a held out document set and found that our target concept list explains 76% of metaphorical expressions in these texts, whereas the source concept list has a 100% coverage. 3.2. The Data Since we focus on single-word metaphors expressed by a verb, our task can be viewed as a verb classification according to whether the verbs are used metaphorically or literally. However, some verbs have a weak or no potential of being a metaphor and as such our study is not concerned with them. Thus, we excluded the following verb classes: (1) auxiliary verbs; (2) modal verbs; (3) aspectual verbs (e.g. begin, start, finish); (4) light verbs (e.g. take, give, put, get, make). 3.3. Annotation Procedure The annotation procedure that we use as part of our guidelines is presented below:","1. For each verb establish its meaning in context and try to imagine a more basic meaning of this verb on other Target concepts LIFE DEATH TIME/MOMENT IN TIME FUTURE PAST CHANGE PROGRESS/EVOLUTION/DEVELOPMENT SUCCESS/ACCOMPLISHMENT CAREER FEELINGS/EMOTIONS ATTITUDES/VIEWS MIND IDEAS KNOWLEDGE PROBLEM TASK/DUTY FREEDOM SOCIAL/ECONOMIC/POLITICAL SYSTEM RELATIONSHIP ... Table 2: Frequent target concepts contexts. As defined in the framework of MIP (Pragglejaz Group, 2007) basic meanings normally are: • more concrete; • related to bodily action; • more precise (as opposed to vague); • historically older;","2. If you can establish the basic meaning that is distinct from the meaning of the verb in this context, the verb is likely to be used metaphorically. Try to identify a mapping between the source domain (where the basic meaning comes from) and the target domain (the concepts forming the context of the verb in front of you) using the provided lists of source and target categories. Record the mapping. Consider the following example sentence:","(7) If he asked her to post a letter or buy some razor blades from the chemist, she was transported with pleasure. In this sentence one needs to annotate four verbs that are underlined.","• The first 3 verbs are used in their basic sense, i.e. literally (ask in the context of “a person asking another person a question or a favour”; post in the context of “a person posting/sending a letter by post”; buy in the sense of “making a purchase”). Thus, they are tagged as literal.","• The verb transport, however, in its basic sense is used in the context of “goods being transported/carried somewhere by a vehicle”. The context in this sentence involves “a person being transported by a feel-ing”, which contrasts the basic sense in that the agent of transporting is an EMOTION (the target concept) as opposed to a VEHICLE (the source concept). Thus,"]},{"title":"3257","paragraphs":["we can infer that the use of transport in this sentence is metaphorical and the associated interconceptual mapping is EMOTIONS – VEHICLES."]},{"title":"4. Creating the Corpus","paragraphs":["Our corpus is a subset of the British National Corpus (BNC) (Burnard, 2007). We sampled texts representing various genres: literature, newspaper/journal articles, essays on politics, international relations and history, radio broadcast (transcribed speech). The corpus that has been annotated so far contains 761 sentences and 13642 words. 4.1. Annotation Experiment Annotators We had three independent volunteer annotators, who were all native speakers of English and had some linguistics background. Material and Task All of them received the same text taken from the BNC containing 142 verbs to annotate. They were asked to (1) classify verbs as metaphorical or literal and (2) identify the source – target domain mappings for the verbs they marked as metaphorical. They received two lists of categories describing source and target concepts and asked to select one from each list, in a way that describes the metaphorical mapping best. Along with this they were allowed to introduce categories of their own if they felt none of the given categories corresponded to their judgement. Guidelines and Training The annotators received written guidelines (2 pages) and were asked to do a small annotation exercise (2 sentences containing 8 verbs in total). The goal of the exercise was to ensure they were at ease with the annotation format. 4.2. Interannotator Agreement We evaluate reliability of our annotation scheme by as-sessing interannotator agreement in terms of κ (Siegel and Castellan, 1988) on both tasks separately. The identification of metaphorical verbs yielded the agreement of 0.64 (κ), which is considered reliable. The main reason for disagreement during metaphor identification was the conventionality of some expressions, i.e. cases where the metaphorical etymology can be clearly traced, but the senses are highly lexicalized. This generally makes metaphor demarcation fuzzy. The source – target domain mappings were assigned to the metaphorical expressions with the κ of 0.57, whereby the agreement was stronger on the choice of the source categories than the target categories. Our data analysis has shown that one of the main sources of disagreement was the presence of partially over-lapping categories in our target concept list. E.g. the categories of PROGRESS and SUCCESS or VIEWS, IDEAS and METHODS were often confused. Based on these preliminary results and observations we refined our source and target lists to ensure no or minimal overlap between the categories while maximally preserving their informativeness (e.g. VIEWS, IDEAS and METHODS can be covered by a single category IDEAS). We mapped the categories in the annotations to this new set of categories and then compared Frequency Source concepts 0.23 MOTION 0.13 VISION/SEEING 0.13 LIVING BEING 0.13 GROWTH/RISE 0.07 SPEED 0.03 DIRECTIONALITY: e.g. UP/DOWN 0.03 BASIS/PLATFORM 0.03 LOCATION 0.03 DISTANCE 0.03 MACHINE/MECHANISM 0.03 PHYSICAL OBJECT ... Table 4: Distribution of source concepts the annotations. The agreement has risen to 0.61 (κ), which confirmed our hypothesis."]},{"title":"5. Data Analysis","paragraphs":["In this section we will describe the statistics of the resulting corpus, compare metaphor frequency across genres and attempt to identify common traps in annotation of source-target domain mappings in unrestricted text. 5.1. Metaphor Statistics accross Genres In order to gather metaphor statistics accross a wider range of syntactic constructions and genres, the authors of this paper annotated a larger corpus for metaphors expressed by other parts of speech using the same procedure. We computed metaphor frequency as a number of metaphors relative to the number of sentences in the text. The results presented in Table 3 indicate that metaphor overall is a highly frequent phenomenon, which makes its automatic analysis indispensable for a wide range of NLP applications. An interesting finding is that literature texts seem to contain fewer metaphors than others, although it should be noted that our frequency is biased towards genres with longer sentences, whereas the literature texts contained some dialogues consisting of short phrases. The last column of Table 3 shows the proportion of metaphors expressed by a verb across genres. Their distribution appears similar to that of other syntactic constructions, but it should be noted that metaphors expressed by a verb are by a large margin the most frequent type and constitute 68% of all metaphorical expressions in the corpus. 5.2. Mappings Statistics Along with this it is interesting to look at the distributions of the source and target categories in the text annotated by our three annotators. The text they annotated was the essay on sociology, whose topic to some extent predefines the observed mappings. The distributions of source and target concepts are shown in Tables 4 and 5 respectively. The most frequent source domain of MOTION was mainly mapped onto the target concepts of CHANGE, PROGRESS, CAREER and SUCCESS. TIME was generally associated with DISTANCE, and the MOMENT IN TIME with LOCATION. VIEWS and IDEAS were viewed as either LIVING BEINGS or PHYSICAL OB-JECTS. These findings match the examples from the Mas-"]},{"title":"3258","paragraphs":["Text ID Genre Sentences Words Metaphors Met./Sent. Verb metaphors Hand in Glove, Goddard G0N Literature 335 (5 pages) 3927 41 0.12 30 After Gorbachev, White FYT Politics 45 (2 pages) 1384 23 0.51 17 Today newspaper CEK News 116 (3 pages) 2086 48 0.41 30 Tortoise by Candlelight, Bawden HH9 Literature 79 (2 pages) 1366 12 0.15 10 The Masks of Death, Cecil ACA Sociology 60 (2 pages) 1566 70 1.17 42 Radio broadcast (current affairs) HM5 Speech 58 (2 pages) 1828 10 0.17 7 Language and Literature journal J85 Article 68 (2 pages) 1485 37 0.54 28 Total 761 13642 241 0.32 164 Table 3: Corpus statistics for metaphor Frequency Target concepts 0.27 ATTITUDES/VIEWS 0.13 CHANGE 0.12 TIME/MOMENT IN TIME 0.12 PROGRESS/EVOLUTION/DEVELOPMENT 0.05 BEHAVIOR 0.05 SUCCESS/ACCOMPLISHMENT 0.05 FUTURE 0.05 CAREER 0.03 SOCIAL/ECONOMIC/POLITICAL SYSTEM 0.03 IDEAS 0.03 METHODS 0.03 KNOWLEDGE 0.02 DEATH 0.02 PAST ... Table 5: Distribution of target concepts ter Metaphor List, however, some of the identified mappings are novel, e.g. EMPHASIS – PHYSICAL FORCE; SITUATION – PICTURE etc. 5.3. Issues for Mappings Annotation Most examples of metaphorical expressions and the associated mappings in linguistic literature are carefully selected to clearly demonstrate the interconceptual correspondences. However, these examples do not provide an adequate account of the phenomena in real-world data. Our study of source – target domain mappings in unrestricted text revealed a number of difficulties with this approach. 5.3.1. Level of Abstraction One of the major steps in the mappings annotation process is the construction of the inventory of categories that generalize over metaphorical expressions well. A metaphorical mapping becomes a generalization over a number of metaphorical examples only if it covers multiple cases in which ways of reasoning about the source domain systematically correspond to ways of reasoning about the target. However, given a set of examples, it is often unclear at which level of abstraction the source and target categories should stand. Consider the following example.","(8) Sons aspired to follow (CAREER, LIFE - PATH, JOURNEY) in their fathers’ trades or professions. Here the verb follow is used metaphorically, however, the optimal generalizations for both source and target domains are not obvious. This metaphor can be characterized by a more precise mapping of CAREER is a PATH, as well as the general one of LIFE is a JOURNEY. 5.3.2. Relations between the Mappings Along with this the example in (8) raises another issue, namely that of the type of relationship between the mappings themselves. The relationships between mappings undoubtedly exist, however, they are by no means limited to subsumption. A possible key to this problem can be found in the conceptual blending theory (Fauconnier and Turner, 2002). Fauconnier and Turner view metaphor in terms of mental spaces rather then continuous domains. Mental spaces represent particular scenarios within the domains. Such scenarios originating in the source domain can then be applied to reason about the target domain. Thus, certain scenarios from the domain of JOURNEY can be projected onto the domain of LIFE, e.g. describing the concept of CAREER through that of a PATH. This view also provides an explanation of the fact that not all of the concepts of the target domain are equally associated with the source domain. Scenarios are always complete and coherent stories. If there is a concept in the target domain, which is not part of any possible source domain scenario in our experience, then the conceptual mapping would not hold for it. 5.3.3. Multiple Mappings In some cases multiple mappings are necessary to explain an expression. Consider the following sentence:","(9) The Impressionist painters caught the contagion, and the new race of photographers tried to seize the fleet-ing moment and make it stay. Here, among others, the phrase catch the contagion is used metaphorically. The interpretation of this metaphor triggers two conceptual mappings, namely IDEAS/VIEWS – INFECTION and INFECTION – PHYSICAL OBJECT. This chain-like association structure seems natural and simple when one is presented with it. However, it complicates the annotation process significantly, as it is hard to predefine the number of associations involved."]},{"title":"6. Related Work","paragraphs":["In this section we will review some of the most prominent approaches to metaphor identification in text. These include metaphor seen as a violation of selectional preferences, the use of linguistic cues indicating metaphor or searching for source and target domain vocabulary in text."]},{"title":"3259","paragraphs":["Cue No. of Occurrences in the BNC Out of them metaphors Precision metaphorically speaking 7 5/7 0.71 literally 1936 13/50 0.26 figurative 125 9/50 0.18 utterly 1251 16/50 0.32 completely 8339 13/50 0.26 so to speak 353 35/49 0.71 Table 6: Corpus statistics for linguistic cues","6.1. Metaphor as a Violation of Selectional Preferences Selectional preferences are the semantic constraints that a verb places onto its arguments. Therefore, metaphorical expressions can be detected via selectional preference violation (Wilks, 1978). This approach was automated by Fass (1991) in his met* system. However, Fass himself in-dicated a problem with the selectional preference violation approach applied to metaphor annotation. The approach detects any kind of non-literalness or anomaly in the language (metaphors, metonymies and others), and not only metaphors, i.e., it overgenerates. The methods met* uses to differentiate between those are mainly based on handcoded knowledge, which implies a number of limitations. Another problem with this approach arises due to the high conventionality of metaphor in language. This means that the metaphorical senses of some words are common enough, and the system would extract selectional preference distributions skewed towards such conventional metaphorical senses of the verb or one of its arguments. Therefore, although such expressions are fully metaphorical in nature, no selectional preference violation can be detected in their use. Another drawback of this approach arises from the fact that interpretation is always context dependent, e.g. the phrase all men are animals can be used metaphorically, however, without any violation of selectional restrictions. 6.2. Linguistic Cues Alternatively metaphor can be detected by extracting sentences containing linguistic cues indicating it, as suggested by Goatly (1997). However, this approach finds only a very limited number of metaphorical expressions, as the vast majority of them appear without any signaling context. In other words this method is likely to extract metaphors with a low recall. In addition the ambiguity of the linguistic cues also make the precision of this method questionable. We conducted a corpus study in order to investigate the effectiveness of linguistic cues as metaphor indicators. For each cue (as suggested by Goatly (1997)) we randomly sampled 50 sentences from the BNC containing it and manually annotated them for metaphoricity. The results are presented in Table 6. The average precision of the linguistic cue method according to these data is 0.40, which suggests that the set of metaphors that this method generates would contain a great deal of noise. 6.3. Metaphor Identification Using Source – Target","Domain Mappings Another popular method that has been used to extract metaphors is searching for sentences containing lexical items from the source domain, the target domain, or both (Stefanowitsch, 2006). This method requires exhaustive lists of source and target domain vocabulary. Martin (2006) conducted a corpus study in order to confirm that metaphorical expressions occur in text in contexts containing such lexical items. He performed his analysis on the data from the Wall Street Journal (WSJ) corpus and focused on four conceptual metaphors that occur with considerable regularity in the corpus. These include NUMERICAL VALUE AS LOCATION, COMMERCIAL ACTIVITY AS CONTAINER, COMMERCIAL ACTIVITY AS PATH FOLLOWING and COMMERCIAL ACTIVITY AS WAR. Martin manually compiled the lists of terms characteristic for each domain by examining sampled metaphors of these types and then augmented them through the use of thesaurus. He then searched the WSJ for sentences containing vocabulary from these lists and checked whether they contain metaphors of the above types. The goal of this study was to evaluate predictive ability of contexts containing vocabulary from (1) source domain and (2) target domain, as well as (3) estimating the likelihood of a metaphorical expression following another metaphorical expression described by the same mapping. He obtained the most positive results for metaphors of the type NUMERICAL-VALUE-AS-LOCATION (P (M etaphor|Source) = 0.069, P (M etaphor|T arget) = 0.677, P (M etaphor|M etaphor) = 0.703)."]},{"title":"7. Conclusion","paragraphs":["Besides making our thoughts more vivid and filling our communication with richer imagery, metaphors also play an important structural role in our cognition (Lakoff and Johnson, 1980). In this paper we presented a novel annotation scheme for metaphorical mappings and we are currently constructing a corpus that will be publicly available. Such a resource paves new avenues for linguistic, computational and cognitive research on metaphor. A study of the interconceptual mappings in real linguistic data could undoubtedly shed light on the way metaphorical associations organize our conceptual system, in terms of which we think, communicate and act."]},{"title":"Acknowledgments","paragraphs":["We are very grateful to Anna Korhonen and Ann Copestake for their helpful feedback on this work and the volunteer"]},{"title":"3260","paragraphs":["annotators for their time and interest. Katia’s studies and, thus, this research are funded by generosity of Cambridge Overseas Trust."]},{"title":"8. References","paragraphs":["J.A. Barnden and M.G. Lee. 2002. An artificial intelligence approach to metaphor understanding. Theoria et Historia Scientiarum, 6(1):399–412.","M. Black. 1962. Models and Metaphors. Cornell University Press.","L. Burnard. 2007. Reference Guide for the British National Corpus (XML Edition).","A. Copestake and T. Briscoe. 1995. Semi-productive polysemy and sense extension. Journal of Semantics, 12:15– 67.","A. Deignan. 2006. The grammar of linguistic metaphors. In A. Stefanowitsch and S. T. Gries, editors, Corpus-Based Approaches to Metaphor and Metonymy, Berlin. Mouton de Gruyter.","D. Fass. 1991. met*: A method for discriminating metonymy and metaphor by computer. Computational Linguistics, 17(1):49–90.","G. Fauconnier and M. Turner. 2002. The Way We Think: Conceptual Blending and the Mind’s Hidden Complexities. Basic Books.","D. Gentner. 1983. Structure mapping: A theoretical framework for analogy. Cognitive Science, 7:155–170.","R. Gibbs. 1984. Literal meaning and psychological theory. Cognitive Science, 8:275–304.","A. Goatly. 1997. The Language of Metaphors. Routledge, London.","M. Hesse. 1966. Models and Analogies in Science. Notre Dame University Press.","P. Koivisto-Alanko and H. Tissari. 2006. Sense and sensibility: Rational thought versus emotion in metaphorical language. In A. Stefanowitsch and S. T. Gries, editors, Corpus-Based Approaches to Metaphor and Metonymy, Berlin. Mouton de Gruyter.","G. Lakoff and M. Johnson. 1980. Metaphors We Live By. University of Chicago Press, Chicago.","G. Lakoff, J. Espenson, and A. Schwartz. 1991. The master metaphor list. Technical report, University of California at Berkeley.","B. Lönneker-Rodman. 2008. The hamburg metaphor database project: issues in resource creation. Language Resources and Evaluation, 42(3):293–318.","B. Lönneker. 2004. Lexical databases as resources for linguistic creativity: Focus on metaphor. In Proceedings of the LREC 2004 Workshop on Language Resources for Linguistic Creativity, pages 9–16, Lisbon, Portugal.","J. H. Martin. 1988. Representing regularities in the metaphoric lexicon. In Proceedings of the 12th conference on Computational linguistics, pages 396–401.","J. H. Martin. 2006. A corpus-based analysis of context effects on metaphor comprehension. In A. Stefanowitsch and S. T. Gries, editors, Corpus-Based Approaches to Metaphor and Metonymy, Berlin. Mouton de Gruyter.","G. Nunberg. 1987. Poetic and prosaic metaphors. In Proceedings of the 1987 workshop on Theoretical issues in natural language processing, pages 198–201.","Pragglejaz Group. 2007. MIP: A method for identifying metaphorically used words in discourse. Metaphor and Symbol, 22:1–39.","S. Siegel and N. J. Castellan. 1988. Nonparametric statistics for the behavioral sciences. McGraw-Hill Book Company, New York, USA.","G. J. Steen. 2007. Finding metaphor in discourse: Pragglejaz and beyond. Cultura, Lenguaje y Representacion / Culture, Language and Representation (CLR), Revista de Estudios Culturales de la Universitat Jaume I, 5:9–26.","A. Stefanowitsch. 2006. Corpus-based approaches to metaphor and metonymy. In A. Stefanowitsch and S. T. Gries, editors, Corpus-Based Approaches to Metaphor and Metonymy, Berlin. Mouton de Gruyter.","Y. Wilks. 1978. Making preferences more active. Artificial Intelligence, 11(3):197–223."]},{"title":"3261","paragraphs":[]}]}