{"sections":[{"title":"Comparison of spectral properties of read, prepared and casual speech in French Jean-Luc Rouas","paragraphs":["1"]},{"title":", Mayumi Beppu","paragraphs":["2"]},{"title":", Martine Adda-Decker","paragraphs":["1","1","LIMSI-CNRS UPR 3251, France","2","Dept. Computer Science, Tokyo Institute of Technology, Japan rouas@limsi.fr, beppu@ks.cs.titech.ac.jp, madda@limsi.fr","Abstract In this paper, we investigate the acoustic properties of phonemes in three speaking styles: read speech, prepared speech and spontaneous speech. Our aim is to better understand why speech recognition systems still fails to achieve good performances on spontaneous speech. This work follows the work of Nakamura et al. (Nakamura et al., 2008) on Japanese speaking styles, with the difference that we here focus on French. Using Nakamura’s method, we use classical speech recognition features, MFCC, and try to represent the effects of the speaking styles on the spectral space. Two measurements are defned in order to represent the spectral space reduction and the spectral variance extension. Experiments are then carried on to investigate if indeed we fnd some differences between the three speaking styles using these measurements. We fnally compare our results to those obtained by Nakamura on Japanese to see if the same phenomenon appears."]},{"title":"1. Introduction","paragraphs":["This work follows the work of Nakamura et al. (Nakamura et al., 2008) on Japanese speaking styles, with the difference that we here focus on French. We “frst conduct the same experiments as Nakamura and then propose further analysis. Motivations for this work are expressed in section 2.. The section 3. describes the analysis method. In section 4., we recall the experiments and the results obtained by Nakamura on Japanese. The next section, section 5., details the French corpora we are using. The experiments achieved on this French data are detailed in section 6.. In the last section, we compare the results between Japanese and French data whenever they may be compared, and we propose further analyses."]},{"title":"2. Motivations","paragraphs":["After having focused mainly on read speech, the automatic speech transcription systems also achieve nowadays very good performances on broadcast news data (usually around 10-15% of Word Error Rate (Fousek et al., 2008)). These systems bene“ft of years of research focused only on the automatic transcription of read speech and broadcast news data, which can be attested by looking at the numerous NIST evaluations carried on during the last decades. However, when coping with spontaneous speech, even the best actual systems achieve quite poor performances, with an accuracy that may be as low as 40%. These results emphasise the fact that spontaneous speech and read speech are indeed very different both acoustically and linguistically (Furui, 2003). One of the remaining challenges for automatic speech transcription is to give the systems the ability to deal with every kind of input data, including spontaneous speech. To ful“fl this goal, it is crucial to analyse what are the most noticeable differences between speaking styles using features traditionally used by automatic speech transcription systems. On the acoustic point of view, it is known that the spectral distribution of continuously spoken vowels or syllables is much smaller than that of isolated spoken vowels or syllables. This phenomenon is some-times called spectral reduction. Similar reduction have been observed in the parametric space for spontaneous speech compared to read speech, using formant frequency data measured from one speaker (van Son and Pols, 1999). A study on Japanese con“frmed this observation using large corpora (Nakamura et al., 2008). Considering French, we know that read speech and spontaneous speech are structurally different. Complex syllables tend to be simpli“fed, and deletion of the word-“fnal consonants and vowels of unstressed syllables frequently occurs in French spontaneous speech (Adda-Decker et al., 2005). This phenomenon may be responsible for some of the automatic transcription errors on spontaneous speech. That is why we propose to study it in this paper. Another phenomenon that may characterise spontaneous speech is the spectral variance extension. This phenomenon has been studied in (Nakamura et al., 2008) on Japanese data. In the following section, we present the approaches used to compute means to assess these phenomena."]},{"title":"3. Acoustic analysis method 3.1. Features","paragraphs":["Utterances are digitalised using 16kHz sampling, and segmented by silences of 400 ms duration or longer. The speech waveform are converted to 12 dimensional MFCC vectors using a 25 ms length window shifted every 10 ms. The MFCC vectors are augmented with their “frst and second derivatives, together with the “frst and second differential log-energy, resulting in 38-dimensional vectors."]},{"title":"606 3.2. Spectral reduction ratio","paragraphs":["In order to characterise the spectral reduction phenomenon, we must use a reference corpus. This corpus, hereafter denoted R, is in our case a read speech corpus. The spectral space extent is estimated by calculating the difference between the mean of the MFCC features for a given phoneme p and the averaged value over all the phonemes of the same corpus. The ratio is then computed by dividing the spectral space extent for the corpus X with the one measured for the reference corpus R. The distances used in this paper are euclidean distances. In formal terms, the spectral reduction ratio can be expressed by the following formula: redp(X) = ∥μp(X) − Av(μp(X))∥ ∥μp(R) − Av(μp(R))∥ (1) with μp being the mean vector of phoneme p uttered with the speaking style X, μp(R) is the mean vector for phoneme p for read speech, and Av indicates the average value. 3.3. Spectral variance extension ratio Using a similar method, we now de“fne the variance extension ratio, still using the reference corpus R. The spectral variance is estimated as being the sum of the variances obtained for each MFCC coefficient for all the realisations of a phoneme p. The spectral variance extension ratio is thus de“fned as being the ratio between the spectral variance of the phoneme p on the corpus X and the spectral variance of the same phoneme on the corpus R. The formalised method used to compute this ratio is: extp(X) =","∑K k=1 σ2","pk(X)","∑K k=1 σ2","pk(R) (2) with K being the dimension of the MFCC vector, and σ2 pk(X) the kth dimensional element of the variance vector of MFCC for phoneme p uttered with speaking style X."]},{"title":"4. Acoustic characteristics of Japanese speaking styles (Nakamura et al., 2008)","paragraphs":["In (Nakamura et al., 2008), various speaking styles are analysed using large-scale Japanese speech corpora. This work focused mainly on the analysis of the differences between acoustic characteristics for spontaneous and read speech. The data used in these experiments come from the Corpus of Spontaneous Japanese (CSJ) (Maekawa, 2003) and the Japanese Newspaper Article Sentence (JNAS) (Itou et al., 1999). The CSJ corpus is composed of 660 hours of speech and was recorded from 1999 to 2004. The JNAS corpus consists in 60 hours of speech. It was recorded from 1995 to 1997. These corpus covers several conditions, including monologue, dialogue and read speech. For the purpose of the following experiments, only some situations, considered most representative of a speaking style, are utilised. These are, ranking from the most formal to the most informal: Read speech, Academic presentations, Extemporeaneous presentations (informal presentations), Dialogue. The experiments carried on using this framework show that reduction of MFCC space is observed for almost all the phonemes in the three speaking styles in comparison with read speech. This phenomenon is most noticeable for the dialogue utterances. Results obtained using the spectral variance extension ratio indeed show that an extension of the variance is observed for almost all the phonemes in the three speaking styles."]},{"title":"5. French corpora","paragraphs":["Three speech corpora with read, prepared and casual spontaneous speaking styles were used. The reference read speech corpus is the French BREF (Lamel et al., 1991) corpus composed of read newspaper speech. BREF includes over 100 h of speech from 120 speakers. The text materials were selected from the French newspaper Le Monde, so as to provide a large vocabulary (over 20,000 words) and a wide range of phonetic environments. Prepared speech comes from the development and test sets of the ESTER 2003-2004 and ESTER2 2007-2008 evaluation campaigns (Galliano et al., 2006) totalling about 50 hours of speech. The journalistic speech were selected from various French and francophone (Maghreb and Africa) radios: France Inter, Radio France International, Radio Television du Maroc, France Info. Casual spontaneous speech comes from the NCCFr corpus (Torreira et al., in press), composed of conversations between friends. NCCFr, totalling 36 hours of speech, comprises 23 pairs of speakers (24 males, 22 females) producing conversation of about 90 minutes each. recorded in 2007 in Paris Each corpus is hereafter called BREF, ESTER, NCCFr respectively. All this corpus comprise manual or-thographic transcriptions, which have been phonetised and automatically aligned."]},{"title":"6. Experiments","paragraphs":["The “frst experiment aims at measuring the durations of the automatically aligned phonemes for the three corpora. This is done in order to visualise the distribution of phoneme durations for each speaking style and to select the phonemes according to their duration. The result of this experiment is drawn in “fgure 1. As seen on this “fgure, the distributions are quite similar for BREF and ESTER, with a slight shift to the left for ESTER. This shift may be due to the effect of speaking rate, which should be faster for prepared journalistic speech than for read speech."]},{"title":"607","paragraphs":["0,00 0,02 0,04 0,06 0,08 0,10 0,12 0,14 0,16 0,18 0,20 0,22 0,24 0,26 0,28 0,300,00 0,05 0,10 0,15 0,20","0,25 BREF (read) ESTER (prepared) NCCFr (spontaneous) Duration (s) Figure 1: Duration distribution for each corpus. X-axis : duration in seconds, Y-axis : estimation of the probability The shape of the distribution for the NCCFr corpus is however very different. We can observe a peak for phonemes of 30 ms duration, which is the shorter duration allowed by the automatic alignment. This may be an effect of conversational spontaneous speech, for which some phonemes might be subject to deletion (see (Adda-Decker et al., 2008) for more details on this phenomenon). Although the shapes clearly differs, the median value for each distribution is almost the same (between 60 and 70 ms). Thus, we will “frst consider only “normal” length segments, which have a duration between 40 and 120 ms. 6.1. Phoneme reduction ratio & variance","extension The phoneme reduction ratio and variance extension ratio are computed on our data using the same formula respectively described in sections 3.2., equation 1 and 3.3., equation 2. The reference corpus R, used for all the following experiments, is the BREF corpus. As we can observe on the “frst two columns of “fgure 2, the spectral space reduction is observed mainly for the ESTER corpus. For this corpus, almost all the phonemes have a reduced spectral space, except /i/ and /y/. However, for NCCFr, the spectral reduction phenomenon is not as obvious. In fact, the spectral space seems almost identical to that of read speech, with a few exceptions. The results on the spectral variance extension, shown on the last two columns of “fgure 2, are in accordance with our expectations. The spectral variance is in-dubitably increased for ESTER, and even more for ERNESTUS. 6.2. Influence of segment duration As the results from the previous section are a bit surprising, we have therefore investigated if the observed reduction phenomenon may be emphasised or not for short or long segments, short segments being segments ESTER red NCCFr red","B","R","E","F E S T E R 1 0, 95 1 0, 76 1 0, 77 1 0, 7 1 0, 67 1 0, 72 1 0, 97 1 0, 79 1 0, 77 1 0, 72 1 0, 78 1 0, 8 1 0, 86","i O A I x @ y u o c a E e 00,40,81,21,6","B","R","E","F 1 1, 07 1 0, 85 1 0, 88 1 1, 04 1 1, 01 1 1, 07 1 1, 01 1 1, 01 1 0, 97 1 0, 89 1 0, 78 1 0, 85 1 1, 09 N C C F r","i O A I x @ y u o c a E e 00,40,81,21,6","B","R","E","F E S T E R","p 1 0 , 5 3","w 1 0 , 8 9","h 1 1 , 0 3","j 1 0 , 8 6","r 1 0 , 6 1 1 0 , 6 9","N 1 0 , 4 6","n 1 0 , 7 4","m 1 0 , 7 3","Z 1 1 , 2 3","z 1 0 , 8 8","v 1 1 , 1 1","S 1 0 , 7 2","s 1 1 , 1 3","f 1 1 , 0 6","g 1 1 , 0 9","d 1 0 , 9 4","b 1 0 , 8 3","k 1 0 , 5 1","t 1 0 , 5 2 p w h j r N n m Z z v S s f g d b k t l l pw h j r l N n m Z z v S s f gd b k t 00,40,81,21,6","B","R","E","F","p 1 0 , 2 8","w 1 0 , 8 3","h 1 1 , 0 9","j 1 0 , 8 3","r 1 0 , 7 4 1 0 , 9 6","N 1 0 , 9 3","n 1 0 , 8 1","m 1 0 , 7 8","Z 1 0 , 9","z 1 0 , 9 8","v 1 1 , 2 7","S 1 0 , 5 2","s 1 0 , 7 9","f 1 0 , 3 9","g 1 0 , 9 3","d 1 1 , 0 6","b 1 0 , 7 2","k 1 0 , 3","t 1 0 , 3 5 p w h j r N n m Z z v S s f g d b k t N C C F r l l pw h j r l N n m Z z v S s f gd b k t 00,40,81,21,6 ESTER ext NCCFr ext","B","R","E","F E S T E R 1 1, 24 1 1, 24 1 1, 25 1 1, 27 1 1, 26 1 1, 24 1 1, 22 1 1, 16 1 1, 17 1 1, 18 1 1, 25 1 1, 22 1 1, 24 1, 24 1, 3 1, 24 1, 41 1, 25 1, 29 1, 27 1, 37 1, 26 1, 25 1, 24 1, 18 1, 22 1, 35 1, 16 1, 26 1, 17 1, 24 1, 18 1, 21 1, 25 1, 31 1, 22 1, 35 1, 24 1, 25","i O A I x @ y u o c a E e 00,40,81,21,6","B","R","E","F 1 1, 3 1 1, 41 1 1, 29 1 1, 37 1 1, 25 1 1, 18 1 1, 35 1 1, 26 1 1, 24 1 1, 21 1 1, 31 1 1, 35 1 1, 25 1, 24 1, 24 1, 25 1, 27 1, 26 1, 24 1, 22 1, 16 1, 17 1, 18 1, 25 1, 22 1, 24 N C C F r","i O A I x @ y u o c a E e 00,40,81,21,6","B","R","E","F E S T E R","p 1 1 , 1 4","w 1 1 , 0 2","h 1 1 , 0 7","j 1 1 , 1","r 1 1 , 0 7 1 1 , 1 5","N 1 1 , 2","n 1 1 , 1","m 1 1 , 0 4","Z 1 0 , 9 8","z 1 0 , 9 9","v 1 1 , 0 7","S 1 1 , 1 7","s 1 1 , 1 7","f 1 1 , 5","g 1 0 , 9 5","d 1 1 , 0 6","b 1 1 , 1 3","k 1 1 , 1 8","t 1 1 , 0 4","p","1 , 1 4 1 , 3 4","w","1 , 0 2 1 , 2 1","h","1 , 0 7 1 , 4 5","j 1 , 1 1 , 1 5","r","1 , 0 7 1 , 1 5","1 , 1 5 1 , 2 1","N 1 , 2 1 , 2","n 1 , 1 1 , 3 6","m","1 , 0 4 1 , 1 6","Z","0 , 9 8 1 , 0 4","z","0 , 9 9 1 , 0 4","v","1 , 0 7 1 , 2 8","S","1 , 1 7 1 , 0 6","s","1 , 1 7 1 , 3 1","f 1 , 5 1 , 6 7","g","0 , 9 5 1 , 0 6","d","1 , 0 6 1 , 2 1","b","1 , 1 3 1 , 2 3","k","1 , 1 8 1 , 3 2","t","1 , 0 4 1 , 2 1","f","g","d","b","k","t l l pw h j r l N n m Z z v S s f gd b k t 00,40,81,21,6 B R E F","p 1 1 , 3","4","w 1 1 , 2","1","h 1 1 , 4","5","j 1 1 , 1","5","r 1 1 , 1","5 1 1 , 2","1","N 1 1 ,","2","n 1 1 , 3","6","m 1 1 , 1","6","Z 1 1 , 0","4","z 1 1 , 0","4","v 1 1 , 2","8","S 1 1 , 0","6","s 1 1 , 3","1","f 1 1 , 6","7","g 1 1 , 0","6","d 1 1 , 2","1","b 1 1 , 2","3","k 1 1 , 3","2","t 1 1 , 2","1","p 1 , 1 4","w 1 , 0 2","h 1 , 0 7","j 1 , 1","r 1 , 0 7 1 , 1 5","N 1 , 2","n 1 , 1","m 1 , 0 4","Z 0 , 9 8","z 0 , 9 9","v 1 , 0 7","S 1 , 1 7","s 1 , 1 7","f 1 , 5","g 0 , 9 5","d 1 , 0 6","b 1 , 1 3","k 1 , 1 8","t 1 , 0 4","f","g","d","b","k","t N C C F r l l pw h j r l N n m Z z v S s f gd b k t 00,40,81,21,6 Figure 2: spectral reduction ratio (red) and variance extension (ext) for the ESTER and NCCFr corpora compared with BREF under 40 ms duration, long segments being over 120 ms. Figure 3 shows the spectral reduction ratio for the ESTER and NCCFr corpora compared to BREF for both duration conditions. We observe that for short segments, especially for the NCCFr corpus, the spectral space is quite reduced. Even given the short duration of those segments, this phenomenon should not be neglected as short segments are indeed frequent in our conversational speech corpus. We can note however that the spectral space reduction is not very important for longer segments. The variance extension ratio has also been computed for both duration conditions (see “fgure 4). The “fgures show that the variance of phonemes are extended for both conditions. The extension appears to be stronger for short segments of conversational speech as opposed to long segments. This phenomenon is observed for both speaking styles."]},{"title":"608","paragraphs":["ESTER vowels NCCFr vowels ESTER consonants NCCFr consonantsB","R","E","F E S T E R 1 0, 86 1 0, 58 1 0, 72 1 0, 59 1 0, 47 1 0, 59 1 0, 83 1 0, 69 1 0, 75 1 0, 64 1 0, 69 1 0, 64 1 0, 75","i O A I x @ y u o c a E e 00 , 40 , 81 , 21 , 6","B","R","E","F 1 0, 68 1 0, 63 1 0, 61 1 1, 01 1 0, 76 1 0, 81 1 0, 71 1 0, 45 1 0, 76 1 0, 81 1 0, 7 1 0, 63 1 0, 89 N C C F r","i O A I x @ y u o c a E e 00 , 40 , 81 , 21 , 6","B","R","E","F E S T E R","p 1 0 , 5 3","w 1 0 , 8 9","h 1 1 , 0 3","j 1 0 , 8 6","r 1 0 , 6 1 1 0 , 6 9","N 1 0 , 4 6","n 1 0 , 7 4","m 1 0 , 7 3","Z 1 1 , 2 3","z 1 0 , 8 8","v 1 1 , 1 1","S 1 0 , 7 2","s 1 1 , 1 3","f 1 1 , 0 6","g 1 1 , 0 9","d 1 0 , 9 4","b 1 0 , 8 3","k 1 0 , 5 1","t 1 0 , 5 2 p w h j r N n m Z z v S s f g d b k t l l","p w h j r l N n","m Z z v S s f gd b kt 00 , 40 , 81 , 21 , 6","B","R","E","F","p 1 0 , 2 8","w 1 0 , 8 3","h 1 1 , 0 9","j 1 0 , 8 3","r 1 0 , 7 4 1 0 , 9 6","N 1 0 , 9 3","n 1 0 , 8 1","m 1 0 , 7 8","Z 1 0 , 9","z 1 0 , 9 8","v 1 1 , 2 7","S 1 0 , 5 2","s 1 0 , 7 9","f 1 0 , 3 9","g 1 0 , 9 3","d 1 1 , 0 6","b 1 0 , 7 2","k 1 0 , 3","t 1 0 , 3 5 p w h j r N n m Z z v S s f g d b k t N C C F r l l","p w h j r l N n","m Z z v S s f gd b kt 00 , 40 , 81 , 21 , 6","B","R","E","F E S T E R 1 0, 92 1 0, 75 1 0, 75 1 0, 8 1 0, 67 1 0, 75 1 0, 92 1 0, 78 1 0, 74 1 0, 77 1 0, 88 1 0, 84 1 0, 85","i O A I x @ y u o c a E e 00 , 40 , 81 , 21 , 6","B","R","E","F 1 1, 12 1 0, 94 1 0, 93 1 1, 18 1 0, 88 1 0, 99 1 1, 05 1 1 1 0, 92 1 0, 85 1 0, 8 1 0, 82 1 1, 05 N C C F r","i O A I x @ y u o c a E e 00 , 40 , 81 , 21 , 6","B","R","E","F E S T E R","p 1 0 , 4 8","w 1 0 , 7 4","h 1 1 , 0 4","j 1 0 , 9","r 1 0 , 9 1 1 0 , 9 7","N 1 0 , 8 9","n 1 0 , 7 5","m 1 0 , 7 8","Z 1 0 , 8 7","z 1 1 , 0 2","v 1 1 , 2 8","S 1 0 , 9 8","s 1 0 , 9 3","f 1 1","g 1 1 , 1","d 1 0 , 9 5","b 1 0 , 8 5","k 1 0 , 6 5","t 1 0 , 5 5 p w h j r N n m Z z v S s f g d b k t l l","p w h j r l N n","m Z z v S s f gd b kt 00 , 40 , 81 , 21 , 6","B","R","E","F","p 1 0 , 5 4","w 1 0 , 8 4","h 1 1 , 3 1","j 1 1 , 1 5","r 1 1 , 1 3 1 1 , 2 6","N 1 1 , 1 1","n 1 1 , 0 5","m 1 1 , 1 1","Z 1 0 , 8 9","z 1 1 , 2 3","v 1 1 , 4 3","S 1 0 , 8 9","s 1 0 , 8 1","f 1 0 , 9 3","g 1 1 , 1 8","d 1 1 , 2","b 1 1 , 1 3","k 1 0 , 6 8","t 1 0 , 7 3 p w h j r N n m Z z v S s f g d b k t N C C F r l l","p w h j r l N n","m Z z v S s f gd b kt 00 , 40 , 81 , 21 , 6 Figure 3: spectral reduction ratio for the ESTER and NCCFr corpora compared with BREF for different phoneme durations. “frst line : short phonemes, second line : long phonemes (>120ms) ESTER vowels NCCFr vowels ESTER consonants NCCFr consonantsB","R","E","F E S T E R 1 1, 24 1 1, 31 1 1, 03 1 0, 97 1 1, 33 1 1, 39 1 1, 18 1 1, 24 1 1, 15 1 1, 19 1 1, 11 1 1, 19 1 1, 19 1, 24 1, 45 1, 31 1, 46 1, 03 1, 14 0, 97 1, 14 1, 33 1, 33 1, 39 1, 36 1, 18 1, 37 1, 24 1, 59 1, 15 1, 31 1, 19 1, 26 1, 11 1, 18 1, 19 1, 49 1, 19 1, 4","i O A I x @ y u o c a E e 00 , 40 , 81 , 21 , 6","B","R","E","F 1 1, 45 1 1, 46 1 1, 14 1 1, 14 1 1, 33 1 1, 36 1 1, 37 1 1, 59 1 1, 31 1 1, 26 1 1, 18 1 1, 49 1 1, 4 1, 24 1, 31 1, 03 0, 97 1, 33 1, 39 1, 18 1, 24 1, 15 1, 19 1, 11 1, 19 1, 19 N C C F r","i O A I x @ y u o c a E e 00 , 40 , 81 , 21 , 6","B","R","E","F E S T E R","p 1 1 , 1 4","w 1 1 , 0 2","h 1 1 , 0 7","j 1 1 , 1","r 1 1 , 0 7 1 1 , 1 5","N 1 1 , 2","n 1 1 , 1","m 1 1 , 0 4","Z 1 0 , 9 8","z 1 0 , 9 9","v 1 1 , 0 7","S 1 1 , 1 7","s 1 1 , 1 7","f 1 1 , 5","g 1 0 , 9 5","d 1 1 , 0 6","b 1 1 , 1 3","k 1 1 , 1 8","t 1 1 , 0 4","p 1 , 1 4 1 , 3 4","w 1 , 0 2 1 , 2 1","h 1 , 0 7 1 , 4 5","j 1 , 1 1 , 1 5","r 1 , 0 7 1 , 1 5 1 , 1 5 1 , 2 1","N 1 , 2 1 , 2","n 1 , 1 1 , 3 6","m 1 , 0 4 1 , 1 6","Z 0 , 9 8 1 , 0 4","z 0 , 9 9 1 , 0 4","v 1 , 0 7 1 , 2 8","S 1 , 1 7 1 , 0 6","s 1 , 1 7 1 , 3 1","f 1 , 5 1 , 6 7","g 0 , 9 5 1 , 0 6","d 1 , 0 6 1 , 2 1","b 1 , 1 3 1 , 2 3","k 1 , 1 8 1 , 3 2","t 1 , 0 4 1 , 2 1","f","g","d","b","k","t l l","p w h j r l N n","m Z z v S s f gd b kt 00 , 40 , 81 , 21 , 6 B R E F","p 1 1 , 3 4","w 1 1 , 2 1","h 1 1 , 4 5","j 1 1 , 1 5","r 1 1 , 1 5 1 1 , 2 1","N 1 1 , 2","n 1 1 , 3 6","m 1 1 , 1 6","Z 1 1 , 0 4","z 1 1 , 0 4","v 1 1 , 2 8","S 1 1 , 0 6","s 1 1 , 3 1","f 1 1 , 6 7","g 1 1 , 0 6","d 1 1 , 2 1","b 1 1 , 2 3","k 1 1 , 3 2","t 1 1 , 2 1","p 1 , 1 4","w 1 , 0 2","h 1 , 0 7","j 1 , 1","r 1 , 0 7 1 , 1 5","N 1 , 2","n 1 , 1","m 1 , 0 4","Z 0 , 9 8","z 0 , 9 9","v 1 , 0 7","S 1 , 1 7","s 1 , 1 7","f 1 , 5","g 0 , 9 5","d 1 , 0 6","b 1 , 1 3","k 1 , 1 8","t 1 , 0 4","f","g","d","b","k","t N C C F r l l","p w h j r l N n","m Z z v S s f gd b kt 00 , 40 , 81 , 21 , 6","B","R","E","F E S T E R 1 1, 24 1 1, 23 1 1, 26 1 1, 25 1 1, 23 1 1, 3 1 1, 15 1 1, 26 1 1, 31 1 1, 37 1 1, 29 1 1, 36 1 1, 25 1, 24 1, 23 1, 23 1, 38 1, 26 1, 24 1, 25 1, 21 1, 23 1, 23 1, 3 1, 25 1, 15 1, 18 1, 26 1, 28 1, 31 1, 4 1, 37 1, 54 1, 29 1, 34 1, 36 1, 47 1, 25 1, 16","i O A I x @ y u o c a E e 00 , 40 , 81 , 21 , 6","B","R","E","F 1 1, 23 1 1, 38 1 1, 24 1 1, 21 1 1, 23 1 1, 25 1 1, 18 1 1, 28 1 1, 4 1 1, 54 1 1, 34 1 1, 47 1 1, 16 1, 24 1, 23 1, 26 1, 25 1, 23 1, 3 1, 15 1, 26 1, 31 1, 37 1, 29 1, 36 1, 25 N C C F r","i O A I x @ y u o c a E e 00 , 40 , 81 , 21 , 6","B","R","E","F E S T E R","p 1 2 , 1 3","w 1 1 , 2 6","h 1 1 , 2 1","j 1 1 , 2 3","r 1 0 , 9 6 1 1 , 0 9","N 1 1 , 1 2","n 1 1 , 2 8","m 1 1 , 1 4","Z 1 1 , 0 4","z 1 1 , 0 8","v 1 1 , 0 4","S 1 1 , 2 6","s 1 1 , 6 1","f 1 1 , 5 7","g 1 1 , 1 5","d 1 1 , 1 8","b 1 1 , 2 9","k 1 1 , 3 5","t 1 1 , 8 8","p 2 , 1 3 2","w 1 , 2 6 1 , 1 8","h 1 , 2 1 1 , 4 4","j 1 , 2 3 1 , 0 4","r 0 , 9 6 0 , 9 6 1 , 0 9 1 , 0 1","N 1 , 1 2 1 , 2 4","n 1 , 2 8 1 , 2","m 1 , 1 4 1 , 0 2","Z 1 , 0 4 0 , 9 5","z 1 , 0 8 0 , 9 7","v 1 , 0 4 1 , 0 2","S 1 , 2 6 0 , 9 8","s 1 , 6 1 0 , 9 7","f 1 , 5 7 0 , 9 3","g 1 , 1 5 1 , 0 6","d 1 , 1 8 1 , 1 4","b 1 , 2 9 1 , 2 8","k 1 , 3 5 1 , 2 1","t 1 , 8 8 1 , 5","g","d","b","k","t l l","p w h j r l N n","m Z z v S s f gd b kt 00 , 40 , 81 , 21 , 6","B","R","E","F","p 1 2","w 1 1 , 1 8","h 1 1 , 4 4","j 1 1 , 0 4","r 1 0 , 9 6 1 1 , 0 1","N 1 1 , 2 4","n 1 1 , 2","m 1 1 , 0 2","Z 1 0 , 9 5","z 1 0 , 9 7","v 1 1 , 0 2","S 1 0 , 9 8","s 1 0 , 9 7","f 1 0 , 9 3","g 1 1 , 0 6","d 1 1 , 1 4","b 1 1 , 2 8","k 1 1 , 2 1","t 1 1 , 5","p 2 , 1 3","w 1 , 2 6","h 1 , 2 1","j 1 , 2 3","r 0 , 9 6 1 , 0 9","N 1 , 1 2","n 1 , 2 8","m 1 , 1 4","Z 1 , 0 4","z 1 , 0 8","v 1 , 0 4","S 1 , 2 6","s 1 , 6 1","f 1 , 5 7","g 1 , 1 5","d 1 , 1 8","b 1 , 2 9","k 1 , 3 5","t 1 , 8 8","g","d","b","k","t N C C F r l l","p w h j r l N n","m Z z v S s f gd b kt 00 , 40 , 81 , 21 , 6 Figure 4: spectral variance extension ratio for the ESTER and NCCFr corpora compared with BREF for different phoneme durations.“frst line : short phonemes, second line : long phonemes (>120ms) 6.3. Influence of lexical content In this section, we will focus of acoustic differences that might be observed while considering the role of the words. We have distinguished function and content words, based on the word frequency in each corpus. First, words are ranged in decreasing frequencies. Function words are then isolated using the following paradigm: they are the 100 most frequent words, as long as their cumulated count is less than 50% of all the words in the corpus. Some content words occur-ing in this list are manually removed: as we deal here with french news corpora (BREF and ESTER), some of the most frequent words are for example “France”, “Monsieur”, “président”. Moreover, function words do not cover all the french phonemes equally. We have thus removed from the analysis the phonemes that occur less than 1000 times. Those omitted phonemes are : /c o @/ and /b g S v N r h w/. The results of the analysis are shown in “fgure 5 for the spectral space reduction, and in “fgure 6 for the variance extension. Figure 5 shows that the spectral space is always more conserved for the content words than for the function words. The variance extension ratio is larger for the vowels contained in function words than for content words."]},{"title":"7. Discussion","paragraphs":["Nakamura, in (Nakamura et al., 2008) seems to provide results showing quite clearly the effects of spectral space reduction and spectral variance extension in Japanese. On his data, the spectral space is more reduced when the speaking style gets more spontaneous. Similarly, the spectral variance is increased for spontaneous data. In our experiments on French data, we have been able to observe the same phenomenon for the spectral variance. The tests carried on“normal”duration phonemes do not however show the same behaviour for the spectral reduction. The spectral space is more reduced for"]},{"title":"609","paragraphs":["ESTER vowels NCCFr vowels ESTER consonants NCCFr consonants","B","R","E","F E S T E R 1 0 , 9 4 1 , 1","4 1 0 , 7 8 0 , 8","5 1 0 , 7 9 0 , 8","9 1 0 , 7 1 1 , 1","4 1 0 , 7 1 1 , 1","2 1 0 , 9 6 1 , 0","6 1 0 , 7 6 1 , 0","2 1 0 , 8 1 0 , 7","8 1 0 , 7 9 0 , 7","9 1 0 , 8 7 1 , 0","7","0 , 9 6 1 , 0 5","0 , 7 5 0 , 8 7","0 , 7 6 0 , 8 7","0 , 6 9 0 , 9 9","0 , 6 7 0 , 9 3","0 , 7 3 1 , 0 8","0 , 9 8 0 , 9 6 0 , 8 1 , 0 1","0 , 7 5 0 , 9 9","0 , 7 1 0 , 9","0 , 7 7 0 , 7 8 0 , 8 0 , 8 8","0 , 8 4 1 , 0 7 i O A I x y u a E e 00 , 40 , 81 , 21 , 6","B","R","E","F 1 1 , 1 4 1 0 , 8 5 1 0 , 8 9 1 1 , 1 4 1 1 , 1 2 1 1 , 0 6 1 1 , 0 2 1 0 , 7 8 1 0 , 7 9 1 1 , 0 7 0 , 9 6 1 , 0 5 0 , 7 5 0 , 8 7 0 , 7 6 0 , 8 7 0 , 6 9 0 , 9 9 0 , 6 7 0 , 9 3 0 , 7 3 1 , 0 8 0 , 9 8 0 , 9 6 0 , 8 1 , 0 1 0 , 7 5 0 , 9 9 0 , 7 1 0 , 9 0 , 7 7 0 , 7 8 0 , 8 0 , 8 8 0 , 8 4 1 , 0 7 N C C F r i O A I x y u a E e 00 , 40 , 81 , 21 , 6","B","R","E","F E S T E R 1 0 , 5 4 0",",","5","7 1 0 , 8 6 1",",","0","6 1 0 , 9 7 1",",","2","8 1 0 , 8 3 0",",","9","7 1 0 , 8 5","1 1 0 , 9 0",",","9","2 1 1 , 0 9 1",",","4","3 1 0 , 9 6","0",",","8 1 1 , 1 9 0",",","9","1 1 0 , 9 8 1",",","2","9 1 0 , 7 8 0",",","6","3 1 0 , 6 5 0",",","8","1","0",", 5 3 0 , 5 9","0",", 7 3 0 , 8 6","1 , 1 1 , 3 5","1",", 0 2 0 , 9 4","0",", 8 8 1 , 1 2","0",", 9 5 1 , 2","0",", 8 5 1 , 0 4","0",", 8 2 1 , 0 6","0",", 8 1 1 , 0 4","0",", 8 3 0 , 7 5","1",", 1 1 1 , 1 8","1",", 1 2 1 , 6","0",", 9 6 0 , 8 5","0",", 8 8 0 , 8 2","0",", 9 3 0 , 9","1",", 1 3 1 , 4 8","0",", 9 4 1 , 2 5","0 , 9 1 , 1 8","0",", 7 3 0 , 6 3","0",", 6 8 0 , 7 1","p j l n m","Z z s f d k t 00,40,81,21,6","B","R","E","F 1 0 , 5 7 1 1 , 0 6 1 1 , 2 8 1 0 , 9 7 1 1 1 0 , 9 2 1 1 , 4 3 1 0 , 8 1 0 , 9 1 1 1 , 2 9 1 0 , 6 3 1 0 , 8 1","0 , 5 3 0 , 5 9","0 , 7 3 0 , 8 6 1 , 1 1 , 3 5","1 , 0 2 0 , 9 4","0 , 8 8 1 , 1 2","0 , 9 5 1 , 2","0 , 8 5 1 , 0 4","0 , 8 2 1 , 0 6","0 , 8 1 1 , 0 4","0 , 8 3 0 , 7 5","1 , 1 1 1 , 1 8","1 , 1 2 1 , 6","0 , 9 6 0 , 8 5","0 , 8 8 0 , 8 2","0 , 9 3 0 , 9","1 , 1 3 1 , 4 8","0 , 9 4 1 , 2 5 0 , 9 1 , 1 8","0 , 7 3 0 , 6 3","0 , 6 8 0 , 7 1 N C C F r","p j l n m","Z z s f d k t 00,40,81,21,6","B","R","E","F E S T E R 1 0 , 9 6 1 , 0","5 1 0 , 7 5 0 , 8","7 1 0 , 7 6 0 , 8","7 1 0 , 6 9 0 , 9","9 1 0 , 6 7 0 , 9","3 1 0 , 9 8 0 , 9","6 1 0 , 8 1 , 0","1 1 0 , 7 7 0 , 7","8 1 0 , 8 0 , 8","8 1 0 , 8 4 1 , 0","7","0 , 9 6 1 , 0 5","0 , 7 5 0 , 8 7","0 , 7 6 0 , 8 7","0 , 6 9 0 , 9 9","0 , 6 7 0 , 9 3","0 , 7 3 1 , 0 8","0 , 9 8 0 , 9 6 0 , 8 1 , 0 1","0 , 7 5 0 , 9 9","0 , 7 1 0 , 9","0 , 7 7 0 , 7 8 0 , 8 0 , 8 8","0 , 8 4 1 , 0 7 i O A I x y u a E e 00 , 40 , 81 , 21 , 6","B","R","E","F 1 1 , 0 5 1 0 , 8 7 1 0 , 8 7 1 0 , 9 9 1 0 , 9 3 1 0 , 9 6 1 1 , 0 1 1 0 , 7 8 1 0 , 8 8 1 1 , 0 7 0 , 9 6 1 , 0 5 0 , 7 5 0 , 8 7 0 , 7 6 0 , 8 7 0 , 6 9 0 , 9 9 0 , 6 7 0 , 9 3 0 , 7 3 1 , 0 8 0 , 9 8 0 , 9 6 0 , 8 1 , 0 1 0 , 7 5 0 , 9 9 0 , 7 1 0 , 9 0 , 7 7 0 , 7 8 0 , 8 0 , 8 8 0 , 8 4 1 , 0 7 N C C F r i O A I x y u a E e 00 , 40 , 81 , 21 , 6","B","R","E","F E S T E R 1 0 , 5 3 0",",","5","9 1 1 , 0 2 0",",","9","4 1 0 , 9 5","1",",","2 1 0 , 8 2 1",",","0","6 1 0 , 8 1 1",",","0","4 1 0 , 8 3 0",",","7","5 1 1 , 1 1 1",",","1","8 1 0 , 8 8 0",",","8","2 1 0 , 9 3","0",",","9 1 0 , 9 4 1",",","2","5 1 0 , 7 3 0",",","6","3 1 0 , 6 8 0",",","7","1","0",", 5 3 0 , 5 9","0",", 7 3 0 , 8 6","1 , 1 1 , 3 5","1",", 0 2 0 , 9 4","0",", 8 8 1 , 1 2","0",", 9 5 1 , 2","0",", 8 5 1 , 0 4","0",", 8 2 1 , 0 6","0",", 8 1 1 , 0 4","0",", 8 3 0 , 7 5","1",", 1 1 1 , 1 8","1",", 1 2 1 , 6","0",", 9 6 0 , 8 5","0",", 8 8 0 , 8 2","0",", 9 3 0 , 9","1",", 1 3 1 , 4 8","0",", 9 4 1 , 2 5","0 , 9 1 , 1 8","0",", 7 3 0 , 6 3","0",", 6 8 0 , 7 1","p j l n m","Z z s f d k t 00,40,81,21,6","B","R","E","F 1 0 , 5 9 1 0 , 9 4 1 1 , 2 1 1 , 0 6 1 1 , 0 4 1 0 , 7 5 1 1 , 1 8 1 0 , 8 2 1 0 , 9 1 1 , 2 5 1 0 , 6 3 1 0 , 7 1","0 , 5 3 0 , 5 9","0 , 7 3 0 , 8 6 1 , 1 1 , 3 5","1 , 0 2 0 , 9 4","0 , 8 8 1 , 1 2","0 , 9 5 1 , 2","0 , 8 5 1 , 0 4","0 , 8 2 1 , 0 6","0 , 8 1 1 , 0 4","0 , 8 3 0 , 7 5","1 , 1 1 1 , 1 8","1 , 1 2 1 , 6","0 , 9 6 0 , 8 5","0 , 8 8 0 , 8 2","0 , 9 3 0 , 9","1 , 1 3 1 , 4 8","0 , 9 4 1 , 2 5 0 , 9 1 , 1 8","0 , 7 3 0 , 6 3","0 , 6 8 0 , 7 1 N C C F r","p j l n m","Z z s f d k t 00,40,81,21,6 Figure 5: spectral reduction ratio for the ESTER and NCCFr corpora compared with BREF for different word classes. “frst line : function words, second line : content words ESTER vowels NCCFr vowels ESTER consonants NCCFr consonants","B","R","E","F E S T E R 1 1 , 2 2 1 , 2 1 1 , 3 3 1 , 6 5 1 1 , 2 5 1 , 2 6 1 1 , 2 5 1 , 2 9 1 1 , 3 1 , 1 9 1 1 , 2 5 1 , 3 3 1 1 , 1 7 1 , 1 9 1 1 , 2 8 1 , 3 4 1 1 , 2 8 1 , 4 1 1 1 , 3 2 1 , 3 1 E R R O R :","d","i","me","n","si","o","n","n","1","mu","st","b","e","p","o","si","t","i","ve","G","S","L","1",":","1 , 3 0 , 9 9 E R R O R :","d","i","me","n","si","o","n","n","1","mu","st","b","e","p","o","si","t","i","ve","G","S","L","1",":","1",",","1 8","1",",","3 5 1 , 3 9","i","n","i","t","_","so","u","rce",".","c:","2","9 : ma t r i x","i","n","t","e","g","e","r","e rro r h a n d l e r i n vo","ke","d",".","p a rse e rro r","i","n","i","t","_","so","u","rce",".","c:","2","9 : ma t r i x","i","n","t","e","g","e","r","e rro r h a n d l e r i n vo","ke","d",".","p a rse e rro r i O A I x y u a E e 00 , 40 , 81 , 21 , 6","B","R","E","F 1 1 , 2 1 1 , 6 5 1 1 , 2 6 1 1 , 2 9 1 1 , 1 9 1 1 , 3 3 1 1 , 1 9 1 1 , 3 4 1 1 , 4 1 1 1 , 3 1 d i me n si o n n 1","mu","st","b","e","p","o","si","t","i","ve","G","S","L","1",":","1",",","3 d i me n si o n n 1","mu","st","b","e","p","o","si","t","i","ve","G","S","L","1",":","1",",","1","8","1",",","3","5 N C C f r","i","n","i","t _ so u rce . c: 2 9 : ma t r i x","i","n","t","e","g","e","r h a n d l e r","i","n","vo","ke","d",". e rro r","i","n","i","t _ so u rce . c: 2 9 : ma t r i x","i","n","t","e","g","e","r h a n d l e r","i","n","vo","ke","d",". e rro r i O A I x y u a E e 00 , 40 , 81 , 21 , 6","B","R","E","F E S T E R","1 1 , 8 3 1 , 5","5","1 1 , 2 1 ,","2","1 1 , 1 4 1 , 0","6","1 1 , 2 2 1 ,","3","1 1 , 1 1 1 , 1","3","1 1 , 2 1 , 1","2","1 1 , 1 6 1 , 0","9","1 1 , 5 4 1 , 0","9","1 1 , 4","1","1 1 , 2 1 1 , 2","3","1 1 , 1 1 1 , 0","9","1 1 , 3 1 1 , 1","9","1",",","1","3 1 , 4 7 E R R O R :","d","i","m","e","n","si","o","n","n","1","m","u","st","b","e","p","o","si","t","i","ve","G","S","L","1",":","1",",","0","2 1 , 2","0",",","9","8 0 , 9 9 E R R O R :","d","i","m","e","n","si","o","n","n","1","m","u","st","b","e","p","o","si","t","i","ve","G","S","L E R R O R :","d","i","m","e","n","si","o","n","n","1","m","u","st","b","e","p","o","si","t","i","ve","G","S","L E R R O R :","d","i","m","e","n","si","o","n","n","1","m","u","st","b","e","p","o","si","t","i","ve","G","S","L","1",":","1",":","0",",","9 1 , 1 8","1",",","4","3","1",",","5","6","E","R","R","O","R",": d i m e n si o n n 1","m","u","st","b","e","p","o","si","t","i","ve","G","S","L","E","R","R","O","R",": d i m e n si o n n 1","m","u","st","b","e","p","o","si","t","i","ve","G","S","L","1",":","2",":","E","R","R","O","R",": d i m e n si o n n 1","m","u","st","b","e","p","o","si","t","i","ve","G","S","L","i","n","i","t","_","so","u","r","ce",".","c:","2","9",": m a t r i x","i","n","t","e","g","e","r","e","r r o r h a n d l e r i n","vo","ke","d",".","p","a r s e e r r o r","i","n","i","t","_","so","u","r","ce",".","c:","2","9",": m a t r i x","i","n","t","e","g","e","r","e","r r o r h a n d l e r i n","vo","ke","d",".","i","n","i","t","_","so","u","r","ce",".","c:","2","9",": m a t r i x","i","n","t","e","g","e","r","e","r r o r h a n d l e r i n","vo","ke","d",".","i","n","i","t","_","so","u","r","ce",".","c:","2","9",": m a t r i x","i","n","t","e","g","e","r","e","r r o r h a n d l e r i n","vo","ke","d",".","p","a r s e e r r o r","p","a r s e e r r o r","i","n","i","t","_","so","u","r","ce",".","c:","2","9",": m a t r i x","i","n","t","e","g","e","r","e","r r o r h a n d l e r i n","vo","ke","d",".","i","n","i","t","_","so","u","r","ce",".","c:","2","9",": m a t r i x","i","n","t","e","g","e","r","e","r r o r h a n d l e r i n","vo","ke","d",".","p","a r s e e r r o r","p","a r s e e r r o r","i","n","i","t","_","so","u","r","ce",".","c:","2","9",": m a t r i x","i","n","t","e","g","e","r","e","r r o r h a n d l e r i n","vo","ke","d",".","p j l n m","Z z s f d k t 00,40,81,21,6","B","R","E","F","1","1",",","5","5","1","1",",","2","1","1",",","0","6","1","1",",","3","1","1",",","1","3","1","1",",","1","2","1","1",",","0","9","1","1",",","0","9","1","1","1","1",",","2","3","1","1",",","0","9","1","1",",","1","9","1",",","1","3 d i m e n s i o n n","1","m","u","s","t","b","e","p","o","s","i","t","i","v","e","G","S","L","1",":","1",",","0","2","0",",","9","8 d i m e n s i o n n","1","m","u","s","t","b","e","p","o","s","i","t","i","v","e","G","S","L d i m e n s i o n n","1","m","u","s","t","b","e","p","o","s","i","t","i","v","e","G","S","L d i m e n s i o n n","1","m","u","s","t","b","e","p","o","s","i","t","i","v","e","G","S","L","1",":","1",":","0",",","9","1",",","4","3","d i m e n s i o n n 1 m","u","s","t","b","e","p","o","s","i","t","i","v","e","G","S","L","d i m e n s i o n n 1 m","u","s","t","b","e","p","o","s","i","t","i","v","e","G","S","L N C C F r","i","n","i","t","_ s o u rc e . c : 2 9 : m a t r i x","i","n","t","e","g","e","r h a n d l e r","i","n","v","o","k","e","d",". e r ro r","i","n","i","t","_ s o u rc e . c : 2 9 : m a t r i x","i","n","t","e","g","e","r h a n d l e r","i","n","v","o","k","e","d",".","i","n","i","t","_ s o u rc e . c : 2 9 : m a t r i x","i","n","t","e","g","e","r h a n d l e r","i","n","v","o","k","e","d",".","i","n","i","t","_ s o u rc e . c : 2 9 : m a t r i x","i","n","t","e","g","e","r h a n d l e r","i","n","v","o","k","e","d",". e r ro r e r ro r","i","n","i","t","_ s o u rc e . c : 2 9 : m a t r i x","i","n","t","e","g","e","r h a n d l e r","i","n","v","o","k","e","d",".","i","n","i","t","_ s o u rc e . c : 2 9 : m a t r i x","i","n","t","e","g","e","r h a n d l e r","i","n","v","o","k","e","d",".","p j l n m","Z z s f d k t 00,40,81,21,6","B","R","E","F E S T E R 1 1 , 2 4 1 , 3","2 1 1 , 2 2 1 , 2","3 1 1 , 2 5 1 ,","3 1 1 , 2 6 1 ,","4 1 1 , 2 1 1 , 2","3 1 1 , 2 1 1 , 3","6 1 1 , 1 4 1 , 2","9 1 1 , 2 4 1 ,","3 1 1 , 2 1 1 , 3","4 1 1 , 2 2 1 , 2","7 1 , 2 1 1 , 1 6 1 , 1 6 1 , 2 4 1 , 1 7 1 , 2 1 i O A I x y u a E e 00 , 40 , 81 , 21 , 6","B","R","E","F 1 1 , 3 2 1 1 , 2 3 1 1 , 3 1 1 , 4 1 1 , 2 3 1 1 , 3 6 1 1 , 2 9 1 1 , 3 1 1 , 3 4 1 1 , 2 7 1 , 2 1 1 , 1 6 1 , 1 7 N C C f r i O A I x y u a E e 00 , 40 , 81 , 21 , 6","B","R","E","F E S T E R 1 1 , 7 4 1 ,","4","4 1 1 , 2 5 1 ,","2","8 1 1 , 1 3 1",",","1 1 1 , 1 7 1 ,","2","4 1 1 , 1 6 1 ,","1","6 1 1 , 0 6 1 ,","0","9 1 1 , 1 6 1 ,","1","7 1 1 , 4 3 0 ,","9","8 1 1 , 4 6 0 ,","9","4 1 1 , 1 9 1 ,","2","4 1 1 , 0 6 1 ,","0","4 1 1 , 3 5 1 ,","0","7","1",",","1 8 1 , 1 9","1",",","1 4 1 , 2 6","0",",","9 2 0 , 9 4","1",",","1 2 1 , 2 2 1 , 1 8 1 , 1 8 1 , 2 3 1 , 0 3 1 , 0 2 1 , 0 8 1 , 3 1 1 , 3 7","p j l n m","Z z s f d k t 00,40,81,21,6","B","R","E","F 1 1 , 4 4 1 1 , 2 8 1 1 , 1 1 1 , 2 4 1 1 , 1 6 1 1 , 0 9 1 1 , 1 7 1 0 , 9 8 1 0 , 9 4 1 1 , 2 4 1 1 , 0 4 1 1 , 0 7","1 , 1 8","1 , 1 4","0 , 9 2","1 , 1 2 1 , 1 8 1 , 2 3 1 , 0 2 1 , 3 1 N C C F r","p j l n m","Z z s f d k t 00,40,81,21,6 Figure 6: spectral variance extension ratio for the ESTER and NCCFr corpora compared with BREF for different word classes. “frst line : function words, second line : content words prepared journalistic speech than for casual spontaneous speech. We have nevertheless been able to observe a strong spectral space reduction for short segments, quite frequent in our spontaneous speech data. Considering the role of words, we have seen that function words tend to be more subject to spectral reduction than content words. This is also true for the variance extension phenomenon, which is more present on function words. However interesting these results may seem, they have to be taken with some caution: the features are indeed extracted at the middle of each phonetic segment, which might lead to false results in some cases, especially when considering consonantal phonemes. Nevertheless, this approach provides a simple way of representing variations occurring between speaking styles, and we plan to carry on further experiments using different features, amongst them prosodic features."]},{"title":"8. References","paragraphs":["Martine Adda-Decker, Philippe Boula de Mareuil, Gilles Adda, and Lori Lamel. 2005. Investigat-ing syllabic structures and their variation in spontaneous french. Speech Communication, 46(2):119– 139.","M. Adda-Decker, Cédric Gendrot, and Noël Nguyen. 2008. Contributions du traitement automatique de la parole à l’étude des voyelles orales du français. Traitement Automatique des Langues, 49.","Petr Fousek, Lori Lamel, and Jean-Luc Gauvain. 2008. Transcribing Broadcast Data Using MLP Features. In InterSpeech’08, pages 1433–1436, Brisbane, Australia, September 22-26.","Sadaoki Furui. 2003. Recent advances in spontaneous speech recognition and understanding. In ISCA & IEEE workshop on Spontaneous Speech Processing and Recognition (SSPR).","S. Galliano, E. Geoffrois, Guillaume Gravier, J.-F. Bonastre, M. Mostefa, and K. Choukri. 2006. Corpus description of the ester evaluation campaign for"]},{"title":"610","paragraphs":["the rich transcription of french broadcast news. In Language Evaluation and Ressources Conference.","K. Itou, M. Yamamoto, K. Takeda, T. Takezawa, T. Matsuoka, T. Kobayashi, K. Shikano, and S. Itahashi. 1999. Jnas: Japanese speech corpus for large vocabulary continuous speech recognition research. Journal of the acoustical society of Japan, 20(3):199– 206.","L. Lamel, J. L. Gauvain, and M Eskenazi. 1991. Bref, a large vocabulary spoken corpus for french. In Eurospeech.","K. Maekawa. 2003. Corpus of spontaneous japanese: its design and evaluation. In ISCA & IEEE workshop on Spontaneous Speech Processing and Recognition (SSPR).","Masanobu Nakamura, Koji Iwano, and Sadaoki Furui. 2008. Differences between acoustic characteristics of spontaneous and read speech and their effects on speech recognition performance. Computer Speech and Language, 22:171–184.","F. Torreira, M. Adda-Decker, and M. Ernestus. in press. The nijmegen corpus of casual french. Speech Communication.","R. J. J. H. van Son and Louis C. W. Pols. 1999. An acoustic description of consonant reduction. Speech Communication, 28(2):125 – 140."]},{"title":"611","paragraphs":[]}]}