{"sections":[{"title":"BOOK REVIEWS","paragraphs":["SURFACE COMPOSITIONAL GRAMMAR Roland R. Hausser Studies in Theoretical Linguistics, Wilhelm Fink Verlag, Munich, 1984, 275 pp. Hausser's"]},{"title":"Surface Compositional Grammar","paragraphs":["(henceforth SCG) is intended to be one component of a global model of human communication, which is called here a \"Speaker Simulation Device\". The structure of the grammar itself, which is the subject of this first volume, will be frequently justified according to its necessary interrelations with a pragmatic component (subject of a future second volume). Hausser places his model in the framework of a generative grammar which, unlike the one elaborated by Chomskyan linguistics since"]},{"title":"Aspects,","paragraphs":["is supposed to deal as well with a semantic level of representation. The goal of this grammar is to give a complete formal device, relating the surface sentences and their literal meaning or meanings (called meaningl), expressed as logical formulae. The grammar will be complete when sophisticated enough to deal with the effects of the context of communication; i.e., when it will be able to establish a connection with the non-literal meaning(s) of sentences (meaning2).","This formal model clearly derives from Montague Grammar as described in \"The Proper Treatment of Quantification in Ordinary English\" (traditionally referred to as PTQ). First of all, the relation between the surface form of expressions and the logical representation of their meanings has to be bidirectional. This means that the system described by Hausser performs a double mapping: from surface to meaningl and, conversely, from meaningl to surface. The rules of syntax give a system similar to a generative grammar, but rejecting the postulate of the autonomy of syntax. The Fregean principle of surface compositionality of meaning, as in PTQ, is taken as a basis for the construction of a categorial syntax that focuses on a description of the surface in terms of functor/argument relations. This description is the (syntactic) projection of the formaliza-tion based on predicate/argument relations at the semantic level of representation. Such a syntax avoids the use of (i) phrase-structure rewriting rules and (ii) transformations. In fact, the names of the syntactic categories denote their combinatorial properties. Consequently, one can note that Hausser's grammatical model is entirely constructed around the lexical descriptions which embody all the information about combinatorial and semantic properties of lexical units.","To ensure a \"strict\" surface compositionality, Hausser adopts the following requirements: • the syntactic component deals only with surface words and is developed around a unique rule of categorial","composition, controlled by the combinatorial properties","of syntactic categories; • likewise, the associated logical translation I is only","generated from the semantic representation of each","word, and finds its dynamic in the unique principle of","functional application.","Hausser's intensional logic is a little different from Montague's in its definitions. First of all, it is strictly intensional, which means that it avoids the use of the operator of intensionality (this operator applies, by default, to every logical expression). Another major difference is that Hausser employs a new lambda-operator which runs less restrictive lambda-reductions than in PTQ. I shall not go into the details of this formalism. Suffice it to say that this new lambda-operator is internally justified by the context-free treatment of discontinuous elements.","The main novelty of SCG is its \"orthogonal syntax\", called ORTAX. It is based on a peculiar formalism, developing graphically the relation between the surface string to be analyzed and its translation in intensional logic. Its interest is (i) to be very synthetic, (ii) to visualize the functional analysis of the words in the surface string, and (iii) to establish a correspondence between the order of terms in an utterance and the one, frequently different, of their translation within a whole logical formula. The syntactic categories of ORTAX contain all the information needed to construct these orthogonal representations. For instance, using a notation which may recall certain aspects of Lexical-Functional Grammars (see Kaplan and Bresnan 1982), ORTAX interprets the syntactic category ACB as: if x is of category A,B, it can be combined with a y of category B, which is above in the orthogonal projection (cf. ¢), to give an element of category A. Conversely, ACB will find its argument below in the figure (or, which is equivalent, on the right side in the linear order of surface sentences). A major difference between Hausser's grammar and PTQ is that"]},{"title":"every","paragraphs":["item of the surface has an associated translation in intensional logic. Consequently, since the translation process is entirely based on the surface words, the central elements of SCG are the lexical units which are called molecules. Each molecule is made of three distinct parts: its surface form, category (which implies its syntactic combinatory properties), and the translation in intensional logic. It has to be noticed that even punctuation marks have corresponding molecules to ensure the strict surface compositionality of the system.","Following Montague's strategy, Hausser demonstrates his system on a fragment of English. It is a convenient way of showing how SCG copes with the most classical linguistic phenomena. I shall mention here only: • the different kinds of sentences (declarative, interroga-","tive, and \"responsive\"), Computational Linguistics, Volume 12, Number 1, January-March 1986 39 Book Reviews • subcategorization of lexical units according to their proper complementation, • quantifier scopes, • de re/de dicto readings, • treatment of temporality. ORTAX deals with all the main syntactic categories and treats them in a non-syncategorematic manner, which treatment is not entirely assumed by PTQ. Consequently, Hausser notes himself that any extension of his grammatical model must be done via transformations in the lexicon (the set of all molecules).","I have tried here to give a rapid overview of SCG and it would be necessary to go into the details of Hausser's presentation to estimate its consistency. It cannot be done here, but., as a conclusion, I shall give my own evaluation according to the two following criteria: • the adequacy of the model for Hausser's own objectives, • its relevance for computational linguistics. To take the first point, I have not been convinced that Hausser's model is a strictly surface compositional grammar. In my opinion, dummy elements, which are here molecules without any surface realization, are by definition incompatible with a strict surface compositionality. These elements are present in Generative Transformational Grammar and even in PTQ (introduced, notably, by the non-context-free rules). Of course, the use of such artifacts seems to be justified in the context of formal linguistics, but they are in contradiction with the adoption of a principle of strict surface compositionality of meaning if they have an associated semantic representation. And computational linguistics? One could evade the question by saying that, if formal model like PTQ have any computational interest, so has SCG. What is interesting is that Hausser tries to treat some important aspects of language frequently ignored. SCG gives some solution to the following problems which are particularly relevant to computational linguistics (automatic translation, automatic text processing, man-machine dialog, etc.): • What should be the description of peculiar structures","such as ellipsis? 2 • How to use the information given by punctuation","marks (or intonation)? • How to deal with morphology within a formal semantic","framework? • How to build a general coherent system which would","be modular enough to allow easy improvements and","adaptations? This last point is particularly important and, in fact, Hausser's book could be seen as the explanation of a general algorithm for treating natural language. Such an algorithm can give interesting insights and, like PTQ, inspire some researchers in the field of computational linguistics.","To conclude this presentation, it is important to note that Hausser's style is clear and very \"pedagogical\". He tries to explain every detail of his model progressively Talking Minds (even if, sometimes, the exposition of problems is a little bit reductive). Obviously, this book is suited best for logicians interested in studying a syntactic-semantic model for natural language. The description of ORTAX and of its connections with other syntactic models is particularly clear and precise. The one of intensional logic? It is absolutely hermetic for uninitiated readers. They should, at least, try Dowty et al. (1981) or an equivalent presentation. Alain Polgu~re D6partement de Linguistique Universit6 de Montr6al tin SCG, as in PTQ, the translation process is the general mechanism that associates at least one semantic representation in intensional logic to each grammatical sentence, or piece of sentence. 2For instance, \"Peanuts.\" could be quite grammatical as a response to \"What are you eating, Bob?\". References","Dowty, David R.; Wall, Robert E.; and Peters, Stanley 1981 Introduc-tion to Montague Semantics. D. Reidel, Dordrecht, Holland.","Kaplan, Ronald M. and Bresnan, Joan W. 1982 Lexical-Functional Grammar: A Formal System for Grammatical Representation. In: Bresnan, J.W., Ed., The Mental Representation of Grammatical Relations. The MIT Press, Cambridge, Massachusetts: 173-281.","Montague, Richard 1973 The Proper Treatment of Quantification in Ordinary English. In: Hintikka, K.J.J.; Moravcsik, J.M.E.; and Suppes, P., Eds., Approaches to Natural Language. D. Reidel, Dordrecht, Holland: 221-242. (Reprinted in Montague 1974.)","Montague, Richard 1974 Formal Philosophy: Selected Papers of Richard Montague. Edited by Richmond Thomason. Yale University Press, New Haven, Connecticut. TALKING MINDS: THE STUDY OF LANGUAGE IN THE COGNITIVE SCIENCES Thomas G. Bever, John M. Carroll, and Lance A. Miller, Editors The MIT Press, 1984, 283 pp. ISBN 0-262-02181-1 The major emphasis in this book seems to be on the role of linguistic theory and behavior in leading to an understanding of human cognition. The book is divided into three sections which present different perspectives on the problem within the disciplines of linguistics, psychology, and artificial intelligence.","Rather than approaching an integration of perspectives, the book leaves one with a feeling that they are still very distant. Although the issues raised in the introduc-tion are discussed by the authors of each paper, there is no attempt to integrate the discussion. Instead, I felt that each paper presented a \"different side of the problem\" and that several of the authors were taking issue about problems which were more specific to their discipline and not immediate to the issues raised.","Overall, there are several relevant discussions of language and mental process. However, while the discussions border on integrated processing, the presentations and information processing models described are 40 Computational Linguistics, Volume 12, Number 1, January-March 1986"]}]}