{"sections":[{"title":"Book Reviews Getting Computers to","paragraphs":["Talk like You and Me Judy Delin Centre for Cognitive Science University of Edinburgh Edinburg EH8 9LW Scotland REFERENCES","Grosz, B.J. 1977 The Representation and Use of Focus in Dialogue Understanding. Technical Note No. 151, Stanford Research Institute Artificial Intelligence Center, Menlo Park, California.","Reichman, R. 1981 Plain Speaking: A Theory and Grammar of Spontaneous Discourse. Report No. 4681, Bolt Beranek and Newman Inc., Cambridge, Massachusetts.","Sidner, C.L. 1979 Towards a Computational Theory of Definite Anaphora Comprehension in English Discourse. TechnicalReport No. 537, MIT Artificial Intelligence Laboratory, Cambridge, Massachusetts. BOOKS RECEIVED Authors and publishers who wish their books to be considered for review in"]},{"title":"Computational Linguistics","paragraphs":["should send a copy to the book review editor,","Graeme Hirst","Department of Computer Science","University of Toronto","Toronto, Canada M5S 1A4. All books received will be listed, but not all can be reviewed.","Readers who wish to review books for the journal should write to the book review editor outlining their qualifications. Obviously, we cannot promise the availability of books in anyone's exact area of interest. Agosti, Maristella","[Facoltfi di Scienze Statistiche, Universit~i di Padova] Database Design: A Classified and Annotated Bibliography","(The British Computer Society Monographs in Informatics) Cambridge University Press, 1986, 92 pp. ISBN 0-521-31123-3 (paper), $16.95 Andersen, Francis I. and Forbes, A. Dean","[University of Queensland and Hewlett-Packard, resp.] Spelling in the Hebrew Bible: The Dahood Memorial Lecture","(Biblica et orientalia 41) Rome: Biblical Institute Press, 1986, xxii+379 pp ISBN 88-7653-342-7 (paper) Bennett, Paul A.; Johnson, Rod L.; McNaught, John; Pugh, Jeanette; Sager, J.C.; and Somers, Harold L.","[Centre for Computational Linguistics, University of","Manchester Institute for Science and Technology] Multilingual Aspects of Information Technology Aldershot: Gower, 1986, ix+ 146 pp ISBN 0-566-03513-8 (hardcover), £17.50 Benson, Ian (Editor)","[SRI International] Intelligent Machinery: Theory and Practice","[Papers presented at a conference organized by SRI Interna-","tional and held in Cambridge, UK, September 1984] Cambridge University Press, 1986, xi+ 168 pp ISBN 0-521-30836-4 (cloth), $34.50 Chomsky, Noam Barriers","(Linguistic Inquiry Monographs 13) Cambridge, MA: The MIT Press, 1986, viii+ 102 pp. ISBN 0-262-03118-3 (hardcover) ISBN 0-262-53067-8 (paper), $7.95 Demers, Richard A. and Farmer, Ann K. A Linguistics Workbook Cambridge, MA: The MIT Press, 1986, xi+275 pp. ISBN 0-262-54045-2 (paper), $9.95 Dobbs, James B.","[Lehigh University] Homophones and Homographs: An American Dictionary Jefferson, NC: McFarland, 1986, viii+264 pp ISBN 0-89950-182-6 (hardcover), $27 Gazdar, Gerald (Editor)","[School of Social Sciences, University of Sussex] Computational Tools for Doing Linguistics","[Special issue of Linguistics, 23(2), 1985, 185-360] Berlin: Mouton ISSN 0024-3949 Grosz, Barbara J.; Sparck Jones, Karen; and Webber, Bonnie Lynn (Editors)","[Harvard University, University of Cambridge, and Universi-","ty of Pennsylvania, resp.] Readings in Natural Language Processing Los Altos, CA: Morgan Kaufmann Publishers, 1986,","xv+664 pp. ISBN 0-934613-11-7 (paper), $26.95 Hutchins, William John","[University of East Anglia] Machine Translation: Past, Present, Future.","(Ellis Horwood series in computers and their applications) Chiehester: Ellis Horwood, 1986, 382pp. ISBN 0-85312-788-3 (hardcover), US$49.95,","CDN$111.95 Johnson-Laird, Philip N.","[Medical Research Council, Applied Psychology Unit,","Cambridge, England] Mental Models","(Cognitive Science Series 6) Cambridge, MA: Harvard University Press, 1983,","xiii+513 pp. ISBN 0-674-56881-8 (cloth), $27.50 ISBN 0-674-56882-6 (paper) $12.95 Computational Linguistics, Volume 12, Number 4, October-December 1986 313 Book Reviews Getting Computers to Talk like You and Me Lambek, J. and Scott, P.J.","[McGill University and University of Ottawa] Introduction to Higher Order Categorial Logic","(Cambridge studies in advanced mathematics 7) Cambridge University Press, 1986, ix+293 pp. ISBN 0-521-24665-2 (hardcover), $49.50 LeDoux, Joseph E. and Hirst, William (Editors)","[Cornell University and Princeton University] Mind and Brain: Dialogues in Cognitive Neuroscience Cambridge University Press, 1986, x+449 pp. ISBN 0-521-26756-0 (hardcover), $54.50 ISBN 0-521-31853-X (paper) Lenders, Winfried and Will~e, Gerd","[Universit~tt Bonn] Linguistische Datenverarbeitung: Ein Lehrbuch","(Linguistic data processing: A text book) Wiesbaden: Westdeutscher Verlag, 1986, 201 pp. ISBN 3-531-11745-9 (paper) Macnamara, John","[McGill University] A Border Dispute: The Place of Logic in Psychology Cambridge, MA: Bradford Books / The MIT Press,","1986, xv+212 pp ISBN 0-262-13216-8 (cloth) Merry, Martin (Editor)","[Hewlett Packard Laboratories] Expert Systems 85: Proceedings of the Fifth Technical Conference of the British Computer Society Specialist Group on Expert Systems, University of Warwick, 17-19 December 1985","(The British Computer Society Workshop Series) Cambridge University Press, 1986, ix+334 pp. ISBN 0-521-32596-X (cloth), $39.50 Moszkowski, Ben","[University of Cambridge] Executing Temporal Logic Programs Cambridge University Press, 1986, xiii+ 125 pp. ISBN 0-521-31099-7 (paper), $14.95 Narinyanin, A.S. (Editor) Natural Language Interaction and Knowledge Representation","(In Russian with English abstracts) Novosibirsk: USSR Academy of Science, Siberian Branch, 1985, 189 pp. Paperbound, 80 kopecks Nivat, Maurice and Reynolds, John C. (Editors)","[University of Paris VII and Syracuse University, resp.] Alegbraic Methods in Semantics Cambridge University Press, 1985, xv+634 pp. ISBN 0-521-26793-5 (cloth), $95.00 Papegaaij, Bart C.; Sadler, Victor; and Witkam, A.P.M. Toon (Editors) Word Expert Semantics: An Interlingual Knowledge-based Approach","(Distributed language translation 1) Dordrecht: Foris Publications, 1986, ix+254 pp ISBN 90-6765-261-X (paper), $29 / Dfl 120.- ISBN 90-6765-262-3 (hardcover), $59 / Dfl 57.- Rich, Charles and Waters, Richard C. (Editors)","[Artificial Intelligence Laboratory, MIT] Readings in Artificial Intelligence and Software Engineering Los Altos, CA: Morgan Kaufmann Publishers, August","1986, xxi+602 pp. ISBN 0-934613-12-5 (paper), $26.95 Sells, Peter Lectures on Contemporary Syntactic Theories: An Introduction to Government-binding Theory, Generalized Phrase Structure Grammar, and Lexical-Functional Grammar","(CSLI lecture notes number 3) Center for the Study of Language and Information, Stan-","ford University 1985, viii+214 pp Distributed by the University of Chicago Press No ISBN. Cloth $23.95; paper $11.95 Shieber, Stuart M. An Introduction to Unification-Based Approaches to Grammar","(CSLI lecture notes number 4) Center for the Study of Language and Information, Stan-","ford University 1986, iv+ 106 pp Distributed by the University of Chicago Press ISBN 0-937073-01-6 (cloth), $17.95; ISBN 0-937073-00-8 (paper), $8.95 Sperber, Dan and Wilson, Deirdre Relevance: Communication and Cognition","(The Language and Thought Series) Cambridge, MA: Harvard University Press, 1986,","viii+279 pp. ISBN 0-674-75475-1 (cloth), $25.00 ISBN 0-674-75476-X (paper) $8.95 Vygotsky, Lev Thought and Language","(Translation newly revised and edited by Alex Kozulin) Cambridge, MA: The MIT Press, 1986, lxi+287 pp. ISBN 0-262-22029-6 (cloth), $27.50 ISBN 0-262-72010-8 (paper), $9.95 Wilensky, Robert","[University of California, Berkeley] Common LISPcraft NY: Norton, 1986, xvii+500 pp. ISBN 0-393-95544-3 (paper), $26.95 314 Computational Lingtdstics, Volume 12, Number 4, October-December 1986"]}]}