{"sections":[{"title":"SPECIAL 20% DISCOUNT OFFER TO ACL MEMBERS The Cambridge/ACL Series STUDIES IN NATURAL LANGUAGE PROCESSING Aravind Joshi, General Editor","paragraphs":["This series presents monographs, texts, and edited volumes within the interdisciplinary field of computational linguistics."]},{"title":"Sponsored by the Association for Computational Linguistics,","paragraphs":["it represents the range of topics of concern to scholars. working in this increasingly important field."]},{"title":"COMPUTATIONAL LINGUISTICS Ralph Grishman","paragraphs":["This is one of the first books to give an integrated introduction to the field of computer analysis of language.","Grishman provides an overview text of various approaches to the problems of syntax analysis, semantic analysis,","text analysis, and natural language generation.","Available Fall 1986 in hardcover and paperback."]},{"title":"LANGUAGE AND SPATIAL COGNITION Annette Herskovits","paragraphs":["In this interdisciplinary study of the propositions in English, Herskovits describes the meaning and use of spatial expressions from the perspectives of linguistics and artificial intelligence.","Available Fall 1986 in hardcover."]},{"title":"SEMANTIC INTERPRETATION and THE RESOLUTION OF AMBIGUITY Graeme Hirst PLANNING ENGLISH SENTENCES Douglas E. Appelt","paragraphs":["Hardcover $29.95 £22.50"]},{"title":"TEXT GENERATION Using Discourse Strategies and Focus Constraints to Generate Natural Language Text Kathleen R. McKeown","paragraphs":["Hardcover $29.95 £22.50"]},{"title":"NATURAL LANGUAGE PARSING Psychological, Computational, and Theoretical Perspectives David R. Dowty, Lauri Karttunen, Arnold M. Zwicky, Editors","paragraphs":["Hardcover $49.50 £40.00 In the US and Canada, order from:"]},{"title":"CAMBRIDGE UNIVERSITY PRESS","paragraphs":["32 East 57th St., New York, N.Y. 10022 Outside the US and Canada, order from:","Cambridge University Press, the Edinburgh Building, Shaftesbury Rd., Cambridge CB2 2RU, England.","All orders must be prepaid."]},{"title":"ACL MEMBERSHIP APPLICATION","paragraphs":["Membership in the Association for Computational Linguistics is for the calendar year and includes: the ACL journal Com0utational I.inguisties, which is provided each member in both printed and microfiche versions; reduced registration at ACL-sponsored conferences; and discounts on ACL-sponsored publications. An order form for back issues and proceedings is on the back of this form. Payments can now be made directly to banks in Europe and Japan; please read the directions under the heading PAYMENT below carefully. Identify your institutional affiliation if it is not part of your address. Also, please provide your computer network address. NAME ADDRESS INSTITUTION COMPUTER NET&ADDRESS PROVIDE PROMPT NOTIFICATION OF CHANGES IN ADDRESS. Returned copies will not be remailed until the next issue is distributed, unless a $2.00 handling fee is remitted. ANNUAL MEMBERSHIP DUES: Dues for Personal Members are $15 per year. Couples with the same mailing address may become Joint Members for $20 per year; they will receive only one set of publications, but each will be eligible for all other member benefits. Dues for Institutional Members are $30. These dues payments include surface mailing costs. For first class mail delivery in the U.S., Canada, and Mexico, add $8. For air-printed delivery elsewhere, add $16.","CHECK MEMBERSHIP CATEGORY: [] Personal ($15) [] Joint ($20) [] Institutional ($30) DUES $","SPECIAL MAILING CHARGES: [] U.S., Canada, and Mexico ($8) [] elsewhere ($16) DUES MAILING $ INTERNATIONAL FUND: The ACL set up a fund in 1982 to make ACL memberships and publications available to colleagues who have difficulty in using their national currencies for international transactions. Contributions are tax-deductible in the United States and in some other countries; check local regulations.","INTERNATIONAL FUND $","PAYMENT: Prepayment is necessary; invoices are available on request. Checks should be made out to the ASSOCIATION","FOR COMPUTATIONAL LINGUISTICS (or to ACL). Payments can be made ha three ways:","1. Mail them payable in U.S. dollars with this application to Walker at the address below.","2. For people in Europe or with Swiss accounts, pay an equivalent value in Swiss francs, by personal check in your own currency, or by a banker's draft that credits account number 141.880.LAV at the Union Bank of Switzerland, 8 rue de Rhone, CH-1211 Geneva 11, SWITZERLAND send this application with payment or with a copy of the bank draft to Rosner; standing orders are allowed. European residents can get information on currency conversion values from Somers.","3. For people in Japan or with Japanese accounts, transfer an equivalent amount in yen to \"Dai-ichi Kangyo Bank, Hyakumanben Branch; Ordinary Deposit, 476-1319944; Name: Keisangengogakkai Kaihi Nagao Makoto.\". Send copies of the bank transfer to both Nagao and Walker, BUT SEND THIS APPLICATION TO WALKER; otherwise you will not be properly recorded in the ACL office. Dr. Donald E. Walker (ACL) Bell Communications Research 445 South Street, MRE 2A379 Morristown, NJ 07960, USA Dr. Michael Rosner (ACL) ISSCO 54, route des Acacias CH-1227 Geneva, SWITZEREAND Dr. Harry L. Somers (ACL) Centre for Computational Linguistics UMIST, PO Box 88 Manchester M60 1QD, ENGLAND Prof. Makato Nagao (ACL) Electrical Engineering Kyoto University Yoshida, Sakyo, Kyoto, JAPAN"]},{"title":"ORDER FORM FOR BACK ISSUES AND PROCEEDINGS","paragraphs":["BACK ISSUES: Back issues for the volume-years 1974 through 1978 are available in microfiche only. No issue was published in 1979. Back issues for the volume-years beginning with 1980 are sent in both print and microfiche versions. Charges for Personal Members are $15 per volume-year, including surface mailing costs. Charges for Institutional Members are $30 per year, including surface mailing costs. For first class mail delivery in the U.S., Canada, and Mexico, add $8 per volume-year. For air-printed delivery elsewhere, add $16 per volume-year.","CIRCLE VOLUME-YEARS DESIRED BACK ISSUES $ (calculate number of volume-years times $15 for Personal Members) (calculate number of volume-years times $30 for Institutional Members) Microfiche only: 1974 1975 1976 1977 1978 Print andmicrofiche: 1980 1981 1982 1983 1984 1985","SPECIAL MAILING CHARGES: BACK ISSUES MAILING $ (calculate number of volume-years times $8 for U.S., Canada, and Mexico) (calculate number of volume-years times $16 elsewhere) PROCEEDINGS: Proceedings are available from the ACL conferences listed below at $20 each for ACL members and $25 each for nonmembers, including surface mailing costs. For first class mail delivery in the U.S., Canada, and Mexico, add $8 per proceedings. For air-printed delivery elsewhere, add $16 per proceedings. In 1984 the ACL Annual Meeting was held in conjunction with the COLING Conference. The joint Proceedings is listed separately; it costs $35 for ACL members and $45 for nonmembers. For first class mail delivery in the U.S., Canada, and Mexico, add $10 per proceedings. For air-printed delivery elsewhere, add $20 per proceedings.","CHECK PROCEEDINGS DESIRED: PROCEEDINGS $ (calculate number of proceedings times $20 for Members, $25 for nonmembers) [] 17th Annual Meeting, 1979, San Diego [] 19th Annual Meeting, 1981, Stanford [] Applied Natural Language Processing, 1983, Santa Monica [] ACL Europe 1983 Conference, Pisa [] 23rd Annual Meeting, 1985, Chicago SPECIAL MAILING CHARGES: [] 18th Annual Meeting, 1980, Philadelphia [] 20th Annual Meeting, 1982, Toronto [] 21st Annual Meeting, 1983, Cambridge [] ACL Europe 1985 Conference, Geneva","PROCEEDINGS MAILING $ (calculate number of proceedings times $8 for U.S., Canada, and Mexico) (calculate number of proceedings times $16 elsewhere)","CHECK COLING PROCEEDINGS: COLING PROCEEDINGS $ (calculate number of proceedings times $35 for Members, $45 for nonmembers) [] COLING84, 1984, Stanford","SPECIAL MAILING CHARGES: COLING PROCEEDINGS MAILING $ (calculate number of proceedings times $10 for U.S., Canada, and Mexico) (calculate number of proceedings times $20 elsewhere) TOTAL $ SEND THIS ORDER FORM WITH PAYMENT AS SPECIFIED ON THE REVERSE SIDE OF THIS FORM"]},{"title":"Guidelines for Submissions","paragraphs":["Manuscripts submitted to Computational Linguistics should be typed on letter-size paper (8.5 by 11 inches, or A4), double-spaced throughout, including footnotes and references. The paper should begin with an informative abstract of approximately 150-250 words. Manuscripts must be submitted in English. Submissions may be made in any of the following categories: PAPER: This category includes contributions that report significant new research results in computational linguistics or that provide critical reviews of the literature on a particular topic. The length of a paper depends on its content, but we suggest that manuscripts be limited to forty double-spaced pages. That is the equivalent of twelve journal pages. Each paper is fully refereed, being read by at least two members of the editorial board and usually by an additional expert in the particular subject area.","The submission of an article to CL for refereeing means that the author certifies the manuscript is not copyrighted; nor has it been published or submitted for publication to another refereed journal. If any version of the paper has appeared, or will appear, in a non-refereed publication, the details of such publication must be made known to the Editor at the time of submission. The final version of a paper tentatively accepted for publication must be accompanied by a Copyright Transfer Agreement signed by all of the authors or, in the case of a \"work for hire\", by the employer. This written transfer is necessary under the 1978 U.S. Copyright law. TECHNICAL CORRESPONDENCE: This category includes short articles reporting preliminary results of some project in progress, or the results of other studies of interest to the readership. Technical correspondences should not generally exceed eight double-spaced pages. Each technical correspondence is reviewed by at least two members of the editorial board before acceptance. LETI'ERS TO THE EDITOR: This includes statements of opinion on issues relevant to the readership. The Editor and the editorial board will evaluate the appropriateness of these contributions for inclusion. Five copies of papers, technical correspondences, and letters should be sent to the Editor: James F. Allen, CL Editor Department of Computer Science The University of Rochester Rochester, NY 14627 arpanet: ACL@ROCHESTER.ARPA Anyone interested in reviewing a book, or in suggesting a book for review, should contact the Book Review Editor; publishers may also submit copies of books for review directly to the Book Review Editor: Graeme Hirst, CL Book Review Editor Department of Computer Science University of Toronto Toronto, CANADA M5S 1A4 arpanet: GH@TORONTO.CSNET The Finite String Editor should receive (a) copies of technical reports and reprints of papers published elsewhere - or at least citation information and abstracts of such items and of books and monographs; (b) summaries of research in progress - of particular interest would be perspectives on the activities at a particular institution; (c) announcements of meetings of potential interest to the membership; and (d) personal notes (e.g., honors, moving, changes in status). Two copies of submissions should be sent to the Finite String Editor: Ralph Weischedel, Finite String Editor Bolt Beranek and Newman Inc. 10 Moulton Street Cambridge, MA 02238 arpanet: WEISCHEDEL@BBNG Fuller instructions about the format of submissions can be found in the first issue of each volume. NOTE All submissions other than papers should reach the pertinent editor no later than the 15th of the first month of each quarter. The ,4m~iation for Computational Linguistics is an international scientific and professional society with membership open to any person or institution whose professional goals relate to computational linguistics. For information on dues and payments, see the inside front cover. President (1986) Vice President (1986) Secretary-Treasurer Executive Committee Members 1984-86 1985-87 1985-85 Journal Editor Series Editor Nominating Committee 1984-86 1985-87 1986-88 Ralph M. Weischedel BBN Laboratories Inc. 10 Moulton Street Cambridge, MA 02238 USA (617) 497-3496; WEISCHEDEL@BBNG.ARPA William C. Mann USC-ISI 4676 Admiralty Way Marina del Rey, CA 90292 USA (213) 822-1511; MANN@ISI.ARPA Donald E. Walker Bell Communications Research 445 South Street, MRE 2A379 Morristown, NJ 07960 USA (201) 829-4312; WALKER@MOUTON.ARPA Mitchell Marcus, A T&T Bell Laboratories Alan W. Biermann, Duke University Barbara J. Grosz, SRI International James F. Allen, University of Rochester Aravind Joshi, University of Pennsylvania C. Raymond Perrault, SRI International Martha W. Evens, Illinois Institute of Technology Madeleine Bates, BBN Laboratories Inc. ACL EUROPEAN CHAPTER OFFICIALS Chair (1982-85) Secretary (1982-85) Treasurer (1982-85) Advisory Committee Members 1982-85 1984-851 Nominating Committee 1982-85 1 To complete term of Yorick A. Wilks. Eva Haji~ovd MFF UK Linguistics Malostranskd ham. 25 CS-118 O0 Praha 1, Czechoslovakia (42 2) 532 136 Harold L. Somers Centre for Computational Linguistics University of Manchester, PO Box 88 Manchester M60 1QD ENGLAND (44 61) 236-3311, ext. 2296; HLS%UK.AC.UMIST@UCL-CS.ARPA Michael Rosner ISSCO 54 route des Acacias CH-1227 Geneva, SWITZERLAND (41 22) 209-333, ext. 2117; ROSNER% CUI.UNIGE.CHUNET%UBC@CSNET-RELAY Hubert Lehmann, IBM Heidelberg Remko J. Scha, BBN Laboratories Inc. Benny Brodda, University of Stockholm Giacomo Ferrari, Istituto di Linguistica Computazionale Gerald Gazdar, University of Sussex Peter Hellwig, University of Heidelberg Bente Maegaard, University of Copenhagen"]}]}