{"sections":[{"title":"THE FINITE STRING NEWSLETTER","paragraphs":["BERNARD VAUQUOIS PIONEER OF MACHINE TRANSLATION [died September 30, 1985, at the age of 56] It has not been long since Bernard Vauquois has left us, but we already deeply feel the magnitude of our loss. The father of seven, he was the founder of GETA (Groupe d'Etudes pour la Traduction Automatique), one of the initiators of EUROTRA, and one of the key figures in natural language processing in the world.","Having earned a State Doctorate in astronomy in 1958, he then turned logician, and became interested in the theory and practice of formal and natural languages, where he demonstrated his far-sightedness and sharpness of mind over the years.","At 31, in 1960, he was appointed Professor of Computer Science at Grenoble University. With Professor J. Kuntzman and N. Gastinel, he started computer science activities there. At that time, he was also working on the definition of ALGOL-60.","In 1960 also, he founded CETA (Centre d'Etude pour la Traduction Automatique, later GETA), and soon showed his gift for quick understanding, synthesis and innovation, as well as his taste for personal communication across borders and language barriers.","After having visited a number of centers, mainly in the United States, where research in MT was being conducted, he analyzed the defects of the \"first generation\" approach, assessed the potential of the new, grammar-based methods of formal language theory, and proposed a new approach, based on a \"pivot\" representation, and on the use of (declarative) rule systems to transform a sentence sequentially from one level of representation to the other. He led the CETA into constructing the first large-scale second generation system, applied to Russian-French, from 1962 to 1971.","By the end of this period, the accumulated experience led him to pin-point some defects of the \"pure\" declarative and interlingual approach, and to use heuristic programming techniques, implemented as procedural grammars written in SLLPs (Specialized Languages for Linguistic Programming), such as ATEF, ROBRA, TRANSF. and SYGMOR, which were developed under his guidance, and integrated in the first (and still unique) programming environment for building and using multilingual M(A)T systems (ARIANE-78).","It seems that, each time he initiated a new project, he also created some new and useful concept. In 1974, at the time when he co-founded the LEIBNIZ group, he proposed his now famous \"multilevel structural descriptors\" for translation units larger than sentences. This idea, premonitory of later theoretical work (Jackendoff, Gazdar) is still the cornerstone of all MT lingwares built by GETA and by the French National MT project. It has also been a fruitful source of inspiration for EUROTRA, which uses it in a simplified form for the Interface Structures.","Bernard Vauquois's last contribution was the invention of the \"static grammar\" concept, in 1982-83, during the ESOPE project, a preparatory phase of the French National MT project. A SCSG (Structural Correspondence Static Grammar) specifies the correspondence between a family of strings (of word-trees), the language, and a family of decorated trees, the structural descriptors. Two such SCSGs, for French and English, have been developed under his supervision in the framework of the French National MT project, and have been used to construct \"dynamic\" (procedural) grammars for analysis and synthesis.","Early Eurotrians will certainly remember his energy and enthusiasm, which he repeatedly displayed during the years when EUROTRA was being designed. It so happened that the French National MT project, started earlier than EUROTRA, required most of his attention from 1981-82 onwards.","He was certainly a key figure in computational linguistics, not only in France and in Europe, but also around the world. From 1969 to 1984, he was chairman of the ICCL (International Committee on Computational Linguistics), which organizes the COLING conferences.","In France, he frequently cooperated with other countries (most notably Canada, USA, USSR, Czechoslovakia, Japan, China, Brazil, Malaysia, and Thailand), often working himself on specification and implementation of grammars and dictionaries. For example, he began cooperation with Malaysia in 1979, which led to the creation of the Projete Terjemaan Automatic, with a first English-Malay prototype, already demonstrable by 1980. This project is now autonomous, with a staff of six full-time researchers.","For his friends and close colleagues, however, he was not only a very gifted scientist, a remarkable teacher, and a \"father figure\" but also a very intense human being, enjoying life, energetic, courteous, charming and very witty.","He will be sorely missed, not only in Grenoble, but also in Europe and all around the world. Christian Boitet Groupe d'Etudes pour la Traduction Automatique Universit6 Scientifique et M6dicale de Grenoble Grenoble, France REMINISCENCES My remaining memory of Bernard Vauquois will be his tall, sloping figure jumping up after a talk, his face eager and already grinning at his joke to come, the shoulders shaking a little with anticipation. The last example he pressed on me in this way, after some dull talk on PP-attachment, was \"Pate de canard truffe\"; where it Computational Linguistics, Volume 12, Number 1, January-March 1986 43 The FINITE STRING Newsletter Bernard Vauquois was, he insisted, the pate not the canard that was \"truffe\". It was just the kind of example he loved, French in content as well as form, and extending what the speaker had said to a different area. I crossed swords with him many times, on intellectual and political issues, but he never allowed what he ought to say, to preserve his institute or country's interests, to interfere with what his intellectual honesty actually said. He was one of the great intellectuals in MT, and I am very sad personally that I shall not see those shoulders quivering with fun again. Yorick Wilks New Mexico State University Las Cruces, New Mexico, USA I believe that Bernard Vauquois was the first to give a European dimension to the idea of machine translation. He was the initiator of the Leibniz Group, an association of European researchers who explored the possibility of launching European co-operative projects. The Leibniz Group eventually had to resign itself to the apathy of the research authorities, but Bernard Vauquois pursued his ideal - Don Quixotesque some believed - and convinced Georges Anderla, Director of Information Management at the CEC, that a European machine translation project was a promising response to the challenge of multi-lingual communication in the European Community. This was the origin of EUROTRA. Bernard Vauquois took an active part in its initial definition, and to the very end he supported the project in his role as one of the French members of its advisory committee. Bernard Vauquois's contribution to EUROTRA was invaluable. His role was first that of a teacher who shared liberally his rich experience with us, then as a counsellor and a source of ideas and visions which have left an indelible imprint on our project. Sergei Perschke Commission of the European Community Luxembourg I first met Bernard Vauquois at the COLING he organized in Grenoble in 1967. Already on that occasion I was impressed by those qualities that I was later to admire even more: the depth, clearness and concreteness of his scientific thought; his devotion to research; his love and exquisite and aristocratic taste for language as both an object of study and a means of expression; his sense of humour - sometimes so simple as to be disarming - and his delight in a witty remark, his desire for gaiety and his thirst for novelty which would suddenly appear together with the dignity, seriousness and even-mindedness of a person invested with great responsibilities. I remember, with deep emotion, the love and pride with which he would speak about his family and about their \"adventurous\" journeys together. As vice-president of the ICCL, I was particularly close to him for the last eight years of his presidency. Now, together with Martin Kay, who has succeeded him in that role, we are preparing a volume of essays written by his friends in his honour. Antonio Zampolli University of Pisa Pisa, Italy I first met Bernard Vauquois in 1979 when, as a research student, I was taken to Grenoble on an informal visit. I was immediately struck by his personal charisma, as well as by the strength of the group he had built up around him. This snapshot view of the work of GETA served to confirm my nascent commitment and addiction to computational linguistics, and for a long time shaped my view of how to conduct CL research. But above all, Professor Vauquois was approachable: despite his many commitments, he always had time to discuss, teach and communicate his enthusiasm in that infectiously good-natured manner that was for many his trademark, even to the most junior of his associates.","Many have commented on his wonderful sense of humour, and I would like to share my favourite memory of this aspect of Bernard Vauquois. We had been discussing the relative productivity of English and French morphology, and the particular example of the term in English for a male goat had caught his attention. With that mischievous grin of his, he sought confirmation of a generalisation - coining delightful zoological terms such as \"billy-sheep\", \"billy-dog\", \"billy-hippopotamus\" and so on. It was with great reluctance that we were unable to confirm the data. Harold Somers University of Manchester Manchester, England The name of Professor Vauquois has been known to us since we became interested in computational linguistics, and we have known him personally since 1978. We want to use this sad opportunity to recall a visit which we made to GETA in 1979. What we remember most from this visit is the very personal interest Professor Vauquois took in it. He spent a long time discussing with us, and this meant very much to us, both personally and scientifically. For all three of us, this visit created a personal relationship that has lasted ever since. We will miss Professor Vauquois. Bente Maegaard and Hanne Ruus University of Copenhagen Copenhagen, Denmark At a panel discussion during COLING 84 at Stanford - one of the ten successive biennial world-scale international meetings on computational linguistics organized by the International Committee of Computational Linguistics, many under the chairmanship of Bernard Vauquois - we were facing a suggestive question, \"When is the next ALPAC Report due?\" With Bernard sitting in the same room just a few rows before me, I did not hesitate to take the more optimistic variant of the question, 44 Computational Linguistics, Volume 12, Number 1, January-March 1986 The FINITE STRING Newsletter Bernard Vauquois asking \"Whether\" rather than \"When,\" and to believe that if we beware of commercially attractive but scientifically unsubstantiated and over-ambitious claims and if we stay on the ground and work rather than talk, as he has always done with his group, we can answer that question in negative. Alas! Bernard Vauquois is no longer in the same room - and my self-confidence is shaken. Eva Hajidovd Charles University Prague, Czechoslovakia After the rise of sceptical attitudes towards MT, not to speak about other discouraging events, I had the extraordinary luck to come to Grenoble in October 1968, having been invited by the late Bernard Vauquois to work on his MT project for a year. In CETA I found an atmosphere of intensive co-operation of mathematicians with linguists of various specializations and backgrounds, including visitors from the U.S. and Japan, whose enthusiastic activities were initiated and united by Bernard's leading personality. Bernard and his group, in spite of the disintegrating tendencies at French universities of that time, formulated and implemented the then most complete and adequate MT system. The Praguean efforts in MT, which had started, on a lesser scale, almost contemporaneously with the Grenoble group, have been highly reinforced by the regular contacts which started then and were continued up to our last meeting in November 1984. Bernard's energy, high requirements and friendly attitude towards international cooperation on an appropriate scientific level will be badly missed by the world's MT enterprises. Petr Sgall Charles University Prague, Czechoslovakia Professor Vauquois was impressive both intellectually and physically. I can date my first encounter with him fairly precisely, because immediately afterwards I circulated an in-house paper at CETADOL in Montreal (the forerunner of TAUM) on how the Grenoble Russian-French MT model could be applied to our English-French research. Everyone who knew Vauquois remembers him drawing the U-shaped outline of that model on a blackboard somewhere; he took it round the world. His exposition that day seduced me away from my muddling native British pragmatism to the conceptual light and power of algebraic modelling, and so I joined ranks with several of my French Canadian colleagues who had been Grenoble trained. That was in 1967 - nearly two decades ago! Grenoble was already a great international school.","But of course Bernard had his human side too. Much of the warmth and some of the music will have gone out of the high-ceilinged old apartment in the centre of Grenoble. Likewise it is now nearly two decades since the snowy winter when he crowded into half a cosy Montreal duplex with cheerful Mme Vauquois and five (I think) younger children. By that time or soon after (1970), CETADOL had become TAUM and we had begun to apply Colmerauer's Q-System. To show it off to him, somebody arranged that he would type in \"Vauquois was met at the airport by Michel\" (i.e., Michel van Canaghem, computer analyst and first Q-System French morphologist), whereupon our model-T interactive terminal would chug back with \"Michel a rencontre Vauquois a l'aeroport.\" We waited for him to admire the transformation. However, his only comment was, \"C'est tres bien, mais puisque la rencontre etait prevue, il aurait fallu traduire met par a accueilli.\" I thought to myself, \"In matters of language he's an unrelenting Frenchman.\" The impression was confirmed a few years later when I heard him wince at the gross anglicism \"linguistique computationnelle\", which we had coined in the organizing committee for COLING 76. On the other hand, I never managed to persuade him that his gallicism \"automatic translation' was an offence to English.","Many will feel that Bernard Vauquois's death marks the passing away of an epoch. Anyway, it makes me feel nostalgic for myself and very sorry for his family. GETA, and that model on the blackboard, are his monuments. Brian Harris University of Ottawa Ottawa, Ontario, Canada Bernard Vauquois had the distinction, in the field of machine translation in Europe, of being a prime instigator, one who kept the discipline alive in its difficult days, and one who took a large part in assisting its rebirth. His gifts of sharp analysis, of clarity in exposition, of inventiveness in finding solutions to technical problems made him invaluable as a colleague and as a teacher. In writing this, I wish to acknowledge a personal as well as a communal debt. We shall remember him. Margaret King ISSCO Geneva, Switzerland Bernard Vauquois obtained supplementary funds for the 1967 Grenoble COLING Conference by associating with it the opening ceremonies for a new university building - the first in the world, surely, to be dedicated to research on machine translation. I was mighty impressed. I was also impressed with his paternity. He told me that he had as many children as French law would permit him to drive without a chauffeur's license - and it was always obvious that he loved every one of them dearly. And he loved his work and his colleagues, who mourn him. David Hays New York, New York, USA The tragic loss of Professor Bernard Vauquois had a deep personal dimension for many computational linguists in the Montreal area. Vauquois's encourage-Computational Linguistics, Volume 12, Number 1, January-March 1986 45 The FINITE STRING Newsletter Bernard Vauquois ment and leadership was an important factor in the creation and early development of the TAUM translation project at the Universit6 de Montr6al in the late 1960's. A visiting professor at the University in 1971-72, he exerted a strong professional and human influence on computer scientists and linguists alike. His personal warmth and involvement remained an important element in the exchanges between Montreal and Grenoble that have flourished since that time. His constant devotion to family, friends and colleagues will long be remembered.","The world community of computational linguists owes a great deal of its cohesion and continued development to the leadership of Bernard Vauquois. Throughout the last two decades his role in ICCL's COLING conferences was a crucial one. In the early 70s, when automatic translation activity was at a low ebb worldwide, he personally guaranteed its survival through his leadership of GETA in Grenoble, and by his tireless efforts to promote international co-operation among active groups and individuals. In recent years Vauquois was at the forefront of a particularly successful series of exchanges between GETA and several research groups in Japan and Southeast Asia. Probably no other individual has played such a decisive role in the development of automatic translation as a scientific domain. Richard L Kittredge Universit6 de Montr6al Montr6al, Quebec, Canada We deeply regret the death of Professor Vauquois, who has contributed so substantially to research and development in machine translation throughout the world. We treasure the most pleasant memories of him. He invited many Japanese colleagues to GETA and contributed actively to research on machine translation in Japan. We are certain that his contribution to the study of machine translation will never be forgotten.","I will always associate Professor Vauquois with the beautiful scenery of Grenoble, where he invited me to stay for a year during 1969-70. He was so kind to visiting scholars, inviting them to his home, to go skiing, and for automobile drives in the mountains. I had frequent discussions with him about the methodology of machine translation, and was always enlightened by him. Since the stay in Grenoble, I met him often in Europe, the United States, Canada, and several times recently in Japan. Professor Vauquois was always enthusiastic about the possibility for better machine translation. We have to internalize his goals for high quality machine translation systems and to actively work toward realizing them in the near future. I have recently written a book on machine translation in Japanese, which I dedicated to the memory of Professor Vauquois. Makoto Nagao Kyoto University Kyoto, Japan Asked what attracted him to machine translation as a field of research, Bernard Vauquois once stated: \"You get away from the et ceteras.\" Linguistics like many other disciplines abounds in et ceteras, where the author claims a much wider scope for his observations than the minuscule fragment he has actually investigated. Disappointingly, mathematizing trends and computational approaches seem to restrain such self-indulgence very little. Bernard Vauquois did not grant himself such freedom; he was too serious a scholar to want to avoid difficulties.","One problem engaged Bernard Vauquois and his team of dedicated associates over a period, the length of which is more naturally stated in terms of fractions of a century than in numbers of years. When other efforts were, sometimes for good reasons, discontinued, Bernard Vauquois and his group built up a capital of trust that they were marching towards a goal. Plus, of course, a conviction with all those who learned to know Bernard Vauquois personally, that the work was based on unvary-ing intellectual honesty.","Long-range research programmes have to be defended along two lines: they have to be protected from the trendy \"avant gardists\" who keep recasting their tools every second year to conform to the latest fashion; and they must ward off \"ad hocities\". It is a bitter reflection - bitter to us observers for Bernard Vauquois was not inclined to self-pity - that a first-rank scholar had to spend time and energy in explaining the difference between real research and the lowest-level quasi-practical ad hocities - and had to do this not only to stray newspaper reporters but to the highest levels of national and multi-national decision-makers.","Bernard Vauquois was not native to the domain of linguistics. Nor, of course, to computer science; no one of his generation could possibly be. It was a time of migration, and one migration wave brought the astronomer Vauquois to language studies. He brought with him a sense for completeness and accuracy and is one of the examples of how our field has profited from immigration.","But on a personal level, Bernard Vauquois was not a migrant. He was unmistakably French and deeply rooted in French culture. He considered the size of the list of cheese in the local shop - 250, I think he told me - to be as important as the storage capacity in his computer. Speaking an English that was clearly continental, he played a European role without disowning his Frenchness and an international role without ceasing to sound European. It was, paradoxically, probably this very local root-ing, plus the obviously good will and keen human interest behind a shy smile, that made people in so many broader circles - the common market, Eastern Europe, the Far East, and the academic community at large - listen to his low-keyed comments. Hans Karlgren Kval Institute for Information Science Stockholm, Sweden 46 Computational Linguistics, Volume 12, Number 1, January-March 1986 The FINITE STRING Newsletter Calls for Papers For the past 25 years, Bernard Vauquois headed a series of machine translation projects at the University of Grenoble in France that were distinguished by the consistent exploration of sophisticated computational linguistic techniques. A paper describing a significant part of this work, entitled \"Automated Translation at Grenoble University\" (co-authored with Christian Boitet), appeared in the January-March 1985 issue of"]},{"title":"Computational Linguistics","paragraphs":["[Volume 11, Number 1]. However, throughout his life he was a continuous source of new ideas and new projects and a powerful presence nationally and internationally in the field of machine translation. That his influence was not just local is illustrated by the EUROTRA project, the inception of which owes much to his efforts. Over the last five years he was instrumental in establishing, in both Malaysia and Thailand, research groups that are developing machine translation systems for the indigenous languages. In fact, it was in Penang that the leukemia, which claimed his life, resulted in hospitalization. He was transferred to Paris and seemed on the road to recovery when lung complications led to his death.","From 1969 to 1984 Professor Vauquois chaired the International Committee on Computational Linguistics, the organizing body for the COLING conferences. I first met him at the 1967 Conference, not yet called COLING. It was an exciting meeting, and a significant part of that excitement was contributed by his enthusiasm and his organizational skills. However, equally well conveyed was his personal charm and his sense of humor. Throughout his life, he used these traits, coupled of course with his intellectual competence, in the service not only of computational linguistics and machine translation, but of scientific research more generally. DonaM E. Walker Bell Communications Research Morristown, New Jersey, USA CALLS FOR PAPERS","1986 INTERNATIONAL CONFERENCE","ON CHINESE COMPUTING","21-22 August 1986 - Conference","20 August - Tutorials; 20-22 August 1986 - Exhibits","ISS, National University of Singapore","CO-CHAIRMEN C. N. Liu, IBM, USA Leong Kuo-Sing, IEEE, Singapore","STEERING COMMITFEE Treasurer: Daniel Chang, IBM, USA Arrangements: Ifay Chang, ISS, Singapore Tutorial: Yaohan Chu, U. of Maryland, USA","PROGRAM CHAIRMEN Prof. C. Y. Suen Department of Computer Science Concordia University 1455 de Maisonneuve West Montreal, Quebec H3G 1M8, Canada Prof. Hsu Loke-Soo Dept. of Information Systems & Computer Science National University of Singapore Singapore","Sponsored by: Chinese Language Computer Society, Institute of System Science ¢Jf the National University of Singapore, Singapore Computer Society, IEEE Computer Chapter, Singapore Section. Papers are hereby solicited for the 1986 International Conference on Chinese Computing. The conference is oriented toward researchers, developers, and users of systems that process Chinese and Oriental languages. The conference theme is methodology, hardware and software technology used for achieving computer processing of applications in these languages.","Sessions are being organized on the following topics, and paper summaries related, but not limited, to the following are invited: - Input/Output","• Keyboard Design","• OCR","• Speech I/O","• Knowledge Engineering","- Processing • Programming Languages • Database Design • Natural Language Processing","- Systems • Chinese Language PC • Object-oriented Systems","- Applications • Typesetting • Page Composition • Automatic Translation • Type Font Design and Generation","Three copies of an extended summary of at least 500 words must be in the hands of one of the the Program Chairmen by 15 February 1986. Each summary must include • the title of the paper • the complete name(s), affiliation(s), and address(es) of the author(s) • a statement of commitment that (one of) the author(s) will present the paper in case of acceptance.","Authors will be notified of acceptance (rejection) by 15 April 1986. Camera-ready copies of accepted paper are due by 15 June 1986.","ADVANCES IN LEXICOLOGY 6-7 November 1986, Waterloo, Canada The Second Annual Conference of the University of Waterloo Centre for the New Oxford English Dictionary will be held in Waterloo, Canada on 6-7 November Computational Linguistics, Volume 12, Number 1, January-March 1986 47"]}]}