{"sections":[{"title":"","paragraphs":["The FINITE STRING Newsletter Announcements","GRAMMAR I11 Room 1, 9.00-11.30 Formal Specification of Natural Language Syntax Using Two Level Grammart","B. Bryant, D. Johnson, B. Edupuganty"]},{"title":"(U.S.A.)","paragraphs":["On Formalizations of Marcus' Parser R.N. Farshi"]},{"title":"(Canada)","paragraphs":["A Grammar Used for Parsing and Generation J.M. Lancel, F. Rousselot, N. Simonin"]},{"title":"(France)","paragraphs":["A Declarative Formulation of DRS Theoryt M. Johnson, E. Klein"]},{"title":"(U.S.A.)","paragraphs":["GRAMMAR IV Room 1, 15.00-16.40 Bulldrs: An Implementation of DR Theory and LFGt","H. Wada, N. Asher"]},{"title":"(U.S.A.) A","paragraphs":["PROLOG Implementation of Government-Binding"]},{"title":"Theoryt","paragraphs":["R.J. Kuhns"]},{"title":"(U.S.A.)","paragraphs":["A Lexical Functional Grammar System in Prolog A. Eisele"]},{"title":"(FR Germany)","paragraphs":["GENERATION I Room 7, 9.00-11.30 Knowledge Structures for Natural Language Generationt","P.S. Jacobs"]},{"title":"(U.S.A.)","paragraphs":["Semantic Based Generation of Japanese German Translation System","K. Hanakata, A. Lesniewski, S. Yokoyama"]},{"title":"(FR Germany)","paragraphs":["Synthesizing Weather Forecasts from Formatted Data R. Kittredge, A. Polguere, E. Goldberg"]},{"title":"(Canada)","paragraphs":["From Structure to Process, Computer-assisted Teaching of Various Strategies for Generating Pronoun Constructions in Frencht","M. Zock, G. Sabah, C. Alviset"]},{"title":"(France)","paragraphs":["GENERATION II Room 7, 15.00-16.40 Generating a Coherent Text Describing Traffic Scenet","H.J. Novak"]},{"title":"(FR Germany)","paragraphs":["Generating Natural Language Text in a Dialog System M. Koit, M. Saluveer"]},{"title":"(U.S.S.R.) A","paragraphs":["Paraphraser for Relational Query Languages A.N. De Roeck, B.G.T. Lowden"]},{"title":"(Great Britain)","paragraphs":["The Computational Complexity of Sentence Generation Using Functional Unification Grammar","G. Ritchie"]},{"title":"(Great Britain)","paragraphs":["SPEECH I Room 8, 9.00-11.00 Parsing Spoken Language: A Semantic Caseframe Approacht","P. Hayes, A. Hauptmann, J. Carbonell, M. Tomita"]},{"title":"(U.S.A.)","paragraphs":["Divided and Valency-Oriented Parsing in Speech Understanding","G. Niedermair"]},{"title":"(FR Germany)","paragraphs":["The Role of Semantic Processing in an Automatic Speech Understanding System","A. Brietzmann, U. Ehrlich"]},{"title":"(FR Germany)","paragraphs":["Synthesis of Spoken Messages from Semantic Representationst","L. Danlos, F. Emerard, E. Laporte"]},{"title":"(France)","paragraphs":["SPEECH II 15.00-16.40 The Procedures to Construct a Word Predictor in a Speech Understanding System from a Task-specific Grammar Defined in a CFG or a DCG","Y. Niimi, S. Uzuhara, Y. Kobayashi"]},{"title":"(Japan)","paragraphs":["The Role of Phonology in Speech Processing R. Wiese"]},{"title":"(FR Germany)","paragraphs":["Computational Phonology: Merged, not Mixed S. Langeweg, H. van Leeuwen, E. Berendsen"]},{"title":"(The Netherlands)","paragraphs":["Phonological Pivot Parsing G. Dogil"]},{"title":"(FR Germany)","paragraphs":["A Description of the VESPRA Speech Understanding System","R. Haberbeck"]},{"title":"(FR Germany)","paragraphs":["MACHINE TRANSLATION IV Room 9, 9.00-11.30 Translation by Understanding: A Machine Translation System LUTEt","H. Nomura, S. Naito, Y. Katagiri, A. Shimazu"]},{"title":"(Japan)","paragraphs":["On Knowledge-Based Machine Translationt S. Nirenburg, V. Raskin, A. Tucker"]},{"title":"(U.S.A.)","paragraphs":["Another Stride Towards Knowledge-Based Machine Translation: A Unification Based Entity-Oriented Approacht","M. Tomita, J. Carbonell"]},{"title":"(U.S.A.)","paragraphs":["MACHINE TRANSLATION V Room 9, 15.00-16.40 English-Malay Translation System: a Laboratory Prototype","T.L. Cheong"]},{"title":"(Malaysia) A","paragraphs":["Prototype Translation Based on Extracts from Data","Processing Manuals E. Luetkens"]},{"title":"(Belgium)","paragraphs":["A Prototype English-Japanese Machine Translation System for Translating IBM Computer Manuals","T. Tsutsumi"]},{"title":"(Japan)","paragraphs":["Construction of a Modular and Portable Translation System","F. Nishida, Y. Fujita, S. Takamatsu"]},{"title":"(Japan)","paragraphs":["When Mariko Talks to Siegfried - Experience from a Japanese/German Machine Translation Project","D. Roesner, K. Hanakata"]},{"title":"(FR Germany)","paragraphs":["CONTACT","For further information, please contact: COLING 86 c/o Winfried Lenders IKP - University of Bonn Poppelsdorfer Allee 47 D-5300 Bonn 1, W-Germany [UPK000@DBNRHRZ1 BITNET] ANNOUNCEMENTS ACL SESSION AT NCC '86 National Computer Conference 16-19 June 1986, Las Vegas 10:30-12:00, 17 June 1986"]},{"title":"An Artificial Intelligence Approach to Document Preparation","paragraphs":["54 Computational Linguistics, Volume 12, Number 1, January-March 1986 The FINITE STRING Newsletter Announcements","organized and chaired by Martha Evens (Illinois Insti-","tute of Technology) Now that text editors, formatters, and spelling correctors have become widely available, it is time to take the next step and develop truly intelligent aids to document preparation. Our session describes systems that use artificial intelligence techniques to analyze the grammar or the meaning of the text. The understanding gained in this analysis enables these systems to give substantial help in creating or critiquing documents, to compose alternative passages, or to correct grammar and diction. This session was organized by the Association for Computational Linguistics to present some of the best current applications in natural language processing. Enhanced Text Critiquing using a Natural Language Parser","Lisa Harder (IBM TJ Watson Research Center) A Programmer's Perspective on UNIX Document Preparation Tools.","Richard Morin (Canta Forda Computer Laboratory) Human Interfaces in an Expert System for Preparing Legal Documents","James Sprowl (liT/Chicago - Kent College of Law) -TINLAP3 Third Workshop on Theoretical Issues in Natural Language Processing 7-9 January 1987, Las Cruces, New Mexico The workshop, supported by the Association for Computational Linguistics, will follow the format of its predecessors at MIT (1975), Champaign-Urbana (1978) and Nova Scotia (1985): panels of distinguished figures in computational linguistics, AI, and related disciplines will discuss the major topics at issue. Preliminary registration information:","Yorick Wilks","Box 3CRL","New Mexico State University","Las Cruces, NM 88001","CSNET: yorick@nmsu 1987 LINGUISTICS INSTITUTE 29 June - 7 August 1987, Stanford University, California The 1987 Summer Institute of the Linguistic Society of America will be hosted by the Linguistics Department of Stanford University, from 29 June to 7 August 1987. It is co-sponsored by the Association for Computational Linguistics.","The theme of the Institute is \"Contextual and Computational Dimensions of Language\", and is meant to reflect the ever-growing interest in integrating theories of linguistic structure with theories of language processing and models of how language conveys information in context. The aim is to provide a forum in which it is possible to integrate a variety of linguistic traditions, particularly linguistic theory, computational linguistics, discourse analysis, psycholinguisties, sociolinguistics, and artificial intelligence.","Several different kinds of courses and activities will be offered during the six-week period of the Institute: • A series of overview classes in the main subareas of linguistics (six weeks, 3 units) • A series of one-week intensive classes intended to provide background for the four-3 week courses and seminars below (29 June-July, 1 unit) • Four-week classes on topics related directly to the theme of the Institute (13 July-7 August, 2 units) • Several seminars associated with research workshops will run throughout the last four weeks. These can be taken for credit, as part of the Stanford \"directed research\" program [subject to prior approval of the workshop leader] (up to three units) • A series of Wednesday lectures (e.g., on the Synthesis of Approaches to Discourse), involving Institute participants and invited visitors. • The Association for Computational Linguistics will hold its annual meeting during the second week of the Institute (6-10 July).","This is the first time in recent years that two consecutive Institutes have been held with the same theme. This complementarity of the 1986 Institute held at the City University of New York and the 1987 Institute reflects remarkable changes taking place today in the field of linguistics. Taken together, the Institutes provide the depth and diversity necessary to cover the newly emerging subfields and to teach the range of interdisciplinary tools and knowledge so fundamental to new theoretical approaches. The 1987 Institute at Stanford differs from the 1986 Institute primarily in specific course offerings and faculty and in its focus on providing a rich interdisciplinary research as well as teaching environment. Many of the instructors will also be participating in research groups; in general they will teach only one course.","The Executive planning committee is: Ivan Sag (Director), Ellen Prince (Associate Director), Marlys Macken, Peter Sells, and Elizabeth Traugott. David Perlmutter will be the Sapir Professor, and Joseph Greenberg the Collitz Professor of the 1987 Institute.","For more information, write","1987 LSA Institute","Department of Linguistics","Stanford University","Stanford, California 94305 14TH ANNUAL INTERNATIONAL SYSTEMICS WORKSHOP 24-28 August 1987, University of Sydney, Australia The Fourteenth Annual International Systemics Workshop will be held following the meetings of the International Applied Linguistics Association. For further information contact.: Computational Linguistics, Volume 12, Number 1, January-March 1986 55 The FINITE STRING Newsletter Announcements J. R. Martin Linguistics Department The University of Sydney Sydney, N.S.W., 2006, Australia","ACL DISCOUNTS FOR REGISTRATION AT AFIPS CONFERENCES AFIPS is providing discounts of $50 to ACL members on registration at the National Computer Conference in Las Vegas, 16-19 June, and at NCC-Telecommunications '86 in Philadelphia 8-10 September. Special registration forms are required; advance registration forms must be obtained from the ACL office. Forms for onsite registration at the NCC in Las Vegas can also be obtained from the ACL booth at the conference.","COMPUTER PROCESSING OF CHINESE AND ORIENTAL LANGUAGES This international journal of the Chinese Language Computer Society in annual volumes of four issues each. Started in the summer of 1983, it contains state-of-the-art papers written by experts from different parts of the world. Its papers transcend disciplinary boundaries and bridge language barriers.","This benchmark journal is international in scope, interdisciplinary in approach and interactive in response to the current trend of technology. It covers all aspects related to computer processing of Chinese and oriental languages; e.g., computer input and output of characters, typesetting and design of characters, coding and compressing of data, voice input and output, analysis, recognition and synthesis of speech, man-computer communications, language processing and text understanding, representation of knowledge and inferencing, computational linguistics, automatic translation, software and design of Chinese language computers, database management and systems, information retrieval, text handling, question answering, applications of theories, new methods, techniques, and developments.","Please submit all manuscripts in triplicate to Ching Y. Suen Editor-in-Chief CPCOL Department of Computer Science Concordia University 1455 de Maisonneuve West Montreal, Quebec H3G 1M8, Canada Memberships and Subscriptions • Individual membership in the society (U.S. $30.00 per year) includes a subscription to CPCOL and the Newsletter. • Institutional membership (U.S. $200.00 per year) includes a subscription to all CLCS publications, including CPCOL, Newsletter, and Conference Proceedings. • Non-members may order copies of CPCOL at U.S.","$45.00 per volume (if located in Canada or the United","States), or at U.S. $60.00 per volume (for all destina-","tions outside Canada or the United States.) Information about memberships and subscriptions may be obtained from Daniel T. Chang at address given above. Editorial Board: S. K. Chang, Y. Chu, M.-Y. Hsiao, C.-C. Hsieh, C.N. Liu, Y.Q. Liu, S. Mori, C.Y. Suen (Editor-in-Chief), J. Tou, H.M. Yamada, W.C.P. Yu. AFIPS CONDUCTS TIE WORKSHOP The pilot phase of a new educational resource, the Technology in Education (TIE) project, was launched by the American Federation of Information Processing Societies (AFIPS) on November 1 and 2, 1985, at the Phyllis E. Williams Elementary School in Prince George's Country, Maryland. TIE was developed as a results of AFIPS's commitment to help educators intensify the use of computers and high technology in pre-college education. The main vehicle for TIE was a two-day workshop conducted by the Minnesota Education Computing Consortium. The first day of the workshop dealt with planning, implementation, and evaluation of computers in schools while the second day provided guidance on the effective use of volunteers. During the workshop, 20 country educators were paired with 20 computer professionals from the Washington metropolitan area. It is expected that the partnerships formed between these educators and volunteers will results in a continuing support system which will directly benefit educators and students in Prince George's County. Pending favorable evaluation of the pilot phase, AFIPS expects to expand the project to 20 additional sites nationwide during 1986. 56 Computational Linguistics, Volume 12, Number 1, January-March 1986"]}]}