{"sections":[{"title":"WORKSHOP CHAIRS:","paragraphs":["Kentaro Inui Nara Institute of Science and Technology, Japan Ulf Hermjakob USC Information Science Institute, USA INVITED SPEAKER: Graeme Hirst (University of Toronto, Canada) ORGANIZING COMMITTEE: Regina Barzilay (Cornell University, USA) Mark Dras (Macquarie University, Australia) Ulf Hermjakob (USC/ISI, USA), Co-chair Kentaro Inui (NAIST, Japan), Co-chair Satoshi Sato (Kyoto University, Japan) Kazuhide Yamamoto (Nagaoka University of Technology / ATR-SLT, Japan) PROGRAM COMMITTEE: Bruce Croft (University of Massachusetts, USA) Sanda Harabagiu (University of Texas at Dallas, USA) Graeme Hirst (University of Toronto, Canada) Christian Jacquemin (Universite Paris Sud, LIMSI, France) Hongyan Jing (IBM T.J. Watson Research Center, USA) Gen’ichiro Kikui (ATR-SLT, Japan) Judith Klavans (Columbia University, USA) Helen Langone (Princeton (WordNet team), USA) Maria Lapata (University of Edinburgh, UK) Dekang Lin (University of Alberta, Canada) Daniel Marcu (USC Information Sciences Institute, USA) Teruko Mitamura (CMU, USA) Hiroshi Nakagawa (University of Tokyo, Japan) Patrick Pantel (University of Alberta, Canada) Harold Somers (UMIST, UK) Karen Sparck-Jones (University of Cambridge, UK) Manfred Stede (Universitaet Potsdam, Germany) Ralph Weischedel (BBN, USA) Yujie Zhang (CRL, Japan) Chengqing Zong (Chinese Academy of Sciences, P.R.China) Ingrid Zukerman (Monash University, Australia) WORKSHOP WEBSITE: http://nlp.nagaokaut.ac.jp/IWP2003/ PREFACE","This volume contains the papers accepted for presentation at the 2003 International Workshop on Paraphrasing (IWP2003), which is part of the 41st Annual Meeting of the Association for Computational Linguistics, held on July 11, 2003 in Sapporo, Japan.","A common characteristic of human languages is the possibility of conveying the same information in several ways. This diversity of expression presents a major challenge for many NLP applications. Thus, automatic paraphrase identication and generation can benet a broad range of NLP tasks, including machine translation, summarization, information retrieval, question answering, generation, and authoring and reading assistance.","Given this background, the workshop has been organized with the aim of connecting a broader range of research activities related to paraphrase identication and generation and stimulating intensive discussions on a special topic paraphrase acquisition. We also hope that succeeding workshops will be placed in a series establishing a new research eld.","From a initial slate of 26 papers submitted, the program committee selected 14 papers in a blind refereeing process, 13 papers of which are included in the proceedings with one paper withdrawn. We deeply and sincerely thank all our reviewers for doing an excellent job within the very short time available to them.","We would like to thank Graeme Hirst for accepting our invitation to speak at the workshop. His presentation Paraphrases Paraphrased will give participants a broad perspective on paraphrases, which we hope will establish a good common ground for fruitful discussions throughout the workshop. The discussion at the end of the workshop will include future directions of paraphrasing research as well as paraphrase resource building and sharing. We plan to include a paper version of the invited talk and highlights of the discussion on the workshop website at: http://nlp.nagaokaut.ac.jp/IWP2003/","Finally, we most gratefully acknowledge the exceptional cooperation of our organizing committee members. Kentaro Inui and Ulf Hermjakob Workshop co-chairs July 2003"]}]}