{"sections":[{"title":"Preface","paragraphs":["This volume contains the papers presented at the workshop entitled: Software Engineering & Architecture for Language Technology Systems. The workshop was held on May 31, 2003, and sponsored by the Human Language Technology Conference and North American Chapter of the Association for Computational Linguistics. The papers were refereed by an international panel of experts in the field. This Workshop is the first held under the auspices of the ACL to be directed at issues in software engineering and architecture for language technology. It may be surprising that we have waited so long to direct our attention overtly to the topic, but there have many people dealing with the problems of the field well before we conceived of this Workshop. Their work and interests has lead to strong support for the workshop and we are very happy to see the hidden activities of so many people come into a more visible arena. With the creation of this workshop came also the question of defining the scope of the topic. We received a number of good quality papers on topics which in the end we determined where not within the sphere of interest intended for the workshop. These were all papers that developed algorithms for certain computational linguistics problems such as parsing and n-gram manipulation. This decision has lead us to a partially de facto definition of the workshop topic, namely the description of methods for creating complex systems of interacting functionality of diverse components in the computational linguistics field. This description gives scope to the two main types papers represented in the workshop. The first type of paper deals with the architectural organisation of completed systems and the issues in creating successful interaction between heterogeneous components. The second type of paper is the speculative paper that proposes new methods or approaches to language processing tasks without necessarily demonstrating that such methods have been verified in practice. These papers were deemed meritorious when they exhibited insights that the referees considered to be innovative and promising. To create some demarcation between the speculative and the verified we have allowed a longer presentation time to the completed works than the speculative work. The collection of researchers and language industry engineers who need to more effectively manage large systems is growing, as well as greater effort to design systems that more effectively interact with those of others. Given such growth the workshop organisers will use this occasion to assess the breadth of interest to create a Special Interest Group in the field. We wish to thank the members of the Program Committee for reviewing the large number of workshop submissions on a very tight schedule. We would also like to thank Ed Hovy, Jason Eisner and Dragomir Radev for making the workshop possible."]},{"title":"Jon Patrick, Sydney Language Technology Research Group, University of Sydney Hamish Cunningham, University of Sheffield Program Committee","paragraphs":["Kenji Araki, Hokkaido University Xabier Artola Zubillaga, IXA, University of the Basque Country Stephen Beale, Computer Research Lab, New Mexico State University Stephen Bird, Melbourne University Kalina Bontcheva, University of Sheffield Walter Daelemans, Universities of Antwerp and Tilburg Thierry DeClerck, University of Saarland (CL-Lab) and DFKI (LT-lab) Bill Dolan, Microsoft Research, Redmond Alistair Knott, Otago University Mark Maybury, MITRE Corporation Diana Maynard, University of Sheffield Alan Marwick, IBM, TJ Watson Laboratory Cecile Paris, CSIRO, Australia Yorick Wilks, Sheffield University Ming Zhou, Microsoft Research, Beijing"]},{"title":"Further Reviewers","paragraphs":["Hisayuki Sasaoka, Asahikawa National College of Technology Hiroshi Echizen-ya, Hokkai-Gakuen University, Japan Stephen Bouwens, University of Sydney Xabier Arregi, IXA, University of the Basque Country Koldo Gojenola Galletebeitia, Industria Ingeniaritza Teknikorako Unibertsitate Eskola (IITUE) Arantza Díaz de Ilarraza Sánchez, IXA, University of the Basque Country Steven Bird, Melbourne University Corrin Lakeland, Otago University Youngja Park, IBM, TJ Watson Laboratory David Ferrucci, IBM, TJ Watson Laboratory Mary Neff, IBM, TJ Watson Laboratory"]}]}