{"sections":[{"title":"","paragraphs":["Summary","A formal grammar accounting for artistic abilities of a folk story teller is proposed. This grammar comprises the following components: I) a grammar defining the set of formulae representing steps of text generation; 2) a list of \"messages\" underlying the texts of a folklore genre; 3) a list of \"rules of embellishment\" serving to attach artistic qualities to \"messages\" and intermediary steps of text generation. I. Introduction","The best way for a researcher to present his knowledge of folklore is to demonstrate the ability to construct at least rough approximations of folk stories. This should be done with all the techniques accessible to immediate observation and checking up. We take the standpoint that at the deepest level of a text lie thematic elements which constitute the \"message\" of the text. \"Rules of Embellishment\" are applied to these elements and attach artistic qualities to them. The analysis of a text is to be represented as a process of generating it by \"Rules of Embellishment.\" These Rules are analogous to transformations in linguistics. They are \"message-preserving\" devices serving to increase the expressive power of themes.","Every rule of embellishment is a particular instance of some \"principle of expressiveness,\" from the set of such \"principles\" proposed by ¥u. Shcheglov and A. Zholkovsky (linguists and philoloqists who until recently worked in the USSR~ ~ore of their works see in the Bibliography in ~. There follows the list of the principles of expressiveness.","Embodiment (EMBOD) - a substitution of some more concrete and \"vivid\" element X 1 for a more abstract element X. The element X 1 has all the properties of X plus some new feature(s).","Examples: a man ÷ a carpenter; a city ÷ New York; a nose ÷ a very big nose.","Amplification (AMPLIF) - a substitution of an \"amplified\" element X! for a more \"neutral\" element X. The amplification may be with respect to dimensions, duration, degree, etc.","Examples: deception ÷ treachery; rape ÷ child-rape; talent ÷ genius.","Repetition (REPET) - a substitution of a series of nearly identical elements X, X 1 ..... X n for an element X. A FORMAL GRAMMAR OF EXPRESSIVENESS","FOR SACRED LEGENDS","F. Dreizin, A. Shenhar, H. Bar-ltzhak Haifa University, Haifa, Israel","Examples: a door ÷ the first door, the second door, the third door .... ; a waiter ÷ the first waiter, the second waiter ....","Variation (VAR) - a substitution of a series of substantially different elements X I, X 2 ..... X n for an element X so that each one is the result of an EMBOD applied to X.","Examples: a man ÷ a carpenter, a student, a taxi-driver .... ; a building ÷ a church, a mosque, ...","Detailization (DET) - a substitution of a detailed description Y1 of a thing, situation or action Y, for Y.","Examples: X is ill ÷ X stays in bed and X has no appetite and X has a high temperature; an old Jew dies ÷ an old Jew isn't well, other Jews come, they pray together, the Rabbi comes to visit the old Jew, the old Jew is dead and the body is carried to the cemetery. Compare an EMBOD of 'X is ill' ÷ 'X has pneumonia'","Contrast (CONTR) - a substitution of two contrasting elements X and Anti-X for an element ×.","Examples: death ÷ perfect health, death; treachery ÷ loyalty, treachery.","Exposition (EXPO) - a substitution of two elements pre-X and X for X, where pre-X precedes X in the text; pre-X may be: a) incomplete X (the shadow of X appears and","then X itself); b) the felt absence of X (everybody is waiting","for X, then X appears); c) Anti-X followed by X. The only difference","between this case and CONTR is the order of","Anti-X and X.","Adjustment (ADJ) - of X to Y with respect to a feature f: X 1 is substituted for X, where X 1 has all the essential properties of X, plus some feature f of an element Y occurring in the derivation of a text.","Examples: touch (X), love (Y); Xl = embrace; house (X), many people meet (y); X 1 = club.","Amalgamation (AMALG) - of X with Y - a substitution of an element Z for X and Y where Z is the result of EMBODs applied both to X and Y.","Examples: death (X), love (¥); Z = romantic suicide; presence (X), absence (Y), Z = a person in disguise.","Reduction (RED) - a substitution of X 1 for X, where X 1 is such a part of X that all the thematically important information contained 159 in X can be restored by means of X I.","Examples: M. Dayan ÷ one-eyed Israeli Minister; murder + a blood-stained knife; Jewish religion ÷ a Torah scroll; communism ÷ The Red Banner. Compare EMBOD: Jewish religion ÷ orthodox Jewish religion; communism ÷ Chinese communism.","It seems to us that the most important innovations of ShcheglovandZholkovsky are ADJ and AMALG. The hypothesis that these principles are employed in the construction of literary texts means the presence of intensive links between text elements. Let us give a simple example of the intensification of such links. Consider a \"theme\"","I. A person X uses an object Y to injure a person g who uses an object d for aggressive purposes. We shall establish links between some elements of this text. First, we shall declare Y and d to be the same object:","2. A person X uses an object s to injure a person g who injures others with this very object s. Now we shall establish a link between g and s. Let's make s a sort of RED(g):","3. A person X uses an object s, which is used for aggression by g and is inherently typical of g, to injure g. This quasi-text has obvious artistic qualities and may be interpreted, for example, as:","4. The hero causes the situation where the Dragon bites itself with its venomous teeth. \"k \"k Some applications and specifications of the above ideas follow.","We were looking for the answers to questions like: What are creative abilities of folklore story-tellers? What are poetic systems of different folklore genres? As the first object of our investigation we have chosen sacred legends of Moroccan Jews.","To make the \"Principles of Expressiveness\" technically workable, we represent steps of text generations by formulae of a formal language devised especially for this purpose. So analyzing a given text (a legend) - rewritten in our formal language - means construction of a minimal sequence of formulae of this language so that:","I. The last formula is an approximation","of a given text.","2. One or more formulae of the sequence","are themes (\"messages\").","3. Every formula Q4, which is not a","\"message\", is obtainable with an appli-","cation of a rule of embellishment","from one or more formulae Qj, j < i.","This resembles a proof of a theorem, where a \"message\" is a sort of axiom, Rules of Embellishment are rules of inference, and a text is a theorem to be proved. By the set of possible \"messages\" and Rules of Embellishment, the set of all possible texts(i.e., the genre of Moroccan Jewish sacred legends) is given as the set of all provable theorems of our calculus. 2. Well-Formed Formulae","We present below a grammar of the contextfree language defining the set of all wellformed sentences (formulae) used to represent steps in the generation of sacred legends. The well-formedness is understood as a purely syntactical feature, Rule I. <text>÷#<t-section>(><t-section>)*# Here #~ a terminal boundary symbol, ~ means \"then\", \"and after that\", * is Kleene's star operator; the parentheses are neither terminal nor nonterminal symbols, they only mean that the sequence ><t-section> is to be repeated as a whole, A t-section represents an event. For example we may obtain with the Rule I: #<t-section> > <t-section> > <t-section># Rule 2. <t-section> ÷ <sign>(<t-section>) Rule 3. <sign> ÷ + I- I = I ~ The sign + marks an event which is good for the Jews; the sign - marks an event which is bad for the Jews; the sign = marks an event which is particularly bad for the Jews; an event with","is neither bad nor good for the Jews, but implies a hope or a possibility for the good, Rule 4. <t-section> ÷ (<t-section>(~<t-section>)*) Here the inner pair of parentheses is used as in Rule I. The siqn ~ is used to say that two or more events are amalgamated:(a~b) is one event which is an AMALG for two events a and b; ~Qb~c) means that three events, a,b, and c are amalgamated into one, etc. More about the amalgamation of events will be said below. Rule 5. <t-section> ÷ STAT(<t-section>) The operator STAT can make any event into a \"stative\" event. A stative event is, in a way, timeless. STAT makes a lasting situation out of an event. For example, STAT(x loses y) may mean \"x has lost y\", or else \"x would usually lose y\".","An action in the scope of STAT loses in part its usual consequences (a crime against the Jews performed under STAT is not punished, for example). Protagonists involved in actions under STAT may be more general than outside the 160 scope of STAT (Jewish community vs a Jew, for example). That is, a term in the scope of STAT may not undergo an EMBOD affecting its occurences in the rest of the formula. Rule 6. <t-section> + STEP(<t-section>) The operator STEP makes a partial event from a complete one. For example, STEP(x comes) may be understood as \"x knocks at the door\", or else \"x is seen through the window\", etc. In this case, STEP(STEP(x comes)) may be understood as \"x is unclearly (or partially) seen through the window\". Rule 7. <t-section> ÷ QUASl(<t-section>) The operator QUASI is used to designate a symbolic or ritual counterpart of an event. For example, QUASl (The army occupies the city) may be \"The army leader receives the keys of the c i ty\". Rule 8. <t-section> ÷ <adverb>(<t-section>) Rule 9. <adverb> ÷ MIR I ANTI I NOT MIR means \"miraculously\"; ANTI means \"opposite to...\"; NOT may be understood as negation. Rule I0. <t-section> ÷ <predicate expression>(&<predicate expression>) A more complex event is represented as an unordered set of simpler events. Rule II. <predicate expression> + <sign>(<predicate expression>) Rule 12. <predicate expression> ÷ <adverb>(<predicate expression>) Rule 13, <predicate expression> ÷ DISTRESSED(< e~rm>)l TRY(< e~rm, <t-section>)IDESTROY(< e~m>,< e~rm>)l Falk(~e~m>,<t-section>)IPROSELYTIZED(<~e~m>)l GUILTY (<e>t----<rm>)IkOSE(<e~-<rm>,<e>~-<m>)INEGkECT , (< e~rm>,< e~)IUSE(< e~,< e~rm>)IFIND(< e~m>, <~-er~<>)ICAREgOR(<e>~-~rm>,<e>t----<rm>')llNaURE(<e~----<rm>, < e~rm>)ICAUSE(<t-section>,<t-section>)IGIVEBACK (< e~rm>,< e~rm>)IPRAISE(< e~rm>,< e~rm>)IREVENGE (< e~rm>,< e~rm>)IRESPECT(< e~>,< e~)IRESTORE (< e~rm>,< e~rm>)IMISAPPROPRIATE(< e~rm>,< e~rm>) IABASE(< e~m>,< e~m>)IDEFIkE(< e~m>,< e~m>)l DISABLE(< e~rm>,< e~rm>)IPETRIFY(< e~,< e~rm>)l INATTACK(<e~---<rm>,<e~---<rm>)ICURE(<ee~>,<e~-<rm>)l CANCELED(<t-section>)IACTI6N(<te~rm>)IKILL (<eee~m>,<e~e~-<m>)IPROHIBIT(<e~----<rm>,<t-section>)l PROTECT (<t>T-rm~,<ee~m>)ISTARVED (<t~><)l DAMAGED(<e>t-----<rm>)IBLIND (<e~m>,<e~m>)IPRESENT (< e~>,< e~>,< e~>)IMAKESEE(< e~rm>,< e~rm> )","DISTRESSED(x) is a state or an event which is bad for x with respect to material, moral or physical conditions. PROSELYTIZED (x) means that x imposes on himself, partially or completely, the laws of the Jewish religion, GUILTY(x) is a state of x which is punishable by the authorities for an offence against them. USE (x,y) is a typical, normal relation between human x and a thing y, y being conceived exclusively as a means of x's well-being. The exact nature of this relation depends on x and y. For example, x beinq a community and y saint's shrine, USE becomesvisitingandpraylng, asking for help, being cured, etc. INJURE(x,y) is x's doing any harm to y. CAUSE (A,B) means: the event A happens and involves the event B. RESTORE (x,y) means liquidation of the consequences of x's injuring y. DISABLE and PETRIFY are two forms of paralysis, the first one partial, the second one complete. INATTACK (x,y) is involuntary injuring y by x. CANCELED (A) means: all the consequences of the event A become non-existent. MAKESEE (x,y) means that x causes the blind y to see. Rule 14.","> < The symbol over a term may be rewritten as ~ - ~,~_mean For a term x the expressions"]},{"title":"T,","paragraphs":["respectiyely, that the occurrence of a predicate, with x, ~, x filling up a slot, is bad for x, good for x, or involves a hope for the good for x. > < may also be omitted. This rule can be easily rewritten in a contextfree form, without diacritical marks and the possibility of a mark deletion. (A change in the Rule 13 is also needed.) Rule 15. <term> ÷ <variable feature>(~<feature>)*l","<feature>(,<feature>) The asterisk occurring between features is a terminal symbol and should not be confused with Kleene's star operator. Rule 16. <variable feature> ÷ x I ] x2 I x 3 ..... Rule 17. <feature> ÷ <simple feature>l<functor feature> I <negative feature> Rule 18.","<simple feature> ÷ THINGISYMBOLIHUMANISINGLE I GROUPIVALOBJICARPETIJIAISPICOMIMONEYIMOSQUE ISYNAGOGUEIFOOD]MALEIFEMALEJSIMPLEIIMPORTANT 161"]},{"title":"IVER!MPIOFFICIALIHAWKERISHEPHERDIRICHI,","paragraphs":["POORtRELAISECAIRABBIIITZHAKIPINTOIKADI l SHEIKIKINGITROUBLEDIILLIFEVEREDISTERILEI HYPOCRITE SYMBOL is an important object which has some ideological value for a community. VALOBJ is a valuable object without ideological importance. J means Jewish. A means Arabic. SP is an object possessing sacred power. CON means community. VERIMP means a very important person. RELA is religious authority. SECA is secular authority. TROUBLED means in trouble. HYPOCRITE means \"pretending to be a friend of the Jews\". ITZHAK and PINTO are proper names of typical Jewish rabbis.","Rule 19.","<functor feature> + GRAVE~<simple feature> (*<simple feature>) )[SHRINE(<simple feature>(,<simple feature>)~)ISON(<simple feature>(,<simple feature>)~)IWIFE (<simple feature>(,<simple feature>)*)l DAUGHTER(csimple feature>(,<simple feature>)~)IPROPERTy(<simple feature> (,<simple feature>) ~) Rule 20. <negative feature> ÷ #(<simple feature>(,<simple","feature>)*) A term including a negative feature is characterized by the negation of at least one simple feature included in the given negative feature. A term corresponds, generally, to an object characterized by the conjunction of the non-negative features which it is composed of. For example,","MALE*SINGLE,SHEPHERD*#(RICH*ILL) means: \"A (male) shepherd who is either not rich or not ill, or else is neither rich nor ill\". 3. The Messages I. # -(DISTRESSED(J*~)) ~ +(ACTION(J*RELA))> +(ANTI(DISTRESSED(J*~)))#","2. # -(INJURE(HUMAN*A,J)) ~ +(MIR(PROTECT @,SP ,~) ) ) # 3. # -(INJURE(HUMAN,Aj)) ~ +(HIP(REVENGE","(J*SP,HUMAN*A)))# 4. # -(INJURE(HUMAN*A,J)) > +(HIP(REVENGE","(J,SP,FFOI~TAN,~))) > +(RESPECT(A,~)) > +(MIR","(RESTORE(J,SP,~)))#","The well-formedness of the above four messages can be easily verified. Using the informal semantics given above with the formal syntactical rules of our language, we can read, for example, the second message approximately as follows: \"A human Arab agent (HUMAN,A) injures a Jewish object (J), which is bad for the Jews (the event is marked by minus), and after that (>) a Jewish bearer of Sacred Power (J*SP) miraculously (MIR) protects the (above) Jewish object, which is good for the Jews (marked by plus).\"","The above messages can be developed into separate stories. But a subset of them can be also \"amalgamated\" to a single story by the appropriate rule of embellishment. 4. The \"Rules of Embellishment.\"","These rules are the central part of our grammar. There are many of them; we cannot present here more than several typical examples taken from our technical reports(see 2).The set of possible objects (protagonists and things) of the legends is described in 2 by a network grammar: a possible object is an unordered set of features picked up from the arcs of the network by moving from the initial state to a final state. Asterisks are inserted between the features. Examples: the term HUMAN,SINGLE, VERIMP,RELA*J*SP*MALE can be understood as \"A Jewish Saint\"; the term THING*SINGLE*SYMBOL*A* GRAVE(HUMAN*SINGLE*VERIMP*RELA*A*MALE*KADI) can be read as \"the grave of an Arab Kadi.\" The same network serves to EMBOD terms: to any set of features which belong to a path in the network we may add any set of features which belong to the same path. So, for example,","HUMAN,GROUP ÷ HUMAN,GROUP,A,SIMPLE,MALE","(\"people\" ÷ \"some Arabs\") is a rule of embodiment for terms by virtue of the fact that there is a path in the network to which both the left-hand set of features and the right-hand set belonq (see the network in 2 pp. 15-18; the report 2 is to be distributed among the participants of COLING-80).","NB: Any rule of embodiment, when chosen, is to be applied to every occurrence of the expression Ifor exampie, the term) which is to be substituted for. There are complications, for example, with EMBOD of RESPECT, but we shall not deal with them here.","By a rule of such kind we can obtain, for example, from the second message the following formula: # -(INJURE(HUMAN*A*VERIMP,SlMPLE*J)) > +(MIR (PROTECT(J*SP,SIMPLE*J)))#.","The following rule is an example of EMBOD for predicate expressions: INJURE(HUMAN,A, HUM~) ÷ MISAPPROPRIATE(HUMAN, ~, PROPERTY(HUMAN*J)).","The applicability of such rules is conceived so as to make possible the application of this rule to the above formula (cf. 2, pp. 29-32), with the following result: -162 #-(MISAPPROPRIATE(HUMAN*A*VERIMP, PROPERTY (SIMPLE*HUMAN a))) > +(MIR(PROTECT(J*SP, S IMPLE*J) ) ) #. The feature HUMAN (which is, in our grammar, predictable by the feature SIMPLE) can be in-troduced to the last term by obligatory ADJ to SIMPLE*HUMAN,J (which is considered an immediate descendant of SIMPLE,J), with the result: #-(MISAPPROPRIATE(HUMAN,A,VERIMP, PROPERTY (SIMPLE,HUMAN*J))) > +(MIR(PROTECT(J*SP, SIMPLE*HUMAN*J)))#. So the identity of the Jewish protagonist is restored, Now we can amalgamate the above formula with the third message. This is the simplest case of AMALG: the two chains of events are mixed up to produce one chain comprising all the events. This is done under control of the (thematic) principle prescribing that all \"minus-events\" precede all \"plus-events\": #-(INJURE(HUMAN*A,J)) ~ -(MISAPPROPRIATE(HUMAN* A*VERIMP, PROPERTY(SIMPLE*HUMAN*J))) > +(MIR (REVENGE(J,SP, HUM~))) > +(MIR(PROTECT(J*SP, SIMPLE*HUMAN*J)))#. Now, we do not need two different villains. One villain will do: we can polish the formula by ADJ of the term HUMAN,A to the term HUMAN,A, VERIMP. This optional adjustment is a specific case of EMBOD: an expression is EMBODed so as to become similar (in the limit case-identical) to another expression of the operand formula.","So we obtain: #-(INJURE(HUMAN*A*VERIMP,J)) ~ -(MISAPPROPRIATE (HUMAN*A*VERIMP, PROPERTY(SIMPLE*HUMAN*J))) +(MIR(REVENGE(J*SP, HUMAN*A*VERIMP))) ~ +(MIR (PROTECT(J*SP, SIMPLE*HUMAN*J)))#.","The term J of the first t-section can underqo an analoqous operation, and now we shall have only one Jewish protagonist in the story (a \"SIMPLE\" one): #-(INJURE(HUMAN,A,VERIMP, J,SIMPLE*HUMAN)) > -(MISAPPROPRIATE(HUMAN*A*VERIMP, PROPERTY (SIMPLE,HUMAN,J))) > +(MIR(REVENGE(J*SP, HUMAN*A*VERIMP))) > +(MIR(PROTECT(J,SP, SIMPLE* HUMAN*J)))#.","Two different acts of'~njuring\" can be amalgamated to one by the followin 9 rule: two different t-sections X and Y such that Y can be obtained from X by rules of EMBOD, can be amalgamated by dropping X. Now Y serves to represent both X and itself. By applying this rule to the above formula, we obtain: #-(MISAPPROPRIATE(HUMAN,A, VERIMP,PROPERTY (SIMPLE*HUMAN*J))) > +(MIR(REVENGE(J,SP, HUMAN*A*VERIMP))) > +(MIR(PROTECT(J*SP, SIMPLE,"]},{"title":"HUM~)))#.","paragraphs":["Now, one can amalgamate the SP's acts of revenge and protection, with the result: #-(MISAPPROPRIATE(TIUMAN,A*VERIMP, PROPERTY (SIMPLE*HUMAN*J))) ~ +(MIR(REVENGE(J*SP, HUMAN*A*VERIMP)) ~ MIR(PROTECT(J*SP, S'iMPLE* HUMAN*J)))#.","This formula can be read as follows: \"A human Arab agent belonging to the highest social stratum misappropriates a property of a Jewish person of low status. After that an event occurs which is at the same time an act of Jewish Saint's revenge with respect to the Arab, and an act of this Saint's protection with respect to the Jew.\"","This story still needs an interpretation, but we think that even at this stage the above text possesses some artistic potential accumulated in the process of its derivation from the themes (messages). A rough interpretation of this text could run as follows:","\"The Sheik misappropriates a valuable thing belonging to a Jewish shoemaker (or carpet-maker), and the Rabbi causes this thing to return miraculously to its legal possessor In a way which damages the Sheik.\"","A more delicate interpretation can give us something like: \"...the misappropriated carpet (in the case of a carpet-maker, with an appropriate ADJ) miraculously returns to its possessor carrying the frightened Sheik on it.\"","Or else: \"... the misappropriatedpair of shoes (in the case of a shoemaker, with an appropriate ADJ) miraculously returns to its possessor carrying the Sheik wearing them.\"","Such interpretations are beyond the capabilities of our grammar, but (we hope) not far beyond the capabilities of grammars of the kind proposed.","Interpretations for simpler cases of AMALG for events are easily achievable technically, for example: (INJURE(A,J) ~ INJURE(HAWKER,SHEPHERD)) ÷ INJURE(A,HAWKER,J,SHEPHERD), etc. Amalgamated events are usually good for the Jews. Events which happen to be good for the Arabs are simple, trivial. Let us take now one more example, rather typical for our material: ... ~ +(INJURE(SP, SIMPLE*A)) > +(INJURE(SP, VERIMP*A)) > ... --163--","Amalgamating injuries with two different persons injured is a typical artistic device in Moroccan Jewish sacred legends. At present, we only assume the \"intention\" of a story-teller (or a story author) to amalgamate the above events: ... ~ +(INJURE(SP,SlMPLE,A) ~ INJURE(SP, VERIMP,A)) > ... Now, how is this aim achieved? Typical Jewish legend uses a technicality which may be called Deposite. Deposite is a thing or a person related to authorities but temporarily under the responsibility of a \"simple\" person. Injuring a deposite means injuring both the \"simple\" person and the \"very important\" person involved. In the story analyzed in 2 the deposite is the Sheik's son. In another story the role of a deposite is played by a gift (of a group of \"simple\" Arabs to the Sheik).","The amalgamated character of SP actions is so typical of our legends that it may be conceived as nearly thematical. In general, an optional artistic device can move to the thematic sphere and become obligatory. It is nearly so in the case under discussion where the amalgamation around an SP action is preferable, though a concrete realization of the operator~leaves considerable freedom to a story-teller.","There follow more examples of rules of embellishment. #s(a)>+ #s(STAT(s(a)))","Here s is a sign. This rule serves to turn the opening event of a story to the exposition, a standing situation which is to become the background for the rest of events. >s(a)# ÷~s(STAT(s(a)))# This is an analogous rule for the transformation of the last event to the coda, the epilogue of a story.","There follow two rules for EMBOD of STEP:","STEP(a) ÷ QUASI(a)","s(STEP(s(a I &a 2&... &ak))) + s(ai)(i=l, or i=2 ..... or i=k)","The last rule is a way to EMBOD an EXPO for a set of events: an event from the set occurs.","Now we shall present a rule of EXPO (which exists in three different forms):",">-(T) >4> -(TRY(-t-,-(T)))>-(T)","#-(T) >+# -(TRY(-{-,-(T)))>-(T)",">+(T) >÷> -(TRY('t-,+(T)))> ,(T)","TAe above rule works for a t-section T where t appears in the first place of the highest predicate of T which does not appear immediately after ANTI or NOT; otherwise Y should appear in the first place of the highest predicate.","Example: the expression ... ~ +(ANTI(DISTRESSED(HUM~)))~ ... can be transformed by the above rule to ... ~ ~(TRY(ROMAN~J,+(ANTI(DISTRESSED(HUM~)))))","+(ANTI(DISTRESSED(FF~-)))> ...","An example of AMPLIF (or CONTR, or rather AMPLIF by CONTR):","-(PROHIBIT(A,+(P(t I)))) ~ + >-(PROHIBIT(A,+ (P(tl))))~ -(P(a))~ Here P(tl) is a predicate expression with a term ~I in its first place (or the only place). The t-section P(A) is obtained by substituting the term corresponding to A (an a~ab_agent) for t I in P(t), and changing any tilt I to t i. This is an AMPLIF for prohibition: an Arab agent not only prohibits t's doing P, but does P himself (or herself). Example: ... > -(PROHIBIT(A*VERIMP,+(USE(SIMPLE*J, J*SYMBOL))))~...+ ...>-(PROHIBIT(A*VERIMP, +(USE(SIMPLE*J,J*SYMBOL)))) > -(USE(A,VERIMP, J*SYMBOL))p ..,","The principle of CONTR is exemplified also by the following rule: s(TRY(-t-,T)) ÷ s(TR¥(-t-,T)) > FAIL(t,T), where s is a sign, t is a term and T is a t-section.","Many other rules of embellishment, amon~ them some more sophisticated ones, see in 2","Some transformations, which we call Formal Equivalences, do not contribute to expressiveness, but serve only to improve readability of a formula and to facilitate implementation of the Rules of Embellishment. There are rules eliminating adverbial expressions: so(ANTI(si(ABASE(tl,t2)))) ÷ So(PRAISE(tl,t2)) or el se so(ANTl(sl(DISaBkE(tl,t2)))) + so(CURE(tl,t2)); there are rules dealing with signs: NOT(-(T)) ÷ +(NOT(-(T))) or el se So(So(T) ) ÷ So(T), and many others. Here s o and s I are signs, t I and t 2 are terms, and T is a t-section. 5. The Final Example.","We present below a typical Moroccan Jewish sacred legend - the text and the final step of a rather lengthy derivation representing an analysis of the legend in our grammar. This is a very rough approximation of the Text. The -164 derivation see in 2 The formula is obtained from the \"messages\" i and 4.","HOW A HOLY JEWISH TOMB WAS DISCOVERED","Once the Arabs of Teluat near Marrakesh built a fence around their graveyard. In this graveyard was buried a great and learned rabbi. The Arabs did not know of this, for in the village in which the graveyard was situated there were only Arabs, and no Jews at all.","One night one of the women of the village dreamed that a man dressed in a long white shirt and with a long white beard came to her. He said to the woman: \"In the morning inform the men of the burial society of the Jews in the neighbouring town that their rabbi, who is buried in the Moslem graveyard in the village, has no peace.\"","\"Iris just a dream,\" said the woman to herself. But the dream was repeated. Again the woman said: \"It is just a dream.\" But when the dream was repeated for the third time, she knew that the dream spoke truly to her. On the following day she went to the town to tell about her dream.","Themen of the burial society came to the sheik of Tthe village and said to him: \"Our,~rabbi is buried in yQur graveyard. Permit us to seek outthe place. We shall pay you much money if you will allow us to build over the grave a place for prayer.\"","\"Good,\" the sheik agreed.","The men Of the burial society sought and sought but they found nothing. The son ~'the sheik began to get angry and began to durse them and &ay: \"What are you looking for ~pre? A rabbiwwho died a hundred years ago? \" He turned aside to,,ease himself b~tHe fence, and then suddenly he stood like-a stone, paralysed.","When the men of the burial society who were already getting ready to go back to the town saw the sheik's son standing like:a stone statue, they understood: Here was the grave of the rabbi.","The Arabs asked: \"What shall we do with, the sheik's son? The sheik will kill us if ,- he hears that his son has become paralysed.\"\"","\"Break down the fence!\" the men of the burial society commanded. And straight away the Arabs broke down the fence.","Then they drew a circle about the spot where the sheik's son was standing,,took stones and wrote upon it \"A holy ~e~i,sh grave\". Then the sheik's son began to move,~is limbs and move from the place. \"Where am I?\" he asked. \"What has happened to me?\"","They told him everything and then he said: \"If that is the case then your rabbi is indeed great.\"","The Arabs erected a monument on the grave, and every year the Jews came there to celebrate the Rabbi's birthday. See Dov Noy 3 , pp. 42-43. The last few lines are an addition from the Hebrew version of the legend. The final step of our derivation: #-(STAT(-(-(LOSE(HUMAN*COM,J, THING*SYMBOL* SINGLE*J*SP*RELA*GRAVE(HUMAN*SINGLE*VERIMP*RELA* J*SP*MALE*RABBI))) & -(NEGLECT(J,HUMAN*COM, THING,SYMBOL*SINGLE*J*SP*RELA*GRAVE(HUMAN*SINGLE *VERIMP*RELA*J*SP*MALE*RABBI))) & -(NOT(+(USE (J,HUMAN*CON, THING*SYMBOL*SINGLE*J*SP*RELA* GRAVE(HUMAN*SINGLE*VERIMP*RELA*J*SP*MALE* RABBI)))))))) > -(MISAPPROPRIATE(HUMAN,GROUP,A* IMPORTANT,MALE,OFFICIAL, THING*SYMBOL,SINGLE*J* SP*RELA*GRAVE(HUMAN*SINGLE*VERIMP*RELA*J*SP* MALE,RABBI))) ~ ~(TRY(AOMAN~GROOP~J~iMPOR~ANT~ ~[E~O~T~[,+(+(FIND(HUMAN,GROUP,J*IMPORTANT* MALE,OFFICIAL, THING*SYMBOL*SINGLE*J*SP*RELA* GRAVE (HUMAN*SINGLE*VERIMP*RELA*J*SP*MALE * RABBI))) & +(CAREFOR(HUMAN*GROUP*J*IMPORTANT* MALE*OFFICIAL, THING*SYMBOL*SINGLE*J,SP,RELA,GRAVE ('HUMAN,SI NGL'E*VERI MP*RELA*J-,SP,MALE,RABB I ) ) ) & +( US E (HUMAN*GROUP*J*I MPORTAN=T*MA-L E*OFFI CI AL, THING*SYMBOL*SINGLE*J*SP*RELA*GRAVE*(HUMAN* SINGLE*VERIMP*RELA~J*SP*MALE*RABBT)))))) ~ - (ABASE(HUMAN*SlNGLE*VERIMP*A*MALE*SON(HUMAN * SINGLE*VERIMP*A*MALE*SECA*SHEIK), HUMAN*GROUP* J*IMPORTANT*MALE*OFFIClAL)) ~ -(FAIL(HUMAN* GROUP*J*IMPORTANT*MALE*OFFICIAL, +(+(FIND(HUMAN • GROUP*J*IMPORTANT*MALE*OFFICIAL, THING*SYMBOL* SINGLE*J*SP*RELA*GRAVE(HUMAN*SINGLE*VERIMP*RELA* J*SP*MALE*RABBI))) & +(CAREFOR(HUMAN*GROUP*J* IMPORTANT*MALE*OFFICIAL, THING*SYMBOL*SINGLE*J* SP*RELA*GRAVE (HUMAN*SINGLE*VERIMP*RELA*J*SP*- MALE*RABBI))) & +(USE(HUMAN*GROUP*J*IMPORTANT* MALE*OFFICIAL, THING*SYMBOL*SINGLE*J*SP*RELA* GRAVE(HUMAN*SINGLE*VERIMP*RELA*J*SP*MALE* RA~)))))) > +(CAUSE(DEFILE(HUMAN*SINGLE* VERIMP*A*MALE*SON(HUMAN*SINGLE*VERIMP*A*MALE* SECA*SHEIK), THING*SYMBOL*SINGLE*J*SP*RELA* GRAVE (HUMAN*SINGLE*VERIMP*RELA*J*SP*MALE* RA~)), +(MIR(+(DISABLE(THING*SYMBOL*SINGLE*J* SP*RELA*GRAVE(HUMAN*SINGLE*VERIMP*RELA*J*SP* -165 MALE*RABBI), HUMAN*SINGLE*VERIMP*A*MALE*SON (NUMAN*SINGLE*VERIMP*MALE*A*SNEIK))))) INATTACK(HUMAN*GROUP*A*IMPORTANT*MALE*OFFIClAL, HUMAN*SINGLE*VERIMP*A*MALE*SECA*SHEIK)~ +(QUASI (+(CAREFOR(HUMAN*SINGLE*VERIMP*A*MALE*SON (HUMAN*SINGLE*VERIMP*MALE*SECA*SHEIK*A), THING* SYMBOL*SlNGLE*J*SP*RELA*GRAVE(HUMAN*SINGLE* VERIMP*RELA*J*SP*MALE*RABBI))))) ~+(FIND(HUMAN* GROUP*J*IMPORTANT*MALE*OFFICIAL, THING*SYMBOL* SINGLE*J*SP*RELA*GRAVE (HUMAN*SlNGLE*VERIMP* RELA*J*SP*MALE*RABBI))))) > +(GIVEBACK(HUM~ GROUP*A*IMPORTANT*MALE*OFFICIAL, THING,SYMBOL, SlNGLE,J,SP,RELA,GRAVE~HUMAN,SINGLE,VERIMP*RELA* J*SP*MALE*RABBI))) > +(QUASI(+(CAREFOR(HUMAN* GROUP*A*IMPORTANT*MALE*OFFICIAL, THING*SYMBOL* SlNGLE*J*SP*RELA*GRAVE(HUMAN*SINGLE*VERIMP* RELA*J*SP*MALE*RABBI))))) > +(MIR(CURE(THING* SYMBOL,SINGLE,J*SP,RELA,GRAVE(HUMAN*SINGLE* VERIMP,RELA*J*SP*MALE*RABBI), HUMAN*SINGLE* VERIMP,A*MALE*SON(HUMAN*SINGLE*VERIMP*A* MALE*SECA*SHEIK))) ~ MIR(CANCELED(GUILTY(HUMAN* GROUP~A,IMPORTANT*MALE,OFFIClAL)))) > +(PRAISE (HUMAN,SlNGLE*VERIMP*A*MALE*SON(HUMAN*SlNGLE* VERIMP*A*MALE*SECA*SHEIK), HUMAN*GROUP, J* IMPORTANT*MALE*OFFICIAL) ~ PRAISE(HUMAN*SINGLE* VERIMP*A*MALE*SON(HUMAN*SINGLE*VERIMP*A*MALE* SECA*SHEIK), THIN G*SYMBOL*SlNGLE*J*SP*RELA* GRAVE(HUMAN*SlNGLE*VERIMP*RELA*J*SP*MALE* RABBI)))~+(STAT(+(+(FINB(~HUMAN~COM, THING* SYMBOL*SINGLE*J*SP*RELA*GRAVE(HUMAN*SINGLE* VERIMP*RELA*J*SP*MALE*RABBI))) & +(CAREFOR (J,HUMAN COM, THING*SYMBOL*SINGLE*J*SP*RELA* GRAVE(HUMAN*SINGLE*VERIMP*RELA*J*SP*MALE* RABBI))) & +(USE(J*HUMAN*COM, THING~SYMBOL* SlNGLE*J*SP*RELA*GRAVE(HUMAN*SINGLE*VERIMP* RELA*J*SP*MALE*RABBI))))))#","We shall informally describe some artistic features of this legend which we tried to account for by our analysis.","The discovery of the holy grave is preceded by attempts to find it. This is not a simple repetition which is characteristic of fairy tales (\"... tried once and did not succeed, tried the second time and did not succeed, tried the third time and succeeded...\"). In our legend the failure is to be taken more seriously: the Jews acknowledged the defeat and were ready to leave the graveyard. A professional story writer (for example, a detective story writer) would not ignore such a device: the detective tries to find the decisive evidence, admits his failure (for example, calls to the police office: \"Nothing of interest!\") and then - by accident - finds the desired object. In our story, too, the discovery is accidental. It does not result from any additional effort by the Jews. More than that, it is caused by a hostile action.","The punitive action by SP (the Sheik's son being petrified) creates a knot of entangled events; in fact, one event which comprises different actions. The petrification is, at the same time, the discovery of the holy grave by the Jews (no separate action of finding is involved). The petrification means that the Jews have found the holy grave, Tt is a sign of the holy grave being here. More than that: the Sheik's son being pet~ied means danger for the group of Arabs who are responsible for his peaceful return home. The Arab community is punished by endangering a representative group of Arabs (\"officials\"). The last component of the complex event under consideration is the Sheik's son's being turned to a sort of stone, a sort of statue. The symbolic significance of this act was recognized not only by us but also by some students, including those of Moroccan Jewish origin: petrifying the Sheik's son is a symbolic counterpart of erecting a monument on the holy grave. The Sheik's son is forced to erect a sort of monument with his own body. Thus an action which is to be performed by the Jewish community is in fact performed (in symbolic form) by a hostile agent. This is a manifestation of a principle which the whole story is permeated with: plus-actions are regularly performed by the potential or actual enemy - the Arabs. The Rabbi appears in the dream to an Arab woman. It is up to her to inform the Jewish community of the problem which has arisenl. The symbolic monument is first erected with the Sheik's son's body. The Arabs them-selves destroy the wall around the cemetery, not just permitting the Jews to do so. The Arabs encircle the holy grave, to designate its exterritoriality in the Arab graveyard. They then erect a temporary monument with some stones. Finally, the Arabs build the proper monument.","Bibliography","I. Shcheglov, Ju. K. and A.K. Zholkovskij, 1976. Poetics as a Theory of Expressiveness. Poetics 5:207-246.","2. Dreizin F., Shenhar A., Bar-ltzhak H., 1979. From Theme to Text via Rules of Embellishment: A Grammar of Expressiveness for Moroccan Jewish Sacred Legends. FOCUS Project, Technical Report No. 2, The University of Haifa, Haifa.","3. Noy, D. (ed.), 1966. Moroccan Jewish Folktales. N.Y. 166"]}]}