{"sections":[{"title":"","paragraphs":["RECOVERING IMPLICIT INFORMATION","Martha S. Palmer, I)eborah A. Dahl, Rebecca. J. Schiffman, Lynette Hirschlnan,","Marcia Linebarger, and John Dowding Research and Development Division SDC -- A Burroughs Company","P.O Box 517","Paoli, PA 19301 USA ABSTRACT This paper describes the SDC PUNDIT, (Prolog UNDerstands Integrated Text), system for processing natural language messages. 1 PUNDIT, written in Prolog, is a highly modular system consisting of distinct syntactic, semantic and pragmatics components. Each component draws on one or more sets of data, including a lexicon, a broad-coverage grammar of EngLish, semantic verb decompositions, rules mapping between syntactic and semantic constituents, and a domain model.","This paper discusses the communication between the syntactic, semantic and pragmatic modules that is necessary for making implicit linguistic information explicit. The key is letting syntax and semantics recognize missing linguistic entities as implicit entities, so that they can be labelled as such, and referenee resolution can be directed to find specific referents for the entities. In this way the task of making implicit linguistic information explicit becomes a subset of the tasks performed by reference resolution. The success of this approach is dependent on marking missing syntactic constituents as elided and missing semantic roles as ESSENTIAL so that reference resolution can know when to look for referents. 1. Introduction","This paper describes the SDC PUNDIT 2 system for processing natural language messages. PUNDIT, written in Prolog, is a highly modular system consisting of distinct syntactic, semantic and pragmatics components. Each component draws on one or more sets of data, including a lexicon, a broad-coverage grammar of English, semantic verb decompositions, rules mapping between syntactic and semantic constituents, and a donlain model. PUNDIT has been developed cooperatively with the NYU PROTEUS system (Prototype Text Understanding System), These systems are funded by DARPA as part of the","I This work is supported in part by DARPA under contract N00014-85-C-0012, administered by the Office of Naval Research. APPROVED FOR PUB-LIC RELEASE, DISTRIBUTION UNLIMITED. 2 Prolog UNDderstands Integrated Text work in natural language understanding for the Strategic Computing Battle Management Program. The PROTEUS/PUNDIT system will map Navy CASREP's (equipment casualty reports) into a database, which is accessed by an expert system to determine overall fleet readiness. PUNDIT has also been applied to the domain of computer maintenance reports, which is discussed here.","The paper focuses on the interaction between the syntactic, semantic and pragmatic modules that is required for the task of making implicit information explicit. We have isolated two types of implicit entities: syntactic entities which are missing syntactic constituents, and semantic entities which are unfilled semantic roles. Some missing entities are optional, and can be ignored. Syntax and semantics have to recognize the OBLIGATORY missing entities and then mark them so that reference resolution knows to find specific referents for those entities, thus making the implicit information explicit. Reference resolution uses two different methods for filling the different types of entities which are also used for general noun phrase reference problems. Implicit syntactic entities, ELIDED CONSTITUENTS, are treated like pronouns, and implicit semantic entities, ESSENTIAL ROLES are treated like definite noun phrases. The pragmatic module as currently implemented consists mainly of a reference resolution component, which is sptflcient for the pragmatic issues described in this paper. We are in the process of adding a time module to handle time issues that have arisen during the analysis of the Navy CASREPS. 2. The Syntactic Component","The syntactic component has three parts: the grammar, a parsing mechanism to execute the grammar, and a lexicon. The grammar consists of context-free BNF definitions (currently nulnbering approximately 80) and associated restrictions (approximately 35). The restrictions enforce context-sensitive welt-formedness constraints and, in some cases, apply optimization strategies to prevent unnecessary structure-building. Each of these three parts is described further below. 10 2.1. Grammar Coverage","The grammar covers declarative sentences, questions, and sentence fragments. The rules for frag-ments enable the grammar to parse the 'telegraphic\" style characteristic of message traffic, such as disk"]},{"title":"drive down,","paragraphs":["and has select lock. The present grammar parses sentence adjuncts, conjunction, relative clauses, complex complement structures, and a wide variety of nominal structures, including compound nouns, nominalized verbs and embedded clauses.","The syntax produces a detailed surface structure parse of each sentence (where '~entence\" is under-stood to mean the string of words occurring between two periods, whether a full sentence or a fragment). This surface structure is converted into an 'qntermediate representation\" which regularizes the syntactic parse. That is, it eliminates surface structure detail not required for the semantic tasks of enforc-ing selectional restrictions and developing the final representation of the information content of the sentence. An important part of regularization involves mapping fragment structures onto canonical verb-subject-object patterns, with missing elements flagged. For example, the tvo fragment consists of a tensed verb + object as in"]},{"title":"Replaced spindle","paragraphs":["motor. Regularization of this fragment, for example, maps the tvo sYntactic structure into a verb+ subject+ object structure:","verb(replace),subject(X),object(Y) As shown here, verb becomes instantiated with the surface verb, e.g., replace while the arguments of the subject and object terms are variables. The semantic information derived from the noun phrase object"]},{"title":"spindle motor","paragraphs":["becomes associated with Y. The absence of a surface subject constituent results in a lack of semantic information pertaining to X. This lack causes the semantic and pragmatic components to provide a semantic filler for the missing subject using general pragmatic principles and specific domain knowledge. 2.2. Parsing","The grammar uses the Restriction Grammar parsing framework [Hirschman1982, Hirschman1985], which is a logic grammar with facilities for writing and maintaining large grammars. Restrict:on Grammar is a descendent of Sager's string grammar [Sager1981]. It uses a top-down left-to-right parsing strategy, augmented by dynamic rule pru, ing for efficient parsing [Dowding1986]. In addition, it Llses a meta:grammatical approach to generate definitions for a full range of co-ordlnate conjunction structures [Hirschman1986]. 2.3. Lexical Processing","The lexicon contains several ~housand entries related to the particular subdomain of equipment maintenance. It is a modified version of the LSP lexicon with words classified as to part of speech and subcategorized in limited ways (e.g., verbs are subcategorized for their complement types). It also handles multi-word idioms, dates, times and part numbers. The lexicon can be expanded by means of an interactive lexical entry program.","The lexical processor reduces morphological variants to a single root form which is stored with each entry. For example, the form has is transformed to the root form have in Has select lack. In addition, this facility is useful in handling abbreviations: the term awp is regularized to the multi-word expression"]},{"title":"waiting ~for p̂art.","paragraphs":["This expression in turn is regularized to the root form wait'for'part which takes as a direct object a particular part or part number, as in is awp 2155-6147.","Multi-word expressions, which are typical of jargon in specialized domains, are handled as single lexicol items. This includes expressions such as disk"]},{"title":"drive or select","paragraphs":["lock, whose meaning within a particular domain is often not readily computed from its component parts. Handling such frozen expressions as '~dioms\" reduces parse times and number of ambiguities.","Another feature of the lexical processing is the ease with which special forms (such as part numbers or dates) can be handled. A special '$orms grammar\", written as a definite clause grammar[Pereira1980] can parse part numbers, as in"]},{"title":"awaiting part","paragraphs":["2155-6147, or complex date and time expressions, as in disk"]},{"title":"drive up at","paragraphs":["11/17-1286. During parsing, the forms grammar performs a well-formedness check on these expressions and assigns them their appropriate lexical category. 3. Semantics","There are two separate components that per-form semantic analysis, NOUN PHRASE SEMANTICS and CLAUSE SEMANTICS. They are each called after parsing the relevant syntactic structure to test semantic well-formedness while producing partial semantic representations. Clause semantics is based on Inference Driven Semantic Analysis [P~tlmer1985] which decomposes verbs into component meanings and fills their semantic roles with syntactic constituents. A KNOWLEDGE BASE, the formalization of each domain into logical terms, SEMANTIC PREDI-CATES, is essential for the effective application of Inference Driven Semantic Analysis, and for the final production of a text representation. The result of the semantic analysis is a set of PARTIALLY instantiated ll Semantic predicates which is similar to a frame representation. To produce this representation, the semantic components share access to a knowledge base, the DOMAIN MODEL, that contains generic descriptions of the domain elements corresponding to the ]exical entries. The model includes a detailed representation of the types of assemblies that these elements can occur in. The semantic components are designed to work independently of the particular model, and rely on an interface to ensure a welldefined interaction with the domain model. The domain model, noun phrase semantics and clause semantics are all explained in more detail in the following three subsections."]},{"title":"3.1. Domain Model","paragraphs":["The domain currently being modelled by SDC is the Maintenance Report domain. The texts being analyzed are actual maintenance reports as they are called into the Burroughs Telephone Tracking System by the field engineers and typed in by the telephone operator. These reports give information about the customer who has the problem, specific symptoms of the problem, any actions take by the field engineer to try and correct the problem, and success or failure of such actions. The goal of the text analysis is to automatically generate a data base of maintenance information that can be used to correlate customers to problems, problem types to machines, and so on.","The first step in building a domain model for maintenance reports is to build a semantic net-like representation of the type of machine involved. The machine in the example text given below is the B4700. The possible parts of a B4700 and the associated properties of these parts can be represented by an"]},{"title":"isa","paragraphs":["hierarchy and a"]},{"title":"haspart","paragraphs":["hierarchy. These hierarchies are built using four basic predicates:"]},{"title":"system,lsa,hasprop, haspart.","paragraphs":["For example the system itself is indicated by"]},{"title":"system(b4700).","paragraphs":["The"]},{"title":"isa","paragraphs":["predicate associates TYPES with components, such as isa(splndlem̂otor~motor). Properties are associated with components using the"]},{"title":"hasprop","paragraphs":["relationship, are are inherited by anything of the same type. The main components of the system:"]},{"title":"cpu, power_supply, disk, printer, peripherals,","paragraphs":["etc., are indicated by haspart relations, such as"]},{"title":"haspart(b4700,cpu), haspart(b4700,power_supply), haspart(b4700,dlsk),,etc.","paragraphs":["These parts are them-selves divided into subparts which are also indicated by haspart relations, such as"]},{"title":"haspart(power_supply, converter).","paragraphs":["This method of representation results in a general description of a computer system. Specific machines represent INSTANCES of this general representation. When a particular report is being processed, id relations are created by noun phrase semantics to associate the specific computer parts being mentioned with the part descriptions from the general machine representation. So a particular B4700 would be indicated by predicates such as these:"]},{"title":"id(b4700,systeml), id(cpu,cpul), id(power_supply,power supply1),","paragraphs":["etc."]},{"title":"3.2. Noun phrase semantics","paragraphs":["Noun phrase semantics is called by the parser during the parse of a sentence, after each noun phrase has been parsed. It relies hea~iiy on th-domain model for both determining semantic well formedness and building partial semantic representations of the noun phrases. For example, in the ,~cntence,"]},{"title":"field engineer replaced disk drive at 11/2/0800,","paragraphs":["the phrase"]},{"title":"disk drive at 11/2/0800","paragraphs":["is a syntactically acceptable noun phrase, (as in participants at the meeting). However, it is not semantically acceptable in that at"]},{"title":"11/20/800","paragraphs":["is intended to designate the time of the replacement, not a property of the disk drive. Noun phrase semantics will inform the parser that the noun phrase is not semantically acceptable, and the parser can then look for another parse, In order for this capability to be fully utilized, however, an extensive set of domaln-speclfic rules about semantic acceptability is required. At present we have only the minimal set used for the development: of the basic mechanism. For example, in the case described here,"]},{"title":"at 11/2/0800","paragraphs":["is excluded as a modifier for"]},{"title":"disk drive","paragraphs":["by a rule that permits only the name of a loca-tion as the object of at in a prepositional phrase modifying a noun phrase.","Tile second function of noun phrase semantics is to create a semantic representation of the noun phrase, which will later be operated on by reference resolution. For example, the semantics for lhe bad"]},{"title":"disk drive","paragraphs":["would be represented by the following Prolog clauses. lid(disk ̂drive,X),"]},{"title":"bad(X),","paragraphs":["del'(X), that is, X was referred to with a full, definite noun phrase, full_np (X)] rather than a pronoun or indefinite noun phrase. 12"]},{"title":"8.3. Clause semantics","paragraphs":["In order to produce the correct predicates and the correct instantiations, the verb is first decomposed into a semantic predicate representation appropriate for the domain. The arguments to the predicates constitute the SEMANTIC ROLES of the verb, which are similar to cases. There are domain specific criteria for selecting a range of semantic roles. In this domain the semantic roles include:"]},{"title":"agent,lnstrument,theme, objectl,object2, symptom and mod.","paragraphs":["Semantic roles can be filled either by a syntactic constituent supplied by a mapping rule or by reference resolution, requiring close cooperation between semantics and reference resolution. Certain semantic roles are categorized as ESSENTIAL, so that pragmatics knows that they need to be filled if there is no syntactic constituent available. The default categorization is NON-ESSENTIAL, which does not require that the role be filled. Other semantic roles are categorized as NON-SPECIFIC or SPECIFIC depending on whether or not the verb requires a specific referent for that semantic role (see Section 4). The example given in Section 5 illustrates the use of both a non-specific semantic role and an essential semantic role. This section explains the decompositions of the verbs relevant to the example, and identifies the important semantic roles.","The decomposition of have is very domain specific.","have(time(Per)) <-","symptom(object 1(O 1),symptom(S),time(Per)) It indicates that a particular symptom is associated with a particular object, as in 'the disk drive has select lock.\" The object1 semantic role would be filled by the disk drive, the subject of the clause, and the"]},{"title":"symptom","paragraphs":["semantic role would be filled by select lock, the object of the clause. The"]},{"title":"tlme(Per)","paragraphs":["is always passed around, and is occasionally filled by a time adjunct, as in the disk drive had select lock at 0800.","In addition to the mapping rules that are used to associate syntactic constituents with semantic roles, there are selection restrictions associated with each semantic role. The selection restrictions for have test whether or not the filler of the"]},{"title":"objectl","paragraphs":["role is allowed to have the type of symptom that fills the symptom role. For example, only disk drives have select locks."]},{"title":"Mapping Rules","paragraphs":["The decomposition of replace, is also a very domain specific decomposition that indicates that an"]},{"title":"agent","paragraphs":["can use an"]},{"title":"instrument","paragraphs":["to exchange two"]},{"title":"objects.","paragraphs":["replace(tinm(Per)) <- cause(agent(A),","use(instrument(Z),","exchange(object 1(O 1),obj ect2(O2),time(Per)~","The following mapping rule specifies that the"]},{"title":"agent","paragraphs":["can be indicated by the subject of the clause. agent(A) <-subject(A) / X","The mapping rules make use of intuitions about syntactic cues for indicating semantic roles first embodied in the notion of case [Fillmore1968,Palmer1981]. Some of these cues are quite general, while other cues are very verb-specific. The mapping rules can take advantage of generalities like 'SUBJECT to AGENT\" syntactic cues while still preserving context sensitivities. This is accomplished by making the application of the mapping rules 'hituation-specific\" through the use of PREDICATE ENVIRONMENTS. The previous rule is quite general and can be applied to every"]},{"title":"agent","paragraphs":["semantic role in this domain. This is ~ndicated by the X on the right hand side of the \"/\" which refers to the predicate environment of the agent, i.e., anything. Other rules, such as %VITH-PP to OBJECT2,\" are much less general, and can only apply under a set of specific circumstances. The predicate environ-ments for an objectl and object2 are specified more explicitly. An objectl can be the object of the sentence if it is contained in the semantic decomposition of a verb that includes an"]},{"title":"agent","paragraphs":["and belongs to the repair class of verbs. An"]},{"title":"object2","paragraphs":["can be indicated by a with prepositional phrase if it is contained in the semantic decomposition of a replace verb: objectl(Partl) <- obj(eartl)/ cause(agent(A),Repa","object2(Part2) <- pp(with,Part2) / cause(agent(A),use(I,exchange(object 1 (O 1),obj e¢"]},{"title":"Selection Restrietlons","paragraphs":["The selection restriction on an agent is that it must be a field engineer, and an"]},{"title":"instrument","paragraphs":["must be a tool. The selection restrictions on the two objects are more complicated, since they must be machine parts, have the same type, and yet also be distinct objects. In addition, the first object must already be associated with something else in a"]},{"title":"haspart","paragraphs":["relationship, in other words it must already be included in an existing assembly. :The opposite must be true of the second object: it must not already be included in an assembly, so it must not be associated with anything else in a haspart relationship. 13","There is also a pragmatic restriction associated with both objects that has not been associated with any of the semantic roles mentioned previously. Both object1 and object2 are essential semantic roles. Whether or not they are mentioned explicitly in the sentence, they must be filled, preferably b:¢ an an entity that has already been mentioned, but if not that, then entities will be created to fill them [Palmer1983]. This is accomplished by making an explicit cull to reference resolution to find referents for essential semantic roles, in the same way that reference resolution is called to find the referent of a noun phrase. This is not done for non-essential roles, such as the agent and the instrument in the same verb decomposition. If they are not mentioned they are simply left unfilled. The instrument is rarely mentioned, and the agent could easily be left out, as in The disk drive was replaced at 0800. 3 In other domains, the agent might be classified as obligatory, and then it wold have to be filled in.","There is another semantic role that has an important pragmatic restriction on it in this example, the object2 semantic role in wait'for Apart (awp).","idiomVerb(wait ̂for ̂part,time(Per)) <-","ordered(object 1(O 1),obj ect2(O2),time(Per)) The semantics of wait \"for \"part indicates that a particular type of part has been ordered, and is expected to arrive. But it is not a specific entity that might have already been mentioned. It is a more abstract object, which is indicated by restrict-ing it to being non-specific. This tells reference resolution that although a syntactic constituent, preferably the object, can and should fill this semantic role, and must be of type machine-part, that reference resolution should not try to find a specific referent for it (see Section 4).","The last verb representation that is needed for the example is the representation of be.","be(time(Per)) <- attribute(theme(T),mod(M),time(Per)) In this domain be is used to associate predicate adjectives or nominals with an object, as in disk drive is up or spindle motor is bad. The representation merely indicates that a modifier is associated with an theme in an attribute relationship. Noun phrase semantics will eventually produce the same representation for the bad spindle motor, although it does not yet.","3Note that an elided subject is handled quite differently, as in replaced tliBk tlri=e. Then the missing subject is assumed to fill the agent role, and an appropriate referent is found by reference resolution 4. Reference Resolution","Reference resolution is the component which keeps track of references to entities in the discourse. It creates labels for entities when they are first directly referred to, or when their existence is implied by the text, and recognizes subsequent references to them. Reference resolution is called from clause semantics when clause semantics is ready to instantiate a semantic role. It is also called from pragmatic restrictions when they specify a referent whose existence is entailed by the meaning of a verb.","The system currently covers many cases of singular and plural noun phrases, pronouns, one-anaphora, nominalizations, and non-specific noun phrases; reference resolution also handles adjectives, prepositional phrases and possessive pronouns modifying noun phrases. Noun phrases with and without determiners are accepted. Dates, part numbers, and proper names are handled as special cases. Not yet handled are compound nouns, quantified noun phrases, conjoined noun phrases, relative clauses, and possessive nouns. The general reference resolution mechanism is described in detail in [Dahl1986]. In this paper the focus will be on the interaction between reference resolution and clause semantics. The next two sections will discuss how reference resolution is affected by the different types of semantic roles. 4.1. Obligatory Constituents and Essential Semantic Roles","A slot for a syntactically obligatory constituent such as the subject appears in the intermediate representation whether or not a subject is overtly present in the sentence. It is possible to have such a slot because the absence of a subject is a syntactic fact, and is recognized by the parser. Clause semantics calls reference resolution for such an implicit constituent in the same way that it calls reference resolution for explicit cqnstituents. Reference resolution treats elided noun phrases exactly as it treats pronouns, that is by instantiating them to the first member of a list of potential pronominal referents, the FocusList. The general treatment of pronouns resembles that of[Sidnerl979], although there are some important differences, which are discussed in detail in [Dahl1986]. The hypothesis that elided noun phrases can be treated in much the same way as pronouns is consistent with previous claims by [Gunde11980], and [Kameyama1985], that in languages which regularly allow zero-np's, the zero corresponds to the focus. If these claims are correct, it is not surprising that in a sublanguage that allows zero-np's, the zero should also correspond to the fOCUS. 14","After control returns to clause semantics from reference resolution, semantics checks the selectional restrictions for that referent in that semantic role of that verb. If the selectional restrictions fail, backtracking into reference resolution occurs, and the next candidate on the FocusList is instantiated as the referent. This procedure continues until a referent satisfying the selectional restrictions is found. For example, in Disk drive is down. Has"]},{"title":"select","paragraphs":["lock, the system instantiates the disk drive, which at this point is the first member of the"]},{"title":"FocusList,","paragraphs":["as the"]},{"title":"objectl of have: [event39] have(time(tlmel)) symptom(objectl([drivel0]),","paragraphs":["symptom([locklT]),"]},{"title":"time(tlmel))","paragraphs":["Essential roles might also not be expressed in the sentence, but their absence cannot be recognized by the parser, since they can be expressed by syntactically optional constituents. For example, in"]},{"title":"the field engineer replaced the motor.,","paragraphs":["the new replacement motor is not mentioned, although in this domain it is classified as semantically essential. With verbs like replace, the type of the replacement,"]},{"title":"motor,","paragraphs":["in this case, is known because it has to be the same type as the replaced object. Reference resolution for these roles is called by pragmatic rules which apply when there is no overt syntactic constituent to fill a semantic role. Reference resolution treats these referents as if they were full noun phrases without determiners. That is, it searches through the context for a previously mentioned entity of the appropriate type, and if it doesn't find one, it creates a new discourse entity. The motivation for treating these as full noun phrases is simply that there is no reason to expect them to be in focus, as there is for elided noun phrases."]},{"title":"4.2. Noun Phrases in Non-Speclfie Con- texts","paragraphs":["Indefinite noun phrases in contexts like the field"]},{"title":"engineer ordered","paragraphs":["a disk drive are generally associated with two readings. In the specific reading the disk drive ordered is a particular disk drive, say, the one sitting on a certain shelf in the warehouse. In the non-specific reading, which is more likely in this sentence, no particular disk drive is meant; any disk drive of the appropriate type will do. Handling noun phrases in these contexts requires careful integration of the interaction between semantics and reference resolution, because semantics knows about the verbs that create non-specific contexts, and reference resolution knows what to do with noun phrases in these contexts. For these verbs a constraint is associated with the semantics rule for the semantic role"]},{"title":"object2","paragraphs":["which states that the filler for the"]},{"title":"object2","paragraphs":["must be non-specific. 4 This constraint is passed to reference resolution, which represents a non-specific noun phrase as having a variable in the place of the pointer, for example,"]},{"title":"id(motor~X).","paragraphs":["Non-specific semantic roles can be illustrated using the"]},{"title":"object2","paragraphs":["semantic role in wait~forp̂art (awp). The part that is being awaited is non-specific, i.e., can be any part of the appropriate type. This tells reference resolution not to find a specific referent, so the referent argument of the id relationship is left as an uninstantiated variable. The analysis of fe is"]},{"title":"awp spindle motor","paragraphs":["would fill the"]},{"title":"objectl","paragraphs":["semantic role with tel from id(fe,fel), and the"]},{"title":"object2","paragraphs":["semantic role with X from"]},{"title":"id(spindle ~ motor,X),","paragraphs":["as in"]},{"title":"ordered(objectl(fel),object2(X)).","paragraphs":["If the spindle motor is referred to later on in a relationship where it must become specific, then reference resolution can instantiate the variable with an appropriate referent such as"]},{"title":"spindlem̂otor3","paragraphs":["(See Section 5.6)."]},{"title":"5. Sample Text: A sentence-by-sentence analysis","paragraphs":["The sample text given below is a slightly","emended version of a maintenance report. The","parenthetical phrases have been inserted. The fol-","lowing summary of an interactive session with PUN-","DIT illustrates the mechanisms by which the syntac-","tic, semantic and pragmatic components interact to","produce a representation of the text. 1. disk drive (was) down (at) 11/16-2305. 2. (has) select lock. 3. spindle motor is bad. 4. (is) awp spindle motor. 5. (disk drive was) up (at) 11/17-1236. 6. replaced spindle motor."]},{"title":"5.1. Sentence 1: Disk drive was down at 11/16-230G.","paragraphs":["As explained in Section 3.2 above, the noun phrase disk drive leads to the creation of an"]},{"title":"id","paragraphs":["a]\""]},{"title":"the form: id(dlsk~drlve,[drlvel])","paragraphs":["Because'dates and names generally refer to unique entities rather than to exemplars of a general type, their"]},{"title":"ids","paragraphs":["do not contain a type argument:"]},{"title":"date([ll/16- 1100]),name([paon]).","paragraphs":["4 The specific reading is not available at present, since it is considered to be unlikely to occur in this domain. 15","The interpretation of the first sentence of the report depends on the semantic rules for the predicate be. The rules for this predicate specify three semantic roles, an theme to whom or which is attributed a modifier, and the"]},{"title":"time.","paragraphs":["After a mapping rule in the semantic component of the system instantiates the"]},{"title":"theme","paragraphs":["semantic role with the sentence subject, disk drive, the reference resolution component attempts to identify this referent. Because disk drive is in the first sentence of the discourse, no prior references to this entity can be found. Further, this entity is not presupposed by any prior linguist, ic expressions. However, in the maintenance domain, when a disk drive is referred to it can be assumed to be part of a B3700 computer system. As the system tries to resolve the reference of the noun phrase disk drive by looking for previously mentioned disk drives, it finds that the mention of a disk drive presupposes the existence of a system. Since no system has been referred to, a pointer to a system is created at the same time that a pointer to the disk drive is created.","Both entities are now available for future reference. In like fashion, the propositional content of a complete sentence is also made available for future reference. The entities corresponding to propositions are given event labels; thus eventl is the pointer to the first proposition. The newly created disk drive, system and event entities now appear in the discourse information in the form of a llst along with the date."]},{"title":"id(event,[eventl]) id(dlsk","paragraphs":["̂drive, [drivel])"]},{"title":"date([11/le-2305]) id(system, [system1])","paragraphs":["Note however, that only those entities which have been explicitly mentioned appear in the"]},{"title":"FocusList: FocusList: [[event1], [drlvel], [11/16-2305]]","paragraphs":["The propositional entity appears at the head of the focus list followed by the entities mentioned in full noun phrases.fi","In addition to the representation of the new event, the pragmatic information about the developing discourse now includes information about pa'rtwhole relationships, namely that drivel is a part which is contained in"]},{"title":"systeml. Part-Whole Relationships: haspart([systeml],[drivel])","paragraphs":["The complete representation of"]},{"title":"eventl,","paragraphs":["appearing in the event list in the form shown below, indicates that at the time given in the prepositional phrase at 11/16-2505 there is a state of affairs denoted as"]},{"title":"eventl","paragraphs":["in which a particular disk drive, i.e.,"]},{"title":"drivel,","paragraphs":["can be described as down.","[eventl] be(time([ll/1B-2305]))"]},{"title":"attrlbute(theme([drivel]","paragraphs":["}, mod(down),time([ll/16-230G]))"]},{"title":"5.2. Sentence 2: Has select lock.","paragraphs":["The second sentence of the input text is a sentence fragment and is recognized as such by the parser. Currently, the only type of fragment which can be parsed can have a missing subject but must have a complete verb phrase. Before semantic analysis, the output of the parse contains, among other things, the following constituent list: [subj([X]),obj([Y])]. That is, the syntactic component represents the arguments of the verb as variables. The fact that there was no overt subject can be recognized by the absence of semantic information associated with X, as discussed in Section 3.2. The semantics for the maintenance domain sublanguage specilCles that the thematic role instantiated by the direct object of the verb to have must be a symptom of the entity referred to by the subject. Reference resolution treats an empty subject much like a pronominal reference, that is, it proposes the first element in the FoeusList as a possible referent. The first proposed referent, eventl is rejected by the semantic selectional constraints associated with the verb have, which, for this domain, require the role mapped onto the subject to be classified as a machine part and the role mapped onto the direct object to be classified as a symptom. Sincethe next item in the"]},{"title":"FocusList, drivel,","paragraphs":["is a machine part, it passes the selectional constraint and becomes matched with the empty subject of has select lock. Since no select lock has been mentioned previously, the system creates one. For the sentence as a whole then, two entities are newly created: the select lock ([loekl]) and the new propositional event"]},{"title":"([event2]): id(event, [event2]),","paragraphs":["id(selectl̂ock,[loekl]). The following representation is added to the event list, and the"]},{"title":"FoeusList","paragraphs":["and"]},{"title":"Ids","paragraphs":["are updated appropriately. 6"]},{"title":"[event2] have(tlme(tlmel)) symptom(objectl([drivel]), symptom(","paragraphs":["[lock 1]),time (tlmel))","s The order in which full noun phrase mentions are added to I, ne FocusList depends on their syntactic function and linear order, For full noun phrases, direct object mentions precede subject mentions followed by all other mentions given in the order in which they occur in the sentence. See [Dahl1986], for details.","6 This version only deals with explicit mentions of time, so for this sentence tile time argument is filled in with a gensym that standg for an unknown time period, The current version of FUNDlT uses verb tense and verb semantics to derive implicit time arguments. 16"]},{"title":"5.3. Sentence 3: Motor is bad.","paragraphs":["In the third sentence of the sample text, a new entity is mentioned, motor. Like disk drive from sentence 1, motor is a dependent entity. However, the entity it presupposes is not a computer system, but rather, a disk drive. The newly mentioned motor becomes associated with the previously mentioned disk drive. After processing this sentence, the new entity"]},{"title":"motor3","paragraphs":["is added to the FocusList along with the new proposition"]},{"title":"event3.","paragraphs":["Now the discourse information about part-whole relationships contains information about both dependent entities, namely that"]},{"title":"motorl","paragraphs":["is a part of"]},{"title":"drivel","paragraphs":["and that drivel is a part of"]},{"title":"systeml. haspart([drivel], [motor 1]) haspart([systeml], [drivel]) 5.4. Sentence 4: is awp spindle motor.","paragraphs":["Awp is an abbreviation for an idiom specific to this domain, awaiting part. It has two semantic roles, one of which maps to the sentence subject. The second maps to the direct object, which in this case is the non-specific spindle motor as explained in Section 4.2. The selectlonal restriction that the first semantic role of awp be an engineer causes the reference resolution component to create a new engineer entity because no engineer has been mentioned previously. After processing this sentence, the list of available entities has been incremented by three:"]},{"title":"id(event, [event4])","paragraphs":["id(part,[ 2317])"]},{"title":"id(field ̂engineer, [englneer 1])","paragraphs":["The new event is represented as follows:"]},{"title":"[event4] idiomVerb(wait ̂for ̂par t,time(time2)) wait(objectl([engineerl]), object 2 ([_2317]),time(tlme2)) 5.5. Sentence 5: disk drive was up at","paragraphs":["11/17-0800 In the emended version of sentence 5 the disk drive is presumed to be the same drive referred to previously, that is, drivel. The semantic analysis of sentence 5 is very similar to that of sentence 1. As shown in the following event representation, the predicate expressed by the modifier up is attributed to the theme"]},{"title":"drivel","paragraphs":["at the specified time."]},{"title":"[eventS] be(tlme([11/17-12361) ) attribute(theme([drivel]), mod(up),tlme( [11/17-123@] )) 5.6. Sentence @: Replaced motor.","paragraphs":["The sixth sentence is another fragment consisting of a verb phrase with no subject. As before, reference resolution tries to find a referent in the current"]},{"title":"FocusList","paragraphs":["which is a semantically acceptable subject given the thematic structure of the verb and the domain-specific selectional restrictions associated with them. The thematic structure of the verb replace includes an agent role to be mapped onto the sentence subject. The only"]},{"title":"agent","paragraphs":["in the maintenance domain is a field engineer. Reference resolution finds the previously mentioned engineer created for awp spindle motor,"]},{"title":"[englneerl].","paragraphs":["It does not find an instrument, and since this is not an essential role, this is not a problem. It simply fills it in with another gensym that stands for an unknown filler,"]},{"title":"unknownl.","paragraphs":["When looking for the referent of a spindle motor to fill the objectl role, it first finds the non-specific spindle motor also mentioned in the awp spindle motor sentence, and a specific referent is found for it. However, this fails the selection restrictions, since although it is a machine part, it is not already associated with an assembly, so backtracking occurs and the referent instantiation is undone. The next spindle motor on the FocusList is the one from spindle"]},{"title":"motor is bad, ([motorl]).","paragraphs":["This does pass the selection restrictions since it participates in a"]},{"title":"haspart","paragraphs":["relationship. The last semantic role to be filled is the"]},{"title":"object2","paragraphs":["role. Now there is a restriction saying this role must be filled by a machine part of the same type as objectl, which is not already included in an assembly, viz., the non-specific spindle motor. Reference resolution finds a new referent for it, which automatically instantiates the variable in the"]},{"title":"id","paragraphs":["term as well. The representation can be decomposed further into the two semantic predicates"]},{"title":"missing","paragraphs":["and"]},{"title":"included,","paragraphs":["which indicate the current status of the parts with respect to any existing assemblies. The"]},{"title":"haspart","paragraphs":["relationships are updated, with the old"]},{"title":"haspart","paragraphs":["relationship for"]},{"title":"[motorl]","paragraphs":["being removed, and a new"]},{"title":"haspart","paragraphs":["relationship for"]},{"title":"[motor3]","paragraphs":["being added. The final representation of the text will be passed through a filter so that it can be suitably modified for inclusion in a database. 17"]},{"title":"[event6] replace(tlme(tlme3)) cause(agent([englneerl]), use(instrument(unknownl), exchange(ohjectl([motorl]), objeet2([motor2]), tlme(tlme3)))) included(object 2([motor2]),tlme(tlme3 missing(ohj eetl([motor 1]),time(tlme3) Part-Whole Relationships: haspar t([drlvel], [motora]) haspart([systeml],","paragraphs":["[drlvel])"]},{"title":"6. Conclusion","paragraphs":["This paper has discussed the communication between syntactic, semantic and pragmatic modules that is necessary for making implicit linguistic information explicit. The key is letting syntax and semantics recognize missing linguistic entities as implicit entities, so that they can be marked as such, and reference resolution can be directed to find specific referents for the entities. Implicit entities may be either empty syntactic constituents in sentence frag-ments or unfilled semantic roles associated with domain-specific verb decompo~'Jitions, in this way the task of making implicit information explicit becomes a subset of the tasks performed by reference resolution. The success of this approach is dependent on the use of syntactic .and semantic categorizations such as ELLIDED and ESSENTIAL which are meaning-ful to reference resolution, and which can guide reference resolution's decision making process. ACKNOWLED GEMENTS We would like to thank Bonnie Webb,er for her very helpful suggestions on exemplifying semantics/pragmatics cooperation."]},{"title":"REFERENCES","paragraphs":["[Dahl1986] Deborah A. Dahl, Focusing and Reference Resolution in PUNDIT, submitted for publication, 1986.","[Dowdlng1986] John Dowding and Lynette Hirschman, Dynamic Translation for Rule Pruning in Restriction Grammar, submitted to AAAI-86, Philadelphia, 1986.","[Fillmore1968] C. J. Fillmore, The Case for Case. In"]},{"title":"Universals in Linguistic Theory,","paragraphs":["E. Bach and R. T. Harms (ed.), Holt, Rinehart, and Winston, New York, 1968.","[Gundel1980] Jeanette K. Gundel, Zero-NP Anaphora in Russian."]},{"title":"Chicago Linguistic Society Parasession on Pronouns and Anaphora,","paragraphs":["1980.","[Hirschman1982] L. Hirschman and K. Puder, Restriction Grammar in Prolog. In"]},{"title":"Proc. of the First International Logic Programming Confer- ence,","paragraphs":["M. Van Caneghem (ed.), Association pour la Diffusion et le Developpement de Prolog, Marseilles, 1982, pp. 85-90.","[Hirschman1985] L. Hirschman and K. Puder, Restriction Grammar: A Prolog Implementation. In"]},{"title":"Log- ic Programming and its Applications,","paragraphs":["D.H.D. Warren and M. VanCaneghem (ed.), 1985.","[Hirschman1986] L. Hirschman, Conjunction in Meta-Restriction Grammar."]},{"title":"J. of Logic Program- ruing,","paragraphs":["1986.","[Kameyama1985] Megumi Kameyama, Zero Anaphora: The Case of Japanese, Ph.D. thesis, Stanford University, 1985.","[Pahner1983] M. Palmer, Inference Driven Semantic Analysis. In"]},{"title":"Proceedings of the National Conference on Artificial Intelligence (AAAI-88),","paragraphs":["Washington, D.C., 1983.","[Palmer1981] Martha S. Palmer, A Case for Rule Driven Semantic Processing."]},{"title":"Proc. of the 19th ACL Conference,","paragraphs":["June, 1981. 18","[Palmer1985] Martha S. Palmer, Driving Semantics for a Limited Domain, Ph.D. thesis, University of Edinburgh, 1985.","[Pereira1980] F. C. N. Pereira and D. H. D. Warren, Definite Clause Grammars for Language Analysis -- A Survey of the Formalism and a Comparison with Augmented Transition Networks."]},{"title":"Artificial Intelligence,13,","paragraphs":["1980, pp. 231-278.","[Sager1981] N. Sager,"]},{"title":"Natural Language Information Processing: A Computer Grammar o] En- glish and Its Applications.","paragraphs":["Addison-Wesley, Reading, Mass., 1981.","[Sidner1979] Candace Lee Sidner, Towards a Computational Theory of Definite Anaphora Comprehension in English Discourse, MIT-AI TR-537, Cambridge, M_A, 1979. 19"]}]}
