{"sections":[{"title":"","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 184-194"]},{"title":"On Plural Anaphora Kiyoshi ISHIKAWA Hosei University ishikawagcogsci.L.chiba-u.ac.jp","paragraphs":["Abstract","In order to formulate truth-conditionally - satisfactor* semantics in a compositional. manner, - model-iiieoretic semanticists sometimes posit morphology-semantics mismatches. Among them are Kamp and Reyle (1993), who occasionally ignore English plural morphology in constructing their analysis of anaphora.","Our goal in this paper is to demonstrate that natural language morphology is a better guide for a compositional semantics than Kamp and Ryle assume. By refining the semantics of plurality put forth in Ishikawa (1995a), we construct an analysis of plural anaphora in a way that respects English plural morphology. Our results suggest that natural language morphology is not as redundant as usually assumed."]},{"title":"1 Introduction","paragraphs":["One of the research goals of modeltheoretic semantics is to derive the truth condition of (an utterance of) an arbitrary (declarative) sentence compositionally. Surface grammar (morphology and syntax) is sometimes felt not to get along well with compositional semantics, in which case the fine details of surface grammar are often ignored. For example, Kamp and Reyle (1993) treat plural anaphora by ignoring plural morphology of English nouns and verbs. Their treatment has the implication that English plural morphology has no semantic contribution to make and hence redundant (or even an obstacle for a compositional semantics).","We have two purposes in this paper. The first is to revise Ishikawa's (1995a) semantics of plurality by modifying its lattice-theoretic structure of situation theoretic structured objects.' The second is to offer an alternative to Kamp and Reyle's treatment that respects English number morphology, by combining the revised version of Ishikawa's semantics of plurality with what we call the Resolution Principle. By doing the latter, we attempt to suggest that natural language surface grammar is, in fact, a better guide to compositional semantics than Kamp and Reyle assume.2 3"]},{"title":"2 An Extended Lattice-theoretic Theory of Plurality","paragraphs":["2.1 The Basics Following Link (1983), we assume lattice-theoretic ontology of individuals. Assuming Situation Semantics, we extend lattice-theoretic structure to situations and propositions in a way to be explained below. Just as one would analyze (la) as something like (1b) under the thesis of direct reference of names (Kaplan 1989), we analyze (la) as something like (1c), and (2a) as (2b).4 (1) a. John and Mary b. j"]},{"title":"e","paragraphs":["m 1 See also Bach (1986) and Krifka (1989). 2 For arguments that number agreement in English is not semantically redundant, see Hoeksema (1983),","ReaReid (1991), Pollard and Sag (1994), Ishikawa (1995b).","this paper we exclude generalized quantifiers from our consideration. An attempt to analyze plural","generalized quantifiers in a similar spirit can be found in Ishikawa 11997), with which I'm not completely","satisfied. 4For the assumption that even proper names exploit resource situation, see Ishikawa (1995c, 1996, To","appear). See also Bach (1987)."]},{"title":"184","paragraphs":["Language; Information and Computation (PACLIC12), 18-20 Feb, 1998, 184-194","c. Xp where p=(r =<< member, x, X >> A < member, y, X >> A","<< John, x >> A << Mary, y >>) (2) a. two dialects","b. Yq where q=(r'\\tdialect, Y >> & << two, Y >>) Following Ishikawa (1995a), we regard r, the resource situation for (la), as X's person situation. Thus, X's cardinality is two when taken as persons (i.e. within this person situation), but it may be one when taken as, say, a team or a couple (i.e. within its team or couple situation). Similarly, r', the resource situation for (2a), is Y's dialect situation; Y's cardinality is two when Y is taken as dialects (not as, say, languages or language families). The fact that expressions like (2a) can exhibit scopal interaction is captured by optionally allowing them to be existentially quantified away. For example, (3) a. Every student speaks two dialects. b. V(Ti , 7'2) where T1 = ["]},{"title":"y","paragraphs":["I s < student, y> & s < one, y >"]},{"title":"I","paragraphs":["T2"]},{"title":"= [ y I","paragraphs":["3Xs'"]},{"title":"k<","paragraphs":["speak, y, X >1 X is (2b). If j and m are students, then both of them are of type 71. In addition, if j speaks General American and RP, then j is of type T2, and if m speaks New York English and Cockney, then m is also of type T2. 2.2 Arity-sensitive Lattice-Theoretic Structure We extend this lattice-theoretic structure to situations and propositions. 5 We say that s\\t<12, x 1,- • • ,xi, • • • ,xn>> is a sum proposition ifs","Bi [s\\tp, . . . ,\\t. >> A ay, z[(y z) A s\\tmember, y, xi >> As\\tmember, z, xi >>] . There are two kinds of sum proposition. First, suppose that Ken likes Naomi and John likes her too: (4) a. s\\tlike, Ken, Naomi >> b. t\\tlike, John, Naomi >> Then we have: (5) a. s e t\\tlike, Ken ® John, Naomi > 5While the lattice-theoretic structures of individuals are relativezed to situations, those of situations and propositions are not. This is conceptually natural, since, while individuals appear in situations, situations and propositions do not. 60r","[s\\tp,\\t, xi, ... >> As\\tq,\\t>> where q is two, three, etc. 185 Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 184494 b. s"]},{"title":"e","paragraphs":["t\\tmember, Ken, Ken (I) John >> c. s e t\\tmember, John, Ken"]},{"title":"e","paragraphs":["John >> (5a) is the sum of (4a—b).","On the other hand, assume that Ken shares something y with Naomi, in which case Naomi shares the same thing y with Ken. (6) a."]},{"title":"s k<","paragraphs":["share, Ken, y, Naomi >> b. t\\tshare, Naomi, y, Ken >> Here we have (7a), Ken and Naomi share y, and (7b—c). (7) a. s t\\tshare, Ken"]},{"title":"e","paragraphs":["Naomi, y >> b. s"]},{"title":"e t\\t","paragraphs":["member, Ken, Ken"]},{"title":"e","paragraphs":["Naomi >> c. s t\\tmember, Naomi, Ken"]},{"title":"e","paragraphs":["Naomi >> Generally, for any s, t, x, y and z, if we have: (8) a. s\\tshare, x, y, z >> b. t\\tshare, z, y, x then we have: (9) s €9 t\\tshare, x"]},{"title":"e z,","paragraphs":["y > Again, (9) is the sum of (8a—b).","Thus like and share exhibit quite different types of behavior; we call the predicates that pattern with like the arity-constant relations and those that pattern with share the arity-changing relations. ? .","When a proposition p is the sum of a set of other propositions, we say that the propositions in the set resolve p. 2.3 Arity-changing Distributivity Following Ishikawa (1995a), we analyze the collective/distributive distinction in terms of situation-relative lattice-theoretic structures of individuals, inheriting the following principle:8 A sum proposition has to be resolved. For example, let p be the property of carried a piano upstairs. Then, if (10) describes situation s, • (10) Ken and Naomi carried a piano upstairs. 7Note that share can sometimes function as an arity-constant relation. For example, if Ken and Naomi","share x and John and Mary share y, (i) a. s\\tshare, Ken e Naomi, x >> \\t","b. t\\tshare, John e Mary, y >>","we have Ken and Naomi and John and Mary share x and y, i.e.","(ii) s e t\\tshare, Ken ED","Naomi ED","John e","Mary, x e y >> 8 0f course, a proposition of the form:","s\\tP, X >>","where P is a cardinality predicate, is exempt from this principle."]},{"title":"186","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 184-194 we have: (11) s\\tp, Ken e Naomi > When we have: (12) a. s\\tmember, Ken, Ken 69 Naomi > b. s\\tmember, Naomi, Ken ED Naomi > we resolve (11) to: (13) a. si\\tp, Ken > b. s2\\tp, Naomi > That is, we infer from (10) to: (14) a. Ken carried a piano upstairs. b. Naomi carried a piano upstairs. On the other hand, if we do not have (12a—b), (11) is not a sum proposition and hence is not to be resolved to (13a—b). That is, in this case, we do not infer from (10) to (14a—b). This is Ishikawa's (1995a) analysis of the distributive/collective distinction. Further, just as we \"decomposed\" KeneNaomi to Ken and Naomi in (13), we can \"decompose\" two or more sum individuals, as in: (15) Three students read four books.","(16) s\\tread, X, Y >> where X and Y have the following restrictions: r k< student, X >> t\\tbook, Y >>","(17) si\\tread, xi , yi > where xi and yi have the following restrictions:"]},{"title":"ri","paragraphs":["< student, xi > ti\\tbook, yi > (16) is resolved to propositions of the form (17), and the cardinality of y 3 may be two.","Now, with our characterization of how propositions involving arity-changing relations should be resolved, things are a little complicated. In fact, in our picture, they do distribute. For example, (9), repeated here, (9) s t\\tshare, x e z, y does distribute to (8a—b), again repeated here: (8) a. s\\tshare, x, y, z > b. t k<< share, z, y, x >> In other words, Ken and Naomi share a room. distribute to: Ken shares a room with Naomi. Naomi shares a room with Ken."]},{"title":"187","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 184-194 2.4 Resolving Parametrized Sum Propositions Now let us ask the question of how a parametrized sum proposition is to be resolved. For example, assume we have: (18) s\\tP, X7*<Q ,x> >> where X is a sum individual parameter with atomic members in s. (18) then is a parametrized sum proposition, to be resolved.","We could first anchor X, making sure that (19) is true, and then resolving (20). (19) f(r)\\tQ, f (X) >> (20) f (s)\\tP, f (X) >> Note that (20) does not have the restriction on X anymore. Alternatively, we could first resolve (18) to (21a—b), where sl, s2, xl, x2, rl and r2 are all parameters, and then anchor them.","(21) a. sl\\tP, Xlril=<Q,xl>> \\t . b. s2\\tP, x2r2 <Q,x2>> >> At this point the two might seem to make no empirical difference, but in case it might, which should we choose?","In Situation Semantics, the meaning of a given natural language expression is given in terms of parametric objects. . Each parameter in the objects is to be anchored to different real individuals depending on the context. But the range of possible readings should be the same irrespective of the context, i.e. irrespective of to which individuals the parameters are to be anchored. 9 This consideration suggests that we should first resolve and then anchor, instead of first anchoring and then resolving. This means that a parametrized sum proposition and restrictions on its parameters cannot be resolved independently.","Here note that, while resolving (18) to (21a—b) makes sense, resolving it to (22a—b) does not, because (22a—b) themselves do not; (22) a. s1\\tP, \\tb. s2\\tP,\\t>> a parameter with a restriction that does not mention that parameter at all is just useless and hence does not make sense. This means that, when we resolve a sum proposition and \"decompose\" a sum individual parameter, we also have to resolve the restriction on that same parameter. This means that an argument's membership in the described situation has to be reflected in its membership in its resource situation. That is, if a given sentence is analyzed as:","S<<P,..•,X r • • • >> and if X is atomic in r, then it has to be atomic in s too and that sentence cannot be read distributively with respect to X.","Now we are ready to propose the following principle: The Resolution Principle: When you resolve a sum proposition, avoid resolving the restriction on a parameter in it unless you have to. This is a sort of \"minimal cost\" principle. This principle, put in the context of the present framework, accounts for the phenomena to be considered below in a way that respects English number morphology. 9 0f course, the actual readings will differ from context to context."]},{"title":"188","paragraphs":["X lawyer(X) X EX","non.-at(X) at(x) piano(y) at(y)","lifted-upstairs(x, y) -4 Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 184-194"]},{"title":"3 Problems with Kamp and Reyle's Treatment","paragraphs":["Now we examine Kamp and Reyle's treatment. 3.1 An Unnecessary and Unmotivated Superscript Clearly, any semantic theory should express the difference between (23a-b). (23) a. Bill owns a car. b. Bill owns (several) cars. To express the difference of the numbers of the cars that Bill owns, Kamp and Reyle assume two predicates, at and non-at. Let x be a discourse referent. Then, the condition: at(x) means that x is atomic; non-at(x) means that x is non-atomic. With these predicates, then, (23a-b) are analyzed as (24a-b) respectively.1° (24) a. X, y Bill() car(y) at(y) b. x, y Bill (x) car(y) non-at(y) If x is a discourse referent, at(x) excludes non-at(x), and vice versa.","On the other hand, Kamp and Reyle analyze distributivity in terms of universal quantification. For example, (25) The lawyers lifted a piano upstairs. (25), when read distributively, is analyzed as:11 (26) One possible problem comes from a pair like the following: (27) a. The lawyers hired a secretary who they liked. b. The lawyers hired a secretary who he liked. 101n this paper we ignore Link's (1983) distinction between P and P*, where P is a predicate, which Kamp and Reyle inherit. 11We use Kamp's (1981) arrow notation to express universal quantification. This is simply for typographical reasons. 189","X lawyer(X) x E X","non-at(X) at(x)","y, z","secretary(y)","••","nn","•• n • nn +\\t","at(y)","hired(z, y)","z = x","X lawyer(X) x12/ x E X","non-at(X) at(x)","y, z","secretary(y)","-4\\t at(y) hired(z, y) z = x Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 184-194 If the subject is read distributively, (27a), but not (27b), can mean that each lawyer hired his or her favorite secretary, in which case the DRS we want would be something like: Here z has to be atomic, since it is equated with the atomic discourse referent x. Now, a natural assumption is that a singular pronoun, but not a plural pronoun, should introduce an atomic discourse referent, in which case (28) should be derived from (27b), but not from (27a), contrary to fact. Kamp and Reyle then claim that, as a \"syntactic\" matter, a pronoun and its antecedent have to match in number. To express this \"syntactic\" requirement, they attach a superscript pt to a discourse referent when it is introduced by a plural antecedent. Thus, they say, the desired DRS is not (28) but rather (29), and the antecedent discourse referent for the discourse referent introduced by a plural pronoun has to be either (i) one with the p1 superscript or (ii) one with the non-at condition; then we could prevent (27b) from having the reading in question by requiring the antecedent for the discourse referent introduced by a singular pronoun to be non-atomic one without the pl superscript (p. 350).","At this point we have two different mechanisms: the at/non-at conditions and the pl superscript. The former sounds natural to anybody; however, we are forced to have the latter simply by Kamp and Reyle's decision to analyze distributivity in terms of (singular) universal quantification. Furthermore, the motivation for the latter is not very easy to understand. They claim that the number agreement between the antecedent and the pronoun is a syntactic matter with no semantic significance, but recording the number morphology of the antecedent on the DRS level amounts to admitting its semantic significance. 3.2 Dependency Stipulated Next, consider (30): (30) a. The women bought cars which had automatic transmissions. b. The women bought a car which had automatic transmissions. They observe that (30a), but not (30b), can mean that each woman bought a car with an automatic transmission; (30b) can only mean that the car that each woman bought has more than one transmission. In other words, in (30a), cars can vary depending on the woman, and automatic transmissions can vary according to the car, and hence transmissions can vary depending on the woman. Such \"dependency\" is impossible in (30b).","They stipulate the following \"principle\" (p. 358): (28) (29)"]},{"title":"190","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 184-194 A bare plural NP can be interpreted as a dependent plural only if it can be interpreted as dependent on some other plural NP which occurs in the same clause. However, this is nothing more than an observation, instead of an explanation. Note that such \"dependency\" is possible between the women and they in both (31a) and (31b); they can both mean that each woman bought a car that she liked, as Kamp and Reyle observe. (31) a. The women bought cars which they liked. b. The women bought a car which they liked. The above \"principle\" simply does not apply to (31a–b). But we want to know why."]},{"title":"4 Dependency Explained","paragraphs":["In our semantics of plurality sketched above, no mismatch between surface grammar and semantics with respect to number is assumed. Thus it is easy to see that the problems noted in 3.1 simply do not arise in our semantics. What remains is to explain the possible and impossible \"dependencies\" reviewed in 3.2.","First let us consider the contrast in (30), repeated here: (30) a. The women bought cars which had automatic transmissions. b. The women bought a car which had automatic transmissions. (30a) will be analyzed as:","(32) s\\tbought, X, Y >> where the following restrictions are on X and Y respectively: 3 woman, X > \\t t\\tcar, Y >> A < had, Y, Z >> where the restriction on Z, the automatic transmissions, is omitted. Now we want to resolve this and \"decompose\" both X and Y. We can get resolutions of the following form: \\t","(33) si\\tbought, xi , yi >> where the following restrictions are on nxi and yi respectively: • woman, xi >> ti < car, y >> A < had, yi, z >> Note that the restrictions on X and Y have to be resolved at the same time; otherwise, the restrictions on xi and yi would end up having only X and Y instead of x i and yi.","Next consider (30b). \\t","(34) s\\tbought, X, y","where the following restrictions are on X and y respectively:","3 woman, X >>","\\tt\\tcar, y >> A < had, y, Z Here y is atomic in s and t. If we resolve (34) and \"decompose\" X, the sentence would end up meaning that one and the same car was bought by these women. In order to vary the cars, we have to existentially quantify y and Z away (cf. Gawron and Peters 1990).12 12 If we do not quantify Z away, we obtain the reading according to which the cars share the same set of transmissions, in which case each car has more than one transmission. Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 184-194 \\t","(35) s\\t[ u I By, z << bought, u, y >>], x »]","where the following restrictions are on X and y respectively:","3 woman, X >>","\\tt\\tcar, y >> A < had, y, Z > Now we resolve (35) and \"decompose\" X, but this time, the Resolution Principle prohibits us from resolving the restriction on y at the same time.","(36) si\\t[ u I ay, Z << bought, u, y >>], xi >1","where the following restrictions are on x i and y respectively:","woman, x >> .","\\tt\\tcar, y >> A < had, y, Z >> Here y is atomic and hence is not \"decomposed\" when (35) as a whole is resolved. Since the restriction on y then does not have to be resolved at the same time, the Resolution Principle prohibits us from resolving it. Thus (30b) is predicted to lack the reading in which cars vary according to women.","Now we turn to (31), repeated here: (31) a. The women bought cars which they liked. b. The women bought a car which they liked. (31a) is analyzed as:","(37) s\\tbought, X, Y >>","where X and Y have the following restrictions respectively:","3 woman, X >>","\\tt\\tcar, Y >> A << liked, X, Y >> Resolving this and \"decomposing\" X and Y, we get:","(38) si\\tbought, xi, yi >> where xi and yi have the following restrictions respectively: \\t ri\\twoman, xi >> ti < car, yi >> A << liked, xi , yi >> On the other hand, (31b) is analyzed as:","(39) s\\t[ u 3y << bought, u, y >], X > where X and Y have the following restrictions respectively: 3 woman, X > \\t t\\tcar, y > A < liked, X, y >> This time, if the X that appears on the first line and the one that appears on the last line are one and the same parameter, then resolving the first line automatically means resolving the last line, and we get: \\t","(40) si\\tu 3y << bought, u, y >>1, xi >> where xi and yi have the following restrictions respectively: • woman, x >> \\t ti\\tcar, y >> A < liked, xi , y >>","This is the reading we want: each woman bought her own car she liked. To end this section, we consider Kamp and Reyle's following example: (41) The professors hired secretaries that share offices."]},{"title":"192","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 184-194 This sentence has a reading according to which each professor hired his or her own favorite secretary and the secretaries hired by those professors share offices.","(42) s\\thired, X, Y where X and Y have the following restrictions respectively: r k< professor, X > t k‹< secretary, Y >> A << share, Y, Z >> This will be resolved to:","(43) si =<< hired, xi , yi >> where xi and yi have the following restrictions respectively:"]},{"title":"ri","paragraphs":["k‹ professor, xi >> \\t ti\\tsecretary, yi >> A << share, yi , vi >> where:","GEM -= @Di = Y i=1\\ti=1"]},{"title":"5 Conclusion","paragraphs":["We have only revised Ishikawa's (1995a) semantics of plurality in a minor way and added the Resolution Principle. The same mechanism that accounts for cumulative readings accounts for the possible and impossible plural anaphora examined above. This means that surface grammar is a better guide to compositional semantics than usually assumed. Initially, English plural morphology seemed to be an obstacle for an account of anaphora; however, we can obtain a better account of anaphora if we respect English plural morphology.","This means that English plural morphology is semantically motivated and hence not redundant. If the same applies to other instances of assumed morphology-semantics mismathes, natural language is not designed to be as semantically redundant as usually assumed."]},{"title":"References","paragraphs":["Bach, Emmon (1986) \"The Algebra of Events.\" Linguistics and Philosophy 9: 5-16. Bach, Kent (1987) Thought and Reference. Oxford: Clarendon.","Gawron, Jean Mark, and Stanley Peters (1990) Anaphora and Quantification in Situation Semantics. Stanford: CSLI Publications.","Hoeksema, Jack (1983) \"Plurality and Conjunction.\" In Alice G. B. ter Meulen (ed.) Studies in Modeltheoretic Semantics. Dordrecht: Foris, 63-83.","Ishikawa, Kiyoshi (1995a) \"Situated Groups.\" In Akira Ishikawa and Yoshihiko Nitta (eds.) The Proceedings of the 1994 Kyoto Conference. Tokyo: The Logico-Linguistic Society of Japan, 21-30.","Ishikawa, Kiyoshi (1995b) \"Agreement Target Situations.\" In Benjamin K. T'sou and Tom B. Y. Lai (eds.) Language, Information and Computation. Hong Kong: City University of Hong Kong, 29-38.","Ishikawa, Kiyoshi (1995c) \"Cross-linguistic Notions of (In)definiteness.\" In Benjamin K. T'sou and Tom B. Y. Lai (eds.) Language, Information and Computation. Hong Kong: City University of Hong Kong, 85-89."]},{"title":"193","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 184-194","Ishikawa, Kiyoshi (1996) \"Individuation and Reasoning.\" In Jerry Seligman and Dag, Westerstahi (eds.) Logic, Language and Computation, void. Stanford: CSLI Publications, 287-302.","Ishikawa, Kiyoshi (1997) \"Fukusuukei no Ryooka-Hyoogen ni tsuite.\" (On Plural Quantificational Expressions) In the Proceedings of the 14th annual meeting of the Japanese Cognitive Science Society, 120-121.","Ishikawa, Kiyoshi (To appear) A Network Theory of Reference. Bloomington: Indiana University Linguistics Club.","Kamp, Hans (1981) \"A Theory of Truth and Semantic Representation.\" In Jeroen Groenendijk, Theo M. Janssen, and Martin Stokhof (eds.) (1984) Truth, Interpretation and Information. Dordrecht: Foris, 1-41. Kamp, Hans, and Uwe Reyle (1993) From Discourse to Logic. Dordrecht: Kluwer.","Kaplan, David (1989) \"Demonstratives: An Essay on the Semantics, Logic, Metaphysics, and Epistemology of Demonstratives and Other Indexicals.\" In Joseph Almog, John Perry and Howard Wettstein (eds.) Themes from Kaplan. Oxford: Oxford University Press, 481-614.","Krifka, Manfred (1989) \"Nominal Reference, Temporal Constitution, and Quantification in Event Semantics.\" In R. Bartsch, J. van Benthem and P. van Emde Boas (eds.) Semantics and Contextual Expression. Dordrecht: Foris, 75-115.","Link, Goddehard (1983) \"The Logical Analysis of Plurals and Mass Terms: A Lattice-Theoretic Approach.\" In Rainer Bduerle, Christoph Schwarze and Arnim von Stechow (eds.) Meaning, Use, and Interpretation of Language. Berlin: Walter de Gruyter, 302-323.","Pollard, Carl, and Ivan A. Sag (1994) Head-driven Phrase Structure Grammar. Chicago: University of Chicago Press.","Reid. Wallis (1991) Verb and Noun Number in English: A Functional Explanation. London: Longman."]},{"title":"194","paragraphs":[]}]}