{"sections":[{"title":"","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 283-294"]},{"title":"An Automatic Chinese Document Revision System Using Bit and Character Mask Approach June-Jei Kuo","paragraphs":["Matsushita Electric Institute of Technology (Taipei) Co., Ltd. Rm.1002, 10 FL, No.136, Sec. 3, Jen-Ai Road, Taipei, Taiwan, R.O.C. kaku@mitt.com.tw","Abstract","The errors in Chinese document are mainly caused in two stages - input and editing. There are homonyms or homophones selection error, ambiguous pronunciation error, word segmentation error, similar shape character error, editing operation error and so on. In order to increase the quality of Chinese text, the conventional Chinese document revision system used the similar characters set and language model with some statistical date. Nevertheless, there are the following problems: (1) The perfect similar character set is difficult to make (2) Due to the copyright problem the large and balanced Chinese corpus is very difficult to be obtained (3) The above editing errors can not be solved simultaneously (4) The average success revision rate is not over 75%.","In this paper we study the Chinese features and phonetic-input-to-character conversion system for Chinese. It is found that the Chinese phonetic information and the related conversion algorithm are much help to detect and revise the input errors in Chinese document. As to the editing errors, a special code structure of Chinese pronunciation which has only one bit difference among similar pronunciations is proposed In addition, the bits and characters mask technology is also proposed respectively. The experimental result of the proposed system show that the average success revision rate of the proposed system is close to 87%. Keywords: Natural language processing, document revision, bit mask,character mask, phonetic information, dynamic programming 1. Introduction As the rapid progress of computer technology, the need for document computerization is also rised. So, how to enhance the document quality in the computer becomes an important issue. In addition, the document revision technology will be needed as a preprocessor or postprocessor in many application softwares, such as character recognition, speech recognition, machine translation and so on. Therefore, there are many approaches [1] on automatic document revision. The document revision can be further divided into error detection and. error modification. Nevertheless, the document error types is dependent on its processing language. For example, the English spelling checker can not be used to revise Chinese or Japanese document due to the different error types. Thus, the error types e of Chinese document will be described below. The error types of Chinese document can be divided into two parts. The first part is caused by input stage and the other part is caused by editing stage. Moreover, in input stage the different input way, such as phonetic way or radical way, will also have different error types. 283 Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 283-294 In the input part: (1) Using phonetic way 1. Ambiguous pronunciation error The phonetic symbols of a Chinese character can be divided into four parts: consonant, intermediate, vowel and tones. The possible ambiguous phonetic symbols in each part will be shown below. Consonant: ["]},{"title":"p","paragraphs":["'sh' and [\\t's' and [ < 'ch' and [\\t'x' and etc. Intermediate: [\\t'i' and [\\t'u and [\\t'iu' Vowel: [\\t'eng' and [\\t'en', [\\t'an' and [\\t'mg' and etc. Tone: Wrong tone will get wrong character. For example, if the phonetic symbols of [\\t'xing4qiu4' were mistyping as 'xingqi', the output will become [\\t. 2. Homonyms or homophones selection error Chinese has some 1300 pronunciations, but there are 13,053 characters in Big5 code system. The usage frequency (learning function) is usually to be used as an important cue, but the homophones and homonyms selection is still unavoidable. For example, [ * ift ] or [ 4*"]},{"title":"g\\t","paragraphs":["are the wrong input of Chinese word [ i *.X. 4t, ] 'homophone'. 3. Candidates selection error The success conversion rate[4]—[6] using phonetic way is some 92%. The main problem is that there is no effective way to select the overlapping candidates. For example, inputted phonetic string \"i3dian4nau3' is converted as \"44* fig \" other than \""]},{"title":"ta\".","paragraphs":["4. Reference dictionary error Due to the careless there are some input errors existed in the reference dictionary. (2) Using radical way 1. Similar shape character error There are many similar Chinese characters, e.g. \" \" and \" 44 \", \" El \"and \"Et \", so it is very easy for a user to input the wrong character using the radical way. 2. Similar radical combination error There are many Chinese characters which has the similar radical combination. For example, if we input the radicals \"smv\" rather than \"qmv\", then the Chinese character"]},{"title":"\"*\"","paragraphs":["will be obtained rather than \"* \". 284 Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 283-294 In the editing part: 1.Missing character error When we use the delete function carelessly, the missing character error will occur. For example, if we delete the character \"46I-\" among \"-471 A 41- fif \" 'a kind of database', the string \"—ft * I \" will be no meaning. 2. redundant character word error When we use the copy function carelessly, the redundant character word will occur. For example, if we copy the character \" .f.. \" to the Chinese string \"4.# \" twice, the above string will become\\t\". 3. Wrong character order word error When we use both the delete and copy functions carelessly, the wrong order character word error will occur. For example, \" fg- ft* \" 'international Economics' may become \"1 \\tgf\" which will be no meaning. Therefore, the automatic Chinese document revision system which can solve all the above error types is the idea one. In section 2, we survey the conventional Chinese revision system and describe the related problems. The design issues of the new automatic Chinese document revision system and the proposed system architecture will be pointed out in section 3. In section 4, we give an example to further explain our system. The experimental results will be shown and analyzed in section 5. Finally, we will describe the prospects and future development in section 6. 2. The conventional approach and its related problems The conventional approaches[2][3] for the Chinese document revision use the similar character set and statistic data, e.g. bi-gram or tri-gram. First, they made survey on every Chinese character and collected the related Chinese characters which have the similar meaning or shape or pronunciation or input code into similar character set shown as the figure 1. For example, the Chinese character \"t \"'power\" has the similar shape Chinese characters as \"n \"'sword',\" 93 \"'knife'. And, \"JA \" and \"6\" are the its similar pronunciation characters. Nevertheless, the Chinese character \"hi; \" is the similar meaning character to the Chinese character \"4.1\" . Moreover, Chinese character \"t \" is the similar pronunciation character to the Chinese character \"4.1\" . On the other hand, \" \"'hvif is the similar input code to the character \" As to the statistical data, based on a training corpus, the co-occurrence probabilities of different combinations of successive syntactic tags are calculated. First, the corpus is segmented into a number of words. Then, the syntactic tags are assigned to these segmented words. Moreover, if the above two tasks are performed by some automatic procedures, it is necessary to correct the mistakes manually. 285 Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 283-294 A:A.S t:441),46P,7JS,nS iq:JAM,YJP,P1S,MS,CS,• • • -:XS 4,4:AigS (S:similar shape, P:similar pronunciation, M:similar meaning, I:similar input code) Figure 1 The example of similar character set Thus, the bigram model[3] is used to calculate the syntactic co-occurrence probability of a number of words. For certain pair of syntactic tags Tx and Ty, P(TxITy) are defined as follows. number of Tx used in the training corpus P(Tx) = number of all words in the training corpus number of Tx following Ty in the training corpus P(TxITy) = number of Ty in the training corpus The system architecture and processing flow of the conventional Chinese document revision system is shown as the figure 2. The Chinese document is inputted through the input device, such as scanner, hard disk, keyboard and so on. Thus, the substitution device substitute the characters of input Chinese document into their similar characters by referring the above similar character set. And then, the language model evaluation device[7] contains the evaluation device, such as Markov probabilistic model, and search device, such as dynamic programming. After the finding the optimal string through the lattice of the possible candidates, it compare the characters of optimal character string with the input Chinese string to detect and mark the wrong characters in wrong characters detection device. Finally, it will output the marked Chinese string and optimal string to the storage device. The average success revision rate[2][3] is some 75%. 286","Evaluation Device"]},{"title":"•","paragraphs":["Substitution Device","of Simular Character Set"]},{"title":"•","paragraphs":["Language Model Evaluation Device Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 283-294 Chinese Document Input Device Search Device for Finding Optimal candidates string"]},{"title":"•","paragraphs":["Wrong Characters Detection Device","Marked Chinese Document"]},{"title":"•","paragraphs":["Output the Marked Chinese String Figure 2 The processing flow of the conventional approach 2.1 the related problems There are some problems shown as the following. [1] The revision accuracy rate is largely influenced by the quality of the similar characters set, but how to make the similar characters set effectively and correctly will become a difficult issue. [2] In order to obtain the character bi-gram or tri-gram(statistical data), a large and balanced Chinese corpus will be necessary, but such a corpus is also difficult to be obtained due to the copyright problem. [3] the problem of missing or wrong order characters can not be solved effectively in the conventional approaches. [4] The 75% revision rate is not satisfactory. 287 Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 283-294 3. The proposed automatic Chinese revision system In order to be able to solve the above mentioned problems of conventional approaches, we study the Chinese feature and try to find some useful information for us to solve both the input and editing errors in Chinese document. 3.1 The survey of Chinese feature There are 13,053 Chinese characters in BIG5 code, but some 3,0004,000 characters commonly used in the modern Chinese. Chinese characters are already the basic semantic and syntactic units and can be used independently to express certain meaning in Chinese. Nevertheless, only the Chinese characters are not sufficient for usage. Thus, two or more characters are grouped together to form a word, which is also a complete semantic and syntactic unit in Chinese. Moreover, one character can also be seen as a special one-","character word. The number and usage of Chinese word[3] will be shown in the Figure 3. Word length\\tNumber\\tUsage One character\\t12.1%\\t64.3% Two characters\\t73.6%\\t34.3% Three characters\\t7.6%\\t0.4% Four characters\\t6.4%\\t0.4% Five characters or longer 0.2%\\t0.0% Figure 3 The number and usage of Chinese word From the above survey result, it is found that it is uncommon to use more than five successive one-character words in a Chinese document. Thus, the presence of successive one-character words, e.g. three or over three, found in the segmented Chinese document can be used a hint to detect the document errors. 3.2 The survey of phonetic-input-to-character conversion system for Chinese As to the above wrong selection of homophones or homonyms, it is found that there are many phonetic-input-to-character conversion system for Chinese[4] N[8] shown as the Figure 3 and the average conversion success rate are some 92% which is higher than the average revision rate, e.g. 75%, of Chinese document. So, the phonetic information and the related algorithm will be another important cue to detect and revise the the wrong selection problems of homophones or homonyms. 288 Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 283-294 [Phonetic string] xi 1 uan 4 sh4 sh2 • ant sh2 mei3 de0"]},{"title":"\"$\"Z 4Z 44.*","paragraphs":["[Conversion result]"]},{"title":".4. Z k-f-k+Xiit-Aiko.","paragraphs":["(I wish she is a perfect girl) Figure 3 The example of phonetic-input-to-character conversion for Chinese 3.3 The Chinese pronunciation structure and the bit mask technology There are some 1300 kinds of pronunciation of Chinese characters. Moreover, a pronunciation of a Chinese character can be divided into four parts which are consonant, intermediate, vowel and tone. In addition, there are 20 consonant, 3 intermediates, 13 vowels and five tones respectively. Therefore, the two byte structure[4] , shown as Figure 4, of a Chinese character pronunciation will be used. In that, the similar phonetic symbols are assigned to 1 bit difference and so the similar bits mask technology can be used to solve the ambiguous pronunciation problems effectively. Furthermore, the example of bit mask technology will also be shown as Figure 5. For example, if we mask (or ignore) the last bit of the phonetic symbol","\" \" and \"17 \", both bit representations will be the same. 7\\t6\\t5\\t4\\t3\\t2\\t1\\t0\\tBIT BYTE"]},{"title":"1","paragraphs":["CONSONAT AREA","\\t INTERMEDIATE AREA","7\\t6\\t5\\t4\\t3\\t2\\t 0\\tBIT BYTE"]},{"title":"2 0","paragraphs":["TONE AREA\\tVOWEL AREA Figure 4 The two byte structure of Chinese character pronunciation • >"]},{"title":"1 0 1 • - > 101 >","paragraphs":["• > O 1 t >"]},{"title":"0 1","paragraphs":["Figure 5 The example of bit mask technology"]},{"title":"0","paragraphs":["289 Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 283-294 Therefore, the bit mask technology can help us to find all the similar candidates by referring the dictionary. 3.4 The character mask technology Because the successive one-character words in Chinese document is uncommon use, so this hint can be used to detect the missing character or redundant character or wrong order words error. The character mask pattern between two or three successive one-character words will be shown below. In this paper, in order not to obtain large number of candidates we only consider two character mask patterns. The successive two one-character words: A,B,C Two Character mask patterns: *AB, A*B, AB*, *A, A*, *B, B* Three character makk patterns: AB*C,*ABC,A*BC, AB*C, ABC* (*:ignored character) For example, if we use the phonetic string of successive one-character words are \"zl\" and \"ku4\", then all the possible candidates using the character mask technology will be shown below. \"zl*ku4\":\\t\" 'database' \"*zlku4*\": None \"*zlku4\": None\\t\"z1*\": Ita ft \"'know',\\t\"'knowledge',... *z1\":\\tit\"'branch',\\t\"ku4*\": „40 „„, „It .01,1z4 \"*ku4\": \"*)if \"'warehouse', \"09 4. \"underwear',... 3.5 The similarity weight with the input text and the word length weight It is also found that the more similar characters the candidates has comparing with the input text, the more possible the candidates are the optimal candidates. So, the similarity weight will be defined below. For example, the candidate and the corresponding characters in input text are \"f . 41-4 \" and \"If. AE\"","respectively, so its similarity weight will be 2/3.","The number of similar character","Similarity weight= \\t","The total character number of the candidate As we know, the word length is a very important cue to find the optimal conversion result in the phonetic-input-to-character conversion system for Chinese or Japanese. So, in order to find the optimal path effectively through the candidates, the following word length weight. is also considered in our proposed system. For example , the word length weight of the candidates \"f 4+ \" 'database' is (3-1)*2=4. Word length weight = (word length-1)*2 3.6 The system architecture and processing flow of the proposed Chinese document revision system 290 Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 283-294 We adopt the the algorithm of the phonetic-input-to-character conversion system for Chinese[8] as our processing processing engine because of its high conversion performance. The related score function of the proposed Chinese document revision system will be described below. 3.6.1 The score function In the proposed Chinese revision system , we use the backward dynamic programming to find the optimal path through the candidates network. The score function will be shown below. Among them, beside the above character similarity weight and word length weight, the usage weight obtained by long and short term learning function and the semantic similarity weight in the conversion algorithm[8] will also be adopted in order to enhance the performance of the proposed system. SCORE = USAGE WEIGHT + WORD LENGTH WEIGHT + CHARACTER SIMILARITY + SEMANTIC SIMILARITY 3.6.2 The configuration and processing flow of proposed Chinese document revision system The configuration and the processing flow will be shown as Figure 6. System Dictionary Semantic Pair Learning Dictionary","1111","n 1111","n","1111••••11./ Similar Candidates Retrieval","1","n 131 n","INI","\\t Optimal\\tMarking","♦ Path\\tby Deciding\\tComparing Source Text Input Character-to-","--flo Phonetic Ouput Conversion Candidates Retrieval Output Marked Text","Special Character Dictionary Figure 6 The processing flow of the proposed Chinese revision system First, the Chinese text will be input from the input device in the source text input, then the character-to-phonetic output conversion software [10] is used to convert the input Chinese text into phonetic string by referring the special character dictionary, e.g. Poinzi dictionary \"fitt** 4: 4\" and system dictionary in the character-to-phonetic conversion module. Thus, candidate retrieval module retrieves all the possible 291 Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 283-294 Chinese candidates by referring the system dictionary. And then, thee similar candidates retrieval module uses the bit mask and character mask technology to retrieve all the similar candidates by referring the system dictionary. After that, the optimal path deciding module will use the start and end position of each candidate to link a processing net and use the dynamic programming and the above score function to find the optimal path through the candidates by referring both the system dictionary and the semantic pair learning dictionary[8]. In the marking by comparing module, the optimal path Chinese string will be compared with the input Chinese text and then output the optimal path string and the marked input text to the output device in output marked text module. 4. Example In order to further explain our proposed Chinese document revision system, an example will be given in this section below. [Input Chinese text] *It [Character-to-phonetic conversion] in2hang2z lku4deOmi4tong3 [ Candidates retrieval ] in 2","\\t hang2\\tz 1\\tku4\\tde0\\ttong3 it\\tM.\\tit\\tAt\\tii3\\tW.\\ttl, * *,\\tit-\\t44\\t44\\t4:\\tVI",". :\\t:\\t:\\t: I Similar candidates retrieval zl","\\t ku4","\\t de0","\\t mi3","\\t tong8"]},{"title":"#","paragraphs":["292 Language; Information and Computation (PACLIC12), 18-20 Feb, 1998, 283-294 [ Net and optimal Path deciding","in2\\thang2\\tzl\\tku4\\tde0\\t mi4","\\t tong3 [ Marked the input text by comparing ] Input Text : 10,\\t63 Optimal String :\\t17 41-# fel ,t","Marked Output : 419,","lt 4 31- \\t","* : Missing character , * : Similar radical character ) 5. The experimental results and analysis The 11 articles (some 8,620 characters) selected from the text books of the primary school in Taiwan were used as the test samples. Those articles were modified manually, e.g. deletion, insertion, and so on, and the modification records were also memorised. Although the success conversion rate of Chinese character-to-phonetic conversion[10] is over 99%, but in order to get rid of the influence of character-to-phonetic conversion completely, the phonetic strings of the above articles are checked manually. Moreover, in order to reduce the number of Chinese chartacter candidates we only use those Chinses characters which have been used recently in the learning dictionary and the system were implemented on Power PC and C language. The accuracy of both detection and correction is 86.4% and the average execution speed was some 3 characters/second. The analysis of errors will be described below. (1) Because the Chinese names or unknown words are usually successive one-character words, so the proposed revision system can not process them effectively. (2) There are some errors caused by the typing errors in the system dictionary, e.g. [10 - 313 *k] be mistyped as [ 41 Tido in the system dictionary. (3) The proposed revision can not process the discourse error, e.g. [ 1)1 /Of, ]' He died tomorrow.'. (4) The similar candidates are not enough due to few character mask patterns. 293 Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 283-294"]},{"title":"6. Concluding remarks","paragraphs":["The above proposed Chinese revision system without the necessity of similar Chinese characters set or large marked Chinese corpus was applied to the post processing of Chinese editors and the satisfactory results (both the document quality and editing time) was obtained. Moreover, those dictionaries of our proposed system are the same with the Chinese input conversion system, so the development cost and time can also be decreased. In order to further improve the performance of the proposed Chinese revision system, there are still some future works. [1] Develop some effective algorithms for processing the unknown words or Chinese names in the Chinese document [2]Introduce the heuristic way to decrease the candidates and increase the execution speed. [3] Introduce some discourse information to solve the semantic contradictions problems. [4] Introduce the radical information. [5] Use more Chinese text to evaluate the proposed revision system."]},{"title":"7. References MAN sae, \" 3Z*43EZNiA5-\" A Iztift6 V.MEN1311\" 1116011.4, vol.34, No.10,PP1249-1257,1983 [2]*,4*4 , \" it** \\tt 4:0\\t\" ,","paragraphs":["1§4itV, , Vol.8, 1992, PP19-26 [3]C.H. Leung and W.K. Kan, \"Difficulties in Chinese Typing Error Detection and Ways to the solution\", Vol.10, No.1, 1996,PP97-113 [4]J.J. Kuo, J.H. Jou, M.H. Hsieh and F. Maehara, \"The development of New Chinese Input Method---Chinese Word-string Input System\", Proceeding of International Computer Symposium, PP1470-1479, 1986 [5]S.I Chen, C.T. Chang, J.J. Kuo and M.S. Hsieh,\"The Continuous Conversion Algorithm of Chinese Character's Phonetic Symbols to Chinese Character\",Proceeding of National Computer Symposium, PP437-442, 1987 [6]M.L. Hsieh, T.T. Lo and C.H. Lin, \"A Grammar Approach to Converting Phonetic Symbols into Characters\", Proceeding of National Computer Symposium, PP453-461, 1989 [7]R. Sporat,\"An Application of Statistical Optimization with Dynamic Programming to phonetic-input-to-character conversion for Chinese\",Proceeding of ROCLING III,PP380-390, 1992 [8]J.J Kuo, \"Phonetic-input-to-character Conversion System for Chinese Using Syntactic Connection Table and Semantic Distance\", Computer Processing of Oriental Language, Vol.10, No.2, 1996, PP195-210"]},{"title":"[9]tif W, ANEA, IMEIZIENA, /INFIX, 1986 Doi 4/CZ , \". 67tnifit*i-1,1'rk-i-11 X-S-tiA;rtsitt \"","paragraphs":["1995"]},{"title":"294","paragraphs":[]}]}