{"sections":[{"title":"","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 172483"]},{"title":"Case Alternations in Potential Constructions in Japanese and their Semantic Implications Hiroaki Nakamura and Takeshi Fujita' Japan Maritime Safety Academy\\tMuroran Institute of Technology","paragraphs":["In potential constructions in Japanese, any argument of a base verb, whether it is an argument, an adjunct or even an argument with no thematic relation to the verb, can be marked with nominative case. Addressing the problem of various types of case alternations as well as g̀a-no' conversion, this paper argues for the existence of some semantically motivated mechanism licensing nominative and genitive case, which adequately accounts for the distributions of these cases in these constructions. We also claim that there is a close connection between the morphological realization of case and the overall semantic interpretation of a sentence."]},{"title":"1. INTRODUCTION","paragraphs":["This paper addresses the problems of subjectivization of embedded arguments bearing various semantic roles in potential constructions in Japanese, as illustrated in (1):","(1) a. Yamada-ga joozuni oyog-(ar)e-ru. Yamada-Nom well swim-CAN-PRES 'Yamada is able to swim well.'","b. Yamada-ga\\tyasai-ga/yasai-o\\tCaber-are-ru. Yamada-NOM vegetables-NOM/vegetables-ACC eat-CAN-PRES 'Yamada can eat vegetables.'","c. Kono hootyoo-ga/hootyoo-de\\tyasai-o\\ttayasuku kir-(ar)e-ru. this kitchen.knife-NOM/kitchelnife-BY vegetables-ACC easily cut-CAN-PRES '(We) can cut vegetables easily by this kitchen knife.'","d. Tazawako-ga/Tazawako-de\\tkoi-o\\ttakusan tur-(ar)e-ru. Tazawa-lake-NOM/Tazawa-lake-IN carps-ACC a lot catch-CAN-PRES '(We) can catch a lot of carps in Tazawako.","e. Kono syatu-ga/syatu-no • eri-o\\taraw-e-ru. this shirt-NOM/shirt-GEN collar-ACC wash-CAN-PRES 'The collar of this shirt can be washed.' Though so much discussions have centered on the nominative-accusative case alternation of embedded objects, as in (lb), the important point is that any argument or even non-argument of an embedded verb can become the subject of the matrix sentence including the potential suffix -(rar)e. The agent Yamada in (la), the theme yasai v̀egetables' in (lb), the instrumental hootyoo 'kitchen knife' in (1c), the locative Tazawako T̀azawa lake' in (1d), and the possessor of the theme syatu 'shirt' in (I e) are subjectivized in these perfectly grammatical sentences.' These phenomena seem to fall under the so-called Case Alternation, though its traditional notion does not include all of them because the alternations between nominative and oblique cases have rarely been 'Nakamura: Department of Foreign Languages, Japan Maritime Safety Academy, 5-1, Wakaba-cho, Kure-shi, Hiroshima, Japan. E-mail: nalcamura@msa.ac.jp. Fujita: Common Subject Division, Muroran Institute of Technology, 27-1, Mizumoto-cho, Muroran-shi, Hokkaido, Japan. E-mail: t-fujita@muroran-it.acjp. 2 We omit other possible case alternations in the sentences in (1) for brevity. This constructions, as usual stative sentences in Japanese, allow multiple nominative NPs to co-occur in one sentence. Thus, in (lc), the object yasai 'vegetables' also can be marked with nominative, etc."]},{"title":"172","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 172-183 dealt with in the literature of Japanese linguistics. We try to give a unified account of all the case alternations observed in (1) from a semantic point of view, adopting the theory of properties and predication proposed by Chierchia (1984, 1985) and Chierchia & Turner (1988), among others. This approach also enables us to show that alternations between genitive and other cases under nominalization can be dealt with in the same manner as those between nominative and other cases in matrix sentences."]},{"title":"2. POTENTIAL CONSTRUCTIONS IN JAPANESE","paragraphs":["The potential constructions are projected from the complex verbs consisting of verb stems and the potential suffix -(rar)e. The class of base verbs are restricted to unergatives and transitives. For example, -(rar)e does not attach to the unaccusative mawar- 'turn round' while it can attach to the unergative mcrwar- 'call at', as shown in (2):","(2) a. *Kono koma-wa yoku mawar-e-ru. This spin\\twell turn-around-CAN-PRES 'Lit. This spin can turn around well.'","b. Watasi-wa kaeru-totyuu\\tYamada-no ie-ni\\tmawar-e-ru. I\\t-TOP home-on.the.way Yamada-GEN home-TO stop.at-CAN-PRES 'I can stop at Yamada's home on the way home.' Though the morphological form of the potential suffix resembles that of the passive suffix and they are said to be historically related, they show quite different syntactic behaviors. The derived subject, not the suppressed agent, in the passive can act as an antecedent of the subject-oriented anaphor zibun 'self and agree with the verb form indicating subject honorification, whereas the potential subject often lacks these properties. Observe the following contrast in (3) (the boldfaced phrases indicates agreement):","(3) a. Senseirga kono syatu-o\\tgo jibun;-de o-arai-ninar-u. teacher-NOM this shirt-ACC Hon-self-BY HON-wash-become-PRES 'The teacher washes this shirt by himself.'","b. *Kono syatu-ga (senseirni(yotte)) go-jibun;-de o-araw-are-ninar-u. this shirt-NOM teacher-BY HON-self-BY HON-wash-PASS- become-PRES 'This shirt is washed by the teacher.'","c. Kono syatu-ga\\t(sensei-ni)\\tgo-jibun;-de o-arai-ninar-e-ru. This shirt-NOM teacher-DAT HON-self-BY HON-wash-HON-CAN-PRES 'This shirt can be washed by the teacher.' In the active (3a), the nominative NP sensei-ga 'teacher' serves as the antecedent of jibun 'self and manifests agreement with the honorific verbal form, while the agent in the passive (3b) lacks these features. The potential construction, as in (3c), can always involve jibun and the honorific form, which should be taken to show agreement with the agent of a base verb even if it does not show up overly. Notice that the agent of the base verb araw 'wash' is not suppressed in (3c). Assuming that an implicit agent occupies the subject position, i.e., [SPEC, VP], of a base verb the structure of potential sentences would be something like (4): 3 If the subject in a passive is replaced by an NP which refers to a person whom the speaker considers to be worthy of respect, it can become the antecedent of zibun and agree with the honorific verbal form, as shown in (i): (i) Sensei-ga\\tgo-jibun-no\\tie-no-mae-de dareka-ni o-nagur-are-ninar-ta.","teacher-NOM HON-self-GEN house-in.frontof someone-BY HON-hit-PASS- become-past","'The teacher was hit by someone in front of his house.' 41n Teramura (1982), potential constructions are classified into active and passive potential expressions. However, the evidence for non-suppression of the agent in this kind of constructions shows his classification to be wrong."]},{"title":"173","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 172-183 (4) [[NP;-ga] ([NP-ga]]) [vp PRO; ... V]-rare-Tns]\\t(i = j or i = arb) In the next section, we will briefly review some of previous analyses of the case alternation in potential sentences and point out some drawbacks in them."]},{"title":"3. PREVIOUS ANALYSES OF THE NOMINATIVE OBJECT IN POTENTIAL CONST-RUCTIONS","paragraphs":["Though there have been various proposals concerning treatments of the case alternation in potentials, we will not discuss them in any great detail here for reasons of space, so we will confine ourselves to sketching just a few of previous analyses. In the recent Japanese generative studies, many authors assume that Infl is responsible for assigning nominative case to the object in potential constructions. Consider the case alternations found in (1b), repeated here, and its underlying structure in (5b):","(5) a. Yamada-ga yasai-ga\\tCaber-are-ru. Yamada-NOM vegetables-NOM eat-CAN-PRES b. [Yamada-ga\\tInfl [vp [vp PRO yasai-ga taberrare]-ru] Takezawa (1987) argues that Infl in stative clauses may lower into the embedded clauses, labeled here as VP, in (5b) and assign nominative case to the embedded object under government. Dubinsky (1992) and Koizumi (1994) takes the position that the potential suffix optionally absorbs the case-assigning feature of base verbs and, as a result, the object moves up to the positions where its nominative case can be licensed, i.e., the VP-adjoined position (Dubinsky) or the specifier of TP (Koizumi). The discussions of the targets of movement are not relevant here. They have to posit some special landing sites for the nominative objects because they lack some characteristics of the ordinary subjects shown in Section 2. Before examining the shortcomings of their analyses, we briefly look at an evidence for the relevance of finiteness to nominative case assignment since many authors in Japanese linguistics have argued that nominative case is the default case which is not assigned by Infl (see Kuroda (1988), Saito (1983, 1985), Fukui (1986), Fukui & Nishigauchi (1992), Inoue (1988), among others). Consider the examples in (6) taken from Fukui & Nishigauchi (1992):","(6) a. John-no banana-no tabe-kata John-GEN banana-GEN eat-way 'how John eats a banana'","b. *John-ga\\tbanana-o\\ttabe-kata John-NOM banana-ACC eat-way","c. higaisya-norhigaisya-ga koros-are-kata victim-GEN /victim-NOM kill-Passive-way 'the way the victim was killed' (Fukui & Nishigauchi 1992, (4)) (Ibid. (8a)) Note that tabe-kata 'the way of eating' is not a compound word formed in the lexicon because the nouns kata, yoo or zama 'way, manner' can be attached to any kind of verbs and allow passivization in complements, as in (6c). The reason for ungrammaticality of (6b) and (6c) with nominative NPs should be attributed to the lack of Tense in these constructions. 5","Incidentally, head nouns are responsible for genitive case assignment. Consider the examples below:","(i) a. Yamada-gal-no\\teigo-o\\thanasu-koto-o\\tsitte-ru-ka? Yamada-NOM/-GEN English-ACC speak-PRES-fact-ACC know-PRES-Q 'Do you know that Yamada speaks English?'","b. Yamada-gat-no\\teigo-o\\thanasu kadooka-o sitte-ru-ka? Yamada-NOM/-GEN English-ACC speak whether-ACC know-PRES-Q 'Do you know whether Yamada speaks English?' 174 Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 172483 Let us turn to the problems of the previous analyses of nominative objects in potential constructions. They cannot not deal with the kinds of case alternations between nominative and oblique cases, as exemplified in (1). In Takezawa' analysis, the stative Infl should lower down to assign nominative case to adjuncts. According to Koizumi, embedded adjunct occupying various verb modifying positions should raise to the specifier position of Tense. How may this kind of movement be admitted in the current syntactic theory? Under Dubinsky's approach, the movement of adjuncts to a VP-adjoined position might be possible because it will form an ordinary A'-chain but nominative case assignment to a VP-adjoined position itself is somewhat ill-founded. Furthermore, the so-called nominative-genitive"]},{"title":"(ga-no)","paragraphs":["conversion phenomena will pose more serious problems for their accounts. It should be noted here that all (potential) nominative NPs in potential constructions can be converted to genitive NPs under nominalization. For the sake of simplicity, let us take only the nominalization via attachment of the formal noun"]},{"title":"koto","paragraphs":["'fact' to predicate phrases. Observe the examples in (7):","(7) a. Yamada-no yasai-no/-ga/-o \\ttaber-are-ru-koto Yamada-GEN vegetables-GEN/-NOM/-ACC eat-CAN-PRES-fact 'the fact that Yamada can eat vegetables.'","b. kono hotyo-no/-gal-de\\tyasai-o\\ttayasuku kir-(ar)e-ru-koto this kitchen.knife-GEN/-NOM/-BY vegetables-ACC easily cut-CAN-PRES-fact 'the fact that (We) can cut vegetables easily by this kitchen knife.' If the stative Infl lowers to assign nominative case in potential sentences, the corresponding 'stative D', if any, should also lower to assign genitive case to arguments and non-arguments under nominalization, though such a process seems to be difficult to implement within a theory of grammar. Why can a VP-adjoined position be transparent to government from D across Infl (and other categories)? Can the movement of embedded adjuncts to the specifier of the upper D be allowed in the current framework? Notice that Koizumi should require some position in a DP corresponding to [Spec, TP] which must be distinguished from the standard subject position, [Spec, AGRs]. We have to conclude that these analyses of case alternations in potential constructions are theoretically and empirically untenable. In the rest of the paper, we will explore a novel analysis of these problems from a semantic point of view."]},{"title":"4. The Notion of Properties and Nominative Assignment 4. 1. Property, Predication and Nominalization","paragraphs":["Chierchia (1984, 1985) argues that"]},{"title":"properties6","paragraphs":["have two modes of being: as propositional functions and as The subject in the embedded question in (ib) cannot be marked with genitive case because the embedded question, which is followed by the accusative marker o and behaves as if it were an object of"]},{"title":"sitte-ru","paragraphs":["'know', contains no head noun. Iida (1987) points out that a deverbal nominal may assign case in the same way as the corresponding verb 'when it is","concatenated with a lexical item which is assumed to have an aspectual feature' (Iida 1987:93). Consider the examples","below:","(ii) a. John-ga Ainugo-o\\tkenkyuu-s-uru.","John-NOM Ainu-language-ACC research-DO-PRES.","J̀ohn researches Ainu language.' b. John-go Ainugo-o kenkyuuN chuu","John-NOM Ainugo-ACC research mid","ẁhile John is researching Ainu language now' (Iida 1987: (8)) c. 'John-ga Ainugo-o kenlcyuu-siv chuu","John-NOM Ainugo-ACC research-DO mid \\t(Iida 1987: (8))","The subject and object of the deverbal nominal kenkyuu r̀eseach' can also be marked with genitive case. The","ungrammaticality of (iic) is due to the existence of the light verb sum 'do' and, thus, the nominative and accusative case on","the arguments in (iib) should taken to be assigned by the compound consisting of the nominal head and the suffix chuu.","For further discussions concerning the relationship between case-assignment and an aspectual feature, see Iida (1987).","6 In the formal theory of semantics, the notion property is usually defined, roughly, as a function from worlds into sets. The exact nature of what this term means, however, is not relevant to our discussion. We will simply assume here that"]},{"title":"property 175","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 172-183 individual- images of propositional functions. The former, intrinsically incomplete, must be saturated by subject arguments, while the latter can either be independently referred to like names or indirectly take arguments with the help of some predicator. The semantic notion of properties strictly correspond to the syntactic category VP (the VP = P(roperty) Hypothesis). He also associates this notion of property with morphological/syntactic case as follows: (8) Propositional functions assign case.\\t(Chierchia 1985: 437) Since we limit ourselves to subjectivization in Japanese potential constructions, let us simply take (8) to mean that finite predicate phrases assign nominative case to external arguments which they are predicated of. In Chierchia's property theory, VPs as property-denoting expressions can be always nominalized as well as Ss denoting propositions. Nominalized propositional functions may take arguments only if an appropriate predicator recovers their ability as propositional functions (i.e., 'denominalizes' nominalized verb phrases). Here let us concentrate on nominalized predicate phrases containing the formal noun koto 'fact' or 'thing', as in (9):","(9) [Uso-o tuk-u-koto]-wa\\tyoku-nai. lie-ACC tell-PRES-fact-TOP good-not-PRES. 'Telling a lie is not good.' We will refer to the formal noun koto as a kind of nominalization operator indicated by Note here that finite predicate phrases as inherent propositional functions must be completed by the subject, while nominalized predicate phrases, as shown in (9), may show up without a 'subject' because of their status as individual. The nominalized VP in (9) simply refers to the property of telling a lie. Let us assume further that the genitive case marker no serves as apredication operator designated by the symbol","which recover propositional functions associated with nominalized predicate phrases. The translation of no would be indicated as in (10) and if the nominalized VP in (9) takes a subject, as in Yamada-no [uso-o tuk-u-koto] 'Yamada's telling a lie', the derivation would be something like (11): (10) no :--- kxky[̂'y(x)] (11) Yamada-no uso-o tuku-koto, NP: tuku'(uso')(yamada') Yamada-no, NP/NP:\\tuso-o tuku-koto, NP: X.x[̂-)(Yamada')]","\\t rluku1(uso') We will examine the phenomena involving the so-called ga-no conversion in potential constructions more closely in Section 4. Turning to case alternations in potential constructions, suppose that nominative case is licensed as the default case in that it is assigned to an argument which has or instantiates the property denoted by a finite predicate phrase. A very preliminary semantic condition on the predication relation holding between a ga-marked NP and the residue of the finite clause (which we have referred to as the predicate phrase) might be written as in (12):","(12) An individual or individuals designated by a ga-marked NP must be a member or members of the set denoted by the (finite) predicate phrase (or the residue of the clause). Since, as well known, multiple ga-marked NPs may show up in a stative sentence in Japanese, (12) must be allowed to apply recursively. There should be some device in which a proposition (0-place propositional function), which has already been saturated by one ga-marked NP, can be reinterpreted as a property denoting is 'whatever verb phrases (or, finite predicate phrases in our term) are semantically associated with,'(Chierchia 1985: 417) and that the meaning of predicate phrases should be interpreted compositionally."]},{"title":"176","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 172-183 expression (one-place propositional function), though we cannot formulate this device properly here! Assuming this kind of type-free theory of properties proposed by Chierchia, let us examine how nominative NPs with various semantic roles can be licensed in potential constructions in the next section."]},{"title":"4. 2. Licensing of Nominative NPs in Potential Constructions","paragraphs":["Observe some of the examples in (1), repeated below:","(13) a. Yamada-ga yasai-ga /yasai-o\\ttaber-are-ru. Yamada-NOM vegetables-NOM/vegetables-ACC eat-CAN-PRES 'Yamada can eat vegetables.'","b. Kono hootyoo-ga/hootyoo-de\\tyasai-o\\ttayasuku kir-(ar)e-ru. this kitchen.knife-NOM/kitchen.knife-BY vegetables-ACC easily cut-CAN-PRES '(We) can cut vegetables easily by this kitchen knife.'","c. Tazawako-ga/Tazawako-de\\tkoi-o\\ttakusan tur-(ar)e-ru. Tazawa-lake-NOM/Tazawa-lake-IN carps-ACC a lot catch-CAN-PRES '(We) can catch a lot of carps in Tazawako. What the nominative NPs in (13) have in common is that, whatever semantic roles they may receive from base verbs, they are the arguments to which the properties that the predicative expressions denotes should be attributed. In (13a), for example, the subject Yamada has the property of being able to eat vegetables and in (13b), hootyoo 'kitchen knife' has the property that someone can cut vegitables easily by means of it. Let us assume that the suffix -(rar)e is subcategorized for VPs containing gaps. Gaps may freely occur anywhere within embedded VPs, including possessor positions of arguments or non-arguments but at least one gap (including a lower subject) must be present in a VP because the predicate phrase resulting from the amalgamation of a VP and the suffix -(rar)e must be an unsaturated function. For instance, the lower VP in (13a) with the nominative objsect should contain a gap in the original object position (thus, [[vp e tabe-] –rare]). In the same manner, when the instrumental and locative arguments are marked with nominative case in (13b) and (13c), the embedded VPs should contain gaps in the adjunct positions reserved for the instrumental and 'It remains as an open question why a proposition, which should already have been saturated by an appropriate argument, is allowed to take another argument (i.e. subject) as a propositional function only in stative sentences in Japanese and other languages having similar devices. A lot of Japanese linguists have assumed devices such as subjectivization proposed in Kuno 1973 for the so-called multiple subject constructions, which proposes to 'change the sentence-initial NP-no to NP-ga' (Kuno 1973). As seen from the examples in (1), however, subjectivizable NPs are not restricted to the sentence-initial NPs and to the possessors of nominative NPs. Observe the sentence below: (i) Tazawakoi-ga\\tunagi-o/unagi-ga [\\tnakasu-atari-de tor-e-ru. \\t","Tazawako-NOM eel-ACC/eel-NOM \\tsandbank-around catch-CAN-PRES","Ỳou can catch eels around the sandbank in Tazawako.' The subject Tazawako can be said to be the possessor of nakasu 'sandbank' which are followed by the locative postposition de 'in' and the object unagi 'eel' intervenes between these phrases. A wide range of case alternations observed in potential constructions, therefore, cast doubt on the justification of implementing devices such as subjectivization or possessor raising within a theory of grammar. 8 Strictly speaking, there is a difference in control interpretations between potential sentences with agent subjects and those with non-agent subjects. In the former cases, some control relation appears to hold between the overt subject and PRO occupying the specifier position of an embedded VP (see the structure in ,(14)). It is not clear, however, whether the relation between them is of obligatory control or not. The meaning of the sentence in (ia) seems to be ambiguous between (ib) and (ic): (i) a. Taroorga\\tHanalcorga [PRO ek nikum-](ar)e-nai.","Taroo-NOM Hanako-NOM\\thate- CAN-not-PRES","b. Taroo cannot hate Hanako. (i = k)","c. Hanako cannot hate Taroo. (j = k) Notice that (ia) is not a scrambling case. When Taroo is taken to be the controller of the embedded PRO as in (i), the control relation does not seem to be local."]},{"title":"177","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 172-183 locative arguments. When the subjects with appropriate semantic contents appear in nominative case, the gaps will be associated with them via predication under the semantic condition (12).9 We might indicate the interpretation of potential verbs as in (14) where 4 indicates the meaning of a base verb: (14) X.4),\\tXxn[rare (4),\\tx,)] (Rar)e may be taken to be the suffix which makes a given gap (or gain) of a base verb the external argument(s) of the complex potential verb. If the object is marked with nominative case in (13a), the theme is interpreted as a variable in the process of the formation of a predicate phrase and the verbal complex tabe-rare 'can eat' is formed first. Then, the property which the resulting VP denotes will be attributed to the nominative objsect yasai-ga 'vegetables,' and the proposition roughly means yasai-ga taber-are-ru 'vegetables are edible.' The proposition may be reanalyzed as a property if the verbal complex has another variable (including PRO in the embedded subject) and be predicated of the higher subject Yamada (in this case, this means some control relation holding between PRO and Yamada). The same is true of the other examples. The predication relation in (13b) and (13c) may be shown in the abbreviated forms in (15a) and (15b), respectively:","(15) a. kono hootyoo E kir-(ar)e-ru(PRO, yasai, ...) b. Tazawako e tur-(ar)e-ru(PRO, koi, ...) (15a) means roughly that the entity designated by kono hootyoo 'this kitchen knife' is a member of the set of things which makes it possible to cut vegetables easily and (15b) means that the entity designated by Tazawako 'Tazawa lake' is one of the places where people can catch a lot of carp. The formation of complex potential verbs does not seem to be a lexical process because the lexical process must uniquely determine a semantic role of a stem which becomes an external argument of a derived complex predicate. Take the process forming adjectives consisting verb stems and the suffix –able in the lexicon in English. The external argument of the compound adjective eat-able, for instance, must be the theme of the verb eat and the agent (which should be suppressed) or arguments bearing any other role can never appear as its subject, putting aside a slightly different implication in the derived adjective (̀The food isn't eatable', but 'John isn't eatable of the food, * The fork isn't eatable...). In potential constructions, however, NPs with any thematic role or even those without any semantic relation with a base verb are allowed to occur as the matrix subject. Remember that the external argument of a base verb is not suppressed, as discussed in Section 2. We believe that potential constructions have the structures containing gaps and that gaps are encoded into VPs in syntax. If they contain multiple nominative NPs, the multiple-predication should be involved. Gaps in lower VPs will be associated with the appropriate subjects in semantics, obeying the semantic condition in (13)."]},{"title":"5. NOMINATIVE-GENITIVE CONVERSION UNDER NOMINALIZATION","paragraphs":["According to the theory of property and predication proposed in Chierchia (1984, 1985) and Chierchia & Turner (1988), expressions denoting properties (actions) and propositions (states of affairs) can be nominalized. This is supported by the fact that the formal noun koto 'fact' can be attached to predicate phrases as in uso-o tuku-koto 'telling a lie' and to clauses as in Taroo-ga uso-o tuku-koto 'the fact that Taroo tells a lie'. We have already argued that nominalized VPs may take arguments by virtue of the genitive case marker no. This predicts that when multiple nominative NPs are allowed to occur in stative sentences such as potential constructions, all of them can be converted to genitive NPs if the predicate phrases are nominalized with koto. Observe the following contrast in grammaticality with respect to case alternations in (16): 9 When an appropriate subject is not present in a sentence, the gap may remain free in the predicate phrase. Potential constructions often allow the unspecified object deletion, as illustrated in (i), even if base verbs do not allow this process in simple sentences: (i) Kono ike-ga\\tyoku pro tur-e-ru.","this pond-NOM a lot\\tcatch-CAN-PRES","'You can catch a lot (of fish) in this pond.'"]},{"title":"178","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 172-183","(16) a. Yamada-no *mirulcu-normiruku-ga/mirulcu-o nom-u-koto Yamada-GEN milk-GEN/ milk-NOM/ milk-ACC drink-PRES-fact 'the fact that Yamada drinks milk'","b. Yamada-no miruku-no/miruku-ga/miruku-o nom-(ar)e-ru-koto Yamada-GEN milk-GEN/milk-NOM /milk-ACC drink-CAN-PRES-fact 'the fact that Yamada can drink milk' Notice that if an NP cannot be marked with nominative case, then it also cannot be marked with genitive case. The rule converting ga to no under nominalization ignores the syntactic features of the subject, such as the ability to act as an antecedent of the reflexive pronoun zibun and to agree with a honorific verb. It is only sensitive to the possibility of ga-marking. This automatically follows from our proposal that the nominative ga and genitive no are assigned to NPs which saturate the (nominalized) predicative expressions. Assuming that the predicate phrases containing gaps, projected from potential compound verbs, occur as property denoting expressions, we can straightforwardly show the derivation of (16b) with the genitive object as in (17):","(17) Yamada-no miruku-no nom-(ar)e-ru-koto, NP: n̂om(ar)e-ru'(miruku)(Yam.ada')","miruku-no-nom-(ar)e-ru-koto, NP: n̂om-(ar)e-ru'(nirulaf) Yamada-no, NP/NP:\\tmiruku-no, NP/NP:\\tnom-(ar)e-ru-koto, NP: Xx[̂-/x(Yamada')]","\\t kx[̂'x(miruku')]\\t'nom-(ar)e-ru As expected, all the nominative NPs with various semantic roles in potential sentences may be freely converted to genitive case under nominalization, as shown in (18):","(18) a. kono hotyo-no\\tyasai-no\\ttayasuku kir-(ar)e-ru-koto. this kitchen.knife-GEN vegetables-GEN easily cut-CAN-PRES-fact 'the fact that (We) can cut vegetables easily by this kitchen knife.'","b. Tazawako-no\\tkoi-no\\ttakusan tur-(ar)e-ru-koto Tazawa-lake-GEN carps-GEN a lot catch-CAN-PRES-fact 'the fact that (You) can catch a lot of carp in Tazawako.","c. kono syatu-no eri-no\\taraw-e-ru-koto this shirt-GEN collar-GEN wash-CAN-PRES-fact 'the fact that the collar of this shirt can be washed' Notice again that if the VPs in (18) does not contain the potential suffix, all the boldfaced NPs cannot be marked with genitive case as well as nominative case. The suffix -(rar)e allows gaps to remain in embedded VPs (and in fact, requires at least one gap there). The nominative (and genitive) NPs and variables in embedded VPs should be checked against their semantic contents via predication. Our analysis can cover all the case alternations in potential constructions and their nominalizations we have observed up to this point, whereas the analyses in generative syntax sketched above would confront difficulty in explaining them in a unified manner."]},{"title":"6. THE INTERPRETATION OF DAKE 'ONLY'","paragraphs":["We have argued that nominative and genitive case indicates that NPs marked with these cases have the properties which the (nominalized) predicate phrases denote. On the other hand, if arguments are marked with their original cases, they will be interpreted as constituents forming VPs as property-denoting expressions. There seems to be sharp distinctions in interpretations with respect to case marking. We bring an evidence for"]},{"title":"179","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 172483 this here. Tada (1992) observed the interesting facts concerning the interaction between case assignments and scope interpretations in potential sentences. Consider the contrast shown in (19):","(19) a. John-ga migime-dake-o\\ttumur-e-ru. John-NOM right-eye-only-ACC close-CAN-PRES 'John can close only his right eye.'","\\t (can > only, only > 'scan)","b. John-go migime-dake-ga\\ttumur-e-ru. John-NOM right-eye-only-NOM close-CAN-PRES \\t(only > can, *can > only) He observes that, when the object migime-dake 'only his right eye' is marked with accusative case in (19a), it has narrow scope reading with respect to the potential verb -(rar)e, whereas the nominative object in (19b) has scope over the potential verb. The point is that the nominative object in (19b) cannot take narrow scope with respect to -(rar)e. Koizumi (1994), assuming Tada's observation, argues that the nominative object has to raise to the specifier of the matrix Tense to c-command the potential verb, as seen in Section 3. According to the theory of property and predication, an accusative NP is one of elements constituting a (finite) verb phrase whereas a nominative NP is the argument to which the property denoted by a verb phrase should be attributed. The nominative object in (19b), therefore, must always take wide scope with respect to -(rar)e in the predicate phrase. Intuitively speaking, (19b) means that John's right eye is only one member of the set denoted by the predicate phrase tumur-e-ru 'things (eyes) which one can close'. The nominative-oblique case alternations observed above, as expected, show the same behaviors concerning interpretations of quantified NPs. The NP boorupen 'ball pen' marked with oblique case in (20a) is ambiguous between narrow scope and wide scope readings with respect to the potential verb, whereas, when it is marked with the nominative ga as in (20b), it always takes wide scope reading.","(20) a. Boorupen-dake-de rippana tegami-ga/-o \\tkak-(ar)e-ru. ball-pen-only-BY\\tgood\\tletter-NOM/-ACC write-CAN-PRES '(You) can write a good letter only by a ball pen.'\\t(can > only, only > can) \\t","b. Boorupen-dake-ga rippana tegami-gal-o\\tkak-(ar)e-ru. ball-pen-only-NOM good letter-NOM/-ACC write-CAN-PRES (only > can, 'can > only) While boorupen-dake-de 'only by a ball pen' in (20a) may have wide scope or narrow scope with respect to (rar)e, (20b) allows only the wide scope reading of boorupen, meaning 'we cannot write a good letter without a ball pen.' In this case, the predicate phrase rippana tegami-o kak-(ar)e-ru refers to the singleton, which contains only one member, boorupen. As expected from the arguments up to this point, genitive case paralles nominative case with regard to scope interactions of quantifiers and the potential verb. Consider the following examples in (21):","(21) a. John-no migime-dake-no tumor-e-ru-koto John-GEN right-eye-only-GEN close-CAN-PRES-fact 'the fact that John can close only his right eye.' \\t","b. boorupen-dake-no rippana tegami-no/-gal-o\\tkak-(ar)e-ru-koto ball-pen-only-GEN good letter-GEN/NOM/ACC write-CAN-PRES-fact 'the fact that (You) can write a good letter only by a ball pen.' wKoizumi (1994) notes that (18a) with the accusative object may have also the object-wide scope reading, and this seems correct. It remains an open question why NPs marked with accusative or oblique case are ambiguous between wide and narrow scope readings. \"The verb tumur 'close' mostly takes as complement the nouns referring to eyes or eyelids."]},{"title":"180","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 172-183 The quantified NPs, migime-dake and boorupen-dake in (21) may show up in their original cases and then, their scope interpretations are ambiguous exactly in the same manner as those in the sentences in (19a) and (20a). The interpretations of quantified NPs marked with genitive case in (21), however, are unambiguous. These genitive NPs must take wide scope over the potential suffix -(rar)e. Our account of nominative and genitive case assignment can straightforwardly explain this parallelism between scope interpretations of quantified arguments. Notice that the previous analyses cannot cover all the syntactic and semantic behaviors of NPs showing various kinds of case alternations in potential sentences. We believe that the functional categories I and D alone do not assign nominative or genitive case to subjects. Though the notion of finiteness is relevant for case assignment, the two cases should be taken to be the default cases in that they are licensed with respect to the notions of properties and predication."]},{"title":"7. CONCLUDING REMARKS","paragraphs":["This paper has examined a wide range of phenomena involving case alternations in potential sentences and their nominalizations along the lines of the theory of properties and predication. To make clear the characteristics of this kind of constructions, compare the nominative NPs in the passive and potential clauses schematized as in (22):","(22) a. Passive:\\tX-ga (Y -ni) V -(r)are-ru. b. Potentials: X-ga (Y -ga) V -(rar)e-ru. In the passive in (22a), the semantic role of the nominative X-ga can be determined uniquely, usually the theme. The derived subject can behave as an antecedent of the reflexive zibun and agree with the honorific verb forms, whereas the demoted agent cannot. The semantic role(s) of the nominative NPs in the potential clause in (22b), on the other hand, cannot be determined from the surface form. Ga-marked NPs may bear any semantic role including the possessor of arguments and adjuncts of base verbs. More than one nominative NP may freely occur in a potential sentence and the embedded agent is never suppressed, retaining the status as subject whether it appears overtly or covertly. We have argued that nominative case is assigned to the arguments which saturate propositional functions denoted by finite predicate phrases. The potential suffix -(rar)e is subcategorized for an infinitive VP containing a gap (or gaps) and the resulting predicative expression refers to some property (or evaluation) of the referent(s) of a gap or gaps. A nominative NP with an appropriate semantic content can be associated with the corresponding gap via predication and the checking between a nominative NP and a gap may be recursively carried out if a potential construction involves multiple nominative NPs and multiple gaps. The genitive case marker no serves to recover the propositional functions of nominalized predicate phrases. Derived nominals involving double case marking of adjuncts as in (23b) will provide support for this assumption.","(22) a. Taroo-ga Oosaka-kara Tokyo-e ryokoo-si-ta. Taroo-NOM Oosaka-FROM Tokyo-TO travel-DO-PAST 'Taroo traveled from Osaka to Tokyo.'","b. Taroo-no [Osaka-kara Tokyo-e]-no\\tryokoo Taroo-GEN America-FROM Tokyo-TO-GEN travel 'Taroo's travel from Osaka to Tokyo.' In derived nominals, most, if not all, adjuncts must be marked by both the oblique and genitive case markers. In (23b), the second no enables the conjoined adjuncts to attach to the derived nominal ryokoo 'travel' which cannot take them directly because of its status as individual. Assuming properties denoted by predicate phrases as a primitive notion, we can deal with the full range of relevant data showing the striking parallelism of nominative and genitive NPs in potential constructions in Japanese. On the other hand, we will leave open the question of why and how gaps in embedded clauses are licensed in this kind of constructions for future research."]},{"title":"181","paragraphs":["Language; Information and Computation (PACLIC12), 18-20 Feb, 1998, 172-183"]},{"title":"ACKNOWLEDGEMENTS","paragraphs":["Some of this material was presented afthe 114th Conference of the Linguistic Society of Japan, Tokyo, 1997; thank the audicence as well as three reviewers for their valuable comments and encouragement. REFERENCES 1. Abe, Yasuaki (1992). Nihongo-niokeru Hi- 0 -Syugo-to Zokusei-no Kaisyaku-nituite. In K. Inoue, ed.,","Gengo-riron-to Nihongo-Kyooiku-no Soogo-kasseika, Kagaku-kenkyuu-hojoseika-hookokusyo, Tokyo, 171-","183. 2. Bayer, Samuel (1990). Tough Movement as Function Composition. In The Proceedings of the Ninth West-","Coast Conference on Formal Linguistics (WCCFL 9), Stanford Linguistic Association, 29-42. 3. Chierchia, Gennaro (1984). Topics in the Syntax and Semantics of Infinitives and Gerunds, Ph. D.","dissertation, University of Massachusetts. 4. Chierchia, Gennaro (1985). Formal Semantics and the Grammar of Predication. Linguistic Inquiry 16, 417-","443. 5. Chierchia, Gennaro (1995). Individual-Level Predicates as Inherent Generics. In G. Carlson and F. J.","Pelletier, eds. The Generic Book, The University of Chicago Press, 176-233. 6. Chierchia, Gennaro; and Raymond Turner (1988). Semantics and Property Theory. Linguistics and","Philosophy 11, 261-302. 7. Chomsky, Noam (1977). On Wh-Movement. In P. W. Culicover, T. Wasow & A. Akmajian, eds. Formal","Syntax, Academic Press, 71-132. 8. Dowty, David (1982). Grammatical Relations and Montague Grammar. In P. Jacobson and G. K. Pullum","(eds.), The Nature of Syntactic Representation, D. Reidel, 79-130. 9. Dowty, David (1985). On Recent Analysis of the Semantics of Control. Linguistics and Philosophy 8, 291-","331. 10. Dowty, David (1988). Type Raising, Function Composition, and Non-Constituent Conjunction. In R. T.","Oehrl, et al. eds., Categorial Grammars and Natural Language Structure, D. Reidel, 17-34. 11. Dubinsky, Stanley (1992). Case Assignment of VP-Adjoined Positions: Nominative Objects in Japanese.","Linguistics 30, 873-910. 12. Ijima, Masahiro (1991). Kanoo-koobun-no Tasooteki-Bunseki. In Y. Nita, ed., Nihongo-no Boisu-to","Tadoosei, Kuroshio Publishers, 149-189. 13. Ishikawa, Akira (1985). Complex Predicates and Lexical Operations in Japanese. Ph. D. Dissertation,","Stanford University. 14. Fukui, Naoki (1986). A Theory of Category Projection and its Application, Ph. D. dissertation, MIT. 15. Fukui, Naoki; and Taisuke Nishigauchi (1992). Head-Movement and Case-Marking in Japanese.Journal of","Japanese Linguistics 14, 1-35. 16. Heycock, Caroline; and Lee, Young-Suk (1990). Subjects and Predication in Korean and Japanese. In H.","Hoji, ed., Japanese/Korean Linguistics, CSLI, 239-253. 17. Iida, Masayo (1987). Case-Assignment by Nominals in Japanese. In M. Iida, S. Wechsler, and D. Zec,","eds., .Working Papers in Grammatical Theory and Discourse Structure, CSLI, 93-138. 18. Inoue, Kazuko (1988). Syugo-no Imi-yakuwari-to Kaku-hairetu. In S. Kuno & M. Shibatani, eds.,","Nihongo-gaku-no Sintenkai, Kuroshio Publishers, 79-101. 19. Jacobson, Pauline (1992). The Lexical Entailment Theory of Control and the Tough-Construction. In","Ivan Sag and Anna Szabolcsi, eds. , Lexical Matters, Center for the Study of Language and Information","(CSLI), 269-299. 20. Kitagawa, Yoshihisa (1989). Deriving and Copying Predication. Proceedings of the North Eastern","Linguistic Society 19, GLSA, University of Massachusetts, 279-300. 21. Koizumi, Masatoshi (1994). Nominative Objects: The Role of TP in Japanese. In H. Ura & M. Koizumi,","eds. ,MITWPL 24: Formal Approaches to Japanese Linguistics 1, 211-230. 22. Kuno, Susumu (1973). The Structure of the Japanese Language. MIT Press. 23. Kuroda, S-Y. (1986). Movement of Noun Phrases in Japanese. In T. Imai and M. Saito, eds., Issues in","Japanese Syntax, Foris. 229-271. 24. Kuroda, S-Y. (1988). Whether We Agree or Not: A Comparative Syntax of English and Japanese.","Linguisticae Investigationes 12, 1-47. 25. Miyagawa, Shigeru (1989). Structure and Case Marking in Japanese. Academic Press. 26. Miyagawa, Shigeru (1993). LF Case-checking and Minimal Link Condition. In C. Phillips, ed., MITWPL"]},{"title":"82","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 172-183","19: Papers on Case & Agreement II, 213-254. 27. Morikawa, Masahiro (1993). A Parametric Approach to Case Alternation Phenomena in Japanese. Hituzi","Syobo. 28. Nakai, Satoru (1980). A Reconsideration of Ga-No Conversion in Japanese. Papers in Linguistics 13, 279-","320. 29. Saito, Mamoru (1983). Case and Government in Japanese. In The Proceedings of the Second West-Coast","Conference on Formal Linguistics (WCCFL 2), Stanford Linguistic Association, 247-259. 30. Saito Mamoru (1985). Some Asymmetries in Japanese and their Theoretical Implications. Ph. D. disserta-","tion, MIT. 31. Shibatani, Masayoshi (1978). Nihongo-no Bunseki. Taisyuukan. 32. Shibatani, Masayoshi; and Cotton, Chiseko (1976-77). Remarks on Double-Nominative Sentences. Papers","in Japanese Linguistics 5, 261-277. 33. Shirai, Ken-ichiro (1982). Exhaustive-Listing Ga Constructions. Linguistic Research 1, Kyoto University,","79-93. 34. Shirai, Ken-ichiro (1985). Keishiki-Imiron-Nyuumon: Gengo, Ronri, Ninchi-no Sekai. Sangyo Tosyo. 35. Svenonius, Peter (1995). Predication and Functional Heads. In The Proceedings of the Fourteenth West-","Coast Conference on Formal Linguistics (WCCFL 14), Stanford Linguistic Association, 493-507. 36. Tada, Hiroaki (1992). Nominative Objects in Japanese. Journal of Japanese Linguistics 14, 91-108. 37. Takezawa, Koichi (1987). A Configurational Approach to Case-marking in Japanese. Ph. D. dissertation,","University of Washington. 38. Teramura, Hideo (1982). Nihongo-no Sintakusu-to Imi. Kurosio Publishers. 83"]}]}