{"sections":[{"title":"","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 1-9"]},{"title":"Ettehkey 'how' As a Small Clause Head","paragraphs":["Daeho Chung Seoul National University cdaeho@plazal.snu.ac.kr"]},{"title":"Abstract","paragraphs":["WH-words are not uniform in their syntactic behaviors. Adjunct WH-words such as HOW and WHY are said to be more restricted in their distribution than argument WH-words such as WHO and WHAT. It is observed, however, that HOW in some East Asian languages behaves more like argument WH-words and does not display ECP effects. In this paper, I try to account for the HOW vs. WHY difference in Korean. First, I briefly review two previous attempts. T. Chung (1991) ascribes the difference to the positional variance: ettehkey 'how' is generated VP-internally, whereas way 'why' is generated in an IP(AgrP)-adjoined position, i.e., above subject. The trace of island internal ettehkey, but not of way, satisfies the ECP under the assumption that subject (or INFL) is a (special) antecedent governor for adverbs, which he motivates based on the fact that adverbs agree with subject in number and may take plural morpheme tul when subject is plural. Now the trace of ettehkey, but not of way, is antecedent governed by subject due to the hierarchical (c-command) relation. Another attempt was made by D. Chung (1996), who proposes to decompose ettehkey into etteh-ki-ey and attributes the lack of the ECP effects to the nominal feature associated with the nominalizer ki contained in ettehkey. Both approaches fail when more data is considered. Crucially, it will be shown that etteh, the main part of ettehkey, is a predicate, (i.e., it is neither an adjunct nor a nominal element,) but it does not show the ECP effects. I extend the predicate analysis to ettehkey, analyzing it as the predicate head of an adjectival small clause. Now the question is why predicate WH-words do not show the ECP effects like argument WH-words. I provide a theta-theoretic account under the assumption that the theta-identification between a predicate and its arguments is a bilateral relation in the sense that they identify or restrict each other. Thus, ettehkey/etteh, as predicates, are theta-identified and do not show the ECP effects. In contrast, way, as a pure adjunct, is not theta-identified and does show the ECP effects. As for the ECP effects that English how displays, I suppose that it is not a predicate but a pure adjunct, based on the observation that adjectival small clause heads are replaced by what, but not by how, in WH-questions or echo-questions."]},{"title":"1. Introduction","paragraphs":["As discussed by various linguists including Huang (1982), Chomsky (1986), Aoun (1986), Aoun and Li (1993), and Lasnik and Saito (1984), it is a notorious fact that WH-words do not behave uniformly with respect to their syntactic behaviors, especially when they appear in island contexts. What is generally agreed upon is that the so-called adjunct WH-words such as how and why in English and their counterparts in other languages cannot appear in syntactic islands (the ECP effects), whereas the so-called argument WH-words such as who and what in English and their counterparts in other languages are not restricted in such a way. Since Huang (1982) it is equally taken for granted that the same is true of WH-words in WH-in-situ languages such as Chinese and Japanese. Thus, WH-words like WHO and WHAT may reside within an island, but WH-words like HOW and WHY may not.","Such a dichotomy between HOW/WHY vs. other WH-words, however, does not fare well, when more extensive data is considered. As T. Chung (1991) observes, Korean WH-word ettehkey 'how,' as opposed to way ẁhy,' does not display island effects, as exemplified in (1) below:'","(1)\\ta. [ {ettehkey/*way} yoliha-n] koki-ka masiss-ni? how/why\\tcook-Adn meat-Nom tasty? Q̀ the meat that you cook how/why is tasty?' I A similar observation in Chinese and Japanese is made by some linguists. See Tang (1990), Tsai (1991, 1994), Lin (1992) for Chinese, and S. Watanabe (1995, 1996) for Japanese."]},{"title":"1","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 1-9","b. [koki-lul {ettehkey/*way) yoliha-myen] ssun mas-i \\tepseci-ni? meat-Acc how/why\\tcook-if\\tbitter taste-Nom disappear-Q Q̀ if you cook meat how, the bitter taste disappears?' Ettehkey appears in a relative clause in (la) and in a conditional clause in (lb). In contrast way is not allowed in such contexts.","In this paper, I try to account for why ettehkey and way behave differently with respect to island effects. First, I will briefly review two previous attempts to account for the difference, T. Chung's (1991) VP-adjunct analysis of ettehkey, and D. Chung's (1996) nominal analysis of ettehkey. Second, it will be shown that both approaches fail when more data is considered. Third, I propose to analyze ettehkey as the predicate head of a small clause and provide a theta-theoretic account of the syntactic difference between ettehkey and way. Finally, I make some speculation on the typological difference between ettehkey and its English counterpart how."]},{"title":"2. T. Chung's (1991) VP-adjunct Analysis vs. D. Chung's (1996) Nominal Analysis","paragraphs":["In this section,. I will briefly review T. Chung's (1991) and D. Chung's (1996) account for the fact that ettehkey, as opposed to way, does not display island effects. The lack of island effects is attributed to the hierarchical status that ettehkey takes in a clausal structure in T. Chung (1991), whereas it is to the categorial status of ettehkey in D. Chung (1996). Some specifics of the two approaches will be discussed below."]},{"title":"2.1. T. Chung (1991): A VP-adjunct Analysis of Ettehkey","paragraphs":["T. Chung claims that adverbs take different positions depending on their types. According to him, manner or instrumental adverbs are generated VP-internally, spatio-temporal adverbs are generated higher than manner or instrumental adverbs but still within VP, and causal adverbs are generated VP-externally. The schematic structure that he proposes is as follows: (2) \\t","\\t(= T. Chung 1991:244, his (11)) AgrP(=IP) Adv\\tAgrP (causal) V\\","Agr' \\t VP\\tAgr(=I) Spec.\\tV' \\t","Adv\\tV1' (Spatio-temporal) VP\\tV1 Spec\\tV2'","Adv V2 (manner/ instrumental)"]},{"title":"2","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 1-9 The manner/instrumental adverbs are taken as sisters of V2, spatio-temporal adverbs as those of V'1, and causal adverbs as adjuncts of AgrP.2","T. Chung (1991) attributes the difference between causal WH-adverbs vs. other WH-adverbs to Rizzi's (1990) conjunctive ECP formulation. 3 All of the three positions taken by adverbs seem to be head-governed: manner/instrumental adverbs by V2, spatio-temporal WH-adverbs by V1, and causal adverbs by Agr.4 No difference being revealed in the head government requirement, T. Chung attributes the difference between causal vs. all other adverbs to the antecedent government requirement. He claims that spatio-temporal and manner/instrumental adverbs satisfy the antecedent government requirement, whereas the causal adverb does not. He motivates this claim from the relative hierarchy between subject and adverbs supposed in (2) and the plural agreement between subject and adverbial elements. He resorts to the fact that any adverb can take a plural agreement marker tul if the subject of the sentence is plural, which was discussed by various linguists including Song (1975) and Kuh (1987):","(3) (= T. Chung's (16))","a. encey-tul o-ess-ni? when-P1 come-Pst-QE Ẁhen did (you-P1) come?'","b. ediey-tul ka-ni? where-P1 go-QE Ẁhere are (you-P1) going?'","c. ettekey-tul o-ess-ni? how-P1 come-Pst-QE H̀ow did (you-P1) come?'","d. way-tul o-ess-ni? why-P1 come-Pst-QE Ẁhy did (you-P1) come?' According to T. Chung (1991:246), the subject (or 'NFL that agrees with it) antecedent-governs the adverbs except for the causal adverb because the subject c-commands all the adverbs except for the causal adverb, assuming that the subject is generated at the SPEC of AgrP. (See (2).)","At this point some remarks are in order on T. Chung's (1991) analysis. First, ettehkey can have a resultative reading as well as manner and instrumental readings. (5) (=(1a)), for example, could be answered with (6c) as well as (6a) or (6b): 2 It seems to be unreasonable to reserve a position both for spatial adverbs and for temporal adverbs (and similarly to reserve a position for manner adverbs and for instrumental adverbs) since a spatial adverb and a temporal adverb may appear at the same time in a clause. 3 Rizzi's (1990:32) ECP and auxiliary notions are defined as follows:","(i) ECP: A non-pronominal empty category must be a. properly head-governed b. antecedent-governed or Theta-governed.","(ii) Head Government: X head governs Y iff a. X E {A, N, P, V, Agr, T) b. X m-commands Y c. no bather intervenes d. Relativized Minimality is respected","(iii) Antecedent Government: X antecedent-governs Y iff a. X and Y are coindexed b. X c-commands Y c. no barrier intervenes d. Relativized Minimality is respected","4 T. Chung (1991:245) suspects that causal adverbs are head-governed by T, which is assumed to be generated in a position","higher than Agr. But notice that m-command, not c-command, plays a role in the definition of the head government. Agr m-","commanding causal adverbs, the head government obtains without resort to T."]},{"title":"3","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 1-9 [ettehkey yoliha-n] koki-ka masiss-ni? how cook-Adn meat-Nom tasty? Q̀ the meat that you cook how is tasty?' a. yakhan pwul-ey chenchenhi kwuun koki. weak fire-at slowly\\troast meat m̀eat that is roasted slowly on weak fire.' b. oven-ulo kwuun koki. oven-with roast meat m̀eat roasted with an oven' c. wancenhi ikhin koki. completely roast meat Ẁell done meat.' (manner) (instrumental) (resultative) To prove his theory to be correct, resultative adverbials must also be shown to be generated in a position that is appropriately head-governed and antecedent-governed. This does not seem to require much work, though. Second, according to T. Chung (1991), causal adverbs are generated in a position higher than the subject position and therefore cannot be antecedent governed by subject. Notice, however, that subject can appear higher than causal adverbs, as in the following example: (7)","\\t Kim kyoswu-uy nonmwun-i way, palphyotoyci anh-ess-ni? Kim professor-Gen paper-Nom why be;presented Neg;do-Pst-QE Ẁhy was Professor Kim's paper not presented?' T. Chung would say that the subject in (7) is generated lower than way and scrambled to the overt position at a later stage. 5 But it is generally taken for granted that clause internal scrambling remedies binding violations. Thus, if, as he claims, subject may antecedent govern . adjuncts in its c-command domain, then causal adjuncts should be allowed whenever subject is scrambled over them. But this is not true. For example, sentences like (7) cannot be embedded under syntactic islands such as complex NPs or adjunct clauses. Furthermore, it is not obvious what is meant by the claim that adverbs are antecedent governed by subjects.6 s Even if subject does not undergo scrambling as claimed in Saito (1985), the grammaticality of the sentences like (7) is still problematic since there will be no difference between causal adverbs and other adverbs with respect to the c-command relation with subject. 6 Lin (1992) also deals with the difference between HOW vs. WHY in Chinese and other languages. (I thank a reviewer for pointing it out to me.) Interestingly, Lin attributes the difference to the positional difference and the conjunctive ECP as in T. Chung (1991). But unlike T. Chung (1991), Lin claims that WHY is generated in the SPEC of CP, not within IP (AgrP), and head-government rather than antecedent government is responsible for the fact that WHY is hardly embedded. I did not have enough time to incorporate Lin's analysis in this paper, but I would like to raise a point with respect to the base position of WHY. To explain the grammaticality of the sentences like (i), where WHY appears after subject, Lin claims that the subject is topicalized, as illustrated in (ii):","(i) (=Lin 1992:294, (3a)) Ta weishenme zuotian mei lai? he why\\tyesterday not come Ẁhy didn't he come yesterday?'","(ii) (= Lin 1992:302, (20)) [cp\\t[cP weishenme bp ti zuotian\\tmei lai]]] Note, however, that sentences like (iii) are also grammatical (Audrey Li (p.c.)):","(iii) najian yifu, to weishenme bu xihuan? that dress she why\\tnot like 'Why doesn't she like that dress?' In (iii), an element other than subject, i.e., najian yifu 'that dress,' is clearly topicalized and WHY appears after the subject. Unless the subject is topicalized along with the 'clearly topicalized' element or it is preposed for some other reason, the"]},{"title":"4","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 1-9"]},{"title":"2.2. D. Chung (1996): A Nominal Analysis of Ettehkey","paragraphs":["D. Chung (1996:59-60, footnote 11) proposes to decompose ettehkey into etteh-ki-ey, hinting from Lee's (1993:369) analysis of causative ending -key as nominalizer Id plus postposition ey 'to.' D. Chung claims that due to the existence of the nominal feature associated with ki, ettehkey behaves like other nominal WH-words like nwukwu ẁho' or mwues 'what' and do not show island effects.","Lee (1993:369) proposes to decompose the causative morpheme -key into nominalizer ki and postposition ey 'to,' as exemplified below:7","(8)\\ta. (=Lee 1993: 369, his (68b)) na-nun ku-ka o-key\\tmantul-ess-ta. I-Top he-Nom come-KEY make-Pst-DE Ì made him come.'","b. na-nun [ku-ka o-ki-ey]\\tmantul-ess-ta. 1-Top he-Nom come-Nmz-to make-Pst-DE Lee claims that the nominalizer -ki presupposes the temporal existence of the action denoted by the verb. Thus the sentence in (8), for example, means 'I did something to bring into existence the baby's crying.'","Our main concern here is not the semantics of -key, but the morpho-syntactic information that it conveys, especially its categorial feature. If, as Lee (1993) claims, key is decomposed into nominalizer -ki plus postposition","-ey 'to,' it is reasonable to carry the same analysis into key of WH-word ettehkey 'how,' according to which it will be analyzed into etteh-ki-ey. Then it is natural to regard ettehkey as containing a nominal feature associated with -ki in it. Due to the existence of the nominal feature, ettehkey can be said to behave like other nominal WH-words like nwukwu 'who' or mwues- 'what' with respect to island insensitivity. In other words, ettehkey can be said to be licensed in the same way that nominal WH-words are licensed, no matter what is responsible for the nominal vs. non-nominal distinction in the licensing mechanism of WH-words.","A similar nominal vs. non-nominal dichotomy was already entertained in Tsai (1994) for zenmeyang 'how' in Chinese. Tsai claims that zenmeyang displays island effects when it has a manner reading, but not when it has an instrumental or resultative reading. He accounts for the difference by categorizing manner zenmeyang as a pure adverbial and instrumental/resultative zenmeyang as a nominal element. His classification, however, seems to be fairly arbitrary. Incidentally, Tsai's generalization does not apply to Korean, in which manner ettehkey does not show island effects; either, as was seen in (5) and (6).8"]},{"title":"3. Predicate WH-word Etteh and Predicate Analysis of Ettehkey","paragraphs":["In this section it will be shown that neither T. Chung's (1991) theory based on the hierarchical status nor D. Chung's (1996) theory based on the categorial status is tenable. Our contention depends crucially on the fact that etteh, subpart of ettehkey, does not display island effects like other nominal or argument WH-words. Consider the grammaticality of sentences like (iii) will pose a problem for Lin. Furthermore, in Korean, where topic markers are overtly realized, WHY appears after a non-topic (e.g., nominative or accusative) marked element without any difficulty:","(iv) John-i way ttena-ess-ni? J.-Nom why leave-Pst-QE Ẁhy did John leave?'","(v) John-i Mary-lul way manna-ess-ni? J.-Nom M.-Acc why meet-Pst-QE Ẁhy did John meet Mazy?' Thus, I suppose that the claim that WHY is (exclusively) generated in the SPEC of CP should be reconsidered. 7 In fact Lee (1993:359-377) argues that many other morphemes including imperative ending -kela, conditional -ketun, and disjunctor -kena, contain the same nominalizer -Id. 8 See Lin (1992), who also claims, based on Tang's (1990) observation, that Tsai's generalization does not hold even in Chinese. Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 1-9 sentence in (9), in which WH-word etteh is located in the most deeply embedded clause which is in turn contained in a relative clause, a syntactic island:","(9) Secang-un [ei [sanghwang-i etteh-ta-ko] pokoha-n] kyengchalkwan-ul haykoha-ess-ni? chief-Top\\tsituation-Nom how-DE-C report-Adn police;officer-Acc fire-Pst-Q Q̀ The chief fired the police officer who reported that the situation is how?' Etteh in this sentence is neither a VP-adjunct nor a nominal element but rather is a predicate of the most embedded clause.9 Its predicatehood is evident from various facts. First, the embedded subject requires a predicate for a theta-theoretic reason and no predicate other than etteh is available in the clause. Second, it hosts a declarative sentence ending, ta, which exclusively attaches to a verb stem or to an inflected verb. Third, etteh (etuleh in Northern dialects) contains eh (leh in Northern dialects), which is reminiscent of the depictive adjectival verb ending (1)Ah, where A varies over a [a] or e [a] , a vowel harmony variation, e.g., adjectival verbs such as nolah/nwuleh 'to be yellow,' hayahlheyeh 'to be white,' phalah/pheleh 'to be blue,' khetalah 'to be"]},{"title":"big,'","paragraphs":["coptalah 'to be narrow,' etc. The lack of any overt morpheme for the present tense further indicates that etteh is an adjectival verb. 1° The array of facts shows that etteh in (9) is neither a VP-adjunct nor a nominal element, but a verbal predicate. Nevertheless, it does not show island effects, which indicates that neither T. Chung's nor D. Chung's analysis is tenable.","A natural question that arises is whether the predicate analysis of etteh in (9) can be carried over to its adverbial form ettehkey in (1a,b)? I contend it can, analyzing ettehkey as the predicate head of a small clause, as illustrated in the structure in (10) below: (10) ... VP SC\\tVP pro\\tPred (NP;)\\tV ettehkey The null element, pro, could be referentially linked to an element in the sentence, typically NP i in (10), as when etteh has a resultative reading,\" or its reference could be pragmatically provided from the context, as when etteh has a manner or instrument reading. 9 Lin (1992:329, footnote 27) also shows that zenmeyang 'how' could be a predicate in Chinese: Ni zuijing zenmeyang? you recently how H̀ow have you been recently?' 10 Action verbs need a present tense morpheme, -n/-nun, when a plain declarative sentence ending follows but adjectival or stative verbs do not take any overt present tense morpheme:","(i)\\ta. John-i pap-ul mek-nun-ta/*mek-ta. J.-Nom rice-Acc eat-Pres-DE/eat-DE J̀ohn eats (or is eating) rice.'","b. John-i khi-ka\\tcak-ta/*cak-nun-ta. J.-Nom height-Nom small-DE/small-Pres-DE J̀ohn is small.'","11 Or the small resultative clause itself could be complement of the matrix verb, as in (i) below, depending on the analysis:"]},{"title":"(i) \\t","paragraphs":["... VP SC NP ettehkey"]},{"title":"6","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 1-9","The attachment of key to etteh is analogous to the fact that the ,predicate head of a small clause in Korean undergoes a categorial change, hosting an adverbial ending -key, as exemplified in (11): \\t","(11)\\tJohn-un [ku mwuncey-lul nemwu swip-ley] yeki-n-ta. J.-Top the problem-Acc too\\teasy-KEY consider-Pres-DE J̀ohn considers the problem too easy.' I assume that the categorial change from adjectival verb to adverbial results when the small clause head (overtly) raises to the domain of the higher predicate along the similar lines of Stowell (1991), who argues that small clause heads raise to form a complex predicate with the higher predicate, overtly or covertly in Italian and covertly in English. One difference between our analysis of Korean small clauses and Stowell's analysis of Italian and English small clauses is that in the latter the small clause predicate undergoes a head-to-head movement, i.e., the small clause predicate and the matrix predicate are restructured to form a constituent, whereas in the former the predicate or its projection undergoes an XP-movement, i.e., it adjoins to the projection of the matrix predicate. 12"]},{"title":"4. Theta-Pertinence and Island Effects","paragraphs":["Now let us return to our original question why etteh or ettehkey does not show island effects. I resort to the theta-identification of the ECP story but from a different perspective. Arguments enjoy more liberty than non-arguments because they can be identified by a theta-relation as well as by binding (antecedent government). (See Lasnik and Saito 1984 and Chomsky 1986.) The theta-identification explicated in this way is a unilateral construal in that predicates identify their arguments but not vice versa. It is conceivable, however, to explicate theta-relations bilaterally, i.e., predicates and their arguments can be understood to identify or restrict each other. Depending on the properties (types, number, etc.) of the arguments, the predicates are restricted accordingly. For example, suppose that there are two arguments, one as a subject and the other as an object, in a clause. Then the predicate that relates the two arguments must be a transitive verb, but not be an intransitive or ditransitive verb. To take another example, suppose that there is merely one argument in a given clause. Then the predicate can be an unergative or unaccusative verb but it can not be a transitive or ditransitive verb.","With the theta-identification explicated in this bilateral way, etteh or ettehkey is theta-identified, since they are theta-pertinent as a theta-role assigning predicate. Hence the lack of the island effects follows. Note that with the advent of the small clause head analysis of ettehkey, etteh is always a predicate head assigning a thematic role to its subject."]},{"title":"5. Some Speculation on the Behavior of English how","paragraphs":["A question that arises is whether English how could be similarly analyzed as a predicate. If that were possible, then it would not show island effects, contrary to the fact. But the answer to the question seems to turn out negative. Notice that adjectival small clause heads in English are replaced by what not by how in WH-questions, as in (12): \\t (12)\\t(I know you consider Mary smart.) But I do not know what/*how you consider John e? This clearly contrasts with the Korean counterpart, in which ettehkey 'how' instead of mwues 'what' is used: 12 Note that V-key can precede all other embedded elements, as shown below:","(i)\\ta. (=(11)) John-un [ku mwuncey-lul nemwu swip-key] sayngkakha-n-ta. J.-Top the problem-Acc too\\teasy-KEY consider-Pres-DE J̀ohn considers the problem too easy.' b. John-un [nemwu swip-key]; [ku mwuncey-lul tJ saynglcalcha-n-ta. J.-Top too\\teasy-KEY the problem-Ace consider-Pres-DE J̀ohn considers the problem too easy.' This indicates that the small clause head does not merge into the matrix predicate."]},{"title":"7","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 1-9","(13) (na-nun ney-ka Mary-lul yengliha-key yeki-nun \\tkes-ul\\tal-n-ta.) I-Top you-Nom M.-Acc smart-KEY consider-Adn thing-Acc know-Pres-DE John-un *mwes-ul/ettehkey yeki-ni? J.-Con what-Acc/how consider-QE H̀ow about John?' The English-Korean difference evinces itself more clearly in echo-questions. Compare the English sentence in (14) with the Korean counterpart in (15): (14) You consider John what/*how? (15) John-ul *mwes-ul/ettehkey yeki-n-ta-ko?","J.-Acc what-Acclhow consider-Pres-DE-CM","\\t (CM--citation Marker) Ỳou consider John what/how?' Adjectival small clause heads are replaced by what in English and by ettehkey in Korean.","Since it does not replace an adjective in WH-questions or echo-questions, how in English could not be regarded as a predicate. Clearly it is not an argument, either. Thus, it seems to be a pure adjunct. It is, therefore, not theta-pertinent and cannot be theta-identified. Thus it shows the island effects, unlike its apparent Korean counterpart ettehkey, which is analyzed as the predicate head of an adjectival small clause in this paper.°"]},{"title":"References","paragraphs":["Aoun, Joseph (1986) Generalized Binding: The Syntax and Logical Form of WH-Interrogatives, Foris Publications,","Dordrecht-Holland/Riverton-U.S.A. Aoun, Joseph and Y.-H. Audrey Li (1993) Syntax of Scope, MIT Press, Cambridge, MA. Chomsky, Noam (1986) Barriers, MIT Press, Cambridge, MA. Chung, Daeho (1996) On the Representation and Licensing of Q and Q-Dependents, Ph. D. dissertation, University","of Southern California. Chung, Tagoo (1991) \"On WH-Adjunct Extraction in Korean,\" Susumu Kuno et al (eds.) Harvard Studies in","Korean Linguistics IV, 241-248. Cinque, Guilemo (1990) Types of A'-Dependencies, MIT Press, Cambridge, MA. Huang, C.-T. James (1982) Logical Relations in Chinese and the Theory of Grammar, Ph.D. dissertation, MIT. Kuh, Hakan (1987) \"Plural Copying in Korean,\" Susumu Kuno et al (eds.) Harvard Studies in Korean Linguistics II,","239-250. Lasnik, Howard and Mamoru Saito (1984) \"On the Nature of Proper Government,\" Linguistic Inquiry 14, 235-289. Lee, Keedong (1993) A Korean Grammar on Semantic-Pragmatic Principles, Hankwukmwunhwasa, Seoul, Korea. Lin, Jo-Wang (1992) \"The Syntax of 'HOW' and 'WHY,' Journal of EastAsian Linguistics 1: 293-331. Rizzi, Luigi (1990) Relativized Minimality, MIT Press, Cambridge, MA. Saito, Mamoru (1985) Some Asymmetries in Japanese and Their Theoretical Consequences, Ph.D. dissertation, MIT. Song, Seok Choong (1975) \"Rare Plural Marking and Ubiquitous Plural marker in Korean,\" CLS 11. Stowell, Tim (1991) \"Small Clause Restructuring,\" Robert Freidin (ed.) Principles and Parameters in Comparative","Grammar, MIT Press, Cambridge, MA. Tang, C.-C. Jane (1990) Chinese Phrase Structure and Extended X-bar Theory, PhD dissertation, Cornell University. Tsai, Wei-Tien (1991) \"On Nominal Island and LF Extraction in Chinese, in Lisa Cheng and Hamida Demirdash","(eds.), MIT Working Papers in Linguistics 15, MIT, Cambridge, Massachusetts. Tsai, Wei-Tien (1994) On Economizing the Theory of A-bar Dependencies, Ph. D. dissertation, MIT. Watanabe, Shin (1995) Aspects of Questions in Japanese and Their Theoretical Implications, Ph.D. dissertation, 13 It is interesting to observe that some languages (e.g., Korean) allow predicate WI-I-elements, but others (e.g., English) do not. A similar difference reveals in the formation of ANY negative polarity item: Korean has an ANY predicate, i.e., amwuleh, which is always licensed by a negated light verb, while English does not have such an item at all. But I am ignorant for the moment what is responsible for the differences."]},{"title":"8","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 1-9 USC.","Watanabe, Shin (1996) \"A Note on Scope Dependencies in Japanese Multiple Wh-Questions,\" presented at the Seventh Japanese/Korean Linguistic Conference, November 8-10, 1996, University of California, Los Angeles. 1. Ettehkey 'how' as a Small Clause Head 2. Daeho Chung 3. Seoul National University 4. Department of English Language and Literature,","College of Humanities, Seoul National University,","Seoul 151-742, S. Korea 5. ctheho@plazal .snu.acicr"]},{"title":"9","paragraphs":[]}]}