{"sections":[{"title":"","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 48-59"]},{"title":"Mandarin Intransitive Reflexive Verbs and the Unaccusative Hypothesis Lian-Cheng Chief CKIP, Institute of Information Science, Academia Sinica chief@hp.iis.sinica.edu.tw","paragraphs":["The present paper focuses on the Mandarin Intransitive keflexive Verbs. These verbs, such as zi-sha 'to commit suicide', and zi fen 'to burn oneself, are formed with a reflexive morpheme zi- 'self' and a root verb. Take the verb zi-sha 'to commit suicide' for example, the reflexive morpheme contributes the reflexive meaning and the root verb sha 'to kill' contributes the meaning t̀o kill'; hence, the meaning 'to kill oneself. Two previous analyses have different classification of these reflexive verbs. For instance, Tang's (1992) analysis implies that these verbs are unergative, while Kao (1993) asserts that they are unaccusative. In light of the previous analyses, we present an alternative analysis by giving new data that are largely selected from Sinica Corpus.","By scrutinizing the syntactic behavior of reflexive verbs, calculation of thematic properties of the subject, and the event structure of these predicates, we propose a morpholexical operation of reflexivization and conclude that intransitive reflexive verbs are unaccusative. Although our conclusion seems to be as same as Kao's conclusion, two analyses are strikingly different from each other. We will prove that Kao's analysis can only account for the partial truth, while the present analysis can fully explain the linguistic phenomenon of Mandarin intransitive reflexive verbs. In addition, the implication of two analyses is also different. It is believed that the present analysis offers additional evidence to support the idea that the distinction between thematic roles is not discrete."]},{"title":"1. INTRODUCTION","paragraphs":["The concept of reflexivization can be represented not only in syntax as shown in (la), but also in lexicon as shown in (lb).","( 1 a) Zhangsan sha le\\tziji\\t(lb) Zhangsan zi-sha\\tle Zhangsan kill ASP self\\t Zhangsan REFL-kill ASP Z̀hangsan killed himself.'\\t Z̀hangsan committed suicide.' In Mandarin Chinese, there is a class of reflexive verbs which is prefixed by a reflexive morpheme zi- 'self . They can be intransitive such as zi-sha"]},{"title":"a","paragraphs":["'to commit suicide', or transitive such as zi-ren tf, 'to think of oneself as'. The reflexive anaphors, such as mono-morphemic reflexive ziji 'self and poly-morphemic reflexive to-ziji 'himself/herself , have attracted many Chinese linguists' attention (Sung and Cole 1994, Tang 1989, Chen 1992, Y. Huang 1994, Kao 1993, Xu 1993, Chief and Chen 1995). On the contrary, there are relatively few studies of the reflexive verbs. Two recent studies (Tang 1992, Kao 1993) aim at Mandarin reflexive verbs. However, they do not provide a full set of data to discuss the phenomenon of Mandarin reflexive verbs. Moreover, some of the conclusions drawn on the two studies make incorrect prediction. Therefore, a thorough research of Mandarin reflexive verbs should be conducted. This paper focuses on the presentation and description of the linguistic data of Mandarin intransitive reflexive verbs and provides an alternative analysis.' Section 2 provides a background understanding of the analysis in the present study, including previous analyses and the characteristics of Mandarin reflexive verbs. In section 3, we will present an alternative analysis. By applying the notion of Lexical Mapping Theory, a sub-theory of LFG, a morpholexical operation of lexical binding is proposed to account for the Mandarin intransitive reflexive verbs. Section 4 demonstrates that the present analysis can properly explain the facts that the previous analyses fail to account for. In section 5 we will compare the difference between the present analysis and other analyses. We discuss the implication of the present analysis in section 6. The final section concludes this paper."]},{"title":"2. INTRANSITIVE REFLEXIVE VERBS IN MANDARIN","paragraphs":["The Mandarin intransitive reflexive verbs, such as zi-sha"]},{"title":"of","paragraphs":["'to commit suicide', zi-ai t 'to respect oneself, are formed with a prefix zi- 'self' and a transitive verb. This sub-class of the intransitive reflexive verbs includes: For the analysis of transitive reflexive verbs or the classification of Mandarin reflexive verbs, please see Chief (1996, 1997a, 1997b)."]},{"title":"48","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 48-59 (2) zi-nue\\tj 'to torture oneself' , zi-sha th"]},{"title":"a","paragraphs":["'to commit suicide', zi-ai\\tt 'to respect oneself\", zi-bei","t̀o feel oneself inferior', zi-ba\\t4A. 'to free oneself from', zi-zhong\\t'to respect oneself, zi-lian","t̀o pity oneself, zi-bi\\tNI 'to be autistic', zi-wei\\t4t. 'to defend oneself, zi-fen\\t'to burn oneself, zi-lu\\t,* 'to control oneself, zi-qi\\t44; 'to cheat oneself, zi-yu\\t'to amuse oneself , zi-yi","4p 'to suppress oneself , zi-jing\\tI 'to commit suicide', zi-jiu\\t4Ei 'to save oneself, zi-bao t̀o protect oneself, zi-zhi\\t-01 'to control oneself, zi-kong\\t41. 'to control oneself , zi-yuan\\tS 'to complain oneself , zi-jiu\\t'to blame oneself, zi-lian\\tM 'to be narcissist' , zi-qi\\t'to abandon oneself , zi-li\\tAt 'to encourage oneself', zi fu\\t'to think highly of oneself , zi-wun\\tbI 'to kill oneself, zi-da ki A 'to boast oneself, zi-can\\t'to hurt oneself', and so on."]},{"title":"2.1 THE SEMANTIC COMPOSITION AND THE INTERNAL STRUCTURE","paragraphs":["Most of the second-syllable morphemes are not free morpheme in modern Mandarin. However, Mandarin native speakers know that these morphemes, if isolated, are dyadic semantically. For example, in the reflexive verbs zi-fen g 'to burn oneself and zi-nue t 'to torture oneself , the second-syllable morphemes fen tjt 'to burn' and nue t 'to torture' have the meanings 'to burn' and 'to torture'. Obviously, they are dyadic in nature, although they are no longer free morphemes in Modern Mandarin. In short, these second-syllable morphemes are transitive verbs alone, but become intransitive when they are prefixed by reflexive morpheme zi- 'self . Mandarin reflexive verbs are complex predicates because their semantics is compositional. The first-syllable reflexive prefix zi- 'self contributes the reflexive meaning and the second-syllable morpheme the predicate meaning. For instance, in the reflexive verb zi-fen 'to burn oneself, the reflexive morpheme zi- contributes the reflexive meaning and fen 'to burn' provides the predicate meaning 'to burn'; hence, the compositional meaning 'to burn oneself ."]},{"title":"2.2 PREVIOUS ANALYSES","paragraphs":["Following Grimshaw's (1990) analysis that Romance reflexive verbs are unaccusative verbs, Kao (1993) argues that Chinese intransitive reflexive verbs are unaccusative verbs. Specifically, in Kao's (1993) proposal zi- is a reflexive clitic which can prefix to transitive verbs and suppress the external argument of the verb. As a consequence, the syntactic expressed argument is the internal argument of reflexive verbs. Therefore, the intransitive reflexive verbs are unaccusative verbs.","Kao (1993) claims that these verbs and unaccusative verbs share some characteristics. She indicates that there are some properties of unaccusative verbs in Mandarin Chinese. First, only unaccusative verbs can occur in presentative constructions. Second, they cannot take the durative marker -zhe. Third, only unaccusative verbs and passive verbs can be converted into an adjectival form. Fourth, resultative phrases can only modify the subject of the unaccusative verbs. Finally, only unergative verbs can undergo passivization. The lexical reflexive verbs share these properties with unaccusative verbs. We summarize her argument in table 1. Table 1. Summary of Kao's Evidence","Syntactic Tests unergative verbs unaccusative verbs reflexive verbs","presentative construction - 4- -4-2 attachment of -zhe -I- - - 3 converting to adj. form - + -f-4 subject modified by resultative phrase",". - 4- +",", 5 _passivization + - - However, the last three (no.3-no.5) diagnostics for unaccusativity are only proved to be good for other languages. It seems that these diagnostics cannot be directly extended to Mandarin Chinese. In next section, we provide new data to verify whether the Mandarin reflexive verbs are unaccusative verbs or unergative verbs."]},{"title":"2.3 THE SYNTACTIC BEHAVIOR OF INTRANSITIVE REFLEXIVE VERBS","paragraphs":["In this section, we will examine every unaccusative characteristics of Mandarin intransitive reflexive verbs assumed in Kao (1993). In addition, we will also illustrate the characteristics of these verbs."]},{"title":"2.3.1 REFLEXIVE VERBS AND PRESENTATIVE CONSTRUCTIONS","paragraphs":["In presnetative constructions, the subject appears in the post-verbal position which is also the canonical object position in normal situation. Thus, only unaccusative verbs can occur in the presentative construction. Based on this criterion, Kao (1993) demonstrates that: in (3b) the verb pa 'creep' is unergative, so it cannot occur in the presentative construction; on the contrary, the unaccusative verb lai 'come' in (3a) and the reflexive verbs zi-sha 'to commit suicide' in (3c) can occur in this construction. 49 Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 48-59","Presentative construction","(3)\\ta.\\tlai\\t.le\\tyi\\tge\\tren come\\tASP one CL people H̀ere comes a person.'","b.\\t*pa le\\tyi\\t","tiao she creep ASP one CL snake","c.\\ttingshou zai nei chang canju \\tzhong, zi-sha\\t","le\\tJiang ge ren hearsay\\tat\\tthat CL\\ttragedy LOC REFL-kill ASP two CL people T̀hey said two people killed themselves in that tragedy.' However, with a further scrutiny, we find that not all of the intransitive reflexive verbs can occur in the presentative construction. \\t","(4) a.\\t*ban shang zi-ai\\tle\\tJiang ge xuesheng","class LOC REEL-love ASP\\ttwo\\tCL student","b. *shiwei cunzhong\\tzhong zi-lu\\tle\\tJiang ge ren","demonstrationist\\tLOC REFL-control ASP two CL people","c. shiwei cunzhong zhong zi-fen\\tle\\tJiang ge ren","demonstrationist LOC REFL-burn\\tASP two CL people Most of the reflexive verbs in sentences (4) cannot occur in the presentative constructions. It seems that only a few intransitive reflexive verbs pass this test."]},{"title":"2.3.2 REFLEXIVE VERBS AND PARTICIPLE ADJECTIVE CONVERSION","paragraphs":["Following Levin and Rappaport's (1986) analysis of English, Kao (1993) claims that only unaccusative","verbs can be converted into an adjectival form in Mandarin Chinese. In the following, we will show that this","criterion cannot be applied in Mandarin Chinese. We cite her examples in (5). The verb pa 'creep' in (5b) is","an unergative verb, so it cannot be converted into an adjective to modify she 'snake'. On the contrary, the","unaccusative verb chen 'sink' can be converted into an adjective as in (5a).","(5) a.\\tchen chuan","sink boat","à boat which sunk'","b.\\t*pa\\tshe","creep snake c.\\tzi-sha zhe","REFL-kill person","à person who killed himself' d.\\tzi-nue\\tzhe","REFL-torture\\tperson","à person who tortured himself'","She only provides two example (5c) and (5d) to show that reflexive verbs can be converted into an","adjective. However, in these cases, the head noun which is modified by the converted adjectival form is zhe","t̀he one who . . .'. It seems that zhe\\t'the one who . . .' can be modified by unergative verbs, too.","(6) a.\\tpao zhe\\t c.\\tyouxing\\tzhe","run person \\t demonstrate person r̀unner' \\t","d̀emonstrationist'","b.\\t d.\\tli\\tzhexingdong zhe act\\tperson\\t stand person t̀he one who acts' \\t","t̀he one who is standing'","The examples in (6) show that the unergative verbs pao 'run', xingdong àct', youxing 'demonstrate', li 'stand'","can be converted into an adjectival form as a modifier of zhe 'the one who . . .'. One might think that we","should not take zhe 'the one who . . .' as the examples. To solve this question, we must see if the","Mandarin reflexive verbs, when converted into an adjectival form, can modify a normal head noun. The","answer seems to be positive.","(7) a.\\tzi-sha\\txuesheng","REFL-kill student","t̀he student who killed himself'","b.\\tzi-zhu\\tluren","REFL-help traveler","s̀elf-helping traveler' e.\\tzi-zhu\\tnuxing","REFL-master female","ìndependent woman'","The sentences in (7a-e) display that the reflexive verbs can be converted into an adjective form to modify a head","noun in addition to zhe 'the one who . . .'. The next step is to see if the Mandarin unergative verbs can be","c. zi-bi\\ter REFL-close child àutism children'","d. zi-jiu weiyuanhui REFL-save committee s̀elf-helping committee' 50 Language,*Information and Computation (PACLIC12), 18-20 Feb, 1998, 48-59","converted into adjectival forms.","(8) a.\\tliulang you wander dog ẁandering dog'","b.\\tyouyong gaoshou swim expert s̀wimming expert'","c. shi-zu nu","astray girl","à girl who goes astray'","d. qianfu fengzi","hiding person","s̀py'","e. du-xing\\tnuzi","alone-walk woman","à woman who walks alone'","The adjectives that modify the head nouns in (8) are derived from unergative verbs. Evidently, unaccusative,","unergative, and reflexive verbs can be converted into adjectival forms in Mandarin. Contrary to Kao's","assertion, the process of deriving adjectives from verbs cannot be an unaccusative test for Mandarin verbs."]},{"title":"2.3.3 REFLEXIVE VERBS AND RESULTATIVE CONSTRUCTIONS","paragraphs":["In English, the resultative phrase can only modify the internal argument of a verb. In other words, it can","be predicated of the object of transitive verbs or the subject of unaccusative verbs. Kao (1993) gives examples","to illustrate that in Mandarin the resultative phrase can only modify the subject of unaccusative verbs (sentence","9a) and reflexive verbs (sentence 9c) but cannot modify the subject of unergative verbs (sentence 9b).","(9) a. • xuesheng fen\\tcheng\\tJiang zu","student\\tseparate\\tinto\\ttwo group","T̀he students divided into two groups.' b. *xuesheng pao\\tcheng\\tJiang zu","student\\trun\\t","into\\ttwo section","*T̀he student ran into two sections.' c. Zhangsan zi-nue\\tde bu cheng\\tren\\txing","Zhangsan REFL-torture DE not into \\t","human\\tform","Z̀hangsan tortured himself into a haggard form.' By considering some more data, we observe that unergative verbs can also occur in the resultative construction. \\t","(10) a.\\tta xiao\\tde\\tduzi\\ttong he laugh de stomach ache H̀e laughed so badly that results in stomachache.' \\t","b.\\tta zou de you ke you lei he walk DE also thirsty also tired H̀e walks so that he is thirsty and tired.' The sentences in (10) show that the subject of Mandarin unergative verbs can also be modified by resultative phrases. We would suggest that the r̀esultative construction' test cannot be used to verify the unaccusativity of Mandarin reflexive verbs, though this is a good test for English unaccusative verbs. One might turn to another resultative construction in Mandarin, namely, v-v resultative compound. But we will also suggest that this cannot be a good test for whether Mandarin reflexive verbs are unaccusative or unergative. The reason is that Mandarin reflexive verbs cannot form a v-v resultative compound with other verbs. Therefore, occurring with a resultative phrase cannot be a test for whether Mandarin reflexive verbs are unaccusative verbs or not."]},{"title":"2.3.4 REFLEXIVE VERBS AND POSTPOSING OF NUMERAL PHRASE","paragraphs":["Chang and Huang (1995) point out the unaccusative verbs (sentences 12b and 12c) can co-occur with the construction of postposing of numeral phrase, while the unergative verbs cannot (sentence 11 b). For example, \\t","(11) a.\\ter-fen-zhi-yi\\tde xuesheng\\tduo ku le one-second\\tDE student\\tall cry ASP","\\tb.\\t*xuesheng ku\\tle\\ter-fen-zhi-yi student cry\\tASP one-second H̀alf of the students cried.' \\t","(12) a.\\ter-fen-zhi-yi\\tde fanren\\tpao2\\tle one-second\\tDE prisoner\\tran away ASP 2 The verb pao has two lexical items: one means run and the other escape. The former is unergative and the latter unaccusative. 51 Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 48-59","b. fanren\\tpao\\tle\\ter-fen-zhi-yi prisoner ran away ASP one-second H̀alf of the prisoners ran away.'","c. wu ge fanren pao le liana ge five CL prisoner ran away ASP two CL T̀wo of the five prisoners ran away.'","Some of the reflexive verbs such as sentence (13a) and (13b) can pass this unaccusative test and some cannot as","shown in sentence (14). For example,","(13) a.\\tnanmin zi-sha\\tle\\tyi-ban","refugee REFL-kill ASP half","H̀alf of the refugees committed suicide.'","b. shi ge shiwei zhe\\tzi-fen\\tle\\tsan ge","ten CL demonstrationist\\tREFL-burn ASP three cl","T̀hree of the ten demonstrationists burned themselves.'","(14) .\\t*shuohai-ren\\tzi-bao\\tle\\ter-fen-zhi-yi","victim\\tREFL-protect\\tASP one-second Based on the above observation that different reflexive verbs have different behavior, should we classify Mandarin intransitive reflexive verbs into two classes? Or, there are other factors to account for this phenomenon. We will try to account for such a variation of syntactic behavior shortly."]},{"title":"3 THE ANALYSIS OF INTRANSITIVE REFLEXIVE VERBS 3.1 THE THEORETICAL FRAMEWORK","paragraphs":["In this paper, we will apply the Lexical Mapping Theory (LMT) to illustrate the observed phenomenon.3 In movement theories, the surface subject of unergative verbs is also the underlying subject, while the surface subject of unaccusative verbs is the underlying direct object. Then, how does a monostratal syntactic theory which does not have the notion 'underlying object' account for the distinction between unaccusative and unergative verbs? Bresnan and Zaenen (1990) and Zaenen (1994) point out that the intrinsic feature of thematic roles can describe the distinction between unaccusative and unergative. The characterization of unaccusative and unergative suggested by Zaenen (1994: 153) is: (15) an unaccusative participant is a participant that is intrinsically marked [-r]","an unergative participant is a participant that is intrinsically marked [-o] Following this approach, we, then, do not have to refer to the notion of underlying object and movement.","Recent studies of reflexive verbs tend to treat the reflexive morpheme which signals the reflexive meaning in reflexive verbs as a valency reducing morpheme (Grimshaw 1990, Alsina 1994). Specifically, the reflexive morpheme is a marker of the binding relationship in argument structure. In other words, it makes one argument binds another of a predicate. Take sha 'to kill' and zisha 'to commit suicide' for example. Conceptually, there are two roles in the predicate sha 'to kill', the agent and the patient. Projecting to the syntactic level, there are two NPs as in sentence (16). (16) Zhangsan sha le\\t(ta)ziji.","Zhangsan kill ASP himself","Z̀hangsan killed himself.' As for the reflexive verb zi-sha 'to commit suicide' , there are also two roles conceptually, the agent and the patient. The one who does the action the agent, and the one who is killed, the patient, are the same one. Projecting to the syntactic level, there is only one NP in c-structure and one GF in f-structure as in sentence (17). (17) Zhangsan zuotian . zi-sha\\tle","Zhangsan yesterday REFL-kill ASP","Z̀hangsan committed suicide yesterday.' Unlike the binding in the syntactic level, such as sentence (16), the binding relationship of reflexive verbs is determined in the a-structure rather than c-structure or f-structure. Therefore, we can say that the function of the reflexive prefix zi- 'self' is to cause one argument of a predicate to bind another. The appearance of only one NP in ' syntax is the consequence of the lexical binding. In other words, the valence-reducing is a by-3 In LMT, grammatical functions are further classified by two features: [o] and [r]. The features [±o] and are used to specify whether the syntactic functions are objective or nonobjective and restrictive or nonrestrictive. The grammatical functions subject and object are nonrestrictive because they can correspond to any thematic role, while the functions OBJe, OBLe are restrictive because they only correspond to a limited set of roles. 52 Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 48-59 product of a lexical binding process. It is interesting to discuss why and how the semantic roles project onto the grammatical function in Mandarin reflexive verbs. The morpholexical operation in LMT can alter the argument structure by adding, suppressing, or binding roles. Bresnan (1989: 297) indicates that \"suppression means simply that the role is syntactically unexpressed.\" Take the verb sha 'to kill' and zisha 'to commit suicide' for example again, the argument structure of sha 'to kill' is altered after the process of reflexivization or zi-prefixation. The verb sha 'to kill' has an argument structure (18). (18) sha 'kill'\\ta-structure < agent patient > \\t [-o]\\t[-r] \\t"]},{"title":"I\\tI","paragraphs":["f-structure","\\t S\\t0 The thematic roles agent and patient can project to or link to the grammatical function subject and object respectively. After the process of reflexivization, the verb zisha 'to commit suicide' has only one syntactically expressed function, subject. What happened to the thematic roles agent and patient in the mapping or linking process is the question to be solved in this study."]},{"title":"3.2 THE MORPHOLEXICAL OPERATION OF REFLEXIVIZATION","paragraphs":["We propose a lexical binding morpholexical operation to account for the phenomena of intransitive reflexive verbs. Take the verb zi-sha 'to commit suicide' for example, the reflexivization is illustrated in (19).","(19) sha 'to kill'\\t<ag pt>","lexical binding zi-sha\\tag-pt\\t\\ta-structure","t̀o kill oneself\\t[ -r\\t\\t intrinsic classification","S/0","\\twell-formedness condition","S\\t\\tf-structure • In the lexical binding operation (19), the reflexive morpheme zi- causes the two roles to fuse together. In addition, the composite role is intrinsically marked [-r]. The assignment of intrinsically classification [-r] to the composite role is data-driven. It will be proved in section 3.3 that the intransitive reflexive verbs are unaccusative verbs. Since they are unaccusative verbs, the role should be marked [-r] according to the LMT. The intrinsically classification [-r] of the composite role is a by-product of the lexical binding. In other words, the lexical binding operation, or, the prefixation of zi-, brings in two morpholexical effects: (i) two roles fuse together, and (ii) the reflexivization assigns [-r] classification to the composite role. In the following section, we will show that Mandarin intransitive reflexive verbs are unaccusative verbs. Since these verbs are unaccusative verbs, the intrinsically classification of the composite role is [-r]. In brief, the lexical binding operation assigns [-r] to the composite role. In the following section, we will first point out that the phenomenon of composite role is not unique. Furthermore, we will prove that the analysis that applies the concept of composite role is necessary and can properly account for the thematic properties of the subject of the intransitive reflexive verbs. Furthermore, we will justify why the morpholexical operation of lexical binding assigns a [-r] classification to the composite role."]},{"title":"3.2.1 WHY COMPOSITE ROLE","paragraphs":["In section 3.2.1, we first point out that the argument structure of resultative compound verbs also contains composite roles, and then explain why and how the subject of reflexive verbs is mapped from a composite role."]},{"title":"3.2.1.1 THE PHENOMENON OF COMPOSITE ROLES IS NOT UNIQUE","paragraphs":["It is not a unique phenomenon that the sole function of Mandarin reflexive verbs is mapped from a role","with two kinds of thematic roles. In the V-V structure of Mandarin (Chang 1991, Her 1997, and Huang and","Lin 1992), there is also one grammatical function which has not only agent properties but also patient properties.","(20) Zhangsan qi-lei\\tle\\tma","Zhangsan ride-tired ASP horse","Z̀hangsan rode the horse and got tired. One of the readings of sentence (20) is that Zhangsan rode the horse and got tired. The a-structure is like (21). (21) qi-lei <ag-exp, pt> The subject of the complex predicate qi-lei 'ride-tired' is mapped from the composite role which consists of 53 Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 48-59 agent and experiencer. The subject, Zhangsan, is both the agent, the one who rode the horse, and the experiencer, who got tired, at the same time. The abundant data of resultative verbs in Mandarin demonstrates that it is not a unique phenomenon that one role has two kinds of thematic properties in a verb's a-structure."]},{"title":"3.2.1.2 THE SUBJECT HAS TWO KINDS OF THEMATIC PROPERTIES","paragraphs":["Based on Dowty's distinction of thematic properties, we will examine the thematic properties of reflexive verb's subject. The principles for determining the thematic properties are listed in (22).","(22) Agent properties a. volition b. sentience (and/or) perception c. causes event d. movement e. referent exists independently of action of the verb We take the verb zi-sha 'to commit suicide' for example. Patient properties a. change of state b. incremental theme c. causally affected by the event d. stationary (relative to movement of proto-agent) e. referent may not exist independent of action of","verb, or may not exist at all","(23) bei-bao-xian-ren guyi\\tzi-sha\\t (24) tamen\\tjiti\\tzi-sha\\tshenwang","the insured\\tpurposely REFL-kill\\t they\\tmass\\tREFL-kill die T̀he insured committed suicide on purpose.'","\\t T̀hey died of mass suicide.' The subject of zi-sha 'to commit suicide' has the proto-agent properties (22a) volition and (22c) cause event. For example, if someone decides to commit suicide, s/he must have' the volition to do so as exemplified by sentence (23). In sentence (23), the reflexive verb co-occurs with the purpose adverb guyi 'on purpose', so the subject of the reflexive has the volition. Specifically, s/he has the ability to control the performance of the action of suicide. This action should also cause the event of suicide. In addition, the one who commits suicide must also be causally affected by the event (Patient Property c in 22) and undergoes the change of state (Patient Property a in 22) because of the event of suicide. S/he must be hurt or killed by herself/himself as exemplified by sentence (24). In addition, the subject of zi-sha 'to commit suicide' might also have the agent properties referent exists independently of action of the verb (Agent Property e in 22). The Agent Property e in 22 means that the participant is \"presumed to exist before and after the action\" (Dowty 1991: 573). The subject of zi-sha 'to commit suicide' exist before and after the action. In addition to the reflexive verb zi-sha t̀o commit suicide', the other reflexive verbs such as zi-nue 'to torture oneself' and zi-fen 'to burn oneself' have the same pattern. (25) Ta yin\\thuo zi-fen\\tshen-wang","he burn\\tfire REFL-burn die","H̀e burned himself and was dean.' Like the case of zi-sha 'to commit suicide', in the verb zi-fen 'to burn oneself' the one who burned himself/herself must have the volition to do so and cause an event of burning. Besides, s/he must also be burned and affected by the event. Moreover, in the case of zi-nue 'to torture oneself', the one who tortured himself/herself must also have the volition to do so and caused the event of torturing himself/herself. S/he must be hurt and affected by this event. In brief, the above discussion shows that the subject of Mandarin intransitive reflexive verbs is mapped from a composite role because it possesses not only agent properties but also patient properties. Thus, it is justified that the subject of intransitive reflexive verbs is mapped from a composite role."]},{"title":"3.2.2 JUSTIFICATION OF THE ASSIGNMENT [-r] TO THE COMPOSITE ROLE","paragraphs":["In this section, we will prove that all the intransitive reflexive verbs behave like unaccusative verbs syntactically. In the lexical binding morpholexical operation, the assignment of j-r] to the composite role ensures that the verbs which undergo the reflexivization become unaccusative verbs. 3.2.2.1 THE SYNTACTIC EVIDENCE •","This section demonstrates that syntactically the intransitive reflexive verbs are unaccusative verbs. Section 3.2.2.1.1 shows that some of the intransitive reflexive verbs can occur in the presentative construction. These verbs, by definition, are surface unaccusative verbs. Section 3.2.2.1.2 indicates that all of the intransitive reflexive verbs cannot take the durative marker -zhe. This piece of evidence shows a strong tendency that the Mandarin intransitive reflexive verbs are unaccusative verbs. 54 Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 48-59"]},{"title":"3.2.2.1.1 SURFACE UNACCUSATIVITY","paragraphs":["We mentioned in 2.3.1 that some of the reflexive verbs can occur in the presentative construction and some cannot. In addition, some of the reflexive verbs can occur in the post-posing of numeral phrase construction and some cannot as shown in 2.3.4. The reflexive verbs, such as zi-sha 'to commit suicide' and zi-fen 'to burn oneself' which can occur in these constructions are surface unaccusative verbs, because their subject appears in the canonical object position. By definition, they are surface unaccusative verbs, and the unaccusative participant should be intrinsically [-r] according to Bresnan and Zaenen (1990) and Zaenen (1994). As for those that cannot occur in the presentative constructions, they are possibly the deep unaccusative verbs. Because one cannot tell unergative verbs from deep unaccusative verbs simply in terms of syntactic behavior. As mentioned in Levin and Rappaport Hovav (1995: 19), \"diagndstics that rest on properties like 0-role assignment or the building of compositional semantics will show properties of deep unaccusativity.\" In other words, the subject of deep unaccusative verbs and the subject of unergative verbs are all occur in the pre-verbal position. However, the subject of deep unaccusative verbs has different properties from that of unergative verbs. Specifically, the subject of deep unaccusative verbs has the object-like or patient-like properties, while that of unergative verbs does not. Thus, we have to apply the other diagnostics in addition to the presentative constructions."]},{"title":"3.2.2.1.2 THE ATTACHMENT OF THE DURATIVE MARKER -ZHE","paragraphs":["Some studies (Kao 1993; Pan 1996) point out the significant correlation between the unaccusative verbs and the durative marker -zhe. We believe that this syntactic test has a semantic explanation. As pointed out by Li and Thompson (1981), \"an activity verb that signals a state associated with its activity meaning takes -the as the durative marker.\" According to this statement, we infer that the subject of a verb that can take a durative marker -zhe must be high in agentivity. The attachment of -zhe applied here is to show its ability of co-occurrence with action verbs (Li and Thompson 1981) rather than to show the other meaning that relates to the co-occurrence with stage-state verbs (Yeh 1993). The following examples prove that the above statement has empirical grounding. (26) Lisi zai lu-shang zou zhe\\t(28) *Lisi si zhe","Lisi at road-LOC walk DUR\\t Lisi die DUR","\\t\"Lisi is walking on the street.\"\\t(29) *Lisi dao zhe (27) Lisi zhan zhe\\t-\\t Lisi arrive DUR","Lisi stand DUR","\"Lisi is standing.\" Sentences (26) and (27) demonstrate that the action verbs can take the durative marker zhe, while sentences (28) and (29) show that the verbs which are not action verbs cannot take the durative marker -zhe. Also notice that the verbs in sentences (26) and (27) are unergative verbs, and those in sentences (28) and (29) are unaccusative verbs. In brief, if a verb can take a durative marker -zhe, it tends to be an unergative verb. On the contrary, if a verb cannot take the -the, it tends to be an unaccusative verb. Since all of the intransitive reflexive verbs cannot take -zhe, they should be classified as unaccusative verbs.' The following examples illustrate this point. (30)a.*Zhangsan zai fangjian\\tli\\tzi-jin zhe","Zhangsan at room\\tLOC suicide • ASP b. *Lisi yin\\tzhangxiang\\tBite\\ter\\tzi-bei\\tzhe","Lisi because\\tappearance\\tstrange\\tso REFL-dispise\\tASP c. *ta ju\\tqiang\\tzi-jin\\tzhe","he take\\tgun\\tsuicide\\tZHE d. *ta hen zi-ai\\tzhe • he very REFL-love ZHE The evidence from the Sinica Corpus, which contains 4 million tagged words, also supports the fact that reflexive verbs cannot take the durative marker -zhe. In the corpus, we only find one instance in which the reflexive verb takes -zhe.","\\t(1) to\\txianran\\tzai nuli zi-zhi\\tzhe \\t he\\tobviously PROG hard REFL-control DUR H̀e is obviously trying to control himself.'","We believe that this sentence stands for a special case. If we take out the word nuli 'work hard', this sentence","is still anomalous. Since there is only one special case that reflexive verbs co-occur with the durative marker","-zhe, we still hold the claim that reflexive verbs cannot take -zhe. 55 Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 48-59"]},{"title":"3.2.2.2 A VIEW FROM EVENT STRUCTURE","paragraphs":["The event structure proposed by Pustejovsky (1988) and modified by Grimshaw (1990) also supports the fact that Mandarin intransitive reflexive verbs are unaccusative verbs. She proposes the following event structure for transitive predicates (Grimshaw 1990: 26). (31) event activity\\tstate In (31) the event structure consists of an activity and a state. The event structures of unergative verbs and unaccusative verbs are (32) and (33) respectively (Grimshaw 1990: 27-40).","(32). Unergative verbs\\t (33). Unaccusative verbs event \\t event activityrocess1\\t state/chan e of state We will demonstrate that the event structure of all the reflexive verbs denotes a state. Consider the following sentences. (34) zuotian\\tzi-sha\\tle\\tyi\\tge guozhong\\txueshen aI,","yesterday REFL-kill\\tASP one CL junior high school student","Ỳesterday, a junior high school student committed suicide.' In sentence (34), the verb zi-sha denotes a state; that is, the student died. The event structure of zi-sha 'to commit suicide' focuses on the state of death rather than the activity of killing. Teng (1975) and Li and Thompson (1981) indicate that only action verbs may occur in the progressive or take the progressive marker zai. Almost every reflexive verb cannot co-occur with zai.56 (35) *Lisi zai zi-sha \\t (37) *Lisi zai zi-lian Lisi PROG REFL-kill \\t Lisi FROG REFL-love(narcissist) (36) *Lisi zai zi-bao \\t (38) *Lisi zai zi-jiu Lisi PROG REFL-protect \\t Lisi PROG REFL-save Since reflexive verbs cannot take the progressive marker zai, we claim that the reflexive predicates should denote a state rather than an activity in the event structure. Other reflexive verbs also have an event structure of state. Teng (1975) indicates that only state verbs may be modified by hen 'very'. For example, (39) youke hen zi-ai","tourist very REFL-love","T̀he tourists behave themselves well.' In sentence (39), the event must denote the state that the tourists have good manner. In other words, zi-ai 'to respect oneself' cannot be an event of activity. We will consider more examples such as zi-bei\\tIF- 'to feel oneself inferior', zi-bi\\tr 'to be autistic', zi-da\\tk 'to boast oneself, zi-jiu ifi\\t'to blame oneself , and so on. (40) ta hen\\tzi-bei","he very\\tfeel oneself inferior","H̀e feels himself inferior.' (41) ta\\then zi-da","he very REFL-boast","H̀e boasts himself.'"]},{"title":"5","paragraphs":["In Sinica Corpus, we find no reflexive verbs co-occur with the progressive marker zai. 6 The only exception found so far is the verb zi-wei"]},{"title":"4,1","paragraphs":["'to masturbate'. However, we believe that this phenomenon has an explanation. This reflexive verb is an euphemism of the other verb shouyin 'to masturbate'. The verb shouyin 'to masturbate' can take the marker zai. The usage of shouyin 'to masturbate' might influence or diffuse to that of its euphemism zi-wei 'to masturbate'. 56 Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 48-59","(42) to hen he very\\tREFL-close H̀e is very autistic.' In (40), (41), and (42), all the events are state rather than activity. Thus, the reflexive predicate denotes an event structure of state. According to Grimshaw's (1990), the event structure of unaccusative verbs is a state. The reflexive verbs and the unaccusative verbs have the same event' structure. In brief, the event structure provides additional evidence which supports the fact that reflexive verbs are unaccusative verbs. The subject of Mandarin intransitive reflexive verbs is an unaccusative participant and thus should be intrinsically marked [-r]."]},{"title":"3.2.2.3 AGENT PROPERTIES ARE DILUTED AFTER THE REFLEXIVIZATION","paragraphs":["The following evidence also shows that the intrinsically classification of the composite role should be [4]","rather than [-o]. After the reflexive morpholexical operation, the agent properties are reduced. To compare","with the verb sha 'to kill', the reflexive verb zi-sha 'to commit suicide' has less agent properties. Suppose the","adverb yi-bian . . .yi-bian 'at the same time, simultaneously' can be used to test the agentivity of the subject.'","(43) Zhangsan yi-bian\\tsha ren,\\tyi-ban\\tkuang-xiao","Zhangsan one-side\\tkill people\\tone-side crazy-laugh","Z̀hangsan killed people and laughed crazily at the same time.'","(44) *Zhangsan yi-bian\\tzi-sha,\\tyi-ban\\tkuang-xiao","Zhangsan one-side\\tREFL-kill one-side crazy-laugh","*̀Zhangsan committed suicide and laughed crazily at the same time.' (43) and (44) show that the subject of the verb sha 'to kill' is high in agentivity, so the verb sha 'to kill' can occur in the construction of yi-bian . . .yi-bian 'at the same time, simultaneously'. After the reflexivization, subject of the reflexive verb zi-sha 'to commit suicide' loses some agent properties, so the reflexive verb zi-sha t̀o commit suicide' cannot occur in the yi-bian . . .yi-bian construction. As indicated previously, the [4] participant is more like a patient role and the [-o] is more like an agent role. This is incorporated in the LMT itself (Bresnan and Zaenen 1990). The relatively low agentivity of the subject of reflexive verbs is one of the reasons that the morpholexical operation of reflexivization assigns the [-r] feature to the composite role."]},{"title":"4 EXPLAINING THE VARIATION OF SYNTACTIC BEHAVIOR","paragraphs":["We have indicated that not all of the intransitive reflexive verb can occur in the presentative construction and not all of the intransitive reflexive verbs can co-occur with the construction of post-posing of numeral phrase. In fact, not all of the intransitive reflexive verbs behave exactly the same. Based on this observation, we raised .a question: should we distinguish the reflexive verb zi-sha 'to commit suicide' from the other reflexive verbs and claim that only the reflexive verb zi-sha 'to commit suicide' is an unaccusative verb? The answer is that the various syntactic behavior of different reflexive verbs results from the difference between surface and deep unaccusativity. As defined in • Bresnan and Zaenen (1990), in languages with surface unaccusativity, the argument of an intransitive verb can appear overtly in object position(s) in surface constitute structure; in language with deep unaccusativity only, that argument appears only in surface subject position. In the following, we first summarize the variation in table 2, and then explain why we claim so. Table 2 shows the variation of the syntactic behavior of reflexive verbs presented in 2.3.","Table 2: The variation of the syntactic behavior of reflexive verbs. Syntactic Context zi-sha","t̀o commit suicide'","zi-ze 'to blame oneself","zi-lu 'to behave oneself","zi-fen 'to burn oneself'","zi-wu 'to hurt oneself'","zi-ai","'to respect oneself presentative construction -I- - -","-4- - .. postposing of numeral phrases -1-- - - -4- - - imperative construction + -I- -I- -I- -4-in the COMP of gitu 'to try' -1- - .. + - co-occurring with purpose adverb -+- -I- - -I- - taking durative marker -zhe — — — — — — Table 2 demonstrates that each reflexive verb has different syntactic behavior. Occurring in presentative construction is the syntactic evidence of surface unaccusativity, because the sole grammatical function, the subject, appears in the canonical object or post-verbal position. According to table 2, we observe that the 7 In the Sinica Corpus which contains 4 million words, we find 256 sentences with yi-bian . . .yi-ban, among which only) two items occur with the stative verbs, others are all occur with active verbs. 57 Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 48-59 intransitive reflexive verbs art rarely surface unaccusative Verbs. However, all of them are ifideed unaccusative verbs, as we have proved. In other words, we suggest that although all the intransitive reflexive verbs are unaccusative verbs, some of them display the pattern of deep unaccusativity and others that of surface unaccusativity. Specifically, the reflexive verbs zi-sha 'to commit suicide' and zi-fen 'to burn oneself' can occur in the presentative construction, that is, their subjects can appear in the post-verbal position, the canonical object position, so they are surface unaccusative verbs; while the subjects of other reflexive verbs cannot be post-verbal, they are deep unaccusative verbs."]},{"title":"5. THE COMPARISON","paragraphs":["The present analysis can properly account for the observed linguistic phenomena of reflexive verbs such as the thematic properties of the subject and the various syntactic behavior of each reflexive verb. Both Kao (1993) and Tang (1992) can only account for the partial truth. Kao's suppression of agent analysis fails to account for why the subject possesses some agent properties. In Tang's analysis, the reflexive morpheme zi- is moved from the object position and then incorporated into the matrix verb. As a result, the surface subject is also the underlying subject and the reflexive verbs are unergative verbs. This movement approach fails to account for why the reflexive verbs cannot take the durative marker –zhe and why the subject is low in agentivity. Furthermore, his analysis cannot explain why the intransitive reflexive verbs can occur in the context such as presentative constructions where the unaccusative verbs can occur.","Although our conclusion is the same as Kao's, the implications of the two analyses are strikingly different. Kao (1993) does not make a distinction between surface and deep unaccusativity. She asserts that all the reflexive verbs are unaccusative verbs because zi-sha 'to commit suicide' can occur in the presentative construction. However, she leaves those reflexive verbs which cannot occur in the same context unexplained. In other words, she overlooks the fact that not all of the intransitive reflexive verbs behave exactly the same. The present analysis claims that the intransitive reflexive verbs are unaccusative verbs. They are either deep unaccusative verbs or surface unaccusative verbs. The syntactic behaviors of two kinds of unaccusative verbs are different. Since some of the intransitive reflexive verbs, such as zi-sha 'to commit suicide' and zi-fen 'to burn oneself' are surface unaccusative verbs and others such as zi-ai 'to respect oneself' are deep unaccusative verbs, the syntactic behavior of the intransitive reflexive verbs are also different. In brief, we properly account for the observed syntactic variation among the class of intransitive reflexive verbs."]},{"title":"6 THE IMPLICATION","paragraphs":["We believe that the linguistic phenomenon of Mandarin reflexive verbs is one of the best examples to support Dowty's (1991: 608) view of thematic proto-roles. He claims that \"predicates that are 'high' in agentivity and 'low' in patient properties are invariably unergative, while those low in agent properties and high in patient properties are invariably unaccusative; only those high in both kinds of entailments, or low in both, should be unstable [italics mine].\" Speakers would recognize that the agent and the patient are the same one in the case of Mandarin reflexive verbs. We assert that Mandarin reflexive verbs are the best manifestation of this unstable case in the sense of Dowty (1991). The thematic properties of the subject of intransitive reflexive verbs are unstable, because the sole role of these verbs has two kinds of thematic properties. The only participant of the reflexive predicates is both the agent and patient. In other words, the one who performs the action and the one who receives the action are the same one. Because of the different proportion of agent properties and patient properties in the composite role, some of them can appear with the purpose adverb, and some of them can appear in the imperative construction, and some of them can occur in the presentative construction. Thus, some of them are surface unaccusative verbs and others deep unaccusative verbs. The fact that reflexive verbs have two kinds of thematic role properties supports Dowty's claim of the unstable case."]},{"title":"7. SUMMARY","paragraphs":["In this paper, first, we discuss the semantic composition and the internal structure of intransitive reflexive verbs in Mandarin, and then describe the linguistic phenomena of these verbs. It is observed that the sole argument of reflexive verbs has not only patient properties but also some agent properties. Second, we briefly discuss the analysis of unaccusativity in the framework of LFG. In this study, we propose a lexical binding morpholexical operation that assigns 1-r] to the composite role of Mandarin intransitive reflexive verbs. In LFG, an unaccusative participant is marked [-r]. The claim that the intransitive reflexive verbs are unaccusative verbs is proved by not only syntactic evidence but also semantic explanation and event structure. In addition, the present analysis can properly account for the linguistic facts of Mandarin reflexive verbs that the previous analyses cannot. Finally, the present analysis offers a new data to support the idea that the distinction between thematic roles is not discrete. 58 Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 48-59"]},{"title":"ACKNOWLEDGEMENTS","paragraphs":["The author would like to thank Prof. Claire Hsun-Hui Chang, Prof. One-Soon Her, Prof. Chu-Ren Huang, Prof. Huei-Ling Lai, and the anonymous reviewers of Paclic12 for their valuable comments. Any possible errors, however, are the author's responsibilities."]},{"title":"REFERENCES","paragraphs":["Alsina, Alex. 1994. Predicate Composition: A Theory of Syntactic Function Alternations. Ph.D. Diss. Stanford Univ..","Bresnan, Joan. 1989. \"The syntactic projection problem and the comparative syntax of locative inversion.\" Journal of Information Science and Engineering, 5(4):77--303. Special issue, Republic of China Computational Linguistics Workshops II 1989, Institute of Information Science, Academia Sinica, Taipei, Taiwan, Republic of China.","Bresnan, Joan and Annie Zaenen. 1990. \"Deep Unaccusativity in LFG.\" Grammatical Relations: A Crosstheoretical Perspective, Eds. by K. Dziwirek et al., 45-57. Stanford, CA: Center for the Study of Language and Information.","Chang, Hsun-huei. 1991. Interaction Between Syntax and Morphology: A Case Study of Mandarin Chinese. Ph.D. diss. The University of Hawaii.","Chang, Li-Li and Chu-ren Huang. 1995."]},{"title":"\"A -at tof s i","paragraphs":["[Postposing of Numeral Phrases in Mandarin].\"","Paper-Presented at the Joint Meeting of the Fourth International Conference on Chinese Linguistics and","Seventh North American Conference on Chinese Linguistics. The University of Wisconsin-Madison.","June 27-30, 1995. Chen, Ping. 1992. \"The Reflexive ziji in Chinese: Functional vs. Formalist Approaches.\" Research on .\\tChinese Linguistic in HongKong. Ed. T.Lee. Hong Kong: The Linguistic Society in Hong Kong. Chief, Lian-Cheng. 1996. \"An LFG .Account of Mandarin Reflexive Verbs.\" Paper presented at the LFG","Workshop, Grenoble, France, August 1996. ---. 1997a. \"Anaphoric Relations in Mandarin Reflexive Verbs.\" Paper presented at NACCL-9.","University of Victoria, Canada. May 2-4, 1997.","1997b. Reflexive Verbs in Mandarin Chinese. M.A. Thesis. National Chengchi University. Taipei. Chief, Lian-Cheng and Chen Pei-Chi. 1995. \"13 ilk n ten 47 it-\\t111ele.1 4E1 tui 14: la 1/ 4* it \"","Proceedings of Rocling VIII : 15-27. Taipei: The Computational Linguistics Society of R.O.C. CKIP Technical Report 95-2. 1995. Design Criteria for a Balanced Modern Chinese Corpus [\\tzfft","oo 3t4 /4 Pi 1.#1..\" A-M IM]. Taipei: Institute of Information Science, Academia Sinica. Dowty, David. 1991. \"Thematic Proto-Roles and Argument Selection.\" Language 67 (3): 547-619. Grimshaw, Jane. 1990. Argument Structure. Cambridge: MIT. Her, One-Soon. 1997. \"The Lexical Mapping Theory and Mandarin Resultative Compounds\" ms. National","Chengchi University. Huang, Chu-Ren and Fu-wen Lin. 1992. \"Composite Event Structures and Complex Predicates: A Template-","based Approach to Argument Selection.\" Proceedings of the Third Annual Meeting of the Formal","Linguistics Society of Mid-America: 90-108. Huang, Yan. 1994. The Syntax and Pragmatics of Anaphor: A Study with Special Reference to Chinese.","Cambridge: Cambridge. Kao, Rong-Rong. 1993. • Grammatical Relations and Anaphoric Structures in Mandarin Chinese. Taipei:","Crane. Levin, Beth and Malka Rappaport Hovay. 1995. Unaccusativity: At the Syntax-Lexical Semantics Interface.","Cambridge: MIT. Li, Charles and Sandra Thompson. 1981. Mandarin Chinese: A Functional Reference Grammar.","California: Berkeley. Pan, Haihua. 1996. \"Imperfective Aspect ZHE, Agent Deletion, and Locative Inversion in Mandarin","Chinese.\" Natural Language in Linguistic Theory: 14: 409-432. Perlmutter, D. M. 1978. \"Impersonal Passives and the Unaccusative Hypothesis.\" In Proceedings of the","Fourth Annual Meeting of the Berkeley Linguistics Society, 157-189. Berkeley Linguistics Society, •\\tUniversity of California, Berkeley. Pustejovsky, James.. 1992. \"The Syntax of Event Structure.\" Lexical and Conceptual Semantics. Eds. Beth","Levin and Steven Pinker. Cambridge: Blackwell. Sung, Li-May, and Peter Cole. 1994. \"Head Movement and Long-Distance Reflexives.\" Linguistic Inquiry","25: 355-405. Tang, C. C. Jane. 1989. \"Chinese Reflexives.\" Natural Language and Linguistic Theory 7: 93-121. Tang, Ting-Chi. 1992. \"Anaphors in Chinese Syntax and Morphology.\" Tsing Hua Journal of Chinese","Studies 22: 301-349. Teng, Shou-hsin. 1975. A Semantic Study of Transitivity Relations in Chinese. Taipei: Student Book. Xu, Liejong. 1993. \"The Long-Distance Binding of zzji.\" Journal of Chinese Linguistics 21: 123-42. Yeh, Meng. 1993. \"The Stative Situation and the Imperfective ZHE in Mandarin.\" Journal of the Chinese","Language Teachers Association 28: 69-98. Zaenen, Annie. 1994. \"Unaccusativity in Dutch: Integrating Syntax and Lexical Semantics.\" In James","Pustejovsky, editor, Semantics and the Lexicon. Kluwer Academic Publishers, Dordrecht, pages 129--161. 59"]}]}