{"sections":[{"title":"","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 94-105"]},{"title":"The Acquisition of Functional Categories: Data from Japanese* Yoshie Yamashita Naruto University of Education","paragraphs":["While demonstratives and other determiner-like words in English are part of the functional system, their Japanese counterparts are simple lexical categories. The semantic theory (e.g. Brown & Fraser 1963) predicts that these elements must emerge at a later stage in both languages since they denote relatively abstract and complex meanings; whereas Radford's (1990) maturational theory makes no such predictions about Japanese. In replicating O'Grady's (1993) Korean study, I collected both production and comprehension data for Japanese. The data indicates that despite their categorial status (i.e. lexical categories), these determiner-like elements emerge quite late. Since the late emergence of these elements in both Japanese and English can be attributed to their relatively abstract semantics, there is no reason to attribute the late acquisition of English determiners to their categorial status (i.e. functional categories). Thus, just like O'Grady's Korean data, the Japanese data seems to support the semantic theory."]},{"title":"1. Introduction","paragraphs":["Radford (1990) has proposed a theory of language acquisition that makes crucial use of the distinction between lexical and functional categories (e.g. Fukui 1986). The central claim is that there are three distinct stages of development. Table 1 summarizes the three stages and their characterization (taken from O'Grady 1993: 1).","Table 1. Three stages of syntactic development","Stage\\tCharacterization","precategorial\\tone-word utterances, no categorial structure 2\\tlexical (20 mos., ±20%)\\tsystem of lexical categories and phrases 3\\tfunctional (24 mos., ±20%) system of functional categories","As indicated in Table 1, Radford's theory implies a developmental gap between the second and the third stages with a specific age difference. Providing data from English acquisition, Radford indicates that the lexical system indeed emerges before the functional system.' He further argues that the timing difference between the acquisition of the lexical system and the functional system is determined by different biologically determined stages of 'maturation' of Universal Grammar (UG). If this timing difference is determined by UG, every language should show the same timing difference in child acquisition data, since this difference in timing is genetically determined.","O'Grady (1993) has challenged Radford's maturational theory based on the comparative study of determiner-like words in Korean and English. The rational for this comparison lies in the assumption that whereas demonstratives and other determiner-like words in English (the, a, this, some, etc.) are part of the functional system, their Korean counterparts are simple lexical categories (ibid.: 7).2","A second key point in his study is that the UG-based maturational theory put forward by Radford was examined side by side with the semantic theory, which states that words which have rather abstract and complex meanings (regardless of their categorial status) are acquired relatively late (cf. Brown & Fraser 1963, Brown 1973).","Thus, these two theories make different predictions about the emergence of demonstratives and other determiner-like elements in Korean and English. The semantic theory predicts that these elements must emerge at a later stage in both languages since they denote relatively abstract and complex meanings; whereas the maturational theory makes no such predictions about Korean (O'Grady ibid.: 8-9). Table 2 summarizes these differences. * This paper is a revised version of part of the author's dissertation. I would like to thank William O'Grady for valuable discussions and suggestions on the design of the experiments. My thanks also go to Linda Wilkins and anonymous reviewers for their helpful comments. 1. The lexical and functional categories will be discussed later in Section 2. 2. This assumption was based on Fukui's (1986) analysis of Japanese demonstratives and other determiner-like elements. His analysis will be included later in Section 4."]},{"title":"94","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 94405 Table 2: Predictions about the development of demonstratives and other determiner-like words in English and Korean Language\\tThe semantic theory English\\trelatively late Korean\\trelatively late","O'Grady has looked into speech samples collected from five Korean-speaking children and reported that demonstratives and other determiner-like elements in Korean seemed to develop relatively late since they did not occur in the speech of children under age 3 (ibid.: 11). The data from Korean suggests that determiner-like elements in Korean are acquired no earlier than their English counterparts. According to O'Grady, since the late acquisition of these elements in both Korean and English can be attributed to their relatively abstract semantics, there is no reason to attribute the late acquisition of English determiners to their categorial status (i.e. functional categories) (ibid.: 12).","Using the same line of reasoning as in O'Grady's Korean study, the present study examined Radford's maturational theory in the light of data from the acquisition of Japanese. In the attempt to go beyond O'Grady's study, I took two steps: first, I looked into naturalistic data for the development of demonstratives and other determiner-like elements in Japanese, and then conducted a cross-sectional experiment for the comprehension of Japanese demonstratives.","The rest of the paper is organized in the following fashion. In Section 2, we summarize Radford's acquisition theory along with the evidence he has provided for the lexical-functional distinction. Section 3 introduces two competing theories which seek to account for the developmental facts. The rational for examining the issue based on the data from Japanese will be included in Section 4. Section 5 presents data from the acquisition of Japanese. Section 6 includes conclusion."]},{"title":"2. Radford's theory of categorial development","paragraphs":["Three distinct stages are posited in Radford's (1990) theory of categorial development: precategorial, lexical and functional stages (see Table 1 in Section 1).","The initial one-word stage is considered to be 'pre-categorial,' i.e., single words produced in isolation have not yet been categorized syntactically. Children's language at this stage is therefore 'asyntactic' (i.e. having no true syntactic structures) (ibid.: 2).","However, in the course of the next few months, children start combining words and producing strings of words. The onset of the next stage is characterized by a sudden increase in the size of their vocabulary and the emergence of the four primary 'lexical categories' (N, V, A, and P) - hence it is called 'lexical stage.'","There are two important things to be noted here. First, children's language during this period exhibits combinatorial patterns which reflect the interaction of the set of lexical categories and the X-bar schema. The following table summarizes such combinatorial patterns: The maturational theory relatively late no prediction","[Based on O'Grady's (ibid.: 9) summary table]","Table 3. Combinatorial patterns in the lexical stage Phrasal Categories Combinatorial patterns \\t","NPs\\tN + complement Modifier + N Possessor + N \\t",". VPs\\tV + complement Modifier + V Subject + V \\t","PP s\\tP + complement Modifier + P (tare) Subject + P \\t","A P s\\tA + complement (very rare) Modifier + A Subject + A cup tea, picture Gia nice book, good girl Mummy car, baby cup open box, go in more write, no go in there Daddy gone, Hayley draw boat with ball, in bag right down, back in Doggy down, mouse in window good to me very good, bit hot Lisa naughty, hand cold [Based on O'Grady's (1993.: 2) summary table] Examples (ibid.: 62ff) (ibid.: 70ff) (ibid.: 72ft) (ibid.: 76ff)"]},{"title":"95","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 94-105","Radford (ibid.) claims that these combinatorial patterns air instantiations of phrasal projections based on the X-bar schema: Specifier Modifier\\tX' X","\\t Complement Radford takes the specifier position to be filled by possessors in the case of Ns. Thus, for the NP combinatorial patterns, the following structures are assigned. (1)","(2) N + complement NP N' N\\tNP cup\\ttea","Possessor + N NP NP Mummy\\tcar","Modifier + N NP N' nice N' N book","What is absent from children's speech at this stage is so-called 'functional categories'-determiners (the, a, this, some, etc.), complementizers (tha4 whether, if), and inflections (e.g. tense suffixes, modal auxiliaries, and the infinitival marker to).3 This is the second characteristic of children's speech during the lexical stage, which differentiates this stage from the next stage.","The next stage is characterized by the emergence of the functional categories, which makes children's speech much more adult-like. The following are some examples from the speech of a 26 year-old girl which include the D category (ibid.: 278ff). (3)","\\t","a. Utterances containing referential and quantificational determiners","that one; that sweetie, that candle; those pigeons; those ones, the little boy, a","teddy, a vest, a new car, another Wispa bar, some flowers;","b. Utterances containing possessive determiners,","mummy's chocolate; daddy' s ; mummy' s and daddy's"]},{"title":"3. Explaining the developmental facts: Radford's UG-based maturational theory vs. the semantic theory","paragraphs":["Why do the functional categories emerge at a relatively late stage in the course of linguistic development? Radford adopts a maturational explanation for this phenomenon, which correlates developmental changes in a linguistic system to the maturation of neurological growth. Each stage created by the maturation of a new system follows a biological timetable. So, at Maturational stage 1(Ml) System 1(S1) emerges; at M2 a new system matures yielding S1 +S2; at M3 another new system matures yielding S1 + S2 + S3 and so on (e.g. Felix 1992, Borer & Wexler 1987; Guilfoyle & Noonan 1992). Since 'different principles of Universal Grammar are genetically programmed to come into operation at different biologically determined stages of maturation' (Radford . ibid.: 274), the gap between the lexical stage and the functional stage is simply a maturational gap.","On the other hand, developmental psychologists proposed a hypothesis for the same phenomena based on semantic complexity and abstractness. Brown & Fraser (1963: 195) and Brown (1973: 75) argued that the timing difference resulted from the greater abstractness and complexity in the semantics of functional categories (which they called Ifunctors). According to them (ibid.), lexical categories (which they called 'contentives) are 3. The framework that Radford assumes here is that of Government and Binding Theory, in the version outlined in Chomsky (1986) where these morphemes are grouped together under the inflection' category. Since the focus of the present study is on the emergence of demonstratives and other determiner-like elements, further discussions on the C and I categories will be not be included."]},{"title":"96","paragraphs":["(4)\\tJapanese NP ano","\\t hon English DP NP that\\tbook Language,. Information and Computation (PACLIC12), 18-20 Feb, 1998, 94-105 acquired before functional categories since the former has a relatively concrete meaning more identifiable by the child.","According to Radford, the semantic theory in fact refers to a cognitivist account of the order of acquisition, since it implies that the relatively late emergence of functors is due to the lack of cognitive capacity to handle the relevant abstract concepts (ibid.: 268). Radford provided the following reasons for rejecting the semantic theory: first, there is no independent way of determining the child's cognitive capacity for processing abstract meaning at any level; second, cognitive-based proposals are imprecise in the sense that there is no independent way of measuring presumably different degrees of abstractness associated with contentives and functors; and finally, the theory lacks further theoretical implications (e.g. it makes no predictions as to whether may will be acquired earlier or later than the determiner the) (ibid.: 268).","O'Grady (1993) provided a different perspective for the whole issue and found a different approach to the problem. In fact, he made a strong and important argument against the points which Radford made in rejecting the semantic theory. As O'Grady argued (ibid.: 5), the inability of a discipline to find a way to measure a particular phenomenon (e.g. an existence of various degrees of 'concreteness' or 'abstractness) has nothing to do with whether it exists or whether it is responsible for some other phenomenon.","O'Grady's approach is based on the assumption that the categorization processes differ from one language to another. That is, certain words and morphemes which belong to functional categories in one language are not functional categories in other languages, which leaves us some opportunity to test Radford's UG-based theory against the semantic theory. The language to be contrasted to English was Korean. According to O'Grady (ibid.: 8), whereas demonstratives and • other determiner-like words are instances of a functional category (Det) in English, their counterparts in Korean are a subtype of A (i.e. lexical category). This analysis was in fact adopted from Fukui's (1986) analysis for Japanese. 4. Demonstratives in Japanese","Fukui (1986) argues that there is no D-system (hence no determiners) in Japanese. Thus, he assumes the following structure for ano hon 'that book.' The English structure is included as a contrast: The single most significant piece of evidence comes from that fact that demonstratives such as kono ano Mat', and sono 'that/the' in Japanese do not have the crucial property of functional categories - namely, they do not 'close off the syntactic projection (ibid.: 204). Consider the following examples, in which demonstratives are italicized (ibid.: 205): (5)","\\t","Japanese\\tEnglish. a. kono hon\\tthis book b. akai John-no ano hon\\t*red John's that book The examples above indicate that, unlike English demonstratives, Japanese demonstratives can be preceded by modifiers such as an adjective as in . (5b). Fukui (ibid. : 206) argues that since these facts show that Japanese demonstratives behave like English prenominal modifiers, they do not have the property of closing off the projection of a noun. For him, demonstratives kono, sono, and ano are simply demonstrative adjectives (hence As). Moreover, as expected in light of their status as As, Japanese demonstratives cannot occur without an N.","(6)\\tDcmonstratiye without an N \\tAdjective without an N *Kono-wa\\t *Ookii-wa ii. 'This one is good.'\\tThe big one is good.' 97 Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 94-105","Just as demonstratives in Korean were used to evaluate the wo competing theories in O'Grady's (1993) study, demonstratives in Japanese can be used for that purpose based on the same line of reasoning. The semantic and UG-based maturational theories make different predictions about the emergence of demonstratives and other determiner-like elements in Japanese and English. That is, the semantic theory predicts relatively late emergence of these elements in both languages since they have relatively abstract meanings. On the other hand, the UGbased maturational theory predicts relatively late emergence of English demonstratives and other determiner-like elements since they are functional categories. However, since it does not claim that all elements in one category should necessarily emerge at the same time, it makes no such prediction for their counterparts in Japanese. The following table summarizes these different predictions: Table 4. Predictions about the development of demonstratives and other determiner-like elements in English and Japanese Language\\tThe semantic theory\\tRadford's maturational theory English\\trelatively late\\trelatively late Japanese\\trelatively late\\tno prediction"]},{"title":"5. The study","paragraphs":["Japanese data was collected to see at what age demonstratives and other determiner-like elements emerge in the course of syntactic development. I present the first part of the study which is based on the longitudinal speech sampling from a Japanese-speaking child. I then present the second part in which a cross-sectional experiment was employed to specifically assess children's knowledge of Japanese demonstratives."]},{"title":"5.1. Longitudinal speech sampling4","paragraphs":["SUBJECT and PROCEDURE For naturalistic data, I used part of Okubo's (1981) data. Her data is a collection of dialogues between the child T (male) and his mother, which were tape-recorded for approximately two hours per month and then transcr ibed in Japanese script by the mother. Samples of T's speech from 12 to 30 months of age, which were taken from Volume-III and IV of Okubo's (ibid.), were analyzed for several determiner-like elements – demonstratives (kono 'this', ano 'that', and Sono 'that/the') and genitive no. RESULTS The overall results indicate that both demonstratives and the genitive no were acquired at a relatively late stage. The genitive started to appear at around 24 months of age. However, the accuracy rate did not reach above 90% until the age of 26 months (i.e., instances of incorrect use were missing the morpheme).","The development of demonstratives was further delayed. There was one instance of kono 'this' at the age of 24 months (kono obatyan 'this lady), but the child occasionally made mistakes in the use of the demonstrative until the age of 29 months (i.e., Errors such as the use of the wrong form *kore-no or the absence of the following noun persisted for the five months). The other two demonstratives never occurred in the speech samples. Although the data for demonstratives were limited, it indicates that the child acquired demonstratives at around the age of 29 months, which is a relatively late development (cf. genitive no at 26 months)."]},{"title":"5.2. Cross-sectional experiment","paragraphs":["In the previous section, we have obtained the preliminary results that determiner-like elements in Japanese are acquired at a relatively late stage (i.e. 26-29 months old). The data, however, was from only one child and the number of occurrences of demonstratives was considerably small throughout the recordings.","The next step then was to design cross-sectional experiments: children inevitably have to know about or use particular morphemes in order to perform given tasks, although they may never have to produce them in their spontaneous speech.","A series of experiments was conducted to examine the development of the determiner-like elements in Japanese. Only the experiment which tested children's comprehension of demonstratives will be included below. SUBJECTS Ninety-nine young children from age 1;8 to 6;7 (year, month) were selected from Akama Daycare Center in Fukuoka, Japan. However, twelve children (five one-year olds and seven two-year olds), who were either unable to respond or unable to complete all the tasks in the experiments, were excluded from this study. The subjects 4. The data reported here were extracted from the author's previous study (Yamashita 1990) for the current study. 98 Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 94-105 were divided into five age groups at one-year intervals: two, three, four, five, and six years old. Five adults who are native speakers of Japanese were also included as a control group. Eighty-seven children and five adults participated in this experiment. Table 5 records the number of subjects in each age group who participated in the experiment.","Table 5. Five age groups and the number of subjects in each group Age group (year)\\t2\\t3\\t4\\t5\\t6\\tAdults\\tTotal Number of subjects\\t9\\t14\\t26\\t20\\t18\\t5\\t92 MATERIALS Three deictic demonstratives (kono 'this', sono\\tano 'that...over there) were used. The following table summarizes these demonstratives.","Table 6. Three demonstratives and their deictic use Demonstrative + N\\tDeictic use kono kaban 'this bag'","\\t refers to things close to the speaker sono kaban 'that bag'","\\t refers to things close to the hearer ano kaban 'that bag there'","\\t refers to things away from both the speaker and the hearer As we can see in Table 6, children need to understand both the semantics of deicticity and the forms of the demonstratives in order to use these forms correctly. In this experiment, children's knowledge of these demonstratives was tested in two different contexts: one in which the children's perspective was the same as the experimenter's perspective (Session 1), and the other in which their perspective was different from the experimenter's perspective (Session 2). These two contexts will be illustrated in the procedure.","Six different sets of toy animals (i.e. a dog, a rabbit, a bear, a monkey, a cat, and a frog) were used in this experiment. Each set had three identical animals. In addition to these animals, two toy birds of different sizes and three balls of different colors (red, blue, and yellow) were used in the practice sessions. PROCEDURE The children were tested individually in a small room at the daycare center. The experimenter (myself) spent some time playing with each child prior to the experiment. The experiment was video-taped for each child. The whole process was assisted by a student at Fukuoka University of Education and often facilitated by teachers at the daycare center. Adults were tested on separate occasions. The results from adults will be presented together with those from children.","In older to ensure that the child understood the task, we had a practice session prior to the comprehension test (Session 1). First, the experimenter introduced each animal, two toy birds, and three balls to the child and let the child play with them for a while. During this play session, the experimenter made sure that the child knew the name of each animal, the word for birds, the word for balls, and the names of the colors. After that, the experimenter sat right next to the child so that the child's perspective was the same as the experimenter's perspective. Then, the experimenter placed the big bird immediately in front of the child and the small one farther away (but still in front). The following diagram illustrates the positions of the child and the experimenter, and the two birds in relation to the child's position. X X EC Figure 1. Positions occupied by the child (C) and the experimenter (E). The 'X' indicates positions of two objects. Then, looking into the child's face, the experimenter asked, Dokii tori totte tyoodai (Please get me the big bird)' and waited for the child's response. The same procedure was repeated for the small bird. The toys were not 99 Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 94-105 replaced after correct or incorrect responses in this practice or the rest of the experiments. None of the children failed to respond correctly in the practice session, which meant that they understood the basic task.","After the practice session, the comprehension test began. As in the practice session, the experimenter sat right next to the child (i.e. the child's perspective = the experimenter's perspective). Two identical dogs were arranged in such a way that one was right in front of the child and the other farther way (but still in front) (cf. Figure 1). Next, the experimenter asked, 'An° wantyan totte tyoodai (Please get me that dog)' and waited for the child's response. Then, the experimenter asked, ?ono wantyan totte tyoodai (Please get me this dog)' and waited for the child's response. Thus, the child's task was to pick the correct object in responding to the experimenter's request. The same procedure was repeated for the other five sets of animals. Regardless of correct or incorrect responses, the experimenter praised the child after each response.","The first request alternated between those with kono + N 'this N' and ano + N 'that N'. There were 12 tokens altogether. For half of the children, the stimulus with kono + N 'this N' was given first, but for the other half, ano + N 'that N' was given first. In all the trials, the experimenter looked into the child's face while making the requests.","In Session 2, another practice session was given prior to the comprehension test since the context in which demonstratives were used was different from Session 1. In the practice session, the experimenter sat facing the child so' that the child's perspective was different from the experimenter's perspective. The experimenter then placed three balls in such a way that one was close to the child, another to the experimenter, and the other farther away from both of them. The following diagram illustrates the positions of the child and the experimenter, and the three balls in relation to the child's and the experimenter's positions. E X X C. Figure 2. Positions occupied by the child (C) and the experimenter (E). The 'X' indicates positions of three objects. Then, the experimenter asked, Àkai booru tone tyoodai (Please get me the red ball)' and waited for the child's response. The same procedure was repeated for the other two (blue and yellow) balls. Again, the experimenter made the requests looking into the child's face, not looking at the object being requested. In this practice session, all the children were able to respond correctly, which meant that they understood the basic task.","After the practice session, the comprehension test began. As in the practice session, the experimenter sat facing the child (i.e. the child's perspective the experimenter's perspective). Three identical dogs were arranged in such a way that one was close to the child, another close to the experimenter and the other farther away from both of them (cf. Figure 2). Then, the experimenter asked, 'An° wantyan totte tyoodai (Please get me that dog over there)' and waited for the child's response. The experimenter made the same request with sono wantyan 'that dog' and kono wantyan 'this dog' and waited for the child's response each time. The same procedures was repeated for the other five sets of animals.","The choice and the order of the demonstratives in the experimenter's request were randomized among the 18 trials. One third of the children started with kono + N 'this N', another third with sono + N 'that N', and the remaining children with ano + N 'that N over there'. Again, the experimenter looked into the child's face while making the requests. ANALYSIS For both sessions, the subjects' responses were categorized as being either correct or incorrect based on the selection of the object that matched the stimulus. Only the responses to the first stimulus for each animal set were counted for each subject, since the chances of the children responding correctly to the second and the third stimuli were always higher than the preceding one (i.e. one out of two and one out of one, respectively). Thus, the number of responses from each child corresponded to the number of animal sets, which amounted to six. The frequency of correct responses was counted, and the percentage of correct responses was calculated for each age group."]},{"title":"100","paragraphs":["80' 70 \"1 60 - 40 30 \\t 1 762\\t3\\t4\\t5","Age group (year)","Graph 1. Developmental trend for demonstratives used in the two-way system Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 94-105 SE1TING A MINIMUM LEVEL OF COMPETENCE Since the main concern was to identify children's minimum knowledge rather than their accuracy rate in each experiment, the crucial cutoff point was determined based on whether they exhibited a minimum level of competence. For each experiment and for each age group, the minimum level of competence was calculated along with tables for the binomial probability of success (Aiken 1955). The binomial probability of success for each age group can be derived from the level of pure chance (e.g. 50% for getting heads vs. tails when flipping a coin) and the number of trials (e.g. the number of subjects multiplied by the number of trials for each subject). By setting the level of statistical significance as below 0.05 (P < 0.05), a criterion for responding correctly beyond the level of chance for each age group was found in the tables mentioned earlier. The binomial probability of success for each age group will be included in the results from each experiment as a criterion. RESULTS AND DISCUSSION Session 1: Kono + N\\tN' and ano + N 'that N'","The percentage of correct responses for each stimulus type and for each age group is summarized below. The criterion for the minimum level. of competence for each age group is included at the bottom of the table. Table 7. The percentage of correct responses for kono + N 'this N' and ano + N 'that N' and for each age group (%) Age group (year)\\t2\\t3\\t4\\t5\\t6\\tmean\\tAdults kono + N 'this N' 50.0\\t523\\t62.8\\t73.3\\t72.2\\t62.1\\t100.0 ano + N 'that N'\\t22.5\\t45.2\\t55.1\\t60.0\\t77.7\\t52.1\\t100.0 mean\\t36.2\\t48.8\\t58.9\\t66.6\\t75.0\\t57.1\\t100.0 Criterion for the\\t62.9\\t59.5\\t57.3\\t58.3\\t54.6\\t59.0 minimum level of competence The results of a 5(age group) X 2(starting stimulus type) X 2(stimulus type) analysis of variance indicates that there was a significant main effect for age group (F(4) = 5.667, = 0.0005). The main effects for starting stimulus type and for stimulus type were not significant. This means that there was no significant difference between the subjects who started with kono + N 'this N' and ano + N 'that N', or between the two types of tokens (i.e. kono + N 'this N' and ano + N Mat N).","The main effect for age group was further analyzed for the differences between the two-year and the three-year-olds, the three-year and the four-year-olds, the four-year and the five-year- olds, and the five-year and the six-year-olds. The results of this post hoc analysis indicate that the differences within the adjacent age groups were not significant.","The results indicate that only the five-year-olds and six-year-olds reached the corresponding minimum level of competence. Since the score from the four-year-olds for ano + N 'that N' was below the corresponding criterion (i.e. 55.1% < 58.9%), their' overall performance needs to be reassessed downward.","The mean percentages are converted into a graph to illustrate the developmental trend.","In summary, five years of age may be the crucial cutoff point for understanding the demonstratives used in the two-way system."]},{"title":"101","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 94-105 Session 2: Kono + N 'this N', sono + N 'that N', and ano + N 'that N over there'","The percentage of correct responses for each stimulus type and for each age group is summarized in Table 8. The criterion for the minimum level of competence for each age group is included at the bottom of the table.","Table 8. The percentage of correct responses for kono + N 'this N', sono + N 'that N', and ano + N 'that N over","there' and for each age group (%) Age group (year)\\t2\\t3\\t4\\t5\\t6\\tmean\\tAdults kono + N 'this N'\\t5.5\\t0.0\\t13.4\\t29.3\\t27.7\\t15.2\\t100.0 sono + N 'that N'\\t77.7\\t623\\t68.2\\t88.0\\t44.4\\t68.1\\t100.0 ano + N 'that N over there'\\t11.1\\t50.0\\t20.1\\t21.4\\t50.0\\t30.5\\t100.0 mean\\t31.4\\t37.4\\t33 .9\\t46 .2\\t40 .7\\t37.9\\t100.0 Criterion for the minimum \\t44.4\\t42.8\\t40.0\\t40.8\\t42.0\\t42.0 level of competence The results of a 5(age group) X 3(starting stimulus type) X 3(stimulus type) analysis of variance indicate that the only significant main effect was for stimulus type (F(2) = 27.796, P = 0.0000).","The main effect for stimulus type was further analyzed for the differences between sono + N 'that N' and ano + N 'that N over there', and kono + N 'this N' and ano + N 'that N over there'. The results of this post hoc analysis indicate significant differences between sono + N 'that N' and ano + N 'that N over there' (F(1) = 22.089, P = 0.0000), and kono + N 'this N' and ano + N 'that N over there' (F(1) = 6.712, P = 0.0244). This suggests that the greatest difficulty laid with sentences including kono + N 'this N' and the least difficulty with sentences including sono + N 'that N'.","The results from Session 2 indicate that overall the children performed very poorly (mean = 37.9%, compared to the criterion of 42.0%) and that none of the age groups reached the corresponding criterion with all three stimulus types, although the older children did reach the corresponding criterion with some types of stimuli (see Table 8). The results also indicate that age group was not a significant factor for the differences. This means that there were greater individual differences in the comprehension of the demonstratives used in the context which the children's perspective was different from the experimenter's perspective. As a comparison with the results from Session 1 shows, the comprehension of the demonstratives was easier when the children's perspective was the same as the experimenter's (mean 57.1% vs. 37.9%). The results from Session 2 also indicate that sono + N 'that N' was easiest and kono + N 'this N' was hardest.","Strangely, the six-year-olds did not perform better than the five-year-olds (mean 40.7% vs. 46.2%). Although the age difference was not significant, the score for sono + N 'that N' from the six-year-olds (i.e. 44.4%) was even lower than those from the younger groups.","While the scores for sono + N 'that N' from the two-year, the three-year, the four-year, and the five-year-olds were fairly high (i.e. 77.7%, 62.3%, 68.2%, and 88.0%, respectively), their scores for kono + N 'this N' were quite low (i.e. 5.5%, 0.0%, 13.4%, and 29.3%, respectively). In contrast with the disproportionately better performance on sono + N 'that N' by the younger children, the scores for kono + N 'this N' and sono + N 'that N' from the six-year- olds did not show such a disproportion (i.e. 27.7% vs. 44.4%), though these scores were not near the corresponding competence levels.","The results from the error analysis indicate that the younger children consistently selected objects that were directly in front of them, which increased their chance of responding correctly to sentences that include sono + N 'that N'. The following diagram illustrates this situation: E Y X* C Figure 3. Positions occupied by the child (C) and the experimenter (E). X, Y, and Z indicate positions of the objects. (Sono + N 'that N' refers to X, kono + N 'this N' refers to Y, and ano + N 'that N over there' refers to Z.)"]},{"title":"102","paragraphs":["6 730 \\tI\\ti","1\\t2\\t3\\t4\\t5 Age group (year) Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 94-105 In the comprehension test, sono + N 'that N' was used to refer to objects in the X position in the diagram, which were directly in front of the children. Thus, the more consistently they selected only objects in the X position, the higher the chances of their correct responses to sentences that included sono + N 'that N' became.","The data indicates that the two-year-olds selected objects in the X position 81.4% of the time, the three-year-olds 57.1% of the time, the four-year-olds 63.4% of the time, and the five-year-olds 77.1% of the time.","On the other hand, the six-year olds selected objects in the X position only 39.8% of the time. Thus, although the mean score from the six-year-olds was lower than that of the five-year-olds, and their score for kono + N 'this N' was lower than that of the younger children, their better balanced performance at least implies that they did not consistently select objects that were directly in front of them. This in turn means that the high scores for sono + N 'that N' from the children under five years old did not necessarily correspond to their level of understanding sono + N 'that N'.\\t•","The mean percentages in Table 8 are converted into a graph to illustrate the developmental trend. Graph 2. Developmental trend for demonstratives used in the three-way system","• In summary, even the oldest children had not acquired the overall system of deictic contrasts associated with Japanese demonstratives, especially when they were used in the three-way system, though the children older than five seem to have acquired the two-way demonstrative system.","Before I present a summary table, the contrasting performance by the children in the first session and the second session needs to be discussed. That is, the results from the experiment indicate that the children performed worse in the second session, in which the child and the experimenter sat facing each other (i.e. Session 1: 57.1% vs. Session 2: 37.9%). In this particular context, children needed to shift their perspective so that they could use the speaker as reference point. In contrast, the situation in the first session did not involve a perspective shift since the children's perspective was the same as the experimenter's. The following diagrams illustrate this point. <Perspective shift is re• 'red> Reference point","<No perspective shift is re a uired> Reference point Figure 4. Two contexts for the use of deictic terms: Positions occupied by the child (C) and the experimenter (E), and positions of objects (Xs)","Thus, the higher mean score from the first session suggests that the comprehension of demonstratives was easier when the children did not have to shift their perspective. This may suggest that the greater difficulty found in the second session was due to the fact that the comprehension of the demonstratives in that particular context required the children to shift their perspective. It is plausible to speculate that a high degree of spatial"]},{"title":"103","paragraphs":["Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 94-105 non-egocentrism is required for the comprehension of demonstratives, which is easier when they refer to objects that are directly in front of the children and when no perspective shift is involved (cf. Webb & Abrahamson 1976).","Although the original intention was not in investigating the issue of non-egocentrism, the comprehension of the three-way system of Japanese demonstratives requires changing the speaker's reference point, and thus these issues can not be separated from one another. How one affects the other needs to be reexamined closely. Since the issue is beyond the scope of this study, I will leave it to future research.","The following table summarizes the results from the experiment:","Table 9. Results from the experiment Pattern to be tested","\\t Context for its use Crucial cutoff point Demonstrative + N","\\t two-way system \\t","5 years old","three-way system\\tover 6 years old The results from both the production data and the comprehension data indicate that the determiner-like elements in Japanese are acquired quite late. In the case of the production data, the determiner-like elements in Japanese are acquired at around the ages of 26-29 months (see 5.1) whereas these elements in the comprehension data are over 5 years old (see Table 9). Why is there a big gap between the two?","This gap is inevitable given the unusually stringent conditions imposed on the use of demonstratives in the comprehension data. In the comprehension data, typical non-verbal communication cues (i.e. looking and pointing) were suppressed, which made the use of these morphemes so stringently controlled that children had to respond solely based on their linguistic knowledge. In contrast, in the production data, virtually no control was imposed on the child's use of these morphemes. The big gap between the comprehension data and the production data for the [Demonstrative + N] pattern implies that children are often able to use this pattern based on pragmatic information with or without syntactic knowledge.","Although the situations created in the experiment were not likely to be encountered in real life, the comprehension data revealed exactly what children had known (or had not known). This can be contrasted with the production data: it is not very clear whether or not children used the demonstratives correctly in terms of their function. 6. Conclusion .","The results from Japanese acquisition data indicate that the determiner-like elements in Japanese emerge at a very late stage. As discussed in Section 4, the late emergence of these elements cannot be attributed to their categorial status since they are not assumed to be functional categories in Japanese; it can only attributed to the comparatively complex semantics of these elements, which makes unnecessary to attribute the late acquisition of English determiners to their categorial status as functional categories. Thus, just like O'Grady's Korean study, our Japanese study also suggests that what determines the ordering in terms of emergence of certain elements is their semantic properties rather than their categorial status.","Consequently, the acquisition data from Japanese suggests that the semantic theory – not Radford's UG-based maturational theory – is preferred: since the semantic theory makes more predictions that are consistent with the data, it is more powerful.","There are a few things to be noted here which may lead to future research. First, the results of the experiment indicate that children's syntactic knowledge of demonstratives must have developed in parallel to their more general cognitive development, since it appears that children's ability to comprehend these terms presupposes their cognitive ability to shift their perspectives. This cautions us to be aware of the interface of syntax and cognition when we investigate children's syntactic knowledge in general.","Second, this study dealt with elements in Japanese which roughly correspond to English determiners in child's language and reported that these elements were acquired late. However, it is plausible to speculate that the late acquisition of these elements may not be due solely to their semantic properties or to prerequisite cognitive factors, since whether or not they are used optimally in the input speech has not yet been examined. Thus, in order to confirm the explanations proposed for the late emergence of these elements discussed in this study, we need to examine the input data to see how they are used by caregivers.","Finally, the Japanese demonstratives which were closely examined in this study are spatial deictics. However, the same terms can be used anaphorically (e.g. Se no takai hito ga yam kimashita. Sono hito wa tooi tokoro kara yattekita soode... 'A tall man came. It is said that the man came from far...'). The anaphoric use of these terms could be more frequent than the spatial use since its presence is often made obligatory by the 104 Language, Information and Computation (PACLIC12), 18-20 Feb, 1998, 94-105 discourse. This means that the study of the same demonstratives serving an anaphoric function in children's language might uncover an early emergence.","This study is by no means complete and these interesting questions noted here wait for future research."]},{"title":"References","paragraphs":["Aiken, Howard. 1955. Tables of the cumulative binomial probability distribution. Cambridge, MA: Harvard","University Press. Borer, Hagit & Keneeth Wexler. 1987. The maturation of syntax. In Roeper & Williams (ed.), Parameter","setting. Dordrecht: D. Reidel Publishing Company. Brown,. Roger. 1973. A first language: The early stages. Harvard University Press.(eds.), Verbal behavior and","learning: Problems and processes. New York: McGraw Hill. 158-201. Brown, Roger & Colin Fraser. 1963. The acquisition of syntax. In C. Cofer & B. Musgrave (eds.), Verbal","behavior and learning: Problems and processes. New York: McGraw Hill. 158-201. Chomsky, Noam. 1986. Barriers. Cambridge, MA: MIT Press. Felix, Sascha. 1992. Language acquisition as a maturational hypothesis. In J. Weissenborn, J. Goodluck & T.","Roeper (eds.), Theoretical issues in language acquisition: Continuity and change in development.","Hillsdale, :NJ: Erlbaum. 25-51. Fukui, Naoki. 1986. A theory of category projection. Ph. D. dissertation. MIT. Guilfoyle, Eithne & Maire Noonan. 1992. Functional categories and language acquisition. Canadian Journal of","Linguistics 37-2, 241-72. O'Grady, William. 1993. Functional categories and maturation: Data from Korean. Presented at the 5th Harvard","International Symposium on Korean Linguistics. Okubo, Ai. 1981. Yooji no kotoba shiryoo (The child's language data). Tokyo: Kokuritsu Kokugo Kenkyuujo. Radford, Andrew. 1990. Syntactic theory and the acquisition of English syntax. Cambridge, MA: Blackwell. Webb, Pamela A. & Adele A. Abrahamson. 1976. Stages of egocentrism in children's use of 'this' and 'that': a","different point of view. Journal of Child Language 3, 349-367. Yamashita, Yoshie. 1990. Syntactic theory and the acquisition of Japanese: Radford's GB approach. Hawaii","Working Papers in Linguistics 22: 93-126. --- 1995. The emergence of syntactic categories: Evidence from the acquisition of Japanese. Ph.D. dissertation.","University of Hawaii at Manoa."]},{"title":"105","paragraphs":[]}]}