{"sections":[{"title":"An Interactive Translation Support Facility for Non-Professional Users","paragraphs":["YAMABANA Kiyoshi, MURAKI Kazunori, KAMEI Shin-ichiro, SATOH Kenji, DOI Shinichi, TAMURA Shinko","Information Technology Research Laboratories","NEC Corporation Miyazaki 4-1-1, Miyamae-ku, Kawasaki 216, JAPAN {yamabana, k-muraki, kamei, satoh, doi, shinko}~hum.cl.nec.co.jp Abstract We present an interactive translation method to support non-professional users to write an original document. The method, combining dictionary lookup function and user-guided stepwise interactive machine translation, allows the user to obtain clear result with an easy operation. We implemented the method as an English writing support facility that serves as a translation support front-end to an arbitrary application."]},{"title":"1 Introduction","paragraphs":["With the steady decrease of network communication cost and equipment prices, world-wide computer networks and the number of its users are growing very rapidly. However, there is a large obstacle against global communication over networks, namely the language barrier, especially for non English-speaking people. This is a major reason personal EJ (English to Japanese) machine translation systems are gaining popularity in Japan. They help the user to quickly grasp the content of web pages, by providing rough translation. Since speed and lexical coverage are most important requirements, conventional automatic machine translation systems developed so far are useful for this purpose.","Contrary to the EJ direction, the major task in JE (Japanese to English) direction will be writing short original documents, such as e-mail. The most important requirement will be translation quality, because the reader is usually different from the MT user. To control quality, some kind of human interaction will be inevitable. However, interactive support for conventional MT systems doesn't seem suitable for these users, since they are primarily intended for professional translators. Their post-editing function often requires working in a special environment that requires special training. An interactive, easy-to-use translation support facility, targeted for non-professional translators, is desirable.","We may expect that these users have basic knowledge and ability to read and understand English. This expectation is natural and realistic in a country like Japan, where all high-school graduates are supposed to have completed six year course in English. Their reading skill and grammar knowledge is usually enough to judge the quality of current MT systems, but they may need help from MT systems when browsing the Internet. For the JE direction, they will not be satisfied with the raw output of conventional MT systems, but it will be too laborious to write down English sentence from scratch. For these users, online dictionaries have been used because of the reliability of the result. However, in spite of abundant information within the dictionary such as inflection, verbal case frame, idioms and so on, the only electronically available part is spelling of translation equivalents (through copy & paste). Other information is only presented to be read as in the case of a paper dictionary, with all further work left to the user.","In this article, we present an interactive translation method and its implementation, which has advantages of both a dictionary look-up tool and a machine translation system. The system has an interactive interface similar to Kana-Kanji conversion method, and initially serves as a dictionary look-up tool. After dictionary lookup, the user can invoke syntactic transformation in terms of grammatical information in the dictionary. Syntactic transformation proceeds step by step in a bottom-up manner, combining smaller translation components into larger ones. This \"dictionary-based interactive translation\" approach allows the user to fully utilize syntactic information in the dictionary while main-taining clarity of the result.","In the next section, we give a simple example of translation steps and provide a general idea of the method. In section 3, we describe the basic model and associated operations. Section 4 gives further"]},{"title":"324","paragraphs":["explanation about disambiguation capability of the interactive operations. Section 5 discusses extensions to the basic model to treat linguistic phenomena such as idiomatic expressions. Section 6 describes the current implementation as a front-end to an arbitrary application. In section 7, the method is compared with former approaches. The final section is the conclusion. 2 An Example In this section we show the basic steps of simple sentence translation, in order to give a general idea about how the method works.","Consider a situation where the user is writing a message in English, using an editor of a mail program. Our system is running as a daemon. While the user is typing English characters, the system does nothing special and let them through to the editor window. The system wakes up when the user toggles on Japanese input. The moment the first Japanese character is typed in, the main translation window is opened, and all subsequent characters are typed in to that window instead of the editor window.","Suppose the input sentence is one shown in figure 1 (a). As soon as (a) is entered, the dictionary look-up function is invoked automatically. A morphological analyzer recognizes word boundaries in the sentence, looks up corresponding word entries in the system dictionary, and shows the result in the main window (b). 1 Content words are replaced by a translation equivalent assumed most plausible, while functional words are left unchanged.","This representation step, in which English words (content words) and Japanese words (functional words) are mixed, separates steps for word translation .and later syntactic transformation, making translation steps clearer. Since word order and functional words carrying grammatical functions are unchanged, the user can easily recognize the skeleton of the sentence, and clearly grasp the correspondence between the original word and its translation equivalent. This representation is not only to show the results of dictionary look-up like (Canisius, 1977), but also carries all interactive operations of the method with it, and has a double role of showing information and being objects of interactive manipulation.","Translation equivalent alternatives for the cursor position word (focus word) are displayed in an alternatives window, appearing nearby that word. Figure 2 is a snapshot of the alternatives window for ronbun (paper). The second line is highlighted to show that it is the current selection. The user can","1Slanted words show romaji transcription of respective Japanese words. They don't appear on a real window.","(a) ~£ t~ ~ tc ~ ~¢ ~b tc","watashi -wa kare -ni ronbun -o watashi -ta","I TOP he DAT paper OBJ give PAST","(b) I ~: he i:- paper ~ give ~v.","-wa -hi -o -ta","(c) I gave him a paper Figure 1: Translation of a simple sentence ronbun"]},{"title":"paper","paragraphs":["[noun] [typical word thesis [noun] [for degree] essay [noun] [general] dissertation [noun] [for degree] Figure 2: Alternatives Window for ronbun change the selection simply by a cursor movement or mouse click on this window, then the corresponding translation equivalent on the main window changes synchronously. To see alternatives for another word, the user has only to move the cursor to that word on the main window. There is also a CD-ROM dictionary access function, making translation equivalent selection easier. In addition, the user can change an inflection in a similar manner on an inflection selection window, opened by the user's request.","If the user needs only the result of dictionary lookup, s/he can signal the end of translation at this point, just after choosing the translation equivalent. If a translation is necessary, the user needs to go one more step. At the same time as initial translation equivalent selection, the system predicts an appropriate area for translation, as shown by an underline (b). Just as the translation equivalent selection can be freely changed, the area can be changed by dragging the left or right edge of the underline. After the user confirms selections of translation equivalents and translation area on (b), the user invokes translation. The system performs syntactic transformation using syntactic information in the dictionary such as the verbal case frame of the main verb in the area, shows the result on the main window, and replaces the original sentence with the result (c). When there is more than one possible translation, the different possibilities are shown in an alternatives window similar to figure 2, allowing the user to change the choice. When the user triggers translation end, the result is sent to the original editor window. The user can continue to work in the editor after turning off Japanese input."]},{"title":"3 Description of the Method","paragraphs":["Most important characteristics of this interactive translation method is that the Japanese input is converted to English in several steps allowing user interaction at each step. In intermediate steps, a mixture"]},{"title":"325","paragraphs":["of target language expression and source language expression are shown to give the current status of the interactive translation. Translation proceeds from a smaller unit as word to a larger unit as sentence, step by step in a bottom-up manner. The result can be checked and corrected at each step, making it easier to obtain a desired result. Interactive operations are similar to those of Kana-Kanji conversion, although they are further extended to be capable of controlling syntactic transformations. We first describe the basic model that determines the scope and timing of interaction, then the set of interactive operations. 3.1 Basic Model The basic model of our method is the syntax-directed translation scheme with bottom-up attribute evaluation (see chapter 5 of (Aho et al., 1986)). In this scheme, an attribute of a syntax tree node is calculated from that of the children nodes by a semantic rule, associated with the syntax rule used to build the node from children. Attributes represent partial translation result for the structure below the node, and attribute calculation proceeds from the lexical nodes to the root node in a bottom-up manner.","Interactivity is integrated with this model by allowing interactive operation when attribute is calculated at each node. Before each calculation, the system pauses to show an interpretation of the underlying structure, and allows the user to examine and change it if necessary. When interaction is finished, the system chooses a next node and pauses there. This process repeats until the system reaches the root node. Any translation method can be used as long as it is compatible with this general scheme.","Although basic model is as described, it is apparently too bothersome to give an operation at every node. In addition, some nodes only have a formal role in the grammar, and are not meaningful to the user. For this reason, the nodes at which the system automatically pauses for interaction are restricted to the node marked as a sentence, and the node that dominates a relative clause and its antecedent: in short, just restricted to contain one predicate. We remark that this restriction is effective only on default decision of which node to pause at, and does not restrict operations by the user. The system looks for a minimal node marked as above, then pauses for user operation. At this time, attributes of the focus node and lower nodes are still undetermined except for lexical nodes. When the user triggers translation, undetermined attributes are calculated, then the result replaces the tree under the focus node. That node serves as a kind of lexical node in subsequent translation. 3.2 Interactive Operations The basic interaction model of the method is that the system shows current interpretation in the form of translation equivalents and translation area, while the user responds to it by changing these initial selections. This set of operations is essentially the same as the Kana-Kanji conversion method, and its obvious advantage is that everybody who can use Kana-Kanji conversion is expected to be well accustomed to these operations.","When the system pauses for interaction, it shows initial selection of translation equivalents and translation area, as in figure 1 (b). Translation equivalent selection for all content words, and the designated region to be translated next, is shown in a compact manner, allowing the user to examine and change them before translation. This mixed representation level of the source and target language expression serves as a playground for all subsequent interactions.","After confirming all selections, the user triggers translation. Then the original area is replaced with resulting English expression. If there are more than one possible translation, the system presents them in a similar window as alternatives window as in figure 2, and the user is allowed to change the system's selection by the same interface as translation equivalent selection.","Translation equivalent selection enables the user to directly manipulate target language expression. Selecting before translation is much easier than after translation, because the word order and understood syntactic structure is that of the user's native language. The meaning of translation area selection is also clear. The user should choose the area so that it contains necessary and sufficient words to be one meaningful expression. Technically, it is bracketing by the user. If the user changes the area, the system changes the analysis according to the new constraint. Further disambiguation capability of this operation will be discussed in section 4.","Other possible interactive operations include edit-ing and undoing the translation. The user can freely modify the displayed characters at any time, and the system responds by invoking an appropriate procedure, such as morphological analysis. Also, the user can go back to any former steps by canceling former translations.","All these operations are optional, except for translation triggers to invoke next translation. The amount of interaction and timing of translation trigger is completely up to the user, and s/he can even proceed without any modification to the system's initial choice.","Steps of interactive translation can be summarized as below."]},{"title":"326","paragraphs":["1. Type in the sentence.","2. Repeat until whole sentence is translated. (a) Translation equivalent selection","and translation area are shown. (b) Confirm all the selections are","right. Change them if necessary. (c) Trigger translation.","3. Signal the end of translation. 3.3 Examples Next we turn to more complex examples, and show how more than one translation units are combined."]},{"title":"3.3.1 A Relative Clause","paragraphs":["Figure 3 shows translation steps for a sentence with a relative clause. This sentence has a dependency ambiguity, so we also show how to resolve it through interaction. The original sentence (a) contains a relative clause with verb kau (buy) with an antecedent hen (book). Since Japanese is headfinal, the sentence-initial case element kare-ga (he-SUB J) can be the subject of either kau (buy) or yomu (read), causing syntactic ambiguity.","First, let's suppose kare-ga is assumed to be the subject of the relative clause by the system. Then the system pauses showing (b), as soon as (a) is input. In (b), the translation region is assumed to be \"he-ga buy-ta book\". After translation trigger, the system pauses showing (c). Please note that the underlined part in (b) is replaced by its equivalent English expression \"the book he bought\", and the whole sentence is underlined now. After another translation trigger, (d) is obtained, with missing subject filled by some default word.","Suppose after obtaining (d) the user noticed that this interpretation is not what s/he wants, and the case element kare-ga should be the subject of the verb of the matrix sentence. Then the user triggers undo of translation twice, returning to (b). Then s/he notice that \"he -ga buy -ta book\" is treated as one phrase, against his/her interpretation. Then s/he changes the underlined area to \"buy -ta book\", excluding \"he -ga\" from the region (e), because this is the \"correct meaningful phrase\" in the user's interpretation. After translation trigger, (f) follows. Note that the subject of the relative clause is supplemented by a default element. Then (g), the desired result, follows.","Generally, if two syntax tree nodes share a child leaf node, one is an ancestor of the other. This property guarantees that two overlapping translation units can always be combined in our stepwise bottom-up translation method. 3.3.2 A"]},{"title":"Conjunction","paragraphs":["Figure 4 shows translation steps for two sentences joined by a subordinate conjunct node (because). kate -ga kat -ta hen -o yon -da he SUBJ buy PAST book OBJ read PAST (b) he 75~ buy fz book ,~ read fg","-ga -ta -o -da (c) the book he bought ~ read 7b:","-o -da • (d) Someone read the book he bought (e) he ~ buy ft. book ~ read fc:","-ga -ta -o -da (f) he ;0; the book someone bought ~ read Fd\"","-ga -o -da (g) He read the book someone bought Figure 3: Relative Clause and Syntactic Ambiguity kanojo -ga ki -ta -node watashi-wa she SUBJ come PAST because I TOP","(b) she ~ come f~. ¢)'~I ~$ glad","-ga -ta -node -wa","(c) Shecame ©'~I ~ glad","-node -wa","(d) She came ¢)'~ I am glad -node ie) I am glad because she came ureshH glad Figure 4: Treatment of Conjunction Component sentences are translated first (c, d), then they are combined to produce a complex sentence. Here \"because\" is assumed to be the first alternative as translation equivalent for node. 4"]},{"title":"More on Interactive Operations","paragraphs":["The selection of an equivalent translation is more than simply choosing among synonyms, as shown in (Yamabana et al., 1995). First, part-of-speech of translation equivalent may be specified through this operation, since translation equivalents with different part-of-speech appear distinctly in the alternatives window. Second, the translation equivalent for functional words can be specified, which can affect the syntactic structure of the result. Although functional words remain unchanged in the intermediate representation, some words provide an alternatives window when the cursor is placed on them. Third, a whole unit with more than one word can be detected and selected in the same interface as translation equivalent for a single word.","An example for the first and second point is found in a translation equivalent set for an auxiliary rareru, which is known to be highly ambiguous. Even after leaving aside less frequent \"spontaneity\" usage and indirect passivization, there are still at least three general interpretations: direct passivization, possibility, and honorific. Automatic disambiguation requires detailed semantic information, especially when some case elements are missing or hidden."]},{"title":"327","paragraphs":["rareru be -ed Can possibly it is possible that be able to [auxiliary] [adverb] [adjective] [adjective] [passive] [honorific] [capable] [capable] [capable] [capable] Figure 5: Alternatives Window for rareru","(a) SL I~ ~ ~ ~g ~ ~2 © ~: l~:~z~ watashi -wa kare -ga hon -o yomu -no -o tasukeru","I TOP he SUBJbookOBJ read COMPOBJ help","(b) I I~ he ;0~ book ~ read © ~ help -w& -ga -wo -no -wo","(c) I ~:~ he reads a book ~ help -Wa -0 (d) I help him to read a book Figure 6: Change of Generation Style","Figure 5 shows the content of the translation equivalent alternatives window for rareru. It appears when the cursor is placed on that word. If \"be -ed\" is chosen, the auxiliary is interpreted as a passive morpheme and treated as such in translation. If the second alternative is chosen, it is interpreted as honorific. In this case, as the translation equivalent is shown as a blank, no morpheme appears in the translation. By choosing the third alternative, it is translated to an auxiliary \"can\", showing capability. The fourth morpheme translates it to \"possibly\", an adverb. By choosing the fifth alternative, the user can specify the result to be a complement of an adjective \"possible\". A tree for the structure \"it is possible that\", coded in the dictionary, is synthesized in the generation module.","The third point will be discussed in section 5.2. 5"]},{"title":"Extension from Basic","paragraphs":["Model As explained in section 3.1, the method basically as-sumes simple compositionaiity of translation. However, this assumption apparently needs modification to be applied to broader phenomena. There are two major sources of violation. One is inherited attributes, corresponding to constraints posed by higher nodes to lower ones. Another is idiosyncratic violation of compositionality assumption, such as idiomatic expressions. In this section we describe how the basic model is extended to treat phenomena that violates this assumption."]},{"title":"5.1 Constraints from Higher Nodes","paragraphs":["One obvious example of this type of violation is inflection. It is not an intrinsic property of a word, but a constraint by dominating or governing element. For this reason, its calculation is delayed until the last phase of generation, when all information are gathered at the lexical node. In addition, inflection are re-calculated in every translation, even if the translation of that word has been already fixed by a former translation.","Another example is constraint posed by a verb subcategorization frame to subordinate elements. Although syntactic cases can be processed by inflection mechanism, constraint of sentence styles, such as to-infinitive or gerund, can not be treated in a similar manner. Since the sentence is a default paus-ing node, subcategorized sentence usually is already fixed as a finite form before the constraint is applied. To cope with this problem, we provide a bookkeeping mechanism that preserves all partial syntax trees generated during translation. When some grammatical constraint is newly introduced on an already translated expression, and if it requires structural deformation, the system looks for the registered structure and generates it again so that it meets the new constraint.","Figure 6 shows steps to obtain a sentence with an embedded clause \"I help him to read a book\". As soon as the original sentence (a) is entered, translation equivalent selection and translation region selection is presented (b). The first region is the complement sentence \"he ga book wo read nd', where no is a complement marker. After translation, (c) is obtained. Then whole sentence is assumed to be the translation region, and (d) is obtained finally. Please note the change in the embedded sentence from a finite form \"he read a book\" in (c) to an to-infinitive form \"him to read a book\" in (d), in accordance with the grammatical constraint posed by the verb \"help\"."]},{"title":"5.2 Idiomatic Expression","paragraphs":["There are some sets of words that acquire special syntactic/semantic behavior when appearing simultaneously. These idiomatic expressions are another major source that violates the compositionaiity assumption of the method. Hereafter, the word \"idiomatic expression\" is used in a rather broad sense: if translation of a combination of words is not predictable from their individual behavior, we call it an idiomatic expression.","In one case, cooccurring words determines translations of one another, even though their meaning can be understood compositionally. For example, renraku-wo toru (contact-OBJ take) should be translated to \"make a contact\", not \"take a contact\" nor \"get a contact\". In another case, the whole expression can turn into completely another meaning. For example, ashi-wo arau (foot-OBJ wash)"]},{"title":"328","paragraphs":["can be interpreted as either \"wash (one's) foot\" or \"wash one's hands\", the latter case losing the original meaning of respective words. Although these idiomatic expressions must be recognized and translated as one thing, they cannot be registered as one word in the dictionary, since their elements can appear in a distant position, or they can also have a purely compositional interpretation.","To cope with this problem, we extended the translation equivalent selection interface so that translation equivalents can be specified as a set for these expressions. Translation equivalent for the component words of an idiomatic expression changes synchronously when one of them is altered. Also, we expanded the dictionary and morphological analyzer to allow such multi-word translation unit correspondence.","We give an example with denwa-wo kakeru, an equivalent expression for \"make a phone call\". This is idiomatic because the correspondence between kakeru and \"make\" is peculiar to this interpretation. When the expression denwa-wo kakeru is entered, the morphological analyzer recognizes it as an idiomatic expression and retrieves information from the idiom dictionary. Figure 7 is a snapshot of alternatives window for \"kakeru\", in the idiomatic interpretation. The second line is highlighted as the current selection. The leftmost word \"make\" shows that the current translation equivalent for \"kakeru\", and the third column shows the current translation equivalent for the whole expression is \"make a phone call\", an idiomatic interpretation. The alternatives window for \"denwa\" is shown in Figure 8. Here, the word \"phone call\" is highlighted corresponding to the interpretation as \"make a phone call\". When the user triggers translation, denwa becomes \"a phone call\", kakeru becomes \"make\", producing \"make a phone call\" in whole.","If the user changes the selection to another alternative, say \"telephone\" at the third line in the alternatives window kakeru, then the selection in the alternatives window denwa also changes to the third line synchronously. Translation of denwa as denwa shows this word will simply vanish after translation. Then the translation of whole expression becomes an one word verb phrase \"telephone\".","At the first line of both alternatives window, the whole original Japanese expression is shown, with a slash at the boundaries of words, like denwa/wo/kakeru. This alternative allows the user to switch from idiomatic interpretation to non-idiomatic interpretation. If the user chooses this alternative, a new alternatives window containing literal translation appears as in figure 9. At the same time the alternatives window for denwa changes and shows literal translations for denwa. The user can","denwa/wo/kakeru make [verb] [make a phone call] telephone [verb] [telephone] call [verb] [call up] Figure 7: Alternatives for kakeru as an Idiom","denwa/wo/kakeru phone call [countable] [make a phone call] denwa [telephone] denwa [call up] Figure 8: Alternatives for denwa as an Idiom go back to the idiomatic interpretation by choosing the alternative denwa+wo+kakeru, at the last line of these alternatives windows.","We remark that this mechanism provides a general means to treat translation unit with more than one component word."]},{"title":"6 Implementation","paragraphs":["The method is realized as an English writing support software on personal computers. The main function is divided into two modules, the interface module and the translation module. The interface module is in charge of user interaction, morphological analysis and predicting translation equivalent and region, as well as function as a front-end. The translation module performs translation of the specified region, obeying user specification passed by the interface module. The most important requirement for the translation module is robustness, in the sense that it doesn't drop a word even when specifications are contradictory. In that case, the system should serve as a simple online dictionary.","A prominent feature is added in this implementation: it works as a language conversion front-end to an arbitrary application. The system is placed between the keyboard and an application in the data flow. It captures Japanese input before they are entered to an application, converts it into English, and then sends the result to the application (figure 10). kakeru hang [verb] put [verb] denwa+wo+kakeru Figure 9: Alternatives for kakeru in literal interpretation"]},{"title":"329","paragraphs":["Any Applications (Mail, Word Processors, etc.)"]},{"title":"t","paragraphs":["Interactive JE Conversion"]},{"title":"t","paragraphs":["Any Kana-Kanji Conversion Program"]},{"title":"t","paragraphs":["Keyboard Figure 10: Relation to Other Programs This function is realized using a standard hook and IME API of the operating system, Microsoft Windows 95. This feature allows this system used as an add-on function of any application, enabling the user to work in a familiar document writing environment.","The system dictionary contains about 100,000 Japanese entries and 15,000 idiomatic expressions. Since there was no source available to build an idiom dictionary of this size, they were collected manually from scratch following a method described in (Tamura et al., 1996). The essence of this method is limiting search space utilizing distinguished word classes characteristic to idiomatic expressions, revealed by an intensive analysis of these expressions.","A CD-ROM online dictionary accessing function is also provided to help user's translation equivalent selection.","This software is currently available either as a package software or a pre-installed software on personal computers."]},{"title":"7 Discussion","paragraphs":["Interactive method in machine translation have been pursued by many people (Kay, 1973; Melby et al., 1980; Tomita, 1984; Huang, 1990; Somerset al., 1990a; Boitet et al., 1995). In these approaches, the system asks a set of questions to the user to resolve ambiguities not solvable by itself. Among problems of this approach are, as Melby pointed out, excessive interaction and necessity for special training for interactive operations.","In our method, interactive operations are initiated and guided by the user and all interactive operations are optional, except for a small number of translation triggers needed for translating component sentences. The system provides its prediction as a default selection, and other possibilities as second or third choices, but the user is free to obey or ignore them. If the selection is wrong, the translation result becomes wrong, which is a feedback to the user. Then the user can undo the translation, correct selections, and try again (for example, see figure 3). On the other hand, the user has only to repeat \"next\" i~struction to obtain a result of automatic translation quality. Frequency and content of interaction are determined by the user. In this manner, the user and the system are essentially cooperative, avoiding the problem of excessive questioning by the system. The problem of difficulty in learning interactive operations is also avoided since our interactions are essentially those of simple Kana-Kanji conversion operations. We believe an average user can easily learn operations of our system.","An interactive dependency parser reported in (Maruyama et al., 1990), is based on an interface like Kana-Kanji conversion, and shares characteristics described above 2. However, their method is limited to syntactic dependency disambiguation by explicitly specifying the words in the dependency relation, and it is difficult to expand the method to handle the types of ambiguity discussed in this paper.","A user-driven approach to interactive translation, proposed by (Somerset al., 1990b), is based on cut and paste operations, where the content of copy buffer is translated when it is pasted. This method seems to leave too much burden to the user, since the user must explicitly specify which portions of the text Should be translated, and in what order. Also it is not clear how to combine partial translations of two overlapping expressions, except for direct edit-ing.","Our stepwise conversion scheme, in which conversion proceeds from smaller structures to larger ones, is a natural conclusion of our try-and-error-based conversion approach. As Melby says, a post-editor will only improve by a certain increment: if the result is completely wrong, s/he will simply abandon the whole result. Since it is easier to obtain an appropriate result for a shorter and simpler structure, a result obtained by stepwise conversion tends to be of better quality than a result obtained by translating the whole structure at one step. In other words, our system divides the translation step into smaller pieces, and allows post-editing at every step.","As described before, target users of our method are those who have basic knowledge to read and understand the target language. According to the target language skill of the user, useful support function will be different. For example, for a user who is competent in English, our system will be useful as an online dictionary. While writing in English, the user can look up the system dictionary only by entering a Japanese word. Then s/he can enjoy easy-to-use interactive operations for translation equivalent selection, inflection selection and CD-ROM dietionary access. When the user find an appropriate word, s/he only has to push the return key to enter the word into the original application. These users","2These characteristics are inherited essentially from a Kana-Kanji conversion interface."]},{"title":"330","paragraphs":["will also find it useful to obtain a translation equivalent expression for an idiomatic expression. These idiomatic expressions, either of source language or target language, are hard to translate since they do not allow literal translation and difficult to find in other dictionaries. By combining this idiom dictionary and translation function, the user can obtain a useful skeleton for target language expression. For many users, however, the translation function will be considered helpful to produce a result of the quality level that matches their English reading skill. Suit-able usage will be balanced between the user's skill and the capability of the system.","The function as an add-on function to an arbitrary software will be an advantage equally for all users, enabling them to work in their familiar environment, compared to conventional machine-aided translation systems that force them to work in an independent unfamiliar environment.","Finally we discuss some remaining problems and direction of further work.","Translation quality needs continuous effort for improvement, in both linguistic coverage and precision. Precision of initial prediction of translation equivalent and translation area is crucial to the performance of the system, since they determine the quality of default translation. In our experience, the users are willing to use interactive operation to improve translation quality, but never to recover from incomprehensible output.","We also have to mention some ambiguities difficult to resolve though basic operations of the method. An example is grammatical relation ambiguity between a case element and a verb, when the case marker is hidden. Generally, the system treats these cases by producing all possibilities in the order of priority and allowing the user to choose one. However, when such ambiguities are multiplied, the number of possibilities easily grows large, making selection difficult. One possible solution would be to provide more disambiguation information, possibly a sequence of dialogues, to help the user to make decision. An important requirement here is that these dialogues must not force a response. The user should be able to ignore them unless they want to.","Another further work is expanding the dictionary, especially idiomatic expressions. We are also planning to add translation examples to the knowledge base, so that translation can be performed either using grammars or examples in the knowledge base. These examples are effective to guarantee correctness of the result, hence will be useful even for users not very familiar in the target language. In this direction, our system would be expanded as a kind of interactive example-based translation support system."]},{"title":"8 Conclusion","paragraphs":["We presented an interactive machine-aided translation method to support writing in a foreign language, which is a combination of dictionary lookup and interactive machine translation. The translation proceeds as a cooperative process between the system and the user, through interactive operations similar to Kana-Kanji conversion method. We implemented the method as a front-end language conversion software to an arbitrary application."]},{"title":"References","paragraphs":["Aho, A. et al. 1986. Compilers. Principles, Techniques, and Tools. Addison-Wesley Publishing.","Boitet, C. et al. 1995. Multilingual Dialogue-Based MT for Monolingual Authors: the LIDIA Project and a First Mockup. In"]},{"title":"Machine Translation,","paragraphs":["vol.9(2), pages 99-132.","Canisius, P. 1977. Automatic Partial Translation in a Multilingual Information System. In"]},{"title":"Overcoming the Language Barrier (Third European Congress on Information Systems and Networks),","paragraphs":["vol.1, pages 259-269.","Huang, X. 1990. A Machine Translation System for the Target Language Inexpert. In"]},{"title":"Proceedings of COLING-90,","paragraphs":["pages 364-367. Kay, M. 1973. The MIND System. In"]},{"title":"Natural Language Processing,","paragraphs":["Algorithmic Press.","Maruyama, H. et al. 1990. An Interactive Japanese Parser for Machine Translation. In"]},{"title":"Proceedings of COLING-90,","paragraphs":["pages 257-262.","Melby, A. et al. 1980. ITS: Interactive Translation System. In"]},{"title":"Proceedings of COLING-80,","paragraphs":["pages 424-429.","Muraki, K. et al. 1994. TWP: How to assist English production on Japanese word processor. In"]},{"title":"Proceedings of COLING-94,","paragraphs":["pages 283-298.","Somers, H. et al. 1990a. Machine Translation without a source text. In"]},{"title":"Proceedings of COLING-90,","paragraphs":["pages 271-276.","Somers, H. et al. 1990b. A user-driven interactive machine translation system. In"]},{"title":"Proceedings of SICONLP-90,","paragraphs":["pages 140-143.","Tamura, S. et al. 1996. Collecting of Verbal Id-iomatic Expressions and Development of a Large Dictionary for Japanese-to-English Machine Translation. (In Japanese) In"]},{"title":"Proceedings o] 2nd Annual Conven-tion of Association for NLP,","paragraphs":["pages 45-48.","Tomita, M. 1984. Disambiguating grammatically ambiguous sentences by asking. In"]},{"title":"Proceedings of COLING-84,","paragraphs":["pages 476-480.","Yamabana, K. et al. 1995. Interactive machine-aided translation reconsidered --Interactive disambiguation in TWP-- In"]},{"title":"Proceedings of NLPRS-95,","paragraphs":["pages 368-373"]},{"title":"331","paragraphs":[]}],"references":[{"authors":[{"first":"A.","last":"Aho"},{"last":"al"}],"year":"1986","title":"Compilers","source":"Aho, A. et al. 1986. Compilers. Principles, Techniques, and Tools. Addison-Wesley Publishing."},{"authors":[{"first":"C.","last":"Boitet"},{"last":"al"}],"year":"1995","title":"Multilingual Dialogue-Based MT for Monolingual Authors: the LIDIA Project and a First Mockup","source":"Boitet, C. et al. 1995. Multilingual Dialogue-Based MT for Monolingual Authors: the LIDIA Project and a First Mockup. In"}],"cites":[{"style":0,"text":"Canisius, 1977","origin":{"pointer":"/sections/2/paragraphs/3","offset":541,"length":14},"authors":[{"last":"Canisius"}],"year":"1977","references":[]},{"style":0,"text":"Aho et al., 1986","origin":{"pointer":"/sections/5/paragraphs/0","offset":775,"length":16},"authors":[{"last":"Aho"},{"last":"al."}],"year":"1986","references":[]},{"style":0,"text":"Yamabana et al., 1995","origin":{"pointer":"/sections/9/paragraphs/0","offset":101,"length":21},"authors":[{"last":"Yamabana"},{"last":"al."}],"year":"1995","references":[]},{"style":0,"text":"Tamura et al., 1996","origin":{"pointer":"/sections/19/paragraphs/1","offset":250,"length":19},"authors":[{"last":"Tamura"},{"last":"al."}],"year":"1996","references":[]},{"style":0,"text":"Kay, 1973","origin":{"pointer":"/sections/20/paragraphs/0","offset":76,"length":9},"authors":[{"last":"Kay"}],"year":"1973","references":[]},{"style":0,"text":"Melby et al., 1980","origin":{"pointer":"/sections/20/paragraphs/0","offset":87,"length":18},"authors":[{"last":"Melby"},{"last":"al."}],"year":"1980","references":[]},{"style":0,"text":"Tomita, 1984","origin":{"pointer":"/sections/20/paragraphs/0","offset":107,"length":12},"authors":[{"last":"Tomita"}],"year":"1984","references":[]},{"style":0,"text":"Huang, 1990","origin":{"pointer":"/sections/20/paragraphs/0","offset":121,"length":11},"authors":[{"last":"Huang"}],"year":"1990","references":[]},{"style":0,"text":"Boitet et al., 1995","origin":{"pointer":"/sections/20/paragraphs/0","offset":155,"length":19},"authors":[{"last":"Boitet"},{"last":"al."}],"year":"1995","references":[]},{"style":0,"text":"Maruyama et al., 1990","origin":{"pointer":"/sections/20/paragraphs/2","offset":46,"length":21},"authors":[{"last":"Maruyama"},{"last":"al."}],"year":"1990","references":[]}]}
