{"sections":[{"title":"Fifth Conference on Applied Natural Language Processing Association for Computational Linguistics Proceedings of the Conference 31 March- 3 April 1997 Washington Marriott Hotel Washington, DC, USA Published by the Association for Computational Linguistics","paragraphs":["© 1997, Association for Computational Linguistics Order copies of this and other ACL proceedings from:","Morgan Kaufmann Publishers 340 Pine Street, 6th Floor San Francisco, CA 94104","1-800-745-7323"]},{"title":"PREFACE","paragraphs":["Little by little, we are learning how to do a better job in building natural language analyzers and generators. Our tool kit is slowly growing -- adding, in particular, in the last few years, better tools for learning language patterns from corpora. Of course, our tools are still quite primitive; when we look back at this time in later years we will be amazed at how much we didn't understand about natural language.","But we are also learning to make better use of the tools we do have. We are coming to a better appreciation of how relatively simple tools -- morphological analyzers, name recognizers, phrase parsers, to name a few -- can be remarkably effective in particular applications. And from this appreciation has flowed a steadily increasing stream of natural language applications.","It is this growing stream that we come here this week to nurture and reflect on. The Conferences on Applied Natural Language Processing are intended to highlight the ways in which natural language processing can be applied to real tasks. With the help of the program committee and other colleagues, we have made a particular effort this year to broaden the range of applications which are presented. Conferences above all are about exchanging ideas, and by stretching the range of the conference we hope to expose people to problems, to techniques, and to applications they might not have seen before. We have also provided an extensive program of demonstrations, ranging from early research prototypes to more mature commercial systems; there is nothing like a live demo to crystallize the problems and accomplishments in our field.","In running an applied conference we are faced forever with the question of what is an \"applied\" paper. We have chosen to answer that question in an inclusive fashion, including several sessions which address basic technologies such as morphology, parsing, and sense disambiguation, which underlie many of our applications. As we build new applications, we are aware of how shortcomings in these basic technologies affect our design, so it is important to bring together people working on the technologies with those working on the applications.","A conference like this brings together the NLP community not only at the conference itself but also in the months before, soliciting and reviewing papers and planning the sessions. I want to thank the program committee and all the reviewers enlisted for this conference, who prepared reviews of exceptional care and detail; the presenters of the tutorials, technical papers, and demonstrations, who have together prepared the panoply of presentations of natural language processing which we are to savor this week; and John White, the local arrangements chair, and his secretary, Juanita Caldwell, who -- together with Priscilla Rasmussen at the ACL office and Kathy McKeown, our secretary-treasurer --","planned and organized the conference itself. I want to especially thank John for bearing the added burden of our greatly expanded program of demos this year. I want to acknowledge Victoria Mason and John Sterling at NYU, who dealt with the problems of preparing and printing the papers, and assembling the final proceedings, keeping everything in good order and on schedule. And most of all I want to thank all the authors who submitted papers and entrusted us with the fruit of their research. Ralph Grishman Program Chair New York University, New York, NY nl"]},{"title":"ANLP 97 Program Committee","paragraphs":["Ralph Grishman (chair), New York University Chinatsu Aone, SRA Corp. Rusty Bobrow, BBN Martha Evens, Illinois Institute of Technology Lynette Hirschman, MITRE Corp. Eduard Hovy, Univ. of Southern California/Information Sciences Institute Yuji Matsumoto, Nara Institute of Science and Technology Boyan Onyshkevych, U. S. Dept. of Defense Tomek Strzalkowski, General Electric Corporate Res. and Dev. Henry Thompson, Univ. of Edinburgh Hans Uszkoreit, DFKI Saarbruecken Marc Vilain, MITRE Corp."]},{"title":"ANLP 97 Reviewers","paragraphs":["Steven Abney Thomas Ahlswede Chinatsu Aone Doug Appelt Scott William Bennett Hans-Ulrich Block Sean Boisen Thorsten Brants Eric Brill Jonathan Calder Jamie Callan Jean-Pierre Chanod Lois Childs Sumali Conlon Jim Cowie Robert Dale Thierry Declerck Yasuharu Den Barbara Di Eugenio Luca Dini John Dowding Ted Dunning Gregor Erbach Helmut Feldweg Sharon Flank Reva Freedman Pascale Fung Andy Golding Greg Grefenstette Henry Hamburger Daniel Hardt Melissa Holland Helmut Horacek Pierre Isabelle Mark Johnson Doug Jones Megumi Kameyama Andrew Kehler Margaret King George Kiraz Tibor Kiss Lars Konieczny Kimmo Koskenniemi Sadao Kurohashi K.L. Kwok Mark Light Kavi Mahesh Judith Markowitz Kathleen McCoy Made Meteer Marc Moens Tetsuya Nasukawa Klaus Netter Guenter Neumann Mary Ellen Okurowski David Palmer Rebecca Passonneau Jose Perez-Carballo Fred Popowich Owen Rambow Lance Ramshaw Ehud Reiter Norbert Reithinger Philip Resnik Ellen Riloff Mats Rooth Salim Roukos Gerda Ruge Hinrich Schuetze Satoshi Sekine Brian Slator Alan Smeaton Harold Somers Karen Sparck Jones Beth Sundheim Koichi Takeda Axel Theofilidis Craig Thiersch Paul Thompson Junichi Tsujii Naohiko Uramoto Takehito Utsuro Keith Vander Linden Evelyne Viegas Marc Vilain Theo Vosse Marilyn Walker Jin Wang Hideo Watanabe David Yarowsky"]},{"title":"Creating and Using TUTORIALS Automatic Linguistic","paragraphs":["Eric Bfill"]},{"title":"Annotation Software","paragraphs":["Department of Computer Science","and","Center for Language and Speech Processing","Johns Hopkins University","In order to perform any sophisticated natural language processing task, it is necessary to first discover the underlying linguistic structure of the input. Depending on the task, this might include information such as parts of speech, word senses, phrase structure, different types of names, etc. Recently a number of approaches have been developed for automatically training programs to provide such annotations. We will survey these approaches and discuss their advantages and disadvantages. The most accurate automatically trained systems typically require large manually-annotated corpora for training, thereby making them expensive to port across domains or languages for which such corpora are not readily available. We will describe methods that allow rapid porting, including: learning without an annotated corpus, adapting an already-trained program to a new domain with minimal resources, and methods for combining human intuitions with automatic acquisition."]},{"title":"Building Applied Natural Language Generation Systems","paragraphs":["Ehud Reiter Computer Science Department","University of Aberdeen, Scotland and","Robert Dale","Microsoft Institute","Macquarie University, Australia Natural language generation systems produce understandable texts in English or other","human languages from some underlying non-linguistic representation of information. NLG","systems combine knowledge about language and the application domain to automatically","produce documents, reports, explanations, help messages, and other kinds of texts.","The late 1990s is an exciting time for applied NLG. 10 years ago NLG was purely a research activity, but in 1997 there are several fielded NLG systems in everyday use, and many more systems under development. In this tutorial, we will describe some of the techniques that are being used to build practical working applications today; we will also provide pointers to leading-edge research developments in the field. The material is based around a popular architectural model of NLG that encompasses the three stages of text planning, sentence planning and linguistic realisation. We will include a case study showing how to construct an NLG system which produces textual meteorological summaries from underlying numeric data sets.","The tutorial should be useful for managers, implementors, and researchers. For managers, it will provide a broad overview of the field and what is possible today; for implementors, it will provide a realistic assessment of available techniques; and for researchers, it will highlight the issues that are important in current applied NLG projects."]},{"title":"Using Speech Recognition","paragraphs":["Judith Markowitz","President, J. Markowitz Consultants","Talking is a fundamental and ubiquitous mode of communication between humans. The","idea of extending speech to verbal interaction with machines has produced powerful icons,","such as Arthur Clark's Hal; Kit, the futuristic car; and StarTrek computers.","Researchers and developers have been designing speech recognition systems for almost 50 years, and the fruit of their labor is a growing number of diverse speech-controlled systems, including speech-to-text dictation products, voice-activated dialing systems, and telephone messaging tools. The presentation addresses three major questions about speech recognition: • What is speech recognition? • How does it work?","• What is it used for?","Answers to these questions include examination of speaker modeling, vocabulary","creation, grammar, and input channels. The presentation will be accompanied by","videotaped examples of existing systems and products."]},{"title":"Building Information Extraction Systems","paragraphs":["Douglas E. Appelt and David Israel","Artifical Intelligence Center","SRI International","This tutorial will cover the what and the how of Information Extraction (IE) systems. First we characterize the range of tasks usually intended for IE techniques, and then describe the various approaches to implementing these techniques, discussing the advantages and disadvantages of each. Most IE systems process texts in sequential steps (\"phases\") ranging from lexical and morphological processing, recognition and typing of proper names, parsing of larger syntactic constituents, and resolution of anaphora and coreference. Finally, IE systems have a domain phase that recognizes events and relationships relevant to the specific IE task. We shall discuss various approaches to each of these phases in turn, and examine their suitability for different types of IE problems. We will discuss the problems and advantages of incorporating various external resources into extraction systems, including large lexicons, gazetteers, and part-of-speech taggers, and conclude with a discussion of template design principles that can have a significant impact on the difficulty of the IE task. vi"]},{"title":"TABLE OF CONTENTS","paragraphs":["CommandTalk: A Spoken-Language Interface for Battlefield Simulations Robert Moore, John Dowding, Harry Bratt, J. Mark Gawron, Y. Gorfu, and Adam Cheyer ......................................................................................... 1","Natural Language in Four Spatial Interfaces Kenneth Wauchope, Stephanie Everett, Dennis Perzanowski, and Elaine Marsh ........... 8","High Performance Segmentation of Spontaneous Speech Using Part of Speech and Trigger Word Information Marsal Gavalda, Klaus Zechner, and Gregory Aist ........................................... 12","A Maximum Entropy Approach to Identifying Sentence Boundaries Jeffrey Reynar and Adwait Ratnaparkhi ........................................................ 16","QuickSet: Multimodal Interaction for Simulation Set-up and Control Philip Cohen, Michael Johnston, David McGee, Sharon Oviatt, Jay Pittman, Ira Smith, Liang Chen, and Josh Clow ...................................................................... 20","Natural Language Dialog Service for Appointment Scheduling Agents Stephan Busemann, Thierry Declerck, Abdel Kader Diagne, Luca Dini, Judith Klein, and Sven Schmeier ................................................................................ 25","Insights into the Dialogue Processing of Verbmobil Jan Alexandersson, Norbert Reithinger, and Elisabeth Maier ............................... 33","An Evaluation of Strategies for Selective Utterance Verification for Spoken Natural Language Dialog Ronnie Smith ....................................................................................... 41","Name Pronunciation in German Text-to-speech Synthesis Stefanie Jannedy and Bernd M6bius ............................................................ 49","Applying Repair Processing in Chinese Homophone Disambiguation ,, Yue-Shi Lee and Hsin-Hsi Chen ................................................................. 57 ! \"","A Non-projective Dependency Parser Pasi Tapanainen and Timo Jgrvinen ............................................................. 64","Incremental Finite-State Parsing Salah Ait-Mokhtar and Jean-Pierre Chanod .................................................... 72","Developing a Hybrid NP Parser Atro Voutilainen and Llufs Padr6 ................................................................ 80","An Annotation Scheme for Free Word Order Languages Wojciech Skut, Brigitte Krenn, Thorsten Brants, and Hans Uszkoreit ..................... 88","The Domain Dependence of Parsing Satoshi Sekine ...................................................................................... 96","Automatic Acquisition of Two-level Morphological Rules Pieter Theron and Ian Cloete .................................................................... 103 vii","Probabilistic and Rule-based Tagger of an Inflective Language- A Comparison Jan Hajic and Barbora Hladk~i ................................................................... 111","Cseg&Tagl.O: A Practical Word Segmenter and POS Tagger for Chinese Texts Sun Maosong, Shen Dayang, and Huang Changning ........................................ 119","The NLP Role in Animated Conversation for CALL Michael Schoelles and Henry Hamburger ..................................................... 127","Reading more into Foreign Languages John Nerbonne, Lauri Karttunen, Elena Paskaleva, Gabor Proszeky, and .- Tiit Roosmaa ...................................................................................... 135 \"","Large-Scale Acquisition of LCS-Based Lexicons for Foreign Language Tutoring Bonnie Dorr ....................................................................................... 139","A prototype of a Grammar Checker for Czech Tom,is Holan, Vladislav Kubon, and Martin Pl~itek .......................................... 147","Techniques for Accelerating a Grammar Checker Karel Oliva ......................................................................................... 155","EasyEnglish: A Tool for Improving Document Quality Arendse Bernth .................................................................................... 159","Contextual Spelling Correction Using Latent Semantic Analysis Michael Jones and James Martin ................................................................ 166","An Automatic Scoring System for Advanced Placement Biology Essays Jill Burstein, Susanne Wolff, Chi Lu, and Randy Kaplan ................................... 174","Dutch Sublanguage Semantic Tagging combined with Mark-Up Technology Peter Spyns, Ng6 Thanh Nhhn, Eric Baert, Naomi Sager, and Georges De Moor ....... 182","A Statistical Profile of the Named Entity Task David Palmer and David Day .................................................................... 190","Nymble: a High-Performance Learning Name-Finder Daniel Bikel, Scott Miller, Richard Schwartz, and Ralph Weischedel ..................... 194","Disambiguation of Proper Names in Text Nina Wacholder, Yael Ravin, and Misook Choi .............................................. 202","An Information Extraction Core System for Real Worm German Text Processing Gtinter Neumann, Rolf Backofen, Judith Baur, Markus Becker, and Christian Braun ................................................................................... 209","Layout & Language: Preliminary experiments in assigning logical structure to table cells Matthew Hurst and Shona Douglas ............................................................. 217","Building a Generation Knowledge Source using Internet-Accessible Newswire Dragomir Radev and Kathleen McKeown ..................................................... 221","Using SGML as a Basis for Data-Intensive NLP David McKelvie, Chris Brew, and Henry Thompson ........................................ 229","Software Infrastructure for Natural Language Processing Hamish Cunningham, Kevin Humphreys, Robert Gaizauskas, and Yorick Wilks ....... 237","An Open Distributed Architecture for Reuse and Integration of Heterogenous NLP Components R6mi Zajac, Mark Casper, and Nigel Sharpies ................................................ 245","Customizable Descriptions of Object-Oriented Models Benoit Lavoie, Owen Rambow, and Ehud Reiter ............................................. 253","CogentHelp: NLG meets SE in a tool for authoring dynamically generated on-line help Michael White and David Caldwell ............................................................. 257","A Fast and Portable Realizer for Text Generation Systems Benoit Lavoie and Owen Rambow ............................................................. 265","Multilingual Generation and Summarization of Job Adverts: the TREE Project Harold Somers, Bill Black, Joakim Nivre, Torbj6rn Lager, Annarosa Multari, Luca Gilardoni, Jeremy Ellman, and Alex Rogers ............................................ 269 ~\"","Language Generation for Multimedia Healthcare Briefings Kathleen McKeown, Shimei Pan, James Shaw, Desmond Jordan, and Barry Allen .... 277","Identifying Topics by Position Chin-Yew Lin and Eduard Hovy ............................................................... 283","An Automatic Extraction of Key Paragraphs Based On Context Dependency Fumiyo Fukumoto, Yoshimi Suzuki, and Jun'ichi Fukumoto ............................. 291","Building Effective Queries in Natural Language Information Retrieval Tomek Strzalkowski, Fang Lin, Jose Perez-Carballo, and Jin Wang ...................... 299","Construction and Visualization of Key Term Hierarchies Joe Zhou and Troy Tanner ....................................................................... 307","Fast Statistical Parsing of Noun Phrases for Document Indexing Chengxiang Zhai .................................................................................. 312","An English to Turkish Machine Translation System Using Structural Mapping Cigdem Turhan .................................................................................... 320","An Interactive Translation Support Facility for Non-Professional Users Kiyoshi Yamabana, Kazunori Muraki, Shin-ichiro Kamei, Kenji Satoh, Shinichi Doi, and Shinko Tamura ............................................................................... 324","An Intelligent Multilingual Information Browsing and Retrieval System Using Information Extraction Chinatsu Aone, Nicholas Charocopos, and James Gorlinsky ............................... 332","Semi-automatic Acquisition of Domain-specific Translation Lexicons , ~ Philip Resnik and I. Dan Melamed ............................................................. 340","Mixed-Initiative Development of Language Processing Systems David Day, John Aberdeen, Lynette Hirschman, Robyn Kozierok, Patricia Robinson, and Marc Vilain ................................................................................... 348 ix","Automatic Extraction of Subcategorization from Corpora Ted Briscoe and John Carroll ................................................................... 356","Learning Probabilistic Subcategorization Preference by Identifying Case Dependencies and Optimal Noun Class Generalization Level Takehito Utsuro and Yuji Matsumoto .......................................................... 364","A Workbench for Finding Structure in Texts Andrei Mikheev and Steven Finch ............................................................. 372","Automatic Selection of Class Labels from a Thesaurus for an Effective Semantic Tagging of Corpora Alessandro Cucchiarelli and Paola Velardi ..................................................... 380","Sequential Model Selection for Word Sense Disambiguation Ted Pedersen, Rebecca Bruce, and Janyce Wiebe ............................................ 388 AUTHOR INDEX John Aberdeen ...................... 348 Gregory Aist .......................... 12 Salah Alt-Mokhtar ................... 72 Jan Alexandersson .................. 33 Barry Allen .......................... 277 Chinatsu Aone ....................... 332 Rolf Backofen ....................... 209 Eric Baert ............................ 182 Judith Baur .......................... 209 Markus Becker ...................... 209 Arendse Bemth ...................... 159 Daniel Bikel .......................... 194 Bill Black ............................ 269 Thorsten Brants ..................... 88 Harry Bratt .............................. 1 Christian Braun ..................... 209 Chris Brew .......................... 229 Ted Briscoe .......................... 356 Rebecca Bruce ....................... 388 Jill Burstein .......................... 174 Stephan Busemann .................. 25 David Caldwell ...................... 257 John Carroll ......................... 356 Mark Casper ......................... 245 Huang Changning .................. 119 Jean-Pierre Chanod .................. 72 Nicholas Charocopos ............... 332 Hsin-Hsi Chen ....................... 57 Liang Chen ........................... 20 Adam Cheyer ........................... 1 Misook Choi ......................... 202 Ian Cloete ............................ 103 Josh Clow ............................ 20 Philip Cohen .......................... 20 Alessandro Cucchiarelli ............ 380 Hamish Cunningham ............... 237 David Day ..................... 190, 348 Shen Dayang ........................ 119 Georges De Moor ................... 182 Thierry Declerck ..................... 25 Abdel Kader Diagne ................. 25 Luca Dini .............................. 25 Shinichi Doi ......................... 324 Bonnie Dorr ......................... 139 Shona Douglas ...................... 217 John Dowding .......................... 1 Jeremy Ellman ....................... 269 Stephanie Everett ....................... 8 Steven Finch ......................... 372 Fumiyo Fukumoto .................. 291 Jun'ichi Fukumoto ................. 291 Robert Gaizauskas .................. 237 Marsal Gavaldh ....................... 12 J. Mark Gawron ....................... 1 Luca Gilardoni ...................... 269 Y. Gorfu ................................ 1 James Gorlinsky .................... 332 Jan Hajic ............................. 111 Henry Hamburger .................. 127 Lynette Hirschman .................. 348 Barbora Hladk~i ..................... 111 Tom,is Holan ........................ 147 Eduard Hovy ........................ 283 Kevin Humphreys .................. 237 Matthew Hurst ...................... 217 Stefanie Jannedy ..................... 49 Timo J~irvinen ........................ 64 Michael Johnston .................... 20 Michael Jones ....................... 166 Desmond Jordan .................... 277 Shin-ichiro Kamei .................. 324 Randy Kaplan ....................... 174 Lauri Karttunen ..................... 135 Judith Klein ........................... 25 Robyn Kozierok .................... 348 Brigitte Krenn ........................ 88 Vladislav Kubon .................... 147 Torbj6m Lager ...................... 269 Benoit Lavoie ................. 253, 265 Yue-Shi Lee .......................... 57 Chin-Yew Lin ....................... 283 Fang Lin ............................. 299 Chi Lu ............................... 174 Elisabeth Maier ....................... 33 Sun Maosong ........................ 119 Elaine Marsh ............................ 8 James Martin ........................ 166 Yuji Matsumoto ..................... 364 I. Dan Melamed ..................... 340 David McGee ......................... 20 David McKelvie ..................... 229 Kathleen McKeown ......... 221,277 Andrei Mikheev ..................... 372 Scott Miller .......................... 194 Bernd Mtibius ........................ 49 Robert Moore ........................... 1 Annarosa Multari .................... 269 Kazunori Muraki .................... 324 xi John Nerbonne ...................... 135 Gtinter Neumann .................... 209 Ng6 Thanh NhLu ................... 182 Joakim Nivre ........................ 269 Karel Oliva ........................... 155 Sharon Oviatt ......................... 20 Lluis Padr6 ........................... 80 David Palmer ........................ 190 Shimei Pan ........................... 277 Elena Paskaleva ..................... 135 Ted Pedersen ........................ 388 Jose Perez-Carballo ................. 299 Dennis Perzanowski ................... 8 James Pittman ........................ 20 Martin Pl~itek ........................ 147 Gabor Proszeky ..................... 135 Dragomir Radev ..................... 221 Owen Rambow ............... 253, 265 Adwait Ratnaparkhi .................. 16 Yael Ravin ........................... 202 Ehud Reiter .......................... 253 Norbert Reithinger ................... 33 Philip Resnik ........................ 340 Jeffrey Reynar ........................ 16 Patricia Robinson ................... 348 Alex Rogers ......................... 269 Tiit Roosmaa ........................ 135 Naomi Sager ......................... 182 Kenji Satoh .......................... 324 Sven Schmeier ....................... 25 Michael SchoeUes ................... 127 Richard Schwartz ................... 194 Satoshi Sekine ........................ 96 Nigel Sharpies ....................... 245 James Shaw ......................... 277 Wojciech Skut ........................ 88 Ira Smith .............................. 20 Ronnie Smith ......................... 41 Harold Somers ...................... 269 Peter Spyns .......................... 182 Tomek Strzalkowski ................ 299 Yoshimi Suzuki ..................... 291 Shinko Tamura ...................... 324 Troy Tanner ......................... 307 Pasi Tapanainen ...................... 64 Pieter Theron ........................ 103 Henry Thompson ................... 229 Cigdem Turhan ...................... 320 Hans Uszkoreit ....................... 88 Takehito Utsuro ..................... 364 Paola Velardi ........................ 380 Marc Vilain .......................... 348 Atro Voutilainen ...................... 80 Nina Wacholder ..................... 202 Jin Wang ............................. 299 Kenneth Wauchope .................... 8 Ralph Weischedel ................... 194 Michael White ....................... 257 Janyce Wiebe ........................ 388 Yorick Wilks ........................ 237 Susanne Wolff ...................... 174 Kiyoshi Yamabana .................. 324 R6mi Zajac ........................... 245 Klaus Zechner ........................ 12 Chengxiang Zhai .................... 312 Joe Zhou ............................. 307"]},{"title":"Program At a Glance Monday, March 31 Tutorials","paragraphs":["9:00-12:30 Creating and Using Automatic Building Applied Natural Language Linguistic Annotation Software Generation Systems","2:00-5:30 Using Speech Recognition Building Information Extraction Systems Tuesday, April 1 9:00-9:15 introductions: Ralph Grishman, John White 9:15-10:00 10:00-10:30 10:30-5:00 9:00-11:10 11:10-2:00 2:00-3:30 3:30-5:00 9:00-11:00 11:00-1:30 1:30-4:00","invited talk:","Government Perspectives on the Future of Language Technologies","Ruth A. David,","Deputy Director, Science and Technology, Central Intelligence Agency break","Track A: Track B: Spoken Language and Dialog Syntax and Morphology Wednesday, April 2","Track A Track B","Information Extraction Language Learning","Text Checking","and other Applications","Document Management demonstrations Thursday, April 3","Track A Track B Text Generation Information Retrieval and Summarization Multilingual Systems Acquisition of Lexical Information from Corpora Tutorial reception: Sunday, March 30th, 6:00-8:00, 2nd Floor Conference reception: Monday, March 31st, 7:00-10:00, 2nd Floor Conference banquet: Wednesday, April 2nd, 6:30-10:00 (buses leave the Marriott at 5:30) Yill"]},{"title":"Tuesday, April 1: Track A SPOKEN LANGUAGE and DIALOG","paragraphs":["10:30 11:00 11:20 11:40 12:00 CommandTalk: A Spoken-Language Interface for Battlefield Simulations Natural Language in Four Spatial Interfaces High Performance Segmentation of Spontaneous Speech Using Part of Speech and Trigger Word Information A Maximum Entropy Approach to Identi~in~ Sentence Boundaries lun Robert Moore, John Dowding, Harry Bratt, J. Mark Gawron, Y. Gorfu, and Adam Cheyer Kenneth Wauchope, Stephanie Everett, Dennis Perzanowski, and Elaine Marsh Marsal Gaval&i, Klaus Zechner, and Gregory Aist Jeffrey Reynar and Adwait Ratnaparkhi ch 1:30 2:00 2:30 3:00 3:30 4:00 4:30 Quickset: Multimodal Interaction for Simulation Set-up and Control Natural Language Dialogue Service for Appointment Scheduling Agents Insights into the Dialogue Processing of Verbmobil Philip Cohen, Michael Johnston, David McGee, Sharon Oviatt,"]},{"title":"Jay","paragraphs":["Pittman, Ira Smith, Liang Chen, and Josh Clow Stephan Busemann, Thierry Declerck, Abdel Kader Diagne, Luca Dini, Judith Klein, and Sven Schmeier Jan Alexandersson, Norbert Reithin~er, and Elisabeth Maier","bre An Evaluation of Strategies for Selective Utterance Verification for Spoken Natural Language Dialo~ Name Pronunciation in German Text-to-speech Synthesis Applying Repair Processing in Chinese Homophone Disambiguation ak Ronnie Smith Stefanie Jannedy and Bernd M6bius Yue-Shi Lee and Hsin-Hsi Chen"]},{"title":"Tuesday, April 1: Track B SYNTAX and MORPHOLOGY","paragraphs":["10:30 11:00 11:30 12:00 1:30 2:00 2:30 3:00 3:30 4:00 A Non-proiective Dependency Parser Incremental Finite-State Parsing Developing a Hybrid NP Parser","lun An Annotation Scheme for Free Word Order Languages The Domain Dependence of Parsing Automatic Acquisition of Two-level Morphological Rules","bre Probabilistic and Rule-based Tagger of an Inflective Language - A Comparison Cseg&Tag 1.0: A Practical Word Segmenter and POS Tagger for Chinese Texts Pasi Tapanainen and Timo J~-vinen Salah Ait-Mokhtar and Jean-Pierre Chanod Atro Voutilainen and Llufs Padr6 ch Wojciech Skut, Brigitte Krenn, Thorsten Brants, and Hans Uszkoreit Satoshi Sekine Pieter Theron and Ian Cloete ak Jan Hajic and Barbora Hladk~i Sun Maosong, Shen Dayang, and Huang Changning XV"]},{"title":"Wednesday, April 2: Track A COMPUTER-AIDED LANGUAGE LEARNING","paragraphs":["9:00 session introduction Melissa Holland 9:10 9:40 10:10 10:40 The NLP Role in Animated Conversation for CALL Reading more into Foreign Languages Large-Scale Acquisition of LCS-Based Lexicons for Foreign Language Tutorin~ Michael Schoelles and Henry Hamburger John Nerbonne, Lauri Karttunen, Elena Paskaleva, Gabor Proszeky, and Tiit Roosmaa Bonnie Dorr break","TEXT CHECKING & other applications","11:10 A prototype of a Grammar Checker for Tom,is Holan, Vladislav Kubon, and","Czech Martin Pl~itek","11:40 Techniques for Accelerating a Grammar Karel Oliva","Checker","12:00 1 u n c h 1:30 Arendse Bernth 2:00 2:30 3:00 EasyEnglish: A Tool for Improving Document Quality Contextual Spelling Correction Using Latent Semantic Analysis An Automatic Scoring System for Advanced Placement Biology Essays Dutch Sublanguage Semantic Tagging combined with Mark-Up Technology Michael Jones and James Martin Jill Burstein, Susanne Wollf, Chi Lu, and Randy Kaplan Peter Spyns, Ng6 Thanh Nhhn, Eric Baert, Naomi Sager, and Georges De Moor v.r~"]},{"title":"Wednesday, April 2: Track B INFORMATION EXTRACTION","paragraphs":["9:00 session introduction 9:10 9:30 10:00 10:30 11:00 11:30 A Statistical Profile of the Named Entity Task Nymble: a High-Performance Learning Name-Finder Disambiguation of Proper Names in Text Sarah Taylor David Palmer and David Day","Daniel Bikel, Scott Miller, Richard","Schwartz, and Ralph Weischedel","Nina Wacholder, Yael Ravin and","Misook Choi","break An Information Extraction Core System for Real World German Text Processing Layout & Language: Preliminary experiments in assigning logical structure to table cells Gtinter Neumann, Rolf Backofen, Judith Baur, Markus Becker, and Christian Braun Matthew Hurst and Shona Douglas","11:50 lunch","1:30 Building a Generation Knowledge Dragomir Radev and Kathleen","Source using Internet-Accessible McKeown","Newswire DOCUMENT MANAGEMENT 2:00 2:30 3:00 Using SGML as a Basis for Data-Intensive NLP Software Infrastructure for Natural Language Processing An Open Distributed Architecture for Reuse and Integration of Heterogenous NLP Components David McKelvie, Chris Brew, and Henry Thompson Hamish Cunningham, Kevin Humphreys, Robert Gaizauskas, and Yorick Wilks R6mi Zajac, Mark Casper, and Nigel Sharpies Yvil"]},{"title":"Thursday, April 3: Track A","paragraphs":["9:00 9:30 10:00 10:30 11:00 11:30 12:00","TEXT GENERATION Customizable Descriptions of Object-Oriented Models CogentHelp: NLG meets SE in a tool for authoring dynamically generated on-line help A Fast and Portable Realizer for Text Generation S~¢stems Benoit Lavoie, Owen Rambow, and Ehud Reiter Michael White and David Caldwell Benoit Lavoie and Owen Rambow break Multilingual Generation and Summarization of Job Adverts: the TREE Project Language Generation for Multimedia Healthcare Briefings Harold Somers, Bill Black, Joakim Nivre, Torbj6rn Lager, Annarosa Multari, Luca Gilardoni, Jeremy Ellman, and Alex Rogers Kathleen R. McKeown, Shimei Pan, James Shaw, Desmond Jordan, and Barry A. Allen","lunch","INFORMATION RETRIEVAL AND SUMMARIZATION 1:30 session introduction 1:40 2:10 2:40 3:10 3:30 4:00 Identifying Topics by Position An Automatic Extraction of Key Paragraphs Based On Context Dependency Building Effective Queries in Natural Langualge Information Retrieval","bre Construction and Visualization of Key Term Hierarchies Fast Statistical Parsing of Noun Phrases for Document Indexing Donna Harman Chin-Yew Lin and Eduard Hovy Fumiyo Fukumoto, Yoshimi Suzuki, and Jun'ichi Fukumoto Tomek Strzalkowski, Fang Lin, Jose Perez-Carballo, and Jin Wang ak Joe Zhou and Troy Tanner Chengxiang Zhai"]},{"title":"Thursday, April 3: Track B MULTILINGUAL SYSTEMS","paragraphs":["9:00 Cigdem Turban 9:30 10:00 10:30 An English to Turkish Machine Translation System Using Structural Mapping An Interactive Translation Support Facility for Non-Professional Users An Intelligent Multilingual Information Browsing and Retrieval System Using Information Extraction Kiyoshi Yamabana, Kazunori Muraki, Shin-ichiro Kamei, Kenji Satoh, Shinichi Doi, and Shinko Tamura Chinatsu Aone, Nicholas Charocopos, and James Gorlinsky break ACQUISITION of LEXICAL INFORMATION from CORPORA 11:00 11:30 Semi-automatic Acquisition of Domain-specific Translation Lexicons Mixed-Initiative Development of Language Processing Systems Philip Resnik and I. Dan Melamed David Day, John Aberdeen, Lynette Hirschman, Robyn Kozierok, Patricia Robinson, and Marc Vilain","12:00 1 u n c h 1:30 Ted Briscoe and John Carroll 2:00 Automatic Extraction of Subcategorization from Corpora Learning Probabilistic Subcategorization Preference by Identifying Case Dependencies and Optimal Noun Class Generalization Level Takehito Utsuro and Yuji Matsumoto 2:30 A Workbench for Finding Structure in Andrei Mikheev and Steven Finch","Texts 3:00 b r e a k 3:30 4:00 Automatic Selection of Class Labels from a Thesaurus for an Effective Semantic Tagging of Corpora Sequential Model Selection for Word Sense Disambiguation Alessandro Cucchiarelli and Paola Velardi Ted Pedersen, Rebecca Bruce, and Janyce Wiebe xix"]}],"references":[],"cites":[]}
