{"sections":[{"title":"Speech and Natural Language Proceedings of a Workshop Held at Hidden Valley, Pennsylvania June 24-27,1990 Sponsored by: Defense Advanced Research Projects Agency Information Science and Technology Office This document contains copies of reports prepared for the DARPA Speech and Natural Language Workshop. Included are reports from DARPA/ISTO sponsored programs and other materials prepared for use at the workshop. APPROVED FOR PUBLIC RELEASE","paragraphs":["DISTRIBUTION UNLIMITED The views and conclusions contained in this document are those of the authors and should not be interpreted as necessarily representing the official policies, either expressed or implied, of the Defense Advanced Research Projects Agency or the United States Government."]},{"title":"Distributed by Morgan Kaufmann Publishers, Inc. 2929 Campus Drive San Mateo, CA 94403","paragraphs":["I"]},{"title":"ISBN 1-55860-157-0 Printed in the United States of America","paragraphs":["ABCDEFGHIJK-EB-93210"]},{"title":"TABLE OF CONTENTS Page Author Index ........................................................................\\................................... ix Overview of the Workshop, Richard Stern, General Chair ................................... 3","paragraphs":["SESSION 1: Spoken Language Systems I Session Summary, Wayne Ward, Chair .................................................................. 5 Efficient, High-Performance Algorithms for N-Best Search R. Schwartz and S. Austin; BBN Systems and Technologies ................................................. 6 A Tree-Trellis Based Fast Search for Finding the N-Best Sentence Hypotheses in Continuous Speech Recognition F. K. Soong and E.-F. Huang; AT&T Bell Laboratories ..................................................... 12 Finite-State Approximations of Grammars F. Pereira; AT&T Bell Laboratories ........................................................................\\........ 20 The Use of Relative Duration in Syntactic Disambiguation M. Ostendorf, P. Price, J. Bear, and C. W. Wightman; Boston University and SRI International 26 SESSION 2: Natural Language I Session Summary, Damaris Ayuso, Chair ........................................................... 33 Picking Reference Events from Tense Trees: A Formal, Implementable Theory of English Tense-Aspect Semantics L.K. Schubert and C. H. Hwang; University of Rochester and University of Alberta ................ 34 Interactive Multimedia Explaination for Equipment Maintenance and Repair K. McKeown and S. Feiner; Columbia University ............................................................. 42 Two Recent Developments in Tree Adjoining Grammars: Semantics and Efficient Processing Y. Schabes and A. K. Joshi; University of Pennsylvania .................................................... 48 Performing Integrated Syntactic and Semantic Parsing Using Classification R. T. Kasper and E. H. Hovy; Information Sciences Institute of USC ................................... 54 Making Abduction More Efficient D. Apix~lt and J. R. Hobbs; SRI International ................................................................... 60 SESSION 3: Natural Language Evaluation Session Summary, Lynette Hirschman, Chair ..................................................... 63 Evaluating Natural Language Generated Database Records R. McCardell; National Security Agency ........................................................................\\. 64 iii SESSION 4: System Implementation Strategies Session Summary, Roberto Bisiani, Chair .......................................................... 71 Toward a Real-Time Spoken Language System Using Commercial Hardware S. Austin, P. Peterson, P. Placeway, R. Schwartz, and J. Vandergrift; BBN Systems and Technology ................................................................................................................ 72 The Dragon Continuous Speech Recognition System: A Real-Time Implementation P. Bamberg, Y.-L. Chow, L. Gillick, R. Roth, and D. Sturtevant; Dragon Systems ................ 78 Hardware for Hidden Markov Model Based Large Vocabulary Real Time Speech Recognition M. Weintraub, G. Chen, J. Mankoski, H. Murveit, A. S~lzle, S. Narayanaswamy, P. Schrupp, B. Richards, J. Rabaey, R. Broderson; Univeraity of California, Berkeley, and SRI International .... 82 SESSION 5: Overview of the ATIS System (Invited presentations) Session Summary, David Pallett, Chair .............................................................. 89 Evaluation of Spoken Language Systems: the ATIS Domain P. Price; SRI International ........ .................................................................................... 91 The ATIS Spoken Language Systems Pilot Corpus C. T. Hemphill, J. J. Godfrey, and G. R. Doddington; Texas Instruments .............................. 96 Developing an Evaluation Methodology for Spoken Language Systems M. Bates, S. Boisen, and J. Makhoul; BBN Systems & Technologies ............................. 102 Beyond Class A: A Proposal for Automatic Evaluation of Discourse L. Hirschman, D. A. Dahl, D. P. MdKay, L. M. Norton, and M. C. Linebarger; Unisys Defense Systems ................................. ~ .............................................................................. 109 DARPA ATIS Test Results D. S. Pallett, W. M. Fisher, J. G. Fiscus, and J. S. Garofolo; National Institute of Standards & Technology ............................................................................................................... 114 SESSION 6: ATIS Site reports and General Discussion Session Summary, David Pallett, Chair ............................................................. 123 BBN ATIS System Progress Report - June 1990 M. Bates, R. Bobrow, S. Boisen, R. Ingfia, and D. Stallard; BBN Systems & Technologies .... 125 The CMU Air Travel Information Service: Understanding ..Spontaneous Speech W. Ward; Carnegie Mellon University ............................................................................ 127 Preliminary ATIS Development at MIT V. Zue, J. Glass, D. Goodine, H. Leung, M. Phillips, J. Polifroni, and S. Seneff; MIT Laboratory for Computer Science ................................................................................ 130 Designing the Human Machine Interface in the ATIS Domain B. Bly, P. Price, S. Park, S. Tepper, E. Jackson, and V. Abrash; SRI International ................ 136 iv Management and Evaluation of Interactive Dialog in the Air Travel Domain L.M. Norton, D. A. Dahl, D. P. McKay, L. Hirschman, M. C. Linebarger, D. Magerman, and C. Ball; Unisys Defense Systems ........................................................................\\.............. 141 SRI'S Experience with the ATIS Evaluation R. Moore, D. Appelt, J. Bear, M. Dalrymple, and D. Moran; SRI International ..................... 147 SESSION 7: Speech Recognition I Session Summary, Mitch Weintraub, Chair ....................................................... 149 An Algorithm for Determining Talker Location using a Linear Microphone Array and Optimal Hyperbolic Fit H. Sflverman; Brown University ........................................................................\\........... 151 Towards Environment-Independent Spoken Language Systems A. Acero and R. M. Stem; Carnegie Mellon University ..................................................... 157 Phoneme-in-Context Modeling for Dragon's Continuous Speech Recognizer P. Bamberg and L. Gillick; Dragon Systems ................................................................... 163 A Rapid Match Algorithm for Continuous Speech Recognition L. S. Gillick and R. Roth; Dragon Systems .................................................................... 170 Fast Search Algorithms for Connected Phone Recognition Using the Stochastic Segment Model V. Digalakis, M. Ostendorf, and J. R. Rohlicek; Boston University and BBN Systems & Technologies ........................................................................\\..................................... 173 Automatic Phonetic Baseform Determination L. R. Bahl, S. Das, P. V. deSouza, M. Epstein, R. L. Mercer, B. Merialdo, D. Nahamoo, M. A. Picheny, and J. Powell; IBM T.J. Watson Research .......................................................... 179 On the Interaction Between True Source, Training, and Testing Language Models D. B. Paul, J. K. Baker, and J. M. Baker; MIT Lincoln Laboratory and Dragon Systems ......... 185 Continuous Speech Recognition from a Phonetic Transcription S. E. Levinson, A. Ljolje, L. G. Miller; AT&T Bell Laboratories ....................................... 190 Algorithms for an Optimal A* Search and Linearizing the Search in the Stack Decoder D. B. Paul; MIT Lincoln Laboratory ........................................................................\\...... 200 SESSION 8: Spoken Language Systems II Session Summary, Charles Hemphill, Chair ...................................................... 205 Recent Progress on the VOYAGER System V. Zue, J. Glass, D. Goodine, H. Leung, M. McCandless, M. Philips, J. Polifroni, and S. Seneff; M1T Laboratory for Computer Science ........................................................................\\... 206 Training and Evaluation of a Spoken Language Understanding System D. A. Dahl, L. Hirshman, L. M. Norton, M. C. Linebarger, D. Magerman, N. Nguyen, and C. N. Ball; Unisys Defense Systems ........................................................................\\.............. 212 V f A Comparison of Speech and Typed Input A. G. Hauptmann and A. I. Rudnicky; Carnegie Mellon University ..................................... 219 The Design of a Spoken Language Interface J.-M. Lunati and A. I. Rudnicky; Carnegie Mellon University ............................................ 225 Syntactic and Semantic Knowledge in the DELPHI Unification Grammar R. Bobrow, R. Ingria, and D. Stallard; BBN Systems and Technologies ................................ 230 On Deftly Introducing Procedural Elements into Unification Parsing R. Bobrow and L. Ramshaw; BBN Systems and Technologies ............................................ 237 Spoken Language Understanding for Personal Computers G. M. White and D. Nagel; Apple Computer ................................................................... 241 SESSION 9: Automatic Acquisition of Linguistic Structure (Special session) Session Summary, Mitch Marcus, Organizer ...................................................... 249 Using Explaination-Based Learning to Increase Performance in a Large-Scale NL Query System M. Rayner and C. Samuelsson; Swedish Institute of Computer Science ............................... 251 Structural Ambiguity and Lexical Relations D. Hindle and M. Rooth; AT&T Bell Laboratories ........................................................... 257 Statistical Parsing of Messages M. V. Chitrao and R. Grishman; New York University ..................................................... 263 Generating a Grammar for Statistical Training R. A. Sharman, F. Jelinek, R. Mercer; IBM UK Science Centre, Winchester, and IBM T. J. Watson Research ....................................................................................................... 267 Deducing Linguistic Structure from the Statistics of Large Corpora E. BriU, D. Magerman, M. Marcus, and B. Santorini; University of Pennsylvania ................. 275 Poor Estimates of Context are Worse than None W. A. Gale and K. W. Church; AT&T Bell Laboratories ................................................... 283 Representation Quality in Text Classification: An Introduction and Experiment D. D. Lewis; University of Massachusetts, Amherst ......................................................... 288 SESSION 10: Evaluation of Systems on the Resource Management Database Session Summary, George Doddington, Chair .................................................... 297 DARPA Resource Management Benchmark Test Results D. S. Pallett, J. G. Fiscus, and J. S. Garofolo; National Institute of Standards & Technology..298 A New Paradigm for Speaker-independent Training and Speaker Adaptation F. Kubala and R. Schwartz; BBN Systems & Technologies ................................................ 306 v± Implementation Aspects of Large Vocabulary Recognition Based on Intraword and Interword Phonetic Units R. Pieraccini, C.-H. Lee, E. Giachin, and L. R. Rabiner; AT&T Bell Laboratories ................. 311 Improved Acoustic Modeling for Continuous Speech Recognition C.-H. Lee, E. Giachin, L. R. Rabiner, R. Pieraccini, and A. E. Rosenberg; AT&T Bell Laboratories, Speech Research Department ...................................................................... 319 Improved Hidden Markov Modeling for Speaker-Independent Continous Speech Recognition X. Huang, F. Alleva, S. Hayamizu, H.-W. Hon, M.-Y. Hwang, and K.-F. Lee; Carnegie Mellon University ........................................................................\\......................................... 327 The Lincoln Tied-Mixture HMM Continuous Speech Recognizer D. B. Paul; MIT Lincoln Laboratory ........................................................................\\...... 332 Training Set Issues in SRI's DECIPHER Speech Recognition System H. Murveit, M. Weintraub, and M. Cohen; SRI International ............................................. 337 Recognition of Noisy Speech: Using Minimum-Mean Log-Spectral Distance Estimation A. Erell and M. Weintraub; SRI International .................................................................. 341 Experiments with Tree-Structured MMI Encoders on the RM Task M. T. Anikst, W. S. Meisel, M. C. Soares, and K.-F. Lee; Speech Systems Incorporated and Carnegie Mellon University ........................................................................\\................. 346 SESSION 11: Natural Language II Session Summary, Deborah Dahl, Chair ............................................................. 353 Toward Understanding Text with a Very Large Vocabulary D. Ayuso, R. Bobrow, D. MacLaughlin, M. Meteer, L. Ramshaw, R. Schwartz, and R. Weischedel; BBN Systems & Technologies ..................................................................... 354 Generic Text Processing: A Progress Report P. S. Jacobs, G. R. Krupka, S. W. McRoy, L. F. Rau, N. K. Sondheimer, and U. Zernik; General Electric Corporate R&D ........................................................................\\........... 359 Extending the Lexicon by Exploiting Subregularities R. Wilensky; University of California, Berkeley .............................................................. 365 Machine Translation Again? Y.Wilks, J.Carbonell, D. Farwell, E. Hovy, and S. Nirenburg; New Mexico State University..371 SESSION 12: Speech Recognition II Session Summary, Jordan Cohen, Chair ............................................................. 379 Recent Progress on the SUMMIT System V. Zue, J. Glass, D. Goodine, H. Leung, M. Phillips, J. Polifroni, and S. Seneff; MIT Laboratory for Computer Science ........................................................................\\.......................... 380 Spoken Letter Recognition R. Cole and M. Fanty; Oregon Graduate Institute of Science and Technology ........................ 385 vii P An 86,000 Word-Recognizer Based on Phonemic Models M. Lennig, V. Gupta, P. Kenny, P. Mermelstein, and D. O'Shaughnessy; INRS-Telecommunications ................................................................................................... 391 Recent Results from the ARM continuous Speech Recognition Project M. Russell and K. Ponting; SRU (RSRE) ...................................................................... 397 SITE REPORTS .................................................................................................... 405 WHITE PAPER: Opportunities for Advanced Speech Processing in Military Computer-Based Systems C. Weinstein; MIT Lincoln Laboratories ....................................................................... A33 viii AUTHOR INDEX Abrash, V. 136 Acero, A. 157 Allen, J.F. 429 Alleva, F. 327 Anikst, M.T. 346 Appelt, D. 60, 147 Austin, S. 6, 72 Ayuso, D. 33, 354 Baker, J.K. 1 85 Baker, J.M. 185, 414 Bahl, L.R. 179 Ball, C.N. 141,212 Bamberg, P. 78, 163 Bates, M. 102, 125 Bear, J. 26, 147 Bisiani, R. 71,412 Bly, B. 136 Bobrow, R. 125, 230, 237, 354 Boisen, S. 102, 125 Brill, E. 275 Broderson, R. 82 Carbonell, J. 371 Chen, G. 82 Chitrao, M.V. 263 Chow, Y.-L. 78 Church, K.W. 283 Cohen, J. 379 Cohen, M. 337 Cole, R. 385 Dahl, D.A. 109, 141,212, 353, 426 Dalrymple, M. 1 47 Das, S. 1 79 deSouza, P.V. 179 Digalakis, V. 1 73 Doddington, G.R. 96, 297 Epstein, M. 1 79 Erell, A. 341 Fanty, M. 385 Farwell, D. 371 Feiner, S. 42, 413 Fiscus, J.G. 114, 298 Fisher, W.M. 11 4 Gale, W.A. 283 Garofolo, J. S. Giachin, E. Gillick, L. S. Glass, J. Godfrey, J. J. Goodine, D. Grishman, R. Gupta, V. Hauptmann, A. G. Hayamizu, S. Hemphill, C. T. Hindle, D. Hirschman, L. Hobbs, J. R. Hon, H.-W. Hovy, E. H. Huang, E.-F. Huang, X. Hwang, C. H. Hwang, M.-Y Ingria, R. Jackson, E. Jacobs, P. S. Jelinek, F. Joshi, A. K. Kasper, R. T. Kenny, P. Krupka, G. R. Kubala, F. Lee, C.-H. Lee, K.-F. Lennig, M. Leung, H. Levinson, S. E. Lewis, D. D. Linebarger, M. C. Ljolje, A. Lunati, J.-M. MacLaughlin, D. Magerman, D. Makhoul, J. Mankoski, J. Marcus, M.","114,","311,","78,163,","130, 206,","130, 206, 263, 96, 63, 109, 141,212, 54, 371, 125, 48, 311, 327, 130, 206, 109, 141, 141, 212, ]02,406, 249,275, 427, 298 319 170 380 96 380 422 391 219 327 205 257 426 60 327 430 12 327 34 327 230 136 359 267 427 54 391 359 306 319 346 391 380 190 288 212 190 225 354 275 407 82 428 ix P McCandless, M. McCardell, R. McKay, D.P. 109, McKeown, K. 42, McRoy, S. W. Meisel, W.S. 346, Mercer, R.L. 179, Merialdo, B. Mermelstein, P. Meteer, M. Miller, L. G. Moore, R. 147, Moran, D. Murveit, H. 82, 337, Nagel, D. Nahamoo, D. Narayanaswamy, S. Nguyen, N. Nirenburg, S. Norton, L.M. 109, 141, O'Shaughnessy, D. Ostendorf, M. 26, 173, 408, Pallett, D.S. 89, 114, 123, 298, Park, S. Paul, D.B. 185, 200, 332, Pereira, F. Peterson, P. Phillips, M. 130, 206, Picheny, M. A. Pieraccini, R. 311, Placeway, P. Polifroni, J. 130, 206, Ponting, K. Powell, J. Price, P. 26, 91,136, 408, Rabaey, J. Rabiner, L.R. 311, Ramshaw, L. 237, Rau, L. F. Rayner, M. Reddy, R. Richards, B. Rohlicek, J.R. 173, Rooth, M. Rosenberg, A. E. Roth, R. 78, 206 64 141 413 359 423 267 179 391 354 190 424 147 425 241 179 82 212 371 212 391 409 419 136 417 20 72 380 179 319 72 380 397 179 424 82 319 354 359 251 411 82 409 257 319 170 Rudnicky, A.I. 219, 225 Russell, M. 397 Samuelsson, C. 251 Santorini, B. 275 Schabes, Y. 48 Schrupp, P. 82 Schubert, L.K. 34, 429 Schwartz, R. 6, 72, 306, 354, 406 Seneff, S. 130, 206, 380 Sharman, R.A. 267 Shore, J. 416 Silverman, H. 151,410 Soares, M.C. 346 Sondheimer, N.K. 359 Soong, F.K. 12 Stallard, D. 125, 230 Steedman, M. 427 Stern, R.M. 3, 157 Stolzle, A. 82 Sturtevant, D. 78 Sundheim, B. 410 Tepper, S. 136 Vandergrift, J. 72 Ward, W. 5, 127 Webber, B. 427 Weinstein, C. 417, 433 Weintraub, M. 82, 149, 337, 341,425 Weischedel, R. 354, 405 White, G.M. 241 Wightman, C.W. 26 Wilensky, R. 365 Wilks, Y. 371,421 Zernik, U. 359 Zue, V. 130, 206, 380, 418 X"]}]}