{"sections":[{"title":"March 1996 ,9% Volume 22, Number 1 Computati nal Lingu\" t\" 0 IS lCS Articles","paragraphs":["Translating Collocations for Bilingual Lexicons: A Statistical Approach A Maximum Entropy Approach to Natural I~anguage Processing Error-tolerant Finite-state Recognition with Applications to Morphological Analysis and Spelling Correction From Conceptual Time to Linguistic Time"]},{"title":"Book Reviews Head-driven Phrase","paragraphs":["Structure Grammar by Carl Pollard and Ivan Sag and German in Head-driven Phrase-structure Grammar edited by John Nerbonne, Klaus Netter, and Carl Pollard Natural Language Processing for Prolog Programmers by Michael A. Covington Logic and Lexicon by Manfred Pinkal Japanese Sentence Processing edited by Reiko Mazuka and Noriko Nagai Trajectories Through Knowledge Space: A Dynamic Framework for Machine .Comprehension by Lawrence A. Bookman Books Received Frank Smadja, Kathleen R. McKeown, 1 and Vasileios Hatzivassiloglou Adam L. Berger, Stephen A. Della 39 Pietra, and Vincent J. Della Pietra Kemal Oflazer 73 Michel Gagnon and Guy Lapalme 91 Reviewed by Jean-Pierre Koenig 129 Reviewed by Ken Barker and 137 Stan Szpakowicz Reviewed by Massimo Poesio 140 Reviewed by Patrick Sturt 145 Reviewed by Jean-Pierre Corriveau 148 153 Published Quarterly by the MIT Press for the Association for Computational Linguistics"]},{"title":"Computational Linguistics SSN 0891-2017 Editor","paragraphs":["1993-Julia Hirschberg AT&T Research 600 Mountain Avenue, 2C-409 Murray Hill, NJ 07974, USA (+1 908) 582-7496 acl@research.att.com","Associate Editor Robert C. Berwick Massachusetts Institute of Technology Artificial Intelligence Laboratory Cambridge, MA 02139, USA (+1 617) 253-8918 berwick@ai.mit.edu","Book Review Editor Graeme Hirst University of Toronto Computer Science Department Toronto, CANADA M5S 1A4 (+1 416) 978-8747 gh@cs.toronto.edu","The FINITE STRING Editor Richard Sproat Bell Laboratories 600 Mountain Avenue, 2D-451 Murray Hill, NJ 07974, USA (+1 908) 582-5296 rws@research.att.com","Squibs and Discussions Editor Pierre Isabelle CWARC Communications Canada 155 Chomedey Boulevard Laval, Quebec, CANADA H7V 2X2 (+1 514) 973-5801 isabelle@cifi.doc.ca","Editorial Board Members","1994-96: Hiyan Alshawi, AT&T Bell Laboratories Mark Johnson, Brown University John Lafferty, Carnegie Mellon University Lori Levin, Carnegie Mellon University J0hanna Moore, University of Pittsburgh Stephen Pulman, SRI Cambridge/Cambridge University Mats Rooth, Universit~t Stuttgart Keh-Yih Su, National Tsing Hua University David Weir, University of Sussex","1995-97: Anne Abeille, Universite Paris VII Patrick Blackburn, Universitdt des Saarlandes Susan Brennan, SUNY Stony Brook Matt Crocker, University of Edinburgh Ido Dagan, Bar Ilan University Masaaki Nagata, NTT Information and","Communication Systems Laboratories Megumi Kameyama, SRI International Ed Stabler, UCLA Kees van Deemter, Institute for Perception Research Gregory Ward, Northwestern University Pete Whitelock, Sharp Laboratories of Europe Ltd.","1996-98: Eric Brill, Johns Hopkins University Richard Crouch, Defence Research Agency David Johnson, IBM/TJ Watson Research Center Julian Kupiec, Xerox Palo Alto Research Center Emmanuel Roche, Mitsubishi Electric Research Laboratory Hinrich Schfitze, Xerox Palo Alto Research Center Marilyn Walker, AT&T Research Robert J. P. Ingria BBN Systems & Technologies 10 Moulton Street Cambridge, MA 02138, USA (+1 617) 873-3582 ingria@bbn.com"]},{"title":"March 1996 Volume 22, Number 1 Computational Linguistics Articles Translating Collocations for Bilingual Lexicons: A Statistical Approach A Maximum Entropy Approach to Natural Language Processing Error-tolerant Finite-state Recognition with Applications to Morphological Analysis and Spelling Correction From Conceptual Time to Linguistic Time Book Reviews","paragraphs":["Head-driven Phrase Structure Grammar by Carl Pollard and Ivan Sag and German in Head-driven Phrase-structure Grammar edited by John Nerbonne, Klaus Netter, and Carl Pollard Natural Language Processing for Prolog Programmers by Michael A. Covington Logic and Lexicon by Manfred Pinkal Japanese Sentence Processing edited by Reiko Mazuka and Noriko Nagai Trajectories Through Knowledge Space: A Dynamic Framework for Machine Comprehension by Lawrence A. Bookman Frank Smadja, Kathleen R. McKeown, 1 and Vasileios Hatzivassiloglou Adam L. Berger, Stephen A. Della 39 Pietra, and Vincent J. Della Pietra Kemal Oflazer 73 Michel Gagnon and Guy Lapalme 91 Reviewed by Jean-Pierre Koenig 129 Reviewed by Ken Barker and 137 Stan Szpakowicz Reviewed by Massimo Poesio 140 Reviewed by Patrick Sturt 145 Reviewed by Jean-Pierre Corriveau 148 Books Received 153"]},{"title":"Copyright ©1996 by the Association for Computational Linguistics.","paragraphs":["Permission to photocopy articles for internal or personal use, or the internal or personal use of specific clients, is granted by the copyright owner for users registered with the Copyright Clearance Center (CCC) Transactional Reporting Service, provided that the fee of $3.00 per article-copy is paid directly to CCC, 222 Rosewood Drive, Danvers, MA 01923. The fee code for users of the Transactional Reporting Service is 0891-2017/95 $3.00. For those organizations that have been granted a photocopy license with CCC, a separate system of payment has been arranged. Such permission requests and other permission inquiries should be addressed to the Managing Editor at the address given on the inside front cover of this issue."]},{"title":"Computational Linguistics","paragraphs":["is abstracted and/or indexed in the following publications:"]},{"title":"Annual Review of Information Science and Technology, CompuMath Citation Index, Computer Abstracts, Computing Reviews, Current Contents: Social and Behavioral Sciences, Engineering Index, Knowledge Engineering Review, Language and Language Behavior Abstracts, Linguistic Abstracts, Linguistic Bibliography, Research Alert, Science Abstracts","paragraphs":["(INSPEC Section C),"]},{"title":"SciSearch, Social Sciences Citation Index,","paragraphs":["and"]},{"title":"Social SciSearch.","paragraphs":["Volume 14 and subsequent volumes of"]},{"title":"Computational Linguistics","paragraphs":["are available on microfilm through University Microfilms International, 300 North Zeeb Road, Ann Arbor, MI 48106, USA. Send advertising and mailing list inquiries to Marketing Manager, MIT Press Journals, 55 Hayward Street, Cambridge, MA 02142; (617) 253-2866; e-mail: journals-info@mit.edu."]},{"title":"Individual Subscriptions to Computational Linguistics","paragraphs":["are available only with membership in the Association for Computational Linguistics (ACL). Annual Membership Dues are as follows:"]},{"title":"regular,","paragraphs":["$50.00;"]},{"title":"student --","paragraphs":["taking a full-time program of courses and not earning a regular income, $30.00;"]},{"title":"retired,","paragraphs":["$30.00;"]},{"title":"joint --","paragraphs":["for couples receiving one subscription, $60.00. A membership application together with an order form for back issues and conference proceedings is included at the end of this issue. Send membership applications and address changes to Priscilla Rasmussen, Association for Computational Linguistics (ACL), P.O. Box 6090, Somerset, NJ 08875, USA. However, note that it is also possible to pay by credit card (both by e-mail and by postal mail) and through banks in Switzerland and Japan."]},{"title":"Institutional Subscriptions","paragraphs":["are $98.00. Outside the U.S. add $16.00 postage handling. Canadian subscribers also add 7% GST. Single copies of current and back issues are $25.00. Outside U.S. add $5.00 per issue for postage and handling. Canadians add additional 7% GST. Send institutional subscription orders and address changes to MIT Press Journals, 55 Hayward Street, Cambridge, MA 02142; (617) 253-2889; e-mail: journals-orders@mit.edu. Claims for missing issues will be honored free of charge if made within three months after the publication date of the issue. Prices subject to change without notice. Institutions should order back issues before 1988 and all proceedings from the ACL at the address above. The FINITE STRING will no longer be available in hard copy. It will be accessible from the ACL Homepage at http://www.cs.columbia.edu/~acl. Members without access to the WWW but with access to e-mail may request e-mail subscriptions by sending a message to The FINITE STRING Editor, Richard Sproat, rws@research.att.com. E-mail versions of the STRING will be available on a quarterly basis, coinciding roughly with the publication of the journal."]}]}