{"sections":[{"title":"Essential Titles from Cambridge Quantifiers, Deductions and Context Makoto Kanazawa, Christopher Pi~6n, and Henriette de Swart,","paragraphs":["Ed/tors The contributors to this volume discuss the current state of the art at the borderline of logic, linguistics and computer science. Contributors: Mary Dalrymple, John Lamping, Fernando Pereira, 1⁄2jay Saraswat, Jan van Eijck, Kees van Deemter, Megumi Kameyama, Cleo Condoravdi, Mark Gawron, Friederike Moltmann, Henriette de Swart CSLI Lecture Notes Distributed for CSLI Publications 1-57586-004-X Paperback $22.95"]},{"title":"Studies in Natural kanguaqe Processing Computational Linguistics","paragraphs":["An Introduction"]},{"title":"Ralph Grishman","paragraphs":["\"Instructors looking for a good introductory text to use in a course devoted to computational linguistics should consider this book as a strong candidate if they wish to emphasize a linguistics approach .... The book is interestingly written with many in-sigh~ul discussions, and it is the only (introductory) computational linguistics textbook that looks at the field s~om a linguist's point of view. \"","--Computational Linguistics 31038-5 Paperback $22.95"]},{"title":"Computational Lexical Semantics Patrick Saint-Dizier and Evelyn Viegas,","paragraphs":["Editors \"...supplies a fascinating snapshot of the state-of the-art in the early 1990s. \"","--Computational Linguistics This book is one of the first volumes to provide models for the creation of various kinds of computerized lexicons for the automatic treatment of natural language, with applications to machine translation, automatic indexing, and database front-ends, knowledge extraction,"]},{"title":"Natural Language Parsing","paragraphs":["Psychological, Computational and Theoretical Perspectives"]},{"title":"David R. Dowty, Lauri Karttunen, and Arnold M. Zwicky,","paragraphs":["Editors Eleven original papers contribute to an interdisciplinary overview of recent developments in parsing or structural language analysis. They represent work from experimental psychology, theoretical linguistics, and artificial intelligence. 26203-8 Hardback $85.00"]},{"title":"Systemic Text Generation as Problem Solving Terry Patten","paragraphs":["An exploration of a new approach to text generation that interprets systemic grammar as a computational representation. Patten demonstrates that systemic grammar can be easily and automatically translated into current M-knowledge representations and efficiently processed by the same knowledge-based techniques currently exploited by expert systems. Copubllshed with the Association for Computational Linguistics 35076-X Hardback $49.95"]},{"title":"The Computer as Medium Peter B6gh Andersen, Berit Holmqvist, and Jens F. Jensen,","paragraphs":["Ed/tors The book consists of three parts: The first part characterizes the semiotic nature of computers and discusses semiotic approaches to programming and interface design. The second section discusses narrative and aesthetic issues of interactive fiction, information systems, and hypertext. The final part contains papers on the cultural, organizational, and historical impact of computers. 41995-6 Hardback $54.95"]},{"title":"LLBa P.O. Box 22206 San CA 92192-0206 Diego, 619/695-8803 Fax: 695-0416","paragraphs":["Linguistics and Language Behavior Abstracts"]},{"title":"Internet socio@cerfnet.com LLBA is available in print; online from Knight-Ridder; on CO-ROM from SilverPlatter and NISC; on magnetic tape from LLBA direct.","paragraphs":["Association for Computational Linguistics","1997 MEMBERSHIP, CHANGE OF ADDRESS AND EMAIL, AND ORDER FORM","MEMBERSHIP Membership in the Association for Computational Linguistics is for the calendar year, regardless of when dues are paid. Membership includes a full year of the ACL journal, Computational Linguistics, reduced registration at most ACL-sponsored conferences, and discounts on ACL-sponsored publications. Payments for membership dues, fund donations, back issues, and proceedings may be made in Europe or the USA. Follow the instructions under the PAYMENT heading carefully. Provide all oersonal information, even if you have oreviouslv done so. to be sure the ACL membershio database is uo-to-date. Write leeiblv, olease! FULL NAME (first) (last/family) ADDRESS INSTITUTION TELEPHONE","(if not in address above) E-MAIL ADDRESS FAX Please IMMEDIATELY notify the ACL Office of address and email changes. Journal copies returned due to bad addresses will not be remailed until a $5.00 postage/handling fee is remitted. EMAIL (if available) IS USED TO DISTRIBUTE meeting, membership, and other announcements","MEMBERSHIP DUES FOR 1997 IMPORTANT NOTE: Renewals must be received no later than 1 Avri! 1997 to avoid late payment fee assessment. Membership categories include Regular Members and the following: Couples with the same mailing address may be Joint Members; they will receive only one set of publications, but each will be eligible for all other member benefits. Students taking a full-time program of courses and not earning a regular income may become Student Members WITH COPY OF CURRENT STUDENT ID. Students who are not Student Members because of their income can still participate in student activites as Student-Employed. Also available are Retired and Unemployed memberships. PLEASE CIRCLE OR HIGHLIGHT TYPE OF MEMBERSHIP BELOW THAT YOU DESIRE. Late oavmeut fee does not apply to new memberships. Regular(S50) Joint(S60) Student(S30) Student-Employed(S50) Retired(S30) Unemployed(S30) MEMBERSHIP DUES $ 1st Class or Air ($10 US, Canada, Mexico; $25 elsewhere) OPTIONAL JOURNAL MAILING $ RENEWALS received after 1 April 1997 pay $10 additional postage/handling fee LATE PAYMENT FEE $ INTERNATIONAL FUND: Allows ACL memberships and publications to be available to colleagues who have difficulty in using their national currencies for international transactions or for whom membership would otherwise be impossible. Contributions may be tax deductible; check local regulations. Receipts are available upon request. INTERNATIONAL FUND $ THE DON AND BErrY WALKER INTERNATIONAL STUDENT FUND: This fund was set up to honor Don and Betty Walker. It supports select student travel to ACL meetings. Contributions may be tax deductible, and companies may provide matching funds; check local regulations. Receipts are available upon request. Make checks payable to \"THE WALKER FUND\". Visa and Mastercard payments are also accepted.","WALKER FUND $","TOTAL PAYMENT FOR MEMBERSHIP, WALKER AND INTERNATIONAL FUNDS $","(list in PAYMENT SECTION)","PAYMENT","METHOD OF PAYMENT (circle): CHECK MONEY ORDER CREDIT CARD BANK TRANSFER CREDIT CARD INFORMATION (VISA AND MASTERCARD ONLY): CARD NUMBER EXPIRATION DATE CARDHOLDER'S NAME (as appears on card).","GRAND TOTAL OF PAYMENT AUTHORIZED OR ENCLOSED) $ (total from MEMBERSHIP (above) and total from PUBLICATION SECTIONS (below)) PREPAYMENT is necessary; invoices and receipts are available upon request. The U.S. dollar price is definitive when paying in other currencies, although rounding off is appropriate. CHECKS AND MONEY ORDERS SHOULD BE PAYABLE TO THE ASSOCIATION FOR COMPUTATIONAL LINGUISTICS (or to ACL). Payment may be made by sending this form (or all pertinent details) and credit card information in email to acl@bellcore.com. The following payment choices are available: 1. CREDIT CARDS: Credit card payments MUST BE MADE TO THE ACL OFFICE IN THE USA. Visa and Mastercard only. Email, fax or hardcopy are acceptable. 2. CHECKS./MONEY ORDERS: TO THE ACL OFFICE IN THE USA: Send this dues statement in hardcopy with a check or money order to the address below. PAYMENTS MUST BE IN U.S. DOLLARS, DRAWN ON A U.S. BANK OR IN U.S. OR CANADIAN DOLLARS (CALCULATED AT THE CURRENT EXCHANGE RATE), DRAWN ON A CANADIAN BANK. 3. PAYMENTS TO EUROPE: Mail this form to Rusher with either (i) a Eurocheque or banker's draft IN SWISS FRANCS, payable \"ACL\" or (it) a standard personal cheque drawn on a French bank in FRENCH FRANCS, payable \"ACL\" or (iii) photocopy evidence of intetbank transfer to \"ACL\", account number 141.880.LAV at the Union Bank of Switzerland, 8 Rue du Rhone, CH-121l Geneva 11, SWITZERLAND. Dollar price is definitive. For exchange rate information, use daily published exchange rate or see http://www.cs.um.edu.mt/acl/. NOTE THAT EUROPEAN MEMBERS SHOULD PAY THROUGH ROSNER UNLESS PAYING BY CREDIT CARD OR USE A U.S. BANK ACCOUNT. 4. PAYMENTS FROM JAPAN: Payments which were previously made through Prof. Makoto Nagao by bank transfer within Japan should now be made by credit card or hardcopy check or money order to the ACL Office in the USA by following one of the above sets of instructions. This change is being made for ease of accounting and, hopefully, will not inconvenience members. Assoc. for Comp. Ling. +1-908-873-3898 phone; [ Dr. Michael Rosner +356-32-90-25-04 phone; P.O. Box 6090 +1-908-873-0014 fax ] Dept. Computer Science & AI +356-32-05-39 fax Somerset, NJ 08875 USA acl@bellcore.com I University of Malta mros@cs.um.edu.mt","I Msida, MALTA","PUBLICATIONS ORDER FORM Institutions subscribe to the 1997 journal through MIT Press Journals, 55 Hayward Street, Cambridge, MA 02142, USA; phone +1-617-253-2889; fax +1-617-253-6779; journals-orders@mit.edu. Institutional orders for back issues (1988-) should also be ordered from MIT Press Journals. All other journal back issues orders, and all proceedings, are available through the ACL. JOURNAL BACK ISSUES: Back issues of Computational Linguistics and two supplements, a Directory of Graduate Programs in Computational Linguistics, 3rd edition, and a Survey of Computational Linguistics Courses, revised in 1993. are available from the ACL Office. Surface mailing costs are included in the prices; additional charges for 1st class or air delivery are noted. ORDERS BY MEMBERS FOR USE IN LABORATORIES OR LIBRARIES MUST BE PAID AT THE \"OTHERS\" RATE. 1980-1995 VOLUMES-CIRCLE YEARS (1980-1990: Members $30; Others $60 [ 1991-1996: Members $40; Others $80): 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 [ 1991 1992 1993 1994 1995 1996 BACK ISSUES $ 1st Class or air (each year: $5 U.S., Canada, Mexico; $10 elsewhere) BACK ISSUE OPTIONAL MAILING COSTS $ SUPPLEMENTS--Circle choice (Members $15; Others $30): 1992 Directory of Graduate Programs ] 1993 Survey of Courses SUPPLEMENTS $ 1st Class or air (each year: $5 U.S., Canada, Mexico; $ I 0 elsewhere) SUPPLEMENT OPTIONAL MAILING COST $ PROCEEDINGS: Proceedings are available for the ACL conferences listed below. COLING proceedings (below) may also be ordered through the ACL. Surface mailing costs are included in the prices; additional charges for 1st class or air delivery are noted. ORDERS BY MEMBERS FOR USE IN LABORATORIES OR LIBRARIES MUST BE PAID AT THE \"OTHERS\" RATE. ACL PROCEEDINGS (each proceedings: Members $30; Others $60.-lst Class or air: $10 U.S., Canada, Mexico: $25 elsewhere) CIRCLE or HIGHLIGHT CHOICE(S): 19th, Stanford, 1981 20th, Toronto, 1982 21st, Cambridge, 1983 22nd, see Coling-84 below 23rd, Chicago, 1985 24th, New York, 1986 25th, Stanford, 1987 26th, Buffalo, 1988 27th, Vancouver, 1989 28th, Pittsburgh, 1990 29th, Berkeley, 1991 30th, Newark, 1992 31st, Columbus, 1993 32nd, Las Cruces, 1994 33rd, Cambridge, 1995 34th, Santa Cruz, 1996 35th, Madrid, 1997 (August 1997 delivery) CONFERENCES ON APPLIED NATURAL LANGUAGE PROCESSING (each proceedings: Members $30; Others $60.- 1 st Class or air: $10 U.S., Cnada, Mexico; $25 elsewhere): First, Santa Monica, 1983 Second, Austin, 1988 Third, Trento, 1992 Fourth, Stuttgart, 1994","Fifth, Washington, DC, 1997(May 1997 delivery) EUROPEAN CHAPTER CONFERENCES (each proceedings: Members $30; Others $60--lst Class or air: $10 U.S., Canada, Mexico; $25 elsewhere): First, Pisa, 1983 Second, Geneva, 1985 Third, Copenhagen, 1987 Fourth, Manchester, 1989 Fifth, Berlin, 1991 Sixth, Utrecht, 1993 Seventh, Dublin, 1995 Eighth, Madrid, 1997 (joint with ACL-97 above)","PROCEEDINGS TOTAL $ OPTIONAL MAILING TOTAL $ COILING PROCEEDINGS (note differences in proceedings prices; 1st Class or air delivery: 1984 is $15 U.S., Canada, Mexico; $25 elsewhere and for subsequent years: $20 U.S., Canada, Mexico; $40 elsewhere): COLING-84, Stanford, 1984 (Members $45; Others $90) COLING-84 PROCEEDINGS $ COLING-88(2 vol.), Budapest, 1984 (Members $45; Others $150) COLING-88 PROCEEDINGS $ COLING-90(3 vol.), Helsinki, 1990(Members $95; Others $190) COLING-90 PROCEEDINGS $ COLING-92(4 vol.), Nantes, 1992(Members $75~ Others $150) COLING-92 PROCEEDINGS $ COLING-94, Kyoto, 1994 (Members $85; Others $170) COLING-94 PROCEEDINGS $ COLING-96, Copenhagen, 1996(Prices to be determined)-Available March, 1997 for delivery COLING-96 PROCEEDINGS $","TOTAL PUBLICATIONS PAYMENT $ [December 1996, Kathleen McKeown, ACL Secretary/Treasurer] (list in PAYMENT SECTION)"]},{"title":"Guidelines for Submissions","paragraphs":["Manuscxripts for Computational Linguistics should be submitted on letter-size paper (8.5 by 11 inches, or A4), double-spaced and single-sided throughout, including footnotes and references. The paper should begin with an informative abstract of approximately 150-250 words. Manuscripts must be written in English. Contact the editor regarding the possibility of electronic submission. Submissions may be made in any of the following categories: Papers: This category includes contributions that report significant new research results in computational linguistics or that provide critical reviews of the literature on a particular topic. The length of a paper depends on its content, but it is suggested that manuscripts be limited to forty double-spaced pages. That is the equivalent of thirty journal pages. Each paper is fully refereed, being read by at least two members of the editorial board and usually by an additional expert in the particular subject area. The submission of an article to CL for refereeing means that the author certifies the manuscript is not copyrighted; nor has it been published or submitted for publication to another refereed journal. If any version of the paper has appeared, or will appear, in a non-refereed publication, the details of such publication must be made known to the Editor at the time of submission. The final version of a paper tentatively accepted for publication must be accompanied by a Copyright Transfer Agreement signed by all of the authors or, in the case of a \"work for hire,\" by the employer. This written transfer is necessary under the 1978 U.S. Copyright law. Letters to the Editor: This category includes statements of opinion on issues relevant to the readership. The Editor and the editorial board will evaluate the appropriateness of these contributions for inclusion. Five copies of papers or three copies of letters should be sent to: Julia Hirschberg, CL Editor AT&T Research 600 Mountain Avenue, 2C-409 Murray Hill, NJ 07974, USA (+1 908) 582-7496; acl@research.att.com Squibs and Discussions: This category includes short articles reporting technical results, discussions of results, algorithms, or new computational linguistic data or tools of interest to the journal readership. Submissions should generally not exceed eight double-spaced pages and should be submitted to: Pierre Isabelle, CL Squibs and Discussions Editor CWARC Communications Canada 1575 Chomedey Boulevard Laval, Quebec, CANADA H7V 2X2 (+1 514) 973-5801; isabelle@citi.doc.ca Book Section: Anyone interested in reviewing a book, or in suggesting a book for review, should contact the Book Review Editor; publishers may also submit copies of books for review directly to: Graeme Hirst, CL Book Review Editor University of Toronto Department of Computer Science Toronto, CANADA MSS 3G4 (+1 416) 978-8747; gh@cs.toronto.edu The FINITE STRING: Send (a) summaries of research in progress -- of particular interest would be perspectives on the activities at a particular institution; (b) announcements of meetings of potential interest to the membership; and (c) personal notes (e.g., honors, moving, changes in status) to The FINITE STRING Editor. Time-sensitive material should be received by the first day of the second month of each quarter to appear in the next issue. Submissions (where possible in electronic form) should be sent to: Richard Sproat, FINITE STRING Editor Bell Laboratories 600 Mountain Avenue, 2D-451 Murray Hill, NJ 07974, USA (+1 908) 582-5296; rws@bell-labs.com Founded in 1962, the Association for Computational Linguistics (ACL) is the primary scientific and professional society for natural language processing research and applications. A European chapter was established in 1982. Besides publishing Computational Linguistics, the ACL holds international meetings (annually in North America, biennially in Europe) where the state-of-the-art in natural language processing research and development is presented. Recently, special interest groups on the Mathematics of Language, the Lexicon, Parsing, Generation, Computational Phonology, and Multimedia Language Processing have been formed; others are likely to be added. President (1996) Oliviero Stock Vice-President (1996) Secretary-Treasurer (1995-98) Office Manager (1995-98) Executive Committee (1993-96) (1994-96) (1995-97) (1996-98) Journal Editor Nominating Committee (1994-96) (1995-97) (1996-98) ACL EUROPEAN CHAPTER OFFICIALS Chair (1995-96) Secretary(1992-96) Treasurer (1982-96) Executive Committee (1995-96) Advisory Committee (1993-94) Nominating Committee (1993-96) (1995--98) IRST 38050 Povo (Trento) ITALY • (+1 39 461) 314313; stock@irst.it (+1 39 461) 314591 -fax Mitchell Marcus University of Pennsylvania Computer and Information Science Philadelphia, PA 19104-6389 USA (+1 215) 898-2538; mitch@linc.cis.upenn.edu Kathleen McKeown Columbia University Department of Computer Science 450 Computer Science Building New York, NY 10027, USA (+1 212) 939-7118; acl@cs.columbia.edu (+1 212) 666r0140 -fax Priscilla Rasmussen Association for Computational Linguistics (ACL) P.O. Box 6090, Somerset, NJ 08875, USA (+1 908) 873-3898; (+1 908) 873-0014 fax acl@bellcore.com President, Vice-President, Associate Secretary-Treasurer","and Chair of the ACL European Chapter Stuart Shieber, Harvard University Eduard Hovy, USC/Information Sciences Institute Kathleen McCoy, University of Delaware Paul Jacobs, SRA Corporation Julia Hirschberg, AT&T Research Fernando Pereira, AT&T Bell Laboratories Karen Sparck Jones, University of Cambridge Douglas E. Appelt, SRI International Erhard Hinrichs Universitiit T~ibingen Abt. Computerlinguistik Kleine Wilhelmstr. 113 D-72074 Tfibingen, Germany (+49) 7071 29 42 79; eh@sfs.nphil.uni-tuebingen.de Susan Armstrong ISSCO Universite de Gen~ve 54 route des Acacias CH-1227 Geneve SWITZERLAND (+41 22) 705-7113; susan@divsun.unige.ch Michael Rosner University of Malta Computer Science and AI Ms ida, MALTA (+356) 3290-2504; mros@cs.unimt.mt Chair, Secretary, and Treasurer Anne Abeill6, Universitd de Paris VIII Anne de Roeck, University of Essex Jan Ha~ik, University of Prague John Nerbonne, University of Groningen Chair, Secretary, and Treasurer Anne Abeill6, Universitg de Paris 8 Jan Jan Ha~ik, Charles University John Nerbonne, University of Groningen Nicoletta Caizolari (Chair), lnstituto di Linguistica","Computazionale del CNR Christian Rohrer, Universitiit Stuttgart Ewan Klein, Uniw, rsity of Edinburgh Leonid Iomdin, Russian Academy of Sciences"]}]}