{"sections":[{"title":"From Conceptual Time to Linguistic Time","paragraphs":["Michel Gagnon* Machina Sapiens Guy Lapalme t Universit4 de Montr4al In this paper, we present a method for generating French texts conveying temporal information that integrates Discourse Representation Theory (DRT) and Systemic Grammar Theory. DRT is used to represent temporal information and an intermediate semantic level for the temporal localization expressed by temporal adverbial phrases and verb phrases. This representation is then translated into a syntactic form using Systemic Grammar Theory. We have implemented this method in a working prototype called Prdtexte. 1. Introduction In speaker-generated texts, reference is made to facts taking place in time. To use the same kind of references in automatically generated text, the mechanisms that govern the expression of temporal concepts must be identified. There is no simple or direct mapping between conceptual time, as it is perceived in the real world, and linguistic time, which refers to the way time is formulated in language. There may be different ways to present the same temporal concept in a text, and a single linguistic marker can be used to convey different temporal meanings.","For example, the discourse below (Discourse 1) is a text generated by Pr4texte, a system we developed for implementing the expression of temporal localization in French texts 1. It is a slightly modified version of an example used by Bras (1990) for the extraction of temporal information in text analysis. The sentences report occurrences that are facts taking place in time. We have inserted labels in parentheses to distinguish the twelve occurrences reported in the text. Hier l'avion a effectu6 un vol (ol). A 8h00 il a quitt6 Paris (02). Quand il a survol6 Barcelone (o3), le r6acteur fonctionnait (o4). ~, 10h15, un voyant a clignot6 (o5). Auparavant, il s'6tait allure6 (o6). Puis il s'6tait 6teint (o7). Pendant 35 minutes, l'avion a survol6 lamer (o8). Puis il a atteint la c6te (o9). Jusqu'a 10h50, il a survol6 l'Alg6rie (o10). A llh30 il 6tait sur la piste (o11). A ce moment-la le r6acteur a explos6 (o12). Yesterday the plane made a flight (ol). At 8:00 A.M. it left Paris (o2). When it flew over Barcelona (o3), the engine was working (o4). At 10:15, a warning light flashed (o5). Previously it had come on (o6). Then it had gone out (o7). For 35 minutes the plane flew over the sea (o8). Then it reached the coast (o9). Until 10:50 it flew over Algeria (olo). At 11:30 it was on the landing run-way (o11). At this moment the engine exploded (o12). Discourse 1 * 3535 Queen-Mary, Bur. 420, Montr6al (Quebec), Canada H3V 1H8, Tel: (514) 733-3959. E-maih gagnon@iro.umontreal.ca. This article was written while the author was at \"Laboratoire Langue, Raisonnement et Calcul\" of IRIT, Toulouse, France. J- D6partement cl'informatique et de recherche op6rationnelle, C. P. 6128, Succ. Centre-Ville, Montr6al (Qu6bec), Canada H3C 3J7. E-mail: lapalme@iro.umontreal.ca. 1 The French text shown on the left in Discourse 1 was generated by Pr6texte; we give an English translation on the right. @ 1996 Association for Computational Linguistics Computational Linguistics Volume 22, Number 1","In Discourse 1, we find two types of temporal markers: verb tense and what we call adverbials of temporal location (ATL). An ATL is an adjunct, such as yesterday, until 10:50, or when it flew over Barcelona, that provides information about the temporal localization of an occurrence or its duration, or both at the same time.","For verb tense, we distinguish different ways of indicating localization in the past. Three French verb tenses can be used: pass~ composG imparfait, and plus-que-parfait; their closest equivalents in English are the simple past, past progressive, and past perfect. The passf compos~ il a survold 'it flew over' presents the occurrence as an event and localizes it in relation to the time of speech. With the plus-que-parfait il s'dtait allum~ 'it had come on', the occurrence is also presented as an event, but localized in relation to a perspective point other than speech time. The imparfait le r~acteur fonctionnait 'the engine was working' presents the occurrence as being in progress. For present and future tenses there are fewer options than for past tense, but more than one form is available for theses tenses as well.","For ATLs, temporal localization can be achieved in many ways; for example, in relation to the time of speech (hier 'yesterday'), by designating an absolute temporal location (~ 8hO0 'at 8:00 A.M.'), or in relation to another fact (puis 'then', ~ ce moment-ld 'at this moment', quand il a survold Barcelone 'when it flew over Barcelona'). To this variety in the semantics of localization we must add the variety of syntactic forms. Localization can be expressed by an adverb (puis 'then'), a prepositional phrase (jusqu'd 10h50 'until 10:50'), a nominal phrase (le lendemain 'the day after') or a subordinate clause (quand il a survold Barcelone 'when it flew over Barcelona').","No text generator has yet been developed to solve the problem of the expression of time. The ones that have tackled this problem have focused on the production of verb tenses, without solving the choice of temporal adverbs. The work presented in this paper addresses the problem of generating the elements that convey temporal localization in French, including both verbs and temporal adverbs.","In a previous paper (Gagnon and Lapalme 1992), we proposed a method of integrating the expression of temporal concepts into the text-generation process. In particular, we showed how to produce different types of text in French from a single representation of events. Unfortunately, the method governing the planning process was too determined by temporal concepts, so it was difficult to link this planning process with other frameworks, such as the schema proposed by McKeown (1985) or Rhetorical Structure Theory (RST) (Mann 1991; Hovy 1991).","As we were not really successful in integrating the expression of time in French into the text-generation process, we decided to pursue our research with a different perspective. We designed a system covering many of the possibilities of expressing time in French, our hypothesis being that the achievement of this task would facilitate the design of a text-planning process. We believed it would be easier to organize the structure of the discourse with a better understanding of the way temporal information can be expressed by adverbs and verb tenses. We started from the work of Bras (1990), who proposes a method of extracting the temporal structure of a text, according to Discourse Representation Theory (Kamp 1981), that relies on an analysis of adverbials of temporal location made by Molin6s (1990).","To implement the production of ATLs and verb tenses, we have chosen Systemic Grammar (Halliday 1985; Berry 1975, 1976), which formulates the syntactic structure of a sentence as the result of a sequence of semantic choices. We developed a grammar interpreter inspired by Nigel (Matthiessen and Bateman 1991), but departing from it in many respects; in particular, our representation of the production of verb tenses and adverbs is quite different.","In this paper, we discuss the elements required to produce a text such as Dis-92 Gagnon and Lapalme From Conceptual Time to Linguistic Time"]},{"title":"/ DEEP /","paragraphs":["GENERATIONN f SURFACE GENERATION\", Conceptual representation Discourse representation"]},{"title":"t","paragraphs":["Semantic representation"]},{"title":"1","paragraphs":["Syntactic representation Occurrences as primitive concepts Temporal relations The tempolral Jocaligafion is represented as an overlapmg relation Sellmentafion of the conceptual ret~resentaaon Structured information Rhetorical relations Linearization Choice of aspect Identification of temporal markers Temporal adverbial Verb tense Figure 1 The global process. course 1. The process starts from a conceptual representation that encodes the facts to be reported in the text, associated with their position in time. The information at this objective conceptual level must be translated into a semantic representation where the facts are presented according to a subjective perspective. The semantic representation is then used to produce the text. We have concentrated our attention on this last stage, but we cannot avoid the problem of determining how the representation used at this level is obtained from previous levels. In the following sections, we describe the two stages of the text-generation process. 2. The Global Process It is generally accepted that the generation process requires at least two parts. The first part, deep generation, is a planning process in which the content and the overall structure of the text are established. In the second part, surface generation, the words and the syntactic structure of the text are chosen.","Figure 1 summarizes our view of the global process, starting from a conceptual representation that contains occurrences and relations between them. The fact that an occurrence takes place at a certain time is expressed by an overlapping relation between this occurrence and the object representing this time.","The deep generation process is decomposed into two steps. In the first step, the conceptual representation is segmented and structured to build a discourse representation. In our discourse representation, which uses Segmented Discourse Representa-93 Computational Linguistics Volume 22, Number 1 tion Theory (SDRT) (Asher 1993), the information is cut into smaller segments each of which contains the information to be expressed by a single sentence. The structure linking these segments relies on a set of rhetorical relations.","In the second step of the deep generation process, the discourse representation is traversed and, for each segment, rules are applied to identify the feature values needed to translate it into a sentence. We thus obtain a linear structure in which each element is a set of features that determine the syntactic form of the sentence.","In the surface generation process, the information in the semantic representation is used to select the appropriate syntactic structure for the expression of time: an adverbial of temporal location (ATL) or a verb phrase (VP), or both. 3. The Deep Generation Process Although our work focuses on surface generation, we cannot ignore the issue of deep generation, because the nature of the semantic representation is determined not only by the syntax of the language, but also by the temporal concepts available. Therefore, in this section, we first present the conceptual representation that induces the semantic representation used by our generator. We then explain the intermediate discourse level. We do not know yet in detail how to produce the semantic representation from the conceptual representation, but we do have an idea of what information each level of representation must contain and what choices must be made at each stage of the process. 3.1 Conceptual Representation To represent temporal concepts in Pr6texte, we chose the principles of Discourse Representation Theory (DRT), which offers one of the most interesting explanations of how temporal notions are conveyed by a text. DRT was developed to deal with specific problems of discourse understanding: in particular, problems with anaphora and the differences between some verb tenses, with respect to temporal localization. Our goal is not to show how this theory can be used for generation but rather to use its principles as a convenient formalism for the representation of time.","In DRT, a text is associated with a Discourse Representation Structure (DRS) that is updated incrementally by the processing of each sentence. A DRS is a structure containing a set of entities and a set of conditions on these entities. There are different types of entities in DRT: a temporal fact can either be presented as an event (having a punctual aspect), or as a situation (having a certain extent in time, but considered from an internal perspective at a given moment in time); a temporal constant that designates a segment of the temporal axis; entities that participate in the events or situations. In Pr6texte, conceptual knowledge is represented as a DRS, which we adapted slightly for text generation. We do not distinguish between events and situations in the conceptual representation, because we want this level to remain independent of the language. Furthermore, we feel that this distinction should not be encoded at the conceptual level, rather the generation system should choose among these possibilities. There-fore, at the conceptual level we use the concept of occurrence for either an event or a situation. 94 Gagnon and Lapalme From Conceptual Time to Linguistic Time n tl t2 t3 t4 01 02 03 04 a l p b r plane(a) flight(l) engine(r) city(p) Paris(p) city(b) o20 t2 Barcelona(b) ol < n o1: make(a, 1) o3 < n o 2\" leave(a,p) o~ C tl o3: flightover(a, b) o4 < n 04: work(r) o3 C 04 n c t3 03 C) t4 tl = Sept. 10 1992 t2 = Sept. 10 1992 at 8:10 am t3 = Sept. 11 1992 t4 = Sept. 10 1992 at 9:00 am 02 <n Figure 2 Conceptual representation for the first three sentences of Discourse 1.","There are essentially two ways of considering time or, to be more precise, the notion of temporal location: either temporal location is determined using a preexisting time scale, or it is deduced from the occurrence. Following Kamp (1981), we think that the second possibility, in which temporal location is a relative concept, is more suitable for natural text processing. Treating occurrences as entities, rather than making them subordinate to temporal intervals or points, has been proposed by Davidson (1967). An occurrence may be represented in relation to another temporal object, without any reference to its own location in time. This approach eases the representation of underspecified temporal localizers--an important point for our semantics. For further discussion of the advantages of taking occurrences as primitives, see (Bras 1990; Kamp 1979, 1981). In the conceptual representation, we find four types of information: • the description of occurrences; • the description of participants in the occurrences;","• the description of temporal localizers, which are called temporal constants (they usually refer to time periods of the calendar); • temporal relations between occurrences and temporal localizers: The relation < represents temporal precedence. The overlap relation C) indicates that two temporal objects are somehow simultaneous. Thus, in our representation, \"Y happens at time X\" is represented by \"Y temporally overlaps X\". The relation C expresses the fact that the temporal extent of a temporal object is a subset of the temporal extent of another object.","Figure 2 shows the part of the DRS used to generate the first three sentences of Discourse 1. It contains five temporal constants: n, tl, t2, t3 and t4. It is not clear how 95 Computational Linguistics Volume 22, Number 1 these temporal constants are to be described in DRT, so we have proposed elsewhere a formalization of the type of objects designated by these constants (Gagnon and Bras 1994). In this article, we give only an English description of them: n represents speech time, which, in Figure 2, is included in the time represented by t3"]},{"title":"(September 11 1992).","paragraphs":["Four occurrences are represented: ol, o2, o3, and o4, all of which take place before n.","Not all temporal relations in the DRS need to be given as input because many relations can be inferred using three kinds of knowledge:","• The representation of conventional time to identify a specific period in time; this representation relies on a structure of conventional time, together with reasoning mechanisms to deduce temporal relations (see Gagnon and Bras [1994] for an implementation of such a structure). For example, from this knowledge we can deduce that"]},{"title":"September 10","paragraphs":["must be before"]},{"title":"September 11,","paragraphs":["which would be represented as tl < t3. Similarly, we can deduce t2 C tl, t4 C tl, and t2 < t4.","• World knowledge about the occurrences: knowing that o2, 03, and o4 are part of Ol implies that they are all temporally included in it.","• A reasoning mechanism on the temporal relations, using a set of axioms, such as:"]},{"title":"Vx, y(xOyvx < yvy < x) Vu, v,x,y(uOxAvOyAx < y~ uOvVu < v)","paragraphs":["The first axiom states that for any two times, either they overlap or one precedes the other. The second axiom states that if two other times u, v overlap two times x, y that are in a precedence relation, either u overlaps v, or it precedes it. So in Figure 2, from the relations 02 O t2, 03 O"]},{"title":"t4,","paragraphs":["and t2 <"]},{"title":"t4,","paragraphs":["we can infer o2 < 03 V o20 o3. From world knowledge, we can infer that o2 and 03 cannot overlap (leaving of Paris cannot overlap flying over Barcelona); Therefore, we conclude that 02 ~ 03. 3.2 The Discourse Representation To generate a text from an input such as Figure 2, we must choose a discourse structure that segments the message into sentences.","Figure 3 illustrates one discourse representation, inspired by the Segmented Discourse Representation Theory (SDRT) proposed by Asher (1993), which extends DRT by adding rhetorical relations such as those found in RST (Mann and Thompson 1987). A discourse structure that contains the same information as in Figure 2, except that it has been segmented, we call a Segmented Discourse Representation Structure (or SDRS). The top-level DRS contains three small DRSs that are linked by rhetorical relations: each DRS corresponds to a sentence. In addition to these three small DRSs, the top-level DRS contains the global text information: the description of participants and the description of speech time. We do not yet produce this discourse structure, but we are working on this problem, using the results of researchers who have applied SDRT to the analysis process (Lascarides and Asher 1993; Bras and Asher 1994). In the discourse structure of Figure 3, one sentence is elaborated by two other sentences that constitute a narration. 96 Gagnon and Lapalme From Conceptual Time to Linguistic Time plane(a) fight(l) city(p) Paris(p) n t3 a l p b r","Ol tl o1: make(a, 1) tl = Sept. 10 1992 Ol Kn Ol C tl Elaboration Barcelona(b) engine(r) t3 = Sept. 11 1992 n C t3 city(b)","02 t2 o2: leave(a, p) t2 = Sept. 10 1992 at 8:10 am 02 Kn 02 0 t2 Narration","03 04 t4 03: flightover(a,b) 04: work(r) O3 (n 04 <n t4 = Sept. 10 1992 at 9:00 am 03 C 04 03 0 t4 Figure 3 Discourse representation for the first three sentences of Discourse 1. 3.3 Semantic Representation The discourse structure is then translated into a semantic representation of the form $1, $2,..., Sn where Si designates the i th element of a semantic representation S. Transla-tion of the SDRS is obtained by a depth-first traversal of the DRSs it contains. For each DRS, we establish its corresponding feature structure in the semantic representation.","Figure 4 is a semantic representation produced from the SDRS of Figure 3. Each structure contains five features. The feature message refers to the occurrence that must be reported by the sentence, and specifies its aspect. We distinguish, as Kamp does, two aspects that can be used to present an occurrence: event or situation. Situations can be open or resulting. A situation is open when the speaker/hearer is located at a time within an occurrence. A resulting situation is the state following the termination of an occurrence. In French, the event aspect for a past occurrence results in the use of the pass~ composd (simple past in English). The imparfait and the plus-que-parfait correspond to open and resulting situations (the closest tenses in English are the past progressive and the past perfect). In the first two elements of Figure 4, the occurrence is presented as an event, whereas in the last one it is presented as an open situation. Among the four occurrences contained in the DRS, only three of them constitute the main \"message\" of the text: ol, o2, and o4.","The four other features in a structure Si give the value of four temporal markers that express the localization of the occurrence. These markers correspond to the four markers proposed by Kamp and Rohrer (Bras 1990) for the analysis of texts, which we have adapted for text generation. They can be seen as an extension of Reichenbach's markers (1947). Essentially, the values of these four features depend on two data:","• the DRSs to which the visited DRS is attached in the discourse structure, and • the rhetorical relations. 97 Computational Linguistics Volume 22, Number 1 Figure 4 message = event(ol) N=n REF = nil PERSP = n LOC = tl","S1 message = event(o2) N=n R =Ol PERSP = n LOG = t2","$2 message : open_situation ( o 4 ) N=n R=o2 PERSP = n LOC = o3","S3 Semantic representation for the first three sentences of Discourse 1. O1 : .... ~. Elaboration"]},{"title":"102 .... LNa a onL04 .... INaati°nIO5 .... I a ati°n","paragraphs":["~. Flashback"]},{"title":"h 08: .... I","paragraphs":["06:"]},{"title":".... [ Narration ~,","paragraphs":["07: .... ] Figure 5 Discourse representation for the first seven sentences of Discourse 1.","The marker N represents the time of speech. This marker is constant in our example, but it could be locally altered in the discourse, in indirect speech for example. We did not study such cases, but we think that the marker N would be required to deal with them.","Perspective point PERSP refers to an instant from which the occurrence must be considered. Usually it is the same as the time of speech, but in some cases, such as a flashback, it has a different value. In Discourse 1, there is one such case. The fifth and sixth sentences (where occurrences o6 and o7 are reported) constitute a flashback: the perspective point is the occurrence of the fourth sentence (os). In discourse structure, the flashback is represented with a rhetorical structure. Consider for example the discourse structure for the first seven sentences of Discourse 1 as sketched in Figure 5. For the translation of the two DRSs containing 06 and o7, the value of PERSP will be the occurrence o5, since the DRS containing this occurrence dominates the two others with the relation flashback. For the next DRS, the one containing os, the perspective point will be reset to the value it had before entering the flashback, that is, the value when the DRS of o6 was considered.","The value of PERSP is used for the choice of verb tense. In Discourse 1, the flashback results in the choice of the plus-que-parfait.","LOC represents the temporal location of the occurrence reported. If this occurrence overlaps another temporal object, this object may be used as a value for LOC. In 98 Gagnon and Lapalme From Conceptual Time to Linguistic Time Figure 4, the values of LOC show that tl and t2 are used to localize the first two occurrences. In the third sentence, the situation corresponding to o4 is presented at the instant where o3 takes place. If no other temporal object overlaps the one that constitutes the message, the temporal location represented by LOC can be defined in relation to another temporal object. We will see examples of this in the next section. LOC represents the information to be expressed by an ATL in the sentence and does not necessarily have a value, because a sentence may not contain an ATL.","In a text, when we want to express a succession of occurrences, we need a way to memorize the occurrence that is used as a reference for the localization of the next one. This is exactly the role of the marker REF. The values of REF are used to represent the progression of time in the discourse. Each time a sentence expresses a new temporal location (which can be an occurrence or a temporal constant), the value of REF is updated to this new value, and the temporal localization in the following sentence may be achieved in relation to this reference. The following rules are used for identifying the value of REF:","1. Identify the S-antecedent, the DRS to which the current DRS is attached in the discourse structure, and Sa, the feature structure associated with this DRS in the semantic representation. 2. If the occurrence reported as message in"]},{"title":"Sa","paragraphs":["is presented as a situation, it cannot be used as a reference point, since a situation cannot state a progression in time.","3. If LOC has a value that is temporally more precise than the occurrence in the message, REF will take on its value, otherwise REF is bound to the occurrence in the message, if this occurrence is not presented as a situation.","4. If LOC has no value and the occurrence in the message is a situation, the antecedent sentence does not state a progress in time. Therefore, REF takes the same value as in"]},{"title":"Sa.","paragraphs":["In Figure 4, the context for the first sentence is empty, so no value is given to REE For the second and third sentences, the value of REF is the event presented in the previous sentence. The occurrence in the third sentence is expressed as a situation, so it cannot be the reference for the fourth sentence (not shown in the figure). Consequently, REF for the fourth sentence takes the value of LOC in the structure of the third sentence: t4. We will see in Section 5 how the value of REF is used to produce the temporal adverb.","The choice of aspect in building the semantic structure is achieved by taking into account pragmatic information and the interaction with other choices, such as the type of temporal localizer. Currently, we first identify the localizer that constrains the selection of aspect, but more study is needed to clarify their interaction.","If an occurrence is presented as a situation, the temporal localizer must be a time included in it; but an event aspect cannot be combined with a localizer. In Figure 4, the occurrence of $1 must be presented as an event, since the localizer tl includes the occurrence. In $2, the occurrence is also an event, even if the localizer overlaps the occurrence: the overlapping relation does not prevent the existence of an inclusion relation. If an inclusion relation between t2 and o2 could be deduced, then the situation aspect could be chosen. In $3, the localizer is included in the occurrence of the message, so the situation aspect is selected. 99 Computational Linguistics Volume 22, Number 1 message = event (oi) N=n R = nil P=n L = ch message = event(o2) N=n","' R =01 P=n L = ct2 Figure 6 An alternative semantic representation. message = event(03) N=n","' R =02 P=n L = ct4 message = open_situation ( o 4 ) N=n","' R =03 P=n L = ct4"]},{"title":")","paragraphs":["The semantic representation given in Figure 4 is not unique. Figure 6 shows another semantic representation built from the DRS of Figure 2. It contains a fourth sentence. The main difference from the previous representation is that 03, instead of acting as a localizer for o4, is the message of a sentence; t3, referring to a moment located two hours after t2, localizes o3. Therefore, instead of the third sentence of Discourse 1, we would obtain these two sentences: Deux heures plus tard, il a survol6 Two hours later, it flew over Barcelona (o'3). At Barcelone (o~). Ace moment-la, le r6acteur this moment, the engine was working (o'4). foncfionnait (o~). Once the semantic representation is produced, the adverbial or temporal location (ATL) and the verb phrase (VP) can be generated independently. The syntactic form of the verb phrase is determined by the combination of the following information: • temporal relation between localizer LOC and speech time N; • temporal relation between localizer LOC and perspective point PERSP; • aspect of the occurrence.","The choice of the syntactic structure of the ATL depends on the value of LOC, which may refer to N or REF. The interaction of temporal information conveyed by verb tense and adverbs is taken into account in the process of translation from the conceptual representation to the semantic level, where the choices of aspect, perspective point PERSP and localizer LOC are made.","We still have not entirely solved the problem of choosing among all semantic representations that can be built from a DRS. In the current implementation of Pr6texte, we have identified a set of rules to produce the semantic representation. In particular, these rules insure that the values of the four temporal markers are coherent with the aspect chosen to present the occurrences. What remains to be done, essentially, is to identify the knowledge that governs these rules causing them to select a particular semantic representation. 3.4 Representation of Localization We have argued in the previous section that four temporal markers are needed to express the temporal location of an occurrence. In this section, we discuss the marker LOC, the localizer that provides information about the location in time of the occurrence using another entity. The localizer is usually a temporal constant, but it can also be another occurrence, whose approximate location in time is already known.","An ATL can convey localizers of two types: in the first type, a localizer directly identities the temporal zone of an occurrence using another temporal object that overlaps it; in the second type the temporal zone of an occurrence is conveyed in relation 100 Gagnon and Lapalme From Conceptual Time to Linguistic Time to another localizer. In Figure 4, all occurrences are localized directly. Occurrence 04 is localized directly by another occurrence, whereas 01 and o2 are localized directly by a temporal constant. For $1 and $2, the values for LOC are simply constants tl and t2. The same temporal localization can usually be expressed in many ways, and we must also specify how these constants are worded. For example, in Discourse 1, T1 has been translated into"]},{"title":"hier","paragraphs":["'yesterday' but it could also have been translated into"]},{"title":"le 10 septembre 1992","paragraphs":["'September 10th 1992', or"]},{"title":"mercredi dernier","paragraphs":["'last Wednesday'. Thus, the value of LOC in the semantic representation determines the expression","of the localization, giving rise to three main problems: • how to represent the temporal constants in the conceptual representation;","• how to determine the link between these conceptual temporal constants and their semantic representation, which specifies how they are to be expressed in the text; and","• how to implement the selection mechanism, which relies on pragmatic and stylistic information to choose between the many different ways of expressing the same temporal localization.","In Gagnon and Bras (1994), we gave a solution to the first two problems but the last one still remains to be solved. Here, we discuss only the second problem: the semantic expression of localization.","First, a few words about temporal context: usually, temporal localizers may be understood only in reference to some time in the context. For example, in"]},{"title":"on April 15th,","paragraphs":["it is assumed that it is clear which year this time is part of. Thus, we take for","granted that all expressions of temporal localization are made in relation to such a","contextual time.","Let"]},{"title":"ti","paragraphs":["be a temporal constant, taken from the conceptual representation, which is to be used as a localizer in the semantic representation, and"]},{"title":"tcont","paragraphs":["the contextual time. The expression in the semantic representation is based on a term of the following form:"]},{"title":"[ti, Type, Naming]","paragraphs":["The first argument is the identifier of the constant in the conceptual representation. The second argument is the type of the temporal localizer (day, month, year, etc.). Thus, tcont may be decomposed into times of type"]},{"title":"Type,","paragraphs":["of which t i is one. The last argument names the time referred to by the localizer"]},{"title":"ti.","paragraphs":["There is exactly one time in the \"real world\" that corresponds to the temporal constant"]},{"title":"ti.","paragraphs":["We call it objective time. We use the notation t* to represent the objective time that corresponds to a localizer"]},{"title":"ti.","paragraphs":["For example, the expression for the temporal localizer"]},{"title":"en avril","paragraphs":["'in April', would be something like this (here"]},{"title":"t67","paragraphs":["is the corresponding temporal constant in the conceptual representation):"]},{"title":"[t67,","paragraphs":["mort"]},{"title":"th, april]","paragraphs":["The naming"]},{"title":"april","paragraphs":["is not the syntactic word \"April\" but an internal keyword that helps distinguish between the time referred to and the other months of the contextual year.","An important distinction is made between a temporal constant ti and a objective time t*. The constant"]},{"title":"ti","paragraphs":["pertains to the way a temporal location is expressed in the discourse, whereas t~ can be considered the corresponding portion of time in the real world. More than one temporal constant may correspond to a single objective time. 101 Computational Linguistics Volume 22, Number 1 Table 1 Relative localizers. Localizer Description"]},{"title":"inclin([ti, Ti, Ni],[tj, Tj, Nj]) incl([ti, Ti, Ni],[tj, Tj, Nj]) begin([ti, Ti, Ni],[tj, Tj, Nj]) end([ti, Ti, Ni],[tj, Tj, Nj]) after([ti, Ti, Ni],[tj, Tj, Nj],D ) before([ti, T,, Ni],[tj, Tj, Nj],D) relpos(X,[ti, T, Ni],[tj, T, Nj]) extent([ti, Ti, Ni],[G Tj, Nj],[tk, Tk, Nk])","paragraphs":["t~ is a time included in the time t 7 t* is a time that includes the time tj* t~ is a time whose beginning overlaps the time t~ t~ is a time whose ending overlaps the time"]},{"title":"t;","paragraphs":["t~ is a time after the time t~ with a temporal distance D (expressed as a duration) t~ is a time before time t 7 with a temporal distance D (expressed as a duration) t~ is the"]},{"title":"X th (-X th,","paragraphs":["if X<0) time of type T after (before, if X<0) time tj* t~ is a time period starting at time t7 and ending at time t; Suppose, for example, that the discourse contains two temporal constants, corresponding to"]},{"title":"yesterday","paragraphs":["and"]},{"title":"two days after Robert's departure.","paragraphs":["We can imagine a situation where both designate exactly the same day. But it is not possible for a single temporal constant to correspond to more than one objective time. If it were, it would mean that an ATL could be ambiguous. In our computational perspective, we accept some underspecified ATLs (not precisely specifying the temporal location), but not ambiguous ones.","A triplet is the simplest expression of a temporal localization. Usually, expressing a temporal localization is more complex, because the temporal constant used as localizer cannot be rendered directly in relation to the contextual time. This is the case, for example, if the localizer is a day, and the contextual time a year, because there is no natural way of decomposing a year into days 2. In these cases, we must express relations with some intermediate localizers, until we reach one that can be related to the contextual time.","Let"]},{"title":"[ti, Ti, Nj]","paragraphs":["be the localizer and"]},{"title":"[tj, Tj, Nj], [tk, Tk, Nk]","paragraphs":["be intermediates localizers. Many kinds of relations can be distinguished. They are listed in Table 1. Note that these relations can be combined recursively. This means that the triplets used as arguments may also be represented using a relation. We will show examples of this in the following discussion.","Among the arguments of these relations, one pertains to the temporal localizer, and one (two, in the case of the relation"]},{"title":"extent)","paragraphs":["pertains to an intermediate localizer to which the temporal localizer is related. We call this last argument an anchor, since it represents a time to which the relation must be \"anchored\" in order to deduce the time of localization.","We will now give a short discussion of the relations of Table 1. In the following examples,"]},{"title":"hoe","paragraphs":["designates the temporal constant corresponding to the localizer of the occurrence, and n and"]},{"title":"trey","paragraphs":["designate the time of speech and the reference time, respectively. 2 It is possible to name the day using the religious calendar, using something like"]},{"title":"the day of St-Andrew,","paragraphs":["but it is far from usual to do so, except maybe for holidays such as Christmas, Easter, or Thanksgiving. 102 Gagnon and Lapalme From Conceptual Time to Linguistic Time","The first relation is the most frequent for expressing temporal localization. It is used to express localizations like"]},{"title":"le 3 avril","paragraphs":["'on April 3rd'. In this case, the localizer could be formulated as:"]},{"title":"inclin ( [ tto¢, day,","paragraphs":["3], [t~,"]},{"title":"month, april])","paragraphs":["As expected, the intermediate localizer tl is to be interpreted in relation to the contextual year. The semantics of a more complex localizer like"]},{"title":"le matin du 3 avril 1994","paragraphs":["'on the morning of April 3rd 1994' is an example of using recursivity for the expression:"]},{"title":"inclin ( [hoc, momen t-of-day, morning], inclin ( [ h, day,","paragraphs":["3],"]},{"title":"inclin","paragraphs":["([t2,"]},{"title":"month, april],","paragraphs":["It3,"]},{"title":"year,","paragraphs":["1994] ))) The second relation,"]},{"title":"incl,","paragraphs":["is required to deal with adverbials such as"]},{"title":"le jour oft Paul est parti","paragraphs":["'the day when Paul left',"]},{"title":"aujourd'hui","paragraphs":["'today' and"]},{"title":"ce jour-l~","paragraphs":["'that day'. All of these refer to a day, but this day is not expressed in relation to a time that includes it. On the contrary, the other time is included in it: the time when Paul left in the first example, the time of speech in the second example, and the referent time associated with REF in the third one. Suppose that in the conceptual representation, 023 is the object representing the departure of Paul. These three examples could be represented, respectively, as:"]},{"title":"incl([hoc, day,","paragraphs":["_], [O23 , -, -])"]},{"title":"incl([ttoc, day,","paragraphs":["_], [n, _, _])"]},{"title":"incl ( [ tloc, day,","paragraphs":["_],"]},{"title":"[ tref , -, -] )","paragraphs":["where \"_\" is used for arguments whose values are not relevant or unknown. The relations"]},{"title":"begin","paragraphs":["and"]},{"title":"end","paragraphs":["represent the case where only one boundary of the localizer is known. This results in an ATL such as"]},{"title":"depuis le 3 avril","paragraphs":["'since April 3rd' or"]},{"title":"jusqu'au 3 avril","paragraphs":["'until April 3rd' where meaning is ambiguous. What do we mean exactly, when we write that"]},{"title":"ti","paragraphs":["begins at time"]},{"title":"tj?","paragraphs":["That the initial boundary of"]},{"title":"ti","paragraphs":["is included in"]},{"title":"tj","paragraphs":["or that the ending of"]},{"title":"tj","paragraphs":["\"meets\" the beginning of"]},{"title":"ti?","paragraphs":["If the answer is that"]},{"title":"tj","paragraphs":["includes the initial boundary of"]},{"title":"ti,","paragraphs":["what is the constraint on the duration of"]},{"title":"ti?","paragraphs":["It is clear that it must be shorter than"]},{"title":"tj.","paragraphs":["We do not have any answers to these crucial questions, and other similar ones. These are problems that pertain to the deep generation process, which is not the focus of this paper. We think that at the level of the semantic representation, this relation need not be further clarified, since it corresponds to the way time is expressed in the language. In fact, all our relations have this underspecified nature.","For the relations"]},{"title":"before","paragraphs":["and"]},{"title":"after,","paragraphs":["the value of the temporal distance is given as a duration, using an expression of this form:"]},{"title":"duration","paragraphs":["(N,"]},{"title":"Type)","paragraphs":["The value of the duration is obtained by calculating the period corresponding to N periods of type"]},{"title":"Type.","paragraphs":["For example, the adverbial"]},{"title":"deuxjours apr~s le ddpart de Paul","paragraphs":["'two days after Paul's departure' would be represented as (023 represents the occurrence of Paul's departure):"]},{"title":"afler([hoc,","paragraphs":["-, -], [O23, -, -],"]},{"title":"duration(2, day))","paragraphs":["If the temporal distance is not known (or irrelevent), it is indicated by"]},{"title":"indefinite.","paragraphs":["Thus,"]},{"title":"aprbs le ddpart de Paul","paragraphs":["'after Paul's departure' would be represented as:"]},{"title":"after([ttoc,","paragraphs":["-,-], [023,-, -],"]},{"title":"indefinite)","paragraphs":["103 Computational Linguistics Volume 22, Number 1 Now, let's suppose that the localizer"]},{"title":"ti","paragraphs":["is of type T. tn some cases, a good way to express it is by giving its position relative to another time"]},{"title":"tj","paragraphs":["of the same type. For example, the ATL"]},{"title":"cinq jours plus tard","paragraphs":["'five days later' is not used to mean \"at a time in the future, five days from the reference time,\" but rather \"the 5th day after the one which included the reference time.\" If the reference time is itself a day, the semantics of this ATL could be:"]},{"title":"relpos( 5, [hoc, day,","paragraphs":["_],"]},{"title":"[trey,-,-])","paragraphs":["If"]},{"title":"trey","paragraphs":["is not a day, we must express the relation by taking as anchor the day which includes it:"]},{"title":"relpos","paragraphs":["(5,"]},{"title":"[ Gc, day,","paragraphs":["_],"]},{"title":"incl ( [ t l, day,","paragraphs":["_],"]},{"title":"[trey, day, -]))","paragraphs":["(This takes for granted that the time"]},{"title":"trey","paragraphs":["is not bigger than a day. If"]},{"title":"trey","paragraphs":["were bigger","than a day, it would not make any sense to express relative position by specifying the","temporal distance in days.)","Similarly,"]},{"title":"hier","paragraphs":["'yesterday' would be expressed semantically as \"the day that is the first one before the day that includes the time of speech\":"]},{"title":"relpos(-1, [tloc, day,","paragraphs":["-],"]},{"title":"incl ( [[h, day,","paragraphs":["_], [n, _, _]))","We have seen a way of expressing duration, by giving the length as a number of time units. But there is another way of expressing duration: by indicating the two boundaries of the period. By using this method, not only the duration of an occurrence is expressed, but so is its temporal location, at least partially. The relation"]},{"title":"extent","paragraphs":["is used to express this kind of duration. For example, the semantics of"]},{"title":"du 3 avril au 5 mai","paragraphs":["'from April 3rd to May 5th' is formulated as:"]},{"title":"extent([hoe, _, _], inclin ( [ h, day,","paragraphs":["3],"]},{"title":"[t2, month, april]), inclin ( [t3, day,","paragraphs":["5],"]},{"title":"[t4, month, may]))","paragraphs":["The semantics of"]},{"title":"du 3 au 10 avril","paragraphs":["'from April 3 to 10' should represent the fact that the whole duration is included in the same month:"]},{"title":"inclin (extent","paragraphs":["([boo -, -],"]},{"title":"[h, daY,","paragraphs":["3],"]},{"title":"[t2, day,","paragraphs":["10]),"]},{"title":"[t3, month, april])","paragraphs":["The relation"]},{"title":"extent","paragraphs":["is also used to represent adverbials like"]},{"title":"depuis trois jours","paragraphs":["'for three days' and"]},{"title":"pendant trois jours ?z partir du 3 avril","paragraphs":["'during three days starting from April 3rd'. These adverbials explicitly express one of the two boundaries. In the first example, it is either the time of speech or the reference time (the ATL means \"for three days until now\" or \"for three days until then\"). In the second example, it is the time corresponding to April 3rd. The other boundary is indicated implicitly by giving a temporal distance from the anchor. The first example, supposing that the explicit boundary is speech time, would be represented as:"]},{"title":"extent([tloc,","paragraphs":["-, -],"]},{"title":"before(It1,","paragraphs":["-, -], [n, _, _],"]},{"title":"duration","paragraphs":["(3,"]},{"title":"day)),","paragraphs":["In, _, _]) This expresses a period whose ending is the time of speech and whose beginning must be calculated by finding the time that is three days before speech time.","The second example would be represented as:"]},{"title":"extent( [tloc, _, _], inclin","paragraphs":["([tl,"]},{"title":"day,","paragraphs":["3],"]},{"title":"[t2, month, april]), after(It3, -, -], [t l, -,","paragraphs":["-],"]},{"title":"duration(3, day)))","paragraphs":["Note that in both examples, the same temporal constant represents both the explicit boundary and the anchor of the relation"]},{"title":"after","paragraphs":["or"]},{"title":"before","paragraphs":["used to express the implicit boundary (n and"]},{"title":"tl,","paragraphs":["respectively). 104 Gagnon and Lapalrne From Conceptual Time to Linguistic Time Table 2 Relative localizers. Adverbial Semantics entre le 3 avril et le 10 mai"]},{"title":"inclin([hoo_,d,extent([ti,_,d, (between April 3rd and May lOth) inclin([t2,day,3],[t3,month,april]), inclin(lt4,day,10],lts,month,aprill)))","paragraphs":["jusqu'tt il y a trois jours"]},{"title":"end([h ..... -], (until three days ago) before(lt2,_,_],[n,_,d,duration(3,day)))","paragraphs":["jusqu'/i mercredi de cette semaine"]},{"title":"end([tloo_,_],inclin([t2,moment-of-day,wednesday] (until Wednesday of this week) incl([tg,week,_],[n,_,_])))","paragraphs":["Considering the examples we have just given, one may think that recursivity applies only to the anchor. This is not the case. The triplet that gives the location time in the expression can be replaced by a complex expression. We have such a situation with"]},{"title":"le 3 avril dernier","paragraphs":["'the last April 3rd' represented as:"]},{"title":"relpos (-","paragraphs":["1,"]},{"title":"inclin ( [tlo¢, day,","paragraphs":["3], [tl,"]},{"title":"month, april]), incl( [t2, day,","paragraphs":["_], [n, _, _]))","More precisely, this expression means \"the April 3rd that is the first one in the past, taking speech time as starting point.\"","Finally, to illustrate the richness of our semantics for expressing ATLs, in Table 2 we give a list of more adverbials with their semantics. Note the extensive use of the combination property.","Thus, to specify the localization of an occurrence, we can use another simultaneous object, or use a localizer that is expressed in relation to another localizer. The list of relations given in Table 1, together with the possibility of combining them, offers a very powerful way of expressing the great diversity in the semantics of temporal localizers. Of course, not all the combinations may be expressed naturally in the language, but we are convinced that most of the ATLs can be expressed with this semantics. 3","The problem of representing temporal location has received a lot of attention in the past (Dowty 1979, 1982, 1986; Bach 1986; Verkuyl 1989; and Vlach 1993). But these works have focused on the aspectual structure of adverbials and their relation to tense and aspect. We have not found any previous proposals of a recursive semantics like ours for representing the various types of localizations.","More related to our work is Allen (1983) who proposes a set of primitive relations to represent all possible relations between two temporal intervals. The relations defined in Table I differ in many respects from the relations proposed by Allen. As mentioned before, ours are less precise. For example, the moment represented using the relation"]},{"title":"end","paragraphs":["in our model corresponds to three relations in Allen's model. Suppose that t* and tj* are the objective times corresponding to the localizer and the anchor, respectively. Then, in Allen's model, the end of t~ could coincide with the beginning of tj*, could coincide with the end of tj*, or could be included in"]},{"title":"t 7.","paragraphs":["The main reason for using a different set of primitives is to represent as closely as possible the way temporal localization is dealt with in language. The result of our 3 In fact, the set of relations described here is not sufficient. In Gagnon and Bras (1994), we define a more complete set of relations. 105 Gagnon and Lapalme From Conceptual Time to Linguistic Time I t ENVIRONMENT ...... ------o-M\"-'--\"~-~'- ........ n- - -Knowte.l.e.,; I base I structure concepts t I I I I I I ! ! I ! _J P R E T E R I SEMANTIC INTERFACE I -.~ ENGINE <"]},{"title":"¢","paragraphs":["GRAMMAR t (Systemic I t network) I I"]},{"title":"Ii","paragraphs":["I t I t","< --.... -*BLACK","E I BOARD I","R I"]},{"title":"Figure 8","paragraphs":["Implementation of the surface generation process in Prdtexte.","To produce a sentence, the network is processed from left to right. When a system is entered, a choice is made that may lead to another system or to a conjunction of systems processed concurrently. The syntactic structure of the phrase results from a set of constraints determined by features selected during the traversal of the entire network.","The choices made in the first traversal of the network determine the overall structure of the sentence, represented as an ordered sequence of functions that must be fulfilled. The term \"function,\" in this context, refers to the role played by a constituent of a phrase in achieving a communicative goal (Halliday 1985). For example, a sentence can often be decomposed into three constituents fulfilling the following functions: Subject, Predicate, and Object. 4","Once the functional structure of the sentence is established, its network is traversed again to determine the syntactic structure, which is then further refined until each function is realized by a single word.","Figure 8 illustrates the organization of the modules in Pr6texte, inspired by Nigel (Mann 1983; Mann 1985; Matthiessen 1985; Matthiessen and Bateman 1991). To produce a sentence, Pr6texte uses three information components: the environment, containing the information about the message and a knowledge base describing how to achieve lexicalization; the grammar, represented as a systemic network; and the blackboard, used to determine the syntactic structure. The"]},{"title":"engine","paragraphs":["controls the surface generation process and accesses the three information components through three interface modules:"]},{"title":"semantic interface,","paragraphs":["interpreter and realizer. The solver determines the final structure of the constituent, using constraints posted in the blackboard during the traversal of the network. 4 In this text, names of functions will always be capitalized. 107 Computational Linguistics Volume 22, Number 1","Before starting the surface generation process, the environment is augmented with information that determines the message: • a semantic structure such as the one illustrated in Figure 4;","• a set of relevant concepts, which are the elements of the conceptual representation pertaining to the entities in the semantic structure;","• some pragmatic information, which specifies how to transmit the message. The engine starts by posting on the blackboard the description of the realized constituent representing the sentence. It then activates the traversal of the network by the interpreter. To select a feature in a system, the interpreter transmits inquiries to the engine. If the information necessary to respond to the inquiry is in the environment, the engine transmits the inquiry to the semantic interface. If an inquiry is about a decision previously made in the surface generation process (for example, a question about what features have been selected in a system visited earlier), then the engine transmits the inquiry to the realizer.","Answers to inquiries enable the selection of a feature in the visited system. The interpreter then extracts a set of realization statements associated with the selected feature. After the execution of these statements by the realizer, the information about the structure of the realized constituent, contained in the blackboard, is updated. Three kinds of action may be executed by the realizer:","• addition of a new constituent with the appropriate semantic information fulfilling a specific function; • updating of the information pertaining to one constituent;","• addition of partial ordering constraints that identify the sequence of functions composing the final structure.","This process goes on until no more system can be visited. The solver then solves the ordering constraints on the blackboard. We thus obtain a sequence of functions that constitutes the final structure of the realized constituent. Each of these functions is associated with semantic information extracted from the environment. For example, the sentence may contain the function Temp_loc (temporal localizer), whose semantic information will be the expression associated with the temporal marker LOC in the input. If a function is to be lexicalized as a word, the lexicon is consulted to identify the word, taking into account the features selected during the traversal. Otherwise the grammar is re-entered using the function as the new realized constituent with some features preselected. For example, to generate the sentence in 2: (2) Jusqu'a 10h50, il a survol6 l'Alg6rie 'until 10:50, it flew over Algeria' the following semantic structure and relations are posted in the environment:"]},{"title":"message = event(olo)","paragraphs":["N=n R =09 PERSP = n LOC ="]},{"title":"end([hl,","paragraphs":["_, _],"]},{"title":"inclin([t6, minute,","paragraphs":["50], [t4,"]},{"title":"hour, lO]))","paragraphs":["(a) o10 < n (b) o10 C) tu 108\" Gagnon and Lapalme From Conceptual Time to Linguistic Time Positioner [ Jusque I"]},{"title":"A A /\\","paragraphs":["Reference Zon 4 il"]},{"title":"\\ I 1","paragraphs":["h lOh50 a survol4 l'Alg6rie Figure 9 The structure of jusqu'd 10h50, il a survold l'Alg&ie. where o10 must be expressed as an event and tll is a period terminating at 10:50. The event o10 is before the time of speech and it coincides more or less with the time used as localizer. The first traversal of the grammar determines the overall structure of the sentence made of the four functions at the top of Figure 9. As none of them may be lexicalized directly as a word, they must be realized by re-entering the grammar.","We describe only the realization of the function Tempdoc. The semantics associated with Temp_loc is the value of LOC in the semantic representation. Traversal of the network for the realization of Temploc results in a structure with two functions: the Positioner and the Reference Zone. The first function is lexicalized with the preposition jusque; for the second function, the grammar is re-entered, taking as semantics the anchor of the expression associated with Tempdoc: inclin([t6,minute,50], [t4,hour, lO]). Again, this results in a structure with two functions; in this case, both functions can be lexicalized, ending the realization of the function Tempdoc. The same kind of processing is done for the other functions in the sentence. 5. The Production of ATLs In Section 3.3, we showed how the semantics of ATLs is represented; in this section, we present how ATLs can be lexicalized. Table 3 gives a list of semantic representations and their translations into ATLs produced by our generator. As in Section 3.4, we use ttoc for the temporal constant corresponding to the localizer of the occurrence, n for speech time and tref for the reference time. 5.1 Syntactic Compositions Some ATLs (1-7, 16) are simple, while others (8-15, 17-18) contain an embedded temporal adverbial. For example, in (11) jusqu'?l mercredi de cette semaine 'until Wednesday of this week' contains another ATL, which itself contains another embedded ATL cette semaine 'this week'. 109 Computational Linguistics Volume 22, Number 1 Table 3 List of adverbial temporal locations. Semantics ATL (1) relpos(-1, [tloc, day, _], incl([t2, day, _], [n, _, _])) (2) relpos(-1, [hoc, daY,-], incl([t2, day, _], [tref, _, _])) (3) incl([tloc, day, _], [n, _, -]) (4) incl([tloc, month, _], [n, _, _]) (5) incl([tloc, month, _], [tref, -, -]) (6) [tloc,month,April] (7) [01 ,-,-]","(8) inclin([tloc,moment-of-day, morning], inclin([t2,season,summer],[t3,year,1995])) (9) inclin([ tloc,half-hour,1],occurrence(ol ) ) (10) duration(3,day) (11) end([tloc,_,_],inclin([t2,day, wednesday],","incl([t3,week,_],[n,_,_]))) (12) begin([tloc,_,_],relpos(1,[t2,month,_],","incl ([ t 3,month,-],[ tref ,-,-]) ) ) (13) begin([tloc,_,_],inclin([t2,day, lO],[t3,month,may])) (14) relpos(3,[tloc,day,_],occurrence(ol )) (15) after([tloc,day,_],[tref,_,_],duration(3,day)) (16) after([tloc,_,_],[tref ,_,_],indefinite) (17) extent([tloc,_,_],","inclin([t2,day,3],[t3,month,april]),","inclin([t4,day, lO],[ts,month,may]))","(18) extent([tloc,_,_], before([t2,-,-],[tre f ,-,-],duration(3,day)), [tre/,-,-l) hier (yesterday) la veille (the day before) aujourd'hui (today) ce mois-ci (this month) ce mois-la (that month) en avril (in April) quand Robert est parti (when Robert left) le matin du 3 avril 1995 (the morning of April 3rd 1995) la premi6re demi-heure de l'6mission (the first half hour of the program) durant trois jours (during three days) jusqu'a mercredi de cette semaine (until Wednesday of this week) a partir du mois suivant (from the following month) depuis le 10 mai (sinceMay lOth) trois jours apr6s le d6part de Robert (three days after Robert's departure) trois jours plus tard (three days later) puis (then) du 3 avril au 10 mai (from April 3rd to May lOth) depuis trois jours (since three days)","Unfortunately, the combination of localizers in the semantics does not always correspond to the combination of adverbials. For example, if there were such a correspondence, the adverbial in (1) would be something like"]},{"title":"lejour avant lejour qui contient l'instant d'~nonciation","paragraphs":["'the day before the day that contains the time of speech'. Instead, we get the simple adverbial"]},{"title":"hier","paragraphs":["'yesterday'. For complex semantic expressions, in all examples except (15), (16) and (18), there is one embedded adverbial corresponding to each anchor. For example, the anchor"]},{"title":"relpos(1,[t2,month,_], incl([tB,month,_], [tref,-,-]))","paragraphs":["in (12) corresponds to"]},{"title":"le mois suivant","paragraphs":["'the following month' in the adverbial. 5 Examples (1-5) are special, since the relation and the anchor are combined in the same syntactic structure. In (15), direct translation of the anchor into an adverbial would produce"]},{"title":"trois jours apr~s ce mornent-l?l","paragraphs":["'three days after that moment', and in (18),"]},{"title":"pendant trois jours jusqu'?~ ce moment-l?l","paragraphs":["'during three days until that moment'. Since there is not always a direct correspondence between semantic and syntactic 5 Note that in the adverbial, du is a contraction of de le. 110 Gagnon and Lapalme From Conceptual Time to Linguistic Time QTY\" ANCHORS I unique double"]},{"title":"( Figure 10","paragraphs":["Section of Pr4texte's grammar for adverbials. ANCHOR ANCHORI ANCIIOR2 deictic","~ anaphoric autonomous"]},{"title":"~","paragraphs":["- deictic anaphoric autonomous","i deictic anaphoric autonomous forms, which one should be used in the grammar to distinguish among ATLs? We have chosen the semantic form because adverbials are distinguished not only by the number of anchors but also by their nature. Examples (4) and (5) are both syntactically simple---the anchor in the semantic form is not expressed--but it is the anchor that explains their difference: the first uses speech time, whereas the second uses reference time.","Figure 10 illustrates the part of the network taking into account the combination property. We first identify the number of anchors. If there is only one, the feature unique is selected in the system QTY_ANCHORS. Otherwise, double is selected. Then, for each anchor, we must establish if it is deictic, anaphoric, or autonomous. If the localization represented by the anchor is made in relation to the time of speech, deictic is selected; if the localization is made in relation to the reference time, anaphoric is selected; if the anchor achieves a localization without using either of the two temporal markers, autonomous is selected. In Table 4, we indicate the features selected in the systems of Figure 10, for the production of the adverbials given in Table 3.","Some adverbials may be distinguished using the systems of Figure 10, but Table 4 shows that these systems are not enough. The features have a strong influence on the most embedded adverbials. For example, in (11), the selection of deictic results in cette semaine 'this week' for the most embedded adverbial but if the feature anaphoric had been selected, it would have produced cette semaine-lit 'that week'.","These features alone do not explain the recursive form of adverbials. Figure 11 shows the structure of two adverbials from Table 3. The structure of adverbial (11) is given in (a). It has three levels, each one corresponding to one adverbial. The simple structure of adverbial (4) is shown in (b). Their difference is not only due to the number of levels in the structure. In (a), the structure contains a function, the Positioner, that expresses the relation to the anchor; there is no function in (b). Sometimes an anchor is not realized syntactically at all. In Figure 12, we consider (13) and (15): the anchor is expressed in (13), shown in (a), but not in (15), shown in (b). The structure of (15) contains the Positioner and a function conveying the temporal distance to an implicit anchor.","These examples show that features are not sufficient; to determine the syntactic structure of the adverbial, we need more systems in our grammar, such as the network of Figure 7. The two networks of Figure 7 and Figure 10 must be traversed in parallel.","The system ZONE_DESIGNATION first distinguishes between adverbials that ex-111 Computational Linguistics Volume 22, Number 1 Table 4 Distinction of adverbials using the anchor. (The numbers correspond to the adverbial's position in Table 3.) Adverbial QTY_ANCHORS ANCHOR ANCHOR1 ANCHOR2 (1) hier (3) aujourd'hui (4) ce mois-ci (11) jusqu'h mercredi de cette semaine (2) la veille (5) ce mois-lh (12) a partir du mois suivant (15) trois jours plus tard (16) puis (6) en avril (7) quand Robert est parti (8) le matin du 3 avril 1995 (9) la premi6re demi-heure de l'6mission (10) durant trois jours (13) depuis le 10 rnai (14) trois jours apr6s le d6part de Robert (17) du 3 avril au 10 mai (18) depuis trois jours unique umque unique umque umque unique unique unique umque umque unique unique umque unique umque umque double double deictic deictic deictic deictic anaphoric anaphonc anaphoric anaphoric anaphoric autonomous autonomous autonomous autonomous autonomous autonomous autonomous autonomous anaphonc autonomous anaphoric Positioner [ Jusque"]},{"title":"Until","paragraphs":["Reference Zon~"]},{"title":"\\","paragraphs":["[Zone Designator[ Attributor Reference Zon~ h mercredi de [,-Zone Designator]"]},{"title":"Wednesday of / NNN, N","paragraphs":["cette semaine"]},{"title":"this week","paragraphs":["(a) (b) Figure 11 Difference of structure for (11) and (4). Zone Designator]"]},{"title":"/\\","paragraphs":["ce mois-ci"]},{"title":"this month","paragraphs":["press localization directly, as in (1-9), and adverbials that relate it to other localizers. Selection of"]},{"title":"direct","paragraphs":["includes a function Zone Designator in the structure for the most embedded adverbial of (a) and the adverbial of (b) in Figure 11. This function is realized by a phrase expressing the temporal location, which may be a temporal constant (feature"]},{"title":"chronological)","paragraphs":["or an occurrence (feature"]},{"title":"occurrential).","paragraphs":["If"]},{"title":"relational","paragraphs":["is selected in ZONE_DESIGNATION, a function Positioner is inserted in the structure. This function is realized by a phrase that expresses the relation of the localizer to its anchor. There are two types of relational localizers: those that express a 112 Gagnon and Lapalme From Conceptual Time to Linguistic Time Positioner [ RefercnceZonc("]},{"title":"/\\","paragraphs":["depuis le 10 mai Since May lOth"]},{"title":"(a) Figure 12","paragraphs":["Difference of structure for (13) and (15)."]},{"title":"I T m ora, sta eol pvs,tionor I","paragraphs":["trois jours plus tard three days later"]},{"title":"(b)","paragraphs":["Table 5 Distinction of adverbials with type of designation. (The numbers correspond to Table 3.)","Adverbial ZONE DESIGNATION TYPE LOC ZONE LOCT ASPECT (1) hier direct chronological -- (2) la veille direct chronological -- (3) aujourd'hui direct chronological -- (4) ce mois-ci direct chronological -- (5) ce mois-la direct chronological -- (6) en avril direct chronological -- (8) le matin du 3 avril 1995 direct chronological -- (9) la premi6re demi-heure de l'6mission direct chronological -- (7) quand Robert est parti direct occurrential -- (10) durant trois jours relational -- durative (11) jusqu'~ mercredi de cette semaine relational -- durative (12) a partir du mois suivant relational -- durative (13) depuis le 10 mai relational -- durative (17) du 3 avril au 10 mai relational -- durative (18) depuis trois jours relational -- durative (14) trois jours apr6s le d6part de Robert relational -- punctual (15) trois jours plus tard relational -- punctual (16) puis relational -- punctual duration (see (a) in Figure 12) and those that designate a punctual temporal location (see (a) in Figure 11 and (b) in Figure 12).","The classification of adverbials using these distinctions is shown in Table 5. But even by combining this classification with that of Table 4, we cannot distinguish between all adverbials. For example, (1, 3, and 4) select the same features in both networks, as do (2 and 5), (6, 8, and 9), and (15 and 16). For each of the four cases of Table 5, we will show how the adverbials can be distinguished. 5.2 Relational Localizers 5.2.1 Punctual Localizers. The function Positioner is always present in adverbials for which the feature punctual has been selected; this is a consequence of the selection of the feature relational. In addition to Positioner, there can be two more functions. One is the Temporal Reference Zone, which conveys the localizer to which the relation expressed by the Positioner pertains. In our list, only adverbial (14) contains this function: le ddpart de Robert 'Robert's departure'. The other function is Temporal Distance, which expresses the length of time from the localizer used as anchor. This function occurs in 113 Computational Linguistics Volume 22, Number 1 Positioner l Puis Then Auparavant Before"]},{"title":"(a)","paragraphs":["[ Positioner ] Temporal Distance [ Dans trois jours In three days from now I1 y a trois jours","Three days ago (b) [ T~Zone[ Positioner ] Trois jours pllas tard Three days tater Trois jours av ant Three -days earlier"]},{"title":"(c)","paragraphs":["[ Positioner ] Temp Ref Zone [ a~re~s le d61~art de Robert R o berY s departure avant 8h00 before 8:00 ] Temporal Distance ] Positioner [ Temp Ref Zone["]},{"title":"/\\ /\\","paragraphs":["T,~trOiS jours al~r~s !e d6partde Robert ee aays after Kooert's aeparture Trois jours avant le d6part de Robert Three ~ays before Robert's departure (d)"]},{"title":"(e) Figure 13","paragraphs":["Structure for punctual adverbials. RELATION TYPE V before punctual L_ after f explicit REFERENCE ZONE E implicit"]},{"title":"3--","paragraphs":["TEMtK)RALDISTANCE F definite ~-- indefinite Figure 14 Grammar section for relational punctual adverbials. adverbials (14) and (15): trois jours 'three days'. Thus, (14) contains both functions and (15) contains only the Temporal Distance. Adverbial (16) is distinguished from (14) and (15) because it contains neither of these functions.","In dans trois jours 'in three days from now' and apr~s le 9 octobre 'after October 9th', we find two different structures. The elements of the first structure are exactly the same as the structure of adverbial (15), but they occur in a different order: Temporal Distance comes before the Positioner. In the second structure, there is a Temporal Reference Zone, le 9 octobre, but no Temporal Distance. Thus, for punctual adverbials, there are five possible structures, illustrated in Figure 12. To distinguish between these adverbials, we use a network, part of which is shown in Figure 13.","Two features are expressed by the system RELATION TYPE: before and after. To realize the Positioner, there is no need to re-enter the grammar, since it may be found directly in the lexicon. The lexical choice depends not only on the selection achieved 114 Gagnon and Lapalme From Conceptual Time to Linguistic Time Table 6 List of punctual adverbials.","Adverbial RELATION REFERENCE TEMPORAL TYPE ZONE DISTANCE","(14) trois jours apr6s le d6part de Robert after explicit definite (three days after Robert's departure) apr6s le 9 octobre (after October 9th) after explicit indefinite","(15) trois jours plus tard (three days later) after implicit definite dans trois jours (three days from now) after implicit definite","(16) puis (then) after implicit indefinite trois jours avant le d6part de Robert before explicit definite (three days before Robert's departure) avant 8h00 (before 8:00) before explicit indefinite trois jours avant (three days earlier) before implicit definite il y a trois jours(three days ago) before implicit definite auparavant (before) before implicit indefinite in RELATION TYPE, but also in the choice made in the system ANCHOR of figure 10. For example, in the cases where after is chosen, the Positioner could be lexicalized as puis 'then' or plus tard 'later'; if anaphoric is chosen in ANCHOR it can be lexicalized as dans 'in' if deictic is chosen or apr~s 'after' if autonomous is chosen.","The fact that Temporal Distance and Temporal Reference Zone are optional in the structure is represented in the grammar by two parallel systems: REFERENCE ZONE and TEMPORAL DISTANCE. If, in REFERENCE ZONE, explicit is chosen, the function Temporal Reference Zone is included in the structure. Since this function represents another localizer, the anchor, it is realized by re-entering the grammar, taking as input the semantic representation of this anchor. In TEMPORAL DISTANCE, the selection of definite results in the inclusion of the function Temporal Distance. To realize it, the grammar must be re-entered, and some features must be preselected so that it is realized as a noun phrase.","Table 6 lists all possible adverbials represented by the network of Figure 13 together with their selected features. The three adverbials taken from Table 3 are preceded by their reference number to ease the comparison of their semantics with the selected features; their relations will be discussed later.","The distinction between structures (b) and (c) in Figure 12 is not explained by the grammar section shown in Figure 13, since the same features are selected for trois jours plus tard and dans trois jours. However, structure (b) in Figure 12 is found only for deictic localizers. Therefore, features for deictic localizers selected in the system ANCHOR, will distinguish structure (b) from structure (c).","Let us now see how the features are selected for the production of relational punctual localizers. In RELATION TYPE, the feature reflects the relation used in the semantics, if this relation is before or after. Adverbial (14) deserves some explanation. Since its semantic expression uses the relation relpos, we would expect its syntactic realization to be: le troisi~me jour apr~s le jour du d6part de Robert 'the third day after the day of Robert's departure', but this usage is rare. Instead we find trois jours apr~s le d6part de Robert 'three days after Robert's departure', which is what we would expect if the semantic expression used the relation after. This seems to be because if the temporal distance is one unit, a direct localizer is preferred. So, instead of generating un mois plus tard 'one month later', we produce le mois suivant 'the next month'. Our intuition 115 Computational Linguistics Volume 22, Number 1 durative DURATION TYPE bound quantified DURATION ANCHOR DURATION PERSPECTWE","-- anterior posterior double QUANTDURATION E anterior ANCHOR posterior nil Figure 15 Grammar section for relational durative adverbials. -- internal external [P.~i--, ] D~oo Q~,ty i l I '°'ia°'= ] Bo.d~, ] ..~e~ ~ays . Jusque Is mercredi de three days Sm.ce","for ~¢rom that moment) A r~oir de le 10 mai","may lOth (a) (b) Figure 16 Structure for durative localizers. Du 3 avril au lOmai From April 3rd to May 10th (c) is that when X is '%ig\" we have this equivalence:"]},{"title":"relpos(X, [ti, Ti, Ni], Z) ::~ afler([ti, Ti, Ni], Z, duration(X, Zi) )","paragraphs":["and similarly for X negative and the relation"]},{"title":"before.","paragraphs":["More study is needed to determine the threshold at which the two relations become equivalent in the linguistic realization. We are sure that for X = I or X = -1, they are not equivalent, so in our implementation, we use 2 and -2 as thresholds.","In the system REFERENCE ZONE, the feature"]},{"title":"implicit","paragraphs":["is chosen if the anchor is a simple localizer using the reference time or the time of speech, otherwise"]},{"title":"explicit","paragraphs":["is chosen. Feature selection in TEMPORAL DISTANCE depends on whether the third argument in the semantic expression is"]},{"title":"indefinite","paragraphs":["or a specified duration. 5.2.2 Durative Adverbials. We now show how the durative adverbials of Table 5 can be differentiated. The part of the network that generates these adverbials is shown in Figure 14. We give the three kinds of structure identified for these adverbials in Figure 15, and, finally, in Table 7 we list the durative adverbials of Table 5 with their corresponding features according to the systems of Figure 14. To give a complete illustration of all adverbials generated with the network of Figure 14, we added one adverbial to the list:"]},{"title":"pendant trois jours","paragraphs":["'for three days from now', which is symmetrical to"]},{"title":"depuis trois jours","paragraphs":["'for three days until now'. In Figure 14, we distinguish two types of durative adverbial phrases:"]},{"title":"bound,","paragraphs":["if the duration is expressed by specifying one or two of its boundaries; and"]},{"title":"quantified,","paragraphs":["116 Gagnon and Lapalme From Conceptual Time to Linguistic Time Table 7 List of durative adverbials.","Adverbial DUR. DUR. DUR. QUANZ TYPE ANCH. PERSE DUR.","ANCH. (13) depuis le 10 mai (since May lOth) bound ant. int. -- (12) a partir du rnois suivant bound ant. ext. --","(from next month) (11) jusqu'~ mercredi de cette semaine bound post. -- --","(until Wednesday of this week) (17) du 3 avril au 10 rnai bound double -- --","(from April 3rd to May lOth) -- pendant trois jours quant. -- -- ant.","(for three days until that moment) (18) depuis trois jours quant. -- -- post.","(for three days from that moment) (10) durant trois jours (during three days) quant. -- -- nil if the duration is expressed as a quantity of time units. In the first case, we get a structure such as (b) or (c) in Figure 15. In (b) there is only one boundary, and the Positioner indicates which one is used: its lexicalization depends on the feature selected in DURATION ANCHOR. If anterior is selected, one further distinction is required to lexicalize the Positioner, as represented by the system DURATION PERSPECTIVE. The Positioner is realized by the phrase ~ partir de if the feature chosen is external, otherwise it is realized as depuis. The choice depends on the aspect of the occurrence reported: the feature external is chosen if the occurrence is presented as an event, and internal is chosen if the occurrence is presented as a situation. These two cases are exemplified in the following two sentences:","(3) a. A partir de 1972, il enseigna a l'Universit6 de Montr6al. 'From 1972 on, he taught at Universit6 de Montr6al'. b. Depuis 1972, il enseignait a l'Universit6 de Montr6al. 'Since 1972 he was teaching at Universit6 de Montr6al'.","In (3a), since the occurrence is presented as an event, the feature external is selected during the determination of the ATL, thus resulting in the form ~ partir de 1972 'from 1972'. In (3b), the same occurrence is presented as a situation considered from the reference time. Thus, internal is selected, resulting in the form depuis 1972 'since 1972'. This is a good example of the interaction of ATLs with the aspect of the occurrence.","In the interpretation of the ATL in (3b), the duration is anchored not only on the year 1972 but also on the reference time included in the occurrence. But in the semantics of the ATL, which uses the relation begin, as well as ATL (12) in Table 3, there is only one anchor. Even if the reference time is involved in the understanding of the whole sentence, it is not directly expressed in the semantics of the ATL.","An alternative would be to express the same localization using the relation extent, as in (18) of Table 3. If the reference time is included in 1982 (the beginning of the duration expressed in (3b) thus being 10 years before), the semantics would be:","extent([hoc,_,_],before([tl,year, d,[t2,_,-],duration(lO,year)), incl([ta,year, d,[tref ,_,_])) 117 Computational Linguistics Volume 22, Number 1 In"]},{"title":"depuis dix ans","paragraphs":["'For 10 years', the meaning of the ATL, which is \"since 10 years","in the past starting from this moment\" requires the use of the reference time. If, in the system DURATION ANCHOR, the feature"]},{"title":"double","paragraphs":["is chosen, we get a structure containing two boundaries, as in (c) in Figure 15. A boundary, in the structure of a bound localizer, is always realized as a temporal adverbial, by re-entering the grammar.","When the feature"]},{"title":"quantified","paragraphs":["is selected, the structure in (a) of Figure 15 is obtained. To realize the Positioner in this case, another system is required, because the quantity of time that constitutes the duration can be worded in many ways. We can express the duration of the occurrence without giving any hint about its location in time, as in"]},{"title":"durant trois jours","paragraphs":["'during three days', or we can indicate a duration that begins or","ends at some time.","To see how the features are selected in the grammar section of Figure 14, compare","the adverbials of Table 7 with their semantics as given in Table 3 (the semantics for"]},{"title":"pendant trois jours","paragraphs":["is the same as"]},{"title":"depuis trois jours,","paragraphs":["but the relation"]},{"title":"after","paragraphs":["is substituted"]},{"title":"before","paragraphs":["and the two anchors are reversed). First, the feature"]},{"title":"bound","paragraphs":["in DURATION TYPE is selected if the relation used in the semantic representation is either"]},{"title":"begin","paragraphs":["or"]},{"title":"end,","paragraphs":["or if it is"]},{"title":"extent","paragraphs":["and the two anchors are autonomous. In DURATION ANCHOR, features","corresponding to these three cases are selected. In DURATION PERSPECTIVE, the","selection depends on the aspect of the occurrence reported in the sentence.","In DURATION TYPE,"]},{"title":"quantified","paragraphs":["is selected if the semantics uses the relation"]},{"title":"extent","paragraphs":["and one anchor is deictic or anaphoric, as in our examples, or if it uses the relation"]},{"title":"duration.","paragraphs":["In the first case, the selection depends on the position of the anaphoric or deictic anchor in the expression. If the relation"]},{"title":"duration","paragraphs":["is used, since there is no anchor, the feature"]},{"title":"nil","paragraphs":["is selected in the next system. 5.3 Direct Localizers We complete our discussion of adverbials by explaining how the direct localizers can be differentiated. Figure 16 shows the structure of the direct adverbials that constitute the first half of Table 5; there are three possible structures for a direct localizer. The simplest ones, in (a) and (b), contain only one function, Zone Designator, that expresses the temporal location zone designated by the adverbial. This function is realized directly by an adverb, in (a), using the lexicon depending on the system ANCHOR of Figure 10. In (b), the grammar must be re-entered to generate a nominal phrase whose form also depends on the choice in ANCHOR.","In some cases, it is not sufficient to specify a temporal location zone: we must also add what we call a Pointer to relate the occurrence with this zone. In our examples, the Pointer indicates that the occurrence takes place"]},{"title":"during","paragraphs":["the month of April, or"]},{"title":"when","paragraphs":["Robert left. The existence of such a localizer in the structure seems to depend on the level of the adverbial in the embedding structure. For example, we find a Pointer in the adverbial ~"]},{"title":"ShOO","paragraphs":["'at 8:00' if it is used alone, but not if it is embedded in another adverbial, like"]},{"title":"depuis 8hO0","paragraphs":["'since 8:00'. Our approach to this problem may be contrasted with Forster's (1989), who determines the realization of the Pointer by the temporal aspect of the Zone Designator (durative or punctual) using a constraint propagation technique.","Other possible structures for direct localizers are illustrated in (d) and (e) in Figure 16. One function is the Zone Designator, which designates the direct expression of temporal zone. If this zone is included in another localizer or in a position relative to another localizer, we must include another function in the structure: the Reference Zone, which corresponds to this second localizer. The Attributor links these two functions. In (e),"]},{"title":"le matin du 3 avril 1995","paragraphs":["'the morning of April 3rd 1995' directly expresses 118 Gagnon and Lapalme From Conceptual Time to Linguistic Time"]},{"title":"Izo=~i~o~l Iz/;n~sign~,rl [Po~i~ tz°nem~'a~\"°q /X /X","paragraphs":["Aujourd'hui Ce mois-ci En avril Today This month In April l-Iier Ce mois-l~t Quand Robert est parti Yesterday That month When Robert lift","La veille","The day before (a) Co) (c) I ZoneDesignat~rAttributor ] ReferenceZonb [Zone Designatot de I Z°ne DesignatOr l"]},{"title":"/\\","paragraphs":["La premi&e demi-heure 1'6mission The first half-hour the program (d) I Z°neDesignat°1 Attributor Referen¢.eZorle"]},{"title":"/","paragraphs":["Zone Designatoq Auributor I Kelerence z.o~e"]},{"title":"/\\ I","paragraphs":["d~ | [ ZoneDestgnator I Attn0utor li~c~crencez-on~ [ Zone Designator I of I","the3rd I avril ~ t ator I !","Le matin I April ~ I j//N'N I","The morning ! I","1995","I I=_-- I I ............ =_----:-'---- (e) Figure 17 Structure for direct localizers. a morning. This morning is itself part of another localizer, and so on. The Attributor is sometimes lexicalized as an empty item.","To these direct localizers, we must add the embedded direct adverbials found in the relational adverbials of table 5. In Figure 17, we use by dashed-line boxes to indicate those that differ from Figure 16.","The system shown in Figure 18 differentiates among these different forms of direct adverbials. For occurrential adverbials, for example, the second adverbial of (b) in Figure 16 and the embedded adverbials in (d) in Figure 16 and (b) in Figure 17, the occurrence may be nominalized or not. We do not have any satisfying answers to the question of how to choose between these two possibilities. We will state only that when the adverbial is embedded, a nominalized form may be preferred to another embedded adverbial.","For chronological adverbials, the system AUTONOMOUS ZONE distinguishes between those that have an anaphoric or deictic temporal location zone, and those for which the temporal location zone is autonomous. Adverbials of the first type always have a simple structure: aujourd'hui, hier, demain, ce mois-ci, ce mois-lh, cette semaine, le mois suivant. The temporal location zone is different from the anchor. In mercredi de cette semaine \"Wednesday of this week', the temporal location zone, expressed by mercredi, is autonomous whereas the anchor expressed by cette semaine is deictic. When the network is traversed the first time, yes is selected in the system AUTONOMOUS ZONE. Its only in the second traversal, when cette semaine is generated, that no is selected in this system.","We must further distinguish adverbials with an autonomous temporal location zone, by deciding if their structure contains a Reference Zone or not. The feature 119"]},{"title":"Computational Linguistics Volume 22, Number 1 I Bouna y I Jusque IZoneDesignatorl Attributor I Referencezon4 Until / [ Pointer [Zone Designator I /\\ a mercredi Wednesday de of !","paragraphs":["r ..... .T ...... V"]},{"title":"[Zone Designator ] /\\ cette semaine this week","paragraphs":["........... i .................................. !"]},{"title":"(a) [ Temporal Distance I Positioner ] Temp Ref Zone I /\\ Trois jours","paragraphs":["Three days"]},{"title":"apr~s after [Zone Designator [ /\\ le d6part de Robert Robert's departure I Positionerl Boundary ] A partir de [Zone Designator [ Fro,. /~ Depuis","paragraphs":["From"]},{"title":"le mois prochain","paragraphs":["the next month"]},{"title":"le 10 mai","paragraphs":["May lOth ........... _1"]},{"title":"(b) (c) Figure 18 Structure for direct localizers.","paragraphs":["TYPE_LOC_ZONE AUTONOMOUS no"]},{"title":"I chronological ZONE E yes hNCLUD1NG TIME implicit E explicit nominalised occurrential","paragraphs":["NOMINAL"]},{"title":"not nominalized Figure 19 Grammar section for direct adverbials. implicit, implying the non-existence of Reference Zone, is selected in the system INCLUDING TIME if the semantic form is a single triplet [ti Type, Naming]. There is yet another system that decides if there is a Pointer or not, but as the problem of the existence of the Pointer is not completely solved and not really important to our discussion, we do not consider this system here. 120","paragraphs":["Gagnon and Lapalme From Conceptual Time to Linguistic Time Table 8 List of durative adverbials.","Adverbial AUTONOMOUS INCLUDING ZONE TIME aujourd'hui (today) no hier (yesterday) no demain (tomorrow) no ce mois-ci (this month) no ce mois-l& (that month) no le mois suivant (the following month) no en avril (in April) yes mercredi de cette semaine (Wednesday of this week) yes cette semaine (this week) no la premi6re demi-heure de l'6mission yes (the first half-hour of the program) le matin du 3 avril 1995 (the morning of April 3rd 1995) yes le 3 avril 1995 yes avril 1995 yes 1995 yes implicit explicit explicit explicit explicit explicit implicit","In Table 8, we present the features selected for direct chronological adverbials, embedded or not. The systems in Figure 19 do not suffice to distinguish all direct adverbials. The selections in these systems must be combined with the selections made in the systems of Figure 10. 5.4 Related Work on the Generation of ATLs The problem of temporal localization has already been studied by many researchers, but most of them have focused on the aspectual interaction of the adverbials with verb tense; the problem of the semantic and syntactic structures of ATLs has been neglected. Molin6s' (1990) study from a linguistic perspective characterizes the adverbials based on noun phrases. Our work extends hers because our computational perspective has made us go farther in the formalization. Bras and Molin6s (1993) made a similar attempt, but from the perspective of discourse understanding. Since the problems of understanding are very different from the problems of generation, we could not simply use their method in a \"reversed mode.\" Their method relies on a compositional analysis of the language, where all information units extracted from the semantic structure are combined to select one meaning for the adverbial. This compositional approach is not easily reversible, and it does not provide any insight into the selection problem inherent to the generation task. Ehrich (1987) classifies adverbials in the context of generation, but she does not cover all the cases presented in this section.","Concerning the problem of the generation of ATLs, Maybury (1991) shows how the notion of focus as used by McKeown (1985) can be extended to include a temporal focus that corresponds essentially to the reference point in the Reichenbach model (1947). An operation on the temporal focus, in combination with the value of speech and event times, selects the temporal adverbial and the verb tense. Since the emphasis in this work was on the planning aspect of the task, the variety of adverbials that can be generated is limited.","Forster (1989) explains how the syntactic structure of a temporal adverbial may be controlled by semantic information such as the durative or punctual nature of the localizer. Essential134 the final structure is obtained by propagating constraints associated with each syntactic subpart of the structure. In particular, he focuses on the interaction between prepositional phrases and noun phrases. For example, the preposition on is 121 Computational Linguistics Volume 22, Number 1 selected in"]},{"title":"on Sunday","paragraphs":["because"]},{"title":"Sunday","paragraphs":["is identified as a punctual localizer; this rules out"]},{"title":"in,","paragraphs":["which implies a durative localizer. We have already presented one problem with this approach: it is not clear how the choice of these prepositions can be achieved by propagating semantic constraints. The choice of preposition in French is very different from English and it often appears to be arbitrary or conventional. Furthermore, many aspects of the problem are neglected, such as the type of reference expressed by the adverbial: it is not clear how Forster's system can represent the distinctions between anaphoric, deictic and autonomous localizers because the link between the semantic and syntactic levels is not fully explained.","Nigel (Matthiessen and Bateman 1991) offers the widest coverage of English but the variety of forms for ATLs is quite limited. The temporal localization that may be expressed by different types of syntactic structures is represented in Nigel by systems dispersed throughout the whole grammar network. For the expression of temporal localizers, their grammar is more dependent on the syntactic structure than ours, which is mainly determined by the semantics.","To summarize, our approach departs from previous approaches by covering more types of adverbials, by proposing a semantics for localization, and by explaining in detail how the different syntactic structures may be obtained from this semantics. 6. The Production of Verb Phrases In our work, we have focused on the generation of adverbials because we felt this problem had not received enough attention and because the temporal localization achieved by ATLs is more complex and more diversified than that expressed by verb tenses. To generate a discourse like Discourse 1, however, we cannot avoid the problem of determining the structure of the verb phrase, because part of the localization is achieved by the verb, and because of the relations between verbs and adverbials.","In our implemention of the expression of temporal localization, the relation between the verb and the adverbial is taken into account mainly in the deep generation process. In the semantic representation, we find traces of this interaction. By keeping these decisions in the deep generation process, the verb phrase and the ATL can be generated independently.","Our method for generating the verb phrase takes advantage of the kind of information directly represented in DRT: the relation of the occurrence to speech time, which we call the primary localization, the aspect of the occurrence, and the presence or absence of a perspective point. It is implemented by the grammar section illustrated in Figure 19. In Prdtexte, the production of verb phrases requires many traversals of the network. First, when the structure of the sentence is determined, choices are made regarding localization, aspect, and perspective. After a first traversal of the network, the sentence's structure contains a function called Predicate, realized as a verb phrase. The grammar must be re-entered to realize the Predicate. The systems visited during this second traversal (not shown here) classify verb tenses in French. Most of the selections during this second traversal were preselected during the first traversal. For each verb tense, there is one associated structure, which contains a main verb and one or two auxiliaries. To generate each verb or auxiliary, another traversal is needed.","In the first system of Figure 19, PRIMARY LOC, the selection depends on the temporal relation between the localized occurrence and the speech time. The features of the systems ASPECT and SIT TYPE reflect the value of aspect in the semantic representation. If the aspect is"]},{"title":"event,","paragraphs":["the system PERSPECTIVE determines if this event is presented using a perspective. If there is one, another choice must be made regarding its type. 122 Gagnon and Lapalme From Conceptual Time to Linguistic Time ,---- past /I'~YL~ ~ present situation ASI~CT event ~RS~CTIVE E resultirlg open"]},{"title":"I. Figure 20 Generation of verb phrase--sentence level.","paragraphs":["perspective no perspective PERSPECTIVfi a n teri ority TYPE posteriority Table 9 Production of VP--examples.","Selections during first traversal Tense selected during Example second traversal past - situation - resulting past - situation - open past - event - perspective - anteriority past event perspective posteriority past - event - no perspective plus-que-parfait pass4 ant6rieur imparfait imparfait conditionnel plus-que-parfait pass6 compos6 A 8h00, il avait terrain4. (At 8:00, he had finished.) Une fois qu'il eut termin4 (Once he had finished) A 8h00, Robert regardait la t616vision. (At 8:00, Robert was watching television.) J'ai rencontr4 Robert jeudi dernier. I1 partait le lendemain. (I met Robert last Thursday. He was going to leave the day after.) J'ai rencontr6 Robert jeudi dernier. I1 m'a dit qu'il partirait le lendemain. (I met Robert last Thursday. He told me that he would leave the next day.) J'ai rencontr6 Robert jeudi dernier. I1 4tait arriv4 la veille. (I met Robert last Thursday. He had arrived the day before.) Robert a parl4 ~ Marie. (Robert talked to Marie).","Table 9 shows examples of verb phrases, including the list of features selected for each example during the two traversals. The same tense can be used for different feature patterns. This is the case with the"]},{"title":"imparfait and the plus-que-parfait: the imparfait expresses an open situation or an anterior perspective, while the plus-que-parfait presents a resulting situation or a posterior perspective. This may be a problem in an understanding process, since it is a source of ambiguity, but not in a generation process since it does not matter if two different inputs map into the same syntactic structure. More than one verb tense may be used for the same features. This means that our grammar is not complete: more systems would be needed to distinguish among these different cases. For example, to distinguish the two tenses used with the first feature pattern of Table 9, we would have to augment the grammar section of Figure 19","paragraphs":["123 Computational Linguistics Volume 22, Number 1 to determine if the verb phrase is part of a temporal adverbial or not. For the two cases in the third feature pattern, the difference relates to the use of indirect discourse. Here, not only would the grammar have to be modified, but so would the semantic representation, to take into account indirect speech. In Discourse 1, this problem is not apparent: all verb tenses used are distinguished in our grammar because we limited ourselves to a subset of the data.","Thus, the production of VP is more complex than what we have implemented and we have not completely identified all the rules for the selection of verb tense: indirect discourse is not implemented and we have not identified how modal information can be used to select forms such as the subjunctive and the conditional. But our approach is a good start and it could be extended by adding more systems and their selection rules, without changing the overall structure of the network.","We can see from the approximate translations given in Table 9 that the systems for generating French and English verb tenses differ greatly. For English verb tenses, the method implemented in Nigel resorts to a recursive semantics involving temporal markers, as proposed by Halliday (Matthiessen and Bateman 1991). The purpose in this approach is to deal correctly with complex structures, such as will have been eating. Put simply, the idea is that each auxiliary reflects a relation between two temporal markers. This suggests a network that displays a recursive process. Thus, the phrase will have been going to eat would be represented semantically as to eat at a time that is in the future relative to another time that is in the past relative to a time that is in the future relative to speech time.","This method may be adequate for English, since it seems to capture the recursive structure of verb tenses; but in French, this recursive structure is not found. Furthermore, nothing is said about how a deep generation process could produce the corresponding semantic structure with the intermediate temporal markers. In fact, we are not convinced that this could be easily done. Rather, we think that it is the overall structure that is selected for a particular usage.","This completes our brief description of the generation of verb tenses. We have not completely solved the problem. In particular, we have chosen to put most of the problems pertaining to verb tense in the deep generation process, in order to facilitate their generation at the surface level. This approach greatly simplifies the process and our grammar could be easily completed to encompass all cases. Once the semantic demands are better understood, it should be easier to solve the problem of deep generation. 7. Conclusion and Future Work In this paper, we have presented a method that has been successfully used to produce text conveying temporal information. Our method combines the principles of two theories: Kamp's Discourse Representation Theory, which guides the expression of temporal information, and Halliday's Systemic Functional Grammar, which provides a generation process controlled by a set of semantic choices, with the syntactic form resulting from these choices. We argued for the use of a conceptual structure, a Discourse Representation Structure, combined with rhetorical principles and pragmatic information, and for its translation into a semantic structure that is easily realized syntactically. The deep generation process is hard to implement, mainly because of the difficulty in formalizing this information. Since we assume that the deep generation 124 Gagnon and Lapalme From Conceptual Time to Linguistic Time Relations and Commonsense Entailment. Linguistics and Philosophy, 16: 437-493.","Mann, W. (1983). \"An Overview of the Nigel Generation Grammar.\" Technical report ISI-RR-83-113, USC/ISI.","Mann, W. (1985). An Introduction to the Nigel Text Generation System. In Systemic Perspective on Discourse, vol. 1, edited by James D. Benson and William S. Greaves. Ablex, Norwood, 84-95.","Mann, W., and Thompson, S. (1987). \"Rhetorical Structure Theory: Description and Construction of Text Structure.\" In Natural Language Generation, edited by Gerard Kempen. Martinus Nijhoff, Dordrecht, 85-95.","Mann, W. C. (1991). Discourse Structures for Text Generation. In Proceedings, lOth International Conference on Computational Linguistics, Standford.","Matthiessen, C. (1985). The Systemic Framework in Text Generation: Nigel. In Systemic Perspective on Discourse, vol. 1, edited by James D. Benson and William S. Greaves. Ablex, Norwood, 96-118.","Matthiessen, C., and Bateman, J. (1991). Text Generation and Systemic-Functional Linguistics. Pinter, London.","Maybury, Mark T. (1991). Topical, Temporal, and Spatial Constraints on Linguistic Realization. Computational intelligence, 7(4): 266-275.","McKeown, Kathleen R. (1985). Discourse Strategies for Generating Natural Language Text. Artificial Intelligence, 27(1): 1-41.","Molin~s, E (1990). Acceptabilitdet interprdtation des adverbiaux de localisation temporelle. M4moire de D.E.A., Universit4 de Toulouse--Le Mirail.","Reichenbach, H. (1947). Elements of Symbolic Logic. McMillan, New York.","Verkuyl, H. J. (1989). Aspectual Classes and Aspectual Composition. Linguistics and Philosophy, 12: 39-94.","Vlach, Frank. (1993). Temporal Adverbials, Tenses and the Perfect. Linguistics and Philosophy, 16: 231-283.","Winograd, T. (1983). Language as a Cognitive Process. Addison Wesley. 127"]}]}