{"sections":[{"title":"","paragraphs":["Computational Linguistics Volume 22, Number 3"]},{"title":"Speakers, Listeners, and Communication: Explorations in Discourse Analysis Gillian Brown","paragraphs":["(University of Cambridge) Cambridge University Press, 1995, xiii+251 pp; hardbound, ISBN 0-521-48157-0, $54.95"]},{"title":"Reviewed by Susan McRoy University of Wisconsin-Milwaukee","paragraphs":["Gillian Brown's book presents a careful argument for viewing the interpretation of referring expressions and definite expressions by listeners as a"]},{"title":"satisficing","paragraphs":["process. That is, listeners attempt to find an interpretation that is adequate for their present purposes, rather than one that is correct with respect to what the speaker might have intended. The author supports her claim with examples taken from a series of carefully controlled experiments that she and her colleagues have conducted over the last 14 years."]},{"title":"1. Assumptions","paragraphs":["The author's approach assumes the basic premise of discourse analysis, which is that one can consider the range of behaviors produced by speakers and listeners in nearnormal situations, without quantifying the frequency or distribution of the behavior. An inherent difficulty of this approach for the reader is that we only get to see a small subset of the examples that the experimenter has collected and our view is controlled by the opinions of an analyst, who typically was not a participant to the conversation and who might not even have been present at the time. Sociolinguists start with a similar premise, but try to avoid the problem by attempting to analyze the examples on the basis of the form of the interaction, independent of its content; however, in its pure form, this approach prevents sociolinguists from saying anything about"]},{"title":"how","paragraphs":["people construct an interpretation. What the author and her colleagues have done to avoid the problem of analyzer bias is to forgo the use of naturally occurring dialogues, and instead to develop experiments that allow them to control the content of the interaction, without interfering with its form. The idea is that by controlling the content of the interaction, the analyst will have direct knowledge of what each speaker might know about the task (except in the case of inattention or non-understanding) and of the range of possible denotations of the expressions that a speaker might use.","Although this idea might be unique within the author's own research community, it has been well-accepted in computational linguistics since its use by Grosz and her colleagues in the well-known analysis of water-pump assembly dialogues (Grosz 1981), and more recently by the Rochester TRAINS project (Allen et al. 1995). Also, in psychology, Brennan (1990) performed an on-line computer study of grounding, using a similar map task, measuring the distance from the listener's cursor to the goal icon over the course of the dialogue. That is not to say that Brown's work is not highly regarded among discourse analysts. She is actually somewhat of an authority in the area, having recently released a second edition of her book"]},{"title":"Listening to Spoken Language","paragraphs":["444 Book Reviews (1990). She is also co-author of"]},{"title":"Discourse Analysis","paragraphs":["(1983) (with George Yule).","The present book focuses on the problem of how listeners interpret expressions that might be used to refer to or to introduce a new object in the context. The author considers two tasks, \"the map task\" and \"the stolen letter task.\" Both require participants to describe or refer to objects, types, or spatial locations; the second task also involves references to time and functional roles. 2. The Design of the Experiments In the map task, speaker A must describe a route to speaker B, who must identify the route on his copy of a map. The difficulty of the task is manipulated by controlling the complexity of the route and also by varying the degree to which the two speakers' maps agree. That is, B's map might be missing some features that are shown on A's map, or conversely might show features than A's map lacks. When the maps differ, miscommunication becomes possible (and likely). An interesting characteristic of this task is that the goals of the two participants are quite different: speaker B is ultimately responsible for the completion of the task, while speaker A is only there to help by giving instructions or answering questions. Thus, A is somewhat less motivated than B to make sure that she has been understood.","In the stolen letter task, the participants view different segments of a videotape and must narrate to each other the events that they have each witnessed, in order to reconstruct the temporal order of the segments. The difficulty of the task is manipulated by controlling the physical similarity of the actors in the video and whether or not the participants are told that the video depicts a theft. When the actors are similar, speakers are forced to use temporal descriptions such as"]},{"title":"the first girl","paragraphs":["or functional ones such as"]},{"title":"the girl talking on the phone,","paragraphs":["making it more difficult for participants to determine how many actors were in the whole video or when two descriptions denote the same person. When the participants know that the video depicts a theft, the task is somewhat easier, because they can use expressions such as"]},{"title":"the thief","paragraphs":["or"]},{"title":"the victim.","paragraphs":["In contrast with the map task, responsibility for completion of the stolen letter task rests with all participants, so presumably they are equally motivated to design their utterances to facilitate interpretation. Both tasks provide participants with a common starting point (a location marked start on the map; the opening scene of the video, which the participants view together). After this common starting point, the experiences of participants in both tasks then diverge (participants might have different maps; participants must watch subsequent scenes of the video separately). 3. The Organization of the Book To motivate Brown's analysis, the book begins with a summary of arguments against the notion of a context-independent semantics (either of words or of sentences) and against the conduit metaphor of communication. Then, having disposed of the notion of there even being a single correct interpretation of an utterance, Brown argues that it is more reasonable to assume that listeners look for an interpretation that is to their own needs, and then attribute to the speaker an intention to convey this interpretation. The discussion here is primarily philosophical rather than technical. It seems aimed primarily at social scientists, citing relevant works from linguistics, philosophy, social anthropology, and literary theory.","The next three chapters introduce the design of the map task, the notion of reference, and a discussion of the interpretation of referring expressions, constitutive expressions, and deixis. To illustrate these concepts, Brown presents selected exam-445 Computational Linguistics Volume 22, Number 3 ples from her experimental data. A key point of her analysis is that the classification and interpretation of an expression must be understood from the listener's perspective. When a feature is present on both participants' maps, the listener will treat the expression as referential. When a feature is not, the listener instead might use the expression to identify the type of the missing object and then add an entity of that type to his own map. Deictics come into play, because the process of scanning the map provides a movable focus of attention for both participants. Also, the current endpoint of the route that speaker B is drawing provides an index into the spatial context that helps define a search field for interpretation.","Chapters 5 and 6 introduce the stolen letter task and a discussion of the difficulties that participants must confront in creating referring expressions and establishing referential identity when part of their knowledge is a product of visual experience (giving them direct access to the sense of an expression) while other parts of their knowledge must be inferred from verbal description. In such situations, a listener needs both to interpret referential or deictic expressions and also to relate the interpretation to his own memory of what he observed.","The final chapter discusses the role of listeners. A key point here is that participants understand more quickly and accurately than passive observers of a conversation. This point has been demonstrated by Schober and Clark (1989), who attribute it to three factors: First, participants provide each other with feedback about what they have been able to understand; second, participants use the interpretations that they form in the generation of subsequent utterances, and hence the pace of the interaction is geared toward their needs; and third, participants can negotiate a shared perspective on the information that they are discussing. Brown supports this argument with examples from her own data, illustrating how participants in each of the two tasks make use of these resources. She also includes a brief discussion of the issues of the degree to which participants appear to establish common ground or mutual beliefs and the degree to which listeners appear to attribute intentions to speakers. Her answer to both questions seems to be \"not much,\" as she found only limited indications of these activities in the data that she has analyzed. In particular, participants did not appear to use the infinitely recursive sort of beliefs that have worried theorists, and listeners appeared to attribute to speakers only those intentions that they would attribute to themselves if they were to have said the same thing.","The book closes with an epilogue that summarizes the author's conclusions about her data, and restates her thesis that meaning is determined by participants at the time that they are conversing and hence any post-hoc analysis of \"uncontrolled\" communication is a questionable activity at best. 4. Evaluation Brown's book should be of interest to many computational linguists, especially those whose work is in topics related to anaphora, referring expressions, discourse structure, or speech understanding. In particular, it will interest those whose research is in the area of preventing or repairing miscommunication, a topic of current interest in the field. Brown's experimental tasks provide a straightforward method for reliably generating examples of how people address this issue. (Readers might also want to look at the data themselves--some of it has been made available on CD-ROM through the Human Communication Research Centre, University of Edinburgh, and the Linguistic Data Consortium, University of Pennsylvania.) Language researchers considering alternatives for experimental design will also find the book useful. 446 Book Reviews","To its credit, the book is clearly written and well organized. In particular, the discussion of the design and motivation for the two tasks is clear and thought-provoking. The only complaints that one might have are that the spans of dialogue from the data are relatively short, while the author's description of them is at times quite lengthy. But the book is quite enjoyable, once one gets used to Brown's Gilbert-and-Sullivan-like approach: she first tells us the main point at some depth, then presents the example itself, carefully going through the dialogue a line at a time to illustrate her points, and afterward, summarizes the main points again, often using a table to facilitate the discussion. Readers who do not wish to reprise their experience, or who wish to consider the data by themselves, might want to skim or skip some parts of the discussion, and can safely do so.","References","Allen, James F., Lenhart K. Schubert, George Ferguson, Peter Heeman, Chung Hee Hwang, Tsuneaki Kato, Marc Light, Nathaniel Martin, Bradford Miller, Massimo Poesio, and David Traum. 1995. The TRAINS project: A case study in building a conversational planning agent. Journal of Experimental and Theoretical Artificial Intelligence, 7(1): 7-48.","Brennan, Susan E. 1990. Seeking and Providing Evidence for Mutual Understanding. Ph.D. thesis, Department of Psychology, Stanford University, Stanford, CA.","Brown, Gillian. 1990. Listening to Spoken English (second edition). Longman, London.","Brown, Gillian and George Yule. 1983. Discourse Analysis. Cambridge University Press.","Grosz, Barbara. 1981. \"Focusing and description in natural language dialogues.\" In Aravind Joshi, Bonnie Webber, and Ivan Sag, editors, Elements of Discourse Understanding, Cambridge University Press.","Schober, Michael E and Herbert H. Clark. 1989. Understanding by addressees and overhearers. Cognitive Psychology, 21:211-232. Susan McRoy is Assistant Professor in Computer Science at the University of Wisconsin-Milwaukee and Associate Director of the UWM Decision Systems and Artificial Intelligence Laboratory. McRoy wrote her Ph.D. thesis at the University of Toronto on Abductive Interpretation and Reinterpretation of Natural Language Utterances (1993). McRoy's address is: Department of Electrical Engineering and Computer Science, University of Wisconsin-Milwaukee, P.O. Box 784, Milwaukee, WI 53201; e-mail: mcroy@blatz.cs.uwm.edu 447"]}]}