{"sections":[{"title":"Title Index","paragraphs":["Volume 22 Algorithm to Align Words for Historical Comparison, An Covington, Michael A. 22:(4): 481-496 DATR: A Language for Lexical Knowledge Representation Evans, Roger and Gazdar, Gerald 22(2): 167-216 Effects of Lexical Specialization on the Growth Curve of the Vocabulary, The Baayen, R. Harald 22(4): 455-480 Efficient Multilingual Phoneme-to-Grapheme Conversion Based on HMM Rentzepopoulos, Panagiotis A. and Kokkinakis, George K. 22(3): 351-376 Error-tolerant Finite-state Recognition with Applications to Morphological Analysis and Spelling Correction Oflazer, Kemal 22(1): 73-89 Estimating Lexical Priors for Low-Frequency Morp hologicaUy Ambiguous Forms Baayen, R. Harald and Sproat, Richard 22(2): 155-166 From Conceptual Time to Linguistic Time Gagnon, Michel and Lapalme, Guy 22(1): 91-127 Improving Statistical Language Model Performance with Automatically Generated Word Hierarchies McMahon, John G. and Smith, Francis J. 22(2): 217-247 Learning Bias and Phonological-Rule Induction Gildea, Daniel and Jurafsky, Daniel 22(4): 497-530 Machine Learning Comprehension Grammars for Ten Languages Suppes, Patrick, BOttner, Michael, and Liang, Lin 22(3): 329-350 Maximum Entropy Approach to Natural Language Processing, A Berger, Adam L., Della Pietra, Stephen A., and Della Pietra, Vincent J. 22(1): 39-71 Statistically Emergent Approach for Language Processing: Application to Modeling Context Effects in Ambiguous Chinese Word Boundary Perception, A Gan, Kok-Wee, Palmer, Martha, and Lua, Kim-Teng 22(4): 531-553 Stochastic Finite-State Word-Segmentation Algorithm for Chinese, A Sproat, Richard W., Shih, Chilin, Gale, William, and Chang, Nancy 22(3): 377-404 Translating Collocations for Bilingual Lexicons: A Statistical Approach Smadja, Frank, McKeown, Kathleen R., and Hatzivassiloglou, Vasileios 22(1): 1-38 Unification Encodings of Grammatical Notations Pulman, Stephen G. 22(3): 295-327 Squibs and Discussions Ambiguity-preserving Generation with LFG- and PATR-style Grammars Wedekind, Jfirgen and Kaplan, Ronald M. 22(4): 555-558 Assessing Agreement on Classification Tasks: The Kappa Statistic Carletta, Jean 22(2): 249-254 Chart Re-estimation Algorithm for a Probabilistic Recursive Transition Network, A Han, Young S., and Choi, Key-Sun 22(3): 421-429 Integrating General-purpose and Corpus-based Verb Classification Basili, Roberto, Pazienza, Maria Teresa, and Velardi, Paola 22(4): 559-568 Limited Attention and Discourse Structure Walker, Marilyn A. 22(2): 255-264 Sethood and Situations Forster, T. E., and Rood, C.M. 22(3): 405-408 Toward a Synthesis of Two Accounts of Discourse Structure Moser, Megan, and Moore, Johanna D. 22(3): 409-419 Book Reviews Analogical Natural Language Processing 22(4): 572-574 by Daniel Jones Reviewed by Jean-Pierre Corriveau Connectionist Language Generator, A","22(3): 441-443 by Nigel Ward Reviewed by George Berg Computational Linguistics Volume 22, Number 4 Deixis in Narrative: A Cognitive Science Perspective 22(3): 448-449 edited by Judith F. Duchan, Gall A. Bruder, and Lynne E. Hewitt Reviewed by Anita Cremers Electric Words: Dictionaries, Computers, and Meanings 22(3): 435-440 by Yorick A. Wilks, Brian M. Slator, and Louise M. Guthrie Reviewed by Archibald Michiels Generative Lexicon, The 22(4): 575-576 by James Pustejovsky Reviewed by J. Terry Nutter German in Head-driven Phrase Structure Grammar 22(1): 129-136 by John Nerbonne, Klaus Netter, and Carl Pollard Reviewed by Jean-Pierre Koenig Head-driven Phrase Structure Grammar 22(1): 129-136 by Carl Pollard and Ivan Sag Reviewed by Jean-Pierre Koenig Intelligent Language Tutors: Theory Shaping Technology 22(4): 569-571 edited by V. Melissa Holland, Jonathan D. Kaplan, and Michelle R. Sams Reviewed by Chris Bowerman Japanese Sentence Processing 22(1): 145-147 edited by Reiko Mazuka and Noriko Nagai Reviewed by Patrick Sturt Logic and Lexicon 22(1): 140-144 by Manfred Pinkal Reviewed by Massimo Poesio Machine Translation and the Lexicon 22(2): 271-273 edited by Petra Steffens Reviewed by Inderjeet Mani Natural Language Processing for Prolog Programmers 22(1): 137-139 by Michael A. Covington Reviewed by Ken Barker and Stan Szpakowicz Representing Time in Natural Language: The Dynamic Interpretation of Tense and Aspect 22(2):274-276 by Alice G. B. ter Meulen Reviewed by Rebecca J. Passonneau Speakers, Listeners, and Communication: Explorations in Discourse Analysis 22(3): 444--447 by Gillian Brown Reviewed by Susan McRoy Spoken Natural Language Dialogue Systems: A Practical Approach 22(3): 430-434 by Ronnie W. Smith and D. Richard Hipp Reviewed by David R. Traum Time-constrained Memory: A Reader-based Approach to Text Comprehension 22(2): 265-266 by Jean-Pierre Corriveau Reviewed by Arthur C. Graesser Trajectories Through Knowledge Space: A Dynamic Framework for Machine Comprehension 22(1):148-152 by Lawrence A. Bookman Reviewed by Jean-Pierre Corriveau Trouble with Computers: Usefulness, Usability, and Productivity, The","22(2): 267-270 by Thomas K. Landauer Reviewed by Harold Thimbleby 584"]}]}