{"sections":[{"title":"","paragraphs":["Computational Linguistics Volume 22, Number 4"]},{"title":"Analogical Natural Language Processing Daniel Jones","paragraphs":["(UMIST) London: UCL Press (Studies in Computational Linguistics, edited by Harold Somers), 1996, xii+155 pp; hardbound, ISBN 1-85728-218-3, £30.00"]},{"title":"Reviewed by Jean-Pierre Corriveau Carleton University","paragraphs":["The use of examples as the basis for machine translation systems has gained considerable acceptance since the original proposal of Nagao in 1984. In this short book, Jones first reviews the fundamental principles of example-based machine translation (EBMT) in order to then introduce the specific mechanisms of his model. The key characteristic of this model is its purely stochastic processing, which is based on the algorithm put forth by Skousen (1989) in his Analogical Modeling strategy for language comprehension.","Overall, the book is well-written and offers a good introduction to some of the very interesting problems of machine translation. But my reading left me somewhat unsatisfied. In order to explain this, let me first summarize the chapters.","The goals and method of the work are clearly stated in the nine pages that form the introduction: Jones intends to demonstrate the possibility of uniformly using examples"]},{"title":"rather than","paragraphs":["rules for machine translation. I emphasize that, in this context, \"the term 'analogy' refers to the general process of deriving information about some new piece of language by comparison with known piece(s) of language\" (p. 4). Also, it is important to understand that \"the rejection of rule-based natural language processing does not mean that linguistic representations cannot be used\" (p. 5). Indeed, Jones subscribes to a non-inferential heavily-predicated representational strategy based on Functional Grammar. Within this framework, \"source language predications and their target language equivalents are stored as instantiated examples of translation, the source half of which attempt to clone themselves onto the source language input .... The translations are achieved by generating the target language half of the best matching example into a surface realization .... Where only partial cloning is being achieved across a set of examples, the process of recombination can be used to recombine elements of example predications based on the results of the analogical modelling\" (p. 6).","The second chapter provides some additional background material on EBMT, as well as a partial survey of relevant research. Depth is typically privileged over breadth. For example, Functional Grammar seems to reduce exclusively to the work of Dik (1978) and van der Korst (1989), with the consequence that some details are mentioned but not explained, or discussed at length and then never revisited in the rest of the book.","Chapter 3 then overviews the proposed model, and more specifically, the representations it uses. Very quickly the reader discovers complex hand-coded frames littered with the primitives of Functional Grammar, as well as somewhat artificial examples from a narrow domain. Thus, the usual criticism against complex innate (nay, ad hoc) data structures soon comes to mind. Jones does motivate the use of Functional Grammar for machine translation and raises lots of interesting questions for MT. But 572 Book Reviews he fails to address convincingly the problem of having to specify these frames and of having to associate them to their translations. Furthermore, generation is taken to be a relatively straightforward process once the appropriate translation has been processed, and thus is not discussed in the book. Finally, the importance of contextual representation, and in particular of rhetorical information, is stressed throughout the chapter. But Jones forewarns us in the introduction that rhetorical information is not yet part of the implementation. Indeed, the rest of the book does not make clear how much of the contextual processing has been implemented and tested, though, as he insists, it is crucial to measure distance between input and pre-coded examples.","Instead, in the fourth chapter, Jones details the probabilistic mechanism that underlies the cloning process. More specifically, Jones explains how the processing scheme of Analogical Modeling can be reused to stochastically assign case information to inputs (in order to subsequently match them against prepared examples). A very interesting comparison with the PDP work of McClelland and Kawamoto (1986) on this topic follows (and continues in section 5.2). But the author fails to elaborate on the choice of variables (and associated values) for his model.","Finally, chapter 5 presents the experiments carried out by Jones. These experiments do not address machine translation per se, but rather focus on specific problems such as determining sentential constituent structure by employing a simple frame-driven heuristic algorithm. The reader must soon conclude that the proposed approach is computationally very expensive and most likely does not scale up. The ad hoc-ness of some of the facets of the model also inevitably emerges from the long descriptions of these experiments. For example, for predicting lexical category, a span of only three words is used.","In the end, the very short conclusions of chapter 6 only confirmed some of my hesitations vis-a-vis the work. Beyond scalability, innateness, and ad hoc-ness issues, beyond the disadvantages of predication, the book did not convince me that the proposed model was interesting from a practical viewpoint. This is due in part to the following concerns: . . . . a rather narrow bibliography that leaves out too much of the existing research on Functional Grammar and on lexical statistics. (Consequently, I doubt that the work has any appeal as a textbook even for an advanced graduate course.) the disclaimer about suprasentential contextual descriptions not being part of the current implementation. a lack of detailed comparisons with other (example-based and non-example-based) strategies for MT. the absence of a comprehensive example that addresses the multitude of problems raised by Jones for MT.","References","Dik, Simon. 1978. Functional Grammar. North Holland, Amsterdam.","McClelland, James L. and Alan H. Kawamoto. 1986. Mechanisms of sentence processing: Assigning roles to constituents. In James L. McClelland, David E. Rumelhart, and the PDP Research Group, editors, Parallel Distributed Processing: Explorations in the Microstructure of Cognition. The MIT Press, volume 2, pages 272-325.","Nagao, Makoto. 1984. A framework of a mechanical translation between Japanese 573 Computational Linguistics Volume 22, Number 4 and English by analogy principle. In A. Elithorn and R. Banerji, editors, ArtiJ~'cial and Human Intelligence. North Holland, Amsterdam, pages 173-180.","Skousen, Royal. 1989. Analogical Modeling of Language. Kluwer, Dordrecht.","Van der Korst, B. 1989. Functional grammar and machine translation. In John H. Connolly and Simon Dik, editors, Functional Grammar and the Computer. Foris, Dordrecht. Jean-Pierre Corriveau has research interests in cognitive modeling and object-oriented technology. He is the author of Time-Constrained Memory (Lawrence Erlbaum Associates, 1995). Corriveau's address is: School of Computer Science, Carleton University, Colonel By Drive, Ottawa KIS 5B6, Canada; e-mail: jeanpier@scs.carleton.ca 574"]}]}