{"sections":[{"title":"Multimodal and Adaptative Pedagogical Resources Jean-Claude Martin* , Jean-Hugues Réty , Nelly Bensimon ","paragraphs":["* LIMSI-CNRS, BP 133, 91403 Orsay, FRANCE martin@limsi.fr","LINC - IUT de Montreuil (Université Paris 8), 140 rue de la Nouvelle France, 93100 Montreuil, France {jh.rety, n.bensimon}@iut.univ-paris8.fr","Abstract When interacting with students, teachers usually combine several communication modalities (speech, hand gestures, gaze, posture, facial expression, graphics on a blackboard, slides...) and have to adapt their communication to the lecture settings (computer knowledge of the students, duration of the lecture...). Although educational resources and intelligent tutoring systems are developing, they are seldom being used as language resources per se, nor based on real-world pedagogical recording. Even in the field of pedagogical agents where a graphical persona is used as a complementary means of communication, the multimodal and adaptative behaviour of the graphical agent is often based on general knowledge about communication studies rather than on the annotation of pedagogical behaviour observed in video corpora. In this paper, we describe how an educational video corpus is being collected and how it is planned to be used for improving the existing on-line tutorial with multimodal and adaptative hypermedia features. "]},{"title":"1. Introduction","paragraphs":["When interacting with students, teachers usually combine several communication modalities such as speech, gestures, graphics and might adapt both their communication and its content to the level of understanding of the students or the duration of the lecture.","Although educational resources1","and intelligent tutoring system are developing, they are seldom being used as language resources per se, or based on real-world pedagogical recording (ITS 2000). Apart from (Feyereisen, 1997; Baldry, 2000; Tajariol, 2001), we have not found any references on the recording of lectures for communication studies for the development of pedagogical resources or computer aided learning tools. Furthermore, experimental evaluation of e-learning technologies is still a challenge.","Even in the recent field of pedagogical agents where a graphical persona is used as a complementary means of communication (Graesser et al., 2000 ; Lester et al., 2000), the multimodal and adaptative behaviour of the graphical agent is often based on general knowledge coming out from communication studies rather than on the annotation of pedagogical behaviour observed in video corpora."]},{"title":"2. The MICAME project","paragraphs":["In this paper, we describe the MICAME project2",". The pedagogical resources currently available at the Montreuil Institute of Technology contain only static elements such as html web pages or downloadable lectures notes3"," (Figure 1).  1 http://www.xml.org/xml/, XML Registry, Education 2 Modeling Informatics Cooperation Adaptation and Multimodality in Education. The MICAME project is being funded by Paris 8 BQR contracts. It makes use of multimodal technology developped at LIMSI-CNRS.  3 http://www.iut.univparis8.fr/~martin/enseignement/java/","Yet, students come from very heterogeneous places regarding technological, but also cultural and linguistic level.","Teachers have to give the same lecture in different settings regarding students computer knowledge, lecture duration, size of the room.","The MICAME project aims at enhancing the on-line static tutorials with multimodal, multimedia, cooperative and adaptative features observed in video-taped lectures or student working sessions.","  Figure 1: Screendump of the static lecture notes currently available (communication is mostly textual and graphical without any multimodal nor adaptative","features)"]},{"title":"3. A corpus of multimodal and adaptative pedagogical behavior","paragraphs":["“Natural” pedagogical behavior including multimodality, cooperativity and adaptation can be observed in several settings.","Two different types of corpora are currently being collected at the Montreuil Technology Institute.","The first type is a lecture where the teacher is interacting with students using drawing and writing on whiteboard besides using speech, gesture, gaze... (Figure 2). This corpus also includes files used as slides displayed on the wall during the lecture.","The second type is a presentation performed by students (Figure 3). In such a presentation, one or two students provide explanations about a drawing they made on a blackboard.","We have started to record both types of sessions. The files have been recorded using a Mini-DV Digital Video camera and converted into .avi files.","","  Figure 2: video still from a lecture.    Figure 3: video still from a student presentation."]},{"title":"4. Observations","paragraphs":["The recording of such pedagogical corpus raises some specific issues: • Writing and drawing on the whiteboard / blackboard may not visible depending on lightning conditions.","• During a lecture the teacher may get closer to students when answering some questions and thus may not be visible on the video.","• It can be useful to record students behavior (at least speech) in order to understand the adaptative behavior of the teacher.","• Annotations of spatial relations are required (between drawings on the blackboard, between gestures and drawings...).","• Both the communicative and the non-communicative actions of the teachers have to be annotated (i.e. Erasing part of the whiteboard...).","• During a lecture, teachers make use of “real world objects” such as pen, markers, book, paper notes, tables.","• Teachers gesture towards different targets such as whiteboard, paper notes. They may use objects such as marker when producing iconic gestures.","• The teacher might provide more details on the whiteboard, might go back and forth in the slides.  Some videos have been inserted in the on-line tutorial","(Figure 4). "," Figure 4: the on-line tutorials augmented with videos. "]},{"title":"5. Future work","paragraphs":["In the future we intend to video-tape other lectures and working sessions between students. Other types of settings such as the two described above might be recorded (a group of student communicating during a project meeting).","We will adapt our TYCOON format for the annotation of multimodal behavior (Martin et al. 2001). Yet it requires the annotation of the features of referred objects. We will have to find the adequate granularity of these referred objects (i.e. keyword annotations of slides sections or annotation of single slides drawings). We will also have to include new specification for annotating adaptative and cooperative behavior. We intend to use the Anvil annotation tool (Kipp 2001).","With an increasing number of video, we will have to specify a meta-data format for enabling the management of a pedagogical resources repository which could be adapted from the metadata developed in the ARIADNE project4",".","We will build a communicative model out of these annotations. Such a model will be used for extending the communicative features of the current pedagogical resources including the specification of a multimodal pedagogical agent producing spoken, textual, and gestural output (Lester et al. 2000).","These annotations will be used to increase the interactivity and adaptability of the existing on-line tutorial for searching annotated videos for specific kind of support (explanations, drawings), making parts of these video clickable and for specifying the adaptive behaviour of this pedagogical agent and of the on-line tutorial by adding dynamic hyperlinks (Kendall & Réty 2000).","The protocol itself is quite challenging. Different settings make it hard to compare observed behavior.","Finally, we think it will also be useful to have a better knowledge of how teachers do adapt the multimodal and adaptative features of their communication to different learning contexts (IJAIED, 2001).",""]},{"title":"6. References","paragraphs":["Baldry, A. P. (2000) ‘Introduction’. In Multimodality and multimediality in the distance learning age, ed. A. P. Baldry, Campobasso: Palladino Editore, pp. 11--39.","De Bra, P. & Calvi, L. (1998) A Flexible Adaptive Hypertext Courseware System. In Proceedings of the ACM Hypertext conference, pp. 283--284.","Feyereisen, P. (1997). La compréhension des gestes référentiels. Nouveaux actes sémiotiques. 52-53-54: pp. 29--48.","Graesser, A., Wiemer-Hastings, K., Wiemer-Hastings, P., Kreuz, R., & the Tutoring Research Group (2000). AutoTutor: A simulation of a human tutor. Journal of Cognitive Systems Research, 1, pp. 35--51. http://www.psyc.memphis.edu/trg/pubs.htm","IJAIED (2001). International Journal of Artificial Intelligence in Education. Special Issue on Modelling Teaching (editors Ben du Boulay and Rose Luckin). Volume 12. ISSN 1560-4292.","ITS 2000. International Workshop on Adaptive and Intelligent Web-based Educational Systems. In Conjunction with ITS 2000 19th June, 2000 Montreal, Canada http://littlebottom.cl-ki.uni-osnabrueck.de/its-2000/","Kendall, R., Réty, J.-H. (2000) Toward an Organic Hypertext. In Proceedings of the ACM Conference on Hypertext and Hypermedia (Hypertext'00).","Kipp, Michael (2001) Anvil - A Generic Annotation Tool for Multimodal Dialogue. In Proceedings of Eurospeech 2001, Aalborg, pp. 1367--1370.","Lester, J.C., Towns, S.G., Callaway, C.B., Voerman, J.L. & FitzGerald P. (2000) Deictic and emotive communication in animated pedagogical agents. In Embodied Conversational Agents. Cassell, J., Sullivan,  4 http://www.ariadne-eu.org/ ; metadata: http://www.ariadne-eu.org/3_MD/main.content.html J., Prevost, S., Churchill, E. (Eds.). The MIT Press. pp. 123--154. ISBN 0-262-03278-3","Martin, J.C., Grimard, S., Alexandri, K. (2001) On the annotation of the multimodal behavior and computation of cooperation between modalities. In Proceedings of the workshop on \" Representing, Annotating, and Evaluating Non-Verbal and Verbal Communicative Acts to Achieve Contextual Embodied Agents \", May 29, 2001, Montreal, in conjunction with The Fifth International Conference on Autonomous Agents. pp.1- -7 http://sunsite.informatik.rwthaachen.de/Publications/CEUR-WS/Vol-46/","Tajariol, F. (2001) Etude de l’activité cognitive du tutorat synchrone dans l’enseignement médiatisé à distance par ordinateur. Interaction without frontiers. In Proceedings of Joint AFIHM-BCS Conference on Human-Computer Interaction IHM-HCI’2001, Lille, september 10-14, vol. II, Jean Vanderdonckt, Ann Blanford & Alain Derycke (eds.) Cepaduès-Editions, Toulouse, pp. 193--194. "]}]}