{"sections":[{"title":"Modal Expressions in Natural Language Sentence and Their Similarity Toshifumi Tanabe*, Yasuo Koyama","paragraphs":["††††"]},{"title":", Kenji Yoshimura*, Kosho Shudo* ","paragraphs":["* Department of Electronics Engineering and Computer Science, Fukuoka University 8-19-1 Nanakuma, Jonan-Ku, Fukuoka, 814-0180, JAPAN","{tanabe, yosimura, shudo}@tl.fukuoka-u.ac.jp","† Corporate Research & Development, Seiko Epson Corporation","3-3-5 Owa, Suwa, Nagano, 392-8502, JAPAN","koyama.yasuo@exc.epson.co.jp","Abstract This paper is concerned with the treatment of modal information in natural language processing (NLP). Modal information, which fleshes out the kernel sentence, providing temporal, interpersonal, contingent or subjective information, i.e., polarity, tense, aspect, mood, modality in narrow sense, specific kinds of speaker’s judgment or attitude, etc plays an important role especially in discourse understanding, man-machine dialogue, inference system, etc. On the other hand, It is important for future NLP systems to formulate the semantic similarity of natural language expressions. In particular, paraphrasing, full text information retrieval, example-based MT and document compression technology require the effective similarity criterion for linguistic expressions. In this paper, first, we discuss the meaning of Japanese sentence-final modality expressions (ME) and second, we present similarity rules. "]},{"title":"1. Introduction","paragraphs":["This paper is concerned with the treatment of modal information in natural language processing (NLP). The term “modal” used in this paper is not closed to that of modal logic or present linguistic theories, but stretched from NLP’s viewpoints. The information which is to be handled in earlier stages of NLP will be classified into three major classes, i.e., 1) conceptual information given by conceptual words in the input sentence such as noun, verb, adjective, etc., 2) information about the relationship, i.e., case-relation, cause-effect relation, etc., between concepts ordinarily given by postposition, preposition or other syntactical structure of the sentence. 3) information other than 1 or 2, which is given typically by auxiliary verb or adverb. While information 1 combined with 2 comprises the kernel, propositional meaning of a sentence, the information 3, which we call “modal” information, fleshes out the kernel. It provides temporal, interpersonal, contingent or subjective information, i.e., polarity, tense, aspect, mood, modality in narrow sense, specific kinds of speaker’s judgment or attitude, etc. Thus, the term “modal” or “modality” is used generically for the sake of our convenience in this paper. Although the modal information plays an important role, especially in discourse understanding, man-machine dialogue, inference system, etc., we have not achieved enough knowledge about it in NLP field yet. On the other hand, it is also important for forthcoming NLP systems to formulate the semantic similarity of natural language expressions. It is required not only for the text retrieval, paraphrasing, document summarization, document compression, example-based MT, but also for the automatic acquisition of the concept and language. In this paper, we discuss the modal expressions in natural language and their semantic similarity from a viewpoint of NLP, adopting Japanese as a natural language model. In section 2., we introduce a formalization of the modal structure of natural sentence. In section 3., we introduce the left-branching characteristic of Japanese sentence that carries the modal information at the sentence-final position and a kind of ”reversal” isomorphism between the formalism and the general structure of Japanese sentence is described. Next, in section 4., we present a semantical classification of approximately one thousand five hundred modal expressions extracted from the final position of sentences in various corpus. It is shown in section 5. that this derives the hypothetical list of approximately one hundred thirty “modality” or “modal operators” for NLP. In section 6., we present semantic and pragmatic similarity rules among the sequences of modal operations Last, in section 7., we comment future works and open problems concerning e.g., the completeness of our modality set and the universality of the rules as concluding remarks."]},{"title":"2. Formal Aspect of Modalization","paragraphs":["We, first, assume that the modal structure of natural language sentence is generically formulated as:","","Mn [Mn-1...[M2 [M1 [S ]]]...]. (1)"," Here, S is a kernel sentence without modal meaning. Mi (1 i n) is a modal operator. M[X] denotes the modalization of X specified by the operator M. For example, English sentence “Mary should not have gone to school.” may be interpreted as: NEGATIVE-OBLIGATION [PAST-TENSE [Mary goes to school]] in this formalism. Here, modal operator NEGATIVE-OBLIGATION denotes what is the speaker’s judgment at the utterance time for PAST-TENSE [Mary...school]. This formalism, which is rather simple, might give rise to the intermediate expression in the course of logical interpretation of natural sentence. We, however, are not concerned with the interpretation itself, in this paper. Although the interpretation presupposes the strongest and sophisticated semantics closely related to the syntax that covers the whole natural language phenomena, we have not achieved those yet. From the viewpoint of the state-of-the-art technology of NLP, we are interested in what kind of series of modal operations Mn Mn-1...M2 M1 should be considered in NLP."]},{"title":"3. General Structure of Japanese Sentence","paragraphs":["The global surface structure of a Japanese sentence is described by production rules:","","Si Si-1ei (1in) (2)"," where, each Si is a non-terminal symbol for a sentence, S0 is the initial symbol, each ei is a terminal symbol for a modality expression that is not limited to a word but possibly a string of words that provides an undecomposable modal information and n is the number of modal expressions located at successive final positions of a sentence. Thus, the general form of a Japanese sentence S as the terminal string is shown as follows:","","S = Se1e2 en (0n) (3)"," where, S denotes a kernel sentence without modality which is governed by a verb, an adjective, an adjective verb or a nominal predicate(a noun followed by a linking verb) located in its final position, and most modal information is packed within its final part in Japanese sentence. In addition, a sentence is approximately a literal realization of formula (1) in reversed order. This is one of the remarkable features of Japanese language. Left branching property or the linearity of rule (2) is achieved by that every ei is chosen so as not to have the fragmental but have the complete modal meaning. That is, ei is sometimes a word and sometimes a sequence of words which might include conceptual words such as noun, verb, etc., as sub-strings in itself. We call ei “modal expression ME”. The independence of each ei’s meaning makes each Si (1in) a complete sentence with modality. We do not care about, in this paper, the inner-structure of S and each ei. Si-1 is called a “complement sentence” of ei."]},{"title":"4. Modal Expression","paragraphs":["We made a list of approximately one thousand five hundred modal expressions extracted from the final position of sentences in various corpus by close investigation. First, sentences can be classified into two types. One is propositional sentence, which is objective of truth-false evaluation and the other is non-propositional sentence, which is not. According to this, MEs are classified into two types as well:","","A. ME which changes a propositional sentence(Si-1) to","another propositional sentence(Si).","B. ME which changes a propositional sentence(Si-1) to","a non-propositional sentence(Si).  We call ME of type A and B, propositional and non-propositional ME, respectively. Apart from the structure of the kernel sentence, the general form of the final predicative part P of a sentence is shown with a regular expression as follows:  PP0A*","( +B) (4)  Here, P0 denotes a verb, an adjective, an adjective verb or a nominal predicate. A and B denotes propositional and non-propositional ME, respectively. denotes the empty set. Thus, non-propositional ME can not precede propositional ME."]},{"title":"4.1. Propositional Modal Expression","paragraphs":["Propositional MEs are classified into following two types:","","A1. dynamic ME which means operation, movement","or action.","A2. static ME which means state or situation."," MEs of type A1 is further classified into A1-1; voice, A1-2; aspect and A1-3; others. Table 1 shows some examples. ME of type A1-1 is used to change the predicate to, e.g., passive or causative one. It requires the conversion of specific case particle in the complement sentence in Japanese. ME of type A1-2 picks up some part of the time duration of operation, action, etc., denoted by the complement sentence. MEs of type A2 is classified into many subclasses as shown in Table 2 with examples. A2-1 is for negation. A2-2 is similar to A1-2 but it is static or observatory. A2-3 is for the past-tense. A2-4 is for the speaker’s judgment for the necessity, possibility and frequency. They function just as the necessity operator and the possibility operator of modal logic(Hughes,1968) do.   ","class marker example <PASSIVE-VOICE-IN","-NARROW-SENSE>","(reru),","(rareru)","<PASSIVE-VOICE 1 > (tekureru)","<PASSIVE-VOICE 2 > (temorau)","<CAUSATIVE-VOICE> (seru),","(saseru)","<BENEFITIAL-VOICE > (teyaru),","(teageru) A1-1 <SPONTANEITY-VOICE> (reru) <STARTING>","(hajimeru) <CONTINUATION>","(tudukeru),","(teiku) A1-2 <ENDING> (owaru),","(oeru),","","(teshimau) <FAILURE> (sokonau) <MISSING-CHANCE> (sobireru) <RELUCTANCE> (siburu) <PREPARATION> (teoku) A1-3 <TRIAL> (temiru) Table 1: Examples of A1-type MEs   class marker example A2-1","<NEGATION> (wakedehanai), (nai)","<PRE-STARTING> (utoshiteiru)","<ON-GOING> (teiru), (tutuaru) A2-2","<IMMEDIATELY -AFTER-ENDING>  (tabakarida)","A2-3 <PAST-TENSE> (ta) <OBLIGATION-1>","(nakerebanaranai) <OBLIGATION-2> (bekida)","<OBLIGATION-3>","(hougayoi)","<PROBABILITY-1>","(nitigainai)","<FREQUENCY-1> (tebakariiru) < OBLIGATION-1> (teyoi) < OBLIGATION-2> (temoyoi) <PROBABILITY-1> (darou) <PROBABILITY-2>","(kamoshirenai) A2-4","<FREQUENCY-1> (kotogaaru)","<ASPECT -OBSERVATION>","","(moyoudearu),","(youda)","<INTENTION-PLAN> (tumorida),","","(kotonishiteiru)","<CUSTOM>","(kotonishiteiru)","<RESTRICTION> (dakeda)","<EXCESS> (sugiru)","<PURPOSE> (tameda)","<REASON> (tameda)","<CAPABILITY>","(kotogadekiru) A2-5 <EASINESS> (yasui)"," Table 2: Examples of A2-type MEs "]},{"title":"4.2. Non-propositional Modal Expression","paragraphs":["Non-propositional ME is used when the speaker","requests or expects hearer’s specific operation, movement,","action, or change of emotion. They are classified as","follows:  B1. ME which is used when the speaker asks the","hearer information about the truth value of the","complement propositional sentence. B2. ME which is used when the speaker requires the","hearer to realize the action denoted by the","complement propositional sentence. Table 3: Examples of B-type MEs     B3. ME which is used when the speaker requires the","hearer not to realize the action of the complement","propositional sentence. B4. others. ","MEs of type B1, B2 and B3 make a family of","interrogative, imperative and prohibitive sentences,","respectively. Table 3 shows some examples."]},{"title":"5. Modality","paragraphs":["By investigating the meaning of approximately one thousand five hundred candidates of Mes mentioned above, we have obtained approximately one hundred thirty terminal classes of MEs. The set of these classes comprises our definition of “modality (in a broad sense)” or “modal operation” from practical viewpoints of NLP. In this paper, we denote individual class by a marker with single brackets “< >” for propositional ME and double brackets “<< >>” for non-propositional ME.","Although one ME corresponds to one modality in most cases, it corresponds to a composite modality in some cases. For example, (=need not), which is morphologically a sequence of four words, - --, is an non-decomposable ME in our framework, which once negates the complement sentence and then converts it to a sentence with the meaning of “permission” or “obligation”. Hence, a sequence of markers <NEGATION> <OBLIGATION- > which means a composition of two modal operations is associated with it. This corresponds, for example, to giving a composite modality <NEGATIVE-OBLIGATION> <PAST-TENSE> to predicative pattern, “should not have V-pp” in English. Table 4 shows other examples. ","class marker example <<INTERROGATIVE","1>> (ka),(noka), (no) B1","<<INTERROGATIVE 2>> (none), (nodane), (desutte), (nodatte)","<<IMPERATIVE>> (nasai), (yo), (nodesu)","<<REQUEST>> (tekure),  (tekurenaika) B2 <<INVITATION>> (uyo) B3","<<PROHIBITION>> (na),","","(nodehanai)","<<WISH>>","(naikanaa)","<<EXCLAMATION>> (naa) B4 <<DISCONTENT >> (nante)  Table 4: Examples of MEs which is given a string of markers  similarity rule example","<NEGATION><NEGATION>","ikanaikotohanai(iku) <NEGATION><NECESSITY-> <OBLIGATION-><NEGATION>  (tabenaihituyougaaru)(tabeteiikotohanai) <NEGATION><OBLIGATION-> <OBLIGATION-><NEGATION>   (hatarakanakutemoyoi)(hatarakanakerebanaranaikotowanai) <NEGATION><PROBABILITY-> <PROBABILITY-><NEGATION>   (yomanainitigainai)(yomukamoshirenaikotohanai) <NEGATION><PROBABILITY-> <PROBABILITY-><NEGATION>   (hakaisarenaikamoshirenai)(hakaisarerunitigainaitohaienai) <NEGATION><FREQUENCY-> <FREQUENCY-><NEGATION>   (kakanaidebakariiru)(kakukotogaarutoha(hotondo)ienai) <NEGATION><FREQUENCY-> <FREQUENCY-><NEGATION>  (hanasanaitokimoaru)(hanashitebakariiruwakedemonai)"," Table 5: Logical rules and examples  Table 6: Pragmatic rules and examples  ","ME sequence of modalities (mai) = will not <NEGATION><PROBABILITY-1> (tehanaranai) = must not V <NEGATION><OBLIGATION-1> (nihaoyobanai) = need not V <NEGATION><OBLIGATION-1> (tatameshiganai) = have never V-en <NEGATION><PAST><FREQUENCY-1> (kotoganai) = have never V-en <FREQUENCY-1><NEGATION> (tohakagiranai) = do not always V <NEGATION><FREQUENCY-2> similarity rule example","<OBLIGATION-1> <<COMMAND>>","(yaburanakerebanarimasen) (yaburinasai)","<CAPABILITY> <OBLIGATION->","(hairukotogadekiru) (haittemoyoi)","<PASSIVE-VOICE 1 ><<COMMAND>> <<COMMAND>>  (ittekure) (ike)","< PASSIVE-VOICE 2 ><<WISH>> <<REQUEST>>  (inottemoraitai) (inottekure) <CAPABILITY> <NEGATION> <<INTERROGATION>>","<<REQUEST>>   (agerukotogadekinaika) (agetekure)","<NEGATION><< INTERROGATION >> <<INVITATION>>  (minaika) (miyouyo)","<NEGATION><NECESSITY-> <<PROHIBITION>>  (ikanaihituyougaaru) (ikuna)","In general, with a sequence of MEs e1e2...en of formula (3), a sequence of markers M1M2... Mm(nm) is associated. Through morphological analysis, the former will be converted to the latter. That is, the following formula (5), rather than (3), corresponds to formula (1).","","Si Si-1Mi (1im) (5)"]},{"title":"6. Similarity Rule for Modality","paragraphs":["We are concerned with the similarity among the sequences of modal markers, i.e., sequences of modal operations. In particular, we present some logical and pragmatic equivalence. While the former equivalence is based on “truth-value”, the latter, “functional”.","The following rules seem useful for e.g., canonicalization or paraphrasing of linguistic expressions, dialogue systems, inference systems, text retrieval systems, etc."]},{"title":"6.1. Logical Rule","paragraphs":["There found rules such as; <FREQUENCY- > <NEGATION> <NEGATION> <FREQUENCY- > (i.e., NEGATION [FREQUENCY- P FREQUENCY-NEGATION[P]] in the above formalism (1) ), which assures, for example, that (hatarai tebakariiru toiukotohanai not... work always) is similar to (hatarakanaitokigaaru = sometimes ...not work). This might be thought a realization in relation to “usuality” or “frequency” of the axiom of conventional modal logic, where and denote necessity and possibility operator, respectively. Double Negation is usually combined with some modality in natural sentence, e.g., inevitability as shown in the first line of Table 5. That hatarakanaiwakedehanai = It is not inevitable... not to work... is similar to hatarakukotomoaru =...possibly work... implies a similarity principle <NEGATION> <INEVITABILITY- > <NEGATION> <INEVITABILITY- >. Thus, necessity and probability rule in modal logic are restated in terms of our modalities, i.e., obligation, inevitability, probability and frequency as in Table 5. As another example, ( hatarakanaku temoyoi = need not work) will be converted to ‘work’<NEGATION><OBLIGATION->. On the other hand, the similar expression; (hataraka nakerebanaranaikotohanai = It is not obligatory that ...work...) will be converted to ‘work’ <OBLIGATION-><NEGATION>. Hence, we obtain a rule;","","<NEGATION ><OBLIGATION->","<OBLIGATION-><NEGATION >"," The dual rule;"," <NEGATION><OBLIGATION-> <OBLIGATION-><NEGATION>  is also obtained from that","(hataraitehanaranaimust not ...work) is","similar to","(hataraiteyoitoiukotohanai not permissible","...work...), corresponding to the axiom",". Similar correspondence is shown in terms","of “usuality” or “frequency” as shown above. ","These logical rules which are combined with polarity","would be applied with antonym or pseudo antonym","conversion as in the following two examples:  1. (ookii","tohakagiranai = not ...be necessarily big) (ookikunai","kotogaaru = may ...be not-big) (tiisaikotogaaru =","may... be small)  2.(hatarai tebakariiru wakedehanai not ... work always) (hatarakanai tokimoaru = sometimes ...not work) (asondeirutokimoaru = sometimes ...be idle)","","Other theorems in modal logic, such as P= P, P=P, P=P, etc., seem not very interesting since we seldom have the corresponding utterances in NL."]},{"title":"6.2. Pragmatic Rule","paragraphs":["There are expressions which look quite different from each other but function similarly when they are uttered in some situations. An example of these pragmatical or functional similarity rules is <CAPABILITY> <NEGATION> <<INTERROGATIVE>> <<IMPERATIVE>> which assures shiraberukotogadekinaika= Can’t (you) check (it)? is similar to shirabetekure = Check (it.). Here, << >> marks the attitudinal modality which shows the speaker’s attitude toward the hearer. This exemplifies a case that an interrogative sentence is used euphemistically instead of an imperative one. These “pragmatic” similarity rules are exemplified in Table 6. These rules generally require that the agent of their complement sentence to be “second person”. Another example is a rule: <CAPABILITY> <NEGATION> <<PROHIBITIVE>> which is applied to (hairukotogadekinai = You-listener can not enter...)(hairuna =Do not enter...). That is, the former sentence is declarative but it is used as a prohibitive (negative-imperative) one. Rules of this type are observed by the “Cooperative Principle” and the “maxims” in (Grice,1989), but their applicability conditions and their universality have not been studied extensively yet. They are left to further works."]},{"title":"7. Concluding Remarks","paragraphs":["Modality is fundamental for the inference system, dialogue system, etc., in NLP. On the other hand, similarity is one of the most important subjects which are fundamental to information science and also cognitive science, because the ability to recognize the similarity between things is essential for human learning in harmony with the ability for abstraction. In this paper, we presented a list of modality expressions and their classification. Then, we described some similarity rules between sequences of modal expressions. Another important point we contend is that the linguistic unit of the sentence construction should be a string of words, if necessary from a viewpoint of semantic NLP. Modal expressions ME we presented in this paper are chosen on the bases of this idea. Fortunately, this does not cause the explosion of the number of expressions to be extracted but just disambiguates component word’s meaning as far as the sentence-final part in Japanese is concerned. We assumed that the modal information is provided by MEs in the sentence-final position in Japanese sentence. However, it is sometimes provided by different types of expression, i.e., specific kinds of adverb or verb in the sentence. In this sense, we have not given an extensive model for modality processing in this paper. Nevertheless, it is a fact that the sentence-final part is a dominant vein of modality in Japanese language. Another point to be noted here is that the rules discussed in this paper will partly work as rules of inference for, i.e., dialogue systems. Soundness and universality of our list of modalities and similarity rules are left to further studies."]},{"title":"8. References","paragraphs":["P.Grice. 1989. Studies in the Way of Words, Harvard UP.","M.A.K.Halliday. 1994. An Introduction to Functional Grammar, Arnold, London","G.E.Hughes,M.J.Cresswell. 1968. An Introduction to Modal Logic. Hethuen and Co.,Ltd. London","N.Katoh. 1998. A new approach to acquiring linguistic knowledge for summarizing parts of news sentences and its evaluation, Information Processing Society of Japan SIG Notes,7,126-10(In Japanese)","J.R.Martin. et al. 1997. Working with Functional Grammar. Arnold, London","T.Masuoka et al. 2002. Studies of Japanese Language(NIHONGOGAKU), Vol.21, No.2 Meijishoin(In Japanese)","K.Shudo, H.Tsurumaru, S.Yoshida. 1977. A Predicative Part Processing System for Japanese-English Machine Translation, Trans. IECE D-129(In Japanese)","K.Shudo, T.Narahara, S.Yoshida, 1979. A Structural Model of Bunsetsu for Machine Processing of Japanese, Trans. IECE Vol.62-D No.12(In Japanese)","Y.Wakita, J.Kawai, H.Iida. 1998. Correct part extraction from speech recognition results using semantic distance calculation and speech translation by translation of extracted parts only, Journal of Natural Language Processing,Vol.5,No.4(In Japanese)","I.Yamada et al. 1997. Video Retrieval based on the Sentences Similarity, NHK Science and Technical Research Laboratories, Japan(In Japanese)"]}]}