{"sections":[{"title":"A Sign Expansion Approach to Dynamic, Multi-Purpose Lexicons Jon Atle Gulla GMD - IPSI Dolivostratle 15 D-64293 Darmstadt, Germany gulla0gmd, de. Sjur NCrsteb¢ Moshagen Computing Centre for the Humanities Harald H£rfagres gt. 31, N-5007 Bergen, Norway s jut. mo shagen0hd, uib. no Abstract","paragraphs":["Two problematic issues in most lexicon systems today are their size and restricted domain of use. In this paper, we introduce a new approach to lexical or-ganization that leads to more compact and flexible lexicons. The lexical entries are conceptual/phonological frames rather than word entries, and a number of expansion rules are used to generate entries of actual words from these frames. A single frame supports not only all forms of a word, but also words of different categories that are derived from the same semantic basis. The whole theory is now being implemented in the TROLL lexicon project."]},{"title":"1 Introduction Due","paragraphs":["to the complexity and wide coverage of lexical information, full-fledged lexicon systems easily grow undesirably big and must cope with in-tricate ~ nets of dependencies among lexical items. For keeping the speed of access at a satisfactory level, lexical information is often repeated in different entries to reduce the number of consultations needed for a single user query. This simplifies and speeds up the access of lexical information, but also blows up the size of the lexicon and leads to huge maintenance problems. In many cases, it also clutters the lexicon structure, so that important lexical relationships and generalizations are lost.","Structuring the lexicon in inheritance hierarchies opens for more compact lexicon representations. So far, lexicons have been structured in syntactic inheritance hierarchies, in which more or less abstract syntactic classes form the upper nodes and actual words are associated with the leaf nodes (Flickinger and Nerbonne, 1992; Russell et al., 1992). However, the nature and number of these abstract syntactic classes are not very clear, and it seems difficult to come up with a sound method for how to decide on such classes. At the same time, there are also good reasons for assuming a similar hierarchy based on semantic properties (Hellan and Dimitrova-Vulchanova, 1994). Representing many competing hierarchies in the lexicon is a problem in itself and is here even more problematic as there are many complex relationships between semantic and syntactic properties (Gropen et al., 1992; Hellan and Dimitrova-Vulchanova, 1996).","Another problem is related to the notions and structures adopted in the lexicon systems. Most lexicons today are constructed within the frame-work of some syntactic theory. This theory guides the structuring of lexical information and also decides what information should be available to the user (Andry et al., 1992; Flickinger and Nerbonne, 1992; Mel'Suk and Polgu~re, 1987; Russell et ~l., 1992; Krieger and Nerbonne, 1991). Some lexicon systems try to be reasonably theory-independent, though they still have to adopt some basic syntactic notions that locate them into a family of theories (Gofii and GonzAlez, 1995; Grimshaw and Jackendoff, 1985; Grishman et al., 1994). The"]},{"title":"Sign Expansion Approach","paragraphs":["forms a basis for creating non-redundant lexicon systems that are structured along semantic lines. The stored lexical entries are sign frames rather than actual words, and a whole system of expansion rules and consistency rules are used to generate dynamic entries of words that contain all the necessary semantic, syntactic, and morphological information.","In Section 2, we give a brief introduction to a sign expansion theory called the Sign Model. Section 3 explains the use of lexical expansion rules, whereas some concluding remarks and directions for further work are found in Section 4. 478"]},{"title":"/ paintN paint(($","paragraphs":["SUB.I))"]},{"title":"paint((~","paragraphs":["SUBJ)(]\" OBJ)} -~"]},{"title":"paint((t","paragraphs":["SUBJ)(J\" OBJ)(J\" XCOMP)>"]},{"title":"paint((~","paragraphs":["SuB J)(]\" OBL)} Figure 1: The stored frame"]},{"title":"PAINT","paragraphs":["is expanded into actual words with syntactic properties."]},{"title":"2 The Sign Model","paragraphs":["In the sign expansion approach, the lexicon is viewed as a dynamic rule system with lexical frames and various kinds of expansion rules. The"]},{"title":"Sign Model (SM)","paragraphs":["by Hcllan and Dimitrova-Vulchanova (Hellan and Dimitrova-Vnlchanova, 1994) is a semantically based sign expansion theory and is used as the lexical basis of our lexicon. It posits an abstract level of sign representation that is not associated with any word classes and establishes a framework, within which word relationships as well as relationships between different kinds of linguistic properties can be described in a systematic way. At the abstract level of representation, one defines conceptual/phonological fi'ames that underly the actual words found in a language. The fi'ames combine with lexical expansion rules to create dynamic entries of actual words with morphological and syntactic properties, as illustrated by the LFG representations in Figure 1. No particular syntactic terminology is assumed, since the theory is intended to fit into any syntactic theory. 2.1 Minimal Signs The conceptual/phonological frame, which is referred to as a"]},{"title":"minimal sign,","paragraphs":["is made up of a semantic (conceptual) part and a realizational part. As we do not have very much to say about phonological representations here, we assmne in the following that tim realizational part is a simple graphemic representation. The semantic part is a conceptual structure of the sign, which is to capture all grammar-relevant aspects of its meaning. The meaning of a sign is analyzed as a situation involving a number of participants (also called arguments), and these participants as well as the situation as a whole are modeled in terms of aspectual values, semantic roles, criterial factors, and realizational and selectional properties.","Consider the minimal sign"]},{"title":"PAINT","paragraphs":["in Figure 2, which is the lexical entry underlying the related words"]},{"title":"paintv , paintN , paintingN , paintableA,","paragraphs":["etc. The realizational part is the string \"t)aint\", whereas the semantic part denotes a situation with two arguments, indexed as 1 and 2. The Real : Sem :"]},{"title":"\"paint\" - Junctual","paragraphs":["SOURCE CONTROLLER DIM LIMIT GOAL MONOTONIC"]},{"title":"coloring noncriterial 2-dim coloring noncriterial coloring","paragraphs":["Figure 2: Stored entry for minimal sign"]},{"title":"PAINT.","paragraphs":["aspectual value (-punctuaO describes the situation as durative, whereas the selectional restric-tion DIM states that argument 2 is to serve as some two-dimensional surface. Argument 1, the painter, possesses the semantic roles SOURCE and CONTROLLER. SOURCE means that this argument is the source of energy for the force involved in a painting process, whereas CONTROLLER indicates that the argument is in control of the process. Correspondingly, argument 2 is the entity on which the force is used (LIMIT) and the entity being controlled by argument 1 (GOAL). Argument 2 is also given the MONOTONIC role, which means that it undergoes some monotonic change in the course of painting. The change, of course, is that the surface is gradually covered by some paint. Each semantic role is further characterized by means of a criterial factor that imposes certain role-related observational properties on the argument. Specifying SOURCE and LIMIT as"]},{"title":"coloring","paragraphs":["means that the painter's use of force in-volves some observable actions that identifies him as painting, and that the surface being painted is recognizable from the same force. The gradual covering of the surface with paint, which is modeled by MONOTONIC, is also of the"]},{"title":"coloring","paragraphs":["type, since we can verify the covering by looking at the surface. CONTROLLER's and GOAL'S factor"]},{"title":"noncriterial","paragraphs":["means that no particular observable be-havior is required for an argument to play these 479 Real : Sem :","\"walk\" - punctual CONTROLLER noncriterial MONOTONIC 1-dim t Figure 3: Stored entry for minimal sign WALK. particular roles. In general, the criterial factors affect, the implicitation of arguments in syntactic expressions (e.g. argument 2 in ,Ion painted) and the introduction of new ones (e.g. red in Jon painted the house red).","As shown by the lexical entry of WALK in Figure 3, naturally intransitive verbs are rooted in minimal signs with only one conceptual argument. The argument of WALK is a SOURCE and a CONTROLLER, and it undergoes a monotonic development with respect to some one-dimensional path. In a sentence like Jon walked to the school, the phrase to the school describes this monotonic development of argument 1. Away in gon walked away is another optional constituent, that can describe argument l's nmvement along a one-dimensional path. 2.2 Lexical Rules The general format of the expansion rules is as follows: (1) X IF Y COMPOSITION S","X contains the information to be added and Y the requirement for using the rule. S concerns the structure on which the rule is used and specifies which parts of this structure should be considered by the rule. Interpretationally, the rule in (1) can be applied on a structure Z if Y is a substructure of Z and X unifies with the selection of Z specified in S. The result of the operation is exactly this unified structure, and the operation itself is referred to as a derivation. If the whole lexical entry is to be addressed by the rule, the COMPOSITION part is omitted in the rule specification. Similarly, if the IF Y part is not present, it means that there is no requirement for using the rule. The expansion rules fall into five categories, depending on what kind of information they insert into the lexical representations: (1) Morpho-syntactic augmentations, (2) inflections, (3) conceptual expansions, (4) syntactic mappings, and (5) compositions.","Morpho-syntactic augmentation rules add a word category and an inflectional paradigm to a minimal sign. The morpho-syntactic augmentation rule shown in Figure 4(a), for example, derives the basic entry for the verb paintv from tile minimal sign PAINT.","Assuming that tile lexical entry has already been given a word class and a paradigm, the inflectional rule expands the graphemic representation into a particular inflected word form. The rule in Figure 4(b) expands the basic entry for paintv into the more specialized entry for the past form paintedv. The inflectional rules m'e grouped together into paradigms that are associated with the appropriate words (e.g. vl is linked to paintv).","Conceptual e,r, pansion rules are rules that extend the semantic part of the signs without combining them with other sign structures. These rules are semantically conditioned and typically explain how a particular sign can support a variety of subcategorization frames. The rule in Figure 4(c) shows how a resultative construction like Jon painted the wall red is supported by a minimal sign like PAINT. If the conceptual structure contains an argument that undergoes some monotonic development, the conceptual structure can be expanded with a new argument that serves as the medium for this development and has a dimension matching the criterial property of the MONOTONIC role. When an argument is a medium for some other argument, it means that its monotoni(: development is manifested or materialized through this other argument. Hence, as argument 2 of PAINThas a MONOTONIC role, the rule is able to add an argument that describes the resul}ing monotonic change of the surface being painted. The realization of this argument as an adjective (like red) comes from the fact that the new argument, is of dimension coloring. For a minimal sign like WALK (see Figure 3), which contains an argument (the walker) that monotonically moves along some one-dimensional path, the rule adds a new argument of dimensionality 1-dim. The medium must then describe a one-dimensional path, as for example to the school in Jon walked to the school.","Syntactic mapping rules are rules that derive syntactic properties from conceptual structures. Since no special syntactic notions are assumed, we must here decide on an existing syntactic theory before the mapping rules can be defined. The rule shown in Figure 4(d) is based on Gulla's rules (Gulla, 1994) for mapping from SM conceptual structures to LFG grammatical functions (Kaplan and Bresnan, 1982). It states that if a verb is used 480 Cat: V lIlft: [ paradigm: vl ] ..... (a)"]},{"title":"lnfl: [ form: past, ]","paragraphs":["R,eah insert \"ed\" at end ..... (b)","~elIlt: I)]M (~ MH)IUM - } i j 1F ....... (,9 .... Syn: [ XCOMP.i"]},{"title":"[] ] W","paragraphs":["Sere:","4. completed I)[M MEI)IUM coloring ()l{ existence"]},{"title":">j ..... (,0 []k","paragraphs":["IF","I punctual SeIll-\" [ CONTROI,LFAI, COMPOSITION main Suttix wh, ere (t ¢ no'ucriterial ......... ....... Figure 4: (a) Morpho-syntactic augmel~tation. (b) Inflectional rule. (c) Conceptual expansion. (d) Mapping rule. (e) Compositiolml rule. in a completed seIIse 1, MEDIUM arguments of (timensionality coloring or existence can be mapped onto the XCOMP flmction. Used together with rule 4(c) on PA[N~I; it introduces an XCOMP element that des(:ribes the resulting state of the surface being painted. A similar al)proaeh to the assignmeat of synt;u:tic flmct, ions in LFG can be found in (Alsina, 1993).","The compositional rules combine two sign stru(> I;ures attd create a new compound structure that includes parts of l)oth of them. The rule in Figul'c 4(e) uses a suffix to create a noun [;hat re[ers to some controlled, durative activity. Except tbr l;hc control and duration requirement, l;he conc:ep~ tua.1 structure must also contain a criterially an-chored argument, i.e. mt argument that includes at least one semantic role that is not noneritcrial. The (]OMI'OSITION part says that there are two structures involved, a main stru(:ture and a s'u,J.l~x strucl,urc, whei'cas the cxpansioll i)art turns l;he whole conceptual structure into an &rgulilent k. ()n the basis ot\" the minimal signs PAINT and WALK, l;he rule (:an create I;he notms paintingN and 'walkingN . 3"]},{"title":"The Expanding Lexicon","paragraphs":["In a sign extmnsion le, xi(:on system, we must dis~ tinguish between stored lexical entries and generated lexical entries. The stored entries are all minimal signs, and I;hey are usually not very in-I;eresdng to the lexicon user. The generated entries are produ(:ed by combining stored entries with one or more ext)ansion rules, and these cnt;ri(;s at'(; more or less elaborate spe(:ifica~,ions of actual wor(ls. A simple generated entry is the result of combining th(; minimal sign PAINT in Figure 2 with the morpho-syntactic auginen~ation rule in Figure 4(a). This yMds dm basic verb entry paintv, which (loes not contain any information abou|, syntactic realization. More elabo.- rat(; entries are then generated by expanding the paiutv entry with the different subcategorization frames that are possible for paintv. For a user requesting information fl'om the lexicon, l;he stored entries m W be completely hidden and only the elaborate generated ones may be made available.","Consider the rather elaborate entry in Figure 5, which rel)resents the past form painted used in the following resultative constru(:tion:","lt, bllowing the ideas of felicity in (Depraetere, 1995), we define a clause to 1)e completed if it reaches a natural or intt;nded endpoint. A non-repetitive resultative (:ons~ruction is always completed, whereas constructions like ,Ion is painting and Jon paints eve.ry day are incompleted."]},{"title":"481 Cat","paragraphs":[": Infl : Real : Sem : Syn :"]},{"title":"V","paragraphs":["paradigm: vl form: past"]},{"title":"\"painted\" - punctual + completed","paragraphs":["SOURCE"]},{"title":"coloring ]","paragraphs":["CONTROLLER"]},{"title":"noncriterial 1","paragraphs":["DIM"]},{"title":"2-dim 1","paragraphs":["LIMIT"]},{"title":"coloring","paragraphs":["GOAL noncriterial MONOTONIC4"]},{"title":"coloring 2","paragraphs":["DIM"]},{"title":"coloring ]","paragraphs":["MEDIUM --~ 4 3"]},{"title":"suRJl: [] ] o,J : [ ] XCOMP : []","paragraphs":["Figure 5: Generated entry for resultative use of"]},{"title":"paintedv .","paragraphs":["(3)"]},{"title":"Jon painted the house red.","paragraphs":["The entry specifies a particular word form, contains a conceptual structure with three arguments, and lists the syntactic functions realizing these arguments. Indexing SUBJ with 1 means that argument 1 of the conceptual structure is to be realized as the subject. The whole entry is generated by a series of derivations, where each derivation adds a piece of information to the final lexical entry. Starting with the minimal sign"]},{"title":"PAINT,","paragraphs":["we use the rules in Figure 4(a) and 4(b) to generate a simple entry for"]},{"title":"paintedy.","paragraphs":["Then we expand the conceptual structure into a completed description"]},{"title":"(+ completed)","paragraphs":["using a rule called"]},{"title":"Completed","paragraphs":["and apply the rule in Figure 4(c) to add a third argument. The syntactic functions are added by the rule in Figure 4(d) plus two rules that we here can call"]},{"title":"Subjl","paragraphs":["and"]},{"title":"Objl.","paragraphs":["Subjl assigns the SUBJ func-tion to arguments that contain SOURCE or CONTROLLER roles, whereas Objl requires a +"]},{"title":"completed","paragraphs":["description and assigns the OBJ fimction to arguments that have a MONOTONIC role. The generation of the lexical entry in Figure 5, thus, can be written as the following derivational sequence: (4)"]},{"title":"PAINT ++","paragraphs":["4(a) ++ 4(b) +-t- Completed ++ 4(c) ++ Subjl ++ Objl ++ 4(d) When the system is to create a derivational se-Cat: Infl: Real: Sem:"]},{"title":"N","paragraphs":["[ paradigm: nl ]"]},{"title":"\"paint(ing) \" - ~unctual","paragraphs":["SOURCE CONTROLLER DIM LIMIT GOAL MONOTONIC"]},{"title":"coloring noncriterial 2-dim coloring noncriterial coloring","paragraphs":["2 3 Figure 6: Lexical entry for suffix"]},{"title":"ingN","paragraphs":["and generated entry for"]},{"title":"paintingN.","paragraphs":["quence like that, we first have to indicate which morpho-syntactic rule to use. The system then chooses the correct inflectional paradigm, and it can start trying out the different expansion rules to generate complete lexical entries. The search space for this is restricted, since the rules are semantically conditioned and monotonic, and well-formedness conditions decide when to stop expanding the structure.","In a similar vein, the noun"]},{"title":"paintingN","paragraphs":["(referring to a painting process) is derived from the minimal sign"]},{"title":"PAINT","paragraphs":["and the suffix"]},{"title":"ingN.","paragraphs":["The compositional rule from Figure 4(e) combines these two structures and produces the lexical entry shown in Figure 6. Category and Infection stem from"]},{"title":"ingN,","paragraphs":["Realization is a combination of the values in"]},{"title":"PAINT","paragraphs":["and"]},{"title":"ingN,","paragraphs":["and Semantics is the minimal sign's conceptual structure expanded into a complex argument indexed as 3. Instead of stor= ing two entries for"]},{"title":"paintv","paragraphs":["and"]},{"title":"paintingN --","paragraphs":["that partly contain the same information -- we derive the entries dynamically from a single"]},{"title":"PAINT","paragraphs":["entry. 4 Conclusions The Sign Model (SM) gives a theoretical founda-tion for structuring lexical information along semantic lines• It prescribes a strong semantic basis and suggests various kinds of expansion rules for generating complete word entries. The sign expansion approach is now used as a basis for the TROLL lexicon project in Trondheim. In this project, a formalism for lexical representation as well as mechanisms for executmg lexical rules are implemented in LPA Prolog (Gulla and Moshagen, 1995). A lexicon of Norwegian verbs is under construction, and SM-based analyses of En-482 glish, German, and Bulgarian have been used in the design of the lexicon (Hellan and Dimitrova-Vulchanova, 1996; Pitz, 1994). Due to speed concerns, the stored entries and the expansion rules are in the TROLL lexicon supplemented with in-dexes that refer to well-defined derivational sequences for complete word entries. The work in the TROLL project is now concentrated on the construction of a complete lexicon for Norwegian, and this work is also to serve as an evaluation of both the lexicon structures and the Sign Model. The theory is still at a development stage when it comes to psychological and perceptional matters, even though some suggestions have been made (Gulla, 1994). The filture work also includes establishing proper interfaces to various syntactic theories, so that the system can be integrated with existing parsers and generators."]},{"title":"References","paragraphs":["Alsina, A. (1993)."]},{"title":"Predicate Composition: A Theory of Syntactic Function Alternations.","paragraphs":["Ph. D. thesis, Stanford University, San Fransisco.","Andry, F., N. M. Fraser, S. McGlashan, S. Thornton, and N. J. Youd (1992). Making DATR Work for Speech: Lexicon Compilation in SUN-DIAL."]},{"title":"Computational Linguistics","paragraphs":["18(3), 245-268.","Coopmans, Everaert, and Grimshaw (Eds.) (1996)."]},{"title":"Lexical Specification and Insertion.","paragraphs":["Lawrence Erlbaum Ass., Inc.","Depraetere, I. (1995). (Un)boundedness and (A)telicity."]},{"title":"Linguistics and Philosophy 18, 1-19.","paragraphs":["Flickinger, D. and J. Nerbonne (1992). Inheritance and Complementation: A Case Study of E~y Adjectives and Related Nouns."]},{"title":"Computational Linguistics 18","paragraphs":["(3), 269-310.","Gofii, J. M. and J. C. GonzAlez (1995). A frame-work for lexical representation. In"]},{"title":"AI95: 15th International Conference. Language Engineering 95,","paragraphs":["Montpellier, pp. 243-252.","Crimshaw, J. and R. Jackendoff (1985). Report to the NSF on grant IST-81-20403. Technical report, Waltham, Department of Linguistics, Brandeis University.","Grishman, ll., C. Macleod, and A. Meyers (1994). Comlex Syntax: Building a Computational Lexicon. In"]},{"title":"Proceedings of the International Conference on Computational Linguistics (COLING-94),","paragraphs":["Kyoto.","Gropen, J., S. Pinker, M. Hollander, and R. Goldberg (1992). Affectedness and Direct Objects: The role of lexical semantics in the acquisition of verb argument structure. In B. Levin and S. Pinker (Eds.),"]},{"title":"Lexical fJ Conceptual Semantics,","paragraphs":["Cognition Special Issues, Chapter 6, pp. 153-196. Elsevier Science Publishers.","Gulla, J. A. (1994). A Proposal for Linking LFG F-structures to a Conceptual Semantics. Master's thesis, Department of Linguistics, The University of Trondheim, Trondheim.","Gulla, J. A. and S. N. Moshagen (1995, January). Representations and Derivations in the TROLL Lcxicon. In H. Ledrup, I. Moen, and H. G. Simonsen (Eds.),"]},{"title":"Proceedings of The XVth Scandinavian Conference of Linguistics,","paragraphs":["Oslo.","Ilellan, L. and M. Dimitrova-Vulchanova (1994, July). Preliminary Notes on a Framework for 'Lexically Dependent Grammar'. Lecture series at International Summer Institute in Syntax, Central Institutue of English and Foreign Languages, Hyderabad, India.","Hellan, L. and M. Dimi.trova-Vulchanova (1996). Criteriality and Grammatical Realization. lib appear in (Coopmans et al., 1996).","Kaplan, R. M. and J. Bresnan (1982). Lexical-Functional Grammar: A Formal System for Grammatical Representation. In J. Brcsnan (Ed.),"]},{"title":"The Mental Representation of Grammatical Relations,","paragraphs":["Chapter 4, pp. 173-281. MIT Press.","Krieger, H. U. and J. Nerbonne (1991). Feature-Based Inheritence Networks for Computational Lexicons. Technical Report DFKI-P~R-91-31, German Research Center for Artificial Intelligence (DFKI), Saarbrucken.","Mel'~uk, I. and A. PolguSre (1987). A Formal Lexicon in Meaning-Text Theory (Or How to Do Lexica with Words."]},{"title":"Computational Linguistics","paragraphs":["13(3-4), 261-275. Pitz, A. (1994)."]},{"title":"Nominal Signs in German.","paragraphs":["Ph. D. thesis, Department of Linguistics, University of Trondheim, Trondheim.","Russell, G., A. Ballim, J. Carroll, and S. Warwick-Armstrong (1992). A Practical Approach to Multiple Default Inheritance for Unification-Based Lexicons."]},{"title":"Computational Linguistics","paragraphs":["18(3), 311-337. 483"]}]}