{"sections":[{"title":"Interpretation of Nominal Compounds: Combining Domain-Independent and Domain-Specific Information C6cile Fabre IRISA Campus de Beaulieu 35200 Rennes","paragraphs":["[~r&IICe"]},{"title":"cfabre~irisa.ft\" Abstract","paragraphs":["A domain independent model is proposed for the automated interpretation of nominal compounds in English. This model is meant to account for productive rules of interpretation which are inferred from the morpho-syntactic and semantic characteristics of the nominal constituents. In particular, we make extensive use of Pustejovsky's principles concerning the predicative information associated with nominals. We argue that it is necessary to draw a line between generalizable semantic principles and domain-specific semantic information. We explain this distinction and we show how this model may be applied to the interpretation of compounds in real texts, provided that complementary semantic information are retrieved."]},{"title":"1 Motivation","paragraphs":["Interpreting nominal compounds consists in retrieving the predicative relation between the constituents. In many cases, no surface information is available to deduce the relation, and in particular no morphological evidence of a link between the constituents and the underlying predicate. This problem has been tackled in several types of NLP systems, mainly:","- domain-dependent systems. Such systems are very efficient but are limited to the domain they are built for: interpretation rules are inferred from the observation of specific semantic patterns (Marsh, 1984) or from a fine-grained conceptual representation (Ter Stal, 1996).","domain-independent systems (Finin, 1980; Mac Donald, 1982), built to account for any kind of interpretation patterns, including rules that are not inferred from the properties of the constituents (what Finin calls"]},{"title":"productive rulcs,","paragraphs":["in op-position to"]},{"title":"structural rules).","paragraphs":["Frequency and probability scores are added to the rules. Such numeric weighting of general semantic rules is hardly defensible in the absence of any reference to a domain.","Consequently, the questions that we propose to answer are: how far Call we go in design-ing a model of interpretation rules which account for productive patterns of interpretation, independently of any domain? Couversely, what domaim specific information must be available to enrich this general model? The aim of our research is to define as precisely as possible the border line between what can be regularly described with general linguistic mechanisms, and what has to do with subregular or irregular phenomena which depend on corpus characteristics. This is a crucial issue when dealing with compound semantics because regular semantic patterns (involving relational properties of nominMs) and extralinguistic data are mingled.","We have designed a model 1 that accounts for"]},{"title":"structural rules","paragraphs":["(in Finin's terminology) of interpretation of N N compounds 2, i.e. domain-independent rnles that are deduced from the rnorpho-syntactic and semantic characteristics of the nominal constituents. The interest of this general model is to base the interpretation of compounds exclusively on general principles regarding the association between nouns and predicative information. Besides, this non-specialized model of interpretation allows us to draw a comparison with nominal sequences across languages, and es-",">Phis project is supported by the CNE'P (contract CNET-INRIA n°951B030). Our model of interpretation of nominal compounds will be used to enrich im formation retrieval in a system that is open-domaln.","2In this work, we only focus on non-recursive terms. The same interpretation mechanisms can be extended to compounds with three constituents or more, but furthermore these compounds raise the problem of ambiguous bracketing (Resnik, 1993)."]},{"title":"364","paragraphs":["pecially with l)¥ench sequences of the form \"N de N\" and \"N g N\", in which tile l)repositional link is semantically weak (l,'abre and Sdbillot, 1994).","We first describe this model, showing how coml)ound interl)retation must rely on an accurate description of the predicative prol)erties of n()minal constituents. We then suggest how this general model may be apl)lied to the interpre.tation of compounds in texts, provided that it is made more specilic wil, h domain-dependent or text-specific information. 2 Domain-independent lnodel In this section, we briefly explain how the interpretation is carried out when"]},{"title":"conlpoullds","paragraphs":["contain explicit predicative information. We then focus on the interpretation of compounds in which the constituents are root nonainals.","Ill what follows, semantic features are adapted front the WordNet lexical database :~ which provides a rich but non-specialized semantic taxonomy. We use a small part of this hierar(:hy in order to define, a set of semantic features that lat)el non> inal constituents. Sen:laaltic labels are also used I,o express seleetional restrictkms on arguments.","2.1 Compounds with a devea'lml constituent Compounds including a deverbal constituent that subcategorizes the other (:onstitueut have been precisely descril)ed, in particular within the, generative franmwork (Selkirk, 1982; IAeber, 11983). These results have been integrated in our model.","The predicati(:e relation between the constituents is given by the verbal root of the (leverbal noun. We differentiate two types of deverbals: a deverba] may refer to the accomplishment or the result of the process denoted by the verb (e.g."]},{"title":"parsing)","paragraphs":["or it may saturate the role assigned to one of the a rgunmnts of the verb and thus refer to one of the actors of the process (mainly agent or instrument, e.g."]},{"title":"parser).","paragraphs":["In the former ease"]},{"title":"(action deverbals),","paragraphs":["the deverbal inherits the entire"]},{"title":"~rgument","paragraphs":["structure of tile w~'rb; in the latter"]},{"title":"(subject devcrbals),","paragraphs":["it inherits the structure mimls the agent saturated by the sutfix. When the deverbal noun occupies the head position of the compound, the non-head may saturate one of the roles of the argument structure of the deverbal, either the theme role, a.s in"]},{"title":"sentence parsing --y","paragraphs":["parsc(theme:"]},{"title":"sentence4),","paragraphs":["or a semantic role (ill aWordNet is a trademark of lh'inceton University. 4'l'he semant;ic interpre|;ation is ,'epresented in a tormula that exhit)its both t, he underlying pr(:dicate and the roles thaC each constitucnl, plays in th(\" m'gu-the sense of Selkirk (1982)), referring to a circmnstance of tile action (location, time, means, etc.}:"]},{"title":"hand parsing ~ parse(means: hand).","paragraphs":["When the deverbal noun is the non-head, it cannot saturate an internal argument within tile compound (Lieber, 1983); in this case, the head may only fill a semantic or an external argument:"]},{"title":"parsing program --~ pacsc(instrument: program).","paragraphs":["This first series of compounding patterns has often be considered as the only type of compound which can be described in semantic terms (Selkirk, 1982). Our own position is to argue that the same predicate-argument pattern IIlay be used to deal with other types of compounds, provided that we rely on a richer semantic representation of nomina.ls, when no morpho-syntactic clues are available to constrain the semantic interpretation. 2.2 Root"]},{"title":"conlponnds","paragraphs":["NominM compounds illustrate the distributional properties of nouns in the absenee of any explicit verbal ln'edicate. They attest an rattierlying event structure associated to nominal constituents, which makes it possible to derive a predicative relation from the mere collocation of two simple nouns. The idea that noun meaning involves ewmt-based description has been particularly emphasized by J. Pustejovsky (1991). We propose to apl)ly a crucial component of his"]},{"title":"generative lea:icon,","paragraphs":["tile"]},{"title":"qualia st'ructurc,","paragraphs":["to tile semantic","interpre~tation of conlpOullds. The key idea tllnt underlies the"]},{"title":"qualia sl,'uctu,v","paragraphs":["is that nouns are implicitly related to predicative information, and that a noun selects tbr the tyl)e of predicate, that can govern it. The four typical nominal relations that constitute the"]},{"title":"qualia struetmv are tile telic role, that refers to the purpose and function of the referent, the agentive role,","paragraphs":["that concerns the factors involved in its origins, the"]},{"title":"constitutive","paragraphs":["role, that captures the relation between an object and its constituent parts, and the"]},{"title":"Jormal","paragraphs":["role, that distinguishes the ol)ject within a larger domain. We illustrate the use of this theoretical flamework R)r the interpretation of nolnitm.l"]},{"title":"contpounds.","paragraphs":["Telic role. The notion of telic role is directly applicable to the treatment of COml)ounds. It; recalls Finin's notion of role nominals (Finin, 1980). A role nominal is typically linked to a verbal predica.te that denotes its purpose; it, fills one of the roles included in the argument structm:e of the verb. For example, the noun"]},{"title":"pipeline","paragraphs":["typically refl'.rs to the external argument of tile verb"]},{"title":"trans-","paragraphs":["menl; structure o[ that predicate: NI N2 -+ V(role_i: IN2, role_j: N1). The head constituent is underlined. 365"]},{"title":"port","paragraphs":["(cf. WordNet textual gloss: '% long pipe used to"]},{"title":"transport","paragraphs":["liquids or gases\"). Unlike subject deverbals, role nominals are not provided with an argument structure that may be syntactically satisfied. Nevertheless, the argument structure of the underlying verb provides a clue for the distributional properties of the noun within compounds. The verb"]},{"title":"tTunsport","paragraphs":["requires a subject and an object argument; since the noun"]},{"title":"pipeline","paragraphs":["refers to its first argument, the position which is left empty (the theme) may be occupied by the first constituent of a compound of the form"]},{"title":"N pipeline,","paragraphs":["as in"]},{"title":"oil pipeline -+ transport(instrument: pipeline,","paragraphs":["theme:"]},{"title":"oil).","paragraphs":["Agentive role. The agentive role is also selected by the compounding mechanism: the non-head may refer to the origin of the head noun, as in"]},{"title":"pancreas ptyalin -+ produce(agent: pancreas,","paragraphs":["theme:"]},{"title":"ptyalin),","paragraphs":["in"]},{"title":"compiler message -+ emit(agent: compiler,","paragraphs":["theme:"]},{"title":"message),","paragraphs":["or in"]},{"title":"bullet wound ~ cause(agent: bullet,","paragraphs":["theme:"]},{"title":"wound).","paragraphs":["We see that this relation covers different kinds of predicates which are instances of a more general relation of creation.","Constitutive role. The constitutive role includes various kinds of semantic associations, such as part-whole relations"]},{"title":"(outrigger canoe)","paragraphs":["or substance relations"]},{"title":"(stone house).","paragraphs":["Formal role. The formal role involves a relation of characterization which concerns different aspects of an object (its size, shape, color, etc.). The nouns that denote such information are mostly elements of the ATTRIBUTE class, which is defined in WordNet as \"an abstraction belonging to or characteristic of an entity\". Each member of this class may appear at the head position of compounds in which the non-head denotes the entity that is characterized:"]},{"title":"desk height --+ characterize(attribute: he_ight,","paragraphs":["entity:"]},{"title":"desk).","paragraphs":["These nouns are uni-relationM nouns that can appear as the head of \"N1 of N2\" groups, where N2 is a syntactic argument of N1 (e.g."]},{"title":"height of the desk)","paragraphs":["(Isabelle, 1984).","Consequently, Pustejovsky's notion of noun's qualia helps to characterize implicit predicative link in compounds. This semantic framework demonstrates that the association between nominal constituents and underlying predicative relation in root compounds is not arbitrary: it involves conceptual mechanisms that are triggered in other linguistic phenomena such as type coercion (Pustejovsky, 1991), anaphora (Fradin, 1984) or adjectival constructions (Bouillon and Viegas, 1993). 2.3 Implementation and results The implementation of these principles in our model is based on a conceptual framework in order to associate predicative information with nominal constituents. Two cases arise: when the link between a noun and a predicate is characteristic of a single noun, it is expressed in its lexical entry. When it is shared by a whole class of nouns, it is seen as a characteristic feature of that class which accounts for a relational property that any member of the class inherits. For example, the telic role of the word"]},{"title":"pipeline,","paragraphs":["which involves the verb"]},{"title":"transport,","paragraphs":["cannot be generalized to a whole class of nouns. On the contrary, the predicate CONTAIN is a characteristic feature of the class CONTAINER. Consequently, several predicates and several roles are potentially associated with nominal constituents, either as instances of different attributes, or as a consequence of this inheritance mechanism.","We have tested our model on a list of 100 compounds randomly picked up from a list of N N sequences in isolation 5. Our program generates any interpretation that can be calculated on account of the mechanisms that we have described. Firstly, the list of predicates that are associated to the head constituent 6 is retrieved. Secondly, only the predicates that can provide a role to the other constituent are retained.","It is difficult to assess the correction of the answers that are produced, since we are dealing with compounds in isolation. Other answers are sometimes conceivable, if we apply less regular principles of semantic associations (Downing 1977), so that we cannot compare our results with a closed set of correct answers. Moreover, we cannot set a clear-cut border line between probable and hardly conceivable interpretations. Having said this, we can estimate our results as follows: 71% of ~he compounds that we have examined receive acceptable answers. For example, our program generates two clearly acceptable solutions for the compound"]},{"title":"missile range:","paragraphs":["1)"]},{"title":"characterize(agent: range_7,","paragraphs":["theme:"]},{"title":"missile)","paragraphs":["2)"]},{"title":"shoot(locative: range_9,","paragraphs":["theme:"]},{"title":"missile)","paragraphs":["Contrary to Finin's and Mac Donald's models,","5This list of 9000 binary nominals has been kindly put at our disposal by R. Sproat. The corpus is described in (Sproat, 1994).","6 In most cases, the predicative information is associated with the head, except when the non-head is deverbal, as in"]},{"title":"hunting lodge,","paragraphs":["or when the head refers to an under,pecified event structure, ,as in"]},{"title":"malaria program (fight)","paragraphs":["vs"]},{"title":"crop program (develop).","paragraphs":["Such com-- pounds illustrate the notion of co-compositionality (Pustejovsky 1991). 366 we are dealing with ambiguous constituents: nine meanings of the word range are listed, which correspond to the description given by WordNet for this noun. Only senses 7 (\"scope\", ATTmBUTE) and 9 (\"a place for shooting projectiles\", AaTE-FACT) are related to a predicative information that is compatible with the non-head, namely the formal role in the first case, and the relic role in the other. Some answers are more questionable:"]},{"title":"cardboard box --","paragraphs":["1)"]},{"title":"constilutc(agent: cardboard,","paragraphs":["theme:"]},{"title":"box_/t, box_5, box_6, box_7) -","paragraphs":["objects made of cardboard","(constitutive role) 2)"]},{"title":"contain(locative: box_7,","paragraphs":["theme:"]},{"title":"cardboard) -","paragraphs":["box that contains cardboard (telic role) 3)"]},{"title":"produce(agent: box_3,","paragraphs":["theme:"]},{"title":"cardboard) --","paragraphs":["plant that produce cardboard (telic role) 4)"]},{"title":"measure(agent: box_2,","paragraphs":["theme:"]},{"title":"cardboard)- a","paragraphs":["quantity of cardboard (formM role)","Interpretations 2, 3 and 4 are surely mistaken in a standard context, if we refer to extralinguistic: knowledge"]},{"title":"(box_3","paragraphs":["- a kind of shrub - does not prodnce cardlooard the way"]},{"title":"gum trees","paragraphs":["l)rodnce gum) or to lexicalization (the compound"]},{"title":"cardboard box","paragraphs":["has only one usual meaning, namely"]},{"title":"constitute(agent: cardboard,","paragraphs":["theme:"]},{"title":"box_7,","paragraphs":["where"]},{"title":"box_7","paragraphs":["refers to the container). Yet, each answer is conceivable because it corresponds to productive semantic patterns and therefore to existing cognitive strategies.","6% of the answers miss expected answers and"]},{"title":"23%","paragraphs":["give no answers at all. If we compare our results with those of Mac Donald (1982), we see that the part of silence is undoubtedly less important in his system (no meaning is produced for 10 % of the compounds). Nevertheless, one crucial distinction must be emphasized: in Mac l)onMd's system, slots are defined in relation to nominals, and an interpretation is identified if one constituent can fill a slot of the other. These slots are supposed to represent any piece of real-world knowledge that is necessary to understand noun compomMs, but nothing precise is said about the information that needs to be stored. The solu-tion to improve this resnlt is unclear in such a system: missing interpretations correspond to absent slots, but no indication is given regarding the slots that must be added. On the contrary, we have shown that a few general principles of predicative attachment to nominal constituents are involved in the interpretation of Compounds in our model; consequently, the analysis of incorrect answers allow us to determine in what cases domain-independent rnechanisms are unsulticient to per-form the interpretation and what kind of knowledge must be added to improve these results, either from domain-dependent or froln contextual information. One can classify the problems in two categories:"]},{"title":"Inappropriate selectional restrictions","paragraphs":["Only selectionM features can constrMn the interpretation when several predicates are possible, in order to distinguish between different roles (e.g."]},{"title":"shoulder wound-","paragraphs":["the non-head"]},{"title":"affects","paragraphs":["a BODY PART VS"]},{"title":"bullet wound -","paragraphs":["the wound is caused by a WEAPON). Consequently, no interpretation is generated when the semantics of the non-head does not match the constraints on the arguments of the predicate, and particnlarly in case of semantic shifts:"]},{"title":"stadium","paragraphs":["is a CONSTI~UCTION, but in sta-"]},{"title":"dium clo~sh,","paragraphs":["it is viewed as a LOCATION or 3.s a GI{OUP of people. This is a general issue in lexical semantics; yet, the problem is all the more difficult to handle in compounds as no syntactic clue (i.e. no prepositional link) is available to distinguish between different (semantic or thematic) roles. It is also particnlarly problematic to solve ambignons role assignment when semantic roles are concerned (as in"]},{"title":"fear voters). Missing","paragraphs":["predicative llnk A general model cannot account for all possible compounding relations. Not to mention contextual links (Downing, 1977), some productive relations cannot be constrained from the semantics of the constituents. Specific links such as ressemblance"]},{"title":"(carpet shark)","paragraphs":["or subclass relations"]},{"title":"(marathon tour)","paragraphs":["cannot be described with structural rules. Moreover, a predicative information may be missed when it entails fine extralinguistic knowledge (e.g."]},{"title":"fl'uit fly: in-","paragraphs":["sect whose larvae feed on ft'nits).","Generation of multiple interpretations and un-predicted patterns due to selectional violation or extralingnistic information are thus the two inherent limits of a domain-independent model of interpretation. Our aim is to give suggestions about the possibilities of refining this model when domMn-specific or contextual information are available."]},{"title":"3 Domain-specific semantic","paragraphs":["inforlnation 3.1 Detection of specific"]},{"title":"patterns","paragraphs":["Preferential patterns Statistical methods have been experimented by psycholinguists such as Pamela Downing (Downing, 1977) and Mary Ellen l{yder (Ryder, 1984): their purpose is to use statistical knowledge to interpret new compounds. Ryder argues that a set of semantic rules is not sufficient to deal with the productivity of the compounding process, since the creation of new"]},{"title":"3 6'7","paragraphs":["compounds involves extralinguistie knowledge and cognitive strategies. According to her, \"the predictability is probabilistic\", and she shows that the creation and interpretation of new compounds is based on knowledge about productive semantic patterns. For example, she lists highly frequent templates such as:","N -t- PRODUCT : PRODUCT used on N (pet shampoo, laundry detergent)","This pattern illustrates only one facet - the relic one - of the head noun (and is irrelevant for examples such as egg shampoo or dishwasher detergent). This statistical result may differ considerably from one corpus to another. Consequently, fi'equency scores cannot be part of a domain-independent model.","From our results, we see that two types of specific information must be available to refine our domain-independent rules: firstly, we must specify the relative frequence of each role to assess the best interpretation tbr a compound when several semantic relations apply. Secondly, we want to determine the semantic features that characterize the non-head for one given role; P.Resnik's aim is similar when he illustrates the use of selectional association in compounds (Resnik 1993), in order to find N N semantic patterns which help to per-form adequate bracketing of sequences with three constituents or more. Ite shows that it is diflicnlt to find clear-cut semantic groups in unrestricted texts. Yet, such techniques, that combine statistic measures and conceptual knowledge, are very promising to exhibit typical patterns of association in specific domains.","Unpredieted patterns Exhibiting unpredieted patterns is a first step towards the determination of specific interpretation schemes in a given domain. For example, let us consider a list of compounds matching the N pump pattern, such as: air pump, beer pump, breast pump, cattle pump, gear pump, piston pure,p, sand pump, stomach pump, drainage pump. In this list, we find compounds exhibiting:","-","the telic role of the noun:","SUBSTANCE + pump --+ pump(instrmnent: pump, theme: SUnSTANCP 0 (sand, air)","ACTION -t- pump ~ ACTION(instrument: pump (drainage)","-. the constitutive role of the noun","OBJECT + pump -+ constitute(theme: pump, agent: OBJECT) (gear, piston)","These patterns are predicted and interpreted by our set of rules. Other types of associations, too specific to be taken into account by our model, appear in the list: ANIMAL + pump (cattie pump) and ORGAN + pump (stomach pump, breast pump), in which the missing predicates are respectively feed - i.e. pump food Jor - and clean - i.e. pump the contents of. We see that the underlying relic relation is more complex, because it includes also an implicit argument (food, contents) of the predicate. These are typically the Specific patterns that cannot be taken into account in a general model. Exhibiting semantic patterns in the texts is thus a way to autolnatieally learn more specific patterns of associations in sublanguages. We are currently experimenting the way techniques of computer-aided acquisition for learning conceptual relations fi'om syntactic collocates (Velardi et al. 1991) can be applied to N N associations. 3.2 Identification of the predicative link Our model associates a fixed verbal predicate with nouns or nominal classes to account for a given semantic facet. This predicate corresponds to the typical predicative information that occur ill the Wordnet textual gloss, when it is available. In fact, this predicate may vary fl'om one corpus to another, and we nmst take into account this variation which corresponds to specific conceptual descriptions. Contextual information can contribute to identify the predicative relation by looking else-where in the text to see if the constituents of the compound are involved in another kind of linguistic construction, where their semantic relation would be explicit. Given a compound N1 N2, we may look for strings in which the couple (N1, N2) occurs in a different relation. In the following examples, the context provides the missing verbal predicate:","compiler warnings: (compiler,warning) = \"it is reasonable for the compiler to emit a warning\"","In this example, which corresponds to the agentive role, we see that the two nouns are argmnents of the predicate that instantiates the underlying relation, which means that corpus-based methods can use a rich linguistic structure to identify the predicate. Pustejovsky et al. (1993) show how statistical techniques, such as mutual information measures can contribute to automatically acquire lexical information regarding the link between a noun and a predicate. Similar techniques are used by (Grefenstette and Teut~l 1.995) to determiue the support verb associated with deverbal nouns."]},{"title":"Conclusion","paragraphs":["This paper describes a domain-independent model tbr the ,interpretation of nominal compounds; it shows how general knowledge and domain-specific 368 itiforinal;ion inay be combined for the interpretation of nolnitlal"]},{"title":"colllpoulids.","paragraphs":["Otlr goal is to account for l)roductive and actress-domain rules of interpretal,ion, l']xperimentation shows that the delinition of general rules, which inchide conceptual description of the norninal constituents, implies the generation of multiple interpretations, especially since we are dealing with arnbiguous nominal constituerits.","We have ])reposed several ways of incoq)orat-ing specific 8elnantic inforination in our model, and we have suggested how corl)us observations can detect l)referential semantic relations and llll-predicted semantic patterns. Statistical observa.- tions can contribute to identify the most productive compounding strategies for a given corl)us , and are especially very proniising a.s a way to (lea[ with technical texts, in which the semantic variety of cOinl)ounding relation is limited. '.l'his work is currently experinmnted in lPrenc]l, where it el)- pears that tile saine eon(:el)tua] franlcwork holds to account for the semantic role of prel)ositions (~ and"]},{"title":"de","paragraphs":["in binoininal sequences. References Pierrette l~ouillon and l,;velyl,e Viegas. 1993. Semantic I,exicons: the Cornerstone tbr l,exical Choice in Natural I,anguage (Jeneration,"]},{"title":"Prec. of tl~e sew'ulh I~d, ernational Workshop (4N,tu~'al Lang'ua.qc (;cnc'raLion.","paragraphs":["Pamela Downing. 1977. On the Creation and Use of English Compound Nouns."]},{"title":"Language ,","paragraphs":["53(4): 810-842.","Cdcile Fabre and Pascalc Sdbillot. 1994. lnterprdtation sdmantique des composds noniinaux anglais el; fran~a.is,"]},{"title":"l'roc, oJ the. Workshop on Compound Norms: Multilingual Aspects of Nominal (7omposition,","paragraphs":["Genbve. 'l'imothy Wilking 1,'inin. 1980. 'Phe Semantic","Interpretation of Nominal Compounds,"]},{"title":"Prec. of the first co~@rcnce of AI.","paragraphs":["Bernard l,'radin. 1984. Anaphorisation et st&dotypes nominaux,"]},{"title":"Liugua,","paragraphs":["North-llolland, 64: 3:x5-31i9.","(h'egory (]l eR:nstette and Siinone 'l'eut%l. 1995. Corl)us-based lnethod for auLoniatic idenLilication of ,nil)port verbs for noininalizations,"]},{"title":"l\"roc, of","paragraphs":["EA CL, 1)ublin.","Pierre lsabelle. 1984. Another Look at Nominal (]otnpoullds,"]},{"title":"13vet. of Colin q-.S4.","paragraphs":["I/,ochelle l,ieber. 71.983. Argument Linking and Compounds in I!',nglish,"]},{"title":"Linguistic lnqui'w,","paragraphs":["il d(2):","2571-285. Da.vid 1t. Mac Donald. 1982,"]},{"title":"I/ndc,'s&mdi~lg (7o'mpounds Nouns,","paragraphs":["l'hD Thesis, (3arnegie Mellon / Jniversity.","Elaine Marsh. 11984. A Computational Analysis of Complex Noun Phrases in Navy Messages,"]},{"title":"P'~vc. of Colin q-84.","paragraphs":["James Pusteiovsky. 19911. The Generative I,exicon,"]},{"title":"Computational Linguistics,","paragraphs":["1714): 408-441. James Pustejovsky, Peter Anick and Sabine Bergler. 11993. l,exical Semantic 'l%chniqnes for Corpus Analyses."]},{"title":"Computational Lmg,i~tics, ;I 9(2).","paragraphs":["Philil) Stuart Resnik. 1993."]},{"title":"Selection alzd lr~- Jb'rmaliou: a Class-]lascd Approach go l,emical l~cl, lionships.","paragraphs":["PhD Thesis, University of Pennsylva-","nia. Mary Ellen Ryder. 1994."]},{"title":"O~de,wd Chaos: the interpretatiol~ of Euglish Noun-Noun Compotmds.","paragraphs":["University of California Press. l~',lisabeth Selkirk. 1982. 71~e"]},{"title":"S~]ntaa: of Wo'rd,%","paragraphs":["M1T I'ress.","Richard Sproat. 1!)94. l,;nglish Noun-Phrase Accent Prediction for Text-to-Speech,"]},{"title":"(]ompulc.,\" ,5'peech (rod Language,","paragraphs":["8: 79-9/1. Wilco Ter Stal. 1996."]},{"title":"Automated hd, e,cp.cctal, ion of Nominal Co'mpounds in a Technical Domain,","paragraphs":["Phi) Thesis. University of Twente, the Netherlands.","Pa.ola Velardi, Michela Fasolo and M aria 'l'cresa l'azienza. 1991. llow to l'hieode Semantic Knowledge: A Method ['or Meaning l{el)resentation and (Joml)uter-Aided Acquisition,"]},{"title":"Computatioual Li~t-9uisl, ics,","paragraphs":["11712): 153-1170. 369"]}]}