{"sections":[{"title":"Branching Split Obliqueness at the Syntax-Semantics Interface Antdnio H. Branco","paragraphs":["l)ept, of Computing, University of Lisbon","l,'acuMade de Ci6neias, Campo (.{rande","11700 I,isboa, Portugal Antonio.Branco@di.fc. ul.pt Abstract In this paper it is argued that the, accuracy of the syntax-semantics interfhce is improw',d by adopting u non-linear obliqueness hierarchy [br subcategorized arguments. 0 Introduction","In the context of the emerging research area o[' computational semantics, topics related to the syntax-semantics interfime have deserved special attention. One such topic is the SUBCAT fbature and the inIbrmation encoded in it.","In IIPS(] framework, this Ibatuce has been shown to be a critical point of articulation t)etween highly autononmus principle-based syntax and semantics cmnponents (vd. a.(). Frank and l{(',yl(; 1995). ()n the one hand, the SU//CAT list records in[brnmtion about strict subcategorization properties of the corresponding predicator through the nature and number of its elements. On the other hand, by means of' the linear order hierarchy assigned to these elements, syntactic generalizations concerned with word order, binding, alternations, etc. are also regist, ered (I)ollard and Sag 1987, Ch. 5).","Recent research, namely by lida, Manning, ()'Nell and Sag (1994) and Sag and (iodard (1994), brought t;<) light evidence that, contrary Lo what was originally assumed in (l'ollard and Sag 1987; 1994), those di['ferent syntactic generalizations may not be encoded by one and the same ordering of the subcategorized elements. This issue was directly addressed by Manning and Sag (1995), who proposed to recast the SUBCAT intbrmation into two diffi;rent lists.","()ne of the lists displays the subcategorized elements according to an order relevant to their linear surl~tce concatenation. This \"valence\" list results from the append of S[}BJ, SPEC and (X)MI)S lists, which are but the result of a previous segmentation of the SUB(',AT list proposed by Borsley (1987) and taken u I) by Pollard and Sag ( 1994, ('J~. 9). The other list, in Lurn, orders the subcategorized elements uccm'ding to a hierarchy relewmt U) se[ up the binding relations between them. This \"argument\" list is the value o[' the new ARG-S fbature.","In this connection, the crucial point i want to m'gue li)r in this paper is that, in order to increase the syntax-semantics interface accuracy, the reshutIling of the old SUBCAT list must be [hrther extended. In particular, on a par with its segmentation, into sub-lists and its splillin4; into possibly different ot)liqueness hierarchies, a branch, in, g ol)liqueness ordering should be also admitted. This paper is deveh)ped along three parts. Fi,'st, the mat n art u merits ef Mann i ng and Sag (1995) fi)r the dissociation between the ordering flu' linear surface concatenation and the ordering tbr binding are briefly reviewed. Second, I present empirical justification [i)r the adoption of a non-linear order /'or the ARG-S wflue. Third, the definition of e-command is specified lbr this new obliqueness [brmat.","1 Empirical Motivation for Split Obliqueness The main arguments presented by Manninv and Sag (1995) for splitting obliqueness into valence obliquene.ss and binding obliqueness rest on the analysis of two linguistic phenmnena: reflexives in Toba Batak, a western ausLrenesian language, and. reflexives in Japanese causative constructions. 1.1 Toba Batak reflexives The pair <)t' senLences in (1) illustrates tile distinction between the objective voice, in (l)a., 149 expressed by the"]},{"title":"di-","paragraphs":["verbal prefix and used in unmarked contexts, and its active voice counterpart, in (1)b., expressed by the"]},{"title":"mang-","paragraphs":["prefix (Manning and Sag 1995, (16)).","(1) a. di-ida si Torus si Ria. ov-see PM Torus PM Ria 'Torus sees/saw Ria.'","b. mang-ida si Ria si Torus. nv-see PM Ria PM Torus 'Torus sees/saw Ria.'","In Toba Batak there is strong evidence that, in transitive constructions, a verb and the following NP form a VP constituent regardless of the voice chosen. Therefore, the constituent structure of (1)a. and b. is presented in (2)a. and b., together with the corresponding lexical entry of the verb (Manning and Sag 1995, (21), (20)).","(2) a. Objective voice: 'Torus saw Ria.' S VP V NP"]},{"title":"I I di-ida Torus","paragraphs":["-PHON SUBJ COMPS SUBCAT CONT NP"]},{"title":"I","paragraphs":["Rht (di - ida)"]},{"title":"<D> <m> (mNPj, DNPi> I","paragraphs":["SEER","b. Active voice: 'Torus saw Ria.' S VP V NP"]},{"title":"mang-ida Ria","paragraphs":["PHON SUBJ COMPS SUBCAT CONT NP"]},{"title":"I Torus","paragraphs":["(mang - ida}"]},{"title":"<[]> <[])","paragraphs":["([~] NPi, I-Y] NPj> ISEER SEEN ijl","Now, the examples in (3) show all the possible occurrences of one reflexive NP in the basic transitive structures illustrated in (1). In (3)a. and a'., the reflexive occurs in objective constructions, respectively, as an immediate constituent of VP and as an immediate constituent of S. The corresponding active constructions are displayed in (3)b. and b'. (Manning and Sag 1995, (22), (23)).","(3) a. *di-ida diri-na si John. [saw himselflvp John '*Himself saw John.'","PHON (di-ida} ] NP:"]},{"title":"nproj","paragraphs":["/SUBCAT"]},{"title":", NP:anai >","paragraphs":["[CONT [SEER [SEEN"]},{"title":"ijl","paragraphs":["a'. di-ida siJohn diri-na. [saw John]vp himself 'John saw himself.' PHON (di-ida) ] SUBCAT"]},{"title":"(NP:anaj, NP:npro i )","paragraphs":["CONT I SEER [SEEN"]},{"title":"ij]","paragraphs":["b. mang-ida diri-na si John. [saw himself]vp John 'John saw himself.' ] PHON (mang - ida) ] SUBCAT (NP:"]},{"title":"nproi,","paragraphs":["NP:"]},{"title":"anaj ) 1 CONT LSEEN","paragraphs":["b'. *mang-ida si John diri-na. [saw Johnlvp himself '*Himself saw John.' ] PHON (mang- ida) ] SUBCAT (NP:"]},{"title":"anai, NP:nproj ) I '","paragraphs":["ISEER"]},{"title":"i] /","paragraphs":["CONT L SEEN JJ J The pair of grammatical constructions (3)a'./(3)b. confirms that binding principles cannot be defined in terms of linear word order or c-command. In (3)a'. the antecedent precedes the reflexive, but in (3)b. it is the reflexive that precedes the antecedent; in (3)b. the antecedent c-command the reflexive, but in (3)a'. it is the other way around. However, contrary to the assumptions of the Binding Theory of Pollard and Sag (1994), also the 150 definition of binding principles cannot be based on the SUBCAT valence order. This is made evident by (3)a. and (3)a'., whose grammatical status is not correctly predicted. In (3)a., the reflexive is bound by a less oblique element in the SUBCAT list, in accordance with Principle A, but the construction is not acceptable. In (3)b., the reflexive is bound by a more oblique element in the SUBCAT list, in violation of Principle A, but the construction is acceptable.","The solution adopted by Manning and Sag (1995) consists of a three step move: i) to keep the Binding Theory unchanged; ii) to create a new list of subcategorized elements, which is named ARG-S (from argument structure); iii) to define o-command relations on the basis of the obliqueness hierarchy established on this new list, which may be different from the obliqueness hierarchy established in the SUBCAT list.","Let us then see how this solution works for the problematic examples in (3). In (4) we find the lexical entries of (3) after their reshut~ing according to Manning and Sag's proposal (for the sake of readability, the representation of SUBJ and COMPS features is omitted).","(4) a. PHON SUBCAT ARG - S CONT","a'. [PHON SUBCAT ARG - S CONT","b' IPHON SUBCAT ARG - S CONT","b'. I-PHON SUBCAT ARG - S CONT (di- ida) ]"]},{"title":"D/>","paragraphs":["(E] NP:"]},{"title":"ann, []","paragraphs":["NP: np,'o) SEER L SEEN"]},{"title":"ij]","paragraphs":["(di-ida) 1 <[]j, L]i)"]},{"title":"([2]NP:npro,","paragraphs":["[]NP:ana) [SEER i 1 LSEEN"]},{"title":",] ~","paragraphs":["(mang- ida> ]"]},{"title":"<[]NP:npro, F]NP:ana)","paragraphs":["SEER"]},{"title":";1","paragraphs":["(mang- ida> 1"]},{"title":"<UNP:ana, NNP:npro)","paragraphs":["ISEER"]},{"title":";.1","paragraphs":["It is easy to check that the correct predictions are made if the relevant o-command relations are established on the ARG-S list: the reflexive is now coindexed with a more oblique element in (3)a./(4)a., and with a less oblique antecedent in (3)a'./(4)a'. 1.2 Reflexives in Japanese causatives The other linguistic evidence put forward to support this obliqueness split is the behavior of reflexives in Japanese causative constructions, as originally argued for by Iida, Manning, O'Neil and Sag (1994). The analysis of case marking, agreement and word order phenomena in Japanese causatives reveals that this construction exhibits properties of a single clause sentence. As to the Japanese reflexive"]},{"title":"zibun,","paragraphs":["like English reflexives, it must be locally o-bound, with some particulars, as for instance its being subject-oriented, that is it can be bound only by a subject. Now, the example of (5) illustrates that, in the context of causatives,"]},{"title":"zibun","paragraphs":["is not restricted to being bound by the subject of its clause (Manning and Sag 1994, (44)). (5) a. Tarooi ga Zirooj ni aete"]},{"title":"zibun-zisini/j o","paragraphs":["hihans-ase-ta. Taroo NGM Ziro DAT purposefully self ACC criticize-CAUS-PAST 'Tarooi purposefully made Zirooj criticize"]},{"title":"himselfi/j.'","paragraphs":["Also, pronouns exhibit a special behavior in the context of causatives. Contrary to the requirements of Principle B, in such contexts pronouns may be bound by an antecedent occurring in the same clause, but only if it is the subject of the causative construction. This is illustrated in (6) (Iida"]},{"title":"et al.","paragraphs":["1994, (17)).","(6) Tarooi wa Zirooj ni karei / ~)' o bengos-ase-ta. Taroo TOP Ziroo DAT he AOC defend-CAUS-PAST 'Tarooi made Zirooj defend himi / ~:].' The solution proposed in (lida et al. 1994) for accounting for the apparent peculiar properties of binding constraints in causatives relies on the assumption that the derived lexical representation of a causative verb, like tazune-sase ('made sb. visit'), has the form sketched in (7), where tazune is the verb 'to visit' and -sase the causative suffix (lida et al. 1994, (25)). 151 (7) PHON SUBCAT ARG - S CONT -PHON SUBCAT ARG - S CONT V"]},{"title":"/","paragraphs":["[~ NP [nom]: nproi, [] NP [dat]: nproj, \\[~ NP [acc]: ana k cause(i, j, visit(j, k ) )","V -sase (tazune) ] (DNP[nomlj, D}"]},{"title":"<D, D>","paragraphs":["visit(j, k)"]},{"title":"I","paragraphs":["tazune","Consequently, this solution relies also on the three basic assumptions adopted fbr the analysis of Toba Batak reflexives: i) the principles of Binding Theory remain invariant; ii) a new list of subcategorized elements, termed ARG-S, is adopted; iii) o-command relations are defined on the basis of the obliqueness hierarchy established in this new list. Moreover, there is a fourth assumption which proposes that Principles A and B should be validated in at least one of the two ARG-S features occurring in the derived lexical entry of a causative verbal lbrm.","Looking at the lexical representation of causative verbs in (7) and the examples (5) and (6), it is easy to check that Principle A is satisfied in the lower ARG-S list for the binding Ziroo/himself, where Ziroo is the subject, and in the upper ARG-S for the binding Taroo/himself, where Taroo is now the subject. As to the contrast in (6), Principle B is satisfied in the lower ARG-S list, where the pronoun is locally o-tYee."]},{"title":"2 Empirical Motivation for Branching Obliqueness","paragraphs":["Once the binding obliqueness is unpacked from the valence list and gets an autonomous status, it becomes easier to increase the empirical adequacy of Binding Theory, in particular, and the syntax-semantics accuracy, in general. In this section I argue this can be done by letting the ARG-S value have a non-linear ordering."]},{"title":"2.1 Subject-oriented reflexives","paragraphs":["There are languages in which the reflexives, though they must be locally-bound, can be bound only by a subject. Examples of such languages are Malayalam and Hindi, IYom India, Lango ti'om Uganda, Bahasa fi\"om Indonesia, Japanese, Korean and Russian (vd. (Pahner 1994, p. 100if) and (Manning and Sag 1995)). Example (8) is taken fYom Lango (Pahner 1994, p. ] 01).","(8) 6k616 i 6kwh6 ~klbfi/ pIrl~ kEn~i/,~l.. Okelo asked Alaba about self 'Okelo i asked Alabaj about himselfi/*j.' The solution put forward in (Manning and Sag 1995, (6)) to account tbr this particular sort of reflexives is to fbrmulate a new binding principle, the A-Subject Principle, where an a-subject is defined as the \"entity that is first in some ARG-S list\":","(9) A-Subject Principle Anaphors must be a-subject-bound (in some languages).","Deciding whether the Binding Theory should include Principle A or A-Subject Principle depends thus on the language which it is being applied to. The alternative solution I propose does not involve different formulations for binding principles or additional principles. In this solution, the Binding Theory is kept invariant. One simply has to state that, for those languages, like Lango, that have subject-oriented reflexives, the binding obliqueness hierarchy is not as sketched in (10)a., but as in (10)b.. In other words, languages may vary with regards to the configuration given to the ARG-S value. (10) a. b. [ARG - S • .......","O argt arg2 [ARG-S ( argl, ,/a~g2 argl arg3 arg n (argl, arg2, arg3,..., argn)]","•","-- '''","\"","--0 arg3 arg n {arg2, a,743,..., argn})]"]},{"title":"2.2 Chinese long-distance subject-oriented","paragraphs":["ziji Chinese ziji is a subject-oriented reflexive pronoun which does not obey either Principle B or Principle A. As illustrated in (11), ziji may be bound by an antecedent from outside or inside its 152 clause, but it cannot he bound by an antecedent which is not a subject (Xue et al. 1994, (2)).","(11) Zhangsani cong Lisij chu tingshuo Wangwu k bu xihuan zijii/j/, k. Zhangsan from l,isi place hear Wangwu not like self' 'Zhangsani beard from Lis!j [Wangwu k does not like himi/;~ j/himsel[),].' Xue, Polard and Sag (1994) discussed at, length the properties of this anaphor. The authors elucidated its particulars, namely that"]},{"title":"zUi","paragraphs":["is inherently animate, and ambiguous between a discourse pronoun and a (syntactic) z-pronoun. As at z-pronoun it obeys Principle Z (Xue at al. 1994, (38)):","(12) Princi~ Zq)rmmuns must be o-bound. Nevertheless, the authors oflbre(t no solution tbr accounting tbr the thct that syntactic"]},{"title":"ziji","paragraphs":["is subject-oriented. That solution tbllows now naturally and iinmediately from the assumption that the elements of each ARG-S value receive the non linear order of (10)b.. Principle Z alone is thus now enough to make the correct predictions about ziji as soon as the o-command relations arc established over the binding obliqueness hierarchy of multiclausal sentences displayed in (1;{), typical of languages with subject-oriented reflexives. (13)"]},{"title":"/2","paragraphs":["art] 1"]},{"title":"\\ \\ /L","paragraphs":["argl n"]},{"title":"\\","paragraphs":["Any node in the hierarchy is preceded only by subjects because in each (clausal) AR(]-S value only subjects can be less oblique than any other argument. 2.3 Reflexives in Russian passives","Binding Theory predicts that binding\" constraints on subcategorized elements may change by virtue of' the application of lexical rules. The correctness of this prediction is cont]rmed, for instance, by English passives (Pollard and Sag 1994, (]h. 6, (111)). In (14)a., John cannot bind himself. I~ ut after tim reordering of subcategorized elements by the passive rule, John can now bind himself, as shown in (14)b.. The contrast of(14) is correctly accounted t'or because John is less oblique than himself in (14)b., but it is more oblique in (14)a.. (1.4) a. *Himselfshaved,}ohn."]},{"title":"[suI ,;AT","paragraphs":["b. John was shaved by himseH: ISUBCAT (NP:,,#,'o, NI':ana}]","In cennection with this possibility for lexical rules to change obliqueness relations, it would be interesting to lind cases where lexical rules change o-command relations in a way that the result requires a branching configuration. This would be an interesting empirical confirmation of the need ibr non-linear obliqueness. One such case can be fbund in the context of Russian passives. Russian sebe is a subject-oriented refle, xive. In active constructions it may he bound only by the subject. Nevertheless, in the context of a passive sentence,, like (15), sebe can also be bound by the by-phrase (Manning and Sag 1994, (9)).","(15) l'gta kniga byla kuplena Borisomi dlja sehjai. this 1)eok.NOM was bought Boris.INSTR tbr self 'This book was bought by Boris/ {br himself}5' The subject-oriented behavior of sebe in active sentences results, like in other languages with subject-oriented reflexives, from the non-linear ordering of the elements of ARG-S value, with all argi (2 _<_ i _< n) being preceded by art1. As to passives in Russian, the lexical rule, among other things, must give a new ordering to the ARG-S wdue where all ar~i (3 _< i _< n) are preceded only by argl and art2. (1.6) Passive Rule (partial def.)"]},{"title":"[Am~-s ([~, ~J, {[~,..., [2101","paragraphs":["153"]},{"title":"2.4 Reflexives in Portuguese oblique complements","paragraphs":["Another problematic case for the current Binding Theory comes from Portuguese as it fails to make the correct predictions for binding patterns involving reflexives in the context of verbs with two oblique complements. One such verb is falar_com_acerca ('talk to about'):","(17) a. A Maria falou com o Pedro acerca do novo Director. the Maria talked with the Pedro about of_the new Director 'Mary talked to Pedro about the new Director.'","a'. A Maria fhlou acerca do novo Director com o Pedro. the Maria talked about of the new Director with the Pedro 'Mary talked about the new Director to Pedro.'","Given the linear order for the ARG-S value the current theory assumes, it is predicted that if a reflexive occurring as the oblique complement Y is grammatically bound by an antecedent occurring as the oblique complement X, then X is less oblique than Y. Moreover, it is also predicted that the reversed binding configuration, where the reflexive would occur as the oblique complement X, will be ungrammatical. These predictions are sketched in the following contrast schemata, where si prSprio is a reflexive ruled by Principle A:","(18) a. A Maria falou [PREP-X o Pedroi]oBL. x [PREP-Y si pr6priOi]oBL_ Y.","b. *A Maria falou [PREP-X si p.rSprioi]OBL_ x [PREP-Y o Pedroi]OBL_ Y","The failure of these predictions is illustrated in (19), which presents the instanciation of schemata (18). In (19)a./a'., PREP-X is made equal to corn ('to') and PREP-Y to acerca de ('about'); in (19)b./b'. it is the opposite. The pairs a./a', and b./b', simply exhibits different surfhce orders of the oblique complements in the sentence, a grammatical possibility illustrated in (17)a./a'.. In all examples the binding of the reflexive is ungrammatical 1. 1 Vd. Pollard and Sag (94), p. 264, n. 17, for a related issue in English.","(19) a. *A Maria falou corn o Pedro/ acerca de si pr6prioi. Maria talked to Pedro/about himself'/","a'. *A Maria falou acerca de si prSprioi com o Pedro/. Maria talked about himself/to Pedro/","b. *A Maria falou consigo pr6prioi acerca do Pedro/. Maria talked to himself/about Pedro/","b'. *A Maria thlou acerca do Pedro/ consigo pr6prioi. Maria talked about Pedro/to himselt~","This is another puzzle for the current Binding Theory which receives a neat solution with a branching hierarchy for the ARG-S value. In particular, the data presented in (19) receive an adequate account if the ARG~S feature of verbs like falar_com_acerca is as follows, where the two PP complements do not precede each other and a reflexive occurring in one of them cannot be bound by an expression occurring in the other: (20) a. [ARG-S (NP, {PP[com]:npro, PP[acerca de]:ana}}]","b. [ARG-S (NP, {PP[com]:ana, PP[acercade]:npro})]"]},{"title":"3 Non-linear O-command","paragraphs":["All the solutions proposed for the above binding puzzles are similar in the sense that they rest upon the same two very simple assumptions. First, the Binding Theory remains unaltered, as defined by Pollard and Sag (1994, Ch. 6) with the subsequent specifications, put forward by Iida, Pollard and Sag (1994) and Manning and Sag (1995), that the binding principles must be validated on at least one of the relevant ARG-S features. Second, the elements of ARG-S value may have a non-linear order. Giving some attention to the first of these two assumptions, it is worth noting that not only the binding principles remained unchanged, but also the formal notions used in its make-up, (e.g. the relations of o-command and o-binding) were kept unaltered. This worked fine in the examples tackled above, but it is expected that a notion like o-command, ultimately defined on the basis of the precedence relation, may need some further specification. This is so because, given the second assumption that non-linear ordering~; are acceptable, new cases must be taken into account, 154 namely those where the relevant elements do not precede each other in the hierarchy.","Consider the definition of o-command tbr linear obliqueness (simplified version, (Xue et al. 1994, (35)):","(21) (Linear) O-command X O-COMMANDS Y iffX is a less oblique coargmnent of Z that dominates Y. [n case Z=Y, X is said to LOCAI,LY o-command Y. where X is less oblique than Y iff X precedes Y in an ARG-S lisL This definition was shown to be adequate for the data considered so thr. Notice, however, that in the examples above we were mainly concerned with the validation of Principle A. Consequently, in those examples one was checking only whether a given X preceded a certain Y. For this kind of cases, having a linear or a branching obliqueness makes no difference tbr the definition of o-command as such. Now, when it is Principle B that must be validated, it must be checked whether a given element X does not locally o-cemmand another element Y. :If X and Y are not in the same ARG-S list, they do not locally o-command each other, irrespective of the option tbr a linear or a non-linear obliqueness. However, if' they are in the same list, assuming a linear or a branching obliqueness hierarchy makes a difference.","In a linear order, two cases occur: either X precedes Y or Y precedes X. 'l'heretbre, X does not o-command Y iff Y precedes X. (i.e. Y is more oblique than X). In a branching order, however, a third case also occurs: X is as oblique as Y (they do not precede each other). Therefore, we would like to have an empirical basis to ascertain whether X does not o-command Y in this case.","Suitable empirical evidence fbr settling this issue comes from the counterparts of the Portuguese examples in (19), where the rellexive is replaced by tlhe pronoun ele, ruled by Principle B. (22) presents examples where the pronoun and its antecedent occur in the same ARG-S list and they are equally oblique.","(22) a. *A Maria falou corn o Pedro/acerca delei. Maria talked to Pedro/ahout him/","a'. *A Maria t'alou acerca delei corn o Pe.dro i. Maria talked about him/to Pedro/","b. *A Maria lhlou cem ele i acerca do Pedro/. Maria talked to him/ahout l'edro i","b'. *A Maria thlou acerca do l~edroi corn ele i. Maria talked about Pedro/to him/ The ungrammatically of these examples shows that the pronoun is not locally o-free there and, consequently, it is not the case that the local antecedent does not o-command it. The data fi-om (19) and (22) present thus the empirical basis for a proper definition of o-command in non-linear obliqueness hierarchies. (19) shows that, when X and Y are equally oblique, it is not the case that X o-commands Y. (22), in turn, shows that, under the same circumstances, it is also not the case that X does not o-command Y.","Consequently, the definition of the o-command relation must be adequately specified fbr branching obliqueness hierarchies as tbllows (italics indicates the specification added to (21)) 2 .","(23) [Non-linear~ O-command","• X ()-COMMANDS Y iff X is a less oblique coargument of Z that dominates Y; X LOCALLY o-commands Y if Z=Y.","• X DOES NOT O-COMMAND Y iff X is not a less oblique coargument of Z that dominates Y and is not as oblique as Y; X does not I,OCALI,Y o-commands Y if Z=Y. Conclusions It is was shown that the accuracy of the syntax-semantics interface in HPSG grammars, in general, and the empirical adequacy of Binding Theory, in particular, are improved by allowing the ohliqueness hierarchy to have a branching configuration. Data involving subject-oriented rellexives, both in active and passive constructions, subject-oriented reflexive pronouns, and reflexives in double oblique constructions presented difficult, apparently unrelated, puzzles tbr the current Binding Theory which received a neat and unified solution under the present account. Acknowledgments i am grateful to Hans Uszkoreit and Pahnira Marrafa for their advice. This research was supported in part by the PRAXIS XX1 l'rogram of the Portuguese Ministry of Science. 2 Due to space, constraints other cases where X and Y do not precede each other but one is not as oblique as the other were not discussed in this paper. But it will be easy to check that (23) is adequately defined tbr such cases, t:br whose current analyses the improvements proposed here have no impact. 155"]},{"title":"References","paragraphs":["Borsley, R. (J987). Subjects and Complements. Technical report CSLI-107-87. Stanfbrd: CSLI Publications.","Frank, A. and Reyle, U. (1995). \"Principle Based Semantics for HPSG.\" In Proceedings, 7th Conference of the European Chapter of the Association for Computational linguistic.% Dublin. 9-16.","Iida, M., Manning, C., O'Neil, P. and Sag, i. (1994). The Lexical Integrity of' ,Japanese Causatives. ms., Stanford University, paper presented at the 68th Meeting of the Linguistic Society of America.","Manning, C. and Sag, I. (1.995). Dissociations between Argument Structure and Grammatical Relations. ms., paper presented at the Tfibingen Workshop on HPSG, July 21-23. Tfibingen.","Palmer, F. (1995). Grammatical Roles and Relations. London: Cambridge University Press.","Pollard, C. and Sag, Ii. (1987). Information-based Syntax and Semantics. Stan[brd: CSLI Publications.","PolLard, C. and Sag, l. (1994). Head-driven Phrase Structure Grammar. Stanford: CSLI Publications.","Sag, I. and Godard, l). (1994). \"Extraction of de-phrases f~om the French NP.\" In Proceedings of the North Eastern Linguistics Society, edited by Gonzhlez. Vol. 24, 519-541.","Xue, P., Pollard, C. and Sag, I. (1994). \"A New Perspective on Chinese Ziji.\" in Proceedings of the West Coast Conference on Formal Linguistics. Vol. 13, x-y. Stanfbrd: CSLI Publications. 156"]}]}