{"sections":[{"title":"Disambiguation by Information Structure in DRT Kurt Eberle * Institut fiir Maschinelle Sprachverarbeitung Universitgt Stuttgart Azenbergstr. 12 D-70174 Stuttgart Abstract","paragraphs":["~i%xt understanding and high quality machine translation often necessitate the disambiguation of ambigous structures or lexical elements. Drawing in-ferences from the context can be a means for resolving semantic ambiguities. However, often, this is an ex-. pensive strategy that, in addition, not always comes up with a clear preference for one of the alternatives. In this paper, we argue that in a number of cases deep semantic analyses can be avoided by taking into account the constraints that the alternative readings impose onto the information structure. To this end, we present a study of the arnbigous German adverb erst and point out the particular circumstances under which the given information structure disambiguates the adverb without further semantic analysis. 1 Introduction","German erst is ambigous. Consider the following","examples: (1) Peter zeigte erst auf die vierte Gliickszahl.","a) Und dann auf die zweite. (Peter first pointed to the fourth lucky number. And then to the second.)","b) Nicht zuvor auf die erste, zweite oder dlqtte. (Peter only pointed to the fourth lucky number. Not to the first, second or third.)","c) Noeh nieht aufdie Nnfte. (Peter only pointed to the fourth lucky number so far. Not yet to the fifth.) The alternative contexts a) - e) determine the meaning of the first sentence of (1) according to","*This paper describes research done within the Sonderforschunsbereich 3~0 at IMS. I would like to thank Anette Frank, Hans Kamp, Michael Schiehlen and the other members of the IMS semantics group for helpfull discussion. the disambiguating translations presented. 'rhe example testifies the following three uses of crsl:","• In the context (1.a), the recipient under-stands the introduced event as the first of a sequence of events that he expects to be completed by the following text. We call this reading: the First of a Sequence-reading (FS).","• In the context (1.b), the recipient under-stands erst as a signal of the speaker/writer that the occurrence of the reported event is not preceded by the occurrence of similar (alternative) events. We call this reading: the Exclusion of Preceding Alternatives-reading (EPA).","• In the context (1.c), the recipient under-stands the event as element of a sequence of events, and the realization of the sequence, in particular the reported realization of the event at the textual perspective time, seems to be in retardation, with regard to some (previous) expectation about the realization dates of the sequence. We call this reading: the Retardation-reading (R). As can be seen from the example, the contextual disambiguation not only is needed for understanding the text, but is a prerequisite for high quality translation.","In the literature, different lbrmalizations have been discussed ((KSn79), (LSb89), (Kgn91), (HR81) (the latter one for the similar noch and schon) and others). With respect to the focus adverb use (the cases (1.b) and (1.c); (1.a) being an example of the temporal adverb use), rnodellings are prevailing that associate ers* with different scales (cf. (I~5b89)). However, a precise evaluation of the context that can decide about the relevant reading (for instance, what information defines which scale) is still missing. We tackle this problem in the framework of Discourse Representation Theory (DRT) (Kam81), assum-ing that discourse representations (DRSs) may be augmented by information structure. 334"]},{"title":"2 The cr.d.-readings, their entailments, presuppositions and implicatures","paragraphs":["2.1 The"]},{"title":"l,'irst of a ,%qucuce","paragraphs":["intert)re, tation Ill this paper, we cmmu)t go into detail with tests that partition tile meaning of a sentence into presui)positions , assertions proper and inlplicatures the recipient is allowed to drmw from the sentence"]},{"title":"(of. (Lev8a)","paragraphs":["for ~m overview of the notions used, the tests associated with them and the problems connected to them). We directly come up with tile I)RSs that, to our opinion, represc.nt the impact of the different remdings. We begin with the FSeeading of (1):"]},{"title":"(1 .a)","paragraphs":["~7t77~ ~['P(t) t -4 now e: zeig~~) e starts e llere, TP stands for the actual (past) temporal perspective that holds for the given utteranee/te×t sil;uation. With respect to the representation and resolution of presuppositions in DR/F, we relate to (vdS92). We slightly deviate from the approach suggested there, however, in that we use a notation for the llresui)position triggers that is akin to the suggestion of(BgS + 94): we use so-calle<["]},{"title":"~-condilions","paragraphs":["which describe the presupposed objects and their characterization. In our framework (,-conditions sllhsHlrte (tilDrent types of i)roje.ction problems. The type is characterized by the r.>in(tex"]},{"title":"(prcsp","paragraphs":["strands for 'classical' presuppositions,"]},{"title":"dcf","paragraphs":["for detlnite"]},{"title":"descriptions, rt","paragraphs":["for referettce tilne: ~\"e ['or re['ereucx~ event et(:.~ cOm|lare (1%e95) for an overview). This index triggers the projectiou routine that is sl)ecific to the respective resolution l>robhm,. The first argument of the condition schema highlights the distinguished discourse referent (I)I{F) of the structure to be projected, t The representation, thus, requires a definite description style resolution for the x that ix characterized as a"]},{"title":"fourth lucky number","paragraphs":["(with respect to the given setting, x together with its description will he accomodated at the main level I)R.S), and it pre.supposes a reference event c' such that the senteuce (;vent c is the tirst event of m possible elabormtiou sequence of c' (cf. (Ebe92) ['or the computation mad storing of discourse relm-","I As regards delhtite descriptions, the distinguished t)I{.F is the l)l{.]\" of the heard [(oull; in a.tty case it is the I)RF the r~-information is (:entered a.round.","Modeltheoretic~d[y the rel~ttion between the presuppositional p~rt ~md the asse.rtional part of a DRS can be seen as a function from information states into information st~ttes, see (Kam95). tions like"]},{"title":"elaboration).","paragraphs":["2.2 The"]},{"title":"Exclusion of Preceding Alternatives","paragraphs":["interpretation In tile EPA-reading,"]},{"title":"crsl","paragraphs":["is used ms a focus mdverb, i.e. it structures its argument into focus and background. In the following representation of (l), wc consider the case where the numeral ix focused only, not the NP containing the numeral or the entire event description in the scope of"]},{"title":"crM: (t %","paragraphs":["peter now ~.~.,Te4 TP(t) t -4 now"]},{"title":"P","paragraphs":["e: zeigen_auf(peter,x) e(at 1~ = \":--t ek"]},{"title":"A","paragraphs":["i=k--I f=l (e i -4 ei+t)","A/=k--1 Pi ~O Pi+I i=l e C e4 ]4 .... ..g . ( , ( , !"]},{"title":"imp~t.',l","paragraphs":["*: AT'r({,<I,~XI',| now -4 ~-l>) Besides the assertion that Peter points to the fourth lucky number at the temporal perspective t, the representation presupposes a sum l!', con-. sisting of a sequence of events el - ek that are related via a non fln'ther specified relation 1{. to l)redicates I'~ - l)~. These It'; are required to be alternatives of the event descriptiou in the scope of"]},{"title":"crst","paragraphs":["(whic.h is called/~ e. I)RS~). In this paper, we cannot go into detail with the computation of the alternatiw:s of event descriptions. Pi 6 ALTD,t&, where"]},{"title":"AlfF,)ltS ={Ac. Dte,c;~[~,~o(:o,(~t~s,OtO] ] Q AlfI'(l\"O(7~,t(l)R.,~e))},","paragraphs":["sketches the claim that the Pi are (;vent descriptions that develop fl:om Ae.I)RS~ by exchanging the focused element by an ,,lte,',,ative (Conq, are (,~.oo85), (l~.oo.(~2)ror the underlying focus theory and (BE95) for an algorithm that calculates the concrete alternatives). As mentioned, the focused elemeut, which is marked by the underline, is assumed to be the numeral adjective. This choice triggers the structuring of the Ps into the brockground event type"]},{"title":"$c.13AO(I)[L%.)","paragraphs":["(which is k e. ~2.uf(petetlx ) ]) and the fo(:used semantic constituent"]},{"title":"lx.l;~O(/(DR,S'e)[4l n]","paragraphs":["(which is 335"]},{"title":"I I\" ]","paragraphs":["AX. O~def(X, nte-~liicksze~hl(x) ]) ' where n is a number from the set of alternatives of 4). The relation R has to be understood as characterizing the e i as opportunities for Peter to point to (specific) numbers. In (1), these opportunities may be situations that Call be described by:"]},{"title":"The firsle~ / second~ / lhird~ number is presented to Peter.","paragraphs":["Tile order of the oppertunities is inherited from the order of the Ps, -<o, which conforms to the intrinsic order of the set of Mternatives of the focused element (i.e."]},{"title":"O=order(ALT(FOC~.I(DI~S~)))).","paragraphs":["In (1), this is the canonical order of the numbers.","The negation test, which is comlnonly used to detect presuppositions, supports these strueturM assumptions.","Now, we think that the EPA-reading interpretes tile asserted event, which is backed by the described scenario, as the lirst one that; is indeed realized within the range of possible instantiations that the sequence of opportunities provides, i.e. the asserted event presents the first positive out-come to tile test about the instantiation of the"]},{"title":"Ae.BAC(DRS~)-type","paragraphs":["that is connected to the ei-sequence, where each test situation el is characterized by its own specific additional test criterion"]},{"title":"kx. F O(;(1) I£Se )[41n] '2","paragraphs":["Further linguistic tests, that we must omit here, support the assumption that the information about the negative tests is an entailment. Therefore, in the representation, the negated DRSs for the pointing-opportunities el - e3 are part of the main DRS.","In the literature the representation of the fo- ('using use of"]},{"title":"ersl","paragraphs":["(and corresponding uses of"]},{"title":"noch and schon)","paragraphs":["often comprises the information that tile reported reMization of the event is earlier or later (depending on the reading and the adverb) than the speaker/writer and/or the recipient (or even a third person) would have expected. We think that such an expectation, in the case of the EPA-reading of"]},{"title":"erst,","paragraphs":["is only optional. Following (K6n91), we think that, if present, it is not a presupposition but a conventional implicature. In (1.b), we use the specific"]},{"title":"c~i,,~,l-format","paragraphs":["and the representation convention of (Ram95) for attitudinal states in order to express the EPA-expectation of a previous test to be successful. 2.3 The"]},{"title":"Retardation","paragraphs":["interpretation As for the EPA-reading, we consider the case where tile numeral is focussed only:","2Depending on the tocus structure of tile phrase in the scope of"]},{"title":"erst","paragraphs":["in (1) and depending on the contextuM restrictions of the admissible alternatives, other sets of Ps might result. It is clear that depending on this choice, the focus conditions may characterize a thematic role., as in the described example, or the event wriable. It is ~dso clear, as we will argue in the next section, that not all of these sets of alternatives can accept the El~A-reading. (1.c) peter now e t TP(t) t -4 now x e: zeigen_auf(peter,x) e@t OZpresp(S, s:ATT(x , , <MODE, eE"]},{"title":"Ai=k","paragraphs":["--1 i=1 (el -< ei+l)"]},{"title":"AI: P,(°,)","paragraphs":["i=1 MODE=PLAN X=peterlA i realization_of(e,e4)"]},{"title":"I 1, o I'\" ] /","paragraphs":["F~ ~j3 e ~J = i=1 i A:-?"]},{"title":"reMiz~ti°n-°f(ei',eO","paragraphs":["S ineets e'l el' ~ e2' ~ e3' -~ e ...... optional or probably obfigatory .....","Ottmpl(. ~ :A'PT(~ <lt ],:L, I~*l > 4 ) In contrast to the EPA-reading, we assume that, in the R-reading, the predicates Pi that we obtain from the information structure of the"]},{"title":"erst-","paragraphs":["argument are not related to a sequence of opportunities for doing something, but describe events ei of an expectation about the ongoing of the world or a plan e. The context (1) doesn't provide fin:- tiler information about the identity of the person or persons X to whom the introduced attitudinal state has to be ascribed, to the speaker/writer, to the recipient, to Peter, to someone else or to some group of salient people. Also it doesn't provide information about the nature of the attitude MOI). The conditions that are introduced below the clotted line exemplify possible resolutions. According to this, Peter and the speaker/writer (i for the distinguished I)I{.F for the self) share the attitud(; of having a plan for realizing //. Such resolutions may be available by an inference component that operates over richer contextual knowledge. Ag~fin, tile order of the Pi and tile corresponding ei is in-ferred from the implicit or(ler of the alternatives of the focused element, l,'rom this setting and the assertion of an occurrence of"]},{"title":"Peter pointing to the fourth lucky number","paragraphs":["at the temporal perspective t, the representation entails reMizations of those events of the presupposition line that precede the counterpart of e in the presupposed sequence. As a further (possibly optionM) constrain|;, the l~-reading introduces the implicature that a noi~ further specified person or grout) ~ cx-336 petted h)r the perst)ective time t that the plamtcd or expected sequence of events shouhl be realized to a greater degree. Without further information about the identity of ~, it is ditllcult to say some-thing more precise about the temporM location of the ~-expectation than that an instance s' of the corresponding attitudinal state holds at some time I)efore the actual now."]},{"title":"3 Disarnbiguating Criteria","paragraphs":["3.1 Tim Syntax Criterion In (.;crman focus adverl)s cannot be topicMized as such, i.e. they cannot occur in the vorfeld position without an accompanying constituent (cf. (KSn!)l)). If th('. sentence s|n)ws such a topicalization o[' ersl-- which is marked by the inversion of the basic Subj-Vlin-order - ersl can only be used as a time adverb, i.e. its meaning can only be the li'S-reading, as exemplitied by (2): (2) Erst g'ab Peter Maria den Brief.","(First, l)(!ter handed the letter to M~ri;t.) 'Fhus, this tyt)e of topicMization disambiguates between the I,'S-reading ou the one hand and the El'A- and R-reading on l,hc~ other. Whether there are other synta('tic criteria that further (lisam 1)iguate 1)etween the thre.e readiugs Mso del)ends on tire structnral description assigned to th(' focus l)article use. There are suggestions of analysing focus adverbs as syntactic co-coustituents of their feet, and there, are suggestions for analysing them only as co-(:onstitu(mts o[' the verb or its projections (see (Bay85), (Bay88), (,lac89), (.lac84), (K5,,91) among others for a discussion). We have nothing sf)eciiic, to say about this here. We just note that, under the conuno,, assuml)tion that the vorfeld in (h'.rmau introduces at most one constituent and under the ensuing assuml)tion that ['ocus adverbs modify tht'ir loci, in sente.nc(;s like (3), crsl must 1)e interpret('d as focus adverl). (3) Iqrst den Ib'ief g'ab l'ctcr Maria.","(l>eter only h~tnded the. letter to M~trim) As concerns the I,'S-reading, we add that, provided it is syntactically licensed, this reading is strongly supported if the sentence $2 following the (r,sl-sentence S1 contains an adverb of temporal succesio,t (like d,L,zn/thcn, dauach,/after thi.s etc.) that rood|lies a verbal projection of similar tense and in lbl'mation strut:tm:('~ as th(: crsl-argument. This latter heuristics is expensive howew~r, in that it checks extra-sententiM information. The following criteria avoid this. a.2 Th(,. D)cus-Backgr()und Criterion If the asstLlnption of s(;ction 2.2 is true thai, it] the I!;I)A-sccnario the |)ackground event type is tested for specitic reMizations, it is natural to think of this scenario to be reasonably con(:eptualizt~d ouly if the, I)ackg;rouud eveut type merits testing. This is not the case it ~ there is no background event I;ype at all (i.e. Ae.IiA6'(I)ItS~) is the most geucral event predicate). There, is no backgrouud ew'nt type if the entire argument of erst - the verb or a verbM projection - is in focus, or, though not in focus, the verb does not curry enough substance in order to provide an event type: this is the case for the COl)ula without; the t)redicativc ('olrtl)]elneHl.. Instead of technically working out l,he criterion, we content ourselves with sore(; motivating exampies whi('h are critical in this resl)ect. It, order to avoid interfering effects from the syntacti(\" structure that might eoutplicate matters with regard t.() deterntine the SCOl)e of crsl, we only list examples with verb tinM l)osition. In (4), the parentheses mark the argument of crst, the brackets an notated by F the focus elen,ent fi'om which the semantic focus constituent is deveh)pe(l. As an example, (4.a) and (4.b) present their resulting structur(:d event types. We t)lnit this r~ther cmlonicM structuring for the other examples. (4) I'etra war {ibc.rrascht, wcil","(l'etr~t w*ts surpris(M Imca, use)"]},{"title":"a) (,,'st (i,, wa,')","paragraphs":["b) l',,tcr cr, t (i,, [St,,ttg'art]r"]},{"title":"a,,w('.s~,,,,l","paragraphs":["wa, 9","t (being in fituttg~u:t/ I)eing pl'eSeltt itl ,qtHttga.rt)"]},{"title":",:) os erst a,9 *O':Pa) d) cs erst (it, [,~tuttgart],,, 12.00 wa,9 (El'A)","paragraphs":["(being 12 Cclock / bt',ing [2 o'do(:k iu Stuttgart) c) l'etcr c,'st ([arbeitctc],., ) *(l';l'a)"]},{"title":"t)","paragraphs":["Peter crst"]},{"title":"(i,, [St,,ttgart]r arbeitct@ (lqPa)","paragraphs":["(working in Stuttgart) The indications (El'A)and *(El'A)mean that o,e cmJ conceive contexts that allow tbr I')I)A or that (me can not. Without fllrther comment, we thiuk that the criterion is cent|trot'x[ by the data.","l\"ocns- 13ackgr(mnd-cr] terion : The F,l~A-reading is ac('(;l~tM)h~ only if the SCOl)C of c, rst is structured into focus and bac.kgrouml in such a way that the background is a specitic event type. 3.3 The T(:nqmral Location Crlte.ri(m 'l'he R-reading i)resul)poses a sequence of events (concel)tuMized as a plan or an expectation about the ongoing of the world) and it assumes that, fl'om the t)erspective of the contextual l)ersl)eCl, ive time, a part of the sequence is reMized, at.cording to the ordering of the plan or expectation. The rel)orted event refers to the event of the presul)l)O sition line that marks the boundary l)(%wcen the instantiated nnd tire nol>instantiated event coucepts, and it; does this in right the satlle way as delinite descriptions do with resl)ect to their mltecedents. Now, if this is true and it' the ev(ml; descrit)tion contains a teml,orM location hi t.hc focus, this information cannot be used att,'ibu tively, because it contributes to the antecedenL de 337 scription and to the distinction of this antecedent fi'om its alternatives. Because of this setting, it acts as a restriction on the referring expression that helps to pick up the right antecedent from the presupposition line. This means that, against the background of the presupposition, this information is not new. We add that nothing of the ersgargument is new information against this background. New is the information about the progress of the instantiation of the presupposed event concepts. But then, stating that an event of the corresponding antecedent type indeed was realized (the assertional impact of the R-reading), and stating that it occurred at a time as was expected (consequence of the specific description of 'antecedent' and 'anaphor'), and simultaneously insinuating that it could have been realized earlier (presuppositional structure of the R-reading supported by intplicature) results in a contradiction. This, to our opinion, seems to be the explanation of why the I{-reading is not possible in case the description in the scope of"]},{"title":"erst","paragraphs":["comes with a temporal location in the foens. Compare the following examl>les to this end. (5) Petra war"]},{"title":"iiberrascht, well a) Peter","paragraphs":["erst"]},{"title":"On [Stuttgart]]+, war) (R) b) Peter erst (urn [12.00]v in Stuttgart war)*(R)","paragraphs":["(5) confirms what we have said so far. Note, by the way, that the features of the Focus-Backgronnd-criterion are not characteristic of the R-reading.","What about temporal locations in the background part? At first glance, it seems that what we have said above applies to this case also. How= ever, there are some (relatively marginal) cases that possibly contradict to this assumption. The following example (6) is an instance of this: (6) ..."]},{"title":"well","paragraphs":["Peter"]},{"title":"erst (in [Mfinchen]v um 3 ein Bier getrunken hat)","paragraphs":["(be¢:anse only in Munich, Peter drank a","beer at tt~ree (so fa~))","In a context that; continues this information, for","instance, by"]},{"title":"und noch nicht in Kb'ln (am ndchsten 7'ag) um 3 / and not *,let in (Jolo.qne (lhe next day) al 3","paragraphs":["the R-reading seems acceptable. Because of the granularity of the presuppositional event sequence that develops from the presupposition constrnction in such cases - in (6), the iteration must satisfy to a one-day-rhythm at least- the temporal adjunct cannot truly"]},{"title":"act,","paragraphs":["as a restrictive referential constraint, and becanse of what we have said above about novelty, it is not the best attributive information also. This may explain why the example is felt to be a bit odd. The decisive feature, however, why the above argumentation for the in-compatibility of the R-reading and the presence of temporal localizations does not go through, is the fact that the background temporal localization does not uniquely [ix the occurrence time of the event with regard to the time fralne of the presupposed plan or expectation. This, of course, is so, only if the localizing predicate allows for multiple (periodic) instantiation. (Times of day allow for this, also adjuncts like"]},{"title":"after lunch","paragraphs":["etc.). We stress that what we have said relates to","temporal adjuncts in tile scope of"]},{"title":"erst.","paragraphs":["The following (7.a) allows for the R-reading, because the most natural analysis gives wide scope to the temporal adjunct, i.e. the sentence is analysed like (7.h), where clearly, the adjunct serves to localize, the temporal perspective. (7) a) Erst"]},{"title":"in Miinchen","paragraphs":["war er gestern."]},{"title":"b) well","paragraphs":["er"]},{"title":"g estern erst in Miin&en war.","paragraphs":["(yesterday being in Munich) We have considered only temporal adjuncts so far. The alternative temporal localization that occurs in the scope of"]},{"title":"erst","paragraphs":["is the construction 'COl>= ula + predicative temporal expression', which accepts the R-reading. Examples are (4.c) and (4.d). We skip the complete explanatory argument here and just say that (grosso mode) the function of the copula construction is to synchronize calendar knowledge (also information about different calendars: R-reading of (4.(1)) with the actnM available perspective times, whereas the function of the temporal adjunct is to relate the descibed event to some predefined time. We take it for granted, that this difference is the reason why the decisive conflict that we mentioned fllrther abow'~ only arises if the temporM location is introduced by modification, i.e. in case it is introduced by an adjunct.","We retain the following criterion: Temporal-Location-criterion: The R-reading is acceptable only if the focus constituent of the scope of"]},{"title":"erst","paragraphs":["does not contribute a temporal localization (by modification of a basic event type). In addition, the scope must not contain an adjunct - focused or not - that is a uniquely referring temporal location (like"]},{"title":"yesterday).","paragraphs":["3.4 The Entaihnent Criterion Compare the following examples: (8) ..."]},{"title":"well a) Toml, a ~id~ er~t (a, aer [St,'eif~,lml,~tte IF disqualigizierte).","paragraphs":["(T. disqualified himself at the S.)"]},{"title":"*(R),(EPA) I,) erst ([drei ]F Unterschriften genfigten).","paragraphs":["(three signatures were sntticient.)"]},{"title":"*(R),(gI°A). e) Peter erst (","paragraphs":["[vier ]r"]},{"title":"Angestellte kannte).","paragraphs":["(P. knew font' employees.)"]},{"title":"(I{),*(EeA)","paragraphs":["(8.a) cannot have the R-reading. Why? The in-telligent construction of the presuppositional sequence of events for the H.-reading outputs a number of disqualification events that are located al; particular places of the Ilahnenkamm downhill race in Kitzbfihel. What is specific with this sequence is the fact that the postconditions of any of these events are snch that the preconditions of the successive events never can hold. Therefore such a sequence can never be a reasonable plan or 338 a reasonable: expectation el)out a <townhil] race. I.e. a constitutive element of the R-reading cannot h(; constructed in this ease. In (8.1)) the descrip-- tions of subsequent events (states in this case) of the presuppositional line are more gcnerM predicates than the description of the predecessors, i.e, each such sequence collapses in its tirst element in essen<;e. This cannot truly he called a sequence. With (8.c), we encounter, so to speak, the symmetric picture with regard to the El)A-reading:"]},{"title":"t(no'wing n employees","paragraphs":["entails the previous|y tested"]},{"title":"knowin( t n-[ cmployccs.","paragraphs":["'l'he exl)('<'tation of some l)rOl)osition p t;o be true in a specific situation s,~ cannot t>e falsilied, in case the wdidity of a parti<:- ular prol)osition (1 in the subsequent test situation s~+l confirms the wdidity of p.","We retain the following criterion: I';ntailment-criterion : For the I{,:reading to l)e acceptable, first, the l)ost: conditions of each event of the t>resupt)ositional line must he compatible with the preconditions of the successor and s<;cond, (at least for homo-. geneous deseril>tions) the description of an event must not subsmne the des<'ril)tion of the following (:Velits. [,'or the I,;I)A-reading to l>e acceptable, (at least for homogeneous descriptions) the event descril>- tion tested at a situation must not subsume the previously tested evt'Att description. There are refinements of this criterion that we tnust omit here."]},{"title":"4","paragraphs":["Final Remarks 'l'he four criteria of the last sectiou can be used in order to exclude readings <)f"]},{"title":"crsl.","paragraphs":["I1; is <)nly the last (entailment) <;ritel:ion that necessitates some economic semantic infcrencing, The <)t, hcrs c<)rrespon<l more<>v less to +~structural lookup. Using I;he convincing structural interd<:t>endencies thai; (Liib89) shows for a subset of the German focus adverbs containing"]},{"title":"crsl,","paragraphs":["the generalization of tire approach suggested here to other ambiguous ad: verbs seems very promising. References J. Bayer."]},{"title":"Adiazenz","paragraphs":["und Kettenbildmlg. Bemerkungen zur Syntax der (leui;s(:hen (fred= partikch,, 1985. (ms.)Max-lqanck-lnstitut f/Jr l)sycholinguistik.","J. Bayer. Rightward movement and the syntax of <luantilicational particles in German. In V. I{oscn, editor,"]},{"title":"l'apcrs fl'om the 7'cnth Scandinavian Conference of Linguistics 1,","paragraphs":["Bergen, Norway, 1988.","l)el;er I. Blok and Kurt Eber|e. What is the alternative. In Peter Bosch and Rob wm der San(It, e<litors,"]},{"title":"[\"ocus and Natural Language Process: ing, Proceedings of the Interdisciplinary","paragraphs":["Con:"]},{"title":"J'crence in Cclcbration of the lOth Anniversary of the","paragraphs":["Journal of Semantics. IBM, [leidelberg, 1995.","J. Bos, E.Mastenbroek, S.M(.Gias~an, S.Millies, and M.Pinkal. The Verbmobi[ semantic formalism. VM report 6, Universit'~t des Saarhmdes, 1994.","Kurt Eberle. On rel)resenting the temporal stru(> ture of a natm'a[ language text. In"]},{"title":"Proceedings of Coling92,","paragraphs":["Nant<;s, 1992.","Kurt Eberle. Zu einer Setnantik [iir I)ialogverstehen und Ubersetzung. Verbmobil-l(,el)ort, 8;I, U niversitaet Stuttgart, 1995.","Jakob Hoel>ehnan and Christian tl,ohrer. I{e-marks on"]},{"title":"noch","paragraphs":["and"]},{"title":"cohen","paragraphs":["in (lerman."]},{"title":"Syntaa: and Semantics,","paragraphs":["14:10f{ 126, 1981. J. Jacohs. '['he syntax of bound focus in German."]},{"title":"(;roninqcr Arbciten zur Gcrmanistischcn Linguislik, 25:172 200,","paragraphs":["1984. .1. Jacobs."]},{"title":"l\"okus und Skalcn. Zur Syntax und Scmanlik dcr (D'adparlikeln im Deulschcn.","paragraphs":["Niemeyer, Tiibingen, 1989.","Ilans Kaml). A theory el' truth and semantic rel)- resentation. In J.A.G. (Iroenendijk, T.M.V. Janssen, and M.ILJ. Stokhof, (~(litors,"]},{"title":"l\"ormal Methods in the Study of Languagc.","paragraphs":["Mathematical (~entre Tract, Amsterdam, 1981.","Hans Kemp. Some elements of a 1)[~SP-based the ory of the representation of mental states and verl>al comnmnication. (ms.), I MS, Universit:~t Stuttgart, 1995.","Ekkehard K6nig. A sen,antic analysis of (h~rnmn 'erst'. In Raincr llihlerle, U. Egli, and Aruim wm Stechow, editors,"]},{"title":"Semantics firm DiJ.fcrcnl Points of Vie'w,","paragraphs":["pages 1d8 160. Springer, Berlin,[[eidelberg,New York(lbkyo, 1979. Ekkehard K6nig."]},{"title":"7'hc Meaning of I\"ocus l'articlcs: A Comparative Perspective.","paragraphs":["I~outle(lge, London, New York, 1991. Stephen (I. I,evinson."]},{"title":"Pragmalics.","paragraphs":["Canfl>ri(lge (hfiversity Press, (;ambridge, New York,"]},{"title":"1,()83.","paragraphs":["Sebastian 1,5bner. Schoil - erst-noch: An integrated analysis. In Werncr Abraham, editor,"]},{"title":"Discourse Parliclcs,","paragraphs":["pages 85 140. Niemeyer, 'l'iibingen, 1989.","Mats E. I/=oot, h."]},{"title":"Association with t,'ocus.","paragraphs":["Phi) thesis, University of Massachusetts at Amherst, 1985.","Mats E. Rooth. A theory of focus interpretation."]},{"title":"Nalural Language ,qcmanlics,","paragraphs":["1(1):75"]},{"title":"117,","paragraphs":["1992.","Roh van der Sandt. I)resupposition projection its anaphora resolution."]},{"title":"Journal of Sam.antics,","paragraphs":["9(4), 1992. 339"]}]}