{"sections":[{"title":"USABLE, REAL-TIME, INTERACTIVE SPOKEN LANGUAGE SYSTEMS John Makhoul and Madeleine Bates makhoul@bbn.com, bates@bbn.com BBN Systems and Technologies 70 Fawcett St. Cambridge, MA 02138 1. PROJECT GOALS","paragraphs":["The primary objective of this project is to develop a robust, high-performance, domain-independent spoken language system. This system, termed HARC (Hear and Respond to Continuous speech), is composed of the BYBLOS speech recognition system and the DELPHI natural language understanding system. The goal is to develop systems that exhibit the following advances: high-accuracy"]},{"title":"speech","paragraphs":["understanding with a vocabulary of up to 10,000 words; a highly interactive user interface; adaptability to new users; easy portability to new applications; a system implementable in real-time on cost-effective COTS (commercial, off-the-shelf) hardware."]},{"title":"2. RECENT RESULTS","paragraphs":["During the last year, we have: Designed and developed an initial implementation of, and began experimenting with, HUM, a Hidden Understanding Model. HUM is a new statistical model of semantics which will enable us to carry out studies in the alignment of corpora to semantic interpretations. The ultimate goal of HUM is to achieve understanding comparable or superior to other approaches, but using an automatic process to correlate words with meanings (instead of depending on hand-crafted semantic rules). Made a number of improvements sin DELPHI, including expanding the coverage of the Semantic Linker, improvements to quantification module, the implementation of sub-grammars, improvements in the handling of conjunctions, and the production of interpretations in the language FMRL (Flattened MRL) instead of older-style MRL.","• Ported our ATIS development system to the HP735 machine to allow faster turn-around time for development.","• Collected additional ATIS data for the general community, using our real-time system and the new, expanded database.","• Delivered a version of our interactive ATIS system to NIST which they subsequently used for successful data collection. Improved the recognition accuracy for new words that were not in the speech training, and made the speech language model more robust to different phraseology. Made improvements to our real-time ATIS demo system and ATIS speech models, to improve usability and robustness. Improved the discourse component of DELPHI, making it better able to handle the sorts of task constraints which speakers impose in spoken interactions. Participated in discussions aimed at defining and developing semantic evaluation metrics. We made a proposal for the predicate-argument structure component of SemEval that is under consideration by the SemEval committee. Made plans to port HARC to a new domain, involving an unclassified database similar to one in use at Rome Laboratory. Participated in the December 1993 ARPA speech, NL, and SLS evaluations. Participated in various APRA committees."]},{"title":"3. PLANS FOR THE COMING YEAR","paragraphs":["Continue the development of the Hidden Understanding Model. Development of aids to technology transfer. Improvements to search algorithms for speech recognition which allow fighter integration of knowledge sources (such as higher-order grammars) to improve real-time recognition accuracy without sacrificing speed. Port HARC to the Rome Laboratory domain. Participate in the planning and development of the ATIS4 task and new evaluation methodology."]},{"title":"447","paragraphs":[]}]}