{"sections":[{"title":"","paragraphs":["Tutorial Abstracts of ACL 2012, page 2, Jeju, Republic of Korea, 8 July 2012. c⃝2012 Association for Computational Linguistics"]},{"title":"State-of-the-Art Kernels for Natural Language Processing Alessandro Moschitti Department of Computer Science and Information Engineering University of Trento Via Sommarive 5, 38123 Povo (TN), Italy moschitti@disi.unitn.it Introduction","paragraphs":["In recent years, machine learning (ML) has been used more and more to solve complex tasks in different disciplines, ranging from Data Mining to In-formation Retrieval or Natural Language Processing (NLP). These tasks often require the processing of structured input, e.g., the ability to extract salient features from syntactic/semantic structures is critical to many NLP systems. Mapping such structured data into explicit feature vectors for ML algorithms requires large expertise, intuition and deep knowledge about the target linguistic phenomena. Kernel Methods (KM) are powerful ML tools (see e.g., (Shawe-Taylor and Cristianini, 2004)), which can alleviate the data representation problem. They substitute feature-based similarities with similarity functions, i.e., kernels, directly defined between training/test instances, e.g., syntactic trees. Hence feature vectors are not needed any longer. Additionally, kernel engineering, i.e., the composition or adaptation of several prototype kernels, facilitates the design of effective similarities required for new tasks, e.g., (Moschitti, 2004; Moschitti, 2008)."]},{"title":"Tutorial Content","paragraphs":["The tutorial aims at addressing the problems above: firstly, it will introduce essential and simplified the-ory of Support Vector Machines and KM with the only aim of motivating practical procedures and interpreting the results. Secondly, it will simply describe the current best practices for designing applications based on effective kernels. For this purpose, it will survey state-of-the-art kernels for diverse NLP applications, reconciling the different approaches with a uniform and global notation/theory. Such survey will benefit from practical expertise acquired from directly working on many natural language applications, ranging from Text Categorization to Syntactic/Semantic Parsing. Moreover, practical demonstrations using SVM-Light-TK toolkit will nicely support the application-oriented perspective of the tutorial. The latter will lead NLP researchers with heterogeneous background to the acquisition of the KM know-how, which can be used to design any target NLP application.","Finally, the tutorial will propose interesting new best practices, e.g., some recent methods for largescale learning with structural kernels (Severyn and Moschitti, 2011), structural lexical similarities (Croce et al., 2011) and reverse kernel engineering (Pighin and Moschitti, 2009)."]},{"title":"References","paragraphs":["Danilo Croce, Alessandro Moschitti, and Roberto Basili. 2011. Structured Lexical Similarity via Convolution Kernels on Dependency Trees. In Proc. of EMNLP.","Alessandro Moschitti. 2004. A Study on Convolution Kernels for Shallow Semantic Parsing. In Proceedings of ACL.","Alessandro Moschitti. 2008. Kernel Methods, Syntax and Semantics for Relational Text Categorization. In Proceedings of CIKM.","Daniele Pighin and Alessandro Moschitti. 2009. Efficient Linearization of Tree Kernel Functions. In Proceedings of CoNLL.","Aliaksei Severyn and Alessandro Moschitti. 2011. Fast Support Vector Machines for Structural Kernels. In ECML.","John Shawe-Taylor and Nello Cristianini. 2004. Kernel Methods for Pattern Analysis. Cambridge Univ. Press. 2"]}],"references":[{"authors":[{"first":"Danilo","last":"Croce"},{"first":"Alessandro","last":"Moschitti"},{"first":"Roberto","last":"Basili"}],"year":"2011","title":"Structured Lexical Similarity via Convolution Kernels on Dependency Trees","source":"Danilo Croce, Alessandro Moschitti, and Roberto Basili. 2011. Structured Lexical Similarity via Convolution Kernels on Dependency Trees. In Proc. of EMNLP."},{"authors":[{"first":"Alessandro","last":"Moschitti"}],"year":"2004","title":"A Study on Convolution Kernels for Shallow Semantic Parsing","source":"Alessandro Moschitti. 2004. A Study on Convolution Kernels for Shallow Semantic Parsing. In Proceedings of ACL."},{"authors":[{"first":"Alessandro","last":"Moschitti"}],"year":"2008","title":"Kernel Methods, Syntax and Semantics for Relational Text Categorization","source":"Alessandro Moschitti. 2008. Kernel Methods, Syntax and Semantics for Relational Text Categorization. In Proceedings of CIKM."},{"authors":[{"first":"Daniele","last":"Pighin"},{"first":"Alessandro","last":"Moschitti"}],"year":"2009","title":"Efficient Linearization of Tree Kernel Functions","source":"Daniele Pighin and Alessandro Moschitti. 2009. Efficient Linearization of Tree Kernel Functions. In Proceedings of CoNLL."},{"authors":[{"first":"Aliaksei","last":"Severyn"},{"first":"Alessandro","last":"Moschitti"}],"year":"2011","title":"Fast Support Vector Machines for Structural Kernels","source":"Aliaksei Severyn and Alessandro Moschitti. 2011. Fast Support Vector Machines for Structural Kernels. In ECML."},{"authors":[{"first":"John","last":"Shawe-Taylor"},{"first":"Nello","last":"Cristianini"}],"year":"2004","title":"Kernel Methods for Pattern Analysis","source":"John Shawe-Taylor and Nello Cristianini. 2004. Kernel Methods for Pattern Analysis. Cambridge Univ. Press. 2"}],"cites":[{"style":0,"text":"Shawe-Taylor and Cristianini, 2004","origin":{"pointer":"/sections/1/paragraphs/0","offset":606,"length":34},"authors":[{"last":"Shawe-Taylor"},{"last":"Cristianini"}],"year":"2004","references":["/references/5"]},{"style":0,"text":"Moschitti, 2004","origin":{"pointer":"/sections/1/paragraphs/0","offset":1084,"length":15},"authors":[{"last":"Moschitti"}],"year":"2004","references":["/references/1"]},{"style":0,"text":"Moschitti, 2008","origin":{"pointer":"/sections/1/paragraphs/0","offset":1101,"length":15},"authors":[{"last":"Moschitti"}],"year":"2008","references":["/references/2"]},{"style":0,"text":"Severyn and Moschitti, 2011","origin":{"pointer":"/sections/2/paragraphs/1","offset":142,"length":27},"authors":[{"last":"Severyn"},{"last":"Moschitti"}],"year":"2011","references":["/references/4"]},{"style":0,"text":"Croce et al., 2011","origin":{"pointer":"/sections/2/paragraphs/1","offset":205,"length":18},"authors":[{"last":"Croce"},{"last":"al."}],"year":"2011","references":["/references/0"]},{"style":0,"text":"Pighin and Moschitti, 2009","origin":{"pointer":"/sections/2/paragraphs/1","offset":257,"length":26},"authors":[{"last":"Pighin"},{"last":"Moschitti"}],"year":"2009","references":["/references/3"]}]}
