{"sections":[{"title":"","paragraphs":["Proceedings of the 50th Annual Meeting of the Association for Computational Linguistics, pages 184–193, Jeju, Republic of Korea, 8-14 July 2012. c⃝2012 Association for Computational Linguistics"]},{"title":"Bootstrapping a Unified Model of Lexical and Phonetic Acquisition Micha Elsner melsner0@gmail.com ILCC, School of Informatics University of Edinburgh Edinburgh, EH8 9AB, UK Sharon Goldwater sgwater@inf.ed.ac.uk ILCC, School of Informatics University of Edinburgh Edinburgh, EH8 9AB, UK Jacob Eisenstein jacobe@gmail.com School of Interactive Computing Georgia Institute of Technology Atlanta, GA, 30308, USA Abstract","paragraphs":["During early language acquisition, infants must learn both a lexicon and a model of phonetics that explains how lexical items can vary in pronunciation—for instance “the” might be realized as or . Previous models of acquisition have generally tackled these problems in isolation, yet behavioral evidence suggests infants acquire lexical and phonetic knowledge simultaneously. We present a Bayesian model that clusters together phonetic variants of the same lexical item while learning both a language model over lexical items and a log-linear model of pronunciation variability based on articulatory features. The model is trained on transcribed surface pronunciations, and learns by bootstrapping, without access to the true lexicon. We test the model using a corpus of child-directed speech with realistic phonetic variation and either gold standard or automatically induced word boundaries. In both cases modeling variability improves the accuracy of the learned lexicon over a system that assumes each lexical item has a unique pronunciation."]},{"title":"1 Introduction","paragraphs":["Infants acquiring their first language confront two difficult cognitive problems: building a lexicon of word forms, and learning basic phonetics and phonology. The two tasks are closely related: knowing what sounds can substitute for one another helps in clustering together variant pronunciations of the same word, while knowing the environments in which particular words can occur helps determine which sound changes are meaningful and which are not (Feldman (a) intended: (b) surface: (c) unsegmented: (d) idealized: Figure 1: The utterances you want one? want a cookie? represented (a) using a canonical phonemic encoding for each word and (b) as they might be pronounced phonetically. Lines (c) and (d) remove the word boundaries (but not utterance boundaries) from (b) and (a), respectively. et al., 2009). For instance, if an infant who already knows the word “you” encounters a new word , they must decide whether it is a new lexical item or a variant of the word they already know. Evidence for the correct conclusion comes from the pronunciation (many English vowels are reduced to [ ] in unstressed positions) and the context—if the next word is “want”, “you” is a plausible choice.","To date, most models of infant language learning have focused on either lexicon-building or phonetic learning in isolation. For example, many models of word segmentation implicitly or explicitly build a lexicon while segmenting the input stream of phonemes into word tokens; in nearly all cases the phonemic input is created from an orthographic transcription using a phonemic dictionary, thus abstracting away from any phonetic variability (Brent, 1999; Venkataraman, 2001; Swingley, 2005; Goldwater et al., 2009, among others). As illustrated in Figure 1, these models attempt to infer line (a) from line (d). However, (d) is an idealization: real speech has variability, and behavioral evidence suggests that infants are still learning about the phonetics and phonology of their language even after beginning to segment words, rather than learning to neutralize 184 the variations first and acquiring the lexicon after-wards (Feldman et al., 2009, and references therein).","Based on this evidence, a more realistic model of early language acquisition should propose a method of inferring the intended forms (Figure 1a) from the unsegmented surface forms (1c) while also learning a model of phonetic variation relating the intended and surface forms (a) and (b). Previous models with similar goals have learned from an artificial corpus with a small vocabulary (Driesen et al., 2009; Räsänen, 2011) or have modeled variability only in vowels (Feldman et al., 2009); to our knowledge, this paper is the first to use a naturalistic infant-directed corpus while modeling variability in all segments, and to incorporate word-level context (a bigram language model). Our main contribution is a joint lexical-phonetic model that infers intended forms from segmented surface forms; we test the system using input with either gold standard word boundaries or boundaries induced by an existing unsupervised segmentation model (Goldwater et al., 2009). We show that in both cases modeling variability improves the accuracy of the learned lexicon over a system that assumes each intended form has a unique surface form.","Our model is conceptually similar to those used in speech recognition and other applications: we assume the intended tokens are generated from a bigram language model and then distorted by a noisy channel, in particular a log-linear model of phonetic variability. But unlike speech recognition, we have no ⟨intended-form, surface-form⟩ training pairs to train the phonetic model, nor even a dictionary of intended-form strings to train the language model. Instead, we initialize the noise model using feature weights based on universal linguistic principles (e.g., a surface phone is likely to share articulatory features with the intended phone) and use a bootstrapping process to iteratively infer the intended forms and retrain the language model and noise model. While we do not claim that the particular inference mechanism we use is cognitively plausible, our positive results further support the claim that infants can and do acquire phonetics and the lexicon in concert."]},{"title":"2 Related work","paragraphs":["Our work is inspired by the lexical-phonetic model of Feldman et al. (2009). They extend a model for clustering acoustic tokens into phonetic categories (Vallabha et al., 2007) by adding a lexical level that simultaneously clusters word tokens (which contain the acoustic tokens) into lexical entries. Including the lexical level improves the model’s phonetic categorization, and a follow-up study on artificial language learning (Feldman, 2011) supports the claim that human learners use lexical knowledge to distinguish meaningful from unimportant phonetic contrasts. Feldman et al. (2009) use a real-valued representation for vowels (formant values), but assume no variability in consonants, and treat each word token independently. In contrast, our model uses a symbolic representation for sounds, but models variability in all segment types and incorporates a bigram word-level language model.","To our knowledge, the only other lexicon-building systems that also learn about phonetic variability are those of Driesen et al. (2009) and Räsänen (2011). These systems learn to represent lexical items and their variability from a discretized representation of the speech stream, but they are tested on an artificial corpus with only 80 vocabulary items that was constructed so as to “avoid strong word-to-word dependencies” (Räsänen, 2011). Here, we use a naturalistic corpus, demonstrating that lexical-phonetic learning is possible in this more general setting and that word-level context information is important for doing so.","Several other related systems work directly from the acoustic signal and many of these do use naturalistic corpora. However, they do not learn at both the lexical and phonetic/acoustic level. For example, Park and Glass (2008), Aimetti (2009), Jansen et al. (2010), and McInnes and Goldwater (2011) present lexicon-building systems that use hard-coded acoustic similarity measures rather than learning about variability, and they only extract and cluster a few frequent words. On the phonetic side, Varadarajan et al. (2008) and Dupoux et al. (2011) describe systems that learn phone-like units but without the benefit of top-down information.","A final line of related work is on word segmentation. In addition to the models mentioned in Section 1, which use phonemic input, a few models of word segmentation have been tested using phonetic input (Fleck, 2008; Rytting, 2007; Daland and Pierrehumbert, 2010). However, they do not cluster segmented 185 Figure 2: Our generative model of the surface tokens s from intended tokens x, which occur with left and right contexts l and r. word tokens into lexical items (none of these models even maintains an explicit lexicon), nor do they model or learn from phonetic variation in the input."]},{"title":"3 Lexical-phonetic model","paragraphs":["Our lexical-phonetic model is defined using the standard noisy channel framework: first a sequence of intended word tokens is generated using a language model, and then each token is transformed by a probabilistic finite-state transducer to produce the observed surface sequence. In this section, we present the model in a hierarchical Bayesian framework to emphasize its similarity to existing models, in particular those of Feldman et al. (2009) and Goldwater et al. (2009). In our actual implementation, however, we use approximation and MAP point estimates to make our inference process more tractable; we discuss these simplifications in Section 4.","Our observed data consists of a (segmented) sequence of surface words s1 . . . sn. We wish to recover the corresponding sequence of intended words x1 . . . xn. As shown in Figure 2, si is produced from xi by a transducer T : si ∼ T (xi), which models phonetic changes. Each xi is sampled from a distribution θ which represents word frequencies, and its left and right context words, li and ri, are drawn from distributions conditioned on xi, in order to capture information about the environments in which xi appears: li ∼ PL(xi), ri ∼ PR(xi). Because the number of word types is not known in advance, θ is drawn from a Dirichlet process DP (α), and PL(x) and PR(x) have Pitman-Yor priors with concentra-tion parameter 0 and discount d (Teh, 2006).","Our generative model of xi is unusual for two reasons. First, we treat each xi independently rather than linking them via a Markov chain. This makes the model deficient, sinceli overlaps with xi−1 and so forth, generating each token twice. During inference, however, we will never compute the joint probability of all the data at once, only the probabilities of subsets of the variables with particular intended word forms u and v. As long as no two of these words are adjacent, the deficiency will have no effect. We make this independence assumption for computational reasons—when deciding whether to merge u and v into a single lexical entry, we compute the change in estimated probability for their contexts, but not the effect on other words for which u and v themselves appear as context words.","Also unusual is that we factor the joint probability (l, x, r) as p(x)p(l|x)p(r|x) rather than as a left-to-right chain p(l)p(x|l)p(r|x). Given our independence assumption above, these two quantities are mathematically equivalent, so the difference matters only because we are using smoothed estimates. Our factorization leads to a symmetric treatment of left and right contexts, which simplifies implementation: we can store all the context parameters locally as PL(·|x) rather than distributed over various P (x|·).","Next, we explain our transducer T . A weighted finite-state transducer (WFST) is a variant of a finite-state automaton (Pereira et al., 1994) that reads an input string symbol-by-symbol and probabilistically produces an output string; thus it can be used to specify a conditional probability on output strings given an input. Our WFST (Figure 3) computes a weighted edit distance, and is implemented using OpenFST (Allauzen et al., 2007). It contains a state for each triplet of (previous, current, next) phones; conditioned on this state, it emits a character output which can be thought of as a possible surface realization of current in its particular environment. The output can be the empty string ε, in which case current is deleted. The machine can also insert characters at any point in the string, by transitioning to an insert state (previous, ε, current) and then returning while emitting some new character.","The transducer is parameterized by the probabilities of the arcs. For instance, all arcs leaving the state (•, , i) consume the character and emit some character c with probability p(c|•, , i). Following 186 Figure 3: The fragment of the transducer responsible for input string “the”. “...” represents an output arc for each possible character, including the empty string ε; • is the word boundary marker. Dreyer et al. (2008), we parameterize these distributions with a log-linear model. The model features are based on articulatory phonetics and distinguish three dimensions of sound production: voicing, place of articulation and manner of articulation.","Features are generated from four positional templates (Figure 4): (curr)→out, (prev, curr)→out, (curr, next)→out and (prev, curr, next)→out. Each template is instantiated once per articulatory dimension, with prev, curr, next and out replaced by their values for that dimension: for instance, there are two voicing values, voiced and unvoiced1","and the (curr)→out template for [ ] producing [ ] would be instantiated as (voiced)→voiced. To capture trends specific to particular sounds, each template is instantiated again using the actual symbol for curr and articulatory values for everything else (e.g., [ ]→unvoiced). An additional template, →out, captures the marginal frequency of the output symbol. There are also faithfulness features, same-sound, same-voice, same-place and same-manner which check if curr is exactly identical to out or shares the exact value of a particular feature.","Our choice of templates and features is based on standard linguistic principles: we expect that changing only a single articulatory dimension will be more acceptable than changing several, and that the articulatory dimensions of context phones are important because of assimilatory and dissimilatory processes (Hayes, 2011). In modern phonetics and phonology, these generalizations are usually expressed as Optimality Theory constraints; log-linear models such as ours have previously been used to implement stochas-1","We use seven place values and five manner values (stop, nasal stop, fricative, vowel, other). Empty segments like ε and • are assigned a special value “no-value” for all features. Figure 4: Some features generated for (•, , i) → d. Each black factor node corresponds to a positional template. The features instantiated for the (curr)→out and →out template are shown in full, and we show some of the features for the (curr,next)→out template. tic Optimality Theory models (Goldwater and Johnson, 2003; Hayes and Wilson, 2008)."]},{"title":"4 Inference","paragraphs":["Global optimization of the model posterior is difficult; instead we use Viterbi EM (Spitkovsky et al., 2010; Allahverdyan and Galstyan, 2011). We begin with a simple initial transducer and alternate between two phases: clustering together surface forms, and reestimating the transducer parameters. We iterate this procedure until convergence (when successive clustering phases find nearly the same set of merges); this tends to take about 5 or 6 iterations.","In our clustering phase, we improve the model posterior as much as possible by greedily making type merges, where, for a pair of intended word forms u and v, we replace all instances of xi = u with xi = v. We maintain the invariant that each intended word form’s most common surface form must be itself; this biases the model toward solutions with low distortion in the transducer. 4.1 Scoring merges We write the change in the log posterior probability of the model resulting from a type merge of u to v as ∆(u, v), which factors into two terms, one depending on the surface string and the transducer, and the other depending on the string of intended words. In order to ensure that each intended word form’s most common surface form is itself, we define∆(u, v) = −∞ if u is more common than v.","We write the log probability of x being transduced to s as T (s|x). If we merge u into v, we no longer 187 need to produce any surface forms from u, but instead we must derive them from v. If #(·) counts the occurrences of some event in the current state of the model, the transducer component of ∆ is: ∆T = ∑ s #(xi=u, si=s)(T (s|v) − T (s|u)) (1) This term is typically negative, voting against a merge, since u is more similar to itself than to v.","The language modeling term relating to the intended string again factors into multiple components. The probability of a particular li, xi, ri can be broken into p(xi)p(li|xi)p(ri|xi) according to the model. We deal first with the p(xi) unigram term, considering all tokens where xi ∈ {u, v} and computing the probability pu = p(xi = u|xi ∈ {u, v}). By definition of a Dirichlet process, the marginal over a subset of the variables will be Dirichlet, so for α > 1 we have the MAP estimate: pu =","#(xi=u) + α − 1 #(xi ∈ {u, v}) + 2(α − 1) (2) pv = p(xi = v|xi ∈ {u, v}) is computed similarly. If we decide to merge u into v, however, the probability p(xi = v|xi ∈ {u, v}) becomes 1. The change in log-probability resulting from the merge is closely related to the entropy of the distribution: ∆U = −#(xi=u) log(pu) − #(xi=v) log(pv) (3) This change must be positive and favors merging.","Next, we consider the change in probability from the left contexts (the derivations for right contexts are equivalent). If u and v are separate words, we generate their left contexts from different distributions p(l|u) and p(l|v), while if they are merged, we must generate all the contexts from the same distribution p(l|{u, v}). This change is: ∆L = ∑ l #(l, u){log(p(l|{u, v})) − log(p(l|u)} + ∑ l #(l, v){log(p(l|{u, v})) − log(p(l|v)}","In a full Bayesian model, we would integrate over the parameters of these distributions; instead, we use Kneser-Ney smoothing (Kneser and Ney, 1995) which has been shown to approximate the MAP solution of a hierarchical Pitman-Yor model (Teh, 2006; Goldwater et al., 2006). The Kneser-Ney discount2 d is a tunable parameter of our system, and controls whether the term favors merging or not. If d is small, p(l|u) and p(l|v) are close to their maximum-likelihood estimates, and ∆L is similar to a Jensen-Shannon divergence; it is always negative and discourages mergers. As d increases, however, p(l|u) for rare words approaches the prior distribution; in this case, merging two words may result in better posterior parameters than estimating both separately, since the combined estimate loses less mass to discounting.","Because neither the transducer nor the language model are perfect models of the true distribution, they can have incompatible dynamic ranges. Often, the transducer distribution is too peaked; to remedy this, we downweight the transducer probability by λ, a parameter of our model, which we set to .5. Downweighting of the acoustic model versus the LM is typical in speech recognition (Bahl et al., 1980).","To summarize, the full change in posterior is: ∆(u, v) = ∆U + ∆L + ∆R + λ∆T (4) There are four parameters. The transducer regularization r = 1 and unigram prior α = 2, which we set ad-hoc, have little impact on performance. The Kneser-Ney discount d = 2 and transducer downweight λ = .5 have more influence and were tuned on development data. 4.2 Clustering algorithm In the clustering phase, we start with an initial solution in which each surface form is its own intended pronunciation and iteratively improve this solution by merging together word types, picking (approximately) the best merger at each point.","We begin by computing a set of candidate mergers for each surface word type u. This step saves time by quickly rejecting mergers which are certain to get very low transducer scores. We reject a pair u, v if the difference in their length is greater than 4, or if both words are longer than 4 segments, but, when we consider them as unordered bags of segments, the Dice coefficient between them is less than .5.","For each word u and all its candidates v, we compute ∆(u, v) as in Equation 4. We keep track of the 2 We use one discount, rather than several as in modified KN. 188","Input: vocabulary of surface forms u","Input: C(u): candidate intended forms of u","Output: intend(u): intended form of u","foreach u ∈ vocab do","// initialization","v∗ (u) ← argmaxv ∈ C(u) ∆(u, v);","∆∗ (u) ← ∆(u, v∗","(u))","intend(u) ← u","add u to queue Q with priority ∆∗","(u))","while top(Q) > −∞ do","u ← pop(Q)","recompute v∗","(u), ∆∗","(u)","if ∆∗ (u) > 0 then // merge u with best merger intend(u) ← v∗","(u) update ∆(x, u) ∀x : v∗","(x) = u remove u from C(x) ∀x update ∆(x, v) ∀x : v∗","(x) = v update ∆(v, x) ∀x ∈ C(v) if updated ∆ > ∆∗","for any words then","reset ∆∗",", v∗","for those words // (these updates can","increase a word’s priority","from −∞)","else if ∆∗","(u) ̸= −∞ then // reject but leave in queue ∆∗","(u) ← −∞ Algorithm 1: Our clustering phase. current best target v∗","(u) and best score ∆∗","(u), using a priority queue. At each step of the algorithm, we pop the u with the current best ∆∗","(u), recompute its scores, and then merge it with v∗","(u) if doing so would improve the model posterior. In an exact algorithm, we would then need to recompute most of the other scores, since merging u and v∗","(u) affects other words for which u and v∗","(u) are candidates, and also words for which they appear in the context set. However, recomputing all these scores would be extremely time-consuming.3","Therefore, we recompute scores for only those words where the previous best merger was either u or v∗","(u). (If the best merge would not improve the probability, we reject it, but since its score might increase if we merge v∗","(u), we leave u in the queue, setting its ∆ score to −∞; this score will be updated if we merge v∗","(u).)","Since we recompute the exact scores ∆(u, v) immediately before merging u, the algorithm is guaran-3 The transducer scores can be cached since they depend only","on surface forms, but the language model scores cannot. teed never to reduce the posterior probability. It can potentially make changes in the wrong order, since not all the ∆s are recomputed in each step, but most changes do not affect one another, so performing them out of order has no impact. Empirically, we find that mutually exclusive changes (usually of the form (u, v) and (v, w)) tend to differ enough in initial score that they are evaluated in the correct order. 4.3 Training the transducer To train the transducer on a set of mappings between surface and intended forms, we find the maximum-probability state sequence for each mapping (another application of Viterbi EM) and extract features for each state and its output. Learning weights is then a maximum-entropy problem, which we solve using Orthant-wise Limited-memory Quasi-Newton.4","To construct our initial transducer, we first learn weights for the marginal distribution on surface sounds by training the max-ent system with only the bias features active. Next, we manually set weights (Table 1) for insertions and deletions, which do not appear on the surface, and for faithfulness features. Other features get an initial weight of 0."]},{"title":"5 Experiments 5.1 Dataset","paragraphs":["Our corpus is a processed version of the Bernstein-Ratner corpus (Bernstein-Ratner, 1987) from CHILDES (MacWhinney, 2000), which contains orthographic transcriptions of parent-child dyads with infants aged 13-23 months. Brent and Cartwright (1996) created a phonemic version of this corpus by extracting all infant-directed utterances and converted them to a phonemic transcription using a dictionary. This version, which contains 9790 utterances (33399 tokens, 1321 types), is now standard for word segmentation, but contains no phonetic variability.","Since producing a close phonetic transcription of this data would be impractical, we instead construct an approximate phonetic version using information from the Buckeye corpus (Pitt et al., 2007). Buckeye is a corpus of adult-directed conversational Ameri-can English, and has been phonetically transcribed 4","We use the implementation of Andrew and Gao (2007) with an l2 regularizer and regularization parameter r = 1; although this could be tuned, in practice it has little effect on results. 189 Feature Weight output-is-x marginal p(x) output-is-ε 0 same-sound 5 same-{place,voice, manner} 2 insertion -3 Table 1: Initial transducer weights.","“about” ahbawt:15, bawt:9, ihbawt:4, ahbawd:4, ihbawd:4, ahbaat:2, baw:1, ahbaht:1, erbawd:1, bawd:1, ahbaad:1, ahpaat:1, bah:1, baht:1, ah:1, ahbahd:1, ehbaat:1, ahbaed:1, ihbaht:1, baot:1","“wanna” waanah:94, waanih:37, wahnah:16, waan:13, wahneh:8, wahnih:5, wahney:3, waanlih:3, wehnih:2, waaneh:2, waonih:2, waaah:1, wuhnih:1, wahn:1, waantah:1, waanaa:1, wowiy:1, waaih:1, wah:1, waaniy:1 Table 2: Empirical distribution of pronunciations of “about” and “wanna” in our dataset. by hand to indicate realistic pronunciation variability. To create our phonetic corpus, we replace each phonemic word in the Bernstein-Ratner-Brent corpus with a phonetic pronunciation of that word sampled from the empirical distribution of pronunciations in Buckeye (Table 2). If the word never occurs in Buckeye, we use the original phonemic version.","Our corpus is not completely realistic as a sample of child-directed speech. Since each pronunciation is sampled independently, it lacks coarticulation and prosodic effects, and the distribution of pronunciations is derived from adult-directed rather than child-directed speech. Nonetheless, it represents phonetic variability more realistically than the Bernstein-Ratner-Brent corpus, while still maintaining the lexical characteristics of infant-directed speech (as compared to the Buckeye corpus, with its much larger vocabulary and more complex language model).","We conduct our development experiments on the first 8000 input utterances, holding out the remaining 1790 for evaluation. For evaluation experiments, we run the system on all 9790 utterances, reporting scores on only the last 1790. 5.2 Metrics We evaluate our results by generalizing the three segmentation metrics from Goldwater et al. (2009): word boundary F-score, word token F-score, and lexicon (word type) F-score.","0 1 2 3 4 5 Iteration 7576777879808182 Token F Lexicon F Figure 5: System scores over 5 iterations.","In our first set of experiments we evaluate how well our system clusters together surface forms derived from the same intended form, assuming gold standard word boundaries. We do not evaluate the induced intended forms directly against the gold standard intended forms—we want to evaluate cluster memberships and not labels. Instead we compute a one-to-one mapping between our induced lexical items and the gold standard, maximizing the agreement between the two (Haghighi and Klein, 2006). Using this mapping, we compute mapped token F-score5","and lexicon F-score.","In our second set of experiments, we use unknown word boundaries and evaluate the segmentations. We report the standard word boundary F and unlabeled word token F as well as mapped F. The unlabeled token score counts correctly segmented tokens, whether assigned a correct intended form or not. 5.3 Known word boundaries We first run our system with known word boundaries (Table 3). As a baseline, we treat every surface token as its own intended form (none). This baseline has fairly high accuracy; 65% of word tokens receive the most common pronunciation for their intended form.6","As an upper bound, we find the best intended form for each surface type (type ubound). This correctly resolves 91% of tokens; the remaining error is due to homophones (surface types corresponding to more than one intended form). We also test our sys-","5","When using the gold word boundaries, the precision and recall are equal and this is is the same as the accuracy; in segmentation experiments the two differ, because with fewer segmentation boundaries, the system proposes fewer tokens. Only correctly segmented tokens which are also mapped to the correct form count as matches.","6","The lexicon recall is not quite 100% because one rare word appears only as a homophone of another word. 190 System Tok F Lex P Lex R Lex F none 65.4 50.2 99.7 66.7 initializer 75.2 83.2 73.3 78.0 system 79.2 87.1 75.9 81.1 oracle trans. 82.7 88.7 83.8 86.2 type ubound 91.0 97.5 98.0 97.7 Table 3: Results on 1790 utterances (known boundaries).","Boundaries Unlabeled Tokens","P R F P R F","no var. 90.1 80.3 84.9 74.5 68.7 71.5","w/var. 70.4 93.5 80.3 56.5 69.7 62.4 Table 4: Degradation in dpseg segmentation performance caused by pronunciation variation.","Mapped Tokens Lexicon (types)","P R F P R F none 39.8 49.0 43.9 37.7 49.1 42.6 init 42.2 52.0 56.5 50.1 40.8 45.0 sys 44.2 54.5 48.8 48.6 43.1 45.7 Table 5: Results on 1790 utterances (induced boundaries). tem using an oracle transducer (oracle trans.)—the transducer estimated from the upper-bound mapping. This scores 83%, showing that our articulatory feature set captures most, but not all, of the available information. At the beginning of bootstrapping, our system (init) scores 75%, but this improves to 79% after five iterations of reestimation (system). Most learning occurs in the first two or three iterations (Figure 5).","To determine the importance of different parts of our system, we run a few ablation tests on development data. Context information is critical to obtain a good solution; setting ∆L and ∆R to 0 lowers our dev token F-score from 83% to 75%. Initializing all feature weights to 0 yields a poor initial solution (18% dev token F instead of 75%), but after learning the result is only slightly lower than using the weights in Table 1 (78% rather than 80%), showing that the system is quite robust to initialization. 5.4 Unknown word boundaries As a simple extension of our model to the case of unknown word boundaries, we interleave it with an existing model of word segmentation, dpseg (Goldwater et al., 2009).7","In each iteration, we run the segmenter, then bootstrap our model for five iterations on the segmented output. We then concatenate the intended word sequence proposed by our model to produce the next iteration’s segmenter input.","Phonetic variation is known to reduce the performance of dpseg (Fleck, 2008; Boruta et al., 2011) and our experiments confirm this (Table 4). Using induced word boundaries also makes it harder to recover the lexicon (Table 5), lowering the baseline F-score from 67% to 43%. Nevertheless, our system improves the lexicon F-score to 46%, with token F rising from 44% to 49%, demonstrating the system’s ability to work without gold word boundaries. Unfortunately, performing multiple iterations between the segmenter and lexical-phonetic learner has little further effect; we hope to address this issue in future."]},{"title":"6 Conclusion","paragraphs":["We have presented a noisy-channel model that simultaneously learns a lexicon, a bigram language model, and a model of phonetic variation, while using only the noisy surface forms as training data. It is the first model of lexical-phonetic acquisition to include word-level context and to be tested on an infant-directed corpus with realistic phonetic variability. Whether trained using gold standard or automatically induced word boundaries, the model recovers lexical items more effectively than a system that assumes no phonetic variability; moreover, the use of word-level context is key to the model’s success. Ultimately, we hope to extend the model to jointly infer word boundaries along with lexical-phonetic knowledge, and to work directly from acoustic input. However, we have already shown that lexical-phonetic learning from a broad-coverage corpus is possible, supporting the claim that infants acquire lexical and phonetic knowledge simultaneously."]},{"title":"Acknowledgements","paragraphs":["This work was supported by EPSRC grant EP/H050442/1 to the second author. 7 dpseg1.2 from http://homepages.inf.ed.ac.","uk/sgwater/resources.html 191"]},{"title":"References","paragraphs":["Guillaume Aimetti. 2009. Modelling early language acquisition skills: Towards a general statistical learning mechanism. In Proceedings of the Student Research Workshop at EACL.","Armen Allahverdyan and Aram Galstyan. 2011. Comparative analysis of Viterbi training and ML estimation for HMMs. In Advances in Neural Information Processing Systems (NIPS).","Cyril Allauzen, Michael Riley, Johan Schalkwyk, Wojciech Skut, and Mehryar Mohri. 2007. OpenFst: A general and efficient weighted finite-state transducer library. In Proceedings of the Ninth International Conference on Implementation and Application of Automata, (CIAA 2007), volume 4783 of Lecture Notes in Computer Science, pages 11–23. Springer. http://www.openfst.org.","Galen Andrew and Jianfeng Gao. 2007. Scalable training of L1-regularized log-linear models. In ICML ’07.","Lalit Bahl, Raimo Bakis, Frederick Jelinek, and Robert Mercer. 1980. Language-model/acoustic-channel-model balance mechanism. Technical disclosure bulletin Vol. 23, No. 7b, IBM, December.","Nan Bernstein-Ratner. 1987. The phonology of parent-child speech. In K. Nelson and A. van Kleeck, editors, Children’s Language, volume 6. Erlbaum, Hillsdale, NJ.","L. Boruta, S. Peperkamp, B. Crabbé, E. Dupoux, et al. 2011. Testing the robustness of online word segmentation: effects of linguistic diversity and phonetic variation. ACL HLT 2011, page 1.","Michael Brent and Timothy Cartwright. 1996. Distribu-tional regularity and phonotactic constraints are useful for segmentation. Cognition, 61:93–125.","Michael R. Brent. 1999. An efficient, probabilistically sound algorithm for segmentation and word discovery. Machine Learning, 34:71–105, February.","R. Daland and J.B. Pierrehumbert. 2010. Learning diphone-based segmentation. Cognitive Science.","Markus Dreyer, Jason R. Smith, and Jason Eisner. 2008. Latent-variable modeling of string transductions with finite-state methods. InProceedings of the Conference on Empirical Methods in Natural Language Processing, EMNLP ’08, pages 1080–1089, Stroudsburg, PA, USA. Association for Computational Linguistics.","Joris Driesen, Louis ten Bosch, and Hugo Van hamme. 2009. Adaptive non-negative matrix factorization in a computational model of language acquisition. In Proceedings of Interspeech.","E. Dupoux, G. Beraud-Sudreau, and S. Sagayama. 2011. Templatic features for modeling phoneme acquisition. In Proceedings of the 33rd Annual Cognitive Science Society.","Naomi Feldman, Thomas Griffiths, and James Morgan. 2009. Learning phonetic categories by learning a lexicon. In Proceedings of the 31st Annual Conference of the Cognitive Science Society (CogSci).","Naomi Feldman. 2011. Interactions between word and speech sound categorization in language acquisition. Ph.D. thesis, Brown University.","Margaret M. Fleck. 2008. Lexicalized phonotactic word segmentation. In Proceedings of ACL-08: HLT, pages 130–138, Columbus, Ohio, June. Association for Computational Linguistics.","Sharon Goldwater and Mark Johnson. 2003. Learning OT constraint rankings using a maximum entropy model. In J. Spenader, A. Eriksson, and Osten Dahl, editors, Proceedings of the Stockholm Workshop on Variation within Optimality Theory, pages 111–120, Stockholm. Stockholm University.","Sharon Goldwater, Tom Griffiths, and Mark Johnson. 2006. Interpolating between types and tokens by estimating power-law generators. In Advances in Neural Information Processing Systems (NIPS) 18.","Sharon Goldwater, Thomas L. Griffiths, and Mark Johnson. 2009. A Bayesian framework for word segmentation: Exploring the effects of context. In In 46th Annual Meeting of the ACL, pages 398–406.","Aria Haghighi and Dan Klein. 2006. Prototype-driven learning for sequence models. In Proceedings of the Human Language Technology Conference of the NAACL, Main Conference, pages 320–327, New York City, USA, June. Association for Computational Linguistics.","Bruce Hayes and Colin Wilson. 2008. A maximum entropy model of phonotactics and phonotactic learning. Linguistic Inquiry, 39(3):379–440.","Bruce Hayes. 2011. Introductory Phonology. John Wiley and Sons.","A. Jansen, K. Church, and H. Hermansky. 2010. Towards spoken term discovery at scale with zero resources. In Proceedings of Interspeech, pages 1676–1679.","R. Kneser and H. Ney. 1995. Improved backing-off for Mgram language modeling. In Proc. ICASSP ’95, pages 181–184, Detroit, MI, May.","B. MacWhinney. 2000. The CHILDES Project: Tools for Analyzing Talk. Vol 2: The Database. Lawrence Erlbaum Associates, Mahwah, NJ, 3rd edition.","Fergus R. McInnes and Sharon Goldwater. 2011. Unsupervised extraction of recurring words from infant-directed speech. In Proceedings of the 33rd Annual Conference of the Cognitive Science Society.","A. S. Park and J. R. Glass. 2008. Unsupervised pattern discovery in speech. IEEE Transactions on Audio, Speech and Language Processing, 16:186–197. 192","Fernando Pereira, Michael Riley, and Richard Sproat. 1994. Weighted rational transductions and their application to human language processing. In HLT.","Mark A. Pitt, Laura Dilley, Keith Johnson, Scott Kiesling, William Raymond, Elizabeth Hume, and Eric Fosler-Lussier. 2007. Buckeye corpus of conversational speech (2nd release).","Okko Räsänen. 2011. A computational model of word segmentation from continuous speech using transitional probabilities of atomic acoustic events. Cognition, 120(2):28.","Anton Rytting. 2007. Preserving Subsegmental Variation in Modeling Word Segmentation (Or, the Raising of Baby Mondegreen). Ph.D. thesis, The Ohio State University.","Valentin I. Spitkovsky, Hiyan Alshawi, Daniel Jurafsky, and Christopher D. Manning. 2010. Viterbi training improves unsupervised dependency parsing. In Proceedings of the Fourteenth Conference on Computational Natural Language Learning, pages 9–17, Uppsala, Sweden, July. Association for Computational Linguistics.","D. Swingley. 2005. Statistical clustering and the contents of the infant vocabulary. Cognitive Psychology, 50:86– 132.","Yee Whye Teh. 2006. A hierarchical Bayesian language model based on Pitman-Yor processes. In Proceedings of the 21st International Conference on Computational Linguistics and 44th Annual Meeting of the Association for Computational Linguistics, pages 985–992, Sydney, Australia, July. Association for Computational Linguistics.","G.K. Vallabha, J.L. McClelland, F. Pons, J.F. Werker, and S. Amano. 2007. Unsupervised learning of vowel categories from infant-directed speech. Proceedings of the National Academy of Sciences, 104(33):13273– 13278.","B. Varadarajan, S. Khudanpur, and E. Dupoux. 2008. Unsupervised learning of acoustic sub-word units. In Proceedings of the 46th Annual Meeting of the Association for Computational Linguistics on Human Language Technologies: Short Papers, pages 165–168. Association for Computational Linguistics.","A. Venkataraman. 2001. A statistical model for word discovery in transcribed speech. Computational Linguistics, 27(3):351–372. 193"]}],"references":[{"authors":[{"first":"Guillaume","last":"Aimetti"}],"year":"2009","title":"Modelling early language acquisition skills: Towards a general statistical learning mechanism","source":"Guillaume Aimetti. 2009. Modelling early language acquisition skills: Towards a general statistical learning mechanism. In Proceedings of the Student Research Workshop at EACL."},{"authors":[{"first":"Armen","last":"Allahverdyan"},{"first":"Aram","last":"Galstyan"}],"year":"2011","title":"Comparative analysis of Viterbi training and ML estimation for HMMs","source":"Armen Allahverdyan and Aram Galstyan. 2011. Comparative analysis of Viterbi training and ML estimation for HMMs. In Advances in Neural Information Processing Systems (NIPS)."},{"authors":[{"first":"Cyril","last":"Allauzen"},{"first":"Michael","last":"Riley"},{"first":"Johan","last":"Schalkwyk"},{"first":"Wojciech","last":"Skut"},{"first":"Mehryar","last":"Mohri"}],"year":"2007","title":"OpenFst: A general and efficient weighted finite-state transducer library","source":"Cyril Allauzen, Michael Riley, Johan Schalkwyk, Wojciech Skut, and Mehryar Mohri. 2007. OpenFst: A general and efficient weighted finite-state transducer library. In Proceedings of the Ninth International Conference on Implementation and Application of Automata, (CIAA 2007), volume 4783 of Lecture Notes in Computer Science, pages 11–23. Springer. http://www.openfst.org."},{"authors":[{"first":"Galen","last":"Andrew"},{"first":"Jianfeng","last":"Gao"}],"year":"2007","title":"Scalable training of L1-regularized log-linear models","source":"Galen Andrew and Jianfeng Gao. 2007. Scalable training of L1-regularized log-linear models. In ICML ’07."},{"authors":[{"first":"Lalit","last":"Bahl"},{"first":"Raimo","last":"Bakis"},{"first":"Frederick","last":"Jelinek"},{"first":"Robert","last":"Mercer"}],"year":"1980","title":"Language-model/acoustic-channel-model balance mechanism","source":"Lalit Bahl, Raimo Bakis, Frederick Jelinek, and Robert Mercer. 1980. Language-model/acoustic-channel-model balance mechanism. Technical disclosure bulletin Vol. 23, No. 7b, IBM, December."},{"authors":[{"first":"Nan","last":"Bernstein-Ratner"}],"year":"1987","title":"The phonology of parent-child speech","source":"Nan Bernstein-Ratner. 1987. The phonology of parent-child speech. In K. Nelson and A. van Kleeck, editors, Children’s Language, volume 6. Erlbaum, Hillsdale, NJ."},{"authors":[{"first":"L.","last":"Boruta"},{"first":"S.","last":"Peperkamp"},{"first":"B.","last":"Crabbé"},{"first":"E.","last":"Dupoux"},{"last":"al"}],"year":"2011","title":"Testing the robustness of online word segmentation: effects of linguistic diversity and phonetic variation","source":"L. Boruta, S. Peperkamp, B. Crabbé, E. Dupoux, et al. 2011. Testing the robustness of online word segmentation: effects of linguistic diversity and phonetic variation. ACL HLT 2011, page 1."},{"authors":[{"first":"Michael","last":"Brent"},{"first":"Timothy","last":"Cartwright"}],"year":"1996","title":"Distribu-tional regularity and phonotactic constraints are useful for segmentation","source":"Michael Brent and Timothy Cartwright. 1996. Distribu-tional regularity and phonotactic constraints are useful for segmentation. Cognition, 61:93–125."},{"authors":[{"first":"Michael","middle":"R.","last":"Brent"}],"year":"1999","title":"An efficient, probabilistically sound algorithm for segmentation and word discovery","source":"Michael R. Brent. 1999. An efficient, probabilistically sound algorithm for segmentation and word discovery. Machine Learning, 34:71–105, February."},{"authors":[{"first":"R.","last":"Daland"},{"first":"J.","middle":"B.","last":"Pierrehumbert"}],"year":"2010","title":"Learning diphone-based segmentation","source":"R. Daland and J.B. Pierrehumbert. 2010. Learning diphone-based segmentation. Cognitive Science."},{"authors":[{"first":"Markus","last":"Dreyer"},{"first":"Jason","middle":"R.","last":"Smith"},{"first":"Jason","last":"Eisner"}],"year":"2008","title":"Latent-variable modeling of string transductions with finite-state methods","source":"Markus Dreyer, Jason R. Smith, and Jason Eisner. 2008. Latent-variable modeling of string transductions with finite-state methods. InProceedings of the Conference on Empirical Methods in Natural Language Processing, EMNLP ’08, pages 1080–1089, Stroudsburg, PA, USA. Association for Computational Linguistics."},{"authors":[{"first":"Joris","last":"Driesen"},{"first":"Louis","middle":"ten","last":"Bosch"},{"first":"Hugo","last":"Van hamme"}],"year":"2009","title":"Adaptive non-negative matrix factorization in a computational model of language acquisition","source":"Joris Driesen, Louis ten Bosch, and Hugo Van hamme. 2009. Adaptive non-negative matrix factorization in a computational model of language acquisition. In Proceedings of Interspeech."},{"authors":[{"first":"E.","last":"Dupoux"},{"first":"G.","last":"Beraud-Sudreau"},{"first":"S.","last":"Sagayama"}],"year":"2011","title":"Templatic features for modeling phoneme acquisition","source":"E. Dupoux, G. Beraud-Sudreau, and S. Sagayama. 2011. Templatic features for modeling phoneme acquisition. In Proceedings of the 33rd Annual Cognitive Science Society."},{"authors":[{"first":"Naomi","last":"Feldman"},{"first":"Thomas","last":"Griffiths"},{"first":"James","last":"Morgan"}],"year":"2009","title":"Learning phonetic categories by learning a lexicon","source":"Naomi Feldman, Thomas Griffiths, and James Morgan. 2009. Learning phonetic categories by learning a lexicon. In Proceedings of the 31st Annual Conference of the Cognitive Science Society (CogSci)."},{"authors":[{"first":"Naomi","last":"Feldman"}],"year":"2011","title":"Interactions between word and speech sound categorization in language acquisition","source":"Naomi Feldman. 2011. Interactions between word and speech sound categorization in language acquisition. Ph.D. thesis, Brown University."},{"authors":[{"first":"Margaret","middle":"M.","last":"Fleck"}],"year":"2008","title":"Lexicalized phonotactic word segmentation","source":"Margaret M. Fleck. 2008. Lexicalized phonotactic word segmentation. In Proceedings of ACL-08: HLT, pages 130–138, Columbus, Ohio, June. Association for Computational Linguistics."},{"authors":[{"first":"Sharon","last":"Goldwater"},{"first":"Mark","last":"Johnson"}],"year":"2003","title":"Learning OT constraint rankings using a maximum entropy model","source":"Sharon Goldwater and Mark Johnson. 2003. Learning OT constraint rankings using a maximum entropy model. In J. Spenader, A. Eriksson, and Osten Dahl, editors, Proceedings of the Stockholm Workshop on Variation within Optimality Theory, pages 111–120, Stockholm. Stockholm University."},{"authors":[{"first":"Sharon","last":"Goldwater"},{"first":"Tom","last":"Griffiths"},{"first":"Mark","last":"Johnson"}],"year":"2006","title":"Interpolating between types and tokens by estimating power-law generators","source":"Sharon Goldwater, Tom Griffiths, and Mark Johnson. 2006. Interpolating between types and tokens by estimating power-law generators. In Advances in Neural Information Processing Systems (NIPS) 18."},{"authors":[{"first":"Sharon","last":"Goldwater"},{"first":"Thomas","middle":"L.","last":"Griffiths"},{"first":"Mark","last":"Johnson"}],"year":"2009","title":"A Bayesian framework for word segmentation: Exploring the effects of context","source":"Sharon Goldwater, Thomas L. Griffiths, and Mark Johnson. 2009. A Bayesian framework for word segmentation: Exploring the effects of context. In In 46th Annual Meeting of the ACL, pages 398–406."},{"authors":[{"first":"Aria","last":"Haghighi"},{"first":"Dan","last":"Klein"}],"year":"2006","title":"Prototype-driven learning for sequence models","source":"Aria Haghighi and Dan Klein. 2006. Prototype-driven learning for sequence models. In Proceedings of the Human Language Technology Conference of the NAACL, Main Conference, pages 320–327, New York City, USA, June. Association for Computational Linguistics."},{"authors":[{"first":"Bruce","last":"Hayes"},{"first":"Colin","last":"Wilson"}],"year":"2008","title":"A maximum entropy model of phonotactics and phonotactic learning","source":"Bruce Hayes and Colin Wilson. 2008. A maximum entropy model of phonotactics and phonotactic learning. Linguistic Inquiry, 39(3):379–440."},{"authors":[{"first":"Bruce","last":"Hayes"}],"year":"2011","title":"Introductory Phonology","source":"Bruce Hayes. 2011. Introductory Phonology. John Wiley and Sons."},{"authors":[{"first":"A.","last":"Jansen"},{"first":"K.","last":"Church"},{"first":"H.","last":"Hermansky"}],"year":"2010","title":"Towards spoken term discovery at scale with zero resources","source":"A. Jansen, K. Church, and H. Hermansky. 2010. Towards spoken term discovery at scale with zero resources. In Proceedings of Interspeech, pages 1676–1679."},{"authors":[{"first":"R.","last":"Kneser"},{"first":"H.","last":"Ney"}],"year":"1995","title":"Improved backing-off for Mgram language modeling","source":"R. Kneser and H. Ney. 1995. Improved backing-off for Mgram language modeling. In Proc. ICASSP ’95, pages 181–184, Detroit, MI, May."},{"authors":[{"first":"B.","last":"MacWhinney"}],"year":"2000","title":"The CHILDES Project: Tools for Analyzing Talk","source":"B. MacWhinney. 2000. The CHILDES Project: Tools for Analyzing Talk. Vol 2: The Database. Lawrence Erlbaum Associates, Mahwah, NJ, 3rd edition."},{"authors":[{"first":"Fergus","middle":"R.","last":"McInnes"},{"first":"Sharon","last":"Goldwater"}],"year":"2011","title":"Unsupervised extraction of recurring words from infant-directed speech","source":"Fergus R. McInnes and Sharon Goldwater. 2011. Unsupervised extraction of recurring words from infant-directed speech. In Proceedings of the 33rd Annual Conference of the Cognitive Science Society."},{"authors":[{"first":"A.","middle":"S.","last":"Park"},{"first":"J.","middle":"R.","last":"Glass"}],"year":"2008","title":"Unsupervised pattern discovery in speech","source":"A. S. Park and J. R. Glass. 2008. Unsupervised pattern discovery in speech. IEEE Transactions on Audio, Speech and Language Processing, 16:186–197. 192"},{"authors":[{"first":"Fernando","last":"Pereira"},{"first":"Michael","last":"Riley"},{"first":"Richard","last":"Sproat"}],"year":"1994","title":"Weighted rational transductions and their application to human language processing","source":"Fernando Pereira, Michael Riley, and Richard Sproat. 1994. Weighted rational transductions and their application to human language processing. In HLT."},{"authors":[{"first":"Mark","middle":"A.","last":"Pitt"},{"first":"Laura","last":"Dilley"},{"first":"Keith","last":"Johnson"},{"first":"Scott","last":"Kiesling"},{"first":"William","last":"Raymond"},{"first":"Elizabeth","last":"Hume"},{"first":"Eric","last":"Fosler-Lussier"}],"year":"2007","title":"Buckeye corpus of conversational speech (2nd release)","source":"Mark A. Pitt, Laura Dilley, Keith Johnson, Scott Kiesling, William Raymond, Elizabeth Hume, and Eric Fosler-Lussier. 2007. Buckeye corpus of conversational speech (2nd release)."},{"authors":[{"first":"Okko","last":"Räsänen"}],"year":"2011","title":"A computational model of word segmentation from continuous speech using transitional probabilities of atomic acoustic events","source":"Okko Räsänen. 2011. A computational model of word segmentation from continuous speech using transitional probabilities of atomic acoustic events. Cognition, 120(2):28."},{"authors":[{"first":"Anton","last":"Rytting"}],"year":"2007","title":"Preserving Subsegmental Variation in Modeling Word Segmentation (Or, the Raising of Baby Mondegreen)","source":"Anton Rytting. 2007. Preserving Subsegmental Variation in Modeling Word Segmentation (Or, the Raising of Baby Mondegreen). Ph.D. thesis, The Ohio State University."},{"authors":[{"first":"Valentin I","middle":".","last":"Spitkovsky"},{"first":"Hiyan","last":"Alshawi"},{"first":"Daniel","last":"Jurafsky"},{"first":"Christopher","middle":"D.","last":"Manning"}],"year":"2010","title":"Viterbi training improves unsupervised dependency parsing","source":"Valentin I. Spitkovsky, Hiyan Alshawi, Daniel Jurafsky, and Christopher D. Manning. 2010. Viterbi training improves unsupervised dependency parsing. In Proceedings of the Fourteenth Conference on Computational Natural Language Learning, pages 9–17, Uppsala, Sweden, July. Association for Computational Linguistics."},{"authors":[{"first":"D.","last":"Swingley"}],"year":"2005","title":"Statistical clustering and the contents of the infant vocabulary","source":"D. Swingley. 2005. Statistical clustering and the contents of the infant vocabulary. Cognitive Psychology, 50:86– 132."},{"authors":[{"first":"Yee","middle":"Whye","last":"Teh"}],"year":"2006","title":"A hierarchical Bayesian language model based on Pitman-Yor processes","source":"Yee Whye Teh. 2006. A hierarchical Bayesian language model based on Pitman-Yor processes. In Proceedings of the 21st International Conference on Computational Linguistics and 44th Annual Meeting of the Association for Computational Linguistics, pages 985–992, Sydney, Australia, July. Association for Computational Linguistics."},{"authors":[{"first":"G.","middle":"K.","last":"Vallabha"},{"first":"J.","middle":"L.","last":"McClelland"},{"first":"F.","last":"Pons"},{"first":"J.","middle":"F.","last":"Werker"},{"first":"S.","last":"Amano"}],"year":"2007","title":"Unsupervised learning of vowel categories from infant-directed speech","source":"G.K. Vallabha, J.L. McClelland, F. Pons, J.F. Werker, and S. Amano. 2007. Unsupervised learning of vowel categories from infant-directed speech. Proceedings of the National Academy of Sciences, 104(33):13273– 13278."},{"authors":[{"first":"B.","last":"Varadarajan"},{"first":"S.","last":"Khudanpur"},{"first":"E.","last":"Dupoux"}],"year":"2008","title":"Unsupervised learning of acoustic sub-word units","source":"B. Varadarajan, S. Khudanpur, and E. Dupoux. 2008. Unsupervised learning of acoustic sub-word units. In Proceedings of the 46th Annual Meeting of the Association for Computational Linguistics on Human Language Technologies: Short Papers, pages 165–168. Association for Computational Linguistics."},{"authors":[{"first":"A.","last":"Venkataraman"}],"year":"2001","title":"A statistical model for word discovery in transcribed speech","source":"A. Venkataraman. 2001. A statistical model for word discovery in transcribed speech. Computational Linguistics, 27(3):351–372. 193"}],"cites":[{"style":0,"text":"Brent, 1999","origin":{"pointer":"/sections/2/paragraphs/1","offset":442,"length":11},"authors":[{"last":"Brent"}],"year":"1999","references":["/references/8"]},{"style":0,"text":"Venkataraman, 2001","origin":{"pointer":"/sections/2/paragraphs/1","offset":455,"length":18},"authors":[{"last":"Venkataraman"}],"year":"2001","references":["/references/36"]},{"style":0,"text":"Swingley, 2005","origin":{"pointer":"/sections/2/paragraphs/1","offset":475,"length":14},"authors":[{"last":"Swingley"}],"year":"2005","references":["/references/32"]},{"style":0,"text":"Goldwater et al., 2009","origin":{"pointer":"/sections/2/paragraphs/1","offset":491,"length":22},"authors":[{"last":"Goldwater"},{"last":"al."}],"year":"2009","references":["/references/18"]},{"style":0,"text":"Feldman et al., 2009","origin":{"pointer":"/sections/2/paragraphs/1","offset":929,"length":20},"authors":[{"last":"Feldman"},{"last":"al."}],"year":"2009","references":["/references/13"]},{"style":0,"text":"Driesen et al., 2009","origin":{"pointer":"/sections/2/paragraphs/2","offset":387,"length":20},"authors":[{"last":"Driesen"},{"last":"al."}],"year":"2009","references":["/references/11"]},{"style":0,"text":"Räsänen, 2011","origin":{"pointer":"/sections/2/paragraphs/2","offset":409,"length":13},"authors":[{"last":"Räsänen"}],"year":"2011","references":["/references/29"]},{"style":0,"text":"Feldman et al., 2009","origin":{"pointer":"/sections/2/paragraphs/2","offset":468,"length":20},"authors":[{"last":"Feldman"},{"last":"al."}],"year":"2009","references":["/references/13"]},{"style":0,"text":"Goldwater et al., 2009","origin":{"pointer":"/sections/2/paragraphs/2","offset":943,"length":22},"authors":[{"last":"Goldwater"},{"last":"al."}],"year":"2009","references":["/references/18"]},{"style":0,"text":"Feldman et al. (2009)","origin":{"pointer":"/sections/3/paragraphs/0","offset":54,"length":21},"authors":[{"last":"Feldman"},{"last":"al."}],"year":"2009","references":["/references/13"]},{"style":0,"text":"Vallabha et al., 2007","origin":{"pointer":"/sections/3/paragraphs/0","offset":154,"length":21},"authors":[{"last":"Vallabha"},{"last":"al."}],"year":"2007","references":["/references/34"]},{"style":0,"text":"Feldman, 2011","origin":{"pointer":"/sections/3/paragraphs/0","offset":431,"length":13},"authors":[{"last":"Feldman"}],"year":"2011","references":["/references/14"]},{"style":0,"text":"Feldman et al. (2009)","origin":{"pointer":"/sections/3/paragraphs/0","offset":570,"length":21},"authors":[{"last":"Feldman"},{"last":"al."}],"year":"2009","references":["/references/13"]},{"style":0,"text":"Driesen et al. (2009)","origin":{"pointer":"/sections/3/paragraphs/1","offset":114,"length":21},"authors":[{"last":"Driesen"},{"last":"al."}],"year":"2009","references":["/references/11"]},{"style":0,"text":"Räsänen (2011)","origin":{"pointer":"/sections/3/paragraphs/1","offset":140,"length":14},"authors":[{"last":"Räsänen"}],"year":"2011","references":["/references/29"]},{"style":0,"text":"Räsänen, 2011","origin":{"pointer":"/sections/3/paragraphs/1","offset":427,"length":13},"authors":[{"last":"Räsänen"}],"year":"2011","references":["/references/29"]},{"style":0,"text":"Park and Glass (2008)","origin":{"pointer":"/sections/3/paragraphs/2","offset":205,"length":21},"authors":[{"last":"Park"},{"last":"Glass"}],"year":"2008","references":["/references/26"]},{"style":0,"text":"Aimetti (2009)","origin":{"pointer":"/sections/3/paragraphs/2","offset":228,"length":14},"authors":[{"last":"Aimetti"}],"year":"2009","references":["/references/0"]},{"style":0,"text":"Jansen et al. (2010)","origin":{"pointer":"/sections/3/paragraphs/2","offset":244,"length":20},"authors":[{"last":"Jansen"},{"last":"al."}],"year":"2010","references":["/references/22"]},{"style":0,"text":"McInnes and Goldwater (2011)","origin":{"pointer":"/sections/3/paragraphs/2","offset":270,"length":28},"authors":[{"last":"McInnes"},{"last":"Goldwater"}],"year":"2011","references":["/references/25"]},{"style":0,"text":"Varadarajan et al. (2008)","origin":{"pointer":"/sections/3/paragraphs/2","offset":499,"length":25},"authors":[{"last":"Varadarajan"},{"last":"al."}],"year":"2008","references":["/references/35"]},{"style":0,"text":"Dupoux et al. (2011)","origin":{"pointer":"/sections/3/paragraphs/2","offset":529,"length":20},"authors":[{"last":"Dupoux"},{"last":"al."}],"year":"2011","references":["/references/12"]},{"style":0,"text":"Fleck, 2008","origin":{"pointer":"/sections/3/paragraphs/3","offset":203,"length":11},"authors":[{"last":"Fleck"}],"year":"2008","references":["/references/15"]},{"style":0,"text":"Rytting, 2007","origin":{"pointer":"/sections/3/paragraphs/3","offset":216,"length":13},"authors":[{"last":"Rytting"}],"year":"2007","references":["/references/30"]},{"style":0,"text":"Daland and Pierrehumbert, 2010","origin":{"pointer":"/sections/3/paragraphs/3","offset":231,"length":30},"authors":[{"last":"Daland"},{"last":"Pierrehumbert"}],"year":"2010","references":["/references/9"]},{"style":0,"text":"Feldman et al. (2009)","origin":{"pointer":"/sections/4/paragraphs/0","offset":426,"length":21},"authors":[{"last":"Feldman"},{"last":"al."}],"year":"2009","references":["/references/13"]},{"style":0,"text":"Goldwater et al. (2009)","origin":{"pointer":"/sections/4/paragraphs/0","offset":452,"length":23},"authors":[{"last":"Goldwater"},{"last":"al."}],"year":"2009","references":["/references/18"]},{"style":0,"text":"Teh, 2006","origin":{"pointer":"/sections/4/paragraphs/1","offset":737,"length":9},"authors":[{"last":"Teh"}],"year":"2006","references":["/references/33"]},{"style":0,"text":"Pereira et al., 1994","origin":{"pointer":"/sections/4/paragraphs/4","offset":120,"length":20},"authors":[{"last":"Pereira"},{"last":"al."}],"year":"1994","references":["/references/27"]},{"style":0,"text":"Allauzen et al., 2007","origin":{"pointer":"/sections/4/paragraphs/4","offset":415,"length":21},"authors":[{"last":"Allauzen"},{"last":"al."}],"year":"2007","references":["/references/2"]},{"style":0,"text":"Dreyer et al. (2008)","origin":{"pointer":"/sections/4/paragraphs/5","offset":406,"length":20},"authors":[{"last":"Dreyer"},{"last":"al."}],"year":"2008","references":["/references/10"]},{"style":0,"text":"Hayes, 2011","origin":{"pointer":"/sections/4/paragraphs/8","offset":311,"length":11},"authors":[{"last":"Hayes"}],"year":"2011","references":["/references/21"]},{"style":0,"text":"Goldwater and Johnson, 2003","origin":{"pointer":"/sections/4/paragraphs/9","offset":472,"length":27},"authors":[{"last":"Goldwater"},{"last":"Johnson"}],"year":"2003","references":["/references/16"]},{"style":0,"text":"Hayes and Wilson, 2008","origin":{"pointer":"/sections/4/paragraphs/9","offset":501,"length":22},"authors":[{"last":"Hayes"},{"last":"Wilson"}],"year":"2008","references":["/references/20"]},{"style":0,"text":"Spitkovsky et al., 2010","origin":{"pointer":"/sections/5/paragraphs/0","offset":84,"length":23},"authors":[{"last":"Spitkovsky"},{"last":"al."}],"year":"2010","references":["/references/31"]},{"style":0,"text":"Allahverdyan and Galstyan, 2011","origin":{"pointer":"/sections/5/paragraphs/0","offset":109,"length":31},"authors":[{"last":"Allahverdyan"},{"last":"Galstyan"}],"year":"2011","references":["/references/1"]},{"style":0,"text":"Kneser and Ney, 1995","origin":{"pointer":"/sections/5/paragraphs/6","offset":127,"length":20},"authors":[{"last":"Kneser"},{"last":"Ney"}],"year":"1995","references":["/references/23"]},{"style":0,"text":"Teh, 2006","origin":{"pointer":"/sections/5/paragraphs/6","offset":238,"length":9},"authors":[{"last":"Teh"}],"year":"2006","references":["/references/33"]},{"style":0,"text":"Goldwater et al., 2006","origin":{"pointer":"/sections/5/paragraphs/6","offset":249,"length":22},"authors":[{"last":"Goldwater"},{"last":"al."}],"year":"2006","references":["/references/17"]},{"style":0,"text":"Bahl et al., 1980","origin":{"pointer":"/sections/5/paragraphs/7","offset":385,"length":17},"authors":[{"last":"Bahl"},{"last":"al."}],"year":"1980","references":["/references/4"]},{"style":0,"text":"Bernstein-Ratner, 1987","origin":{"pointer":"/sections/6/paragraphs/0","offset":66,"length":22},"authors":[{"last":"Bernstein-Ratner"}],"year":"1987","references":["/references/5"]},{"style":0,"text":"MacWhinney, 2000","origin":{"pointer":"/sections/6/paragraphs/0","offset":104,"length":16},"authors":[{"last":"MacWhinney"}],"year":"2000","references":["/references/24"]},{"style":0,"text":"Brent and Cartwright (1996)","origin":{"pointer":"/sections/6/paragraphs/0","offset":220,"length":27},"authors":[{"last":"Brent"},{"last":"Cartwright"}],"year":"1996","references":["/references/7"]},{"style":0,"text":"Pitt et al., 2007","origin":{"pointer":"/sections/6/paragraphs/1","offset":178,"length":17},"authors":[{"last":"Pitt"},{"last":"al."}],"year":"2007","references":["/references/28"]},{"style":0,"text":"Andrew and Gao (2007)","origin":{"pointer":"/sections/6/paragraphs/2","offset":29,"length":21},"authors":[{"last":"Andrew"},{"last":"Gao"}],"year":"2007","references":["/references/3"]},{"style":0,"text":"Goldwater et al. (2009)","origin":{"pointer":"/sections/6/paragraphs/6","offset":320,"length":23},"authors":[{"last":"Goldwater"},{"last":"al."}],"year":"2009","references":["/references/18"]},{"style":0,"text":"Haghighi and Klein, 2006","origin":{"pointer":"/sections/6/paragraphs/8","offset":464,"length":24},"authors":[{"last":"Haghighi"},{"last":"Klein"}],"year":"2006","references":["/references/19"]},{"style":0,"text":"Goldwater et al., 2009","origin":{"pointer":"/sections/6/paragraphs/22","offset":683,"length":22},"authors":[{"last":"Goldwater"},{"last":"al."}],"year":"2009","references":["/references/18"]},{"style":0,"text":"Fleck, 2008","origin":{"pointer":"/sections/6/paragraphs/24","offset":64,"length":11},"authors":[{"last":"Fleck"}],"year":"2008","references":["/references/15"]},{"style":0,"text":"Boruta et al., 2011","origin":{"pointer":"/sections/6/paragraphs/24","offset":77,"length":19},"authors":[{"last":"Boruta"},{"last":"al."}],"year":"2011","references":["/references/6"]}]}
