{"sections":[{"title":"","paragraphs":["P,.ICHARD CASTANET - SYLVAIN VATURI","TP, ADUCTION AUTOMATIQUE EN UTILISANT UNE Gt(AMMAIRE EN CHAINE * 1. INTRODUCTION","Une des applications de cette analyse syntaxique qui vient d'Stre exposde par Monsieur Salkoff pourrait 8tre la traduction automatique.","L'utilisation de cette analyse syntaxique permet une nouvelle approche des probl~mes difficiles de la traduction automatique. J'essayerai de montrer qu'une analyse syntaxique, mettant en lumi~re tousles rapports linguistiquement significatifs entre les roots de la phrase, offre une aide prdcieuse ~t la traduction automatique.","L'exp~rience a portd sur un essai de traduction anglais-franqais. On peut remarquer h ce sujet qu'une traduction d'une langue morphologiquement pauvre en une langue morphologiquement fiche pr~-- sente plus de difficultds que le processus inverse. 2. MODELE","A partir d'tm arbre repr6sentant l'analyse syntaxique de la phrase ~. traduire, le but cst de produire un arbre dont les noeuds terminaux repr6sentent la phrase du langage cible.","Les op6rations rentrant en jeu sont donc des op6rateurs de traduction d'un arbre en tin autre, ou plut6t des traductions de sous-arbres si l'on consid~re qu'il n'est pas pensable de traduire d'un bloc l'arbre complet. 3. DONN~.ES ET OUTILS UTILISE$ I1 y a trois donndes principales.","(1) P,.~sultat de l'analyse syntaxique de la phrase avecla grammaire en chalne de l'Anglais de Naomi Sager de l'Universit6 de New York. * Appendice ~ la communication de M. Salko~ 12 178 RICHARD CASTANET - SYLVAIN VATURI","(2) Dictionnaire. I1 s'agit d'un dictionnaire bilingue sous forme d'arbre. Forme g6n~rale:","entr/e Iexicale d. .lot ."]},{"title":"categor~e categorie grammaticale 1 grammaticale 2 ~\" /f \\\\","paragraphs":["/ .... I .~ ~"]},{"title":"sous-cat~gori'es sur et sous-classes /~e/ [ \\Xtlrfllufiiltn. ~ l~our une traduction","paragraphs":["Fig. a.","(3) Grammaire en chalne de transfert, inspir6e de la grammaire en chaine du fran~ais. La forme de cette grammaire de transfert d6pend ~videmment des langues utilis~es dans la traduction.","i La construction d'un arbre syntaxique franqais est r~alis6e, mais les choix de traduction de structures sont faits en scrutant l'arbre anglais et la partie d6j~ construite de l'arbre franqais.","L'outil utilis~ est un traducteur ind~pendant des langues, donc des grammaires et des dictionnaires.","Les probl~mes rencontrds sont des probl~mes de: -","permutation de structures; - suppression complete de structure (deletion); - addition d'un ou plusieurs dl6ments ~t une structure; - production d'une structure totalement diff6rente.","Moyennant une s~rie d'exemples, je m'efforcerai de d~crire la m6thode propos6e afin de r~soudre quelques-uns de ces probl~mes. TRADUCTION AUTOMATIQUE 179 4. EXEMPLES","(1) Passage d'une structure passive fi uue structure active. I1 existe des formes passives anglaises qui n'ont auctm 6quivalent passif en franqais. En scrutant l'arbre anglais, on reconnalt dans la structure (b) une chaine d'objet passif et un verbe qui est uric forme de be.","Si le verbe Ved est marqu6 dans le dictionnaire comme n'ayant pas de passif, on engendre la structure (c)."]},{"title":"(b)","paragraphs":["S"]},{"title":"/\\","paragraphs":["~ PN"]},{"title":"/\\","paragraphs":["by R.emarque: si by N~ est vide, on met en gdn&al, en fran~ais, on. (2) Transformation d'une structure nominalis6e en une autre The V1 ing of N~ donne lieu \"5. N1 de N2 The counting of the ballots =~ Le ddcompte des suffrages Mais cette transformation est parfois impossible (pas d'~quivalence entre V1 ing et un nom fran~ais). Dans ce cas la structure traduite est: qu'on V1 N~.","Exemple: =0. The eating of the meal was unlikel 7 Le manger de ce repas dtait improbable Qu'on mange ce repas e'tait improbable Le fait de manger ce repas e'tait improbable","L'arbre anglais et l'entr~e lexicale du Ving permettent de choisir la structure traduite. 180 RICHARD CASTANET - SYLVAIN VATURI","(3) Choix de traduction en fonction de sous-classes syntaxiques utilis~es effectivement lors de l'analyse syntaxique.","Un mot de la langue anglaise appartient/t un certain hombre de sous-classes. Pour une phrase d~termin~e, seules certaines de ces sous-classes seront utilis6es dans l'analyse syntaxique. Ces derni~res donnent des indications pr&ieuses sur la fonction du mot consid~r~ dans la phrase analysde.","Exemple: a) The proof that Sentence... (proof ~ sous-classe phrastique)","b) The proof that S-N... (relative et proof ~ sous-classe phrastique) Exemples de phrases pour les deux types pr&~dents:","a) The proof that John did that is complicated =~ La preuve que Jean air fair cela est compliqu¢e","b) The proof that I initialed is on the table =~ L'@reuve que j'ai paraphde est sur la table","c) Cas d'ambiguit& The proof is on the table","lLapreuvel =~ L'@reuve est sur la table","L'exemple c) montre que certains cas ne peuvent pas ~tre r6solus dans le contexte de la phrase seule. Dam l'dtat actuel le choix de la traduction dolt ~tre laiss6 au lecteur.","(4) Choix d'une traduction en fonction du contexte. Certains verbes ont des significations diff6rentes suivant leur fonction dans la phrase; par exemple s'ils sont utilis& en verbe intransitif ou en verbe transitif.","Exemple: Pigs breed ~, Les porcs procr&nt We breed pigs =, Nous dlevons des porcs","Le choix de cette traduction est d&ermin6 en fonction de la pr6sence ou absence d'un objet attach6 ~t ce verbe. La presence de l'objet ne se ddtermine pas simplement par la proximit6 de mots suivant le verbe, mais par la reconnaissance d'une chalne objet non vide dam la structure syntaxique. TRADUCTION AUTOMATIQUE 181","On peut remarquer que l'analyse en chalne peut diff6rencier les chalnes objets et certaines chalnes d'ajouts (modificateurs) qui pourraient ~tre confondues avec une chalne objet.","Exemple: These pigs bread three times a year The farmer breed these pigs three times a year","Le groupe (1) est pris comme un compl~ment ~ la phrase (ajout la phrase) et le groupe (2) est analysd comme l'objet. 5. CONCLUSION","Pour l'instant ce syst~me est en &at d'dlaboration. La grammaire de transfert existante est encore r~duite, mais elle a permis de traduire ddjfi quelques phrases de fa~on satisfaisante.","Du temps et du travail seront ndcessaires pour ddvelopper la grammaire de transfert et ~crire un dictionnaire suffisant pour rendre ce syst~me opdrationnel."]}]}