{"sections":[{"title":"","paragraphs":["S~AS~AN K. SAVMJAN - P. A. SO~Or~VA","FORMAL METALANGUAGE AND FORMAL THEORY AS TWO ASPECTS OF GENERATIVE GRAMMAR","As is known, metalanguage is a language by means of which an-other language is described. The latter is called object-language.","One and the same language may play the role of object-language and metalanguage. For example, the Russian language taken as an object of linguistic description is an object-language, the Russian language used for a linguistic description of Russian is a metalanguage.","There are non-formal and formal metalanguages. For example, the Russian language used in ordinary grammars of Russian as a means of describing the Russian language is a non-formal metalanguage. Formal metalanguage is an artificial language, defined by deductive rules of construction, and used to describe natural languages.","The problem of formal metalanguages for linguistic descriptions is a broad topic which we do not mean to-exhaust. We shall restrict ourselves to clarifying the role of formal metalanguages in constructing generative grammars.","Every generative grammar is a formal theory. For example, a generative grammar of Russian is a formal theory of Russian, a generative grammar of English is a formal theory of English. We shall focus our attention on the question of correlation between formal metalanguages and formal linguistic theories understood as generative grammars. Let us take a concrete example: formal metalanguage and formal theory as two aspects of applicative generative grammar. This concrete example will make it possible, we hope, to draw certain general conclusions about the role of formal metalanguages in generative grammar.","We shall start with formal metalanguage in applicative generative grammar. We call this metalanguage a universal operator language.","The universal operator language is defined by the grammar which is an ordered quadruple"]},{"title":"(v,, V ,F, R5","paragraphs":[":/jr 64 SEBASTIAN K. ~AUMJAN- P. A. SOBOLEVA where:","1. V, is the lexicon of symbols whose denotata belong to a finite set of elementary categories called elementary episemions. The elementary episemions are denoted by the symbols 0c and [3. The first is interpreted as the category of terms, and the second - as the category of sentences. The episemion [3 is called the distinguished episemion.","Complex categories called episemions are constructed from elementary episemions. The construction of episemions is effected with the help of the function A, which maps episemions into each other. The rules for constructing episemions are the following:","(a) elementary episemions are episemions","(b) if p and q are episemions, then A"]},{"title":"pq","paragraphs":["is also an episemion. Rule (b) presented as a tree looks as follows:"]},{"title":"(1) P q Pq","paragraphs":["For example:"]},{"title":"(2)","paragraphs":["A~I3 The episemion A0~ may be interpreted as the category of one-place predicates (i.e. the function which maps terms into sentences), for example"]},{"title":"burn, arrive, sleep, stay","paragraphs":["etc.","(3) 0~ 0c A0c~ The episemion A0~0~ may be interpreted as the category of term identitiers (i.e. the function which maps terms into terms), for example"]},{"title":"big, good, John's, burning","paragraphs":["(in"]},{"title":"burning eyes, burning house)","paragraphs":["etc.","(4) ~ A0c[3 A~A~[3 The episemion A0cA~[3 may be interpreted as the category of two-place predicates (i.e. the function which maps terms into one-place predicates or, in other words, the function which maps two terms into sentences), for example"]},{"title":"read, see, expect, like","paragraphs":["etc. -% FORMAL METALANGUAGE AND FORMAL TItEORY 65"]},{"title":"(s)","paragraphs":["The episemion AA~130c may be interpreted as the category of depredicators (i.e. the function which maps one-place predicates into terms), for example"]},{"title":"-al (in'arrival), -ation","paragraphs":["(in"]},{"title":"relaxation)","paragraphs":["etc. (6) ~ Aoc~ The episemion A~A,~ may be interpreted as the category of denominative adjectivisers (i.e. the function which maps terms into term identifiers), for example -y (in"]},{"title":"stony path), -less","paragraphs":["(in"]},{"title":"heartless man), 's","paragraphs":["(in"]},{"title":"John's house), of","paragraphs":["(in"]},{"title":"the house of John)","paragraphs":["etc. (7) a~ A~ The episemion AA0~A~ may be interpreted as the category of adjectivising depredicators (i.e. the function which maps one-place predicates into term identifiers), for example"]},{"title":"-ing","paragraphs":["(in"]},{"title":"burning house), -7 (sleepy child)","paragraphs":["etc. 2. V s is the lexicon of symbols whose denotata are elementary meanings. These symbols are called elementary semions. For example","T - an elementary semion which is interpreted as an object belonging to the category of terms. P1 - an elementary semion interpreted as an object belonging to the category of one-place predicates. P~ - an elementary semion interpreted as an object belonging to the category of two-place predicates. A - an elementary semion interpreted as an object belonging to the category of term identifiers. D r - an elementary semion interpreted as an object belonging to the category of depredicators. Da - an elementary semion interpreted as an object belonging to the category of adjectivizing depredicators. +, 66 SEBASTIAN K. ~AUMJAN- P. A. SOBOLEVA"]},{"title":"Sfa -","paragraphs":["an elementary semion interpreted as an object belonging to the category of denominative adjectivisers etc.","3. F is a so-called assignment function which places each elementary semion in correspondence with one or several episemions. The work of the assignment function may be represented by the formula"]},{"title":"eX","paragraphs":["where e is any episemion and X is a semion with which it has been placed in correspondence, for example","0~T A~ P1","A~A~ P2 Aoco~ A Aoc~o~ D r","AA~SA~ DA"]},{"title":"A~A~ Sfa","paragraphs":["etc. 4. R - are rules for constructing combinations of elementary se-","mions which are called semions. These rules are as follows: (a) an elementary semion is a semion; (b) if X is a semion which belongs to the episemion A"]},{"title":"pq,","paragraphs":["and Y is a semion, belonging to the episemion p, then"]},{"title":"(XY)","paragraphs":["is a semion,","belonging to the episemion q. Rule (b) presented as a tree looks as follows:"]},{"title":"(8) pY q(xr)","paragraphs":["We shall call X an operator, Y - an operand, and"]},{"title":"(XY)","paragraphs":["is the result of application of X to Y. P,.ule (b) is called the rule of application of semions. Ikule (b) can be illustrated in the following way:","(9) A~Px 0cT (P1 T) If P1 is interpreted as"]},{"title":"stay","paragraphs":["and T as"]},{"title":"John","paragraphs":["then the semion P1 T is interpreted as the sentence"]},{"title":"John stays.","paragraphs":["(Note that in the abstract operator language the operator always precedes the operand. So a natural lan-FORMAL NLETALANGUAGE AND FORMAL THEORY 67 guage analogue of the semion/2, T is"]},{"title":"stays John","paragraphs":["rather than"]},{"title":"John stays).","paragraphs":["Below are given several more illustrations of rule (b):","A~0c~10~,Da A0C~Px (10) Aococ (DAP~) oct"]},{"title":"oc((DAP~)T)","paragraphs":["If the elementary semion"]},{"title":"DA","paragraphs":["is interpreted as"]},{"title":"-ing, Pz","paragraphs":["as"]},{"title":"burn","paragraphs":["(intr.), then the semion"]},{"title":"DAP1","paragraphs":["is interpreted as"]},{"title":"burning.","paragraphs":["If T is interpreted as"]},{"title":"house,","paragraphs":["then the semion"]},{"title":"((DAP1)T)","paragraphs":["is interpreted as"]},{"title":"burning house.","paragraphs":["(The exact order of elements being"]},{"title":"((-ing burn) house)). AocAococSf~ ocT","paragraphs":["Aoc~ocD T"]},{"title":"Aoc~P1","paragraphs":["(11)"]},{"title":"Aococ(SfAT) oc(DrP~) oc ( (SL T) (DrP~))","paragraphs":["If"]},{"title":"Sfa","paragraphs":["is interpreted as 's, T - as"]},{"title":"John,","paragraphs":["then"]},{"title":"Sf,~ T","paragraphs":["corresponds to"]},{"title":"John's.","paragraphs":["If"]},{"title":"D r","paragraphs":["is interpreted as"]},{"title":"-al, Px -","paragraphs":["as"]},{"title":"arrive,","paragraphs":["then"]},{"title":"DrPI","paragraphs":["corresponds to"]},{"title":"arrival.","paragraphs":["The derived semion"]},{"title":"((Sf.4 T) (DTP))serves","paragraphs":["as a genotype analogue of the noun phrase"]},{"title":"John's arrival","paragraphs":["(the exact order of elements being (('s"]},{"title":"John) (-al arrive))).","paragraphs":["Such is the grammar which defines the construction of the universal operator language. If an empirical interpretation is assigned to episemions and semions, the universal operator language may serve as a formal metalanguage for the description of any natural language. The universal operator language has sufficient potentialities to construct semions which serve as abstract analogues of sentences of any degree of complexity. By way of an example we shall construct semions which serve as abstract analogues of the following complex phrases:"]},{"title":"I see a burning house","paragraphs":["(12) and"]},{"title":"I expect John's arrival","paragraphs":["(13).","The tree below shows the construction of the genotype analogue of the first phrase:"]},{"title":"A~ (DAp~) ~ T 1","paragraphs":["(12)"]},{"title":"AocAoc~P~ oc ( (DAP1) T ~) Aoc~(P~((D~Pz)Tz)) ocT 2 ~((P~((DaPI)T~))T 2)","paragraphs":["68 SEBASTIAN K. SAUMJAN- P. A. SOBOLEVA The final semion ((P2 ((DaP1) 7\"i)) T ~) which is an object belonging to the category of[3, i.e. sentence, is an abstract analogue of a two-place predicate sentence with a participle defining one of its terms. The construction of the second semion is shown below:"]},{"title":"A~A~Sfa ~ T 1 AA~f3o~Dr A~3P1 Ao~o~(SfA T ~) o~(DrP~) (13) T1)(DTP )) A~(Pz((SfAT~)(DrPI)) ) ~W 2 ~ (P, ( ( Sfa T~) (DrP1) ) T *)","paragraphs":["The final semion"]},{"title":"P,((SfAT' ) (DrP,))T ~","paragraphs":["which also belongs to the category of [~, i.e. sentence, is an abstract analogue of a two-place predicate sentence with a nominalized phrase as one of its arguments.","However complex the constructed semion may be, the process of construction fails to show how two primitive structures of the type"]},{"title":"I see a house","paragraphs":["and"]},{"title":"The house is burning","paragraphs":["are transformed into (12), the second becoming a participial phrase in (12), or how two primitive structures of the type"]},{"title":"I expect smth.","paragraphs":["and"]},{"title":"John is arriving","paragraphs":["are transformed into (13), the second becoming a nominalized phrase in (13).","Though the construction of semions accounts for the generation of the abstract analogues of sentences of any degree of complexity it does not aim to show such essential grammatical processes as nominalization or adjectivation of phrases, formation of complex predicates from simple ones or of simple sentences from complex sentences etc. So in spite of the abstract character of the universal operator language it does not allow us to rise above the level of taxonomic description of natural languages.","The necessity for the formal theory of natural languages follows from the two-level principle in linguistic studies. According to the two-level principle every natural language is stratified into two languages: the phenotype language and the genotype language. The phenotype language is a natural language as is given in immediate observation. The genotype language is hidden, not given in immediate observation; it is a construct language which consists of two sub-lan= guages: the basic genotype language and the derived genotype language. The basic genotype language is the language of thought representation; the expressions of the basic genotype language which consist of elementary predicates may be identified with the thoughts which are to be embodied into a linguistic form. The embodiment FORMAL METALANGUAGE AND FORMAL THEORY 69 of thoughts into a lingustic form is effected in two stages. At the first stage the expressions of the basic genotype language, which are identified with thoughts, are transformed into the expressions of the derived genotype language, regarded as abstract linguistic forms which embody thoughts. At the second stage the expressions of the derived genotype language are transformed into the expressions of the phenotype language regarded as the concrete linguistic forms of thought embodiment. Thus, the derived genotype language may be considered as an intermediary language between the basic genotype language and the phenotype language.","The transformations used to convert phrases of the basis genotype language into phrases of the derived genotype language may be describ-ed with the help of logical operators called combinators. I","Since natural languages serve the purpose of communication between people, the grammar of every natural languages must possess the means for the transformation of thoughts into linguistic forms and, vice-versa, the means for the transformation Of linguistic forms into thoughts.","Grammar viewed in such a way is a hypothetic transducer, which is not given in immediate observation, but which makes it possible to transform the phrases of the basic genotype languages into the phrases of the derived genotype language, and the phrases of the derived genotype language into the phrases of the phenotype language, and viceversa, the phrases of the phenotype language into the phrases of the derived genotype language, as well as the phrases of the derived genotype language into the phrases of the basic genotype language.","The formal theory of natural languages must use the universal operator language as a formal metalanguage for a description of the basic genotype language, the derived genotype language and the phenotype language.","Below we shall specify the type of rules for .postulating the basic genotype language and the type of rules for obtaining the derived genotype language. The basic genotype language consists of one-, two-and three-place predicates obtained through the rule: (14)"]},{"title":"S ~ I CJ P3 T~gT* 1","paragraphs":["x See. S. K. ~AUMJAN (1971), pp. 127-133. 70 SEBASTIAN K. SAUMJAN- P. A. SOBOLEVA","In (14) S is a global symbol of sentence, i.e. a semion belonging to the category ~. /91 in (14) is a one-place predicate with a sentence as its argument. Its episemion is A~. P2 is a two-place predicate with a sentence and a term as its arguments. Its episemion is A~A.0~. P3 is a three-place predicate with a sentence and two terms as its arguments. The episemion ascribed to it is A0~/X~A~."]},{"title":"Cj","paragraphs":["is a two-place operator of conjunction with sentences as its arguments. Its episemion is A~A[5~.","is a sentence which is an argument of P1, P2 and P3 (an embedded sentence). Its episemion is ~. The status of T has been discussed on page 65. It is an object belonging to the category of terms. In (14) it is an argument of P1, P~ and P3~ ~'","The one-place predicate P1 corresponds to modal words in natural languages, such as"]},{"title":"possibly, probably, perhaps","paragraphs":["etc. It may also correspond to aspectual words, such as"]},{"title":"begin, continue, stop.","paragraphs":["The two-place predicate P2 corresponds to volitive predicates such as"]},{"title":"wish, want, like, dislike, hate","paragraphs":["etc., emotive predicates such as"]},{"title":"amuse, upset, distress, intimidate,","paragraphs":["etc., mental perception predicates, such as"]},{"title":"know, expect, think, believe","paragraphs":["etc., P~ may also correspond to some other classes of predicates which we shall omit for lack of space. The common feature which brings together these predicates is their status of two-place operators: applied to an embedded sentence and then to a noun-phrase they yield a sentence. For example:"]},{"title":"want (come John) I, believe (come Mary) Nick.","paragraphs":["The three-place predicate Ps corresponds to causative and communicative verbs such as"]},{"title":"order, persuade, say, tell, beg, implore.","paragraphs":["For example:"]},{"title":"order man (open fire man) qff~cer, tell John (come Mary) Nick.","paragraphs":["The above illustration of the two- and three-place predicates is given in the so-called hybrid language. The hybrid language is also a formal operator language. It answers the description given on pp. 63-66 except for the composition of"]},{"title":"Vs.","paragraphs":["If in the operator metalanguage proper"]},{"title":"V s","paragraphs":["is the lexicon of symbols whose deaotata are elementary meanings called elementary semions (predicates, terms), in the hybrid language the role of semions is played by the lexical stems of a concrete natural language. As a result a mixed language is obtained. Its grammatical component is the applicative grammar, and its lexical component is constituted by the lexical items of a concrete language. 3","The embedded sentence ,~ in (14) is rewritten as either a one-place For greater detail see S. K."]},{"title":"~AUMJAI~I","paragraphs":["(1971), pp. 137-139. 8 See S. K. ~AUMJN̂ (1971), pp. 134-135. FORMAL METALANGUAGE AND FORMAL THEORY 71 or a two-place predicate of the type/51 T, 152 7'1 T 2, where/5~ and/52 are predicates with terms as their arguments (rather than embedded sentences as in case of/)1, P2 and P3 in (14)) or as predicates, such as in (14):"]},{"title":"/5 r","paragraphs":["/32TI T~","(15) S --->. PI~ P2ST P~ T~ g T~"]},{"title":"cjg","paragraphs":["If the names of the predicates: modal Md, aspective As, volitive VI, mental perception Mr, causative Ca and communicative Cm are introduced in the genotype language as constants which are substituted for the variables/)1, P2 and P3 as in (16)-(18): (16) P'~ As"]},{"title":"(17) Ps","paragraphs":["-~ Em Mt"]},{"title":"(,8, lCalcm","paragraphs":["a great variety of sentences can be obtained which constitute an essential part of the basic genotype language.","For example, a basic genotype language sentence (19) Md(Mt(/51TI)T \") is obtained by rule (14), a double application of rule (15), rules (16) and (17). It may be interpreted as Perhaps, you think she is wrong. A basic genotype language sentence"]},{"title":"(20)","paragraphs":["CaT~(CaT~(/5~ T~T')T~)T4 is obtained by rule (14), a double application of rule (15) and rule (18). It may be interpreted as Jane 4 persuaded Mary x (that) Mary 1 order the pupils ~ (that) pupils~ work in the garden 3. 72 SEBASTIAN K. \"SAUMJAN-P. A. SOBOLEVA","Note 1. The identical indices of the terms point to the identity of the object of causation and the subject of the situation caused.","Note 2. R.ules (14) - (18) are but a possible example of the generative rules of the basic genotype language.","By applying the rules of derivation to the basic genotype language we obtain the derived genotype language which includes basic and derived genotype sentences.","In the process of derivation an essential role is played by the combinators or operators on functions. 4","The combinators may be also called transformational operators.","In the derivations considered below we shall use the following combinators:","B - the compositor of functions. It composes the predicates of the matrix and the embedded sentences (Cp. \"predicate -raising \" in the transformational grammar).","The combinator B as well as the other combinators may be applied both to basic and derived genotype sentences according to the rule (21) X(YZ) --* BXYZ where X is the predicate of the matrix sentence, Y is the predicate of the embedded sentence, and BXY is a complex predicate with Z as its argument.","For example (22) Md(.PT)--+ BMd_~T illustrated in the hybrid language as Perhaps (come John) -+ B may come John and interpreted as Perhaps, John will come -+ John may •come The Compositor B is als0 used for Simulating 5 Such transformations as I expect John •will come -+ ! expect John to come","On the combinators see H. B. CURRY (1958), p. 153; H. B. CURRY (1963), p. 118. See also S. K. ~AUMJAN (1971). b The role of combinators in simulating transformations and obtaining semantic fields is discussed in S. K. ~AUMJAN and P. A. SOBOLEVA (1973). FORMAL. METALANGUAGE AND FORMAL THEORY 73 L -, the confluentor of functions with identicalarguments: (23) XZ (YZ) ~ LXYZ where X is the predicate of the matrix, Y - of the embedded sentence, and Z is the identical argument of both sentences, for example:"]},{"title":"(24)","paragraphs":["CaTI(~I T' )T ~ -+ LCa151T1T 2 which simulates the transformation of causation:","* Mary persuaded John, John came Mary persuaded John to come","The combinator L fulfils the function, analogical to \"predicate-raising \", \"subject-raising \", and \"equi-NP-deletion \", applied simultaneously.","W- the duplicator, which, applied to a function with two identical arguments,, deletes one of them, turning a two-place function into a one-place function: (25) . XYY --+ WXY","Rule (25) is used in the process of deriving genotype analogues of subjective infinitives, for example (26) • VI(15T1)T 1 -~ BVliST~T ~ ~ W(BVL iS)T ~ illustrated in the hybrid language as","like (sing John 1) John 1 ~ B like sing John 1 John 1 W(B like sing) John ~ and interprete d as","* John likes, John sings ~ * john likes John to sing ~ John likes to sing Cv - the converter of arguments: (27) XZY -~ CvXYZ 74 SEBASTIAN K. SAUMJAN- P. A. SOBOLEVA where X is the predicate, Y and Z are its arguments. The derivation with the help of Cv is analogous to the transformations\" flip\" (\" psychmovement \") and passivization (see foot-note 5).","K~ - the operator of introducing a dummy argument: (28) K~ VZXY 1","VXY ~ Ks VXZY K, VXYZ where V is the predicate, X and Y are its arguments and Z is a dummy argument introduced either immediately after V (if/£1 is applied), or after X or Y (if Ks and/£3 are applied correspondingly), for example (29) VI(/3T')T2 -+ K1 VL To(#TI)T s which may be interpreted as * I like, John sings -+ I like it (that)John sings The operator K may be used to model the derivation of various it-constructions in English. The combination of K~ and Cv is similar in effect to extraposition.","U- the operator which exchanges the roles of the function and its argument: (30) XY ~ UYX The application of this operator will be illustrated later. The combinator U is used in the process of the derivation of the genotype analogues of verbal nouns, gerundial phrases and cleft sentences.","H - the operator which, applied to a predicate of P~ (i = 1, 2, 3) type changes it into a predicate of/3 type by nominalizing an embedded sentence, for example","(31) PST ~ H/3(Rr S)T t which may be interpreted e.g. as I believe John will come ~ I believe that John will come","The operator R~ is a nominalizer belonging to the category A~ and interpreted as that or a complex of morphemes prep...'s...-ing, for example FORMAL METALANGUAGE AND FORMAL THEORY 75"]},{"title":"(32) Em (iST~T2)T 8 ---> HEm(R r (DT~T~))T s","paragraphs":["which may be given an interpretation of"]},{"title":"* John is amused, Harry plays the piano John is amused at Harry's playing the piano","paragraphs":["Several more combinators are used in applicative generative grammar but we shall not dwell upon them here. For lack of space we shall also omit their categorial status.:","Besides the combinatory derivation rules there are rules of a different kind, such as relativization, pronominalization and some others. Here we shall give the rule of relativization: (33)"]},{"title":"cj z(R (xr)r)","paragraphs":["Where X is the predicate of the first conjoint sentence, Z - the predicate of the second conjoint sentence and Y is the identical argument of both X and Z. iRA is the operator of relativization, a semion belonging to the category Al3A0~0~. The full notation of the relativizer is At3A,0~ Ra. The notation shows that R~ is the operator which applied• to a sentence, maps it into a term identifier. The interpretation of (33) is ungrammatical for English and further derivation rules are necessary to obtain the analogues of complex sentences with relative clauses or with participial phrases.","Now we have sufficient means at our disposal to obtain the genotype analogues of (12) and (13) as well as of other complex constructions with all kind of complements.","The analogue of (12) is obtained from the basic genotype sentence"]},{"title":"Cj (~1 TI) (~ T1 T~)","paragraphs":["by applying the rule of relativization and two combinatory rules with the compositor B and duplicator W. Below the steps of the derivation are given in a column: (34) 2.-b2(R~(-b'T1)T')T2"]},{"title":"3. [)~(BRAP'T'T')T ~ 4. J52(W(BRA~)T~)T~","paragraphs":["e A different way of deriving gerundial structures with the help of the combinator U is discussed in S. K. ~AUMJ,tW and P. A. SO~OL~.VA (1973). 76 SEBASTIAN K. SAUMJAN- P. A. SOBOLEVA For the sake of clarity, derivation (34) may be repeated in the terms of the so-called hybrid language, i.e. a language the grammatical component of which is formed by applicative grammar and the lexical component - by the lexical items of a concrete natural language, such as English, for example:"]},{"title":"(35)","paragraphs":["1. Cj (burn house) (see house I) 2. see(Ra(burn house) house) I 3. see(BRa burn house house) I 4. see(W(BR a burn) house) I The basic structure in (34) and (35) is interpreted as a semigrammatical sentence * i see a house and the house is burning. The second line cannot be given a grammatical interpretation, it roughly corresponds to a hypothetical sentence * I see the house is burning, a house The third line is obtained as a result of the application of the compositor B to the operator RA and after that of BR a to p1, yielding a complex function BRAP ~. This complex function has two identical arguments T 1 and T 1. If the first argument is pronominalized (we omit the rule here) then the third line can be given a grammatical interpretation: I see a house which is burning The fourth step of the derivation consists in the application of the duplicator W which eliminates one of the identical terms, thus yielding a genotype analogue of (12), i.e. I see a burning house.","The derived structure (13) is_ obtained, also in four steps, the basic sentence being Mt(P~ T 1) T ~. See the derivation below: 1. Mt(I51T1)T ~ \" \"","(36) 2. HMt(Rr(15\" T*))T ~ 3. HMt(BP.JS~T~)T ' 4. HMt(UTIBRflS)T ~ .... FORMAL METALANGUAGE AND FORMAL THEORY"]},{"title":"77","paragraphs":["In terms of the hybrid language (36) is presented as follows:"]},{"title":"1. expect (arrive John) I","paragraphs":["(37)"]},{"title":"2. H expect (R~.(arrive John)) I 3. H expect (BR T arrive John) I 4. H expect (U John BR r arrive) I","paragraphs":["Rr is the nominalizing operator with the episemion A~ i.e. R r is the operator which, being applied to a sentence, maps it into a term. The categorial status of H here is AA~A~[3A0~A0c~ i.e. H is the operator which changes a two-place predicate with an embedded sentence and a term into a two-place predicate with two terms as its arguments.","The first line of derivation (37) is interpreted as"]},{"title":"I expect John is arriving","paragraphs":["The second line may correspond to a sentence of the type"]},{"title":"I expect that John is arriving.","paragraphs":["The third line cannot be given a grammatical interpretation. Here the combinator B composes the functions"]},{"title":"Rr","paragraphs":["and P producing a composite function"]},{"title":"BRrP","paragraphs":["roughly corresponding to a verbal noun of the"]},{"title":"arrival","paragraphs":["type. To make the interpretation grammatical the combinator U is applied at the fourth step, turning T into a function and"]},{"title":"BRrP","paragraphs":["into its argument. The fourth line may be interpreted then as (13) i.e. the sentence"]},{"title":"I expect John's arrival.","paragraphs":["If we now compare the two possible ways of obtaining the genotype analogues of (12) and (13) we shall see that applicative grammar provides us with the means of simulating natural languages both at the surface level - taxonomic description - and at the deep level. The application of derivation rules to the sentences of the basic genotype lfinguage simulates the process of transforming the deep semantic representation of sentences into their surface images.","we shall now attempt to show how the application of different sets of derivation rules to one and the same basic genotype sentence generates a bundle of the derived genotype sentences which may be interpreted as a semantic field of phrases. Let us take several sentences with the emotive verb"]},{"title":"please","paragraphs":["and obtain their genotype analogues. The sentences are: (38)"]},{"title":"Mary is pleased that she found the dictionary","paragraphs":["(39) ?"]},{"title":"That She found the dictionary pleased Mary","paragraphs":["78",",¢ SEBASTIAN K. SAUMJAN- P. A. SOBOLEVA"]},{"title":"{4o) (41) (42) It pleased Mary that she found the dictionary Mary is pleased to find the dictionary It pleased Mary to find the dictionary","paragraphs":["The genotype analogues of (38) - (42) are obtained from the basic genotype sentence (43)"]},{"title":"Em (_PTx T=)T =","paragraphs":["as a result of applying the derivation rules with the combinators discussed above, their choice and order differing in each particular case.","The genotype analogue of (38) 7 is obtained as a result of the application of derivation rule (31). See (44) (below the derivations are given in columns, the first line being a basic sentence i.e. the sentence of the zero degree of derivation). (44) 1."]},{"title":"Em(.PT* T 2) T 2 2. HEm(Rr(_PTIT=)T 2)","paragraphs":["The genotype analogue of (39) is obtained as a result of the applications of rules (31) and (27). See (45) (45)"]},{"title":"1. Em(_PT~T2)T 2 2. HEm(Rr(iST*T=))T ~ 3. Cv,2(HEm)T~(Rr(!3T'T=))","paragraphs":["In derivation (45) the combinator of conversion"]},{"title":"Cv","paragraphs":["is applied to the result of derivation (44) which changes the places of the term and the embedded sentence, yielding the derived structure with a nominalized embedded sentence as its final argument (interpreted as the subject) (Cp. \"Flip \" or\" psych-movement\" in transformational gram-1Tlar).","The genotype analogue of (40) is obtained as a result of four rules -(31), (28), (27). See (46)"]},{"title":"1. Em(~T1T~)T ~","paragraphs":["(46) 2."]},{"title":"HEm(Rr(~T'T~))T ~ 3. K(HEm)T.(R ( TIT2))T, 4. Cvla(K(HEm))T\"(Rr(-~TI T2)T=)To","paragraphs":["7 We do not touch upon the problem of pronominalization. This problem is discussed in the papers S. K. ~AUMJAN (1971) and S. K. St, uM.l,~a,q P. A. SOBOt~VA (1973). FORMAL METALANGUAGE AND FORMAL THEORY 79 We shall illustrate derivation (46) in the hybrid language. See (47): (47)"]},{"title":"1. please (find dictionary Mary) Mary 2. H please (that (find dictionary Mary)) Mary 3. K(H please) it (that (find dictionary Mary)) Mary 4. CvI3(K(H please))Mary (that (find dictionary Mary)) it","paragraphs":["The first line i.e. the basic sentence, is interpreted as"]},{"title":"* Mary is pleased Mary (she) found the dictionary","paragraphs":["The second line is interpreted as (38). The third line, obtained after the introduction of the dummy ar-","gument"]},{"title":"it","paragraphs":["is interpreted as an ungrammatical sentence"]},{"title":"* Mary is pleased (about) it that she found the dictionary'","paragraphs":["The fourth line, in which the combinator"]},{"title":"Cv13","paragraphs":["changes the places","of the first and the third arguments gives the analogues of (40) (Cp \" extraposition \" and \"flip \"). The genotype analogue of (41) is obtained as a result of two rules -"]},{"title":"(21) and (25). See (48)","paragraphs":["(48)"]},{"title":"1. Em(PTxT~)T 2 2. BEm(PT1)T2T ~ 3. W ((BErn)","paragraphs":["(~V))T 2 Derivation (48) is illustrated in the hybrid language. See (49):"]},{"title":"(49) 1. please (find dictionary Mary)Mary 2. B please (find dictionary) Mary Mary 3. W((B please) (find dictionary) Mary","paragraphs":["In the second line the combinator B composes the predicates"]},{"title":"Eraplease","paragraphs":["and"]},{"title":"~Tl-find dictionary.","paragraphs":["The complex predicate"]},{"title":"BErn (~T ~)","paragraphs":["is interpreted as an infinitive complex"]},{"title":"is pleased to find the dictionary","paragraphs":["(Cp. \"predicate raising \"). In the third line the combinator W deletes the identical terms"]},{"title":"T~ Mary,","paragraphs":["yielding (41). The analogue of (42) is obtained in five steps: to derivation (48)","two more lines are added (rules (28) and (27)). See (50): 80 SEBASTIAN K. SAUMJAN- P. A. SOBOLEVA"]},{"title":"(50) 4. K(W((BEm) (.~T')))ToT2 5. Cv,3(K(W((B~m) (~rl))))r, To","paragraphs":["The set of derivations from the basic sentence (43) may be shown in the tree below. See (51):"]},{"title":"(51)","paragraphs":["EmST • H B","Cvi~ (38) (39)~"]},{"title":"(*)~","paragraphs":["CIJl8"]},{"title":"(4o) (*)","paragraphs":["W"]},{"title":"(41)","paragraphs":["K"]},{"title":"(*)","paragraphs":["CI,123"]},{"title":"(42)","paragraphs":["At the root of the tree we have a basic genotype sentence. The lines indicate the combinators which are applied to the basic or derived sentences in our derivations. The numbers (38) - (42) refer to the sentences which interpret the derived genotype sentences, (*) denotes the absence of\" a grammatical interpretation in English. Similar trees of derivation may be drawn for other basic sentences of the genotype language.","Examples of such trees for the basic sentences MdS, Asg, MtST, VI~T, CaTI~T ~ and CmTI~T 2 may be found in the paper of S. K. ~AUMJAN and P. A. SOBOrEVA (1973).","The basic genotype sentence at the root of the tree may be understood as a generalized semantic representation, which we call a standard macrosituation. The derived genotype sentences at the other nodes are semantic representations called derived macrosituati0ns. Interpretations (38) - (42) are concrete semantic representations called microsituations.","The\" tree in (51) may be regarded as a possible scheme of derivation FORMAL METAI, ANGUAGE AND FORMAL THEORY 81 of the emotive semantic field in English mapped into the genotype language.","The purpose of (34) - (49) was to show that the combinators may be used to form a unified system of derivations necessary for the construction of the derived genotype language. In (38) - (49) the genotype sentences werederived from one and the same basic genotype sentence, differing from each other only in the choice, number and order Of application of the combinators. Hence, the possibility of simulating the hierarchical organisation of grammatical synonymy as well as the process of embodying thought in linguistic forms.","Let us now turn to the definition of formal theories of natural languages.","The formal theory of natural languages is a formal system which distinguishes between the following components:","1. The basic genotype language is defined by the schemes of sentences serving as semantic representations. Each semantic representation corresponds to a definite situation. Semantic representations are formed from elementary semions. Elementary semions are interpreted as elementary meaning units. Only two types of elementary semions are allowed - elementary predicates and elementary terms - and.two types of sentences: 1) sentences with one-, two- and three-place elementary predicates and an embedded sentence as one of their arguments, 2) sentences which consist of sentences connected by means of a conjunctor.","2. The rules of derivation of the derived genotype language sentences from the sentences of the basic genotype language. The sentences of the basic genotype language are regarded as the sentences of the zero degree of derivation, hence the basic genotype language is regarded as part of the derived genotype language which is a sum of the zero degree of derivation sentences. E~)ery rule of derivation of the derived genotype language sentences is a substitution of some expression containing combinators applied to the elementarypredicates instead of some expression of the basic genotype language. The rules of derivation of the derived genotype language may be called combinatory rules because they consist in the substitution of the expressions with the various types of combinators applied to elementary predicates in place of the basic genotype language expressions.","3. The rules of derivation of phenotype language sentences from sentences of the derived genotype language. These rules may be called phenotype rules. Every phenotype rule is a substitution of: a) a certain 82","V SEBASTIAN K. SAUMJAN-P. A. SOBOLEVA expression comprising phenotype semions into a certain expression of the derived genotype language. Or: b) into a certain phrase obtained according to (a). The phenotype rules meet the requirement according to which any application of the phenotype rule must not break the applicative structure of the sentence. Sentences obtained as a result of the application of the phenotype rules are called phenotype sentences.","4. The rules of linear transformations.","In the genotype language expressions have a standard linear structure: an operator precedes its operand. This standard structure is retained by the phenotype sentences. The aim of linear transformations is to convert the standard structure into a linear structure characteristic of the sentences of the corresponding natural language.","The rules of linear transformations are based on the use of two combinators of permutations. The use of the permutation combinators is interesting from the typological point of view, since the standard linear structure may be regarded as a typological standard, the derivation from which may be accounted for by different sets of permutation combinators.","5. Morpho - phonological rules.","Morpho - phonological rules consist in the substitution of either phonological strings instead of phenotype expressions, or of some phonological strings instead of other phonological strings.","In accordance with the components of the formal theory of natural languages considered above the scheme of deduction in this theory looks as follows: G1 .... , G,F1, ..., FmL1, ..., Lp01 ..... Oq G1 is a sentence of the basic genotype language. G, is a sentence of the derived genotype language. In case n = 1, G~ is a sentence of the zero degree of derivation. F1 is the initial sentence of the phenotype component. F,~ is the final sentence of the phenotype component. L1 is a sentence obtained at the first step of the application of the linear transformational rules. Lp is a sentence obtained at the final step of the linear transformation rules.","O1 a morpho-phonological representation of the sentence obtained at the first step and Oq - at the last step of the application of the morpho-phonological rules.","The formal theory of natural languages distinguishes between the concept \" macrosituation \" and the concept \" microsituation \". A mac-FORMAL METALANGUAGE AND FORMAL THEORY 83 ros~tuation is an abstract situation at the level of generalized semantic representation. The microsituations pertaining to the given macrosituations are its various interpretations at the level of concrete semantic representations. An example of an \" emotive\" macrosituation: \"An animate passive subject (patient) experiences an emotion in connection with the action it performed \". This macrosituation may be realized in the following microsituations: Mary is pleased that she found the dictionary, John is upset that he lost the pen, Jane is confused that she upset the cup etc. An example of a causative macrosituation: \" An animate active subject (agent) causes an animate object (patient) to perform an action \" This macrosituation may be realized in the following microsituations: The officer ordered the men to open fire, The mother persuaded her son to take a walk, The teacher makes the pupils work etc.","In connection with the distinction between macro and microsituations we distinguish between two levels of derivation in the formal theory of natural languages: derivations at the level of macrosituations and derivations at the level of microsituations. As to the formal theory of natural languages it must provide for the rules of derivation at the level of macrosituations. The level of microsituation is an interpretative level which is a function of a special component which may be called the dictionary of concrete lexemes. The dictionary of concrete lexemes consists of dictionary entries corresponding to separate concrete lexemes.","Every dictionary entry must contain the necessary grammatical information providing for its inclusion as a concrete semion interpretant of the macrosituation in a derivation set.","In conclusion we shall consider the concept \"semantic fields \". In connection with the semantic field we shall split the concept \"macrosituation\" into the concept \"standard macrosituation \" and \"derived macrosituation \". The standard macrosituation is a semantic representation corresp ondin g to the sentences of the basic g eno typ elan g ua g.e For example Em(iST 1 T ~) T ~ which roughly corresponds to the \"emotive situation\" cited above or CaT 1 (P T~ T ~) T 8 which is very close to the above causative situation. However, the latter can be given a more exact interpretation: \"an animate subject (ager~t) brings pressure to bear on an animate object (patient) and the latter performs an action\"","The derived macrosituation is a semantic representation corresponding to the sentences of the derived genotype language. For example HEm (Rr(i 5 T 1 T~) ) T 2 which exactly corresponds to the above \"emotive\" situation of L Ca(iST2)T ~ T s which exactly corresponds to the 84 SEBASTIAN K. ~AUMJAN- P. A. SOBOLEVA \"causative\" situation in its previous formulation, i.e. \"an animate active subject causes an animate passive object to perform an action\"","In the formal theory of natural languages considered above the semantic field is a bundle of derivations simulating a set of derived macrosituations from a basic genotype language sentence which simulates a standard macrosituation. See (51). The standard and the derived macrosituations are in relations of meaning inclusion.","In accordance with the destination between macro- and microsituations we distinguish between the semantic fields at the level of macrosituations and the semantic fields at the level of microsituations: macrosemantic fields and microsemantic fields. Each macrosemantic field corresponds to a finite set of microsemantic fields which are its interpretations.","On the basis of what has been considered above it is possible to draw the following general conclusions pertaining to any generative grammar.","The term\" generative grammar\" must be understood in two senses: as the grammar of a formal metalanguage used by the formal theory of natural languages and as the formal theory of natural languages proper.","A formal theory of natural languages must be based on the two-level principle which distinguishes between the two levels of abstraction: the phenotype and genotype levels. The genotype level is not given in immediate observation but is postulated as a hypothetical object which is a theoretical construct.","It is necessary to distinguish between the two levels of formal derivation: the level of macrosituations and the level of microsituations. Grammar as a formal theory of natural languages has to do with macrosituations. As to the level of microsituations it has to do with a special dictionary which is compiled for the needs of the generative grammar. REFERENCES","H. B. CURRY, Combinatory logic, vol. 1, Amsterdam, 1958. H. B. CURRY, Foundations of mathematical","logic, New York, 1963. S. K. ~AUMJAN, Genotipi~eskij jasyk i formalnaja semantika, in , Problemy structurnoj linguistiki ~, 1971. S. K. ~AUMJAN, P. A. SOBOtEVa, Komplementacija v aptflicativno j grammatike, in ~ Problemy structurnoj linguistiki ~, 1973."]}]}